[
    {
        "content": "<p>For PACIO Advance Directives we need to be able to capture signers of the document. For the digital signature of the complete document, we are providing a method of capturing the signature outside of the document. However, for people signing the document (Bundle) we have to decide how to capture this. <br>\nThe problem with Provenance seems to be that it requires a target, which is the document it is contained within. This would result in a circular reference (Bundle including a Composition which references a provenance which references the containing bundle). The persons we can capture as Patient, Practitioner, and relatedPerson, but what resources should be used to capture author, witness, and notary signatures, statements, credentials (e.g. date and jurisdiction), and the like? Note that the physical versions of these documents have signatures as part of the document. We are trying to replicate that.</p>",
        "id": 258905843,
        "sender_full_name": "Corey Spears",
        "timestamp": 1635120799
    },
    {
        "content": "<p>If you're signing a document, why would you not use Bundle.signature?  That's a much more natural way to sign it than with a Provenance inside the document.  If you want to sign with Provenance, it needs to be outside the document.</p>",
        "id": 258910097,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635127367
    },
    {
        "content": "<p>Also, if you're capturing a Bundle signature, you don't have to worry about having a 'resource' to indicate the signing entity.</p>",
        "id": 258910121,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635127408
    },
    {
        "content": "<p>That could work. Would we just extend the element with additional information such as the role being played by signing, any necessary credentials, and statements being attested to?</p>",
        "id": 258914645,
        "sender_full_name": "Corey Spears",
        "timestamp": 1635134541
    },
    {
        "content": "<p>I the Bundle.signature element is a datatype Signature, so it has those elements.</p>",
        "id": 258950063,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635164130
    },
    {
        "content": "<p>I see the signature type, which can be used for the role I was mentioning, but I do not see anywhere to place credentials and the specific statement that they are agreeing to (each signer may have a different statement).</p>",
        "id": 258977483,
        "sender_full_name": "Corey Spears",
        "timestamp": 1635176300
    },
    {
        "content": "<p>statement? --- are you referring to the \"meaning of my signature\"? That would be the .type element.</p>",
        "id": 258977699,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635176406
    },
    {
        "content": "<p>can you come to the FHIR-Security call (in 20 minutes) as it might be good for us to understand the use-case and need. This is likely some of the very first \"Trial Use\" that this datatype is receiving, so there might be major changes you might drive.</p>",
        "id": 258977837,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635176490
    },
    {
        "content": "<p><a href=\"https://confluence.hl7.org/display/SEC/2021-10-25+FHIR-Security+Meeting+Agenda\">https://confluence.hl7.org/display/SEC/2021-10-25+FHIR-Security+Meeting+Agenda</a></p>",
        "id": 258977987,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635176550
    },
    {
        "content": "<p>we will likely be discussing a change to Signature datatype that <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> has entered requesting relaxing cardinality.</p>",
        "id": 258978090,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635176602
    },
    {
        "content": "<p>A couple of example:<br>\n<a href=\"/user_uploads/10155/htJV7zO6YZfxEo4jwupDaz-B/image.png\">image.png</a> <br>\n<a href=\"/user_uploads/10155/oWbPvxLVcbd7dI3kozCsR2W1/image.png\">image.png</a> <br>\n<a href=\"/user_uploads/10155/bsNw0n0-xSOfe0Qon6A1_wfr/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/htJV7zO6YZfxEo4jwupDaz-B/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/htJV7zO6YZfxEo4jwupDaz-B/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/10155/oWbPvxLVcbd7dI3kozCsR2W1/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/oWbPvxLVcbd7dI3kozCsR2W1/image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/10155/bsNw0n0-xSOfe0Qon6A1_wfr/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/bsNw0n0-xSOfe0Qon6A1_wfr/image.png\"></a></div>",
        "id": 258987915,
        "sender_full_name": "Corey Spears",
        "timestamp": 1635180860
    },
    {
        "content": "<p>I would expect that each of those might have their own defined Code. That Code when used in a signature has that specific meaning.</p>",
        "id": 258993030,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635183030
    },
    {
        "content": "<p>What is the 'document' in each of those cases?  Some of them seem to be stand-alone statements with no document being necessary.</p>",
        "id": 259003165,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635187641
    },
    {
        "content": "<p>These are narrative statement, so I would not expect them to be codified as they could be unique per form of document. Signature type is of datatype coding, so it would not even be possible to have a text (such as one could use with a CodeableConcept).</p>",
        "id": 259003336,
        "sender_full_name": "Corey Spears",
        "timestamp": 1635187700
    },
    {
        "content": "<p>These are from examples of Living Will and Durable Healthcare Power of Attorney documents. They generally show up at the bottom of the document.<br>\n<a href=\"https://www.wwmedgroup.com/wp-content/uploads/2015/12/advance-directive-forms.pdf\">https://www.wwmedgroup.com/wp-content/uploads/2015/12/advance-directive-forms.pdf</a><br>\n<a href=\"http://depts.washington.edu/hdcoe/wp-content/uploads/2020/04/WSMA-Advance-Directives-July-2019.pdf\">http://depts.washington.edu/hdcoe/wp-content/uploads/2020/04/WSMA-Advance-Directives-July-2019.pdf</a><br>\n<a href=\"https://www.hov.org/media/1112/living-will_forms.pdf\">https://www.hov.org/media/1112/living-will_forms.pdf</a></p>",
        "id": 259003685,
        "sender_full_name": "Corey Spears",
        "timestamp": 1635187880
    },
    {
        "content": "<p>Right, but why do you have a 'document' if all you have is a single statement?</p>",
        "id": 259003935,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635187998
    },
    {
        "content": "<p>I am not sure I follow. Someone is signing the document to represent their interests (the primary content of the document), others are signing that they are a witness (or in some cases signing on behalf of another (such as guardian signing off for the subject). Each signer has a specific statement about their role and what explicitly they are attesting to in that signature.</p>",
        "id": 259005056,
        "sender_full_name": "Corey Spears",
        "timestamp": 1635188532
    },
    {
        "content": "<p>I'm saying that if you have a very short statement, using a FHIR document to represent it is sort of overkill.</p>",
        "id": 259005823,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635188918
    },
    {
        "content": "<p>We are using a document for all of the data of which this is a small part. We don't want a separate document to just represent that statement (a statement which is part of a larger document).</p>",
        "id": 259033301,
        "sender_full_name": "Corey Spears",
        "timestamp": 1635203840
    },
    {
        "content": "<p>Ok, but if all you're signing is the statement, then that's not the same as signing the whole document.  In that case, having the statement as a DocumentReference and a Provenance with the signature sitting inside the document is fully reasonable.</p>",
        "id": 259033843,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635204358
    },
    {
        "content": "<p>I thought those \"statements\" were the meaning of the signature, that the content being signed was the document content. That is why I figured those \"statements\" were actually signature purpose codes.</p>",
        "id": 259079255,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635245557
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>, That seems like a good way to characterize it. The issue we run in to is that each form or instrument can be different and are often times dictated or guided by legal or regulatory requirements. They often can't be codified.  If we had a more open way to express them than a code or set of codes, I think we would be closer.</p>",
        "id": 259091688,
        "sender_full_name": "Corey Spears",
        "timestamp": 1635253101
    },
    {
        "content": "<p>I am unclear on why a code can't be defined for each. You can define codes in your IG, others can define codes within their Domain. Each code does need to be understood by the parties involved... so, yes less codes is better than infinite number of codes. This is why there are a set of signature purpose codes that are very gross but effective.</p>",
        "id": 259092005,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635253222
    },
    {
        "content": "<p>These are not settled scientific concepts. These human created statements written through legislation, regulation, or just because someone thought it was a good idea. There is no agreed upon method, that I know of, that these statement have to follow. Sure, we can say something is an author statement or a witness statement or a notary statement, but we can't codify what that statement says. They are unbounded.</p>",
        "id": 259094965,
        "sender_full_name": "Corey Spears",
        "timestamp": 1635254603
    },
    {
        "content": "<p>It only makes sense as a code on a signature of the document if the all the content in the document is pertinent to text.  If you have a document with three different advanced directives, you can't have signatures at the document level to represent each.</p>",
        "id": 259098058,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635255879
    }
]