[
    {
        "content": "<p>Does FHIR support the ability to lifecycle (or version) a document? Something akin to the way the current regulatory submission standard (eCTD) handles application and document lifecycles.</p>\n<p>For example, in a regulatory context. A pharmaceutical company submits an application to Health Canada containing a document v1.0. During the review process the company wants to submit an updated version of the document (v1.1). v1.1 replaces v1.0. </p>\n<p>document v1.1 has a relationship reference to v1.0 showing that it replaced the older version.</p>",
        "id": 164538363,
        "sender_full_name": "Craig Anderson",
        "timestamp": 1556630728
    },
    {
        "content": "<p>See Composition.relatesTo - specifically the \"replaces\" relationship.</p>",
        "id": 164545231,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556635778
    },
    {
        "content": "<p>Thanks Lloyd, </p>\n<p>After looking at Composition, DocumentManifest and DocumentReference, I suspect they can be used together to replicate the concept of a regulatory application. Generally speaking does that sound reasonable?</p>",
        "id": 164568430,
        "sender_full_name": "Craig Anderson",
        "timestamp": 1556652637
    },
    {
        "content": "<p>DocumentManifest and DocumentReference are usually used separately from Composition.  If you're submitting a document, it's either going to be a FHIR Document, in which case it'll be a Bundle that starts with Composition and then points to all of the other relevant resources that form the 'content' of the document; or it'll be a non-FHIR document in which case the content will be sent as binary information either embedded in or pointed to by DocumentReference.  (DocumentReference can also point to FHIR Documents, but in that case the metadata in the DocumentReference is redundant with what's in the Composition and the DocumentReference is used as an index entry pointing to a document held elsewhere.)  DocumentManifest is primarily used for IHE's Mobile Health Data (MHD) specification, though it could theoretically be used for other purposes.  It might have a place in a regulatory submission</p>",
        "id": 164569120,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556653071
    },
    {
        "content": "<p>Got it. thank you</p>",
        "id": 164828793,
        "sender_full_name": "Craig Anderson",
        "timestamp": 1556916270
    },
    {
        "content": "<p>Has FHIR described any special methods for packaging and exchanging documents as a single file? For example, if the document is made up of a single .xml and five .jpg's. Would they be exchanged as a single package using .zip or would FHIR have a unique .fhir (something akin to the DOCX approach).</p>",
        "id": 186319204,
        "sender_full_name": "Craig Anderson",
        "timestamp": 1579719918
    },
    {
        "content": "<p>The JPGs would typically be embedded in the FHIR Document as Binary resources (which would involve base64-encoding the JPGs).  They would be Bundle entries just like any of the other resources in the document.</p>",
        "id": 186320395,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579720669
    },
    {
        "content": "<p>and that Bundle (of type document) could be indexed and communicated using DocumentReference... as is defined in US-Core and also IHE MHD implementation guide.</p>",
        "id": 186380981,
        "sender_full_name": "John Moehrke",
        "timestamp": 1579780620
    },
    {
        "content": "<p>Right.  If you needed metadata around the JPEG, you can use DocumentReference to convey that</p>",
        "id": 186417828,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579803298
    }
]