[
    {
        "content": "<p>Does anyone have a newer profile of DocumentReference for XDS (XCA)? </p>\n<p>In detail, I'm looking for existing extensions for referencing to a specific document inside a XCA with the use of <em>uniqueId</em>, <em>homeCommunityId</em> and <em>repositoryId</em> (names taken from a DSTU1 XDS profile).</p>",
        "id": 160085486,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1551869761
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 160092428,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551876853
    },
    {
        "content": "<p>IHE has the MHD profile <a href=\"https://wiki.ihe.net/index.php/Mobile_access_to_Health_Documents_(MHD)\" target=\"_blank\" title=\"https://wiki.ihe.net/index.php/Mobile_access_to_Health_Documents_(MHD)\">https://wiki.ihe.net/index.php/Mobile_access_to_Health_Documents_(MHD)</a><br>\nIt has everything one needs for STU3<br>\nIt is about to be updated as adjusted to R4, but the structureDefinitions are a bit delayed due to me waiting for Forge support</p>",
        "id": 160094671,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551878789
    },
    {
        "content": "<p>You will also find a mapping from DocumentReference to XDS in every version of FHIR. <a href=\"http://build.fhir.org/documentreference-mappings.html#xds\" target=\"_blank\" title=\"http://build.fhir.org/documentreference-mappings.html#xds\">http://build.fhir.org/documentreference-mappings.html#xds</a></p>",
        "id": 160094704,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551878829
    },
    {
        "content": "<p>Im happy to give more guidance or answer other questions</p>",
        "id": 160094722,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551878842
    },
    {
        "content": "<p>see <a href=\"https://healthcaresecprivacy.blogspot.com/2018/09/mhd-as-api-to-xca.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2018/09/mhd-as-api-to-xca.html\">https://healthcaresecprivacy.blogspot.com/2018/09/mhd-as-api-to-xca.html</a></p>",
        "id": 160094824,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551878939
    },
    {
        "content": "<p>Thanks. My use case is using DocumentReference as a pointer for where to fetch a (XDS) document, not as a direct interface for a repository. That is the reason why we need a mapping to repositoryId and homeCommunityId as well (\"Here is a list of interesting documents, you can fetch them here and over there\"). </p>\n<p>In an ideal world, maybe DocumentReference.content.Attachment could include an Endpoint when the physical document is somewhere else (not local), but that's maybe too complicated if a XDS capable consumer only needs two additional id's. I guess extensions is the way to go as additional identifiers.</p>",
        "id": 160286742,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1552050064
    },
    {
        "content": "<p>Help me understand how that is not what MHD is defining? The URL is that pull, it does not need to be on the same server. It just needs to be a GET based URL.</p>",
        "id": 160286939,
        "sender_full_name": "John Moehrke",
        "timestamp": 1552050258
    },
    {
        "content": "<p>I think you are reading too much into the abstract actor definitions. A Document Responder is not a system, it is an abstraction. Such as in your case, the responder for queries against DocumentReference can be a totally different system from the Document Responder where all of the documents are.</p>",
        "id": 160287062,
        "sender_full_name": "John Moehrke",
        "timestamp": 1552050385
    },
    {
        "content": "<p>Thinking loud here. The URL in Attachment could point to specific document, cross domain, right? That would be a solution for my problem. In my case, the client would need enough to retreve a specific document from everywhere, either as a query or a direct pointer, regardless of MHD or \"classic\" ITI web services.</p>",
        "id": 160288073,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1552051207
    },
    {
        "content": "<p>Thanks for the help so far - I'm having a new look at ITI-68 over the weekend.</p>",
        "id": 160288498,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1552051519
    },
    {
        "content": "<p>yes, that is the model in MHD. The only requirement is that the DocumentReference attachment url is a GET url. It can't be a soap endpoint.  It could be anywhere. The security model is a systems-design concern, so clients would need to know the right security to access all the potential URL servers.</p>",
        "id": 160288926,
        "sender_full_name": "John Moehrke",
        "timestamp": 1552051830
    }
]