[
    {
        "content": "<p>Health Canada has an ongoing project to transition from unstructured Product Monographs (PDF) to structured Product Monographs using XML, international standards and controlled vocabularies. The Structured Product Monographs (SPM) are based on the HL7 SPL standard. During the course of the project the project team became increasingly aware of HL7’s FHIR standard and it’s future potential. The project scope has since been expanded to investigate the feasibility of using FHIR with regulatory documents.</p>\n<p>In order to expedite our investigation we would appreciate hearing from FHIR community on the potential benefits of a PM on FHIR; real world use cases; and any other considerations related to a future specification for the PM.</p>\n<p>Please feel free to contact the Craig Anderson (HC/SC) <a href=\"mailto:craig.anderson3@canada.ca\" title=\"mailto:craig.anderson3@canada.ca\">craig.anderson3@canada.ca</a> (Structured Content Program, Program Manager) or Peter Bomberg <a href=\"mailto:pbx@soundfound.com\" title=\"mailto:pbx@soundfound.com\">pbx@soundfound.com</a> (Structured Content Program, Technical &amp; Solution Architect)</p>",
        "id": 153961331,
        "sender_full_name": "Peter Bomberg",
        "timestamp": 1526403889
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span></p>",
        "id": 153961356,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526410302
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , hi <span class=\"user-mention\" data-user-id=\"195809\">@Peter Bomberg</span> , <span class=\"user-mention\" data-user-id=\"195616\">@Craig Anderson</span>. EMA (European Medicines Agency) and FDA in the US are exploring the use FHIR for what sounds like similar data. FDA currently uses SPL, and EMA has an existing proprietary XML. We are basing new FHIR resources on the ISO IDMP models, which I assume would cover your monographs. Are you aware of the scope of IDMP, specifically ISO 11615 Medicinal Product? This logical model is being brought into the scope of FHIR, with a current draft here:  <a href=\"http://hl7.org/fhir/2018May/medicinalproduct.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2018May/medicinalproduct.html\">http://hl7.org/fhir/2018May/medicinalproduct.html</a></p>",
        "id": 153961562,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1526462691
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> , yes familiar with the IDMP however the use case is different, IDMP provides a data model that describes the metadata while the regulatory documents are narrative in nature and include both the metadata (IDMP + some related to the regulators that is not directly part of IDMP) as well as textual and graphical information that relates to the metadata but is not captured as metadata.</p>\n<p>That being said I will look at the Medicinal Product draft and comment as it would likely address an issue we have on another document type (which is part of a future implementation phase).</p>",
        "id": 153961813,
        "sender_full_name": "Peter Bomberg",
        "timestamp": 1526472812
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195809\">@Peter Bomberg</span>, ah yes I understand better now thanks. I think this is equivalent to what is done in Europe with eCTD (<a href=\"http://estri.ich.org/\" target=\"_blank\" title=\"http://estri.ich.org/\">http://estri.ich.org/</a> and <a href=\"http://estri.ich.org/new-eCTD/index.htm\" target=\"_blank\" title=\"http://estri.ich.org/new-eCTD/index.htm\">http://estri.ich.org/new-eCTD/index.htm</a>), although that is unstructured. I believe that HL7 RPS was the planned HL7 V3 version of the same. I am not aware of current activity to do that in FHIR. Would definitely be interested to track this work.</p>",
        "id": 153964618,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1527181190
    }
]