[
    {
        "content": "<p>Such a use case is so common in our work and it would remain in a pretty long term.  Therefore, there is a strong demand for ingetion and processing of data captured by OCR from scan images/photos.  Any feasible approach/tooling for such a type of data sources?  Thanks.</p>",
        "id": 218214347,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1606658802
    },
    {
        "content": "<p>Parsing an arbitrary text document and turning it into a FHIR document complete with sections and discrete data would be a hugely impressive technical feat.  The first (and more common) step would just be a DocumentReference with multiple <code>content</code> repetitions - one for the original scanned image and one for the OCR'd text.  You might have a third that tags the data to make some of the statements computable.  Going beyond that to turn the tags into valid populated resources with discrete data is not something I've seen anyone do - and that would really be the only reason to go beyond DocumentReference.</p>",
        "id": 218216793,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606663150
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Appreciate your helpful guidance.<span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span></p>",
        "id": 218235453,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1606691532
    },
    {
        "content": "<p>I would state that even the ability to scan paper and properly fill out the DocumentReference (metadata about the document) would be helpful. What patient? When published? Who authored? where was it authored? what timeframe? what is the clinical purpose of the document? etc... the DocumentReference is made up of useful metadata for finding any kind of document . Finding is sometimes the most important.</p>",
        "id": 218288844,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606744677
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Agree.  But many metadata are hard to  find for such paper-based documents, e.g., when published and who authored as you pointed out.</p>",
        "id": 218292909,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1606746572
    },
    {
        "content": "<p>yes, that is where OCR comes in...   I have heard of some systems that do just this. All they OCR is enough to get these metadata (or as much as they can determine in first page OCR).</p>",
        "id": 218294754,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606747371
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span></p>",
        "id": 218295385,
        "sender_full_name": "René Spronk",
        "timestamp": 1606747617
    }
]