[
    {
        "content": "<p>Hello Everyone, I am not sure I am posting in the right area or even right forum but ....</p>\n<p>In reviewing the MedicinalProductAuthorization resource it appears that there is a single  MedicinalProductAuthorization per medicinalProduct (that makes sense) but within the MedicinalProductAuthorization resource there is a master/global status (and accompanying) elements however since each regulator grants approval within there jurisdiction I wonder if all status related aspects should be moved down to being children of jurisdictionalAuthorization.</p>\n<p>And while I am at it same goes for regulator as its a link to the Medicines Regulatory Agency but the jurisdictionalAuthorization is granted by the regulator so I am confused by it being an independent element at the  same level.</p>\n<p>Actually the more I dig into this resource the more questions I have, can anyone please guide me or care to chat about this resource?</p>",
        "id": 153962263,
        "sender_full_name": "Peter Bomberg",
        "timestamp": 1526506611
    },
    {
        "content": "<p>The resource is still quite draft and may well be significantly refactored before being published for STU use.  Feedback is extremely welcome, but caution should be used before considering use for production purposes.</p>",
        "id": 153962264,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526508230
    },
    {
        "content": "<p>The best way to provide feedback by clicking on the \"Propose a change\" link and submitting change requests, though starting discussion here first is totally ok.</p>",
        "id": 153962265,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526508283
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>\n<p>Thanks and to be honest I have submitted several CR's but in this specific case I am not sure if I am lost/ missing something or if there are legitimate issues so I wanted to get feedback or chat with others to see, is this the right forum or is there a better stream as it's not actually document related it's related to a single or series of FHIR resources.</p>",
        "id": 153962909,
        "sender_full_name": "Peter Bomberg",
        "timestamp": 1526521642
    },
    {
        "content": "<p>This particular stream tends to be predominantly aimed at (and monitored by people who are interested in) generic document discussion and CCDA discussion rather than about the resources documents might point to or more esoteric types of documents like SPL.  You might find broader engagement on the <a class=\"stream\" data-stream-id=\"4\" href=\"/#narrow/stream/4-implementers\">#implementers</a> channel</p>",
        "id": 153962946,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526540343
    }
]