[
    {
        "content": "<p>The patient access implementation guides (US Core and CARIN BB) do not include the $everything operation, so my expectation would be that payer-to-payer exchanges via the patient access API would use standard FHIR searches and not $everything, am I wrong?</p>",
        "id": 253288375,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1631639927
    },
    {
        "content": "<p>CARIN BB does not specify a $everything operation, although there have been discussions as to whether it should. CARIN BB was not included in the payer-to-payer transactions. It has element requirements for dollar amounts that would not be appropriate in a payer to payer interactions. The current expectation is procedure/diagnosis/encounter information would be supported via PDex.</p>",
        "id": 253290996,
        "sender_full_name": "Corey Spears",
        "timestamp": 1631640887
    },
    {
        "content": "<p>I know that the CARIN BB data is different, but patient access API server and client would _not_ use $everything, correct?</p>",
        "id": 253296978,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1631643179
    },
    {
        "content": "<p>So I'd expect the same to be true for payer-to-payer exchange that piggy-back on patient access API - would not make sense to use a completely different transfer system?</p>",
        "id": 253297194,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1631643259
    },
    {
        "content": "<p>Yes, since $everything is not defined for this IG, there is no expectation that a server supporting this IG would support it. It is allowable for servers to define their own operations of course or use operations in support of other IGs.</p>",
        "id": 253337891,
        "sender_full_name": "Corey Spears",
        "timestamp": 1631660949
    },
    {
        "content": "<p>I've been thinking about this -- </p>\n<blockquote>\n<p>CARIN BB was not included in the payer-to-payer transactions. It has element requirements for <strong>dollar amounts that would not be appropriate in a payer to payer interactions</strong>.</p>\n</blockquote>\n<p>Ultimately, any patient-mediated data exchange likely will include the CMS regulated data for patient access, profiled by CARIN BB. The payer would be required to expose \"dollar amounts\" to any app of the patient's choosing, including an app of another payer. How would the old payer know when to expose PDex profiles instead of CARIN profiles to a PDex patient app?</p>",
        "id": 254747560,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632506922
    },
    {
        "content": "<p>Here's how we are thinking we could solve for it <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> <br>\n<a href=\"/user_uploads/10155/bN-_soAWSAoOqKeGtYchL5Bo/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/bN-_soAWSAoOqKeGtYchL5Bo/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/bN-_soAWSAoOqKeGtYchL5Bo/image.png\"></a></div><p>Context here: <a href=\"https://twitter.com/carinalliance/status/1468668478542553090?s=20\">https://twitter.com/carinalliance/status/1468668478542553090?s=20</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/carinalliance/status/1468668478542553090?s=20\"><img class=\"twitter-avatar\" src=\"https://uploads.zulipusercontent.net/81482401d42a7101745b0048f6da577f79e6df09/68747470733a2f2f7062732e7477696d672e636f6d2f70726f66696c655f696d616765732f3835303337333734363535363839313134312f566c45446e5775675f6e6f726d616c2e6a7067\"></a><p><span aria-label=\"siren\" class=\"emoji emoji-1f6a8\" role=\"img\" title=\"siren\">:siren:</span> <a href=\"https://twitter.com/CMSGov\">@CMSGov</a> formally published in the Fed Reg. today their decision 2 exercise enforcement discretion for P2P. <a href=\"https://t.co/Sqddaht0L3\">https://public-inspection.federalregister.gov/2021-26764.pdf?utm_source=federalregister.gov&amp;utm_medium=email&amp;utm_campaign=pi+subscription+mailing+list&amp;source=email</a>\nBUT: \"We continue to encourage impacted payers that have already developed #FHIR #API solutions that support P2P to continue to move forward. .\"<span aria-label=\"clap\" class=\"emoji emoji-1f44f\" role=\"img\" title=\"clap\">:clap:</span></p><span>- The CARIN Alliance (@carinalliance)</span></div></div>",
        "id": 267776717,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1642017042
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> yes, see <a href=\"https://jira.hl7.org/browse/FHIR-35653\">https://jira.hl7.org/browse/FHIR-35653</a> for a variation of that issue. I think we need some custom scopes...</p>",
        "id": 267777757,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1642017508
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> I do not understand how that answer Isaac question?</p>",
        "id": 267777781,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1642017526
    },
    {
        "content": "<p>(at the moment being we are granting patient/ExplanationOfBenefit.read only to patient apps and not to other payers...but that will stop working when we have to give ExplanationOfBenefit to payers as well for prior authorization and claim without $$)</p>",
        "id": 267779105,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1642018131
    },
    {
        "content": "<p>The 'it' was using the Patient Access API approach for doing P2P. I did not address his $everything question since <span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> already commented. It would be helpful to get more clarity around the comment, \"The payer would be required to expose \"dollar amounts\" to any app of the patient's choosing, including an app of another payer. How would the old payer know when to expose PDex profiles instead of CARIN profiles to a PDex patient app?\" <span class=\"user-mention\" data-user-id=\"260046\">@Cille Kissel Watkins</span> should comment here around how payers are approaching P2P using the Patient Access API.</p>",
        "id": 267783098,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1642020096
    },
    {
        "content": "<p>Got it</p>",
        "id": 267783708,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1642020379
    },
    {
        "content": "<p>Agree with what is being said here without choosing to speculate on future CMS requirements. </p>\n<p>In the absence of future rule making by CMS, Humana is approving access to other payers who wish to connect with us via the Patient Access API technology. We will, however, be withholding scopes for patient/ExplanationOfBenefit.read as we are under no obligation to give claims history to our competitors. </p>\n<p>Generally speaking, people aren't exposing PDex and CARIN profiles for the same resource... Not sure what was meant by that or if I read it wrong. </p>\n<p>$everything operations can be used by payer FHIR servers but aren't required. Humana's FHIR server does support this feature. Based on the scopes you are given as a payer client to our servers, we would return everything except EOB data for a $everything operation.</p>",
        "id": 267784445,
        "sender_full_name": "Cille Kissel Watkins",
        "timestamp": 1642020750
    },
    {
        "content": "<blockquote>\n<p>people aren't exposing PDex and CARIN profiles for the same resource</p>\n</blockquote>\n<p>Now both PDex and CARIN are profiling ExplanationOfBenefit, so that will become unavoidable</p>",
        "id": 267785811,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1642021369
    },
    {
        "content": "<p>Not sure I agree with that. Again, pending future rule-making... Just because there are multiple IGs available, doesn't mean implementers will adopt and expose both.</p>",
        "id": 267790649,
        "sender_full_name": "Cille Kissel Watkins",
        "timestamp": 1642023997
    },
    {
        "content": "<p>The intention certainly is that they will - so we should ensure there won't be issues if they choose to (and that there's clear guidance on what things they need to consider if/when they do).</p>",
        "id": 267791855,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642024597
    },
    {
        "content": "<p>Yes, there is an issue: <a href=\"https://jira.hl7.org/browse/FHIR-35653\">https://jira.hl7.org/browse/FHIR-35653</a></p>",
        "id": 267798413,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1642027924
    },
    {
        "content": "<p>(or at least one!)</p>",
        "id": 267798426,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1642027934
    },
    {
        "content": "<p>This is news to us. We worked hard to ensure implementers knew the difference between PDEx and CARIN BB and even included a picture in both IGs regarding how the EOB resource would be handled. <a href=\"https://build.fhir.org/ig/HL7/carin-bb/Background.html#relation-to-other-IGs\">https://build.fhir.org/ig/HL7/carin-bb/Background.html#relation-to-other-IGs</a> We will need to follow-up with the DaVinci team to learn more.</p>",
        "id": 267899880,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1642093859
    },
    {
        "content": "<p>The issue I opened about the multiple uses of ExplanationOfBenefit is being judged non-persuasive (predictably), but without any explanation on how server should handle the resulting conflict <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 269661815,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1643328690
    },
    {
        "content": "<p>If the person receiving the EOB has permission to see financial information, provide it.  If they don't, don't.  Same as any other data elements from any other resources.</p>",
        "id": 269662183,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643328927
    },
    {
        "content": "<p>The issue is that it is the same person doing the request, in one case via a patient app, in the other case from a payer app</p>",
        "id": 269669934,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1643334026
    },
    {
        "content": "<p>If the individual has permission to see the data, they have permission to see the data.  Who owns the app doesn't matter.  If the patient asking for data via a payer app means that the payer sees financial data that the source payer doesn't want them to, I think (based on current regulations), the answer is \"that's too bad for the source payer\".  In theory, patients could band together and publish their EOBs (with financials) for the whole world to search and mine if they feel like it.  That said, I'm not an expert on the regulations.</p>",
        "id": 269682647,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643341396
    },
    {
        "content": "<p>We're really not talking about an individual here. A business is retrieving patient data in order to customize a quote (in theory) to the patient. No insurance company want's to disclose the confidential price structure they pay for services to competitors. So the fact of which company is \"brokering\" the exchange is important to the source payer. A patient access app where the data is being provided to a member (essentially directly), with little risk of it being used for competitive advantage is one thing. But providing bulk data to be mined for contract details to a competitor is different. This ties in with the other conversation of what data to expose in <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a>. In order to comply with laws and business objectives there will need to be a layer that takes into account: Person doing the request, The patient that is the subject, The reason for the request, The intermediary, Consent filings. </p>\n<p>While payers are obligated to share clinical data with other payers, they are not obligated to share business confidential data. So if a payer is not obligated they will not do so. And I don't think \"how much was paid for service\" will ever be categorized as clinical. What this means is that each payer, individually, will come up with a method that \"authorizes\" financial data exchange. Likely limited to when the intermediary is not know to be a competitor.</p>",
        "id": 269732984,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1643375492
    },
    {
        "content": "<p>In terms of patient access, I don't think you're allowed to worry about who the intermediary is.  If the patient wants to use an app created by Elbonian Hackers R Us, they can.  If they want to use an app created by a rival payer, they can.  If it's <em>not</em> patient access, then the disclosing payer can determine what apps they trust and what data consumers they trust to allow sharing at all as well as what filters they want in place.</p>",
        "id": 269748380,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643381948
    },
    {
        "content": "<blockquote>\n<p>then the disclosing payer can determine what apps they trust and what data consumers they trust to allow sharing at all as well as what filters they want in place.</p>\n</blockquote>\n<p>yes, but how? The standard way to do that is using scopes, but there is no scope for '$ data' (or is there?)</p>",
        "id": 269754970,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1643384377
    },
    {
        "content": "<p>Scopes is about what's <em>asked</em> for.  This is about filtering based on who's asking - regardless of what they're asking for.  Data sources are always expected to do that.</p>",
        "id": 269755379,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643384545
    },
    {
        "content": "<p>Again: _who_ is asking is the same user in both cases</p>",
        "id": 269755450,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1643384575
    },
    {
        "content": "<p>But the application that's doing the asking is different</p>",
        "id": 269755505,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643384596
    },
    {
        "content": "<p>What we are doing now is not granting <a href=\"http://ExplanationOfBenefit.read\">ExplanationOfBenefit.read</a> to other payers, but that does not work if ExplanationOfBenefit is used for prior authorization that should be shared with other payers</p>",
        "id": 269755523,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1643384604
    },
    {
        "content": "<p>Yes, and how do you differentiate that? Normally you do that with scopes</p>",
        "id": 269755559,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1643384622
    },
    {
        "content": "<p>Not just scopes.  You might grant <a href=\"http://Patient.read\">Patient.read</a> but choose to strip out Patient.address from a system that's not allowed to see it.  This is the same principle.</p>",
        "id": 269755667,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643384655
    },
    {
        "content": "<p>(So long as it's understood that you're not allowed to strip out the information if the patient is doing the asking.)</p>",
        "id": 269755783,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643384708
    },
    {
        "content": "<p>An access token comes in, it has a user, possibly a patient, a set of scopes, we use that information to filter what we can / cannot return</p>",
        "id": 269756084,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1643384842
    },
    {
        "content": "<p>We could surely add to the token something else that specifies which app it was issued to and then used that information to do some more filtering</p>",
        "id": 269756160,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1643384877
    },
    {
        "content": "<p>But this is all new custom non-standard-SMART stuff</p>",
        "id": 269756227,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1643384890
    },
    {
        "content": "<p>Is this what we should really be doing?</p>",
        "id": 269756265,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1643384914
    },
    {
        "content": "<p>If the user is the patient, then I think by patient access, you need to give them everything - as they have the right to see everything, regardless of what tool they're using.  If the user is someone from a payer, then you filter what they're allowed to see.  You do that <em>regardless</em> of what scopes they ask for.  There's always been a requirement to filter beyond what the scopes allow.  The purpose of the scopes is to give the user control over what the system accesses.  It doesn't allow the user to decide what their own access rights are.</p>",
        "id": 269757202,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643385291
    },
    {
        "content": "<p>These IGs are not going to scale in the real world if they depend on everyone implementing bespoke human-interpreted rules for each IG that depend on the user, the app, the stated reason for access, any intermediaries involved, and the requested scopes. We need to standardize on computable rules that can be evaluated by general purpose implementations.</p>",
        "id": 269768273,
        "sender_full_name": "Paul Church",
        "timestamp": 1643389848
    },
    {
        "content": "<p>well, first there needs to be consistent policies that we could then work on. But each state has radically different rules, and many organizations further refine the rules. So the rules today are not standardized... hence why we just warn clients that they might get less than they thought they would</p>",
        "id": 269768775,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643390060
    },
    {
        "content": "<p>This isn't an IG requirement.  This is a business requirement.  If a business has rules about certain data not being allowed to be shared with certain recipients, they need to enforce that.  You can't expect the requester to self-limit what they ask for.</p>",
        "id": 269770433,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643390651
    },
    {
        "content": "<p>Great! The business can have their auth server only return appropriate scopes for the requester.</p>",
        "id": 269779439,
        "sender_full_name": "Paul Church",
        "timestamp": 1643394032
    },
    {
        "content": "<p>At best, scopes can define what resources to return.  Scopes don't (at the moment) allow redaction of data from instances.  And that's absolutely something that systems will need to be able to do.  And there will be certain situations where scopes aren't sufficient either.  If a requester provides a scope of \"all lab results\" and patient consent or organization policy says \"lab results related to HIV testing and certain other sensitive tests can't be shared\", then the server is obligated to do that additional filtering.  And they <em>can't</em> count on the client to specify some fancy scope that says \"all lab results excluding the ones you consider sensitive\".</p>",
        "id": 269784077,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643395920
    },
    {
        "content": "<p>The component that creates the auth token will have to pass along all information needed for the \"data limiter\" to make a decision about the subset of data that will be returned. Right now the only scope defined by HL7 is the broad (has access to X resources) and I believe smart says (has access to patient y). Every other data point that the data limiter needs to make decisions will have to be placed in the auth token (or looked up with data in token). And this will be custom coding between the token generator and the data holder. Is it up to HL7 (smart) to say, \"this is how in the token authorization is provided to get HIV type observations.\" I don't think so, there are too many rules for various jurisdictions to cover (unless it's a general scope rules engine).</p>",
        "id": 269787993,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1643397457
    },
    {
        "content": "<p>The auth token is not necessarily going to convey all the information needed by the data limiter - unless the auth server happens to be aware of all patient consents and all organization policies.  Even then, that's not going to help with stripping data elements.  Auth scopes don't have that granularity - and can't reasonably ever be expected to.</p>",
        "id": 269790159,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643398491
    }
]