[
    {
        "content": "<p>When you really start to go into detail on implementing this - we feel there are a lot of challenges and ambiguity. Would love to talk with someone who has implemented this in real-world - anyone?</p>",
        "id": 251667891,
        "sender_full_name": "Nirmal Fernando",
        "timestamp": 1630560464
    },
    {
        "content": "<p>FYI, we have a PDex implementer call every Friday. You may want to consider joining to ask a few questions, Identify ambiguities that we might consider clearing up, and find others to share experiences with. <a href=\"http://www.hl7.org/concalls/CallDetails.cfm?concall=55293\">http://www.hl7.org/concalls/CallDetails.cfm?concall=55293</a></p>",
        "id": 251670936,
        "sender_full_name": "Corey Spears",
        "timestamp": 1630563456
    },
    {
        "content": "<p>Thanks, Corey, will join.</p>",
        "id": 251672190,
        "sender_full_name": "Nirmal Fernando",
        "timestamp": 1630564615
    },
    {
        "content": "<p>We also encourage discussion here. It might help if you pose specific questions regarding areas you see challenges with.</p>",
        "id": 251712681,
        "sender_full_name": "Corey Spears",
        "timestamp": 1630588544
    },
    {
        "content": "<p>Hi team,</p>\n<p>Following are some concerns that we have in discussion</p>\n<p>If we consider data sharing, In FHIR perspective there are multiple ways to share data between payers:</p>\n<ol>\n<li>Via member mediated SMART-on-FHIR Application : For this approach, everything is fine until you hit the jackpot that the member needs is an account that works in the old payer portal. That is hard to come by, when you try to load records from a very old health plan because it is reasonable even in payer perspective to disable the account.</li>\n</ol>\n<p>[Possible solutions to consider: 1. CMS rule to mandate member login in read-only mode for a time period which the payer needs to maintain records. 2. Impose and Introduce temporary account activation (read-only) mechanism]</p>\n<ol start=\"2\">\n<li>Payer push / pull - in this method upon member request (or without) new payer can pull or old payer can push records. Record pull case works fine. But in the push case there is no defined endpoint where the old payer can push data.</li>\n</ol>\n<p>[Possible solutions to consider: Introduce bulk data import operation so old payer can perform member-match and do bulk data import or POST support for patient-everything]</p>\n<p>Even with all above approaches, it won’t really solve interoperability among payers unless those aspects are at least added to an IG and best it is best if mandate in CMS rule. </p>\n<p>I personally think the rule or IG should be strict on communication and data sharing protocol at first so all payers  follow the same. That will even reduce organizational overhead that payers must face with manual workflows etc. when usage rises.</p>",
        "id": 251847715,
        "sender_full_name": "Milinda Perera",
        "timestamp": 1630660254
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> any thoughts on these points that Milinda raised?</p>",
        "id": 252496342,
        "sender_full_name": "Nirmal Fernando",
        "timestamp": 1631120493
    },
    {
        "content": "<p>Payer to Payer exchange is not an area I have been focusing on, so I wonder if it would be better to see if <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> has some thoughts.</p>",
        "id": 252535412,
        "sender_full_name": "Corey Spears",
        "timestamp": 1631136214
    },
    {
        "content": "<p>Milinda / Nirmal. The PDex IG specifically documented the Member-Match operation to enable Payers to perform an. exchange WITHOUT a member requiring an active account at their prior payer. </p>\n<p>In PDex we reference the HRex IG which has been updated to document an authorization with consent process that further refines this member-match process. We will be testing this interaction at the Connectathon.</p>",
        "id": 252538321,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1631137554
    },
    {
        "content": "<p>HRex Coverage profile has been updated as per the following JIRA tracker item:<br>\n<a href=\"https://jira.hl7.org/browse/FHIR-33263\">https://jira.hl7.org/browse/FHIR-33263</a></p>",
        "id": 253008915,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1631477292
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> and <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> - <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> does the Payers have to expose only FHIR based exchange? or should they support other mediums like FTP etc. too?</p>",
        "id": 253031935,
        "sender_full_name": "Nirmal Fernando",
        "timestamp": 1631502910
    },
    {
        "content": "<p>Also, in <a href=\"http://build.fhir.org/ig/HL7/davinci-ehrx/consent-oauth.html\">http://build.fhir.org/ig/HL7/davinci-ehrx/consent-oauth.html</a> - it has a reference to a PayerDirectory in the sequence diagram. Is there a Payer Directory that exists today? If so, are all the Payers registered there? How to handle a scenario of a non registered Payer?</p>",
        "id": 253105064,
        "sender_full_name": "Nirmal Fernando",
        "timestamp": 1631545487
    },
    {
        "content": "<p>Directories are being exstablished. There isn't a national directory. There is a track addressing that at this connectathon</p>",
        "id": 253252886,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1631627091
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> - I guess we are already late to join the connectathon? Will there be recordings available?</p>",
        "id": 253279317,
        "sender_full_name": "Nirmal Fernando",
        "timestamp": 1631636528
    },
    {
        "content": "<p>#everything is referenced in PDex. Carin-BB is excluded from Payer to Payer exchange</p>",
        "id": 253290389,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1631640673
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  <a href=\"https://hl7-org.zoom.us/j/92359255150?pwd=UWc0Z0NrL3IxeWtMMHh2TENTNjRDdz09\">https://hl7-org.zoom.us/j/92359255150?pwd=UWc0Z0NrL3IxeWtMMHh2TENTNjRDdz09</a>.  are you able to join the Pdex session on censent</p>",
        "id": 253290712,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1631640786
    },
    {
        "content": "<p>Wasn't this delayed indefinitely by the CMS?</p>",
        "id": 259735340,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1635605941
    },
    {
        "content": "<p>They indicated that they don't plan to start enforcing in January and haven't indicated when they <em>do</em> plan to start enforcing.</p>",
        "id": 259764166,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635648044
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321333\">@Milinda Perera</span> re: your comment \"Via member mediated SMART-on-FHIR Application : For this approach, everything is fine until you hit the jackpot that the member needs is an account that works in the old payer portal. That is hard to come by, when you try to load records from a very old health plan because it is reasonable even in payer perspective to disable the account.\"     I have not seen or heard of health plan portal accounts being 'disabled' by the health plan. If a member selects 'create new account' so they can access their information during the time they were eligible, the portal will allow you to do that. Have you seen a production example of where a health plan refuses to allow you to create a new account to view your claim information while you were a member even though you are no longer enrolled?</p>",
        "id": 267785534,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1642021230
    },
    {
        "content": "<p>I'm sure this is covered somewhere, or maybe it's self evident. <br>\nAre there any guidelines on <em>how</em> a member initiates the payer-to-payer exchange? <br>\nIs it the expectation that it would be an option in the payer's web portal for a member to request data from a previous payer? Are there other required or common means to initiate the exchange?</p>",
        "id": 272186054,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1645049294
    },
    {
        "content": "<p>I think that's up to the payer. During onboarding would be logical</p>",
        "id": 272267778,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1645108612
    },
    {
        "content": "<p>And offering in portal would be also logical</p>",
        "id": 272267815,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1645108628
    },
    {
        "content": "<p>Could also email and note that option in order to increase adoption</p>",
        "id": 272267860,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1645108648
    }
]