[
    {
        "content": "<p>Agree that the documentation is somewhat misleading by having the \".pdf\" on the resource id - it looks like a file extension.  It's <em>not</em> a link to a PDF.  It's a pointer to a DocumentReference (which presumably contains a PDF).  I've submitted a tracker item to remove the \".pdf\" from the example URL.  (<a href=\"http://jira.hl7.org/browse/FHIR-36670\">FHIR#36670</a>)</p>",
        "id": 277025701,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648569090
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . So if it is supposed to be a reference to a DocumentReference resource I'm still not sure how the payer receiving the member-match bundle submission is supposed to be able to access that separate DocumentReference resource? </p>\n<p><span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> tagging you as well if you had an input on how this Consent source referenced resource would be shared? And also what's an example of what it would capture (e.g., screenshot of consent acknowledgement page?)?</p>",
        "id": 277888909,
        "sender_full_name": "Kyle Brew",
        "timestamp": 1649169697
    },
    {
        "content": "<p>If you need it, just execute a Read against it.</p>",
        "id": 277890775,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649170432
    },
    {
        "content": "<p>But with what authorization bearer token? The payer receiving the member-match request wouldn't have any authority to access any data from the other payer's FHIR server based on how I'm reading the IG. So unless it's a public endpoint that anyone can execute a read against I'm still not sure how the data is made available</p>",
        "id": 277893451,
        "sender_full_name": "Kyle Brew",
        "timestamp": 1649171409
    },
    {
        "content": "<p>You now have a member id, so can access the Consent in the same manner that you would access any other data on the target server.  It just turns into a regular PDex query under the same security protocols.</p>",
        "id": 277895784,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649172300
    },
    {
        "content": "<p>Having a member id is not the same as having authorized access to a server. If Consumer App provides a reference link to a fhir resource to the Supplier, unless that resource server is open access then the Supplier will not be able to retrieve the resource.</p>",
        "id": 277903712,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1649175102
    },
    {
        "content": "<p>The answer here is that the Consumer app does not provide a reference link, it provides the resource itself as part of the $member-match operation input. And passing a screen shot isn't going to work, it needs to be processable. A screen shot would imply human intervention to decode any necessary value.</p>",
        "id": 277904003,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1649175217
    },
    {
        "content": "<p>If you have patient-mediated access through a consumer app, then the Consent is irrelevant - the patient is right there in the middle determining that data can flow.  The Consent is being shared for non-patient-mediated access - i.e. direct payer to payer communication with no patient involvement (beyond the fact that they've signed a consent that is stored somewhere).</p>",
        "id": 277904609,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649175477
    }
]