[
    {
        "content": "<p>I understand HRex allows for two options –&gt; regular (= just non-sensitive) vs sensitive (= all data).</p>\n<p>And per that policy, if we have a customer who chose ‘regular’ &amp; does not want to share sensitive data, how do we handle sensitivity mapping that varies across states. <strong>Are we asking the Payers to do complex state-specific filtering of sensitive data in that scenario?</strong><br>\nFor example, Sensitive codes for Texas might be different from California. So if two people one in Texas and another in California both choose that same option...<strong>does that mean Payers will now have to handle state-specific filtering for those two customers?</strong></p>\n<p>Also, different Payers might have a different list of sensitive codes per their legal interpretation of State and Federal Privacy Laws. <strong>Will DaV look to standardize the list of sensitive codes to filter?</strong> Otherwise, responses will vary by Payers depending on how conservative they are in their interpretation of state/federal privacy laws.</p>",
        "id": 261831658,
        "sender_full_name": "Yukta Bellani",
        "timestamp": 1637175588
    },
    {
        "content": "<p>this is often why consent and sensitivity labels are local concerns. When data transitions outside the control of the custodian, it likely needs totally new consent and totally new sensitivity labels. Thus, the recommendation in FHIR core that the sensitivity labeling codes often are not communicated outside of the organization. They are critical for data handling within an organization, and especially for access control. But one organizations sensitivity coding is often not the same as another... this said, there are confidentiality codes that do transition with the data, as would obligations, and... national regulatory (e.g. 42 CFR Part 2) tags.</p>",
        "id": 261832314,
        "sender_full_name": "John Moehrke",
        "timestamp": 1637175838
    },
    {
        "content": "<p>Right, but in my scenario, only non-sensitive data will move to the next payer so there will not be any tags attached to it. I am trying to see if Payers need to do any sensitive filtering for Payer to Payer or should the options for the customer be - </p>\n<p><strong>All data (including any sensitive categories including 42 CFR Part 2)</strong> or <br>\n<strong>Nothing</strong></p>",
        "id": 261835011,
        "sender_full_name": "Yukta Bellani",
        "timestamp": 1637177207
    },
    {
        "content": "<p>is it right for DaVinci to make that kind of a legal policy decision?  I could certainly see how one would communicate sensitive data, with tags... which is what I mentioned.. and for which the HL7 DS4P IG sets the groundwork for.</p>",
        "id": 261835738,
        "sender_full_name": "John Moehrke",
        "timestamp": 1637177528
    },
    {
        "content": "<p>That's my point that the CMS rule does not ask Payers to do any sensitive data filtering before sending this data to the next payer. IG is introducing that requirement with the two options under \"Consent Policy\". </p>\n<p>All CMS is saying is that we are required to send this data to another Payer, at the customer's request. This means we will send everything we have and if a customer is concerned about some of the sensitive information in it then they can choose to not do Payer to Payer transfer.</p>",
        "id": 261836279,
        "sender_full_name": "Yukta Bellani",
        "timestamp": 1637177800
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span></p>",
        "id": 261870477,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637195087
    },
    {
        "content": "<p>Hi, just reading through this old thread, I had the same question how the differentiation of regular vs sensitive data consent assertions will work. could any of you folks please help me understand what was the final decision taken here ?</p>",
        "id": 276498099,
        "sender_full_name": "Balaji Nivasan Baskaran",
        "timestamp": 1648137861
    },
    {
        "content": "<p>I'll ping <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> again.  My understanding is that if state or other regulations limit your ability to transmit 'sensitive' data without consent, then CMS's rule requiring sharing \"all data\" doesn't necessarily trump the other regulatory requirement for transmitting sensitive data.  (As always, talk to your lawyers.)  The 2-levels of consent allows for the possibility of patients consenting to sharing base information but not sensitive information.  If your lawyers feel that there are no situations where you need both consent types, then you can just require that all consents be for all data.</p>",
        "id": 276505314,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648140556
    },
    {
        "content": "<p>Lloyd -- you are correct -- CMS all data is always conditioned by Federal and State regulations regarding sensitive data that required explicit member consent to share.</p>",
        "id": 276558243,
        "sender_full_name": "Robert Dieterle",
        "timestamp": 1648168799
    }
]