[
    {
        "content": "<p>@Saul Kravitz @Mark Scrimshire - This is regarding Clinical data for Patient Access API. We have Procedure Codes which we load as Encounter Type while creating Encounter resources to represent Utilization Management cases.  Encounter Type is bound to a codeset and allows CPT and SnowMed codes only. However from our sources, Procedure Codes come in Code Types  NDC, SITE, HCPCS, NUBC and NDC. Can we extend the code set to provide code values of other code sets as well?<br>\nSame question holds when we load Procedure resource and procedure code belong to Code set Types  NDC, SITE,  NUBC and NDC.</p>",
        "id": 231469973,
        "sender_full_name": "Suma Vishnumoorthy",
        "timestamp": 1616506239
    },
    {
        "content": "<p>Some of those code systems make no sense as procedures and without seeing specifics my answer is no you should not do that. You should be mapping what you get to something in the expected set. Perhaps if you gave some examples it can be made more clear.</p>",
        "id": 231552701,
        "sender_full_name": "Robert McClure",
        "timestamp": 1616537859
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"305230\">@Suma Addagadde</span> <span class=\"user-mention\" data-user-id=\"237480\">@Don</span> <br>\nRobert - You are right. Some of them do not make sense as procedure codes. This is because we are considering Authorizations and Appeals made as part of Utilization Management cases as Encounters. We did not find any other resource in Davinci PDEX other than Encounter which can fit in Authorizations and Appeals data that we have in our systems. When we are dealing with Auths and Appeals we have Encounter type ( must have field) to be loaded and we are loading procedure codes associated with auth or Appeal in it. These procedure code could be a NDC code or a NUBC code or HCPCS code apart from CPT codes. I think an important question here is - Is encounter resource a right one to represent Auth and Appeals data ?</p>",
        "id": 231984132,
        "sender_full_name": "Suma Vishnumoorthy",
        "timestamp": 1616772523
    }
]