[
    {
        "content": "<p>Kindly answer these queries.</p>\n<ol>\n<li>My understanding is that CMS regulated Payers need to implement just the Payer to Payer exchange at the member request and Payer to third party application exchange at the member request interactions by the beginning of Jan 1st 2022 to meet the CMS Payer to Payer exchange mandate. Is my understanding correct? And Payer to Provider interaction is out of scope for Jan 1st 2022 CMS Mandate. Please confirm.</li>\n<li>Please let me know, who should implement the CDS Hook services in case of Payer to Provider interaction? Would that be implemented at Provider end or at Payer end.</li>\n<li>It is mentioned in the IG that whenever a member moves from old health plan to a new health plan, the new health plan shall invoke a $member-match operation on the old health plan fhir server. Is the $member-match an open API operation on health plan Fhir server? In other words, can new health plan call $member-match operation on the old health plan without any authentication and authorization? Please confirm. <br>\nIf it is indeed open, would that not cause major security issues as anybody can get the coverage information from Health Plans by issuing $member-match on the fhirserver.</li>\n<li>How does providers and payers know the FHIR servers end points for data exchange?</li>\n<li>How is Payer to third party application exchange different from CMS Patient Access Final rule, where it says 3rd Party apps should be able to view the health data maintained in Fhir servers. Please elaborate on Payer to third party application exchange interaction.</li>\n<li>Is the data exchange between Payer, providers and third party application for just one patient health data or it could also be a population of patients data? </li>\n<li>I understand that $everything shall be supported by the FHir server for exchange. Does Fhir Server’s Bulk Import and Bulk Export APIs also a requirement for implementation of this specification? </li>\n<li>The Pdex IG is in currently in STU(Standard for Trial use) stage. What is the timeline for Pdex IG to become mature to be used for production implementations?</li>\n</ol>\n<p>Thanks in advance for answering my queries.</p>",
        "id": 227965399,
        "sender_full_name": "NARASIMHA MURTHY",
        "timestamp": 1614362101
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span></p>",
        "id": 227969001,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614363489
    },
    {
        "content": "<p>I'll answer #8 - from HL7's perspective, \"Standard for Trial Use\" <em>is</em> mature enough to be used in production implementations.  The regulation expectation is for those STU-level specifications to be implemented.  They're unlikely to become \"Normative\" for 3-4 years, if that soon.</p>",
        "id": 227969254,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614363597
    },
    {
        "content": "<p>Thanks you for answering question#8.</p>",
        "id": 227972942,
        "sender_full_name": "NARASIMHA MURTHY",
        "timestamp": 1614365139
    }
]