[
    {
        "content": "<p>Creating this stream to capture questions from implementers of the Payer Data Exchange (PDex) IG</p>",
        "id": 227536952,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1614132380
    },
    {
        "content": "<p>Can't implementers create whatever thread they like for questions here?  That's the normal pattern in Zulip - one thread per question...</p>",
        "id": 227543903,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614138507
    },
    {
        "content": "<p>Did I post my question about provenance in the wrong place? I'd just created a new topic for it.</p>",
        "id": 227784899,
        "sender_full_name": "Anusha",
        "timestamp": 1614266896
    },
    {
        "content": "<p>Creating topics is fine</p>",
        "id": 227784984,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614266942
    },
    {
        "content": "<p>In a payer to payer data exchange, when using the $everything operation on a member, what type of FHIR message exchange is preferred to enable offline transfer</p>",
        "id": 231993335,
        "sender_full_name": "Lakshminarayanan",
        "timestamp": 1616775875
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> ,</p>\n<p>I have 2 questions related to Payer to Payer data exchange.</p>\n<ol>\n<li>\n<p>I read that using FAST/CAQH one plan can discover the other plans. Is FAST a specification to discover the Fhir end points of other payer plans?. I am not very clear on this, Please elaborate. What other information does FAST provide about a new payer plan apart from Fhir end point. Does it also provide AUTH and Token end points for OAUTH2.0? Please let me know where I can get more details about FAST spec. I think FAST and CAQH solutions are the core for payer to payer exchange to be successful. Please let me know, if there is any useful links or materials related to FAST and CAQH.</p>\n</li>\n<li>\n<p>Assuming we discover the new plan using FAST/CAQH, how do we get the OAUTH2.0 access tokens for other plans. Because OAUTH2.0 requires initial registration post that only we get the client id and client secret which are required to get an OATH2.0 token. My question is  how do we register and maintain so many payers for OAUTH2.0? Is FAST and CAQH is going help there as well. Please elaborate.</p>\n</li>\n</ol>\n<p>thanks,<br>\nNarasimha</p>",
        "id": 233764619,
        "sender_full_name": "NARASIMHA MURTHY",
        "timestamp": 1617940544
    }
]