[
    {
        "content": "<p>(Tagging <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> because I think this was tested in the Connectathon this month)</p>\n<p>In the updated PDex Member Match with Consent spec, it describes the Unique MemberMatch ID returned by the old payer as being created specifically for the requesting payer…<br>\n<em>- If a Member is matched and the Consent request can be complied with (Per Policy request and Date range) a Unique MemberMatch ID is created for the requesting Payer (Payer2)</em></p>\n<p>A few (hopefully quick) questions:</p>\n<ul>\n<li>Just to confirm: the old payer creates a new Unique Member Match ID for each requesting payer (versus always returning the same member ID to all requesting payers)? </li>\n<li>Is the Unique Member Match ID above the same thing that was previously referred to as the UMB / Unique Member ID? Did the earlier member-match also expect that the returned UMB be unique to the requesting payer, or is that a new aspect in the new version of the operation?</li>\n<li>Is the Unique Member Match ID returned by the member match expected to be valid forever, or might it be usable for only a limited amount of time? </li>\n<li>Is part of the reason for having the old payer create a unique member ID value specifically for the requesting payer so that it can be used as sort of an authorization input in the following OAUTH step?</li>\n</ul>\n<p>This might have been covered in another thread, but I couldn't find it. Feel free to point me in that direction if so.<br>\nThanks!</p>",
        "id": 268431412,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1642528725
    },
    {
        "content": "<p>During the connectathon I never figured out why there was an expectation that the value returned be a unique id other than \"You might return the value of the stored Consent resource as your Unique ID, so that on the subsequent request you can link directly to the consent to get the <a href=\"http://patient.id\">patient.id</a> value\". I personally think returning the <a href=\"http://patient.id\">patient.id</a> value works. In my opinion, it's up to the server to determine what value to return so that the server has what it needs to make the token (allowing access to patient) later. </p>\n<p>I might want to do that, but I don't think the IG needs to specify how it works. It could be a whole lot more generic and say return a patient id value, used to get a token for member's data access.</p>",
        "id": 268456488,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1642540418
    },
    {
        "content": "<ul>\n<li>There's no intention that the member match id for each requesting payer be different.  I guess it's theoretically possible, but it would be better if it was the same id for everyone (and the same id used internally by the source payer).</li>\n<li>The UMB and Unique Member Match ID are one and the same</li>\n<li>It should ideally be valid forever.  It definitely needs to be valid for a couple of years</li>\n<li>The member id doesn't provide authentication, it merely provides a confirmed member identity.</li>\n</ul>",
        "id": 268493555,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642569698
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  for the clarification. </p>\n<p>In that case, I think I'd suggest refining the wording in the <a href=\"http://build.fhir.org/ig/HL7/davinci-epdx/PayerToPayerExchange.html#member-match-with-consent\">STU2 PDex Member Match with Consent section</a>, where it includes the following (where Payer 2 is the new payer initiating the member match against the member's previous payer)...<br>\n<em>\"16. Creates Unique (to Payer 2) MemberMatch ID and returns in response\"</em> and <em>\"Payer 2 receives the Unique MemberMatch ID that is unique to Payer 2\"</em> in the sequence diagram<br>\nand <br>\n<em>\"- If a Member is matched and the Consent request can be complied with (Per Policy request and Date range) a Unique MemberMatch ID is created for the requesting Payer (Payer2)\"</em> in the bulleted steps below the diagram.</p>\n<p>That wording really suggests that the returned MemberMatch ID isn't just the responding payer's own Unique Member ID for the patient. </p>\n<p>In the STU1 PDex guide it characterizes the UMB as <br>\n<em>\"When the Old Health Plan returns the Patient Record they SHALL add a Patient.identifier with the Patient.identifier.type = “UMB” (Unique Member Identifier). This is a new type value.\"</em><br>\n... which to me sounds more like the responding payer could return its own Unique Member ID (e.g. that it thinks of as the \"MB\" type from the <a href=\"https://terminology.hl7.org/1.0.0//CodeSystem-v2-0203.html\">v2 identifier type code system</a>)... though I wasn't sure whether the phrase <em>\"This is a new type value\"</em> indicated that that that wasn't the case.</p>\n<p>Another question that might help share my uncertainty... If I'm the new payer and I receive a UMB / Unique MemberMatch ID from the member's previous payer, would it be reasonable for me to capture that in my system as an Identifier with a type of \"MB\"/Unique Member ID from the V2 identifier type code system and an assigner that refers to the previous payer?  Or is it a different kind of animal and MB wouldn't be an appropriate identifier type?</p>\n<p>Thanks again for your help with this!</p>",
        "id": 268568092,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1642610797
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span></p>",
        "id": 268632017,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642645142
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238597\">@Frank McKinney</span> Answering your questions in reverse order:<br>\n4.- Is part of the reason for having the old payer create a unique member ID value specifically for the requesting payer so that it can be used as sort of an authorization input in the following OAUTH step? <br>\n   Yes. The id is passed to the following auth step.</p>\n<ol start=\"3\">\n<li>\n<ul>\n<li>Is the Unique Member Match ID returned by the member match expected to be valid forever, or might it be usable for only a limited amount of time?<br>\n  it would be valid for that payer for a limited period of time. </li>\n</ul>\n</li>\n<li>\n<ul>\n<li>Is the Unique Member Match ID above the same thing that was previously referred to as the UMB / Unique Member ID? Did the earlier member-match also expect that the returned UMB be unique to the requesting payer, or is that a new aspect in the new version of the operation?<br>\n  Yes - the unique member match id replaces the UMB. The original member match returned a patient record that included the UMB. The updated member match just returns the number.</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>Just to confirm: the old payer creates a new Unique Member Match ID for each requesting payer (versus always returning the same member ID to all requesting payers)?<br>\n  Yes.</li>\n</ul>\n</li>\n</ol>\n<p>My team in testing this found that if you stored the consent for a successful match in Member Match then the Unique ID of the consent resource would meet the requirements for the unique ID and would also make it easier to evaluate a subsequent request using the unique id. For example, when a subsequent request for a token occurs after the consent end date in the consent record. The Consent record would also have the necessary links to the Requesting Payer and the target member. </p>\n<p>We are not making it a requirement to write a consent record as part of the spec because  Different payers may have other mechanisms, such as in their MDM platform, to validate requests and manage member ids.</p>",
        "id": 268856996,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1642778621
    },
    {
        "content": "<p>Thanks Mark! That answered my questions</p>",
        "id": 268867323,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1642782772
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> - we should talk, because your understanding of the operation and what I'm writing in HRex are evidently not the same.</p>",
        "id": 268916717,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642807093
    }
]