[
    {
        "content": "<p>My question revolves around access to the /Patient/$member-match operation and how it relates to HRex vs PDex.  I have read through <a href=\"https://build.fhir.org/ig/HL7/davinci-epdx/index.html\">https://build.fhir.org/ig/HL7/davinci-epdx/index.html</a> and <a href=\"http://build.fhir.org/ig/HL7/davinci-ehrx/index.html\">http://build.fhir.org/ig/HL7/davinci-ehrx/index.html</a> and I am still somewhat confused on the nuances here.</p>\n<ol>\n<li>My understanding from reading HRex  is that there are no additional restrictions placed on WHO can access that operation or do they fall under the SMART scopes and I need Patient/*.read?</li>\n<li>Where do I find if the server SHOULD/SHALL/MUST support $member-match for Patient Access API?  I am assuming its not MUST</li>\n<li>PDex adds additional security in that the requesting payer gets a token that ONLY has access to member-match.  Is this in conflict with HRex which has no such restriction?  </li>\n</ol>\n<p>I have only recently (in the last 2 months) started reading HL7 IGs and I am not totally familiar with how to find all the answers.  So if the answer is RTFM that is perfectly OK as it will help me figure out how to decipher this.</p>\n<p>thanks,<br>\nStephan Roorda<br>\nIBM Watson Health Interoperability</p>",
        "id": 270061755,
        "sender_full_name": "Stephan Roorda",
        "timestamp": 1643647052
    },
    {
        "content": "<p>The intention is to migrate the content from PDex to HRex, though the timing of that will depend on how quickly the PDex requirements settle.</p>\n<ol>\n<li>We haven't talked about operation permissions.  I agree that Patient/Patient.read would be the appropriate permission.  Would you like to submit a tracker item for us to make that explicit?</li>\n<li>Expectations for support will be in the CapabilityStatements of the IGs that reference the operation.  So HRex <em>won't</em> define conformance expectations.  PDex will - referencing the HRex-defined content.</li>\n<li>That bit is still up in the air.  I.e. whether and how to get a token that allows you to perform member match, which then allows you to to get a token to access more information.</li>\n</ol>",
        "id": 270078203,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643652869
    },
    {
        "content": "<p>How can the token say patient/Patient.read when they don't know the patient id and can't express it? Maybe system/Patient.read?</p>",
        "id": 270088866,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1643656708
    },
    {
        "content": "<p>I would think that this is one of those scenarios where the app id (from app registration) would dictate this app has $member-match permission instead of a specific fhir scope, especially since it's not getting a resource so FHIR based resource scopes seem odd, all it returns is some value that can be used in a token request for an actual scoped token. Which would likely include patient/Patient.read with sub=\"patient id\".</p>",
        "id": 270090386,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1643657284
    },
    {
        "content": "<p>I was making the assumption that $member-match MUST be part of the /Patient-Access APIs as part of the Interop rule and that SMART on FHIR was in play here.  Hence my question #2.  After reading your responses I am not so sure.   So I think this raises a few other questions to challenge those assumptions.</p>\n<ol>\n<li>Does this have to be on the same server with SMART on FHIR as patient-access API?  I think that comes down to does the individual patient need access to this or can we put this on a \"separate server\" for applications where I can enable different security.</li>\n<li>I am suspect of using <a href=\"http://Patient.read\">Patient.read</a> scope, the reason I asked about it is because PDex clearly states the token ONLY gives access to $member-match which implies you cannot access Patient/*.read.  I guess without a <a href=\"http://patient.id\">patient.id</a> in the claim you would not be able to get any data anyway but this does not seem like the best way to do this.</li>\n</ol>",
        "id": 270203681,
        "sender_full_name": "Stephan Roorda",
        "timestamp": 1643720025
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span></p>",
        "id": 270218132,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643725377
    },
    {
        "content": "<p>I think that my questions may apply to all of these operations ...</p>\n<p>For PDex</p>\n<ul>\n<li>$pdex-everything</li>\n<li>$member-match</li>\n</ul>\n<p>Other</p>\n<ul>\n<li>$export</li>\n<li>$everything</li>\n</ul>\n<p>Do these have to be part of patient access APIs with SMART on FHIR?  I always saw the PA APIs as for a single patient use to see their data and the above operations are all more for a different kind of access (Payer, etc)</p>",
        "id": 270273805,
        "sender_full_name": "Stephan Roorda",
        "timestamp": 1643744904
    }
]