[
    {
        "content": "<p>We are currently planning for CMS 9123 rule and have some questions regarding members opting-in to Payer-to-Payer during enrollment. From the prior ruling that was pulled back: impacted payers must create a process to allow members to opt-in to permit the payer to use the Payer-to-Payer API for bulk access with other payers at enrollment and quarterly with concurrent payers as described below.<br>\n1) If a member does not provide consent at enrollment how are payers handling this? Are procedures being put in place for post-enrollment capture?<br>\n2) Are any payers leveraging pre-enrollment systems to handle consent? It seems this ruling would change some of our enrollment forms if we end up touching the pre-enrollment process which would be a large effort.<br>\n3) Once a member grants consent at enrollment how long is it valid? Will other payers proactively ask members if they have concurrent plans? How often?<br>\n4) If a member revokes consent are payers removing the \"other payer\" data or just stopping the transition of data going forward?</p>",
        "id": 264077558,
        "sender_full_name": "Mark Neumuth",
        "timestamp": 1638913685
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span></p>",
        "id": 264088629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638919395
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> You mentioned managing consent expectations is being discussed in the Friday PDex calls.  Is that the noon EST call or the one later in the afternoon (3:00 EST?).</p>",
        "id": 264230902,
        "sender_full_name": "Mark Neumuth",
        "timestamp": 1639002865
    },
    {
        "content": "<p>Typically the second one</p>",
        "id": 264252567,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639020724
    },
    {
        "content": "<p>We are reverting to a single PDex Call in the New Year. The PDex call will take place at Noon ET on Fridays.</p>",
        "id": 265665709,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1640079910
    }
]