[
    {
        "content": "<p>Leaving aside regulatory or other drivers, what resource profiles would a PDex server need to support in order to conform to the PDex IG?</p>\n<p>The <a href=\"http://hl7.org/fhir/us/davinci-pdex/STU1/CapabilityStatement-pdex-server.html\">STU1 CapabilityStatement</a> includes this statement:<br>\n  \"The PDEX Server SHALL:1. Support the US Core Patient resource profile.1. Support at least one additional resource profile from the list of US Core and PDEX Profiles.\"</p>\n<p>But in the CapabilityStatement resource, there are capabilitystatement-expectation extensions with \"SHALL\" at the CapabilityStatement.rest.resource  level of most or all of the listed resources, which suggests that the server is expected to support all of the listed resources and profiles--which seems at odds with the statement above.</p>\n<p>If I was a payer and I wanted to be sure I was conformant with PDex, would I be conformant if I supported US Core Patient and some but not all of the PDex profiles?</p>\n<p>Thanks!</p>",
        "id": 271635435,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1644612743
    },
    {
        "content": "<p>Not 100% sure about PDex but the regulation says that as a payer you should share all the USCDI data you have, so if (for example) you have allergies and conditions implementing only allergies won't cut it</p>",
        "id": 271656285,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1644624957
    },
    {
        "content": "<p>Thanks Michele</p>\n<p>I guess my question is more about PDex conformance specifically, separate and apart from the regulations that payers also need to consider. </p>\n<p>The IG's server capability statement includes...</p>\n<ul>\n<li>a pretty explicit statement that a PDex server must support US Core Patient and at least one other US Core or PDex profile</li>\n<li>but also resource-level capabilitystatement-expectation extentions with a value of SHALL on many or all of the resources.</li>\n</ul>\n<p>Maybe this is a question for <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> or <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ... specific to the server CapabilityStatement and how to interpret those aspects bulleted above</p>",
        "id": 271755343,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1644771968
    },
    {
        "content": "<p>I'm going to leave it to <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> or <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> to respond to this one.</p>",
        "id": 271763006,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644783142
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> <br>\nJust following up on the question above. Thanks!</p>",
        "id": 272120700,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1645020820
    },
    {
        "content": "<p>To be compliant with PDex, a payer will need to support all of the required profiles (almost all are US Core) defined in the capability statement.  To be compliant with the CMS rule, a payer will need to exchange all information they maintain on a member that is covered by USCDI V1 -- the FHIR implementation of USCDI is embodied in US Core. PDex add a few additional profiles to cover, for example, dispensed medications and devices that are not implantable.</p>",
        "id": 272132290,
        "sender_full_name": "Robert Dieterle",
        "timestamp": 1645026037
    },
    {
        "content": "<p>How can a payer comply with a profile, when they don't maintain any data for the profile?<br>\nWhy would a payer collect data for which they have no use (from other payer) just so they could store the data and have to exchange that data with the next payer?</p>",
        "id": 272138767,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1645028619
    },
    {
        "content": "<p>Thanks Bob<br>\nCouple quick clarification questions...</p>\n<ul>\n<li>Are <em>\"all of the required profiles ... defined in the capability statement\"</em> the ones with resource-level capabilitystatement-expectation extentions with a value of SHALL? (I think that's all of the resources except for Coverage)</li>\n<li>How does this statement in the server capability statement relate to your answer? ... <em>\"The PDEX Server SHALL:1. Support the US Core Patient resource profile.1. Support at least one additional resource profile from the list of US Core and PDEX Profiles.\"</em></li>\n</ul>\n<p>And to Daniel's question, if a payer determines it isn't required by regulation to share a kind of information for which there's a US Core or PDex profile, would they be conformant with PDex?</p>",
        "id": 272147871,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1645032212
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> <br>\nSorry to badger. Realized I neglected to tag you...</p>\n<p>Just hoping to get clear on the couple points in my last note<br>\nThx!</p>",
        "id": 272338237,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1645139836
    },
    {
        "content": "<p>If you do not maintain data for a profile, then you most likely do not need to support it.  However, CMS (in the interoperability and patient access API rule, require payers, at member request, to exchange and maintain all USCDI (US Core based on FAQs) information.  I do not believe that it is up to the receiving payer to determine if they have a \"use\" for the data.  Frank -- that is the minimum requirement, however, a payer must support all profiles for which they maintain such data, including any data received from a prior payer.</p>",
        "id": 272352086,
        "sender_full_name": "Robert Dieterle",
        "timestamp": 1645150847
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span>   To put into my own words, to be sure I'm clear...</p>\n<p>For a payer to be PDex-conformant:</p>\n<ul>\n<li>if the payer determines it must share a kind of information for which there's profile identified in the PDex capability statement—it must use that profile </li>\n<li>and at minimum, it must support the US Core Patient and at least one other US Core or PDex profile</li>\n</ul>\n<p>Sound right?</p>",
        "id": 272476829,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1645229701
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238597\">@Frank McKinney</span> The CaabilityStatemnt was largely adapted from the US Core Server statement. If you have recommendations on improvements please let me know. We can log as a Jira ticket and incorporate into the post ballot reconciliation</p>",
        "id": 272787415,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1645527687
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> . I'm really just interested in understanding the intent... what the IG means to require of a server. <br>\nDoes my last post above yours state it correctly? <br>\nThanks!</p>",
        "id": 272790672,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1645529755
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238597\">@Frank McKinney</span>  The intent was to support the CMS Interoperability Rule for patient access to US Core Clinical data plus some payer-specific clinical resources on a read only basis.</p>",
        "id": 272826197,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1645546595
    },
    {
        "content": "<p>OK. I guess I was thinking that it might be possible to state IG conformance expectations separately from the regulatory requirements.</p>",
        "id": 272827149,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1645546911
    },
    {
        "content": "<p>(I might be the only one who thinks that way)</p>",
        "id": 272827628,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1645547053
    }
]