[
    {
        "content": "<p>I'm trying to implement requirements here: <br>\n<a href=\"http://build.fhir.org/ig/HL7/davinci-ehrx/consent-oauth.html\">http://build.fhir.org/ig/HL7/davinci-ehrx/consent-oauth.html</a><br>\nAlso relevant: <br>\n<a href=\"http://hl7.org/fhir/us/udap-security/2021Sep/b2b.html\">http://hl7.org/fhir/us/udap-security/2021Sep/b2b.html</a></p>\n<p>We are expecting the consent_reference extension value in the token request to be a URL to a Consent resource.  Per the UDAP B2B spec, it must be resolvable by the receiving party, but does not describe authorization requirements.  Is there an expectation that the token-issuing party authenticate with the Consent resource owner in order to retrieve that information, and if so is there guidance on how that should be done?</p>",
        "id": 261837392,
        "sender_full_name": "Spencer Kathol",
        "timestamp": 1637178269
    },
    {
        "content": "<p>We hadn't really talked about that.  Presumably a simple mutual TLS connection would suffice, but we should make that explicit.  Can you submit a change request?</p>",
        "id": 261870380,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637195013
    },
    {
        "content": "<p>\"simple\"?</p>",
        "id": 261879464,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1637203254
    },
    {
        "content": "<p>Presumably in the future, there will be a central authority issuing client certificates - those will be used earlier in the process as well such as for the member match call.  So these calls would use the same client cert... I think that should be OK.  Jira ticket created: <a href=\"https://jira.hl7.org/browse/FHIR-34333\">https://jira.hl7.org/browse/FHIR-34333</a></p>",
        "id": 261918374,
        "sender_full_name": "Spencer Kathol",
        "timestamp": 1637237324
    },
    {
        "content": "<p>'simple' as in only mTLS needed, not OAuth.  Given that OAuth can require having a consent, we might end up in a situation where you need a consent to view the consent to...  Also, mTLS is already mandatory for payer-to-payer unless both agree to do full UDAP.  (Speaking of which, this would also need to be landed if doing full UDAP, so might not be a bad idea to raise a tracker against the UDAP spec too <span class=\"user-mention\" data-user-id=\"363194\">@Spencer Kathol</span>)</p>",
        "id": 261933659,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637245614
    },
    {
        "content": "<p>The 'standard' FHIR way to do system-to-system authentication (so far) is SMART backend auth. Using mutual TLS would add a different  way to do the same thing</p>",
        "id": 261938663,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1637247742
    },
    {
        "content": "<p>SMART backend requires the client to register with the server.  mTLS means that so long as the systems can find each other in a trusted registry, they can talk to each other.  mTLS is also already supported by payers, so it's an easier lift.</p>",
        "id": 261940553,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637248589
    },
    {
        "content": "<p>Is there a trusted registry? And no, not all payers already support mutual TLS: our system do support SMART backend but not mutual TLS for FHIR access</p>",
        "id": 261940901,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1637248735
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span></p>",
        "id": 261943501,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637249827
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I'll get another ticket submitted for UDAP today.</p>",
        "id": 261961806,
        "sender_full_name": "Spencer Kathol",
        "timestamp": 1637256913
    },
    {
        "content": "<p>My take on mTLS vs oAuth: this use case is embedded in a flow that does specify mTLS (currently).  It would differ with other use cases that require SMART backend auth (I haven't implemented one of these yet).  I believe the expectation per HRex is to have a central trusted registry but that hasn't been established yet afaik.  In theory, the consent-collecting payer can derive the consent-requesting payer's identity from the client certificate, but many implementations terminate the TLS connection on a web server, and need to check identity in the application which complicates implementation for this approach.  OAuth also introduces some hoops - such as per-payer OAuth client registration.  I don't think I have a firm preference - just providing thoughts for discussion.</p>",
        "id": 261966392,
        "sender_full_name": "Spencer Kathol",
        "timestamp": 1637258742
    },
    {
        "content": "<p>One more related question - is there a place in the token request that we would expect to find the member ID other than the consent_reference object?</p>",
        "id": 261970832,
        "sender_full_name": "Spencer Kathol",
        "timestamp": 1637260874
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-34342\">https://jira.hl7.org/browse/FHIR-34342</a></p>",
        "id": 262005908,
        "sender_full_name": "Spencer Kathol",
        "timestamp": 1637277397
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"363194\">Spencer Kathol</span> <a href=\"#narrow/stream/235286-Da-Vinci.20PDex/topic/Resolving.20UDAP.20consent_references/near/261970832\">said</a>:</p>\n<blockquote>\n<p>One more related question - is there a place in the token request that we would expect to find the member ID other than the consent_reference object?</p>\n</blockquote>\n<p>No.  Is one needed?</p>",
        "id": 262025842,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637296170
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> If the responding payer was willing to use the presence of a Consent resource as proof of consent without validating the actual resource, there would be a more readily available value to establish patient context.  Sounds like that's not the case.  That's what I expected, but wanted to ask just in case.</p>",
        "id": 262085137,
        "sender_full_name": "Spencer Kathol",
        "timestamp": 1637337363
    }
]