[
    {
        "content": "<p><span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> newbie here. Would it be appropriate for Canadian Labs to use eReferral iGuide? If so, is there a list of labs that implemented this iGuide?</p>",
        "id": 257435827,
        "sender_full_name": "Alexis Smirnov",
        "timestamp": 1634158368
    },
    {
        "content": "<p>Welcome <span class=\"user-mention\" data-user-id=\"450729\">@Alexis Smirnov</span>  <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> <br>\nI don't typically think of labs when I think of referrals.  How would you envision using the guide?<br>\n(Also <span class=\"user-mention\" data-user-id=\"193959\">@Tim Berezny</span> )</p>",
        "id": 257438016,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634159239
    },
    {
        "content": "<p>Thanks! What should I be looking at to learn more about lab interop? Dialogue (virtual care primary care provider) would like to send a lab request, receive lab results. Is it crazy to expect any labs in Canada being able to support this interop use-case? If not, is there an iGuide that would define such implementation?</p>",
        "id": 257453406,
        "sender_full_name": "Alexis Smirnov",
        "timestamp": 1634166698
    },
    {
        "content": "<p>Sending a lab order and getting back results is a bit different than an e-referral.  It's also complicated by the fact that, at least in the community setting, delivery of the 'order' to the lab is typically mediated by the patient (in terms of what collection center they show up at).  There's certainly lab reporting that's happening and I think <em>some</em> of it is starting to happen in FHIR, though I'm not nearly on top of what's going on here as some folks are.  <span class=\"user-mention\" data-user-id=\"222582\">@Sheridan Cook</span>?</p>",
        "id": 257472291,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634180656
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"450729\">@Alexis Smirnov</span>  I'd echo what Lloyd mentioned. There are constructs in FHIR to support lab ordering workflows (e.g., ServiceRequest, Observation, DiagnosticReport, Specimen) and some EMRs have even started supporting them (<a href=\"https://fhir.epic.com/Specifications?api=1054\">https://fhir.epic.com/Specifications?api=1054</a>), but from what I'm seeing at some of my Ontario clients, labs are still largely driving orders to land through v2 interfaces and paper requisitions (either given to patient or faxed to the community labs central line). Systems like OLIS that compile results from reporting labs support the query of results in FHIR (<a href=\"https://ehealthontario.on.ca/en/standards/olis-hl7-fhir-implementation-guide-consumer-query-overview\">https://ehealthontario.on.ca/en/standards/olis-hl7-fhir-implementation-guide-consumer-query-overview</a>). Starting with a results receiving use case that's established would be where I'd recommend starting but I'll keep my eyes peeled if I hear rumblings about labs interested in receiving orders in FHIR.</p>",
        "id": 257524113,
        "sender_full_name": "Sheridan Cook",
        "timestamp": 1634213704
    },
    {
        "content": "<p>Ok thanks for this, yes we're OK to start with the lab result receiving use-case. Do you know of any labs that actually comply with OLIS and expose a FHIR endpoint that can be used? If not, what's the best place to ask that question?</p>",
        "id": 257573738,
        "sender_full_name": "Alexis Smirnov",
        "timestamp": 1634232622
    },
    {
        "content": "<p>Regarding the Canadian FHIR eReferral iGuide, there have not been any conversations about lab workflows. As mentioned by Lloyd, the patient mediating the information that gets brought to the lab is a big workflow difference. That being said, the bones of the eReferral process I believe could be adapted to labs ... we'd have to really dig into the workflow to know for sure. There's a fair bit of energy going into implementing the eReferral iGuide with various vender systems, so if it could be adapted for lab processes that would make adoption easier.</p>\n<p>A key thing to have in place first would be some expressed interest by some labs.</p>",
        "id": 257699894,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1634305638
    }
]