[
    {
        "content": "<p>The Coverage resource defines the 'class' field for 'Additional coverage classifications'. There is an issue with the field name as in many programming languages 'class' cannot be used as variable name because is a special keyword. Should this field's name be changed in the future?</p>",
        "id": 211610538,
        "sender_full_name": "Dragos DOBRE",
        "timestamp": 1601380661
    },
    {
        "content": "<p>We can't necessarily avoid all key-words in all software languages or technologies.  We typically name things in resources based on what the business term is.  The reference implementations adopt naming conventions that ensure that generated class and property names don't violate naming conventions in that language.</p>",
        "id": 211620084,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601386082
    },
    {
        "content": "<p>Thanks Lloyd for the response. 'class' field represents 'Additional coverage classifications'. I was wondering why this field is not called 'classifications' but if the business term is 'class' then I understand. As we are working in python, we will look on libraries implementing FHIR to see which terminology was used for this field.</p>",
        "id": 211627680,
        "sender_full_name": "Dragos DOBRE",
        "timestamp": 1601389336
    },
    {
        "content": "<p>You can submit a change proposal suggesting that.</p>",
        "id": 211628094,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601389520
    },
    {
        "content": "<p>Do you know how can I submit a change proposal?</p>",
        "id": 211628437,
        "sender_full_name": "Dragos DOBRE",
        "timestamp": 1601389665
    },
    {
        "content": "<p>Absolutely :)  At the bottom of every page in the spec is a \"propose a change\" link.  You'll need to register for a free HL7 Jira account (we have human review to make sure you're not a spammer), after which you're free to submit whatever proposed changes you wish.</p>",
        "id": 211630017,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601390373
    },
    {
        "content": "<p>That's perfect. Thanks Lloyd. I didn't saw that link.</p>",
        "id": 211630821,
        "sender_full_name": "Dragos DOBRE",
        "timestamp": 1601390749
    }
]