[
    {
        "content": "<p>We are new to implementing C-CDA and have a few questions, which the answers may result in more questions (sorry), but any help you can provide would be appreciated. Thanks</p>\n<p>1) Need to know the specific HL7 C-CDA guide to use for unsolicited unstructured EDI Attachments. Is it this the correct guide? <a href=\"http://www.hl7.org/ccdasearch/templates/2.16.840.1.113883.10.20.22.1.10.html\">http://www.hl7.org/ccdasearch/templates/2.16.840.1.113883.10.20.22.1.10.html</a></p>\n<p>2) Need to know where in the HL7 C-CDA guide to clearly ID the structure of the HL7 unsolicited header data that we can expect to receive in the 275. We need to know where to find the list of fields in the guide; and possibly how to interpret the list of fields in the guide.</p>\n<p>3) Need to know the schema to use for unsolicited unstructured clinical data (e.g., operative notes, medical records, etc) and where in the header or body it denotes this. How do you figure out what schema to use for each type of unstructured attachment data? By the LOINC value? Root Number?</p>\n<p>4) Need to develop a list of items to know from the HL7 C-CDA guide for implementation.</p>",
        "id": 235569606,
        "sender_full_name": "rosemarie hodges",
        "timestamp": 1619034176
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191938\">@Durwin Day</span> <span class=\"user-mention\" data-user-id=\"193263\">@Christol Green</span> <span class=\"user-mention\" data-user-id=\"196996\">@Russell Ott</span> <br>\nPayer/Provider Information Exchange Work Group - Can someone from P/PIE respond please?</p>",
        "id": 236232316,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1619466419
    },
    {
        "content": "<p>Thanks MaryKay!!</p>",
        "id": 236383191,
        "sender_full_name": "rosemarie hodges",
        "timestamp": 1619546952
    },
    {
        "content": "<p>What would be very beneficial is having sample 275 with the BDS containing Medical Notes; and tie it back to the specific HL7 guide(s) (and/or template?) that are used to create the Medical Notes clinical data in the 275 BDS segment.</p>",
        "id": 236392545,
        "sender_full_name": "rosemarie hodges",
        "timestamp": 1619550745
    }
]