[
    {
        "content": "<p>During the week of January 18, 2021, HL7 is scheduled to begin capturing comments on CDA Implementation Guide (IG) specifications using Jira.  The Confluence post announcing deployment of the change states, \"In order to standardize how comments are captured across HL7, we are moving to JIRA. A JIRA Specification Feedback Project has been created for each of the Product Families – CDA, V2 and FHIR.\"  </p>\n<p>The CDA Management Group (CMG) has worked closely with the HL7 team implementing the changes. \"We see this as a positive step forward that helps us harmonize efforts across the HL7 product families and reduces cognitive burden for HL7 members who contribute to the development and maintenance of V2, CDA, and FHIR specifications,\" says CMG Co-Chair Lisa Nelson. </p>\n<p>The <a href=\"https://confluence.hl7.org/display/CIC/Jira+Specification+Feedback+Implementation\">full announcement</a> is available on Confluence.</p>\n<p><strong>Does this change how comments are made and managed for HL7 STU Specifications?</strong></p>\n<p>Yes. Starting the week of January 18, 2021, comments on STU specifications will be made in JIRA and not on the STU Comment Page. </p>\n<p><strong>Will existing comments be migrated from the STU Comment Page to Jira?</strong></p>\n<p>Yes and No. Yes, existing comments for Active STU specifications and STU specifications that expired in 2020 have been migrated to JIRA. No, comments on STUs that expired before 2020 will not be migrated.  The Expired STU page will continue to be available as read-only.</p>\n<p><strong>How will the <a href=\"http://HL7.org\">HL7.org</a> website be modified to make this change evident to visitors seeking to make or review comments?</strong></p>\n<p>Links to the appropriate JIRA project have been added to the Product Brief for each STU Specification that is accepting feedback.  In addition, a link to the JIRA Specification Feedback Projects has been added to the HL7 Website on the Standards Page.</p>\n<p><strong>What does this change mean for commenters and Work Groups who manage comment feedback?</strong></p>\n<p>Once the JIRA projects are rolled out, comments that you wish to make on specifications will be entered into JIRA.  You must register as a user on HL7’s Confluence and Jira systems.</p>\n<p>You can find more information about how to comment in Confluence: Specification Feedback and in these instructive resources:</p>\n<p>How to <a href=\"https://confluence.hl7.org/display/HL7/Specification+Feedback\">Create an Issue</a> in HL7 JIRA <br>\nHow to <a href=\"https://confluence.hl7.org/display/HL7/Managing+Specification+Feedback\">Manage Issues</a> in HL7 JIRA</p>",
        "id": 223019449,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1610850517
    },
    {
        "content": "<p><strong>Jira Specification Feedback process has been delayed</strong></p>\n<p>On January 18, 2021, Melva Peters announced the implementation of the Jira Specification Feedback process has been delayed.  \"We are working through some issues with the import of the STU Comments and hope that they can be resolved in the next few days,\" Melva explained.   </p>\n<p>HL7 will notify the community when a new date is planned for the migration and rollout.</p>",
        "id": 223163344,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1611003538
    }
]