[
    {
        "content": "<p>The CDA Management Group is seeking an additional member from the EHR Community to join our team. We also have an opening for a member representing an international perspective for the CDA community. If you are in a position to represent the interests and perspectives of either of these stakeholder groups and you would like to learn more about what it means to serve as a representative on the CDA Management Group, please reach out to @Lisa Nelson or @Linda Michaelsen.</p>",
        "id": 259115230,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1635262464
    },
    {
        "content": "<p><strong>CMG Opening for EHR Stakeholder and International Representation </strong></p>\n<p>The CDA Management Group is seeking an additional member from the Inpatient EHR Community to join our team. We also have an opening for a member representing an international perspective for the CDA community. If you are in a position to represent the interests and perspectives of either of these stakeholder groups and you would like to learn more about what it means to serve as a representative on the CDA Management Group, please reach out to @Lisa Nelson or @Linda Michaelsen.   </p>\n<p><strong>Desired skill set for a member of CDA-MG:</strong></p>\n<ul>\n<li>Good verbal and written communication skills are necessary.</li>\n<li>Experience with HL7 CDA standards is necessary, as is a record of active involvement with HL7 international committees and/or active participation on the listservs.</li>\n<li>Interest or experience in standards management processes.</li>\n</ul>\n<p><strong>Responsibilities/Expectations:</strong></p>\n<ul>\n<li>CDA-MG members MUST be able to routinely attend 1 hour weekly teleconferences.</li>\n<li>CDA-MG members MUST be able to attend at least two WGMs per year; preferably all three.</li>\n<li>CDA-MG members must be active participants in HL7 CDA standards development.</li>\n</ul>",
        "id": 261672625,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1637082141
    }
]