[
    {
        "content": "<p>SAVE THE DATE The next virtual C-CDA Implementation-A-Thon is scheduled for Wednesday, October 27, 2021! If you have a topic you would like to know more about or to share with the community,  visit <a href=\"https://confluence.hl7.org/display/IAT/Topic+Suggestions+for+2021.10.27+C-CDA+IAT\">https://confluence.hl7.org/display/IAT/Topic+Suggestions+for+2021.10.27+C-CDA+IAT</a> and we will be in touch. Also, you can watch the Confluence page for the IAT for updates about registration and agenda topics here <a href=\"https://confluence.hl7.org/display/IAT/2021.10.27+Virtual+IAT+Track+Agenda\">https://confluence.hl7.org/display/IAT/2021.10.27+Virtual+IAT+Track+Agenda</a></p>",
        "id": 249274483,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1628793167
    },
    {
        "content": "<p>Registration is open! <a href=\"https://www.hl7.org/events/c-cda/implementation/2021/10/\">https://www.hl7.org/events/c-cda/implementation/2021/10/</a></p>\n<p>On October 27-28 2021, the CDA community will be addressing issues that cause challenges for implementers today and preparing new guidance developed for USCDI v2.  </p>\n<p>This virtual event promises to be packed with useful information you need to manage your product roadmap for C-CDA support. We will cover some of today’s most urgent implementer needs and provide updates on changes resulting from prior Implementation-A-Thons. </p>\n<p>Topics are presented by C-CDA implementers such as: Allscripts, Cerner, Epic, MIE and the Commonwell/Carequality communities. You’ll be directly involved in creating implementer guidance that will be introduced in a new version of the C-CDA Companion Guide and a new version of the Concise Consolidated CDA IG for deploying Encounter Summary and Patient Summary Documents. Subject matter experts from the Gravity Project will be collaborating with participants to establish C-CDA templates for representing SDOH information in clinical documents using new coding guidance developed in this FHIR Accelerator.  </p>\n<p>Representatives from the ONC will be there to talk with you about the use and testing of C-CDA document exchange to drive interoperability, and to provide insight into what comes next for the ever-evolving USCDI process. You’ll have a chance to contribute requirements for a new Value Set comparison tool that may be created to help implementers evaluate annual changes in C-CDA value sets.</p>\n<p>We invite you and the implementers in your community to be a part of shaping the future of C-CDA.</p>",
        "id": 256226829,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1633433570
    },
    {
        "content": "<p><strong>C-CDA Implementation-A-Thon Call for Examples</strong></p>\n<p>Send examples to <a href=\"mailto:iatsamples@dynamichealthit.com\">iatsamples@dynamichealthit.com</a> and you’ll be entered into a drawing for great gear from the HL7 merchandize store.</p>\n<p>Examples should demonstrate:<br>\n1.  Use of templates defined in the C-CDA Companion Guide R2<br>\n2.  Use of existing templates that are relevant for representing USCDI V2 data elements<br>\n3.  C-CDA examples of all types of allergy concerns to support transformation to FHIR. (Or C-CDA on FHIR documents with allergy-intollerance resources that could be transformed to C-CDA.)</p>\n<p>Send examples before October 27th (start of C-CDA Implementation-A-Thon) to win prizes from HL7!</p>\n<p>Don’t wait!  Send examples ASAP. There might be a prize for being first to submit.</p>",
        "id": 258213532,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1634656757
    }
]