[
    {
        "content": "<p><strong>If you're interested in the future of CDA, SDWG is the place to be on Thursday Jan 28, Q4.</strong></p>\n<p>Earlier today on the HL7 cochairs listserve Structured Documents Work Group Co-Chair Austin Kreisler announced an invitation from the Structured Documents work group and CDA Management Group  to join a discussion regarding the future plans for the CDA Standard. We are holding this discussion during 4th Quarter on Thursday, Jan 28th in the scheduled Structured Documents meeting during the current WGM. The first part of the quarter is devoted to a review of current status of the CDA 2.1 Education Module development by Calvin Beebe. This should provide a good back ground on the current state of the core CDA Standard and will lead into a discussion of our plans for advancing the CDA Standard in the future.</p>\n<p>Please amplify this invitation in other Zulip Streams to help get the word out. We are seeking involvement from all work groups who have developed or is planning to develop CDA Implementation Guides, or if your work group members are active users of the CDA Standard.</p>",
        "id": 224233483,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1611775025
    },
    {
        "content": "<p><strong> HL7 CDA Management Announcement on the Future of the CDA Standard </strong></p>\n<p>Many have asked about the future of CDA given the HL7 Re-envisioning “Focus” principle's emphasis on FHIR. The purpose of this announcement is to reaffirm that HL7 is committed to supporting the CDA implementer community. That means continued development and maintenance of CDA implementation guides based on CDA R2.0, and preparation of a roadmap of planned activities to address CDA convergence with FHIR.    The CDA Management Group continues to support critical CDA projects such as the International Patient Summary (IPS) and pharmacy templates. HL7 also has recently introduced a new Online Navigation tool for C-CDA R2.1 that makes the existing implementation guide and companion guide easily accessible and searchable from the web. Part of the roadmap to FHIR includes developing a new web publication approach for publishing CDA implementation guides with FHIR Tooling. </p>\n<p>The CDA Management Group will be sharing additional details about the CDA Roadmap as it develops in the coming months.</p>",
        "id": 231961179,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1616764329
    }
]