[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191318\">@nicola (RIO/SS)</span> мы хотим поучаствовать в FHIR Connectathon 19 и думаю, что от самураев кто-то тоже собирается ехать, так что хорошо иметь топик для обсуждения. </p>\n<p>Еще у меня есть несколько вопросов и может кто-то знает на них ответы:<br>\n1. Сам Connectathon проходит только в первый день 2018 HL7's 32nd Annual Plenary &amp; Working Group Mee, есть ли смысл участвовать в остальной недельной программе? Кстати, на странице <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_19\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_19\">http://wiki.hl7.org/index.php?title=FHIR_Connectathon_19</a> говорится про два дня, а при регистрации написано, что только 29го.<br>\n2. Есть 2 опции регистрации - участник и наблюдатель, нужно ли как-то подтверждать, что собираешься быть участником?<br>\n3. Почему при регистрации нет опции регистрации и на Connectathon и на остальную неделю? Есть опции только коннектатон 29го и остальная неделя с 30 сентября по 5 октября.</p>",
        "id": 153972669,
        "sender_full_name": "Alexander Ivanov",
        "timestamp": 1530359087
    },
    {
        "content": "<p>отлично, я уточню детали. Обычно коннектатон проходит отдельно и регистрация на него тоже</p>",
        "id": 153972670,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1530359213
    },
    {
        "content": "<p>#1 the connectathon does go for 2 full days, but for historical reasons, the registration counts it as one day + international council day. It would be really food for you to stay for the rest of the week and go to the committee meeting</p>\n<p>#2 - you'd be a participant. We discourage observers.... it's not a spectator sport ;-)</p>\n<p>#3 again, historical..... the overall registration process is very complex, so I haven't really pushed it. If, once you've decided what you want to attend, and you can't figure out how to register for it, let me know and I'll try to get it sorted </p>\n<p>btw - great that you're coming!</p>",
        "id": 153972675,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530362238
    },
    {
        "content": "<p>There's also the FHIR Applications Roundtable on the 27/28.  It's in a different venue, but only about 45 minutes away. </p>\n<ul>\n<li>The Roundtable is a whole bunch of short presentations about what different groups are doing with FHIR.  (You'd be very welcome to present too.) </li>\n<li>The Connectathon is 2 straight days of working with FHIR on a specific \"track\".  (You can see the candidate tracks here: <a href=\"http://wiki.hl7.org/index.php?title=Category:201809_FHIR_Connectathon_Track_Proposals\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Category:201809_FHIR_Connectathon_Track_Proposals\">http://wiki.hl7.org/index.php?title=Category:201809_FHIR_Connectathon_Track_Proposals</a>)</li>\n<li>The WGM is where we will work through issues with the specification.  There are also tutorials and a receiption on Wed. night.  You can see the schedule from the <em>May</em> WGM here: <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Agenda_201805_WGM\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Agenda_201805_WGM\">http://wiki.hl7.org/index.php?title=FHIR_Agenda_201805_WGM</a>.  (Unfortunately, the schedule for Sept. won't be finalized until about a week before the meeting.)  Nothing much happens on the Friday, so that might be a good day to tour around Washington DC.</li>\n</ul>",
        "id": 153972680,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530368235
    },
    {
        "content": "<p>Thank you, it's very helpful. </p>\n<p>Is there any registration needed for FHIR Applications Roundtable? </p>\n<p>Are marked options right to participate in Connectathon and WGM?<br>\n<a href=\"/user_uploads/10155/2NoMjbYDLmMGwT33aJJ_GOpI/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/2NoMjbYDLmMGwT33aJJ_GOpI/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/2NoMjbYDLmMGwT33aJJ_GOpI/pasted_image.png\"></a></div>",
        "id": 153972684,
        "sender_full_name": "Alexander Ivanov",
        "timestamp": 1530370220
    },
    {
        "content": "<p>The roundtable is a separate event.  Information on registration is here: <a href=\"http://www.hl7.org/events/fhir/roundtable/2018/09\" target=\"_blank\" title=\"http://www.hl7.org/events/fhir/roundtable/2018/09\">http://www.hl7.org/events/fhir/roundtable/2018/09</a><br>\nTo participate in the Connectathon, select \"Monday-Friday\", then also choose the Connectathon Participant.  (The Sunday-Friday option is for those who have other meetings on the Sunday, not for the Connectathon)</p>",
        "id": 153972685,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530370479
    }
]