[
    {
        "content": "<p>I finally got some time to look at hacking some tooling for example generation based on our latest structuredefs and I have to say that our \"inheritance\" framework works against usability of the end result structuredefs. It forces an implementer to adopt the inheritance structure rather if they want to get any use at all out of the \"differential\" view.</p>",
        "id": 193040134,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1586179271
    },
    {
        "content": "<p>We can copy/paste those attributes to all profiles if you prefer?  While that sounds sort of yucky, there are not many attributes and they haven't changed much.</p>",
        "id": 193040563,
        "sender_full_name": "Kevin Power",
        "timestamp": 1586179448
    },
    {
        "content": "<p>I think if we tagged \"must support\" on the instantiable profiles the fields I'm missing would show up in differential, so just another reminder we need to make up our minds+guidance there</p>",
        "id": 193041017,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1586179670
    },
    {
        "content": "<p>I'll test it when I get the chance to see if I'm happy with what comes through to the differential in that case... Anyone else try building from the actual structuredefs? I got tired of manually updating fields/bindings as we iterate</p>",
        "id": 193041416,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1586179823
    },
    {
        "content": "<p>Hmmm, flagging something as Must Support just for this reason seems heavy handed to me.</p>",
        "id": 193041645,
        "sender_full_name": "Kevin Power",
        "timestamp": 1586179912
    },
    {
        "content": "<p>I think it's certainly not the only reason to flag concepts as must support, but this highlights one of the few substantial repercussions of (not) doing it.</p>\n<p>Also if the snapshot view were better I wouldn't have this complaint but snapshot on diagnostic-implication has 112 elements which is ridiculous</p>",
        "id": 193042298,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1586180194
    },
    {
        "content": "<p>I will have to admit I haven't done this, so I don't have any \"additional guidance\" (valueString) to give you ;)</p>",
        "id": 193042962,
        "sender_full_name": "Kevin Power",
        "timestamp": 1586180524
    },
    {
        "content": "<p>just a note, inheritance is a loaded word. in this space, took me a bit to realize that the thread was not about genetics but FHIR. Ha!</p>",
        "id": 196303101,
        "sender_full_name": "Bret H",
        "timestamp": 1588683305
    }
]