[
    {
        "content": "<p>All,</p>\n<p>Today's discussion about examples reminded me I had yet to push my examples from the end of November up to a branch.  <br>\n I had converted 18 old examples for the IG  from .json into .fsh and back through sushi. During the process I found a variety of points where sushi failed.  Some of these seemed to be due to non conformance in the original .json and were fixed so most of the new .json file may now render.  I finally pushed them up to my krp branch this evening.</p>\n<p>I'm not sure if these are of value going forward, but it would be great if s.o. could run the branch to see if it will build in any case.</p>",
        "id": 223988965,
        "sender_full_name": "Kevin Roberg-Perez",
        "timestamp": 1611626357
    },
    {
        "content": "<p>It looks like you branch built ok? I might try to review it tomorrow. Any merge conflicts?</p>",
        "id": 223994160,
        "sender_full_name": "Kevin Power",
        "timestamp": 1611632505
    },
    {
        "content": "<p>seems okay. <span class=\"user-mention\" data-user-id=\"363407\">@Kevin Roberg-Perez</span> - could you create a Pull Request for review that would enable review and embedded comments by multiple folks? It also nicely shows side-by-side comparisons of every file changed by line.</p>",
        "id": 223994310,
        "sender_full_name": "May Terry",
        "timestamp": 1611632710
    },
    {
        "content": "<p>Thanks Kevin and May.  Put the pull request in, but to be clear, the original .json files did not exist in the clone I used for the branch. The only files there were the Patient and Specimen files may created from .fsh. So merging is not a problem.</p>",
        "id": 224034474,
        "sender_full_name": "Kevin Roberg-Perez",
        "timestamp": 1611665982
    },
    {
        "content": "<p>The most important thing is to look at the build (if I have the terminology correct) in a browser. Back when Jamie went over the original pages with me, there were several that did not render correctly.</p>",
        "id": 224034923,
        "sender_full_name": "Kevin Roberg-Perez",
        "timestamp": 1611666233
    },
    {
        "content": "<p>OK, so <span class=\"user-mention\" data-user-id=\"363407\">@Kevin Roberg-Perez</span> - I reviewed your branch and several of the examples, and I think they look good. However, it doesn't look like all the examples are listed on the artifacts page, found here:<br>\n<a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/branches/krp/artifacts.html#examples\">http://build.fhir.org/ig/HL7/genomics-reporting/branches/krp/artifacts.html#examples</a><br>\nThis is nothing you broke, but would you will willing to determine which examples are missing and add them to the list? If not, I can probably do this as part of the work I will be doing to categorize the examples, but welcome you to do it <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 224044071,
        "sender_full_name": "Kevin Power",
        "timestamp": 1611670498
    },
    {
        "content": "<p>Seems there is an error here:<br>\n<a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/branches/krp/Observation-obs-idh-ex.html\">http://build.fhir.org/ig/HL7/genomics-reporting/branches/krp/Observation-obs-idh-ex.html</a></p>",
        "id": 224045850,
        "sender_full_name": "Kevin Power",
        "timestamp": 1611671267
    },
    {
        "content": "<p>Glad to do it, Kevin.</p>",
        "id": 224053002,
        "sender_full_name": "Kevin Roberg-Perez",
        "timestamp": 1611674143
    },
    {
        "content": "<p>The following PR was created for review and includes a small addition - a simple example for RegionStudied: <a href=\"https://github.com/HL7/genomics-reporting/pull/38\">https://github.com/HL7/genomics-reporting/pull/38</a></p>",
        "id": 224076710,
        "sender_full_name": "May Terry",
        "timestamp": 1611683462
    }
]