[
    {
        "content": "<p>Every time i hear GACS it makes me wince. I still don't really like the term as it confuses the implementer. <br>\nIn the end we have FHIR Endpoints, thats it. If there is a Facade behind it, a VCF sore being analyzed real time or a plain hapi server.</p>",
        "id": 194822668,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1587484382
    },
    {
        "content": "<p>GACS is a term related to PACS. Is there a particular reason that it is confusing?</p>",
        "id": 196302735,
        "sender_full_name": "Bret H",
        "timestamp": 1588683079
    },
    {
        "content": "<p>Yes, people new to genomics are getting confused. They wonder where to get a GACS, is it Standards based?<br>\nDoes it use FHIR? <br>\nTbh i don't see value in calling it GACS, its just an CG IG complient FHIR Endpoint.</p>",
        "id": 196304497,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1588683979
    },
    {
        "content": "<p>yeah. we could use a more generic term as well. There are a few publications out there on it. GACS is an architectural design choice . Its well known in some circles and is a name meant to appeal to the clinical laboratory professionals (not more generalized developers). Fair point on the confusion. But it is a reasonable term to use in the genomics space. hmm...do we use the term a  lot in guidance? perhaps we need to define it somewhere visible?</p>",
        "id": 196304974,
        "sender_full_name": "Bret H",
        "timestamp": 1588684207
    },
    {
        "content": "<p>what do you think?</p>",
        "id": 196305072,
        "sender_full_name": "Bret H",
        "timestamp": 1588684272
    },
    {
        "content": "<p>I think the group should communicate such things in a coordinated manner. The push for this term was not well communicated in this group i guess. <br>\nI agree, now the term is out there, and i see the PACS analogy. <br>\nMaybe a section in the IG about GACS could be helpful?</p>",
        "id": 196305337,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1588684413
    },
    {
        "content": "<p>So people understand that a GACS is not black magic, its just a FHIR Endpoint, using our IG, Facading more or less raw genomic data</p>",
        "id": 196305434,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1588684450
    },
    {
        "content": "<p>Might be a good subsection for operations.html</p>",
        "id": 196308785,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1588686075
    }
]