[
    {
        "content": "<p>Hi all - I just committed with the new publisher and restored the examples with MolecularSequence.  Anyone have plans for this week?</p>",
        "id": 154015649,
        "sender_full_name": "Kevin Power",
        "timestamp": 1541429557
    },
    {
        "content": "<p>I should have time to add in the text for the 4 that are currently assigned to me today, shouldn't affect any files not in pagecontent</p>",
        "id": 154015690,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1541438981
    },
    {
        "content": "<p>Actually <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16513\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16513\">GF#16513</a> will take some thought as I don't recall where we fully landed on for the Glossary... but the other 3 I can take out</p>",
        "id": 154015692,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1541439206
    },
    {
        "content": "<p>RE: Glossary - might be worth asking the WG if the work we did on the 'Background' document suffices for the next release?</p>",
        "id": 154015693,
        "sender_full_name": "Kevin Power",
        "timestamp": 1541439243
    },
    {
        "content": "<p>Yeah, we ended up structuring the background more like a glossary anyways (for the major terms at least). What I'd like to see is an automatically generated glossary of our component definitions, the current format for viewing them is not very intuitive.</p>",
        "id": 154015697,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1541439506
    },
    {
        "content": "<p>I do like the idea of auto generating something, but likely won't have time for it before the cutoff. I was just thinking that if we had the OK from the commenter about the glossary that they current background document is sufficient for now, we wouldn't have to build something more specific for the next ballot.</p>",
        "id": 154015704,
        "sender_full_name": "Kevin Power",
        "timestamp": 1541442495
    },
    {
        "content": "<p>Just FYI for the group - The IG is failing to build right now, and it seems to be an issue with the IGPublisher.  It may be the weekend before anyone is able to investigate.</p>",
        "id": 154016652,
        "sender_full_name": "Kevin Power",
        "timestamp": 1541685999
    },
    {
        "content": "<p>I did commit changes for Region Studied today.  The online build not working won't allow others to see, but if you pull down master, you can review it locally if you wish.</p>",
        "id": 154017318,
        "sender_full_name": "Kevin Power",
        "timestamp": 1541803625
    }
]