[
    {
        "content": "<p>Can someone remind me why (or if) an excel spreadsheet is stilling being used to update our IG? can we move to XML of the diff section of profiles?  Many thanks! I understand that the spreadsheet is a deprecated mechanism for updating/creating profiles? <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>  do we have some dependency? again, thank you.</p>",
        "id": 161891459,
        "sender_full_name": "Bret H",
        "timestamp": 1553714017
    },
    {
        "content": "<p>Spreadsheets have been \"theoretically\" deprecated for 2 years.   However, in practice they're still one of the best authoring mechanisms.  Forge doesn't (ever) support the 'current' release of FHIR.  Trifolia has shown significant progress, but for some things spreadsheets are still easier.  We can switch to using raw XML for authoring at any time, but that's a lot harder to write than the spreadsheets.</p>",
        "id": 161892520,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553714762
    },
    {
        "content": "<p>At Intermountain we created an application to write the diff xml based on clinical models. The clinical models are pretty clean...but I digress. I would find it faster, and more accurate, to write diff xml.</p>",
        "id": 162289172,
        "sender_full_name": "Bret H",
        "timestamp": 1554161604
    },
    {
        "content": "<p>What are you trying to diff Bret?  Changes to our profiles?</p>",
        "id": 162293199,
        "sender_full_name": "Kevin Power",
        "timestamp": 1554166218
    },
    {
        "content": "<p>To clarify, I am referring to working with profiles using XML representing the differential section of the profile XML. You can build your profiles using the abbreviated differential section. It's fast and indicates very clearly where changes to the 'parent' profile are occurring. I think i misled you Kevin by using the abbrv of diff. <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span></p>",
        "id": 162529993,
        "sender_full_name": "Bret H",
        "timestamp": 1554388011
    },
    {
        "content": "<p>Ahh, I get it.  Makes sense.</p>",
        "id": 162531509,
        "sender_full_name": "Kevin Power",
        "timestamp": 1554388893
    }
]