[
    {
        "content": "<p>Hi all - I reviewed some feedback we got from FMG after our publication request, and made some changes over the weekend and this morning.  The changes were pretty simple, but very wide spread. I welcome any/all reviews and feedback.</p>",
        "id": 276058536,
        "sender_full_name": "Kevin Power",
        "timestamp": 1647873037
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> added an example for a DiagnosticImplication, and used 'derivedFrom()' as a set of logical references, such as the following:</p>\n<ul>\n<li>derivedFrom[0].display = \"Variant 1\"</li>\n<li>derivedFrom[0].identifier.system = \"<a href=\"http://hospital.example.org\">http://hospital.example.org</a>\"</li>\n<li>derivedFrom[0].identifier.value = \"11\"</li>\n</ul>\n<p>We do limit the 'derivedFrom' to Variant, Genotype, Haplotype. Anyone have concerns with using logical references? Of course, FHIR allows for it. I will plan to 'ignore' the message we are seeing in the QA for now, unless someone objects.</p>",
        "id": 276103248,
        "sender_full_name": "Kevin Power",
        "timestamp": 1647891494
    },
    {
        "content": "<p>was the QA message a warning that is being seen after a ignore has been removed? I followed other examples both from our IG and Core FHIR. So, I'm curious what the QA signal is. Don't recall seeing it.</p>",
        "id": 276112967,
        "sender_full_name": "Bret H",
        "timestamp": 1647896412
    },
    {
        "content": "<p>A QA message was generated by how we do the logical reference. Upon review, if the QA message if a warning or informational, we can decide if it is acceptable. We indicate it is acceptable by adding the error message to the 'ignoreWarnings.txt' file found in the IG, at which point the Publisher will no longer report that QA message.</p>\n<p>In this case, to help prove the point of keeping the items we ignore as specific as we can, I had used a really generic 'hey, ignore all slice info QA messages for DiagnosticImplication' - so that is why you didn't see it show up in the QA when you added it and did the build.</p>",
        "id": 276113615,
        "sender_full_name": "Kevin Power",
        "timestamp": 1647896708
    },
    {
        "content": "<p>so it's an informational QA statement?</p>",
        "id": 276113791,
        "sender_full_name": "Bret H",
        "timestamp": 1647896810
    },
    {
        "content": "<p>Correct. </p>\n<p>I will add that even for informational messages, it is still best practice to evaluate each QA message. Once we validate the usage is appropriate and the QA message can be ignored, we add the message (as specific as possible) to the 'ignoreWarnings.txt' file along with a comment as to why we think it is OK.</p>",
        "id": 276114246,
        "sender_full_name": "Kevin Power",
        "timestamp": 1647897069
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 276120750,
        "sender_full_name": "Bret H",
        "timestamp": 1647900722
    },
    {
        "content": "<p>thanks Kevin, looking good!</p>",
        "id": 276202978,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1647961731
    },
    {
        "content": "<p>i removed the redundant 0 usages from warnings: <a href=\"https://github.com/HL7/genomics-reporting/pull/58\">https://github.com/HL7/genomics-reporting/pull/58</a></p>",
        "id": 276209588,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1647964186
    },
    {
        "content": "<p>cleaned my cache, updated the publisher, works (also mac)</p>",
        "id": 276209646,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1647964202
    },
    {
        "content": "<p>Welp, we will see if the cloud build throws the warnings again <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 276209774,
        "sender_full_name": "Kevin Power",
        "timestamp": 1647964239
    },
    {
        "content": "<p>i got some 'The string value contains text that looks like embedded HTML tags. If this content is rendered to HTML without appropriate post-processing, it may be a security risk' in my local build</p>",
        "id": 276209799,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1647964248
    },
    {
        "content": "<p>If the errors are comming back, ill createn an issue and fix the warnings again</p>",
        "id": 276209858,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1647964268
    },
    {
        "content": "<p>Looks like the build worked fine, no other warnings. So maybe it was a caching thing.</p>",
        "id": 276210969,
        "sender_full_name": "Kevin Power",
        "timestamp": 1647964642
    },
    {
        "content": "<p>Welp, FYI. When I download the change from <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> and build locally, I still get the warnings (with or without my cache). However, I left just the two that Patrick left and for now will ignore the warnings I see. I pushed up some improved comments, and we will see if the cloud build still works correctly.</p>",
        "id": 276221592,
        "sender_full_name": "Kevin Power",
        "timestamp": 1647968627
    },
    {
        "content": "<p>And the cloud build just finished, and no warnings were logged (meaning things worked as expected). So perhaps the weirdness is something just for me to deal with <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 276221913,
        "sender_full_name": "Kevin Power",
        "timestamp": 1647968729
    },
    {
        "content": "<p>that's really odd. We can also add it back if you prefer</p>",
        "id": 276307959,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1648028732
    },
    {
        "content": "<p>Nah that is OK. It looks cleaner this way. If anyone else ever notices it, we can add it back or investigate further.</p>",
        "id": 276480843,
        "sender_full_name": "Kevin Power",
        "timestamp": 1648131185
    }
]