[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> and I need to include Report Comments to Genomics Report Profile. Following up on feedback from <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  at <a href=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Notes.20on.20Observations.20and.20DR\" title=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Notes.20on.20Observations.20and.20DR\">https://chat.fhir.org/#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Notes.20on.20Observations.20and.20DR</a>, we planning to attach Report Comments as an Observation to the Results element array.  However the Results slices currently in Genomics Report do not include a generic Observation option; can a result slice be added for the Observation resource to Genomics Report profile ( I apologize if I misunderstood the concept of slices)? <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span></p>",
        "id": 174876421,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1567600273
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> Yes we don't have included an explicit generic slice. But the slicing is open, which means that you can add any Observation you like to DiagnosticReport.result. (If you look at the slicing of GenomicReport you see: Unordered, Open by pattern:resolve().code. The word \"open\" shows that you can add anything beside the defined slices)</p>",
        "id": 174882286,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1567604186
    },
    {
        "content": "<p>But we should add a slice for this specific purpose to our IG.</p>",
        "id": 174883933,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1567605308
    },
    {
        "content": "<p>Thx <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>,  we will go ahead and add Report Comments Observation to Genomics Report. But yes, I do concur that we should specifically add a comments slice so that it is called out and also possibly add another generic Observation slice?</p>",
        "id": 174889638,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1567608917
    },
    {
        "content": "<p>We previously voted to specifically allow other observation results and updated the text/diagrams so we should probably add it into the slicing as well</p>",
        "id": 175673539,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1568418076
    },
    {
        "content": "<p>There was some discussion to have dedicated coded component slices for that. I liked the idea, bit i am uncertain if it will make into the ig for the next publish. But we should add this asap</p>",
        "id": 175679822,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1568428328
    }
]