[
    {
        "content": "<p>Just side tracking from the Sequence/Observation discussion but on related issues. People have mentioned storage/reference of Fastq, BAM etc (ignoring VCF for the moment)</p>\n<p>Our context is slightly different from purely at the reporting end - our system allows our users to submit fastqs (and bams) which we process through pipelines and then store the generated artifacts for them (accessible via FHIR apis). So they can submit the location of a fastq, then when the pipeline has finished, ask about where the bams generated now live (along with the fastqs). We also do the reporting bit at the end - but to solve our input/storage problem we just made some extensions that utilise location urls (s3://.... etc). </p>\n<p>However, our modelling suggested these artifacts are properties of Specimens, NOT properties of Patients. i.e a Fastq pair belongs to a specimen. DocumentReference doesn't allow the subject of document to be a Specimen. Are we wrong in our modelling? Or is this a use case to extend the subject types of DocumentReference? Or should we be doing this entirely differently?</p>",
        "id": 153998441,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1537403085
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191649\">@Andrew Patterson</span> for breaking out this conversation.  You touch on some important considerations.</p>\n<ul>\n<li>How should we handle FASTQ/BAM type files in FHIR?</li>\n</ul>\n<p>I have thought \"no\" - partially because I wasn't sure how well it aligned with FHIR in general, partially because I wasn't sure we wanted VERY large bulky items in FHIR, but mostly because it seems to fall into the GA4GH realm.<br>\nThe first point should probably be asked/debated on the <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a>  channel.<br>\nThe second point could be mitigated by not including the contents but instead a url.<br>\nI still can't quite get past the third point, and I think part of our other discussion (my point #4 about documenting the boundaries between FHIR and GA4GH).</p>\n<ul>\n<li>If I assume we can/should consider this, your question about DocumentReference is a good one, and one that makes me wonder how good of a match it is for these sorts of use cases.  There would be other options:</li>\n</ul>\n<p><em>Sequence.repository</em> (which may be awkward since there really isn't a call sequence yet when you are talking about some of these artifacts.<br>\n<em>Observation.derivedFrom(Media).content(Attachment).url</em> <br>\n<em>Observation.derivedFrom(DocumentReference).content.attachment(Attachment).url</em><br>\n<em>DiagnosticReport.media(Media).content(Attachment).url</em></p>\n<p>Do others have thoughts?</p>",
        "id": 153998598,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537451941
    },
    {
        "content": "<p>here is a related chat from implementers about Observation.attachment<br>\n<a href=\"#narrow/stream/4-implementers/subject/Observation.20value.20attachment\" title=\"#narrow/stream/4-implementers/subject/Observation.20value.20attachment\">https://chat.fhir.org/#narrow/stream/4-implementers/subject/Observation.20value.20attachment</a></p>",
        "id": 153998603,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537453191
    },
    {
        "content": "<p>In addition to the generic <em>Media</em> and <em>Attachment</em> resources, it may also be worthwhile to review the Imaging Integration WG's DICOM efforts with the <em>ImagingStudy</em> and <em>ImagingManifest</em> resources, to look for any useful comparisons or parallels.</p>",
        "id": 153998722,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1537472157
    }
]