[
    {
        "content": "<p>Bad? Genetics example 3 in core Observation Resource <br>\nTake a look at <a href=\"http://build.fhir.org/observation-example-genetics-3.json.html\" target=\"_blank\" title=\"http://build.fhir.org/observation-example-genetics-3.json.html\">http://build.fhir.org/observation-example-genetics-3.json.html</a> While the example is conformant to the Observation Resource, I am concerned about this example. It is patently not conforming to the intention to remove computational barriers. At first glance it looks as if the instance is providing knowledge however the problem is more apparent with <a href=\"https://www.hl7.org/fhir/observation-example-genetics-4.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/observation-example-genetics-4.html\">https://www.hl7.org/fhir/observation-example-genetics-4.html</a> The genetics example 3 is refered to as a report of a variant.</p>\n<p>As a last resort one could place data into an instance of base Observation, using Observation.note, and call it conformant without using any extensions from observation for genetics, but this does not make a good example.</p>\n<p>Removing examples does not cause any breaking changes to FHIR core, it is purely superficial documentation modification.</p>\n<p>Recall, the IG uses components instead of extensions- this is a big difference...with 'core' showcasing our WGs past effort, built in a hurry and with expectation of updating, I think it is important to bring up on a call.</p>\n<p>I am asking the question of our WG sending a consistent message. Why keep outmoded examples in core? One can always look at DSTU3 and earlier versions of FHIR. I think it important that the normative version of the core spec, at least, not have examples that run counter to the clinical genomics WG's efforts.</p>\n<p>I suggest that simply culling a few examples can help with little negative impact.</p>",
        "id": 154659340,
        "sender_full_name": "Bret H",
        "timestamp": 1546967211
    },
    {
        "content": "<p>We can certainly yank (or fix) it for R5, but it's too late to touch R4</p>",
        "id": 154665026,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546971926
    },
    {
        "content": "<p>I volunteer to scan through all of FHIR for genomics examples and suggest edits or removal (this includes tracing through references) to align well. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  can you remind me if the target for normative balloting for Observation Resource was moved to R5? How do edits to examples for other HL7 products (V2) get included? versioning of the entire standard or versioning of the documentation?</p>",
        "id": 154737585,
        "sender_full_name": "Bret H",
        "timestamp": 1547051935
    },
    {
        "content": "<p>Observation is now normative (as of R4, published last week).  However, non-substantive changes such as adding/removing/changing examples is still fine for R5.  Changes to V2 would adhere to the v2 publication schedule, but I'm not sure what's happening there - you'd need to check w/ OO.</p>",
        "id": 154740137,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547053858
    },
    {
        "content": "<p>just a note: Technical correction request to FMG to remove the examples.<br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  you stopped by during the connectathon and mentioned a request for technical correction to be the way to ask for the example to be removed. Is a technical correction something that is applied to existing (e.g. public R4 documentation - website) versions of documentation or future versions of documentation (e.g. R5 public documentation)? and if I'm way off on my understanding, please let me know. Many thanks! Bret</p>",
        "id": 155178033,
        "sender_full_name": "Bret H",
        "timestamp": 1547566258
    },
    {
        "content": "<p>I proposed that you create a task proposing a technical correction to R4 to provide a very noticeable reference to the genomics IG once it's published  at the top of the page. A task to also remove it from R5 would be very appropriate</p>",
        "id": 155179412,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1547567161
    },
    {
        "content": "<p>thanks!</p>",
        "id": 155179500,
        "sender_full_name": "Bret H",
        "timestamp": 1547567198
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> Tracker for the note part: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19965\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19965\">GF#19965</a></p>",
        "id": 155179659,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1547567320
    }
]