[
    {
        "content": "<p>Hey all - Thanks to an assist from <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span>, I think we have completed the import of ballot comments. If you want to see a summary of the comments made, you can review our backlog, or if interested, see a summary starting from here:<br>\n<a href=\"https://jira.hl7.org/browse/BALDEF-1977\">https://jira.hl7.org/browse/BALDEF-1977</a></p>\n<p>PLEASE NOTE 1 - For those of you who just submitted comments via attached spreadsheets, or even just used comments into the Ballot Desktop 'Comment' field, I would ask that you review how the comments turned into JIRAs. BTW those who just shoved a lot of comment into the Ballot Desktop comment, it was <em>REALLY</em> hard to interpret, please don't make that a habit.</p>\n<p>PLEASE NOTE 2 - This BALDEF entry in JIRA does not fully reflect all the votes on the ballot. It only shows when someone submitted a comment of some sort. For the full details of the ballot tally (did we pass, total affirms/negs, etc ...), please use the ballot desktop.</p>\n<p>Enjoy, and please let me know if you see anything wrong.</p>",
        "id": 239782843,
        "sender_full_name": "Kevin Power",
        "timestamp": 1621616716
    },
    {
        "content": "<p>This is great work! I just reviewed quite a few of the trackers and there is much work to do in order to address them. Thank you so much Kevin and Jamie for taking on this \"unpleasant\" task and completing it <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span></p>",
        "id": 239791120,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1621620521
    },
    {
        "content": "<p>For anyone wondering, here are a few numbers:<br>\nTotal Votes:<br>\n  Aff: 32<br>\n  Neg: 11<br>\n  Abst: 68<br>\n  NV: 22</p>\n<p>Total Comments: 67<br>\nTotal Negative Comments: 29</p>",
        "id": 239802560,
        "sender_full_name": "Kevin Power",
        "timestamp": 1621625797
    },
    {
        "content": "<p>Can someone try to hit this link? It is all the JIRAs that were ballot comments, and checking if I made it available for everyone:<br>\n<a href=\"https://jira.hl7.org/issues/?filter=14531\">https://jira.hl7.org/issues/?filter=14531</a></p>",
        "id": 239817525,
        "sender_full_name": "Kevin Power",
        "timestamp": 1621634086
    },
    {
        "content": "<p>Works fine if you are logged in <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span></p>",
        "id": 239821629,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1621636725
    }
]