[
    {
        "content": "<p>Can someone explain me which needs the Beacon API fulfill, that the standard FHIR GC API and the GA4GH does not? That is, when does one want to use the Beacon API insted of the two former? Has it only to do with security, or is there something else as well?</p>\n<p>And is the Beacon API an open API that can be easily employed by researchers (and clinicians) in all countries?</p>\n<p>Thank you, and kind regards, Eva</p>",
        "id": 183056419,
        "sender_full_name": "EvaM",
        "timestamp": 1575982596
    },
    {
        "content": "<p>from  <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Beacon_API\" target=\"_blank\" title=\"https://developer.mozilla.org/en-US/docs/Web/API/Beacon_API\">https://developer.mozilla.org/en-US/docs/Web/API/Beacon_API</a> \"The Beacon interface addresses the needs of analytics and diagnostics code that typically attempts to send data to a web server before unloading the document. Sending the data any sooner may result in a missed opportunity to gather data. However, ensuring that the data is sent during the unloading of a document is something that has traditionally been difficult for developers.\"  <span class=\"user-mention\" data-user-id=\"246264\">@EvaM</span>  the FHIR API is much more specific to the structure of the messages, intended for HealthCare. Beacon API sounds more generic. I have not used Beacon. Hopefully someone who has will have more to say</p>",
        "id": 183079540,
        "sender_full_name": "Bret H",
        "timestamp": 1575997649
    },
    {
        "content": "<p>\"Example use cases of the Beacon API are logging activity and sending analytics data to the server\"</p>",
        "id": 183079650,
        "sender_full_name": "Bret H",
        "timestamp": 1575997707
    },
    {
        "content": "<p>The FHIR API also allows for querying medical information out of the box. I am not sure Beacon API would allow for that  as directly without additions to the API.</p>",
        "id": 183079738,
        "sender_full_name": "Bret H",
        "timestamp": 1575997769
    },
    {
        "content": "<p>i think this is about g4gh‘s beacon api: <a href=\"https://github.com/ga4gh-beacon/specification\" target=\"_blank\" title=\"https://github.com/ga4gh-beacon/specification\">https://github.com/ga4gh-beacon/specification</a></p>",
        "id": 183110218,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1576017488
    },
    {
        "content": "<p>And it is a project with no commits for a year, never a good sign.</p>",
        "id": 183110270,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1576017572
    },
    {
        "content": "<p>It seems GA4GH Beacon's main point is to be added to a genomic data server to allow researchers to easily query if a SNP/variation they are interested in is present in the server, so they could arrange to purchase/gain access to the data.</p>",
        "id": 183110526,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1576017822
    },
    {
        "content": "<p>My understanding is that it only responds with a 'yes' or 'no', does not expose any information on how many hits or non-hits or samples are stored.</p>",
        "id": 183110633,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1576017906
    },
    {
        "content": "<p>In this case it would be mainly for security of the data, and to assist in filtering through large amounts of available data sets to prioritize research efforts. </p>\n<p>I don't see clinicians having much use for Beacon, though a hospital EHR storing FHIR variants or MolecularSequences may be interested in setting it up to partner with research institutions.</p>",
        "id": 183111024,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1576018210
    },
    {
        "content": "<p>I suppose if one were to individually store patient-level genomic data in individual server \"beacons\", that could be useful to a clinician or a SMART-on-FHIR app, but I don't know of anyone who is doing this currently.</p>",
        "id": 183111353,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1576018450
    },
    {
        "content": "<p>Thank you all for answers!<br>\nDoes the Beacon API work between countries as well? That is, can one ask for variants (with yes/no answer to avoid GDPR) across all nations and institutes as long as they have the Beacon API?<br>\nIf yes, this platform sounds extremely useful for a way of datasharing that can evoid all the strong rules of data protection. Or am I misunderstanding something?</p>",
        "id": 183135216,
        "sender_full_name": "EvaM",
        "timestamp": 1576051748
    },
    {
        "content": "<p>And one more question; has the sequrity of the Beacon API evolved since the study which showed that in a beacon with 1,000 individuals, re-identification is possible with just 5,000 queries (see link below)?<br>\n<a href=\"https://www.cell.com/ajhg/fulltext/S0002-9297(15)00374-2\" target=\"_blank\" title=\"https://www.cell.com/ajhg/fulltext/S0002-9297(15)00374-2\">https://www.cell.com/ajhg/fulltext/S0002-9297(15)00374-2</a></p>",
        "id": 183136599,
        "sender_full_name": "EvaM",
        "timestamp": 1576053336
    },
    {
        "content": "<p>Hi Eva,</p>\n<p>I'm not aware of anyone on this stream being an expert in the Beacon API, but maybe <span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span> can identify someone who may have more knowledge on implementation details. Are you looking at hosting a genomic data server? More of a description of your intended use case would be very helpful.</p>\n<p>In terms of security concerns, that article is a fun read but from a quick review, I don't feel the hypothetical situation it proposes is realistic in today's data climate. Not only does it assume the attacker already knows the whole genome of the person in question, but it also assumes they know two things about the beacon that I don't believe it has to disclose: the number of individuals in the beacon, and the site frequency spectrum (SFS) of the population in the beacon... is this a situation you are concerned with in terms of data security?</p>",
        "id": 183169067,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1576078808
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"246264\">@EvaM</span> If you have continued questions about Beacon, it seems they have a Google group setup, so perhaps it will be a better forum for questions like this:<br>\n<a href=\"https://groups.google.com/forum/#!forum/ga4gh-beacon-network\" target=\"_blank\" title=\"https://groups.google.com/forum/#!forum/ga4gh-beacon-network\">https://groups.google.com/forum/#!forum/ga4gh-beacon-network</a></p>",
        "id": 183171417,
        "sender_full_name": "Kevin Power",
        "timestamp": 1576080137
    }
]