[
    {
        "content": "<p>Hello, we are working on creating a FHIR bundle for eMERGE Genetic Reports ( related information in the genomics / eMerge pilot stream). Our bundle includes a DR, Grouper Observations and related hasMember Observations associated with each Grouper Observation. Optional elements we are including in the DR and the Grouper include basedOn, subject, effective[], issued, performer, specimen and bodySite; additionally including the same elements in each of the hasMember Observations seems redundant. Though these are not mandatory elements and do not need to be included, as a general guideline or best practice,  what is the recommended approach particularly in terms of usage, computability and data integrity? Should we only include the specimen in the hasMember Observations for referential integrity and omit the rest?</p>",
        "id": 170586749,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1562799260
    },
    {
        "content": "<p>Redundancy is expected.  Every Observation should be shareable and queriable on its own.  FHIR never has context inheritance from other resourced.  Because the relationships are references, the redundancy should be pretty light in practise.</p>",
        "id": 170587802,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562800153
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  thanks for the feedback. We will include above mentioned elements in each of our Observations.</p>",
        "id": 170649086,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1562862730
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Here's a specific struggle we are having with representing the variation reported in a patient...</p>\n<p>We have recognized that the MolecularSequence resource provides the best means for representing the minimal set of genomic attributes that are the basis for defining the genomic variation calls that ultimately comprise a Genotype that is reported on a test result. So the MolecularSequence has optional fields for the patient and is a standalone resource in and of itself. If we supply the patient / subject id on the MolecularSequence so that it has context, it might be construed as something that was found in the patient. (but it may not have been found - we may simply be trying to define the variant that was being targeted to determine whether or not it was present). <br>\nWe are using the obsVariant profile (and obsGenotype profile) from the CG group to group the two MolecularSequence \"alleles\" that precisely represent the SNP, inDels, etc... that the NGS test was focused on for a given portion of the reported results.  These Molecular Sequence \"alleles\" the endpoints of the obsVariant.derivedFrom relationship so that it is clear when we link the final representation of the obsVariant to a higher level resource (Observation or DR) we can truly represent it as an Observation that this variant was Present or Absent while still have the underlying precise representation of the genomic MolecularSequences that are computationally useful. <br>\nAs it turns out there may be a number of MolecularSequence \"definitional\" records that are used and re-used by multiple higher level observations (Variant, Genotype, etc...) This is due to the nature of building complex genotype and haplotypes that the labs and clinicians find to be the best way to represent the primary form of variation that is signficant to the observation and assertions being made in the context of testing and interpretation.</p>\n<p>So, if we treat MolecularSequence as a non-patient specific resource is that okay?  And thus, how would that impact the shareablility and queriability of the Resource that you mention above? Are you limiting your response to only Observation resources and thus it is okay to be more vague with something like MolecularSequence?</p>\n<p>As always thanks for your insights and guidance, I'm not sure what we'd do without you.</p>",
        "id": 175717570,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568494060
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> you are speaking for EMERGE, right? (thanks for the clarification).</p>",
        "id": 175718221,
        "sender_full_name": "Bret H",
        "timestamp": 1568495166
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> can you post an example of your use of Molecular Sequence as an instance in FHIR? that would be very helpful.</p>",
        "id": 175718443,
        "sender_full_name": "Bret H",
        "timestamp": 1568495564
    },
    {
        "content": "<p>We had a definitional sequence profile in the IG last year and it was voted out of the draft as the proposal was not complete enough and requiring implementers to support another (low maturity) resource provides too big a barrier to adoption.</p>",
        "id": 175718515,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1568495648
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> MolecularSequence has both 'patient' and 'specimen' as optional for a reason - totally fine to have them as \"definitional\".</p>",
        "id": 175720346,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568498858
    }
]