[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  I believe you'd mentioned use of CAP Cancer Protocols combined with CG IG for genetics, molecular and tumor marker reporting recently.  Is that correct? fyi <span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> </p>\n<p>CAP has Structured Data Capture (SDC) forms version s of the eCC (which I believe Rich indicated in his email they'll be transitioning to as the exclusive content for cancer reporting).  They are located here for review:  <a href=\"https://sdt.cap.org/SDCApp/Index.aspx\" target=\"_blank\" title=\"https://sdt.cap.org/SDCApp/Index.aspx\">https://sdt.cap.org/SDCApp/Index.aspx</a></p>\n<p>Looking specifically at Breast Biomarkers:  <a href=\"https://sdt.cap.org/SDCApp/GetHTML.aspx?packageid=PKG_Breast_Bmk\" target=\"_blank\" title=\"https://sdt.cap.org/SDCApp/GetHTML.aspx?packageid=PKG_Breast_Bmk\">https://sdt.cap.org/SDCApp/GetHTML.aspx?packageid=PKG_Breast_Bmk</a><br>\nThe form allows for the collection of ER, PR, HER2 results on Breast tissue in accordance with the 2018 CAP/ASCO Guidelines.  Each will be separate orders done by the performing lab.  Some labs have a panel where all are done together.  See <a href=\"https://testdirectory.questdiagnostics.com/test/test-detail/10970/erprher2-with-reflex-to-her2-fish-paraffin-block?p=r&amp;q=ER%2FPR%2FHER2%20with%20Reflex%20to%20HER2%20FISH,%20Paraffin%20Block&amp;cc=WDL\" target=\"_blank\" title=\"https://testdirectory.questdiagnostics.com/test/test-detail/10970/erprher2-with-reflex-to-her2-fish-paraffin-block?p=r&amp;q=ER%2FPR%2FHER2%20with%20Reflex%20to%20HER2%20FISH,%20Paraffin%20Block&amp;cc=WDL\">https://testdirectory.questdiagnostics.com/test/test-detail/10970/erprher2-with-reflex-to-her2-fish-paraffin-block?p=r&amp;q=ER%2FPR%2FHER2%20with%20Reflex%20to%20HER2%20FISH,%20Paraffin%20Block&amp;cc=WDL</a></p>\n<p>ER, PR, and HER2 are separately ordered, but all are panel orders as other data elements are required to be reported with them.  Let's look at just the ER as the patterns are similar with the others:  <a href=\"https://testdirectory.questdiagnostics.com/test/test-detail/36160/estrogen-receptor-er-ihc-with-interpretation?p=r&amp;q=ER&amp;cc=WDL\" target=\"_blank\" title=\"https://testdirectory.questdiagnostics.com/test/test-detail/36160/estrogen-receptor-er-ihc-with-interpretation?p=r&amp;q=ER&amp;cc=WDL\">https://testdirectory.questdiagnostics.com/test/test-detail/36160/estrogen-receptor-er-ihc-with-interpretation?p=r&amp;q=ER&amp;cc=WDL</a></p>\n<p>Time in fixation, formalin fixation, etc are required CAP/ASCO data elements that do not have LOINC codes yet as discussed at the December 2018 LOINC meeting.  The protocol requires IHC testing first and then if positive, follow u/reflexive testing with (F)ISH testing.  The clinician can order each separately or a reflexive order that will perform the FISH if IHC results warrant.  Given laboratories have been reporting these results in V2.51 format currently, they are wanting LOINCs to be compliant with ONC Common Clinical Data Set reporting as part of Meaningful Use requirements for hospitals where many of these results are performed.  Reference labs are also providing for their customers, but only part of the LOINCs are available currently and why the drive to get them completely encoded.</p>\n<p>The second major aspect which you mentioned, is alignment with CG genetics reporting (and any needed LOINCs).  The IHC reports will follow what labs are currently doing.  Most FISH reports I expect to do the same.  Thus, I wouldn't expect them to follow CG IG requirements.  (Playing devil's advocate--Why would they invest and revalidate reporting?  What's the benefit of all the work? ) </p>\n<p>I do think that it would be good for CG to work through a standardized, structured report. let's say for the (F)ISH reporting based upon the CAP/ASCO guidelines with ALL the required data elements encoded.   Labs could then implement the same standard/report elements/format to help with interoperability.</p>\n<p>Am curious how the current structure labs are using for reporting er, pr, her2 by FISH.  Here's another:  <a href=\"https://www.mayocliniclabs.com/test-catalog/Fees+and+Codes/35275\" target=\"_blank\" title=\"https://www.mayocliniclabs.com/test-catalog/Fees+and+Codes/35275\">https://www.mayocliniclabs.com/test-catalog/Fees+and+Codes/35275</a>  and another  <a href=\"https://www.labcorp.com/test-menu/21391/breast-cancer-prognosis-profile-ii-paraffin-block\" target=\"_blank\" title=\"https://www.labcorp.com/test-menu/21391/breast-cancer-prognosis-profile-ii-paraffin-block\">https://www.labcorp.com/test-menu/21391/breast-cancer-prognosis-profile-ii-paraffin-block</a><br>\nand another <a href=\"http://ltd.aruplab.com/Tests/Pub/0049210\" target=\"_blank\" title=\"http://ltd.aruplab.com/Tests/Pub/0049210\">ltd.aruplab.com/Tests/Pub/0049210</a></p>\n<p>For pathologists, performing this testing on breast tissue (or rarely mets in other tissue like liver or bone marrow), they could report this testing in their normal report to the ordering provider.  Then the \"summarized\" results/data elements as required in the CAP Cancer Protocols/eCC/SDC are integrated into the surgical pathology report on the breast tissue and reported.  Ideally any original encoding should persist (which according to Rich's response doesn't appear to be happening as the CAP team plans to provide codes for their data elements at a later point), to be leveraged in the pathology reports (those required to reported by CAP for Cancer and those on specimens without cancer) from the Anatomic Pathology LIS to downstream entities preserving coding, including HGVS, etc.  Downstream entities like the hospital cancer registrar is required to report on a number of the data elements to the central cancer registrar as they stage/code cancer data.  The ordering provider, oncologist, surgeon, primary care physician and others caring for the patient will also receive the reports and have to consolidate the results/knowledge therein.  It seems like many of the CG IG use cases may be supported at this point in the process.  Interpretations of variants, structuring data for clinical decision support, etc.</p>\n<p>It should also flow into what CIC, Mitre, mCode, CIMI and others are doing as they have many of the same data elements and codes in their Breast Cancer Model:  <a href=\"http://hl7.org/fhir/us/breastcancer/2018Sep/index.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/breastcancer/2018Sep/index.html\">hl7.org/fhir/us/breastcancer/2018Sep/index.html</a></p>\n<p>While we can't tell labs how to report, we might be able to make suggestions as the eMERGE pilot is demonstrating to work through how best to structure, model and report so the multiple requirements can be met and interoperability can be achieved.  Been working on the data at its point of origin to facilitate for downstream use cases so rework, re-encoding, etc.  shouldn't be needed in theory, but there's still a long ways to go.</p>",
        "id": 160575845,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1552401674
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191913\">Kevin Power</span>  I believe you'd mentioned use of CAP Cancer Protocols combined with CG IG for genetics, molecular and tumor marker reporting recently.  Is that correct? fyi <span class=\"user-mention silent\" data-user-id=\"192123\">Bret H</span> </p>\n</blockquote>\n<p>I am afraid I do not recall making such a statement?  Do you have an email or Zulip chat perhaps?  I might have talked about <a href=\"https://www.researchgate.net/figure/Minimum-variant-level-data-MVLD-for-somatic-variant-curation-The-top-two-levels-blue_fig2_309765841\" target=\"_blank\" title=\"https://www.researchgate.net/figure/Minimum-variant-level-data-MVLD-for-somatic-variant-curation-The-top-two-levels-blue_fig2_309765841\">MVLD</a> which we used early on to build out some of our current <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/somatics.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/somatics.html\">Somatic Reporting</a> profiles.<br>\nI think aligning with such industry guidelines would be a great exercise.</p>",
        "id": 160597084,
        "sender_full_name": "Kevin Power",
        "timestamp": 1552415633
    },
    {
        "content": "<p>After looking at the CAP eCC XML files for multiple examples, I still question how one thinks this easily fits into the Somatic Reporting profiles without significant terminology mappings to address pre- and post-coordination.  <span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span> - perhaps you can do a CAP eCC XML to StructuredDef translation of how you see this working or create an example?   Even after Scott Campbell's preso on his SNOMED mapping work to the HL7 Cancer Interop folks last Wednesday, it only brought up more questions from multiple folks on the call, not just MITRE.</p>",
        "id": 160900936,
        "sender_full_name": "May Terry",
        "timestamp": 1552674595
    },
    {
        "content": "<p>Seems like the wrong question is being asked, as I don't believe CAP eCC would fit into CG Somatic Reporting.  It would need to be the opposite, CG data is included in CAP eCC reporting and it's not 1:1.  That's why I asked about which report(s) would be referenced by downstream entities.  </p>\n<p>As you know, there are a number of separate/reflex/add on orders for markers, stains, etc. that are performed and reported independent of pathology reports.  It's highly dependent on what is performed on a test menu, what is sent out, and timing of the results reporting.  If certain results aren't available at the time of pathology report, addendums are performed to add the additional results and impacts to diagnosis, treatment, prognosis, etc.  </p>\n<p>That said, I don't have the current eCC release, so would need to review the latest data elements to address the question with concrete examples.  The eCC as you may have seen, doesn't include the full report for genomic/molecular/other reports, but reporting on key elements as required by CAP/ASCO/AJCC.  As these results are reported to downstream entities to the EHR for a variety of use cases, curious as to which reports/versions your team is utilizing in your models?  Which report on the same data item is considered the \"source of truth?\"</p>\n<p>Ideally, these reports/reported elements should flow into the EHR/systems utilizing the data such as your model without further translation/modification, etc.  However, some \"translations\" may be needed to the Structured Def model/structure, especially in cases where N:1 relationships occur.</p>",
        "id": 161254347,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1553093445
    }
]