[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194730\">@Liz Amos</span> pointed at this on the call yesterday this:<br>\n<a href=\"https://www.ncbi.nlm.nih.gov/clinvar/docs/api_http/\">https://www.ncbi.nlm.nih.gov/clinvar/docs/api_http/</a></p>\n<p>Might be good to review the \"Submission Schema\" and \"Submission description\" and compare to how we have defined Variant.</p>",
        "id": 253429797,
        "sender_full_name": "Kevin Power",
        "timestamp": 1631718388
    },
    {
        "content": "<p>can we say a little more about what the comparison is for? Do you want a spreadsheet that shows a mapping between the two? Or a paragraph about the contrast?</p>",
        "id": 256142022,
        "sender_full_name": "Bret H",
        "timestamp": 1633385735
    },
    {
        "content": "<p>We didn’t discuss in great detail, but a mapping between the two would be interesting.</p>",
        "id": 256238623,
        "sender_full_name": "Kevin Power",
        "timestamp": 1633438126
    },
    {
        "content": "<p>looking at it now. will append report later. However, first quick blush - there are several items that I would categorize as important in the research space (and knowledge repository space. e.g. details on a research study subject demographic) that will not be in our profiles. BRIDG is a group focused on Biomedical research and if the elements specific to research/studies are to be included, I'd recommend a collaboration with that group or moving those items to that group to give guidance on. PS Here's info on BRIDG: <a href=\"https://bridgmodel.nci.nih.gov/hl7-fhir\">https://bridgmodel.nci.nih.gov/hl7-fhir</a></p>",
        "id": 256756553,
        "sender_full_name": "Bret H",
        "timestamp": 1633706643
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> - I think calling out items they have that do not map well to our IG would be important, as well as flagging those that feel more research versus clinically oriented. I appreciate your review!</p>\n<p>I will add that I think <span class=\"user-mention\" data-user-id=\"194730\">@Liz Amos</span> was going to identify a contact for the api in case we have questions or clarifications?</p>",
        "id": 256791456,
        "sender_full_name": "Kevin Power",
        "timestamp": 1633720655
    },
    {
        "content": "<p>yep, I do, planning on trying to arrange something for an upcoming call. however, my original intent was to focus on the variant description for the Variant Lite work</p>",
        "id": 256794475,
        "sender_full_name": "Liz Amos",
        "timestamp": 1633722014
    },
    {
        "content": "<p>Sounds like the right priority to me, thanks <span class=\"user-mention\" data-user-id=\"194730\">@Liz Amos</span></p>",
        "id": 256796800,
        "sender_full_name": "Kevin Power",
        "timestamp": 1633723007
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194730\">@Liz Amos</span> <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  I have been through the API model and our FHIR models. My analysis is available for comment at: <a href=\"https://docs.google.com/spreadsheets/d/1fLNIj5QXRbfBQqvUoolC7m6AvyYg9x-dCkvKqMsEkKM/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/1fLNIj5QXRbfBQqvUoolC7m6AvyYg9x-dCkvKqMsEkKM/edit?usp=sharing</a> Here's what I saw: IMPORTANT THIS IS AS OF Oct 11, 2021. Both groups are actively evolving<br>\nClinVarAPI: <a href=\"https://www.ncbi.nlm.nih.gov/clinvar/docs/api_http/\">https://www.ncbi.nlm.nih.gov/clinvar/docs/api_http/</a><br>\nCG IG: <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/\">http://build.fhir.org/ig/HL7/genomics-reporting/</a><br>\nGenerally, ClinVar submission is meant to be a self-contained record of information on a variant-disease pair (potentially including results from multiple individuals) for deposit in a knowledge repository, a variant database. The CG IG profiles are meant to communicate the clinically relevant information on a genetic result for a patient. The EMR provides additional details on the patient and the data is considered in light of the clinical record of the patient. ClinVar is a knowledge repository. As such it goes beyond what would be sent in a non-research report. At most a trio would be referred to in a lab test. Again, a clinvar submission assumes a grouping of individuals with a singular variant focus. For Healthcare transactions, the focus is on a singular individual with a grouping of variants found in a particular test. </p>\n<p>ClinVar treats therapeutic implications with the same elements as it uses for diagnostic implications. The CinVar clinical significance description field maps into both the Diagnostic implication and Therapeutic implications.<br>\ne.g. A 'drug response'  association in a ClinVar entry would be mapped with Therapeutic implication. A 'Pathogenic' association in a ClinVar entry would be mapped to Diagnostic implication<br>\nClinVar has 'protective' in clinical significance description value set and 'risk factor.'  Protective is a different meaning than benign. Similarly, 'risk factor' is a different implication than pathogenic. However, putting them in the same value set as our current terms will complicate the current meaning of the data element - i.e. make it harder to find all the 'pathogenic' variants for a disease as some instances of data might have 'risk factor' and not use 'pathogenic' or 'likely pathogenic.' Should be discussed. There is the Prognosis component in the CG IG which could be used.<br>\nAlso, ClinVar has 'confers sensitivity' in clinical significance. Might consider how to handle this in the Therapeutic profile as drug sensitivity. The CG IG prognosis component could be used.</p>\n<p>The variantSet variant in ClinVar maps well into the CG IG variant profile. ClinVar associates chromosomal position information data elements in one group. The ClinVar element variant type maps to multiple variant elements (component:dna-chg-type, component:molecular-consequence, component:amino-acid-chg-type).<br>\nThe ClinVar variantSet variant has referenceCopyNumber, this is not in the CG IG.<br>\nThe CG IGs components for Variant component:molecular-consequence and Diagnostic Implication component:functional-effect gives a greater vocabulary for describing the consequences of the variant than the ClinVar API.</p>\n<p>ClinVar API assertionCriteria element is not specifically present in the CG IG, but it is part of the attribution elements in FHIR which indicate the observer.</p>\n<p>POPULATIONS? observedIn element in the ClinVar API is interesting, somewhat similar to CG IG FHIR use of patient but meant for describing the group of subjects the ClinVar submission record is about. Generally observedIn looks more like what would be expected to be seen in a research study. The items are interesting but not a report for an individual patient's genomic result. The clinicalFeatures field could be mapped to Condition sent with Patient. But with FHIR access to the Patient clinical features is typically a given in the recipient system. One could envision using Family history to report the types of data seen here for a Trio analysis. A data element like observedIn is well suited for a knowledge repository and something like it could be used to return Population results from an EMR.</p>",
        "id": 257068367,
        "sender_full_name": "Bret H",
        "timestamp": 1633960839
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194730\">@Liz Amos</span> In my spreadsheet, I've two tabs. I can do a line by line mapping from variantSet:variant to the CG variant if you need it. The mapping is pretty straightforward, except where noted above. I looked at all the data elements in the API submission model. Happy to have someone from ClinVar comment on my notes (<a href=\"https://docs.google.com/spreadsheets/d/1fLNIj5QXRbfBQqvUoolC7m6AvyYg9x-dCkvKqMsEkKM/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/1fLNIj5QXRbfBQqvUoolC7m6AvyYg9x-dCkvKqMsEkKM/edit?usp=sharing</a> ). The variantType field needed to be mapped to multiple fields. Also, good to think about the under used CG IG FHIR component: prognosis in Genomic implications.</p>",
        "id": 257068623,
        "sender_full_name": "Bret H",
        "timestamp": 1633960946
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span> I think you might want to think about the prognosis component in implication. It's visible in the Structure-def view but hidden in the differential... <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> any thoughts how to make the elements in the differential for <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/StructureDefinition-implication.html\">http://build.fhir.org/ig/HL7/genomics-reporting/StructureDefinition-implication.html</a> more visible in the Diagnostic and Therapeutic profiles? I wonder if it would be useful  make the derived from slices, the genetic reference and the prognosis component more visible in the derivative profiles.</p>",
        "id": 257070432,
        "sender_full_name": "Bret H",
        "timestamp": 1633961781
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> Thanks for getting this started. Do you mind if I make some formatting suggestions for your spreadsheet? I don't know about anyone else, but with all the overlapping text, I find it hard to read?</p>",
        "id": 257072738,
        "sender_full_name": "Kevin Power",
        "timestamp": 1633962833
    },
    {
        "content": "<p>I requested write access</p>",
        "id": 257073856,
        "sender_full_name": "Kevin Power",
        "timestamp": 1633963294
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> I looked over their entire submission model</p>",
        "id": 257077513,
        "sender_full_name": "Bret H",
        "timestamp": 1633964934
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 257077769,
        "sender_full_name": "Bret H",
        "timestamp": 1633965036
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 257077796,
        "sender_full_name": "Bret H",
        "timestamp": 1633965049
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 257077900,
        "sender_full_name": "Bret H",
        "timestamp": 1633965091
    },
    {
        "content": "<p>The observedIn might be interesting for a Genetics for Populations profile.</p>",
        "id": 257078325,
        "sender_full_name": "Bret H",
        "timestamp": 1633965267
    },
    {
        "content": "<p>I just had a really hard time reading everything you put into the spreadsheet. I am making some formatting changes now to ensure we can read all the text.</p>",
        "id": 257078743,
        "sender_full_name": "Kevin Power",
        "timestamp": 1633965478
    },
    {
        "content": "<p>Yep</p>",
        "id": 257078812,
        "sender_full_name": "Bret H",
        "timestamp": 1633965493
    },
    {
        "content": "<p>It is nice how chromosomalcoordinates in the ClinVar Submission model groups things. But the native FHIR query get's uglier as we nest more and more</p>",
        "id": 257079233,
        "sender_full_name": "Bret H",
        "timestamp": 1633965660
    },
    {
        "content": "<p>e.g. if we we're to create a component to organize like the ClinVar API has done, and put all the chromosomal position information there.</p>",
        "id": 257079320,
        "sender_full_name": "Bret H",
        "timestamp": 1633965712
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194730\">@Liz Amos</span>  hello. Could you verify with your contact that 'clinvarSubmission variantSet variant chromosomeCoordinates accession' is meant to be something like a RefSeek accession? I assume it is but...</p>",
        "id": 257102250,
        "sender_full_name": "Bret H",
        "timestamp": 1633977711
    }
]