[
    {
        "content": "<p>Hello All! We're putting together a proposal for the May 2022 connectathon. The rough draft is at <a href=\"https://docs.google.com/document/d/1M7fZq6jsZGRcGR8mkqv6wgR1LMUbfk2e3VVnYtwaz2A/edit\">https://docs.google.com/document/d/1M7fZq6jsZGRcGR8mkqv6wgR1LMUbfk2e3VVnYtwaz2A/edit</a><br>\nEveryone can comment. If you'd like to add a scenario or edit - shoot a request and we'll get you added.</p>\n<p>Looking for app developers and others to try out the operations. Here's a summary blurb that gets to the purpose:<br>\nOur goal is to try out as many of the proposed operations as possible. We are seeking feedback, including utility of responses, additional parameters, speed of development (with/out operations), coverage of use cases and gaps. <br>\nWe invite application developers, EHR vendors, Business and Data analysts/scientists, especially, to make use of the reference server. See the scenario section for example scenarios, additional scenarios are welcome during the connectathon.  If one would like to develop their own server that is in-scope and we will be happy to try out your server.   Additionally, if a knowledge-base, e.g. PharmGKB, would like to test out delivering their content using the Implication operations that would be encouraged. </p>\n<p>Looking forward to your use cases. There are some mentioned on the operation specific page currently accessible at <a href=\"https://build.fhir.org/ig/HL7/genomics-reporting/branches/operations/operations.html\">https://build.fhir.org/ig/HL7/genomics-reporting/branches/operations/operations.html</a> (but the branch will be merged soon).</p>\n<p>pinging a few folks that expressed interes: <span class=\"user-mention\" data-user-id=\"249407\">@Rachel Kutner</span> <span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span> <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> <span class=\"user-mention\" data-user-id=\"192302\">@May Terry</span></p>",
        "id": 271998331,
        "sender_full_name": "Bret H",
        "timestamp": 1644942072
    },
    {
        "content": "<p>The use cases do not need to be ones you are working on. Please feel free to suggest problems you would like solutions too, or are curious about. They don't even have to necessarily about operations.</p>",
        "id": 273148189,
        "sender_full_name": "Bret H",
        "timestamp": 1645735999
    }
]