[
    {
        "content": "<p>One of the discussion points from Clem yesterday was the idea of combining similar components together.  This was one of the examples, though there are others:</p>\n<blockquote>\n<p>Reference sequence (Crucial and required) but do we really need two separate fields? They are self-defining – Can we collapse into one field – they are self-defining- perhaps allow 2 if we need that many<br>\n51958-7    Transcript reference sequence [ID]<br>\n48013-7    Genomic reference sequence [ID]</p>\n</blockquote>\n<p>It does seem we could do it fairly easily, but it would necessitate that we create a new ValueSet containing the LOINC codes mentioned above that we could bind <code>Variant(Observation).component[].code</code> to for validation purposes.  We would need to make the new combined component 0..*, which would also imply we lose the ability to simply say \"please send at most 1 transcript reference sequence.\"  Longer term, we would also (I think?) lose the ability to validate different value sets for the different types of reference sequences.</p>\n<p>I am still not sure if this really makes the Variant profile \"easier\" or not, but wanted to ask for other feedback before we officially consider this request.</p>",
        "id": 186898571,
        "sender_full_name": "Kevin Power",
        "timestamp": 1580313326
    },
    {
        "content": "<p>I think part of his point is that a genomic reference sequence often uniquely determines a transcript reference sequence and vice versa, so we could (potentially) limit it to 1..1 reference</p>",
        "id": 186899105,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1580313603
    },
    {
        "content": "<p>If we do send both currently, how do we interpret the variant's exact-start-end?? Our guidance says \"genomic\" so does it default to that if both refs are given?</p>",
        "id": 186900575,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1580314484
    },
    {
        "content": "<p>Fair point.  I am not sure that will always be a 1..1 (especially for non-NCBI references, I REALLY don't know those very well), but perhaps it is - for now, let's assume it is.  Similar to our other discussions, I am uncomfortable with our base profile putting assumptions that the receiving system can do a lookup like that.</p>",
        "id": 186900593,
        "sender_full_name": "Kevin Power",
        "timestamp": 1580314498
    },
    {
        "content": "<p>Given our definition of exact-start-end, I would assume it would be based on the genomic coordinates regardless of what reference sequence(s) are provided (which is honestly not something we should probably assume - this could use some clarification/work to be honest).</p>",
        "id": 186900775,
        "sender_full_name": "Kevin Power",
        "timestamp": 1580314598
    },
    {
        "content": "<p>Do others have comments on this?  To tag a few people who have done some real work with the IG, curious to hear from <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> or <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> , <span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span> , maybe <span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> ?</p>",
        "id": 186935291,
        "sender_full_name": "Kevin Power",
        "timestamp": 1580336676
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> raises a good point, that other components potentially become ambiguous if we collapse all refSeq's into a single component. That said, I like the idea of collapsing - maybe it won't work in all of the cases Clem suggested, but maybe it would work for, say, HGVS, and from there, we'd just need to do profiles.</p>",
        "id": 186936922,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1580338033
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span> -- I think we already have some ambiguity, as the 'genomic ref seq' component is not required, but the 'exact-start-stop' component says it is based on 'genomic coordinates.'  If we want to put some invariants/rules in place saying if you send 'exact-start-stop' you must also send 'genomic ref seq,' we can do so regardless of if we combine the ref seqs or leave them seperate as they are today.</p>",
        "id": 186938567,
        "sender_full_name": "Kevin Power",
        "timestamp": 1580339554
    },
    {
        "content": "<p>Those groups of components meant to be used together feel like unrwritten rules we ought to put in</p>",
        "id": 186938882,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1580339854
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>. I do like the idea of reducing the components, but I kinda wonder if it might be good to start with just one, and from there consider each reduction on its own? maybe, for instance, we'd start by seeing whether it's possible to collapse the three HGVS components (c,g,p) into just one?</p>",
        "id": 186939479,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1580340316
    },
    {
        "content": "<p>HGVS seems most convenient for the amino acid change, especially since ref and alt are genomic</p>",
        "id": 186939808,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1580340596
    },
    {
        "content": "<p>I would be OK with combining the HGVS components.  Anyone opposed to that becoming a tracker in the theme of \"simplification\" ? <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 186940304,
        "sender_full_name": "Kevin Power",
        "timestamp": 1580341015
    },
    {
        "content": "<p>It would be so helpful if we (CGWG) could produce a few low level data types that provide the constructs (or components) that all depend on each other to create the values needed to represent the results or components in the Observations. It is very difficult to have all these rule around which attributes go together and depend on each other, especially when there's need or interest in having multiple complex components.  </p>\n<p>While I think the Observation.component[] concept is a very useful and helpful mechanism to provide additional values that help clarify or enhance the data that is observed. I think these variant scenarios illustrate that we are exceeding the limits and intention of that design by trying to fit one or more \"components\" with deeper structures than the Observation.component[] mechanism allows.  </p>\n<p>If we (CGWG) want to provide all the various ways some one might want to represent a variant, then why not create an Observation Profile for each specific use case. In other words, instead of one generic Variant profile. Have an HGVSVariant profile, a VariantCallFormat Profile, an StarAllele Profile, etc... This would produce upwards of a dozen profiles, but it would make it very clear which constraints were required for the various variant representation types.  And, if someone wanted to use a \"genomic\" HGVSVariant profile they could type it as \"genomic\" and then have sub-observations for the \"transcript\" and \"protein\" types observations that the producer may wish to additionally send with the base observation.</p>\n<p>Sorry to diverge from the original ask. But it is difficult to try to untangle the little knots, hoping to make a meaningful improvement when we our knot is part a \"nest\" of knots.  If we don't address the bigger issue of simplifying</p>",
        "id": 186948119,
        "sender_full_name": "Larry Babb",
        "timestamp": 1580348704
    },
    {
        "content": "<p>That's certainly possible - however most 'custom' data types that have been introduced into the spec so far have been on elements that everyone must support and that aren't 'choice' structures.  The risk of introducing custom types for either Observation.component.value or for extension is that they won't be widely supported - which may limit the ability to propagate data through/to systems.</p>",
        "id": 186948433,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580349058
    },
    {
        "content": "<p>We could do lots of profiles and still have a single Observation instance that meets all the ones makes sense. We would have to define our profiles carefully so that they can work together, but it would be possible. I am hesitant to define something that would require many Observations to report a single variant.</p>",
        "id": 186949177,
        "sender_full_name": "Kevin Power",
        "timestamp": 1580350134
    },
    {
        "content": "<p>I do think it begs the question I have been thinking more about recently - does fitting into a less-than-ideal but more widely adopted structure, like Observation and its components, provide enough value over first class structures for genomics that won’t be more generally adoptable without additional work for implementers?  I know we started the IG on the premise that the value of widely adopted and understood structures was worth it. Given where we are, do we all still believe that? Are we getting to a point of defining (or needing to define) our profiles such that their complexities will require additional implementation anyway?</p>\n<p>Those are probably unanswerable questions right now, but easy questions are no fun <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 186952167,
        "sender_full_name": "Kevin Power",
        "timestamp": 1580354549
    },
    {
        "content": "<p>Are you suggesting we ought to revisit MolecularSequence???</p>",
        "id": 186952406,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1580354964
    },
    {
        "content": "<p>I don’t know what I am suggesting right now. 🤯</p>",
        "id": 186952976,
        "sender_full_name": "Kevin Power",
        "timestamp": 1580355870
    },
    {
        "content": "<p>In all seriousness, I think we continue to stick close to what we have now and making incremental progress. However, once the IM model is reviewed and ready - it might be time to revisit decisions like this</p>",
        "id": 186953080,
        "sender_full_name": "Kevin Power",
        "timestamp": 1580356069
    },
    {
        "content": "<p>Have to revisit this for hgvs representation on Variant :)</p>",
        "id": 189715316,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1583343517
    },
    {
        "content": "<p>I think our group should consider combining all HGVS components into a single component.  As we think about what to do for the \"Variant Simplification\" theme more broadly it might change again, but we should embrace evolution <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>\n<p>There were other things on this thread that are probably a bridge too far for now.</p>",
        "id": 189727848,
        "sender_full_name": "Kevin Power",
        "timestamp": 1583351338
    },
    {
        "content": "<p>wisepeople keep saying 'you can move complexity around but you can't hide it forever.' If we remove the more pre-coordinated reference fields, as has been discussed, the recipient of the data will need mechanisms to parse the incoming data  to know if it is relative to protein, RNA, DNA. So the recipient side would need extra effort. Additionally, querying becomes an issue --- if it were to matter in the query of the genetic data were RNA, AA, or DNA. ..we're a bit stuck. Simplification in one space creates complication and need for control logic in another. Sorry not to be helpful. The only thing I can offer, is we make a decision and stick to it for a declared amount of time. The more time I spend in this group the more I see a very strong need to make stability contracts with the would-be implementer. This means stabilizing our product and adhering to a SPECIFIC release cycle.                                  Our community deserves it, and patients will be better served the sooner genetic data is discreetly available.</p>",
        "id": 190654331,
        "sender_full_name": "Bret H",
        "timestamp": 1584289479
    },
    {
        "content": "<p>I think this thread from last year may be the most aligned spot for continued \"IG Lite\" discussion. Current google doc where we've been considering updated guidance for <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/sequencing.html\">http://build.fhir.org/ig/HL7/genomics-reporting/sequencing.html</a> is here: <a href=\"https://docs.google.com/document/d/15g1rngmgFoE8_i7UGpXRpISkOCrd1QCoQBg9REY80EI/edit\">https://docs.google.com/document/d/15g1rngmgFoE8_i7UGpXRpISkOCrd1QCoQBg9REY80EI/edit</a></p>",
        "id": 222455109,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1610468464
    }
]