[
    {
        "content": "<p>sorry for bringing this up here again, but maybe we can progress in the discussion here.<br>\nTo me this is still a finding,  a cytogenetic finding using a cytogenetic nomenclature (e.g. ISCN) to express what was found. Am i missing a fact why finding might off the table?</p>",
        "id": 160024151,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1551808446
    },
    {
        "content": "<p>We tentatively decided to keep the <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/obs-cytogenetic-nomenclature.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/obs-cytogenetic-nomenclature.html\">profile</a> (name and all), and link to it from the <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/cytogenomics.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/cytogenomics.html\">Cytogenomic Reporting</a> page.  The concern with changing the name to \"finding\" is that might imply a deeper level  of cytogenetic data than we are proposing as of today.  For some examples of the deeper cytogenetic data that we might consider some day, see the <a href=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=364\" target=\"_blank\" title=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=364\">V2 guide</a></p>",
        "id": 160024518,
        "sender_full_name": "Kevin Power",
        "timestamp": 1551808757
    },
    {
        "content": "<p>That V2 guide was last published in 2014, and before we model FHIR IG profiles after it, the thinking is that we need SMEs to evaluate it's relevance in today's world of testing and reporting.</p>",
        "id": 160024658,
        "sender_full_name": "Kevin Power",
        "timestamp": 1551808858
    },
    {
        "content": "<p>To be honest, the V2 guide might still apply completely, or nearly completely.  The general sense from the WG as of today is that we don't have the right SMEs to confirm or deny.  And until we do, we want to keep it simple.</p>",
        "id": 160024978,
        "sender_full_name": "Kevin Power",
        "timestamp": 1551809092
    },
    {
        "content": "<blockquote>\n<p>The concern with changing the name to \"finding\" is that might imply a deeper level  of cytogenetic data than we are proposing as of today.  </p>\n</blockquote>\n<p>I can follow this argumentation, but even if we would imply a deeper level than we have modeled yet. An Implementer could start with our profile and add other needed properties as component into his downstream use-case specific cytogenetic profile. (And share his structure with us in the best case).<br>\nMy motivation for keeping this discussion up is that i don't think we are using this profile to transport a cytogenetic nomenclature, but a cytogenetic finding/observation/aspect using this nomenclature.<br>\nBut if i am the only one with this issue i can accept keeping the profile name.</p>",
        "id": 160026248,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1551810056
    },
    {
        "content": "<p>Not sure how many of them we will use/not use, but there are various classes/type of \"cytogenetic findings\" articulated in the V2 Cyto IG that don't have the ISCN string contained in them.  So, I am fairly certain that will be will end up with different profiles, and maybe find a base \"Cytogenetic Finding\" profile - it just won't include the ISCN string.  So, if someone wanted to send Cyto data, I wouldn't expect them to profile off the profile that contains the ISCN string, they would likely do their own profile of Observation.</p>",
        "id": 160031413,
        "sender_full_name": "Kevin Power",
        "timestamp": 1551813311
    },
    {
        "content": "<p>Ok, what about having a cytogenetic findings profile, with one component (for now) which contains the ISCN String. Then we can other components as we need them.</p>",
        "id": 160032116,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1551813827
    },
    {
        "content": "<p>I not sure the other components semantically belong in the same profile as the ISCN string value.  I would compare it to putting the HGVS string in the Genetic Finding profile - that wouldn't make sense because you don't need the HGVS string to represent a Genotype or Haplotype - only need it in Variant.</p>",
        "id": 160032838,
        "sender_full_name": "Kevin Power",
        "timestamp": 1551814370
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> Good question.  I depends on how you are finding is defined.  For example, if it's part of the lab report, cytogenetics report, genomics report, it's not usually a finding, but rather results (aka observations).  Lab results are coded with LOINC.  However, when the results are seen in the EHR and assessed by the physician, they usually note that the lab result is a finding of X or diagnosis of X and coded with ICD-10/SNOMED CT.   It appears that the definition you are using is the second one.  Is that correct?  If so, I wouldn't expect it to be in the primary genetics report reported by the laboratory (unless in the diagnostic section issued by the pathologist) as much as notation by a downstream receiver such as a clinical geneticist or oncologist.  Does that help address your question?</p>",
        "id": 160038592,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1551818860
    },
    {
        "content": "<p>FYI-  Commented on Previous Ballots asking that Genomics Guides are aligned with CAP Cytogenetic Checklist requirements (for accreditation of labs in US and those international customers).  Clem indicated many of the requirements would be in the CG Cytogenetics Guide not CG Guide.  </p>\n<p>For accreditation, reports for cytogenetics studies and genomic copy number analysis using microarrays, require ISCN is used correctly in the report.  Constitutional Cases must be banded at the 400 band level, according to ISCN requirements too.</p>\n<p>What's not clear to me and mentioned today is why all the cytogenetics testing, report information isn't in the Cytogenetics Implementation Guide and why we are discussing with the CG guide?  (especially if previous CG ballot comments were addressed based upon that premise?)  I thin this gets to some of <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> 's questions too. (please correct me if I've misunderstood.)</p>",
        "id": 160041894,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1551821383
    },
    {
        "content": "<p>The current Cyto IG is a V2 guide.  It might make sense to create an entirely new FHIR IG for Cyto - but new FHIR profiles roughly mathcing the V2 IG were drafted as part of the FHIR Genomics Reporting IG.  Without the proper vetting, we decided to remove the Cyto specifics from the FHIR IG --- except the \"ISCN string\".  So, for the first release, we are not going to be anywhere near to support full Cytogenetic reporting requirements.</p>",
        "id": 160048768,
        "sender_full_name": "Kevin Power",
        "timestamp": 1551826267
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span>  I think the model you created in the CG modeling sub-group would be informative here. It got into the guts of ISCN a bit.</p>",
        "id": 160108001,
        "sender_full_name": "Bret H",
        "timestamp": 1551887967
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> Not too deeply.  We broke apart the cytoband notation but that is as far as we went.  We didn't want to re-invent ISCN or go too far without a stakeholder pushing for more detail.</p>",
        "id": 160111919,
        "sender_full_name": "Bob Freimuth",
        "timestamp": 1551890507
    },
    {
        "content": "<p>precisely - but still worth describing what it means to break apart the cytoband notation. I think folks would find that useful</p>",
        "id": 160290800,
        "sender_full_name": "Bret H",
        "timestamp": 1552053369
    }
]