[
    {
        "content": "<p>Hi,</p>\n<p>I'm looking for a reference implementation that contains consistent genomic observation/Diagnostic-report/Molecular-sequence resources, from where we could start some trials and implementation. the latest version of HAPI-FHIR contains MolecularSequence but I stuggle to find observations related to them (and diagnostic-report). Is such data set with FHIR server available somewhere as open source ? Do you have a set of FHIR queries illustrating some of the genomic use cases like \"Find all patients with variant NC_000005.9:112154800:C:T\" ? Thanks for your help and support</p>",
        "id": 186186455,
        "sender_full_name": "v-planat",
        "timestamp": 1579616273
    },
    {
        "content": "<p>Hi V,</p>\n<p>You can take a look at <a href=\"http://hl7.org/fhir/uv/genomics-reporting/usecases.html\" target=\"_blank\" title=\"http://hl7.org/fhir/uv/genomics-reporting/usecases.html\">http://hl7.org/fhir/uv/genomics-reporting/usecases.html</a> for the latest guidance on searching. This is an area where the work group is actively developing new content.</p>\n<p>If you'd like to speak briefly about your intended use case, it would really improve our ability to get you relevant info regarding which resources, pages, and reference implementations would be the most helpful for you.</p>",
        "id": 186192087,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1579619570
    },
    {
        "content": "<p>Hi,</p>\n<p>Thanks a lot ! This helps a lot and was not aware of this use cases part. Regarding a reference data set of anonymized data is there a place where we can download consistent (for genomic) FHIR resources  ? <br>\nThanks for your help <br>\nVincent</p>",
        "id": 186204460,
        "sender_full_name": "v-planat",
        "timestamp": 1579626648
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197493\">@v-planat</span> Vincent, about a year ago we published an open source VCF-to-FHIR translator (<a href=\"https://github.com/openelimu/VCF-2-FHIR\" target=\"_blank\" title=\"https://github.com/openelimu/VCF-2-FHIR\">https://github.com/openelimu/VCF-2-FHIR</a>). The examples are based on a slightly dated version of the FHIR Genomics implementation guide, but there are a bunch of examples present and/or you can generate more.</p>",
        "id": 186210220,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1579630197
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span> is there any plan to update the code/examples there for the published IG version? There aren't very many differences but should increase the value of the repo</p>",
        "id": 186304425,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1579711071
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> . Yes, we're going to update the code and examples, but I suspect it may not be ready for another month or two.</p>",
        "id": 186305872,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1579711861
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197493\">@v-planat</span>  <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span>  did v-planat every take our profiles and such from our IG and put them into an instance of a HAPI FHIR server? This would be something to track. Also, in case it hasn't been mentioned a fully compliant FHIR server can support any IG...but the transformation in FHIR from backend data sources is up to the implementer. Thus, it is difficult to really have a reference implementation. <span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span>  work on VCF to FHIR provides an example of what it would take to get an implementation that contains genetic data in VCF.</p>",
        "id": 190654100,
        "sender_full_name": "Bret H",
        "timestamp": 1584289129
    },
    {
        "content": "<p>Hi,<br>\nThanks for this follow up. I've looked more in details at Bob Dolin work on VCF to ghir. Php code but very clear to understand. This provides a clear guidance to port it to python or other language. <br>\nBy the way, as my objective was also to understand, from concreate data, how the Genomic FHIR data are structured I've started from  <a href=\"http://hapi.fhir.org/\" target=\"_blank\" title=\"http://hapi.fhir.org/\">http://hapi.fhir.org/</a>   to retrieve all molecularSequence that have observations using a query like:    MolecularSequence?_include:iterate=Observation:has-member<br>\nThis procuded a root list  which contains the list of all resources that are connected to these molecularSequences.<br>\nThen I've retrieved all the dependant resources  including Patient, Observation, Specimen, Organization, molecularSequence</p>\n<p>Regards<br>\n\"\"\"</p>",
        "id": 190697689,
        "sender_full_name": "v-planat",
        "timestamp": 1584350530
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197493\">@v-planat</span> that is good news, hope you find the other profiles (like variant) useful too).</p>",
        "id": 192382654,
        "sender_full_name": "Bret H",
        "timestamp": 1585658360
    }
]