[
    {
        "content": "<p>Hi all!</p>\n<p>I'm currently using the documentation in <a href=\"http://hl7.org/fhir/uv/genomics-reporting/STU1/index.html\">http://hl7.org/fhir/uv/genomics-reporting/STU1/index.html</a> to model genomic variant information. I'm exploiting the profile Variant found here: <a href=\"http://hl7.org/fhir/uv/genomics-reporting/STU1/variant.html\">http://hl7.org/fhir/uv/genomics-reporting/STU1/variant.html</a>. I'm representing the chromosome as a new component of the Variant observation, encoded with LOINC code \"48000-4\". Do you agree on this? <br>\nAlso, among the others, i need to represent:</p>\n<ul>\n<li>the changed codon of a SNP variant, supposed to be encoded with MoleculaSequence</li>\n<li>the genotype quality (phred score), supposed to be encoded with MolecularSequence.quality.roc.score</li>\n<li>the protein code (Uniprot) of the changed protein, supposed to be encoded with Variant observation component</li>\n<li>the population allelic frequency using several different variant databases (e.g. ESP African population, 1K Genome, dnSNP, ESP European population), each one supposed to be encoded with a Variant observation component</li>\n<li>the clinical interpretation according to ClinVar database,  supposed to be encoded with a Variant observation component (component code = \"LA26318-8\", component value system = \"<a href=\"http://hl7.org/fhir/R4/valueset-clinvar.html\">http://hl7.org/fhir/R4/valueset-clinvar.html</a>\") and expected to encode values like \"Likely benign\" or \"Uncertain significance\" etc.</li>\n<li>the clinical interpretation according to COSMIC database,  supposed to be encoded with a Variant observation component (component code = \"LA26319-6\", component value system = \"<a href=\"http://hl7.org/fhir/ValueSet/cosmic\">http://hl7.org/fhir/ValueSet/cosmic</a>\") and expected to encode legacy identifiers like \"COSM3009350\"</li>\n</ul>\n<p>Such attributes are not yet present in the Variant observation profile. I'm not sure if the addition of these new observation components and the use of MolecularSequence is the correct way to proceed and, in the case it is, which LOINC code to use for them. Any suggestions?</p>",
        "id": 231621855,
        "sender_full_name": "Armando De Chiara",
        "timestamp": 1616587432
    },
    {
        "content": "<p>Has anyone replied to Armando?  First of all Armando - you are using STU1 rather than our most current version which can be found here: <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/index.html\">http://build.fhir.org/ig/HL7/genomics-reporting/index.html</a>  . This is the newest version of the IG, which will go to ballot in May. You have many other questions which others can answer better. Can someone please provide some guidance to Armando?  Also - it might be good for him to participate in the Connectathon coming up in May if that would be helpful. You can find information on the HL7 Website: <a href=\"http://www.hl7.org/events/fhir/connectathon/2021/05/\">http://www.hl7.org/events/fhir/connectathon/2021/05/</a></p>",
        "id": 232019149,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1616786702
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196476\">@Arthur Hermann</span>  Thank you for your kind reply, i'll try to participate to the Connectathon. In the meantime i need to fix my open questions before that date. I'm now using the most recent IG version and i changed some of my previous mapping, but there are still the open questions written above.<br>\nAlso, it seems that the clinical interpretation is now mapped on the profile Diagnostic Implication, but the value of the clinical-significance component seems to be bound to the ACMG value set (clinical-significance.value is bound to LOINC Answer List LL4034-6). What if i want to use ClinVar, or better, if i want to use both ACMG and ClinVar? It is similar to the component variation-code of the Variant profile, where there is the possibility to use multiple value sets (variation-code.value is unbound). Any suggestions?</p>",
        "id": 232290289,
        "sender_full_name": "Armando De Chiara",
        "timestamp": 1617033017
    },
    {
        "content": "<p>Hi Armando, the binding strength on clinical-significance to LL4034-6 is extensible, and only applies to 1 coding on that component.valueCodeableConcept. You are free to send additional codings from ClinVar/COSMIC/etc. We did use 48000-4 for chromosome in the updated guidance but don't have community consensus for predefined components for the other concepts you mentioned. Slicing on component is open, so adding those in on Variant is certainly allowed. For population allelic frequency, there is open discussion on use of separate Observations or other resources to capture the needed details of the population.</p>",
        "id": 232294057,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1617034491
    },
    {
        "content": "<p>Look to the examples: <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/artifacts.html#examples\">http://build.fhir.org/ig/HL7/genomics-reporting/artifacts.html#examples</a> . Also,  you could post an example of where you put things. You've got quite a list.</p>",
        "id": 232750583,
        "sender_full_name": "Bret H",
        "timestamp": 1617281448
    }
]