[
    {
        "content": "<p>The March HL7 harmonization meeting has a February 11 deadline for proposal submissions.</p>\n<p><a href=\"http://www.hl7.org/events/harmonization/\" target=\"_blank\" title=\"http://www.hl7.org/events/harmonization/\">http://www.hl7.org/events/harmonization/</a></p>\n<p>The following wiki page describes the harmonization process.  (This document hasn't yet been migrated to Confluence.)</p>\n<p><a href=\"http://wiki.hl7.org/index.php?title=Vocabulary_and_RIM_Harmonization_Process\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Vocabulary_and_RIM_Harmonization_Process\">http://wiki.hl7.org/index.php?title=Vocabulary_and_RIM_Harmonization_Process</a></p>\n<p>My understanding is that various genomics code systems may need to go through harmonization in order to be properly integrated with HL7 standards.  Harmonization involves all HL7 standards, not only FHIR.  Third-party code systems may additionally need to be considered by the HL7 Terminology Authority (HTA), but should go through harmonization first.</p>\n<p>The CG workgroup has been compiling information about relevant genomics code systems in the following Google doc.</p>\n<p><a href=\"https://docs.google.com/spreadsheets/d/14sIVVED2rI0Ab2ZQ3oV6v8njzX-sRezkIWcgkkepUUg/edit#gid=0\" target=\"_blank\" title=\"https://docs.google.com/spreadsheets/d/14sIVVED2rI0Ab2ZQ3oV6v8njzX-sRezkIWcgkkepUUg/edit#gid=0\">https://docs.google.com/spreadsheets/d/14sIVVED2rI0Ab2ZQ3oV6v8njzX-sRezkIWcgkkepUUg/edit#gid=0</a></p>\n<p>If possible by Feb. 11, I think it would be best to identify genomics code systems we are ready to advance through the harmonization process, and construct a harmonization proposal for those.</p>\n<p>This topic was briefly discussed  during last Tuesday's CG call, where we decided to continue discussion here, in Zulip.</p>",
        "id": 157247594,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1548910835
    },
    {
        "content": "<p>the question to me is: what should be harmonized in our IG? We are reusing CodeSystems which were already used in V2 / CDA. The only problem we are currently facing is that V2/3 Codsystems didn't had a System URI. So we need to create these.<br>\nThe only thing which could impact outside of the FHIR World would be the  CodeSystems which weren't used in V2/3.</p>",
        "id": 157290272,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1548956836
    },
    {
        "content": "<p>Identifying third-party code systems that need to be considered by the HTA is another aspect.   E.g. cases where an agreement between HL7 and the code system owner/publisher is needed.</p>",
        "id": 157291577,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1548957920
    },
    {
        "content": "<p>no agreement is needed to assign a system URL and descrie how to use a code system.</p>",
        "id": 157293805,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1548959654
    },
    {
        "content": "<p>we only need agreement to distribute</p>",
        "id": 157293806,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1548959656
    },
    {
        "content": "<p>For now, my thinking is the clinical genomics WG doesn't have items which immediately need to be brought to the March harmonization cycle.  If we identify items that would benefit from going through harmonization, it may be best to wait until after they have been added to the CG implementation guide and/or exercised in connectathons.</p>",
        "id": 157814409,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1549574870
    }
]