[
    {
        "content": "<p>is there a consensus on how to capture variants-obs on fusion genes? I know the notation: ETV6-NTRK3 vs. ETV6:NTRK3 (i think the first one is more common).<br>\nWould we capture this in gene studied id? Gene studied id has an extensible ValueSet binding on HGNC. To my knowledge ETV6-NTRK3 wouldn't be a valid HGNC value. If we would use the ETV6-NTRK3 format, what would be the CodeSystem? Our own one?: <a href=\"http://hl7.org/fhir/uv/genomics-reporting/CodeSystem/fusion-gene\" target=\"_blank\" title=\"http://hl7.org/fhir/uv/genomics-reporting/CodeSystem/fusion-gene\">http://hl7.org/fhir/uv/genomics-reporting/CodeSystem/fusion-gene</a>?</p>",
        "id": 167490789,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1559834060
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>  you remind me of this ongoing but only kinda related question I have - I'm just curious why oncology knowledgebases generally represent variants at the protein level rather than at the DNA level?</p>",
        "id": 167524879,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1559856854
    },
    {
        "content": "<p>I don’t think we ever discussed this and I am not sure what the right answer is? Is there a list of possible fusion genes anywhere we could reference in a new “fusion-gene” code system?</p>",
        "id": 167611934,
        "sender_full_name": "Kevin Power",
        "timestamp": 1559939877
    },
    {
        "content": "<p>Oncological knowledge databases can, for example, provide information on questions such as the possible relationship between AR amplification and TMPRSS2-ERG gene fusion in prostate cancer. It is known that gene fusions occur in more than 50% of prostate adenocarcinoma, with TMPRSS2-ERG being one of the most common. In my opinion, both levels are important to identify the variants at the DNA level and the effects on protein levels (if known). </p>\n<p>Maybe this could help for Fusion Gene Lists? <br>\nFusionGDB (Fusion Gene annotation DataBase) available at <a href=\"https://ccsm.uth.edu/FusionGDB\" target=\"_blank\" title=\"https://ccsm.uth.edu/FusionGDB\">https://ccsm.uth.edu/FusionGDB</a>.</p>",
        "id": 167841892,
        "sender_full_name": "Dora Walter",
        "timestamp": 1560253438
    },
    {
        "content": "<p>i contacted the staff from FusionGDB and they confirmed that a Fusion between geneA-geneB is unique. Therefore this seems a good CodeSystem to include. And transport the fusions as FusionGDB ID encoded values.</p>",
        "id": 168030463,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1560419816
    },
    {
        "content": "<p>regards stating the effect on the protein level. For others, the logic is that if there is a DNA change this may or may not be relevant at the protein sequence level. For example, if the change does not effect splicing or codons then at the protein sequence level there is no change. There can still be a change in the amount of protein but that is not a protein sequence change. (maybe obvious to everyone) &gt; <span class=\"user-mention\" data-user-id=\"195522\">@Dora Finkeisen</span> sound right?</p>",
        "id": 175756411,
        "sender_full_name": "Bret H",
        "timestamp": 1568565765
    },
    {
        "content": "<p>right</p>",
        "id": 175758154,
        "sender_full_name": "Dora Walter",
        "timestamp": 1568568582
    }
]