[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span>  - are we aligning with the GA4GH Variant Representation Specifcation? I know that variant has been a continuing discussion in the WG - but I was not aware that there was a GA4GH specification. I don't know what the implications alignment would be, if we have not already delved into this spec...    Sorry if I am asking a silly question that complicates things for the Genomics WG....  just came across the spec and wanted to understand.   <a href=\"https://vr-spec.readthedocs.io/en/1.0/index.html#ga4gh-variation-representation-specification\">https://vr-spec.readthedocs.io/en/1.0/index.html#ga4gh-variation-representation-specification</a></p>",
        "id": 206968024,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1597433266
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span></p>",
        "id": 207182987,
        "sender_full_name": " Bob Milius",
        "timestamp": 1597690545
    },
    {
        "content": "<p>Great question, <span class=\"user-mention\" data-user-id=\"196476\">@Arthur Hermann</span> . Our intention is to align with GA4GH VR and VA.  I presented a few updates on that work, and IIRC the \"outside efforts\" part of our meeting minutes has links to those specs. Apologies if we don't circle back to it frequently enough and have missed looping you in. Please feel free to ask questions if you have specific concerns, or ping me offline and I can give you the bigger picture.</p>",
        "id": 207185695,
        "sender_full_name": "Bob Freimuth",
        "timestamp": 1597691849
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span>  - The reason I brought this up - and I will be clear that some of this is way over my head...  is the continued discussion of some portions of the proposed block vote for tomorrow. In fact I think part of that was pulled at today's FHIR meeting. <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span>  understands this much better than I do. I don't know if the changes we are discussing are taking us closer or farther away from the GA4GH VR/VA . My concern is that we try our best to align between the two - as it will benefit the genomic community at large..   thank you!</p>",
        "id": 207190767,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1597694727
    },
    {
        "content": "<p>Thanks for watching out for this, Arthur. I'll try to sync up with <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> .</p>",
        "id": 207197212,
        "sender_full_name": "Bob Freimuth",
        "timestamp": 1597698215
    }
]