[
    {
        "content": "<p>This might be a more general OO question - but it is in a genomic context so will ask here. We are generating a DiagnosticReport for a genomics sequencing test with an Observation per reportable Variant. However we have two places where the user in the software (not our software, software we are wrapping) can enter some free text notes about the overall report, and each variant. We can't work out where these small snippets of text should go? We could throw the text into the overall narrative but then it would only be available if the downstream users are consuming the whole narrative - and not if they are consuming the observation as computable content. Can we make a component of the Observation with our own custom code and a valueString value - and have it hold some text? And what then about the text that represents an overall impression of all the variants (this might only be a paragraph or two) - where in DiagnosticReport should that go? Thanks</p>",
        "id": 153964235,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1527042688
    },
    {
        "content": "<p>DiagnosticReport.conclusion</p>",
        "id": 153964237,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527043303
    },
    {
        "content": "<p>I don't know why I didn't see that.. and for the per variant (represented as contained observations in the DiagnosticReport) - we actually 3 snippets of free text (a variant findings, recommendations and remarks) - a component for each with type valueString?</p>",
        "id": 153964240,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1527043727
    },
    {
        "content": "<p>Actually sorry I've got that the wrong way around (which is why we didn't use conclusion)</p>",
        "id": 153964241,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1527043768
    },
    {
        "content": "<p>So the overall DiagnosticReport has 3 free text bits - findings, recommendations and remarks.. which I guess we could concat together into the conclusion but don't really know how the downstream users might want to consume (they may want one at the top, and one at the bottom).</p>",
        "id": 153964243,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1527043834
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> for more comment. I'm not sure about the components, but I expect it's been discussed</p>",
        "id": 153964244,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527043845
    },
    {
        "content": "<p>Each individual variant Observation has a single piece of free text</p>",
        "id": 153964245,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1527043853
    },
    {
        "content": "<p>its' not Observation.interpretation?</p>",
        "id": 153964247,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527044568
    },
    {
        "content": "<p>Its narrative text not really a codeable concept like interpretation</p>",
        "id": 153964248,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1527045036
    },
    {
        "content": "<p>There's Observation.comment to capture ad-hoc notes about the Variant and other observations.  In terms of breaking findings and recommendations out as distinct pieces from conclusion, <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>, is this something OO has discussed before?</p>",
        "id": 153964249,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527045414
    },
    {
        "content": "<p>I don't understand why I keep missing these very obvious fields - I swear I do actually look at the resource definitions before asking.</p>",
        "id": 153964250,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1527045497
    },
    {
        "content": "<p>My best guess at the moment for overall DiagnosticReport distinct pieces of text problem is a single observation for each text piece with custom codes, or a single observation for all of them, with a component each (and custom codes)</p>",
        "id": 153964251,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1527045586
    },
    {
        "content": "<p>Thanks all</p>",
        "id": 153964252,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1527045592
    },
    {
        "content": "<p>To give some slightly more context - this is the in between report - so going from the genomics system back to the lab - at which point the clinical staff will be writing up a full proper report (with conclusions etc). Which is why I really need to keep them separate as each lab can have their own rules for how the proper report is constructed without losing any detail</p>",
        "id": 153964253,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1527045749
    },
    {
        "content": "<p>nope</p>",
        "id": 153964256,
        "sender_full_name": "Eric Haas",
        "timestamp": 1527046539
    }
]