[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196476\">@Arthur Hermann</span> - thanks so much for posting the PDF report and HL7v2 examples. Were those HL7v2 examples (even if test data) provided by the reference lab or an interim system? Or were they manually crafted?</p>",
        "id": 246886220,
        "sender_full_name": "May Terry",
        "timestamp": 1626978058
    },
    {
        "content": "<p>Hello May.... The HL7v2 files come from the same source as the PDF (Claris Life Sciences). They were provided to me along with the PDF version, as examples of how they are trying to provide the same info in the PDFs in HL7v2. They have been working with Epic on developing these Hl7v2 messages (from my understanding, Epic is working with Labs trying to supply genomic info to their EMR, using HL7 NOT FHIR). I recall the person who provided these examples saying they were not yet complete and tested - the were still working out some details with Epic to complete them. Hope this helps.</p>",
        "id": 246908327,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1626989290
    },
    {
        "content": "<p>It does. Thanks Arthur! :-)</p>",
        "id": 246928570,
        "sender_full_name": "May Terry",
        "timestamp": 1627007751
    },
    {
        "content": "<p>I just loaded an image of a report from Strata to our shared repository of reports in Docs. Kaiser is using Strata for Oncology (at least in some regions). This report just confirms what we have seen in other oncology based reports and includes links to clinical trials...  image of report can be found here;  <a href=\"https://drive.google.com/file/d/14k5T-Cr8pPQuJedytts1oDNuOGdhyUvr/view?usp=sharing\">https://drive.google.com/file/d/14k5T-Cr8pPQuJedytts1oDNuOGdhyUvr/view?usp=sharing</a></p>",
        "id": 262355043,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1637603870
    },
    {
        "content": "<p>Thanks for sharing <span class=\"user-mention\" data-user-id=\"196476\">@Arthur Hermann</span> ! One question: The #2 list doesn't show any trials, seems none qualified. Any chance you can get an example of what it looks like when they show clinical trials?</p>",
        "id": 262357904,
        "sender_full_name": "Kevin Power",
        "timestamp": 1637605250
    },
    {
        "content": "<p>I don't have one unfortunately <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> . The notes on Strata's website say that this information can be configured as desired by the client. KP is using it to match medications - not clinical trials. Unfortunately I don't have a copy of the later . Their text says:  \"Associated Clinical Trials: Including NCI-MATCH arms. List can be customized to include local precision trails as determined by your institution\".</p>",
        "id": 262373787,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1637613156
    },
    {
        "content": "<p>No worries, still a good example.</p>",
        "id": 262374189,
        "sender_full_name": "Kevin Power",
        "timestamp": 1637613381
    },
    {
        "content": "<p>Thanks for sharing, Arthur!  It's a helpful fusion example.</p>",
        "id": 262479772,
        "sender_full_name": "May Terry",
        "timestamp": 1637685301
    },
    {
        "content": "<p>Is there a way to show how an EMR might 1) represent on the backend, 2) display in the user interface?</p>",
        "id": 262483461,
        "sender_full_name": "Bret H",
        "timestamp": 1637686997
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span>  I think the only way we could see that would be if <span class=\"user-mention\" data-user-id=\"249407\">@Rachel Kutner</span> was able to show us a mock-up. I know that Epic doesn't like to share screen shots - but perhaps Rachel could give us an idea of the fields that would be displayed without sharing a screenshot if that is a problem.My comment is based on the supposition that Epic can currently display all of these data points. I am not sure this supposition is correct.</p>",
        "id": 262494880,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1637692008
    },
    {
        "content": "<p>While that would be helpful, I am not sure it is required. When <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> and <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> were working on eMERGE, there was a ton of value in mapping their report elements to our IG down to the profile/attribute level. Perhaps we do the same thing here, if anyone is will to do so? Of course, since we haven't worked out all the details of what a 'biomarker' looks like, it might be challenging.<br>\nCC: <span class=\"user-mention\" data-user-id=\"192302\">@May Terry</span></p>",
        "id": 262496330,
        "sender_full_name": "Kevin Power",
        "timestamp": 1637692798
    }
]