[
    {
        "content": "<p>The fixed observation code on the  genotype profile is <a href=\"https://loinc.org/84413-4/\" target=\"_blank\" title=\"https://loinc.org/84413-4/\">LOINC 84413-4 Genotype Display Name</a>.  The value is a text string containing the display name of the genotype. There are 3 components; genome-assembly, gene-studied and cytogenic-location.</p>\n<p>Based on this profile, I'd like to verify whether this is intended to represent a genotype or just the display name of the genotype?  If it is meant to represent a genotype, then should there be constraints to require at least some notion of the derived haplotype and/or variants that this \"genotype display name\" observation was based on?</p>\n<p>In the emerge pilot we are trying to find some \"minimal\" approaches to sharing genotypes that are used to deriive medication implication observations. We are seriously considering using just the genotype profile to do this. I'm assuming if we do this then we be purely basing our medication implications on genotype display names only and no real sense of what the computational measure was that went into making the assessment of the actual observations that lead to that genotype display name.</p>\n<p>Does this approach to handling this use case align with what the CG IG group is hoping to enable with the genotype profile ?  Any feedback, concerns or even a simple validation of the intended use of the genotype profile would be greatly appreciated.  (for example, is this a genotype or is it a genotype display name observation - there's a difference in my mind. am I overthinking this?)</p>",
        "id": 181207260,
        "sender_full_name": "Larry Babb",
        "timestamp": 1574257038
    },
    {
        "content": "<blockquote>\n<p>Based on this profile, I'd like to verify whether this is intended to represent a genotype or just the display name of the genotype?  If it is meant to represent a genotype, then should there be constraints to require at least some notion of the derived haplotype and/or variants that this \"genotype display name\" observation was based on?</p>\n</blockquote>\n<p>The profile allows for both - just a display name or a more structured version.  I would say it depends on what can be shared.</p>\n<blockquote>\n<p>In the emerge pilot we are trying to find some \"minimal\" approaches to sharing genotypes that are used to deriive medication implication observations. We are seriously considering using just the genotype profile to do this. I'm assuming if we do this then we be purely basing our medication implications on genotype display names only and no real sense of what the computational measure was that went into making the assessment of the actual observations that lead to that genotype display name.</p>\n</blockquote>\n<p>I think that is a reasonable approach.  More data is always better, but not always shared.</p>\n<blockquote>\n<p>Does this approach to handling this use case align with what the CG IG group is hoping to enable with the genotype profile ?  Any feedback, concerns or even a simple validation of the intended use of the genotype profile would be greatly appreciated.  (for example, is this a genotype or is it a genotype display name observation - there's a difference in my mind. am I overthinking this?)</p>\n</blockquote>\n<p>I understand why you ask and the difference you note - but in general, we have tried to keep the model fairly open right now.  As we define our IM model and get buy-in from the community, we can start enforcing more structured data.  I think it will be hard to do today.</p>",
        "id": 181212938,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574260933
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> </p>\n<blockquote>\n<p>The profile allows for both - just a display name or a more structured version. I would say it depends on what can be shared.</p>\n</blockquote>\n<p>How can you provide a \"more structured version\"? I think I'm missing that part. Are you referring to the derivedFrom associations or something you can do with the \"value\" of the observation? Or something else that I'm completely missing? (Thanks for the quick response)</p>",
        "id": 181219046,
        "sender_full_name": "Larry Babb",
        "timestamp": 1574264581
    },
    {
        "content": "<p>As far as I can tell the computable structure is in the derivedFrom references, though there are some grammatical approaches (GLString for HLA, etc) that can provide a decent amount of info in the name.</p>",
        "id": 181222183,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574266466
    },
    {
        "content": "<p>Jamie is right - its the best we have for the computable structure today.</p>",
        "id": 181222407,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574266610
    }
]