[
    {
        "content": "<p>Draft of all the guidance we provide in observation profile spreadsheet (and some LOINC lookups I expanded with local tooling for convenience): <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/Glossary.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/Glossary.html\">http://build.fhir.org/ig/HL7/genomics-reporting/Glossary.html</a></p>",
        "id": 176122002,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1568914131
    },
    {
        "content": "<p>Nice and very useful.  However, I am not sure I would call this a glossary?</p>\n<p>Also, as we change/adjust codeable concepts, how do we regenerate this page?  Do you have to use your local tooling to do that?</p>",
        "id": 176123583,
        "sender_full_name": "Kevin Power",
        "timestamp": 1568915123
    },
    {
        "content": "<p>We decided to view a centralized statement of our definitions on the \"glossary\" tracker, and I think it is quite useful to see what needs more clarity (any blank entries in the table correspond with gaps in definition on the profiles themselves).</p>\n<p>And yes, I don't want to mess with the framework too much, so updates to the spreadsheet would have to be duplicated here, which is why we waited to apply until ready for publication. Should be much easier to integrate once we switch to new templating.</p>",
        "id": 176130101,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1568919170
    },
    {
        "content": "<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16513&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16513&amp;start=0\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16513&amp;start=0</a></p>",
        "id": 176130378,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1568919337
    },
    {
        "content": "<p>Happy to name/format it however is most appropriate, definitely open to suggestions for improvement.</p>",
        "id": 176130483,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1568919389
    },
    {
        "content": "<p>There are a couple example/textual answer lists we already provide that could be easily added in, for starters.</p>",
        "id": 176130656,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1568919508
    },
    {
        "content": "<p>This is one of those that I don't really have a better alternative for it, and if the group is happy with this as our starter 'glossary', I am happy with it.  Great work <span class=\"user-mention\" data-user-id=\"196553\">@James Jones</span>  !</p>",
        "id": 176131644,
        "sender_full_name": "Kevin Power",
        "timestamp": 1568920166
    },
    {
        "content": "<p>missing text: Example for Allelic read depth (82121-5)  </p>\n<p>There are two kinds: Allele depth (AD) and depth of coverage (DP). These are complementary fields that represent two important ways of thinking about the depth of the data for this sample at this site.</p>\n<p>AD is the unfiltered allele depth, i.e. the number of reads that support each of the reported alleles. All reads at the position (including reads that did not pass the variant caller’s filters) are included in this number, except reads that were considered uninformative. Reads are considered uninformative when they do not provide enough statistical evidence to support one allele over another.</p>\n<p>DP is the filtered depth, at the sample level. This gives you the number of filtered reads that support each of the reported alleles. You can check the variant caller’s documentation to see which filters are applied by default. Only reads that passed the variant caller’s filters are included in this number. However, unlike the AD calculation, uninformative reads are included in DP.</p>\n<p>Source: <a href=\"https://gatkforums.broadinstitute.org/gatk/discussion/1268/what-is-a-vcf-and-how-should-i-interpret-it\" target=\"_blank\" title=\"https://gatkforums.broadinstitute.org/gatk/discussion/1268/what-is-a-vcf-and-how-should-i-interpret-it\">https://gatkforums.broadinstitute.org/gatk/discussion/1268/what-is-a-vcf-and-how-should-i-interpret-it</a></p>\n<p>missing text: Example for Human reference sequence assembly version (62374-4)  <br>\nA reference genome (also known as a reference assembly) is a digital nucleic acid sequence database, assembled as a representative example of a species' set of genes. (Source: <a href=\"https://en.wikipedia.org/wiki/Reference_genome\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/Reference_genome\">https://en.wikipedia.org/wiki/Reference_genome</a>)</p>",
        "id": 176653735,
        "sender_full_name": "Dora Walter",
        "timestamp": 1569501423
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196553\">@James Jones</span> nice work. suggest to provide more clarity on the the codes - e.g.  separate code with new line with 'LOINC XXXX-X' The short hand profile names are nice but are not the names on the profiles. Change HTML so that the Headers of the columns are always at the top as you scroll. feel free to tell me to add it. lots of JS tricks to provide more info on each line - any flexibility here or do we have a HL7 FHIR style guide?</p>",
        "id": 176713691,
        "sender_full_name": "Bret H",
        "timestamp": 1569551522
    }
]