[
    {
        "content": "<p>In the HL7v2 specification, there is a section for Complex Variants. This section has a concept, Complex Variant Type (<a href=\"https://loinc.org/81263-6/\" title=\"https://loinc.org/81263-6/\">https://loinc.org/81263-6/</a>) with an Answer List (<a href=\"https://loinc.org/LL3999-1/\" title=\"https://loinc.org/LL3999-1/\">https://loinc.org/LL3999-1/</a>) containing Hemizygous.</p>\n<p>Allelic State already allows marking a variant of another type as \"Hemizygous\" zygosity - Why is Hemizygous also a type of Complex Variant? What are the examples for when a Hemizygous variant would need to be represented as a grouping of individual variants? </p>\n<p>Additionally: Do these concepts (Complex Variant, Complex Variant Type) have corollaries in the FHIR IG? Can someone point me to documentation on how they would be represented there?</p>",
        "id": 196380716,
        "sender_full_name": "Rachel Kutner",
        "timestamp": 1588721105
    },
    {
        "content": "<p>In FHIR IG, we boiled down to just a single Variant profile.  You will find a component for 'complex-var-type' and it has the same LOINC code/answer list as you referenced above.</p>",
        "id": 196381221,
        "sender_full_name": "Kevin Power",
        "timestamp": 1588721549
    },
    {
        "content": "<p>And not to skip your other question - we do have some overlap between some value sets like that I am afraid.  TBH - we haven't spent a ton of time on complex variant examples and validation, so it doesn't surprise me that we have some things to make better.</p>",
        "id": 196382889,
        "sender_full_name": "Kevin Power",
        "timestamp": 1588722931
    },
    {
        "content": "<p>Sorry if I'm repeating myself, I'm just still a bit unclear on the decision to include hemizygous in the Complex Variant Type terms. Do we have documentation regarding the decision to include that as a Complex Variant Type? I'm not sure I understand when it would be represented this way.</p>",
        "id": 196690291,
        "sender_full_name": "Rachel Kutner",
        "timestamp": 1588795850
    },
    {
        "content": "<p>I think that is really a LOINC question.  The LOINC code (<a href=\"https://loinc.org/81263-6/\" title=\"https://loinc.org/81263-6/\">https://loinc.org/81263-6/</a> ) is still in Trial status, and it says the source for the answer list was \"Source: Genetic Home Reference, National Library of Medicine\"</p>\n<p><span class=\"user-mention\" data-user-id=\"194730\">@Liz Amos</span> anything else you might say or weigh in with?</p>",
        "id": 196692192,
        "sender_full_name": "Kevin Power",
        "timestamp": 1588796751
    },
    {
        "content": "<p>So, I got some info from Clem - the complex variant is a string of nucleotides that doesn't have an opposite string, the best example being a male chromosome or a pair with a deleted string. However, this may not be important or useful now, especially in the context of FHIR. (FYI - I relayed this from a phone call so I probably got some details wrong!) Happy to follow up in other methods of communication.</p>",
        "id": 196704477,
        "sender_full_name": "Liz Amos",
        "timestamp": 1588802762
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"249407\">@Rachel Kutner</span>  hemizygous is noted in the alleic-state component of variant in the FHIR IG . <a href=\"http://hl7.org/fhir/uv/genomics-reporting/variant-definitions.html#Observation.component:allelic-state\" title=\"http://hl7.org/fhir/uv/genomics-reporting/variant-definitions.html#Observation.component:allelic-state\">http://hl7.org/fhir/uv/genomics-reporting/variant-definitions.html#Observation.component:allelic-state</a></p>",
        "id": 197056439,
        "sender_full_name": "Bret H",
        "timestamp": 1589118365
    }
]