[
    {
        "content": "<p>I had a nice chat with Bimal Desai at CHOP. His team has a web app that clinicians use to collect phenotype information on patients during clinic encounters for patients needing genetic testing. They are currently using Epic services to capture HPO codes into CHOP's Epic EHR, but Bimal is curious to know how to do this using FHIR so the app can be used elsewhere. </p>\n<p>So question to the group...what do we think about HPO codes? Are they observations (one per code), a list of codes that are attached to some clinical documentation like a diagnostic report, or something else? Since a patient's phenotype can change, these codes would need to be updated in the chart along with documentation of who and when for the updates. </p>\n<p>Thoughts?</p>",
        "id": 174460122,
        "sender_full_name": "John David Larkin Nolen",
        "timestamp": 1567089692
    },
    {
        "content": "<p>You might want to take a look at phenopackets: <a href=\"https://phenopackets-schema.readthedocs.io/en/latest/\" target=\"_blank\" title=\"https://phenopackets-schema.readthedocs.io/en/latest/\">https://phenopackets-schema.readthedocs.io/en/latest/</a> There's a FHIR implementation at <a href=\"https://genomics.ontoserver.csiro.au/phenopackets/\" target=\"_blank\" title=\"https://genomics.ontoserver.csiro.au/phenopackets/\">https://genomics.ontoserver.csiro.au/phenopackets/</a>. They use Observation, but with extensions for HPO data such as age of onset. I haven't used it, but looks very good to me.</p>",
        "id": 174526575,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1567154933
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192440\">@Marc de Graauw</span> Thanks! I will take a look at that and share it with Bimal. I like the way they are using Condition as the anchor point for the HPO codes, but I know the headaches that can cause in a typical EHR implementation if the problem list cannot be filtered so the codes get seen by those who actually want to see them.</p>",
        "id": 174561452,
        "sender_full_name": "John David Larkin Nolen",
        "timestamp": 1567183331
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191969\">@John David Larkin Nolen</span>  be great to see how you use it. can you place an example in this chat? many thanks! Bret</p>",
        "id": 175351238,
        "sender_full_name": "Bret H",
        "timestamp": 1568131130
    },
    {
        "content": "<p>Let me ping Bimal and get some examples, screenshots.</p>",
        "id": 175353725,
        "sender_full_name": "John David Larkin Nolen",
        "timestamp": 1568132911
    },
    {
        "content": "<p>Two things:</p>\n<p>1. Bimal is interested in demo-ing their solution on a future Tuesday CG call...let me know if you guys want him to do that. <br>\n2. <span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> , here is a narrative from Bimal about their workflow with the app: <br>\nThe app runs within a clinical encounter (inpatient or outpatient) alongside the screen where a user would write their progress note.  It looks like an online shopping cart with a search bar.  As you type terms, it suggests a list of matching terms that you can “autocomplete” with 1 click.  Once you choose a term, you can traverse the ontology and choose child or parent terms before clicking “ADD HPO”, which adds it to the “shopping cart” of new terms.</p>\n<p>Once you’re satisfied with the list you’ve compiled, along with any clinical annotations, you click “Save All”, which files the values to Epic via webservices.  It makes use of 2 EHR-specific webservices offered by Epic, the “getSmartDataValues” and “setSmartDataServices” services.</p>\n<p>We actually save 2 versions of the HPO term list- one for future inclusion into our genomics pipeline (a JSON string, but could be Phenopackets payload in the future), and one as RTF so the team can include the list in their clinic note as a nicely-formatted table.</p>",
        "id": 175452085,
        "sender_full_name": "John David Larkin Nolen",
        "timestamp": 1568220790
    },
    {
        "content": "<p>Did we ever come to a resolution on this? Epic uses HPO codes as noted, so very important for Epic uses such as Kaiset to incorporate their use</p>",
        "id": 177914418,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1570805651
    },
    {
        "content": "<p>I understood JD's question was about weather HPO codes are observations. You can use them as the value of a Inherited Disease Pathogenicity profile associated phenotype component. - there is no restriction there. <span class=\"user-mention\" data-user-id=\"196476\">@Arthur Hermann</span>  but is the question about Phenopackets (which appears to be a developing standard that is being moved into FHIR)?</p>",
        "id": 177922592,
        "sender_full_name": "Bret H",
        "timestamp": 1570810343
    },
    {
        "content": "<p>Following up on this. First, here is a PDF of a poster from Bimal showing the app and its use. <a href=\"/user_uploads/10155/yzbt7ZorRPA-ChNVSVwBW5N2/HPO_POSTER.pdf\" target=\"_blank\" title=\"HPO_POSTER.pdf\">HPO_POSTER.pdf</a> </p>\n<p>I think the phenopackets approach might be the best. I am exploring that here at CMH as we looking at improving the workflow in and around genomic testing.</p>",
        "id": 178766361,
        "sender_full_name": "John David Larkin Nolen",
        "timestamp": 1571757829
    }
]