[
    {
        "content": "<p>The openEHR community has asked whether we (FHIR community) are interested in a doing a joint FHIR / openEHR meeting around alignment in the genomics space somewhere in Europe as a satellite meeting to DevDays in Amsterdam</p>",
        "id": 167762936,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560176390
    },
    {
        "content": "<p>with regard to their interest in genomics, there is ongoing work about the modelling of genetic variant archetypes with openEHR, and  <span class=\"user-mention\" data-user-id=\"191650\">@Ian McNicoll</span> says: </p>\n<blockquote>\n<p>The rationale is that this can lead to broader international input on the genomics models (and from a wider perspective than just reporting) and that there is a bunch of prior art in terms of clinical phenotypics- both from HighMED and Genomics England use and while this may not be immediately applicable but should at least act as a kick-off point for discussion and development.  The prime goal here is not to be offering an alternative set of models but examining if/how using openEHR methodology can get us to the same GA4GH endpoint more efficiently. We have to cover the same sort of ground internally, in any case.</p>\n</blockquote>",
        "id": 167763076,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560176479
    },
    {
        "content": "<p>We (CSIRO, not me specifically) are certainly interested and active in that space. <span class=\"user-mention\" data-user-id=\"191345\">@Alejandro Metke</span> would be the most obvious person to participate in that, but he won't be able to be at DevDays as he'll be at AMIA. We might try to send someone else though</p>",
        "id": 167780084,
        "sender_full_name": "Jim Steel",
        "timestamp": 1560189121
    },
    {
        "content": "<p>From Clem McDonald: Need to distinguish between reporting of genetic reports to clinicians from the reporting of raw results from sequencing (different approaches). Some standards are established for sequencing results. Also be aware of active work on phenotyping from the Monarch Initiative (<a href=\"https://monarchinitiative.org/\" target=\"_blank\" title=\"https://monarchinitiative.org/\">https://monarchinitiative.org/</a>) and the eMERGE study, both funded by NHGRI/NIH.</p>",
        "id": 167856883,
        "sender_full_name": "Liz Amos",
        "timestamp": 1560264351
    },
    {
        "content": "<p>The primary focus here is on genetic reports to clinicians. <a href=\"https://openehr.org/ckm/templates/1013.26.223\" target=\"_blank\" title=\"https://openehr.org/ckm/templates/1013.26.223\">https://openehr.org/ckm/templates/1013.26.223</a> but also within the context of a rich phenotypics dataset e.g. <a href=\"https://ckm.apperta.org/ckm/#showProject=1051.61.28\" target=\"_blank\" title=\"https://ckm.apperta.org/ckm/#showProject=1051.61.28\">https://ckm.apperta.org/ckm/#showProject=1051.61.28</a> - this is currently being used in a number of UK hospitals to gather front-line data and curate it before reporting. Just to be clear our goal in this new project is to sit inside the GA4GH output, in terms of exchanging data but see if/how using openEHR can help in the definition of genomics variant models for persistence in an EHR, as well as being a basis for the very extensive FHIR profiling work that will be required for the clinical phenotypics.</p>",
        "id": 167941983,
        "sender_full_name": "Ian McNicoll",
        "timestamp": 1560343192
    },
    {
        "content": "<p>I think this would also be of interest for the German HiGHmed consortium! So also a +1 from my side</p>",
        "id": 168027950,
        "sender_full_name": "Birger",
        "timestamp": 1560417487
    },
    {
        "content": "<p>depending on actual date and location this could be interesting to us</p>",
        "id": 168029799,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1560419202
    },
    {
        "content": "<p>Hi! we (CRS4) will be definitely interested in participating.</p>",
        "id": 168764022,
        "sender_full_name": "GIanluigi Zanetti",
        "timestamp": 1561235010
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span></p>",
        "id": 169175208,
        "sender_full_name": " Bob Milius",
        "timestamp": 1561669416
    },
    {
        "content": "<p>Echo Clem's comment on identifying the specific use cases. Clinical reporting is a different endpoint than enabling reanalysis or research. <span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span> given the modeling aspects, I would recommend Bob Freimuth be requested to participate. He leads or Information Modeling subgroup.</p>",
        "id": 176209276,
        "sender_full_name": "Bret H",
        "timestamp": 1568997832
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191650\">@Ian McNicoll</span> I would be interested in attending such a meeting. I work on the  mCODE (minimal Cancer Oncology Data Elements) project, which up to now, has been US-focused. But we realize there is a demand for an international standard and want to work towards that.</p>",
        "id": 176209628,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1568998075
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>  did the meeting already take place? I realize Grahame was talking about DevDays. Was there documentation of the outcome from the meeting?</p>",
        "id": 176505438,
        "sender_full_name": "Bret H",
        "timestamp": 1569358622
    },
    {
        "content": "<p>I thought the proposal was to meet in November, prior to DevDays in A’dam</p>",
        "id": 177765708,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1570664133
    },
    {
        "content": "<p>ahh, that makes sense. Thanks <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span></p>",
        "id": 177772087,
        "sender_full_name": "Bret H",
        "timestamp": 1570671877
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"192123\">Bret H</span>  I would recommend Bob Freimuth be requested to participate. He leads or Information Modeling subgroup.</p>\n</blockquote>\n<p>I'd be happy to contribute to the discussion, but I will be at the AMIA Annual Symposium that week.</p>",
        "id": 179478129,
        "sender_full_name": "Bob Freimuth",
        "timestamp": 1572470098
    },
    {
        "content": "<p>Was there any resolution on a time/place/agenda for this meeting?</p>",
        "id": 180594635,
        "sender_full_name": "Jim Steel",
        "timestamp": 1573624614
    },
    {
        "content": "<p>I think it fell through</p>",
        "id": 180597327,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573628117
    }
]