[
    {
        "content": "<p>During yesterdays call this topic was discussed again without a clear motion for a concrete solution: <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=66931175#CG-2019-11-12-Topic3:LOINCupdates\" target=\"_blank\" title=\"https://confluence.hl7.org/pages/viewpage.action?pageId=66931175#CG-2019-11-12-Topic3:LOINCupdates\">https://confluence.hl7.org/pages/viewpage.action?pageId=66931175#CG-2019-11-12-Topic3:LOINCupdates</a></p>",
        "id": 180608129,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1573638737
    },
    {
        "content": "<p>This thread is to discuss the issue and create a proposed resolution to vote on during a weekly call.</p>",
        "id": 180608152,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1573638775
    },
    {
        "content": "<p>So, some background as a starting point:</p>\n<ul>\n<li>\n<p>A good starting point for everyone to learn (or remember) what we did is to review the diagram here: <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/general.html#genomic-observations\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/general.html#genomic-observations\">http://build.fhir.org/ig/HL7/genomics-reporting/general.html#genomic-observations</a> </p>\n</li>\n<li>\n<p>Our base  \"Implication\" profile (abstract, never directly used) contains a component slice for 'evidence-level' (code = 93044-6, answer list = LL5356-2 is preferred).  Since this is in our base implication profile, it becomes a component on all of our implication profiles.<br>\n** So therefore, all implications will have a component to deliver the evidence level</p>\n</li>\n<li>\n<p>We have 3 general categories of implication profiles:<br>\n** Inherited Disease Pathogenicity (IDP)<br>\n** Medication - Supports PGx use cases<br>\n** Somatic</p>\n</li>\n<li>\n<p>IDP profile uses code 53037-8, values of Path/Likely Path/Uncertain/Likely Benign/Benign</p>\n</li>\n<li>\n<p>Medication Implication is another abstract (never directly used) profile.  It defines a single component for 'medication-assessed' since it applies to all the PGx profiles.</p>\n</li>\n<li>\n<p>Medication (PGx) has 4 concrete (directly used) profiles for the different types of PGx implications - each has its own code + answer list that is specific to the type of implication:<br>\n** Efficacy<br>\n** Metabolism<br>\n** Transporter<br>\n** High Risk</p>\n</li>\n<li>\n<p>Somatic Implication is another abstract (never directly used) profile.  It defines a single component for 'associated-cancer' since it applies to all of the Somatic profiles.</p>\n</li>\n<li>\n<p>Somatic has 3 concrete (directly used) profiles for the different types of Somatic implications - each has its own code + answer list that is specific to the type of implication:</p>\n</li>\n<li>\n<ul>\n<li>Somatic Diagnostic<br>\n** Somatic Prognostic<br>\n** Somatic Predictive</li>\n</ul>\n</li>\n</ul>",
        "id": 180683645,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573686674
    },
    {
        "content": "<p>After considering further, I do not agree with is the idea to use 53037-8 as the Observation.code in our somatic implication profiles.  I just don't see somatic related variants tagged with a 'clinical significance' of things like \"pathogenic\" or \"benign\" - so it does feel like we need a new code to describe the 'level of significance' of the somatic variants - and this is where the AMP tiering (or other values) could be delivered.  </p>\n<p>I don't have it all quite worked out in my head yet, but maybe this will trigger some good discussion since this went all day being silent after Patrick got it started <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 180685969,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573688838
    },
    {
        "content": "<p>Since most of this is going to revolve around our somatic profiles, you can see more detail about them all here: <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/somatics.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/somatics.html\">http://build.fhir.org/ig/HL7/genomics-reporting/somatics.html</a></p>",
        "id": 180686558,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573689469
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> ,</p>\n<p>I wonder if we can revisit if we really need eleven implication profiles. I'm kinda wondering, if in trying to create a specific profile for each type of implication, are we creating confusion knowing which profile to use (e.g. when would you use the Medication Transporter implication; how does somatic predictive differ from somatic prognostic) and are we going to need even more implication profiles as we want to capture additional types of implications (e.g. variant is a risk factor, presence of a variant suggests a mis-diagnosis). I'm not sure I see why a single generic implication profile, that has a component for the type of interaction, that allows for references to medications, etc, wouldn't work.</p>",
        "id": 180691137,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1573694329
    },
    {
        "content": "<p>I think we could make a single one work, but I do think we should consider that separate from this thread and keep it focused?  Unless we can’t come to a reasonable conclusion to this question</p>",
        "id": 180694176,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573698271
    },
    {
        "content": "<p>i think Bob's question is relevant in terms of it implies that both level of evidence and clinical significance may be better suited as components and not codes that determine individual profiles</p>",
        "id": 180737053,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573742941
    },
    {
        "content": "<p>Fair points.  Level of evidence already is a component, so +1 <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>\n<p>It seems to me like the clinical significance does align with the code/value pair of the Observation.  It works really nicely for the IDP side.  But doesn't seems as neat and tidy on the PGx or Somatic side.</p>",
        "id": 180737642,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573743276
    },
    {
        "content": "<p>I think we should consider high-risk-allele, as in our current example (<a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/HLAB1502-pgx-example.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/HLAB1502-pgx-example.html\">http://build.fhir.org/ig/HL7/genomics-reporting/HLAB1502-pgx-example.html</a>). Is the idea of communicating a high-risk allele that different from communicating an allele with high clinical significance?</p>",
        "id": 180738029,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573743520
    },
    {
        "content": "<p>I think our overlapping/disjointed profiles here stem from not having a good definition of what we mean by clinical significance itself, if we can break that down into use-case-specific meanings it may be helpful.</p>",
        "id": 180738132,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573743597
    },
    {
        "content": "<p>what about predicted adverse drug responses? I know <span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> was concerned with our current options/guidance to display those. That naively seems like a form of clinical significance that should be in scope to me</p>",
        "id": 180738277,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573743681
    },
    {
        "content": "<p>Most of the PGx profile name/thoughts came from this: <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5253119/\" target=\"_blank\" title=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5253119/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5253119/</a></p>",
        "id": 180738630,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573743870
    },
    {
        "content": "<p>So, that fact that 'HLA-B*15:02' was detected means you are positive for a high risk phenotype.  So, I think my point is that there is not really a single list of 'clinical significance' answers that we can use in the PGx and Somatic spaces.</p>",
        "id": 180738784,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573743977
    },
    {
        "content": "<p>Thanks for sharing that article, I had misplaced it haha. I'm not sure we have to respond by making individual profiles for each row in the mentioned table though, it was our first approach and after trying to build out some examples with it, a gap analysis and feedback from others seems definitely in order</p>",
        "id": 180742446,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573746213
    },
    {
        "content": "<p>I think the fact that little of the approach extends to the cancer space is a strike against it, but it may just be we haven't talked through it sufficiently yet. Has the IM group done anything on level of evidence or clinical significance in its various forms?</p>",
        "id": 180742663,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573746360
    },
    {
        "content": "<blockquote>\n<p>So, that fact that 'HLA-B*15:02' was detected means you are positive for a high risk phenotype.</p>\n</blockquote>\n<p>Is our use of \"Allele\" here inconsistent (e g. with components in Variant)?</p>",
        "id": 180743652,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573746930
    },
    {
        "content": "<p>The idea with the most discrete profiles is that enforcing the rules becomes easier.  If you have a generic profile that <em>could</em> be 1 of X things, you have to write things up in text to say how to use the generic thing.  However, have the discrete profiles implies you know all the use cases, which is often problematic.</p>\n<p>I would argue it does extend to the somatic space.  How you express the 'signficance' of something varies depending on what was found, and sometimes it can have different categories of things to say:  In this <a href=\"https://jmd.amjpathol.org/article/S1525-1578(16)30223-9/fulltext#sec4\" target=\"_blank\" title=\"https://jmd.amjpathol.org/article/S1525-1578(16)30223-9/fulltext#sec4\">article</a>, which  we at least partially used to help define our somatic approach, I like this section:</p>\n<blockquote>\n<p>Somatic variants include SNVs, indels, fusion genes resulting from genomic rearrangements, and CNVs. Unlike interpretation of germline sequence variations, which focuses on pathogenicity of a variant for a specific disease or disease causality, interpretation of somatic variants should be focused on their impact on clinical care. A variant can be considered a biomarker that affects clinical care if it predicts sensitivity, resistance, or toxicity to a specific therapy, alters the function of the gene, which can be targeted by approved or investigational drugs, serves as an inclusion criterion for clinical trials, influences disease prognosis, assists in establishing a diagnosis of a cancer, or warrants implementing surveillance measures for early cancer detection. Clinical impacts should, therefore, include therapeutic, prognostic, diagnostic, and preventive actions. The clinical impact of a given variant should be determined according to currently available evidence. Evidence used for variant categorization can be weighed differently based on its significance in clinical decision making.</p>\n</blockquote>",
        "id": 180744066,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573747163
    },
    {
        "content": "<p>And yea, we can consider removing Allele in case it is confusing.  We just tried to align with the paper (though not sure we do it well through out).</p>",
        "id": 180744286,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573747269
    },
    {
        "content": "<p>Great reference again. Wasn't the AMP list the one that LOINC wanted removed from the level of evidence concept though?</p>",
        "id": 180745085,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573747730
    },
    {
        "content": "<p>My thought on another thread was that we might not have to reduce the number of profiles but could consider making the abstract profile large and the implementable ones restrict from it</p>",
        "id": 180745258,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573747812
    },
    {
        "content": "<p>Rather than building complexity in diverse directions</p>",
        "id": 180745290,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573747834
    },
    {
        "content": "<p>This would also allow leaving the slicing open (think having the list of components extensible) in a way that hopefully prevents muddling use cases</p>",
        "id": 180745634,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573748002
    },
    {
        "content": "<p>Yea, the AMP guidelines (and MVLD before it, which we also leveraged <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5728662/\" target=\"_blank\" title=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5728662/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5728662/</a> ), really seem to blur/mix the concepts of significance and evidence - because often the amount/type of evidence helps determine the significance.</p>",
        "id": 180745772,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573748069
    },
    {
        "content": "<p>I think that led us to the proposal to have, for example, a \"diagnostic level of evidence,\" a \"prognostic level of evidence,\" and a \"therapeutic level of evidence\"</p>",
        "id": 180745968,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573748185
    },
    {
        "content": "<p>Since the field wants to have different criteria and interpretations for evidence going towards different use cases</p>",
        "id": 180746065,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573748251
    },
    {
        "content": "<p>I've played around a bit with the VICC meta-knowledgebase, and what's out there currently is tough to wrangle into our profiles (but possible)</p>",
        "id": 180746210,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573748336
    },
    {
        "content": "<p>One intermediate step that seems mostly reasonable would be to collapse the implementable somatic implications into Somatic Implication, add a 'type' to indicate diagnostic, prognostic, predictive, and maybe some additional guidance as to how to represent these types using the other components.  Could do the same on the PGx side.</p>",
        "id": 180746646,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573748581
    },
    {
        "content": "<p>do you have a online reference for VICC KB?</p>",
        "id": 180746766,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573748660
    },
    {
        "content": "<p><a href=\"https://search.cancervariants.org/\" target=\"_blank\" title=\"https://search.cancervariants.org/\">https://search.cancervariants.org/</a></p>",
        "id": 180747278,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573748921
    },
    {
        "content": "<p>Nice, thanks.</p>",
        "id": 180747436,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573749024
    },
    {
        "content": "<p>Does VICC have a 'meta data dictionary' sort of thing that defines their value sets and corresponding definitions for the coded values?</p>",
        "id": 180747695,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573749200
    },
    {
        "content": "<p>Looking at the somatic profiles, I'm not 100% sure on the difference between prognostic and predictive, so we may want to revisit definitions as well. As for the medication profiles, I wonder if we need the medication transporter profile.</p>",
        "id": 180751125,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1573751305
    },
    {
        "content": "<p>I'm not sure there's any difference from a workflow perspective between interpreting a transport implication compared to an overall efficacy implication</p>",
        "id": 180751585,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573751608
    },
    {
        "content": "<p>Has anyone seen if phenopackets overlaps this space and made any design decisions we may be interested in?</p>",
        "id": 180751798,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573751730
    },
    {
        "content": "<blockquote>\n<p>Looking at the somatic profiles, I'm not 100% sure on the difference between prognostic and predictive, so we may want to revisit definitions as well. As for the medication profiles, I wonder if we need the medication transporter profile.</p>\n</blockquote>\n<p>Yea, we probably need to try to clarify a little more.  It seems delineating between those two is a common problem considering I found a paper titled \"Prognostic or Predictive? It's Time to Get Back to Definitions!\" <a href=\"https://ascopubs.org/doi/10.1200/JCO.2011.38.3729\" target=\"_blank\" title=\"https://ascopubs.org/doi/10.1200/JCO.2011.38.3729\">https://ascopubs.org/doi/10.1200/JCO.2011.38.3729</a> <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 180752999,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573752504
    },
    {
        "content": "<p>sounds like we ought to propose a simpler model :)</p>",
        "id": 180753056,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573752549
    },
    {
        "content": "<p>Touche' <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 180753225,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573752658
    },
    {
        "content": "<p>Good thing this implication stuff was identified as a key theme for STU2  <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 180754917,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573753656
    },
    {
        "content": "<p>BTW <span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span>  - Regarding  your question about predictive/prognostic.  I have absolutely no idea how I missed this, but the following is currently in our IG on the Somatics page (and I just noticed some typos in there as well):</p>\n<blockquote>\n<p>NOTE: While it would seem like prognostic and predictive implications are expressing the same information, this is not always the case. A medication may improve outcomes without necessarily significantly implicationing a tumor. Similarly a medication may implication a tumor but not significantly improve outcomes. Both types of implications may be relevant and reporting organizations should share what is currently known. The work group acknowledges the profiles in this section are drafts and alternative models will be considered in the next round of balloting. </p>\n</blockquote>",
        "id": 180775389,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573765949
    },
    {
        "content": "<p>yep that note has been there all year and our \"impact-to-implication\" swap left a couple of these I had trouble tracking down <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 180775546,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573766053
    },
    {
        "content": "<p>Indeed <span aria-label=\"frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"frown\">:frown:</span> Call this a 'search and replace' failure</p>",
        "id": 180775626,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573766128
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 180775627,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573766131
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  I don't understand what the note is trying to say. Tumor type and/or specific mutations can be indications for specific medications.  The note almost reads as though the implication of using a medication is a change in prognosis, which I suppose is true, but seems kinda a weird way to say it.</p>",
        "id": 180777287,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1573767124
    },
    {
        "content": "<p>I should have also included these definitions from the IG (with <strong>bolded</strong> part by me to show that I think that  our said is right):</p>\n<blockquote>\n<p>The Somatic Prognostic Implication profile indicates that the associated genetic findings have implications for the overall outcome for the cancer patient (either positive or negative). <strong>Those outcomes might be asserted on their own or asserted presuming the patient is receiving the indicated combination of medications and other therapies.</strong> This can be used to recommend or discourage particular therapeutic approaches based on current evidence.</p>\n<p>The Somatic Predictive Implication profile indicates the implication the associated genetic findings on the susceptability/responsiveness of a particular medication or medication combination on the specified cancer type. </p>\n</blockquote>",
        "id": 180778138,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573767649
    },
    {
        "content": "<p>okay so our TBD guidance for tbd-prognostic \"The medication or medication class whose implication on the cancer is being predicted. (Same as somatic-predictive-medication),\" is a bit of an oversimplification</p>",
        "id": 180778359,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573767807
    },
    {
        "content": "<p>is it implied in the prognostic profile that the medication/therapy are already in place (as in, context for the observation)?</p>",
        "id": 180778469,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573767873
    },
    {
        "content": "<p>That guidance seems to be saying that the Finding is the subject of the observation-statement, and that the components are a context. Thus the profile shouldn't be saying a particular medication or therapy is going to increase/decrease prognosis</p>",
        "id": 180778672,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573767996
    },
    {
        "content": "<p>I doubt it <span aria-label=\"frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"frown\">:frown:</span></p>\n<p>At one point, I think we did propose a single 'somatic implication' profile, and it would have value/components like the items highlighted as \"Somatic Interpretive\" in this diagram:<br>\n<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5728662/figure/F1/\" target=\"_blank\" title=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5728662/figure/F1/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5728662/figure/F1/</a></p>",
        "id": 180778713,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573768024
    },
    {
        "content": "<p>rather that the presence of the finding given the associated therapy indicates a certain prognosis</p>",
        "id": 180778734,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573768045
    },
    {
        "content": "<p>We certainly needed this level of review during a ballot cycle <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 180778747,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573768056
    },
    {
        "content": "<p>I'd be interested in <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> 's opinion. I've not seen a report that says \"prognosis is X, but prognosis for those taking these medications is Y\". Reports seem to focus more on trying to suggest what some viable treatments might be, given the tumor type and/or specific variants / biomarkers.</p>",
        "id": 180778766,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1573768074
    },
    {
        "content": "<p>The 'medication' component on Prognostic is 0..*, so you could deliver the prognosis without any medications?  I suppose if you know what the meds are now, and you can tailor the prognosis, this gives you that ability.</p>\n<p>And I think if you were going to deliver <em>\"what some viable treatments might be, given the tumor type and/or specific variants / biomarkers\"</em>, I think you would use Predictive right?</p>\n<p>I did find this <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5637861/\" target=\"_blank\" title=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5637861/\">paper</a> which used the following definitions (if it helps/hurts, I don't know <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span>):</p>\n<blockquote>\n<p>Biomarkers can be classified into four types: diagnostic, prognostic, predictive, and therapeutic. </p>\n<p>A diagnostic biomarker allows the early detection of the cancer in a noninvasive way and thus the secondary prevention of the cancer. </p>\n<p>A predictive biomarker allows predicting the response of the patient to a targeted therapy and so defining subpopulations of patients that are likely going to benefit from a specific therapy. </p>\n<p>A prognostic biomarker is a clinical or biological characteristic that provides information on the likely course of the disease; it gives information about the outcome of the patient. </p>\n<p>A therapeutic biomarker is generally a protein that could be used as target for a therapy.</p>\n</blockquote>",
        "id": 180779906,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573768734
    },
    {
        "content": "<p>ok, thanks <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> . Now I see the difference between our somatic prognostic and somatic predictive profiles.</p>",
        "id": 180780097,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1573768898
    },
    {
        "content": "<p>i think medication is 0..* because you could instead populate the <code>therapy</code> component, or consider the finding as a biomarker in its own context</p>",
        "id": 180780618,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573769244
    },
    {
        "content": "<blockquote>\n<p>I'd be interested in <span class=\"user-mention silent\" data-user-id=\"191451\">Patrick Werner</span> 's opinion. I've not seen a report that says \"prognosis is X, but prognosis for those taking these medications is Y\". Reports seem to focus more on trying to suggest what some viable treatments might be, given the tumor type and/or specific variants / biomarkers.</p>\n</blockquote>\n<p>This is also true for our lab, we only get predictive Implications: Try medication X based on the found variants YZ.</p>",
        "id": 180818026,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1573812744
    },
    {
        "content": "<p>great articles <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> ! They really helped.</p>",
        "id": 180818224,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1573812941
    },
    {
        "content": "<p>I think we should reduce the number of Implication profiles. diagnostic, prognostic, predictive could be a code of a generic profile. Validation shouldn't be too hard as we can define invariants based on the implication type code to enforce cardinalities.</p>",
        "id": 180818424,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1573813125
    },
    {
        "content": "<p>So comming back to the actual topic:<br>\nI'm in favour of Motion B: Consider creating new codes for diagnostic, therapeutic, and prognostic significance</p>",
        "id": 180818779,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1573813530
    },
    {
        "content": "<p>Otherwise we only could distinguish the different significances by the used profile (which is bad practice as a profile shouldn't add semantical meaning), using different codes would be better for queries.</p>",
        "id": 180818968,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1573813683
    },
    {
        "content": "<p>These could be achieved through having a single Implication profile with it's code bound (extensible?) to a VS with the new codes for: diagnostic, therapeutic, and prognostic significance</p>",
        "id": 180819182,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1573813821
    },
    {
        "content": "<p>Level of evidence would be a component with a preferred? binding to PharmGKB level of evidence?</p>",
        "id": 180819400,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1573814033
    },
    {
        "content": "<p>OK - seems to be enough input saying that is the right approach.  I should have some time today, so maybe I can take a stab setup a branch for our IG and mock up what a single somatic implication profile would look like</p>",
        "id": 180840528,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573830549
    },
    {
        "content": "<p>If it seems to work, we can probably replicate it for PGx</p>",
        "id": 180841284,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573831007
    },
    {
        "content": "<p>OK - I have pushed up a proposal.  Once it builds, you can review it here:<br>\n<a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/branches/kpower_SomaticImplication/index.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/branches/kpower_SomaticImplication/index.html\">http://build.fhir.org/ig/HL7/genomics-reporting/branches/kpower_SomaticImplication/index.html</a></p>\n<p>I won't give too many details as to what I did or what I think there is likely still to do - One because it is late on Friday and I am ready to go home.  <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> Two I want everyone to review it without me giving too many directions and you can act more like a fresh set of eyes.</p>",
        "id": 180882747,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573860908
    },
    {
        "content": "<p>I need to think more about suggesting use of Observation.value with the list on <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/branches/kpower_SomaticImplication/valueset-somatic-classes.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/branches/kpower_SomaticImplication/valueset-somatic-classes.html\">http://build.fhir.org/ig/HL7/genomics-reporting/branches/kpower_SomaticImplication/valueset-somatic-classes.html</a>... Our codes are usually questions with values to answer them, so could phrase it as \"what class of somatic implication/biomarker was found?\" (may need to be careful with Variant's \"Absent\" value...)</p>",
        "id": 180892921,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573874310
    },
    {
        "content": "<p>You nailed one of my biggest questions. I did it that way for two reasons:</p>\n<ul>\n<li>The papers I referenced and the example reports Swapna included in her analysis seemed to show that the class was a key element and would be included on every implication. </li>\n<li>I considered having the values that were used as the values in the three profiles - but I wasn’t sure there will be much consistency in the possible value sets for the three classes?</li>\n</ul>",
        "id": 180912899,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573912192
    },
    {
        "content": "<p>Great work! Here are my two Euro cents <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span> <br>\nHaving the class as value seems strange and unusual. To me the class should be Observation code, as it qualifies the kind of Observation. <br>\nSo Observation.code could be bound to the classes ValueSet. Value should be the result like: found/not found etc.</p>",
        "id": 180917540,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1573920130
    },
    {
        "content": "<p>Ahh duh!  Sometimes the obvious answer just skips right by <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 180917572,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573920210
    },
    {
        "content": "<p>I just find myself always thinking our Observations need a fixed, single code since we do that in so many places.</p>",
        "id": 180917708,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573920421
    },
    {
        "content": "<p>Yeah in general our approach has been fixed code per profile but fixed code per use case aligning to a single profile seems good for this</p>",
        "id": 180924870,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573932210
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>   thanks for this. I like where you're going. There are scenarios where cancer treatment is also predicted based on germline mutations (e.g. PARP therapy in breast cancer with germline BRCA mutation), on biomarkers (e.g. immunotherapy if MSI-high), etc. Since the report may also have this information, perhaps we shouldn't restrict somatic implications to just somatic variants?</p>",
        "id": 180962737,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1574007138
    },
    {
        "content": "<p>and a couple of in the weeds thoughts: [1] perhaps associated-cancer should be 0..* (e.g. a variant is predictive that a treatment will work in one of these kinds of cancer); [2] somatic-predictive: at some point I think it would be good to revisit the value set. For instance, what is the difference between \"responsive\" and \"sensitive\"?</p>",
        "id": 180962739,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1574007139
    },
    {
        "content": "<blockquote>\n<p>There are scenarios where cancer treatment is also predicted based on germline mutations (e.g. PARP therapy in breast cancer with germline BRCA mutation), on biomarkers (e.g. immunotherapy if MSI-high), etc. Since the report may also have this information, perhaps we shouldn't restrict somatic implications to just somatic variants?</p>\n</blockquote>\n<p>I don't know that we do restrict that anywhere in the profile, but I assume you are probably talking about the wording on the Somatic page?</p>\n<blockquote>\n<p>perhaps associated-cancer should be 0..* (e.g. a variant is predictive that a treatment will work in one of these kinds of cancer)</p>\n</blockquote>\n<p>That is fair (I think).  Anyone else have a problem with that?</p>\n<blockquote>\n<p>somatic-predictive: at some point I think it would be good to revisit the value set. For instance, what is the difference between \"responsive\" and \"sensitive\"?</p>\n</blockquote>\n<p>I am afraid I don't know, we would need someone with more expertise to weigh in.  The list of answers came directly from the MVLD link, but it doesn't provide any further definition.</p>",
        "id": 181018533,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574086450
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>perhaps associated-cancer should be 0..* (e.g. a variant is predictive that a treatment will work in one of these kinds of cancer)</p>\n</blockquote>\n<p>That is fair (I think).  Anyone else have a problem with that?</p>\n</blockquote>\n<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 181019777,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1574087311
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>There are scenarios where cancer treatment is also predicted based on germline mutations (e.g. PARP therapy in breast cancer with germline BRCA mutation), on biomarkers (e.g. immunotherapy if MSI-high), etc. Since the report may also have this information, perhaps we shouldn't restrict somatic implications to just somatic variants?</p>\n</blockquote>\n</blockquote>\n<p>Yes, there is no restriction in the profile. But the name somatic-implication. Should we just rename it to implication?</p>",
        "id": 181019966,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1574087439
    },
    {
        "content": "<p>If we're naming it implication we should consider alignment with other PGx cases and inherited diseases ;)</p>",
        "id": 181020121,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574087557
    },
    {
        "content": "<blockquote>\n<p>Yes, there is no restriction in the profile. But the name somatic-implication. Should we just rename it to implication?</p>\n</blockquote>\n<p>Well, can only rename to implication if we do a broader combining of our other areas (Jamie beat me to it <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span>)</p>",
        "id": 181020138,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574087575
    },
    {
        "content": "<p>re: the predictive value set, any strong reasons we can't use the one for medication efficacy?</p>",
        "id": 181020196,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574087625
    },
    {
        "content": "<p>In this case, I think Somatic Implication still applies?  The implication itself is still a cancer right even if the variant is germline?</p>",
        "id": 181020274,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574087665
    },
    {
        "content": "<p><a href=\"https://r.details.loinc.org/AnswerList/LL539-8.html\" target=\"_blank\" title=\"https://r.details.loinc.org/AnswerList/LL539-8.html\">https://r.details.loinc.org/AnswerList/LL539-8.html</a></p>",
        "id": 181020290,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574087678
    },
    {
        "content": "<p>I know there are some objections to conflating 'cancer' and 'somatic' since you can have somatic mutations that are benign, etc</p>",
        "id": 181020345,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574087723
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196553\">@James Jones</span> - I think that makes sense, but still no definitions on the terms in the medication efficacy answer list.</p>",
        "id": 181020363,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574087736
    },
    {
        "content": "<p>yes, we would need to nail some better ones down, and also consider removing 'benign' and 'presumed benign'</p>",
        "id": 181020480,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574087823
    },
    {
        "content": "<p>I guess 'benign' means 'no effect on drug efficacy'?</p>",
        "id": 181020633,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574087935
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span>  had a proposal to get something simple and ordinal here that I liked, not sure why we didn't pick it up back then.</p>",
        "id": 181020681,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574087970
    },
    {
        "content": "<p>Continued work on AnswerLists / definitions need to be part of this theme for sure.</p>",
        "id": 181020873,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574088088
    },
    {
        "content": "<p>There's a couple places it looks like we might have been intending to restrict the profile to just somatic variants: [1] derivedFrom points to genotype/haplotype/variant but not to a biomarker; [2] Definitions of somatic classes (e.g. \"finding of whether a particular somatic genotype/haplotype/variation...\"</p>",
        "id": 181021636,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1574088623
    },
    {
        "content": "<p>[1] how do you define a 'biomarker'?<br>\n[2] I can tweak some wording when I push up a new change here shortly.</p>",
        "id": 181021810,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574088739
    },
    {
        "content": "<p>biomarker - I think we wound up treating these as just \"other observations\"</p>",
        "id": 181022189,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1574088970
    },
    {
        "content": "<p>biomarker: i agree that we need something like a biomarker profile.</p>",
        "id": 181024382,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1574090354
    },
    {
        "content": "<p>Just implementing one for a german project. similar to the mcode TumormarkerTest profile.</p>",
        "id": 181024483,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1574090413
    },
    {
        "content": "<p>And i would see this profile to be part of our IG and mcode deriving from it</p>",
        "id": 181024536,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1574090448
    },
    {
        "content": "<p>or at least mCODE ensuring alignment with it.  :-)</p>",
        "id": 181024580,
        "sender_full_name": "May Terry",
        "timestamp": 1574090491
    },
    {
        "content": "<p>:-)</p>",
        "id": 181024595,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1574090512
    },
    {
        "content": "<p>My wording was sub-optimal. Sorry. I meant that CG also needs a profile for Tumormarker Tests.</p>",
        "id": 181024915,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1574090718
    },
    {
        "content": "<p>And this should be aligned with mcode(mcode being the more specific IG)</p>",
        "id": 181024976,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1574090760
    },
    {
        "content": "<p>Start with the mCode approach.</p>",
        "id": 181297521,
        "sender_full_name": "Bret H",
        "timestamp": 1574337708
    },
    {
        "content": "<p>I am not sure if this thread is on point anymore. Start a different thread for Biomarker please.</p>",
        "id": 181297642,
        "sender_full_name": "Bret H",
        "timestamp": 1574337838
    },
    {
        "content": "<blockquote>\n<p>So comming back to the actual topic:<br>\nI'm in favour of Motion B: Consider creating new codes for diagnostic, therapeutic, and prognostic significance</p>\n</blockquote>\n<p>This seems to the point of the thread and a good place to end. As I recall, this was the determination at the work group meeting as well.  But the word evidence is important. Level of evidence is an important, expected, concept.</p>",
        "id": 181297959,
        "sender_full_name": "Bret H",
        "timestamp": 1574338108
    },
    {
        "content": "<p>as an approach <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/branches/kpower_SomaticImplication/somatic-implication.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/branches/kpower_SomaticImplication/somatic-implication.html\">http://build.fhir.org/ig/HL7/genomics-reporting/branches/kpower_SomaticImplication/somatic-implication.html</a> mixes all kinds of concepts. Treatment efficacy prediction is not the same as prognosis for cancer survival.</p>",
        "id": 181298128,
        "sender_full_name": "Bret H",
        "timestamp": 1574338289
    }
]