[
    {
        "content": "<p>I missed the FHIR subgroup call today, but in reviewing the notes I see this (from <span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span>  and answered by <span class=\"user-mention\" data-user-id=\"192773\">@Xin Liu</span> )</p>\n<p>Bret - when it says medication assess, was this a knowledge based response? Or was it implying that medication was given at time of testing?<br>\nXin - we only care about the medication the physician will prescribe the patient. The medication is the one the provider is planning on prescribing.</p>\n<p>I don't agree with Xin's answer, but maybe I am wrong, so wanted to get other takes.  My sense of the 'medication-assessed' component was to allow the lab to indicate their recommendations for any set of meds their test supports.  So, looking at this Mayo [example|https://drive.google.com/drive/folders/18T4RS0VnrJdLS3k79skbrZ0cYyL1U53t], I would expect they might want to share more than just medications the patient is on now.  The \"Medication usage Implication\" Task would be created for any meds they are on that require a change of some sort.  So, in Bret's words, this is more of a 'knowledge based response' that we ideally should find a better way to do some day in the future.</p>\n<p>Am I missing something?</p>",
        "id": 153943851,
        "sender_full_name": "Kevin Power",
        "timestamp": 1520872219
    },
    {
        "content": "<p>I agree that we might take care of all the possible medication recommendation related with the gene information in the future. My answer is pointed to the current situation we are focusing on. Just wonder if all of the possible medication impact will be included, Will those information is  in a single diagnostic report or not.</p>",
        "id": 153943856,
        "sender_full_name": "Xin Liu",
        "timestamp": 1520872575
    },
    {
        "content": "<p>Ah, your comment was about your specific example, not the intention overall.  Thanks for the clarification.  </p>\n<p>Do others have thoughts on including a broader set of medications that were 'assessed' by the lab? <span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span>  <span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span>  <span class=\"user-mention\" data-user-id=\"195129\">@Aziz Boxwala</span>  <span class=\"user-mention\" data-user-id=\"191719\">@Gil Alterovitz</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ?</p>",
        "id": 153943863,
        "sender_full_name": "Kevin Power",
        "timestamp": 1520873343
    },
    {
        "content": "<p>I expect on the ordering side it's possible a clinician might indicate a set of meds or a set of conditions which would be used to filter the meds reported about.  Alternatively, the lab might report about all impacted meds.  Whether the patient is on them now, there's a plan for them to be on the med near-term, or someone might think about prescribing the med 10 years from now, the assessment would presumably still be relevant.  In the case of the \"unfiltered\" approach, it would probably be best for the report to differentiate results that are pertinent to the question asked as opposed to additional \"FYI\" information.</p>",
        "id": 153943864,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1520874316
    },
    {
        "content": "<p>Do we need another component to indicate the FYI ones versus the specifically asked about ones?  Also, this makes me realize we have the 'med-usage' and 'med-usage-narrative' on the Medication Usage Implications (Task) - what if the lab wants to deliver that information for the FYI meds that won't turn into a Task?</p>",
        "id": 153943868,
        "sender_full_name": "Kevin Power",
        "timestamp": 1520874948
    },
    {
        "content": "<p>Please take my comments with a healthy dose of salt, given that I am a newbie in pharmacogenomics. <br>\nI think it would be useful to separately consider the response by the question asked versus the FYIs. Given how rapidly the knowledge changes in this domain, using an FYI knowledge 10 years hence might be fraught with risks. Answering today's question with today's best knowledge is important. For tomorrow's question, we should use an updated knowledge base. Having said that, putting the FYI meds might be useful for the near term at least.</p>",
        "id": 153943876,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1520877370
    },
    {
        "content": "<p>Ideally, we could share COMPUTABLE versions of things like this instead: <br>\n<a href=\"https://cpicpgx.org/guidelines/guideline-for-abacavir-and-hla-b/\" target=\"_blank\" title=\"https://cpicpgx.org/guidelines/guideline-for-abacavir-and-hla-b/\">https://cpicpgx.org/guidelines/guideline-for-abacavir-and-hla-b/</a><br>\n<a href=\"https://www.pharmgkb.org/combination/PA448004,PA35056/guideline/PA166104997\" target=\"_blank\" title=\"https://www.pharmgkb.org/combination/PA448004,PA35056/guideline/PA166104997\">https://www.pharmgkb.org/combination/PA448004,PA35056/guideline/PA166104997</a><br>\nShort of having fully functional ways to do that, we are moving towards a way to at least deliver the basics.</p>",
        "id": 153943936,
        "sender_full_name": "Kevin Power",
        "timestamp": 1520883902
    },
    {
        "content": "<p>Agree with Kevin, if the information is generic. <br>\nThe PharmGKB HL7 infobutton API can be used to provide such a link (the context being the gene variant information).</p>\n<p>The problem we are having is related to the problem of communicating knowledge, but to get back to this thread...I purpose that we need a flag in the current Genetic Medication Impact to indicate if the information is being delivered in response to a specific medication request OR if the information is unsolicited (meaning a medication not given in the request).</p>\n<p>Unsolicited is a bad term.</p>",
        "id": 153944394,
        "sender_full_name": "Bret H",
        "timestamp": 1520954836
    },
    {
        "content": "<p>I think the PharmGKB Infobutton sounds like a great Connectathon track. :)  Let's test it out and show it works?</p>\n<p>I think a 'flag' type of thing makes sense.  Others?</p>",
        "id": 153944426,
        "sender_full_name": "Kevin Power",
        "timestamp": 1520958981
    }
]