[
    {
        "content": "<p>I thought a lot about MolSeq. To me MolSeq was the FHIR version of VCF and/or BAM. Now i think it is more like a/some BAM file(s) (or other sequence formats). MolecularSequence could be similar to DocumentReference. Being either a reference to an existing Sequence(file) while adding some meta information to it or providing the actual content (sequenceStrings).<br>\nMolSeq.variant and MolSeq.structureVariant are duplicating our IG Obs. MolSeq quality is too bio-informatics for me to understand fully, is this reported and tested for every sequencing? Or is this some quality information which has to be tested i certain time patterns?</p>",
        "id": 193792567,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1586796695
    },
    {
        "content": "<p>Questions/potential Todos:</p>\n<ul>\n<li>String is limited to 1MByte in FHIR, is this enough for sequence data? We have to warn the implementer about the limitation or choose another data type</li>\n<li>Observations and DiagReport from our IG have to be extended/checked for a slice: Obs.derivedFrom pointing to MolSeq</li>\n<li>finding a solution to the duplicated variant issue in MolSeq.</li>\n</ul>",
        "id": 193793103,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1586797029
    },
    {
        "content": "<p>String shouldn't be a limitation if one uses <br>\npointer Σ   0..*    Reference(MolecularSequence)    Pointer to next atomic sequence</p>",
        "id": 193793313,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1586797176
    },
    {
        "content": "<p>Our guidance on how to break long sequences up is very thin but the functionality is there</p>",
        "id": 193793349,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1586797195
    },
    {
        "content": "<p>\"Complete genetic sequence information, of which specific genetic variations are a part, is reported by reference to the GA4GH repository.\" This shouldn't be only tied to GA4GH, right?</p>",
        "id": 193794170,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1586797636
    },
    {
        "content": "<p>used to be there as an example, any reference is fine</p>",
        "id": 193794272,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1586797697
    },
    {
        "content": "<p>\" MolSeq quality is too bio-informatics for me to understand fully, is this reported and tested for every sequencing? \" MolSeq is only used when useful (much like the other functions we have). You're thinking too deeply, I think : ^ ) and we've had lots of discussions on the purpose of MolSeq without standing on a final definition. But, in my opinion its a place to send contiguous chunks of sequence data, can be used as a reference sequence itself, useful for things like entire viral genomes. <span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span> <span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span> <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span>   might consider MolSeq as the Allele representation in our FHIR IG of the allele in the Information Model Bob is guiding. Where we're reporting the sequence that is in a specimen/sample/patient - not so much the variant. That MolSeq can also hold variant information is indeed a point of confusion potentially. But our group needs to provide a final determination. Something to consider.</p>",
        "id": 195580812,
        "sender_full_name": "Bret H",
        "timestamp": 1588087698
    },
    {
        "content": "<p>For MolecularSequence, I think I have a kinda basic question - is a MolecularSequence a sequence from a single molecule?</p>",
        "id": 195582680,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1588088448
    },
    {
        "content": "<p>I would say yes. that is the intent</p>",
        "id": 195582724,
        "sender_full_name": "Bret H",
        "timestamp": 1588088469
    },
    {
        "content": "<p>Reason I ask is that I think that will clarify whether we use it for, say, VCF, BAM, PrecisionFDA quality metrics, etc.</p>",
        "id": 195582806,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1588088512
    },
    {
        "content": "<p>in the past, Bob M did some good work showing how MolSeq hierarchically referred to profiles could be used to represent HLA alleles</p>",
        "id": 195582917,
        "sender_full_name": "Bret H",
        "timestamp": 1588088539
    },
    {
        "content": "<p>We may need to profile seq or extend it to make this more clear. I think initially it was hoped it be about to cover all of those cases though I haven't seen meaningful examples for each</p>",
        "id": 195583697,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1588088881
    },
    {
        "content": "<p>I've reviewed the IM model report and see opportunities to support in MolecularSequence the concepts of \"simple sequence\", \"resolvable sequence\", and \"relative sequence.\" \"Formatted sequence\" may need some help. I struggle to see how any of the current quality fields are useful for these sequence representations, as they are aimed at comparing VCF results. Is there meaningful quality information we can capture at the single molecule level? The structure of MolecularSequence could allow us much more freedom to convey poor quality/no-call regions than what we could do in Observation.</p>\n<p>Separately, we need to take a hard look at support for VCF (or gVCF/clinical+VCF and possibly other NGS data) and determine if it should be delegated to another resource.</p>",
        "id": 200465395,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1591817565
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"196553\">Jamie Jones</span> <a href=\"#narrow/stream/179197-genomics/topic/MolecularSequence/near/200465395\">said</a>:</p>\n<blockquote>\n<p>I've reviewed the IM model report and see opportunities to support in MolecularSequence the concepts of \"simple sequence\", \"resolvable sequence\", and \"relative sequence.\" \"Formatted sequence\" may need some help. I struggle to see how any of the current quality fields are useful for these sequence representations, as they are aimed at comparing VCF results. Is there meaningful quality information we can capture at the single molecule level? The structure of MolecularSequence could allow us much more freedom to convey poor quality/no-call regions than what we could do in Observation.</p>\n<p>Separately, we need to take a hard look at support for VCF (or gVCF/clinical+VCF and possibly other NGS data) and determine if it should be delegated to another resource.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> <span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> <br>\nI just found out that our Oncologists do want the actual VCF file sometimes (not sure who uses/interrogates it but he was quite clear). Therefore I agree that being able to add a VCF to the message should be have a clearly established method in the IG</p>",
        "id": 202042912,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1593133101
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 202457626,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1593533158
    },
    {
        "content": "<p>a VCF file could be treated like MEDIA and use the Reference data type.  However, if one is sending VCF , one can still use the variant profile for variants  too.</p>",
        "id": 205114168,
        "sender_full_name": "Bret H",
        "timestamp": 1595855272
    },
    {
        "content": "<p>not sure how the discussion on VCF relates to Molecular Sequence. I always thought of MolecularSequence as particularly useful for LONG -contiguous nucleotide information  - like you see in a RefSeek record.</p>",
        "id": 205114325,
        "sender_full_name": "Bret H",
        "timestamp": 1595855344
    }
]