[
    {
        "content": "<p>Is anyone else becoming bothered by the name of our IG: Genomics Reporting Implementation Guide?  I feel that the IG now encompasses much more than a focus on Genomics Reporting (I suppose it all depends on the definition of reporting)....  As I write some document for GenomeX, I find myself stumbling on the name of our IG - as it reads to the public as if our IG is focused soley on  Genomic Reports, rather than the discrete data which can be contained in these reports. Personally, I feel that we have moved far past the focus of simply moving report data.. instead, we are enabling the movement of machine-readable genomic data. This data may reflect a report, but it may also contain significant data which is not part of any current report.</p>",
        "id": 271194592,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1644356200
    },
    {
        "content": "<p>I don't know if changing the name of our IG is so onerous a task that we shouldn't even consider it, but wanted to put this out there in case changing it was possible if desired</p>",
        "id": 271194676,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1644356261
    },
    {
        "content": "<p>Nothing is impossible, and I am sure there is a process to change the name. I will say however that \"Reporting\" does NOT equal \"Reports\" so I am not sure it is necessary. However I would welcome any/all feedback - if others feel the same, we can consider it.</p>",
        "id": 271195352,
        "sender_full_name": "Kevin Power",
        "timestamp": 1644356617
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  I understand that reporting does not equal reports, but I am afraid that the general public will likely read it that way.  I am to am interested in what others think. Also interested in the history of why this name was selected. I keep seeing that IG on the transmission/exchanging of Genomic Data - but there must be history I am not aware of.</p>",
        "id": 271200460,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1644359107
    },
    {
        "content": "<p>You are implying a lot of thought went into it and to be honest I am not sure much did. </p>\n<p><span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span><span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>\n<p>Happy to defer to others</p>",
        "id": 271206748,
        "sender_full_name": "Kevin Power",
        "timestamp": 1644362429
    },
    {
        "content": "<p>Best I can remember - our primary focus has been on labs reporting out genomic results, so that was likely a factor.</p>",
        "id": 271207204,
        "sender_full_name": "Kevin Power",
        "timestamp": 1644362695
    },
    {
        "content": "<p>Our first one was guidance, this one was an implementation guide. It's not quite an Implementation Guide to Genomic data transmission, but with the operations it is starting to become a Genomics data exchange and implementation guide.</p>\n<p>dGIG - discrete Genomics Implementation Guide?</p>\n<p>IF we're going to the trouble of renaming, let's give it a groovy acronym.</p>",
        "id": 271223761,
        "sender_full_name": "Bret H",
        "timestamp": 1644374792
    },
    {
        "content": "<p>I agree with Arthur that the IG's handling of discrete/structured data is not well reflected by the current title. As I recall, the current title was the one put forward that was acceptable to the most people. There was not a clear marketing strategy.</p>",
        "id": 271295681,
        "sender_full_name": "Bret H",
        "timestamp": 1644420905
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192123\">Bret H</span> <a href=\"#narrow/stream/179197-genomics/topic/Name.20of.20our.20IG/near/271295681\">said</a>:</p>\n<blockquote>\n<p>... There was not a clear marketing strategy.</p>\n</blockquote>\n<p>Exactly right ... <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 271295912,
        "sender_full_name": "Kevin Power",
        "timestamp": 1644420985
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191913\">Kevin Power</span> <a href=\"#narrow/stream/179197-genomics/topic/Name.20of.20our.20IG/near/271207204\">said</a>:</p>\n<blockquote>\n<p>Best I can remember - our primary focus has been on labs reporting out genomic results, so that was likely a factor.</p>\n</blockquote>\n<p>+1<br>\nI'm not at all bothered with the name of our IG. I'm all for for creating other IGs that focus on other aspects of clinical genomics, but what Kevin described is what I use to understand if we're entering into scope creep. But for now, as I see it, if it isn't found in a lab report, it shouldn't be found in the Genomics Reporting IG.</p>",
        "id": 271461905,
        "sender_full_name": " Bob Milius",
        "timestamp": 1644512845
    }
]