[
    {
        "content": "<p>The ObsVariant profile has 0..1 components for transcripts and amino acids as follows:</p>\n<p>transcript related components <br>\ncomponent:transcript-ref-seq<br>\ncomponent:dna-chg (only cDNA-c., not n. or r. RNA hgvs based on LOINC code)<br>\ncomponent:dna-chg-type</p>\n<p>amino acid related components<br>\ncomponent:amino-acid-chg<br>\ncomponent:amino-acid-chg-type</p>\n<p>While this information is useful to share, it has the following limitations...<br>\nThey are constrained to 0..1, so if a sender wanted to share multiple transcript forms of the variant they could not. Are we presuming this would never be a reasonable use?<br>\nIf multiple transcripts from a single gene or from multiple genes (in the case the genomic change impacts multiple genes on the same or reverse strands, then we would need to be able to capture the corresponding dna-change and it's dna-change-type derivative data with the corresponding transcript.<br>\n(From the <a href=\"#narrow/stream/179197-genomics/topic/transcript.20and.20amino.20acid.20variants\" title=\"#narrow/stream/179197-genomics/topic/transcript.20and.20amino.20acid.20variants\">transcript and amino acid variants topic</a> we also have no way of sharing the transcript ref-seq relative start-end, ref and alt values if desired, in case an underlying genomic representation is not readily available.)</p>\n<p>All the same issues exist for amino acids as they are directly related to the various forms of transcripts from which they are translated.<br>\nThe additional missing item for amino acid attributes is that there's no component for the amino-acid-ref-seq.</p>",
        "id": 175905810,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568727025
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span>  you would want the correct amino acid type to be associated with the correct transcript referenced, right? So you are saying that within the Type it would be important to add a transcript sequence. <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> <span class=\"user-mention\" data-user-id=\"196553\">@James Jones</span>  For others: consider alternative splicing. The variant's effect on amino-acid level changes would be different depending on the codon usage of each alternative splice form. So, if we change cardinality to 0...* and add a reference sub-component, we would provide an opporunity to comment on mutliple splice forms in the same profile instance. The other point is that aa change type should be a subcomponent of amino acid change. One would be hard pressed to find a good reason in a use case to provide the aa change type without the aa change.</p>",
        "id": 175906617,
        "sender_full_name": "Bret H",
        "timestamp": 1568727500
    },
    {
        "content": "<p>oops. Given the last sentence here's the structure: AA change as top-level component, with aa chang type andand aa chg reference transcript inside the aa change component at the same level. Unfortunately, this moves the change type more deeply in the structure (more nested).</p>",
        "id": 175906886,
        "sender_full_name": "Bret H",
        "timestamp": 1568727656
    },
    {
        "content": "<p>Components can't easily be structurally linked beyond being defined on the same profile to my knowledge. For concepts that need multiple components, we need to either provide textual guidance saying to use them together or to define invariants to throw a warning if you fill out one component without filling out another required component.</p>",
        "id": 175907134,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1568727835
    },
    {
        "content": "<p>extensions can do it</p>",
        "id": 175907246,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1568727889
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> to be clear, I'm hopeful that this helps continue to highlight the shortcomings of the component (bag) approach being used. If we could separate out the \"definition\" of the variant from the annotations and derivative data, then we may be able to identify a path forward that simplifies the approach overall.</p>",
        "id": 175907347,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568727958
    },
    {
        "content": "<p>yep. One could use our IG as it is but need to use multiple instances for several transcript references, so perhaps that is best. <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> if we don't add subcomponents then you can use seperate instances of obs-variant to describe each amino acid reference</p>",
        "id": 175907417,
        "sender_full_name": "Bret H",
        "timestamp": 1568727976
    },
    {
        "content": "<p>the textual guidance is so overwhelming complex that we loose the aim of developing a reasonable implementable standard.</p>",
        "id": 175907489,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568728020
    },
    {
        "content": "<p>obsVariant is a very heavy object, to simply say we will create multiple instances to link up to other instances creates new barriers for adoption.</p>",
        "id": 175907646,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568728096
    },
    {
        "content": "<p>Again.were talking about inferred amino acid changes based on DNA or rarely RNA sequence. If we created an amino acid, RNA specific profiles one would need to make sure that guidance indicated that it is implied that inferences on other molecule types go into the approriate parent moleculr type.</p>",
        "id": 175907666,
        "sender_full_name": "Bret H",
        "timestamp": 1568728108
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> how is it heavier than an additional profile for this use case? Can you help me understand what you mean by heavy?</p>",
        "id": 175907719,
        "sender_full_name": "Bret H",
        "timestamp": 1568728145
    },
    {
        "content": "<p>i'm not suggesting new profiles (yet). I'm suggesting some baseline data type like \"allele\" {sequence+location, state at that location(alt)} eventually building out some other computationally fundamental variation structures (genotype, haplotype, variation sets, cnvs, translocations, etc).  These types could be used in profiles and resources to provide the specific set of annotations that a given lab might want to send, but would mostly be optional.<br>\nI don't think creating new profiles is the answer to the heaviness issue.  </p>\n<p>To be clear, I am trying to demonstrate how to build the obsVariant, obsMedImplications for 6 PGx diplotypes being reported on the eMERGE standard results.  I took a pretty simply single PGx diplotype TPMT which is asserted to be a certain star allele based diploytpe based on the combination of 4 genotype SNPs.  In order to build the 4 genotype SNPs as obsVariants, I need to represent each allele for each SNP genotype.  So that's a max of 8 allele representations that can be used to define the genotypes.  For example TPMT:g.18130918T&gt;C(c.719A&gt;G / p.Tyr240Cys) is derivedFrom (or hasMembers of) g.18130918 with a T and g.18130918 with a C if heterozygous, or simply two g.18130918 with a state of C if homozygous.  So now I need to create obsVariant (or molecularSequence) instances of these low level alleles so that we can accurately show what is the basis of one of the four SNP genotypes that were observed and thus used to assert which star allele diplotype that the lab chose to report for that patient.  Then we can associate that to the Med Implication of \"normal metabolizer\" (or whatever it is). <br>\nThat is for one of the six PGx diploytpes (and that's a fairly simple one).</p>\n<p>so it is daunting to try to use these structures (from both a volume standpoint and from an understanding of how they are meant to be used by the designers).  There's lots of moving parts, lots of options, no useful examples and a large hurdle to climb to simply convey these critical bits of data in a manner that will ultimately be used by downstream systems to understand precisely what the lab observed in a repeatable and reliable way.</p>",
        "id": 175908907,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568728954
    },
    {
        "content": "<p>good feedback. have you had a chance to look at <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/compound-heterozygote.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/compound-heterozygote.html\">http://build.fhir.org/ig/HL7/genomics-reporting/compound-heterozygote.html</a></p>",
        "id": 175909222,
        "sender_full_name": "Bret H",
        "timestamp": 1568729140
    },
    {
        "content": "<p>copying from other thread as it is relevant to discussion here<br>\n\"<br>\nFROM: Larry Babb 8:07 AM<br>\nIn the VICC they often get folks reporting amino acid forms of variation, on which they attach evidence, annotations and knowledge for sharing with labs that may or may not use it to report on results and findings for somatic testing.</p>\n<p>My understanding is that while they may not actually sequence amino acids, the data and knowledge in these variant level databases may only be reported based on the amino acid sequence. If so, then wouldn't HL7 need to provide a means for representing these forms of variation?</p>\n<p>Some reporting labs may choose to only report back the amino acid variation form. Without the basis of the amino acid sequence and its start/stop positions, one would have to rely solely on the p. HGVS expression (I presume). How would downstream systems and clinical research efforts ever reliably find and understand what that data is without a structured computational form that is consistent and alignable to some reference?<br>\n\"</p>",
        "id": 175909596,
        "sender_full_name": "Bret H",
        "timestamp": 1568729360
    },
    {
        "content": "<p>yes i have. It's a non-starter for me to use HGVS as a basis for variation (at least not as a computational form). I'm fine with sharing the hgvs to help humans understand the data, but it is completely derivative data IMO).</p>",
        "id": 175909613,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568729371
    },
    {
        "content": "<p>I'm sorry if I'm coming across as super difficult. I'm currently a bit frustrated and feel as if I've hit a wall in my eMERGE project.</p>",
        "id": 175909829,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568729501
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> -- You have talked about several things in these threads, and it seems we need a way to capture additional details about the amino acid sequence (multiple transcript references, starts/stops).  Doing those in components while understanding how they are all related would be at best challenging, but more likely impossible / unusable. It seems like MolecularSequence can support some of those details (\"allele\" {sequence+location, state at that location(alt)}), and from other conversations, you are tried to use it.  If you can share, that might help us see the specifics of what you are trying to do - and help me make recommendations and/or identify some changes we should make to better support these use cases.</p>\n<p>Not a good answer I'm afraid, but until we can get our common information model published, then figure out how our IG should align to that model, we will likely only make incremental improvements to the IG.  I would hate to see us completely overhaul the IG until we get that model, because we will likely have to make some significant changes once it is available.  To be completely clear, that is my opinion only, not a work group decision.</p>",
        "id": 175916399,
        "sender_full_name": "Kevin Power",
        "timestamp": 1568733434
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  to clarify one can capture \" amino acid sequence (multiple transcript references, starts/stops)\" with our current obs variant, but it would require one instance per transcript reference.</p>",
        "id": 175916572,
        "sender_full_name": "Bret H",
        "timestamp": 1568733532
    },
    {
        "content": "<p>Good clarification <span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span></p>",
        "id": 175916631,
        "sender_full_name": "Kevin Power",
        "timestamp": 1568733573
    },
    {
        "content": "<p>When we starting this version of the IG, we contemplated a separate profile to AA changes, but we didn't see the need.  We were thinking of it as  additional annotations of derived information from a DNA change.  But perhaps this discussion makes a case to revisit that.</p>",
        "id": 175920127,
        "sender_full_name": "Kevin Power",
        "timestamp": 1568735464
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> thanks for the feedback and clarification of where things stands (even though it may not be the official WG statement). I completely understand the position and agree that the common information model approach. I'm assuming that is the model that <span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span> is working on the Thu weekly calls. I recognize that there is going to be quite a bit of lag between now and when that starts to inform a focused effort on developing FHIR types, resources and profiles for the version I'm seeking. So, I will try to pick a lane for now and stay in it, so that I can share and do my best to help the near term efforts of the WG.</p>\n<p>My conundrum is mostly around whether I should dedicate the use of some subset of the MolecularSequence resource to being an \"allele\" definitional structure (keeping it detached from a specific specimen or patient concept). Or, should I \"ignore\" MolecularSequence and try to use a version of the obsVariant profile to represent the atomic structure I need to build out better representations of the genomic data.</p>\n<p>I'm currently playing with the MolecularSequence and finding that if I restrict myself to use the following attributes, I can make somewhat minimal forms of the \"allele\" concept I need. Then I think the only way I can stitch those together to indicate the phasing (in trans) is with the obsSeqPhaseReltn profile. So, I'm exploring that as well. Once I've constructed a computationally complete representation of the genotype SNP (e.g NC_000006.11:g.18130918T= in trans with  NC_000006.11:g.18130918T=) to get a homozygous NC_000006.11:g.18130918T= genotype, then I use that as the derivedFrom target on an obsVariant that ultimately says that it was present and in what patient/specimen and all the other additional/optional types of annotations that are available (dna-change, dna-change-type, allele-freq, etc...). This is a 3 tier nesting, but the variant definitional data lives at the bottom two layers. I think I can stitch together a number of different types of genomic variant structures, including CNVs.  </p>\n<p>The ObsSeqPhaseReltn end up being part of the variant definition and thus I don't treat it as a patient-specific observation. Its not until it gets linked up with the ObsVariant that I start to consider it a patient-specific finding.  I think it is interesting that obsVariant is really about the absence or presence of a variant. It really isnt' about \"what is the variant\".  There in lies the confusion with using obsVariant (or Observation profiles in general). The component approach to observations is \"handy\" for providing a bunch of parts that make a whole, but if the observation is about the presence or absence of something, then it is a bit of a conceptual stretch to consider the components part of the thing that is present or absent.  IMO, components should clarify the parts that make up the actual value (presence or absence of something in this case) that is specified by the observation, not the indirect relationship to the thing that the value references.</p>\n<p>Even if you argue that the component can be the parts of a thing that the value references and not the parts of the value itself, then I would say that the component approach should not be used for things that are critical concepts that should be standardized for use in a broad array of use cases (like Variation). At best I would think that folks using a profile should be able to look at the entire set of components for an observation and reasonably identify the \"one\" thing that all the component parts contribute to defining. In our case, that could be a transcript, amino acid or genomic allele or genotype call for a given allele-frequency and genomic source.  While it suits lots of needs, it really doesn't suit one.</p>",
        "id": 175932042,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568743165
    },
    {
        "content": "<p>Based on what you are trying to represent, I would say MolecularSequence is probably a better fit for the definitional structures than is ObsVariant.</p>\n<p>Regarding the usage of components, here is the section in Observation which describes 'grouping' options:<br>\n<a href=\"http://build.fhir.org/observation.html#obsgrouping\" target=\"_blank\" title=\"http://build.fhir.org/observation.html#obsgrouping\">http://build.fhir.org/observation.html#obsgrouping</a></p>\n<p>I think this part makes the best case for our usage of Components:</p>\n<div class=\"codehilite\"><pre><span></span>Observations that are commonly produced and interpreted together.\n</pre></div>\n\n\n<p>So in the case of ObsVariant, we are saying 'we found a variant' in .value(), and then providing the annotations that were 'produced and interpreted together' as components values.  We wondered about that one thing that we are defining for a while, but couldn't really come up with the one that fit all use cases.  I think the closest thing we came up with was the HGVS string, but that of course brought up concerns.</p>",
        "id": 175937428,
        "sender_full_name": "Kevin Power",
        "timestamp": 1568746483
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  I am confused. Obsvariant has components for transcript id, amino acid change and amino acid change type. Not sure why you are mentioning HGVS here? can you explain please</p>",
        "id": 175944874,
        "sender_full_name": "Bret H",
        "timestamp": 1568751726
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span>  I was trying to talk to <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> 's question about identifying the \"one\" thing that all components contribute to defining - so if we said the ObsVariant.value() should be \"what is the ONE thing that was observed\", and have the ObsVariant.component[]'s contribute to defining it, I was saying the HGVS string is as close to ONE thing that might described what was observed.</p>\n<p>Perhaps I missed the point (or at least part of it), but that was my thinking behind the answer.</p>",
        "id": 175945983,
        "sender_full_name": "Kevin Power",
        "timestamp": 1568752394
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> thank you for pointing out that section of the spec and the background on how \"Present/Absent\" was the defining value of the \"we did/didn't find a variant\" observation came to be the obsVariant profile. I know how frustrating it can be to bring others along that were not participating in all the many hours of discussion that led to these spec design decisions.</p>\n<p>Wouldn't it be nice if we could get to the point where we had a resource that let us represent the variant (independent of testing methods - no read depth, allele freq, etc...) and we could use that to represent whether the variant in question existed (or didn't exist) in the patient's germline genome or some tumor or bodysite as part of some somatic genome.  Sort of like how Conditions are captured for a patient in an EHR - and maybe even AllergyIntolerance's.  I think the EHRs should be thinking about how to store the clinically significant variant findings for either germline (dx or pgx) and or somatic (based on tumor or tissue bodysite). They should not necessarily be concerned (at this time) with capturing everything that may spew out of a whole genome or whole exome sequencing test - just those genomic variant structures that were earmarked by a genetics lab as \"important\" and \"informative\" to the patient's care.  If we had such a Resource then we could focus on providing value in returning these results.</p>\n<p>Right now the components in ObsVariant are several things. Fundamentally (I think) they are suppose to be a set of fields that define the variant (genomic-ref-seq, genomic-start-stop/inner/outer, genomic-alt, genomic-source, allelic state, copy-number) that is being observed as present or absent.  That is the crux of the issue we should be focused on - this is what the GA4GH VR group is seeking and we are getting close to having something that is broad enough to support most use cases. This fundamental model would require the patient and specimen values to always exist as it would be important for the specimen to identify the tumor tissue or anatomical location in which the variant was found (or not found).</p>\n<p>The other component values begin to create a kind of chaos when using obsVariant.  Read-depth, IMO, is another kind of observation. It is not inherently relevant in all cases to the identity of the variant that is being observed as found or not found. I think it is important and could be a secondary observation that references this primary observation.  Same goes for allele frequency, it provides \"additional\" value that warrants its own observation IMO - again it could hang off of this primary observation.  Transcript and amino acid derivative representations of the observed variant are also separate observations (really annotations) that are not part of the \"identity\" of the observed variant that has been found/not found. dbSNPId is nice but again, it is an ancillary annotation, super helpful in may context, great to capture, but not a required part of the identity of the variant - at best it is helpful.  There are all kinds of annotations like this that folks may or may not want to capture, share and store in EHRs.  It is a slippery slope that we have been sliding on for some time.  Maybe we can consider resetting the table a little and define the fundamental \"I found or didn't find THIS variant\" observation and then demonstrate and provide guidance for how other derivative and annotated related values could additionally be shared using \"derivedFrom\" or possibly \"hasMember\" relationships.</p>\n<p>Just an idea.  I'm trying to find something solid to focus on in order to use and share the intent of the CG IG. Clarity on this would be very helpful and could open the door to seeing how a first class \"specialized\" resource might evolve which won't be too far afield from where we start.</p>",
        "id": 176004951,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568813512
    },
    {
        "content": "<p>I do think if we can reduce the component list to only those attributes needed to represent the variant that is present or absent, then we can focus on the various component fields and how they work together to construct the different types of genomic structures needed by geneticists to link clinical significance in terms of diagnostic, prognostic, therapeutic and whatever type of useful condition information they discover.</p>",
        "id": 176005537,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568813910
    },
    {
        "content": "<p>Just an update to my last post in this thread (for anyone that is watching). Now that we have explored the use of MolecularSequence to provide definitional representation of the components needed to represent alleles, we're considering bailing on this approach and retracting the scope of what we can do with the CG IG and available structures in FHIR around variation.</p>\n<p>We are considering foregoing the aim of providing variant-level knowledge, which we currently support in our custom XML structures that have been in use in the eMERGE systems and informing the downstream folks that have been asking for a FHIR version of this structure that some of the capabilities will NOT be able to be accomplished in a reasonable way.</p>\n<p>Our determination is that we could build a number of custom profiles and extensions and get it to work, but the lift is too great at this point and it would likely deviate significantly from the current course that the CG IG is on.</p>",
        "id": 176007586,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568815307
    },
    {
        "content": "<blockquote>\n<p>Maybe we can consider resetting the table a little and define the fundamental \"I found or didn't find THIS variant\" observation and then demonstrate and provide guidance for how other derivative and annotated related values could additionally be shared using \"derivedFrom\" or possibly \"hasMember\" relationships.</p>\n</blockquote>\n<p>We did consider this for a while, but we then bump up against the guidance that an observation needs to provide value by itself.  It is a good exercise to ask \"if this is an observation, and someone queried the system and it was the only observation that was returned, would it provide any value?\"  Expressing something like the read-depth in its own observation would not be helpful without context. There are likely other profiles we could create (maybe the AA info) that could meet all the criteria we are talking about, but to date our thought as been let's get this \"grab bag\" into real world scenarios and see how well it works - then adjust as we go.</p>",
        "id": 176009143,
        "sender_full_name": "Kevin Power",
        "timestamp": 1568816375
    },
    {
        "content": "<blockquote>\n<p>We are considering foregoing the aim of providing variant-level knowledge, which we currently support in our custom XML structures that have been in use in the eMERGE systems and informing the downstream folks that have been asking for a FHIR version of this structure that some of the capabilities will NOT be able to be accomplished in a reasonable way.</p>\n</blockquote>\n<p>Would you be willing to share an example of your custom XML structure for our community to review?  Perhaps we get lucky and someone can make some better recommendations for you given our current state.</p>\n<p>I am sure you have thought of it, but you can always deliver your current XML as part of the bundle, likely as a DocumentReference.</p>",
        "id": 176010002,
        "sender_full_name": "Kevin Power",
        "timestamp": 1568816825
    },
    {
        "content": "<p>I've definitely shared the emerge XML in the past with the group. Its now been around for nearly 2 years. Here's the repo where the emerge providers have set up a schema for the xml and I've stored some example report and corresponding xml for your review.<br>\n<a href=\"https://github.com/emerge-ehri/results-schema\" target=\"_blank\" title=\"https://github.com/emerge-ehri/results-schema\">https://github.com/emerge-ehri/results-schema</a></p>",
        "id": 176037013,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568834744
    },
    {
        "content": "<p>Many thanks <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> (sorry for the duplicate ask <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span>)</p>",
        "id": 176050935,
        "sender_full_name": "Kevin Power",
        "timestamp": 1568844345
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> - Quick question.  If I were processing that XML, and wanted to look up the ReferenceVariant for a ReportVariant, do you 'join' by the &lt;externalId&gt; ?</p>",
        "id": 176053574,
        "sender_full_name": "Kevin Power",
        "timestamp": 1568847015
    },
    {
        "content": "<blockquote>\n<p>I've definitely shared the emerge XML in the past with the group. Its now been around for nearly 2 years. Here's the repo where the emerge providers have set up a schema for the xml and I've stored some example report and corresponding xml for your review.<br>\n<a href=\"https://github.com/emerge-ehri/results-schema\" target=\"_blank\" title=\"https://github.com/emerge-ehri/results-schema\">https://github.com/emerge-ehri/results-schema</a></p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span>  Which file represents an example of how you put the information in HL7 FHIR?</p>",
        "id": 176090998,
        "sender_full_name": "Bret H",
        "timestamp": 1568893798
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> ... yes, the externalId is the emerge network's internval variation id that allows all the systems to be able to link to the same variant regardless of representation, build, etc... This is the concept that GA4GH is promoting for the computed identifier on variations. This is the concept that ClinVar has for VariationId. This is the concept that gnomAD will soon be providing. This is the concept that ClinGen's allele registry uses (referred to as the CA-ID). </p>\n<p>This is the concept that HL7 CG needs to embrace, support, promote and seriously recommend to sharing variants.  Let's be done with dbsnp ids and hgvs. Let's get on board with a variant identifier plan that will actually remove all the craziness with sharing variant data. No scalable solutions will ever happen until then!</p>\n<p>Thanks for setting me up with that softball question! ;)</p>",
        "id": 176096440,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568898132
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> We don't have a way of mapping the emerge XML to FHIR, it can't be done, at least not the critical part related to sharing variant representations. Much of it can. <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span>  and I have been working on this for some time. We have mapped most of the information. In some areas FHIR's CG IG actually is an improvement in structure (e.g. planDefinition). </p>\n<p>Even though our original request was to map this XML (because folks are currently using it in downstream processes) to a FHIR standard, we realized early on, it was more pragmatic to simply try to figure out how to use the FHIR CG IG Genomics Report by walking through it resource-by-resource and attribute-by-attribute to see if we could figure out what everything is meant to do and what all the options are for sharing the data. This has been a long journey and we ultimately have made some choices along the way (which you guys are all aware of).  We are at the end (we hope) and have concluded that we cannot support \"ReferenceVariant\" and the associated annotations and knowledge which is loosely coupled to the \"ReportedVariant\" structures.  This separation of variant-level knowledge from case-level knowledge is the key to be able to support the CDS alerting in emerge and other systems when a previously reported variant is reassessed to end up with a different level of pathogenicity. (There are potentially many other CDS use cases, but this is a baseline one that seems to resonate well with geneticists and physicians alike.)</p>",
        "id": 176097068,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568898568
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span>  the place you are looking for  Variant ID is here: <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/obs-variant-definitions.html#Observation.component:variation-code\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/obs-variant-definitions.html#Observation.component:variation-code\">http://build.fhir.org/ig/HL7/genomics-reporting/obs-variant-definitions.html#Observation.component:variation-code</a> this is place to put the system (clinvar, emerge, etc and the identifier)</p>",
        "id": 176097890,
        "sender_full_name": "Bret H",
        "timestamp": 1568899105
    },
    {
        "content": "<p>yes, i've seen that. I wish it was a required field that folks would depend on as the primary means of identifying the variants. However, right now there is no one standard identifier approach. The GA4GH VR spec is aiming to correct this and provide a globally unique computable identifier based on the use of a standard schema for variation found <a href=\"https://vr-spec.readthedocs.io/en/1.0rc/index.html\" target=\"_blank\" title=\"https://vr-spec.readthedocs.io/en/1.0rc/index.html\">here</a>.  </p>\n<p>In the case of our specific emerge XML mapping, putting the externalId in that component of the observation does not help in bridging to the variant-level knowledge, because there's no way to make the variant itself the subject of an observation (or an assertion) which can hold the knowledge independent of the case.  So, while I can provide the variant's externalId, it does not help that much with linking data.  At best it will allow me to search through all case level reported findings to identify if any one else had the same variant. While this is a really great feature, it would require the standardization of identifiers. And, it only allows us to begin linking case level variation, not the knowledge itself.</p>\n<p>Side point, but related. It seems like the dbSNPid should be included in this attribute and not made a separate component. I'm not quite sure why decisions to call out only certain attributes like dbSNPids was made.  There are lots of ids that are as important and probably will be much more important going forward - related to variation.  And finally there's the point that there has been a number of folks that recognize the hazards with providing dbsnp ids with reported variants, since they don't provide the precision needed to truly identify the variant (they are locus specific, not change specific).  In HL7v2 we (I) requested many years ago to remove this identifier as a first class attribute because it was not clear whether it was representing the identity of the variant or not, and it continued to enable improper use by the masses. It was always the plan to remove it from that spec, and now here it is showing up in the new FHIR standard. </p>\n<p>Why can't we make the obsVariant profile just about the variant that was observed as being present or absent and not about capturing all these \"special\" annotations and derivative forms?  Once you start capturing these \"special\" attributes, you end up with a snapshot of what folks think are important today, and that will ultimately need to be garbage collected as the spec and community standards evolve over time.  (sorry for constantly venting).</p>",
        "id": 176099883,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568900319
    },
    {
        "content": "<p>Imagine if we had a Variant resource and that it could be the subject of an Observation? game changer!</p>",
        "id": 176099970,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568900393
    },
    {
        "content": "<p>A few thoughts:</p>\n<blockquote>\n<p>This is the concept that HL7 CG needs to embrace, support, promote and seriously recommend to sharing variants. Let's be done with dbsnp ids and hgvs. Let's get on board with a variant identifier plan that will actually remove all the craziness with sharing variant data. No scalable solutions will ever happen until then!</p>\n</blockquote>\n<p>As Bret mentioned, we do support those sorts of variant \"ids\" from any of the sources you mentioned - or if we can't, we should.  Are you suggesting we should pick one of those as the defacto standard and require it?<br>\nAlso, we need to support dbsnp's and hgvs, because labs that are sending those today will want a way to send them.</p>\n<blockquote>\n<p>We are at the end (we hope) and have concluded that we cannot support \"ReferenceVariant\" and the associated annotations and knowledge which is loosely coupled to the \"ReportedVariant\" structures.</p>\n</blockquote>\n<p>If you don't mind, I would like us to consider the ReferenceVariant structure as input into our definitional requirements, is that OK?</p>\n<blockquote>\n<p>It seems like the dbSNPid should be included in this attribute and not made a separate component. I'm not quite sure why decisions to call out only certain attributes like dbSNPids was made.</p>\n</blockquote>\n<p>dbSNP was kept separate because it doesn't always identify a specific variant, but more the location - the group felt that it should not be treated the same as other 'variation-code' values.</p>\n<blockquote>\n<p>Why can't we make the obsVariant profile just about the variant that was observed as being present or absent and not about capturing all these \"special\" annotations and derivative forms?</p>\n</blockquote>\n<p>Are you suggesting that obsVariant should only include the attributes that you have on ReportedVariant?  It does seem like we have a fair amount of overlap? For those that haven't reviewed, here is an example of ReportedVariant:</p>\n<div class=\"codehilite\"><pre><span></span><span class=\"nt\">&lt;externalId&gt;</span>60007705<span class=\"nt\">&lt;/externalId&gt;</span>\n          <span class=\"nt\">&lt;transcriptId&gt;</span>NM_000535.5<span class=\"nt\">&lt;/transcriptId&gt;</span>\n          <span class=\"nt\">&lt;geneRegion&gt;</span>Exon 4<span class=\"nt\">&lt;/geneRegion&gt;</span>\n          <span class=\"nt\">&lt;dnaChange&gt;</span>c.338C<span class=\"ni\">&amp;gt;</span>A<span class=\"nt\">&lt;/dnaChange&gt;</span>\n          <span class=\"nt\">&lt;dnaChangeType&gt;</span>SUBSTITUTION<span class=\"nt\">&lt;/dnaChangeType&gt;</span>\n          <span class=\"nt\">&lt;aminoAcidChange&gt;</span>p.Ser113X<span class=\"nt\">&lt;/aminoAcidChange&gt;</span>\n          <span class=\"nt\">&lt;aminoAcidChangeType&gt;</span>NONSENSE<span class=\"nt\">&lt;/aminoAcidChangeType&gt;</span>\n          <span class=\"nt\">&lt;chromosome&gt;</span>7<span class=\"nt\">&lt;/chromosome&gt;</span>\n          <span class=\"nt\">&lt;geneSymbol&gt;</span>PMS2<span class=\"nt\">&lt;/geneSymbol&gt;</span>\n          <span class=\"nt\">&lt;significant&gt;</span>true<span class=\"nt\">&lt;/significant&gt;</span>\n          <span class=\"nt\">&lt;interrogatedButNotFound&gt;</span>false<span class=\"nt\">&lt;/interrogatedButNotFound&gt;</span>\n          <span class=\"nt\">&lt;forcedIncidental&gt;</span>false<span class=\"nt\">&lt;/forcedIncidental&gt;</span>\n          <span class=\"nt\">&lt;notInterpreted&gt;</span>false<span class=\"nt\">&lt;/notInterpreted&gt;</span>\n          <span class=\"nt\">&lt;alleleState&gt;</span>\n            <span class=\"nt\">&lt;codeSystem&gt;</span>LN<span class=\"nt\">&lt;/codeSystem&gt;</span>\n            <span class=\"nt\">&lt;codeText&gt;</span>Heterozygous<span class=\"nt\">&lt;/codeText&gt;</span>\n            <span class=\"nt\">&lt;code&gt;</span>LA6706-1<span class=\"nt\">&lt;/code&gt;</span>\n            <span class=\"nt\">&lt;valueSetAbbr&gt;</span>Heterozygous<span class=\"nt\">&lt;/valueSetAbbr&gt;</span>\n          <span class=\"nt\">&lt;/alleleState&gt;</span>\n          <span class=\"nt\">&lt;categoryType&gt;</span>MEDICALLY_SIGNIFICANT<span class=\"nt\">&lt;/categoryType&gt;</span>\n          <span class=\"nt\">&lt;category&gt;</span>\n            <span class=\"nt\">&lt;codeSystem&gt;</span>LN<span class=\"nt\">&lt;/codeSystem&gt;</span>\n            <span class=\"nt\">&lt;codeText&gt;</span>Pathogenic<span class=\"nt\">&lt;/codeText&gt;</span>\n            <span class=\"nt\">&lt;code&gt;</span>LA6668-3<span class=\"nt\">&lt;/code&gt;</span>\n            <span class=\"nt\">&lt;valueSetAbbr&gt;</span>Pathogenic<span class=\"nt\">&lt;/valueSetAbbr&gt;</span>\n          <span class=\"nt\">&lt;/category&gt;</span>\n          <span class=\"nt\">&lt;genomicSource&gt;</span>\n            <span class=\"nt\">&lt;codeSystem&gt;</span>LN<span class=\"nt\">&lt;/codeSystem&gt;</span>\n            <span class=\"nt\">&lt;codeText&gt;</span>Germline<span class=\"nt\">&lt;/codeText&gt;</span>\n            <span class=\"nt\">&lt;code&gt;</span>LA6683-2<span class=\"nt\">&lt;/code&gt;</span>\n            <span class=\"nt\">&lt;valueSetAbbr&gt;</span>Germline<span class=\"nt\">&lt;/valueSetAbbr&gt;</span>\n          <span class=\"nt\">&lt;/genomicSource&gt;</span>\n          <span class=\"nt\">&lt;nestedVariants/&gt;</span>\n</pre></div>\n\n\n<blockquote>\n<p>Imagine if we had a Variant resource and that it could be the subject of an Observation? game changer!</p>\n</blockquote>\n<p>New resources in FHIR are certainly possible, but are often met with questions like \"do you really need this?\" or \"can't you use resource X?\" - but we need to come up with answers to the questions this conversation brings up.  I am hopeful the IM subgroup work we are doing can help inform us in this space.</p>",
        "id": 176102960,
        "sender_full_name": "Kevin Power",
        "timestamp": 1568902137
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> thanks for the great feedback... addressing each below...</p>\n<blockquote>\n<p>Are you suggesting we should pick one of those as the defacto standard and require it?</p>\n</blockquote>\n<p>Maybe.  The GA4GH VR spec defines the standard for assigning a globally unique computable identifier to variants (alleles for now, soon genotypes and haplotypes, and CNVs. ...) I'm suggesting that this identifier would be THE best choice in the long run, as it would then allow you to decorate it with all the various nomenclature and annotations regarding the current and future ways human's would want to present the variant. This id would be the key to a \"referenceable\" variant independent of the patient or sample.  But I recognize this is a bit early, but not if you think about how long it will take to get this to Normative. By then folks will be asking \"why didn't you include the GA4GH computable id - everyone else use it?\" ;) ( i slightly jest)</p>\n<blockquote>\n<p>If you don't mind, I would like us to consider the ReferenceVariant structure as input into our definitional requirements, is that OK?</p>\n</blockquote>\n<p>Yes. I agree. But, the key here is that if you look in the ReferenceVariant you will see the schema and values that define the variant (and lift-over equivalents as well as projected equivalents to transcript and and proteins).  These fields are currently in a flattened structure within the separate components within the obsVariant. They are somewhat better structured in the MolecularSequence. Regardless of where they are they should be consistently represented and separate enough that it is clear they work together to \"define\" the variant in a computational way. This is the minimum hope that I have for the profiles and FHIR. And it seems like you have the fields, just not organized in a coherent, clear and consistent manner.</p>\n<blockquote>\n<p>dbSNP was kept separate because it doesn't always identify a specific variant, but more the location - the group felt that it should not be treated the same as other 'variation-code' values.</p>\n</blockquote>\n<p>I see. I'm certainly that its not treated as a variation-code (but its not clear that folks won't still put it there). For the sake of being overly specific, why wouldn't we call it what it is - a location-type code or something to that effect and then allow the dbSnpId to be placed there along with any other \"feature-based\" representation of the variant position. It just seems like dedicating a whole component to one specific authorities identifier puts a significant emphasis on that identifier and presumes that it should be used for a long time. Maybe this is good. Maybe its not. It just might be nice to low-lite it a bit and give us an out in the future if we decide it isn't the only game in town for that kind of annotation. (And I'm a huge fan of dbsnp to be clear - i'm a bigger fan of a specification that supports growth).</p>\n<blockquote>\n<p>Are you suggesting that obsVariant should only include the attributes that you have on ReportedVariant? It does seem like we have a fair amount of overlap? </p>\n</blockquote>\n<p>We (GeneInsight/eMERGE/Clinical Labs that send structured genomic data) send this kind of data for convenience to the receiving systems. The key elements here are #1- \"externalId\" (that is the variant and only that! - refer to reference variant for precise definition). #2- \"interrogatedButNotFound\" (present or absent), #3 - genomic-source (allelic-origin - see GENO), #4 - allele state (see GENO) -only if the variant is an allele or haplotype - not needed for genotypes, complex variants, etc...<br>\nThe other data is more for convenience and is a conflation of the assertion of pathogenicity with the actual presence/absence. Beyond that the transcript, aminoacid, genesymbols, etc.. are useful for the lab to structurally share how they prefer to represent the genomic change that they observed. And, to be clear, some labs will pick a different transcript for the same genomic change.  You'd like to hope the receiving system and computational content would be able to understand that they are one and the same variant - at the genomic level which was what was actually observed.</p>\n<blockquote>\n<p>New resources in FHIR are certainly possible, but are often met with questions like \"do you really need this?\" or \"can't you use resource X?\" - but we need to come up with answers to the questions this conversation brings up. I am hopeful the IM subgroup work we are doing can help inform us in this space.</p>\n</blockquote>\n<p>I do get this. I honestly understand why the FHIR gods hold strong on this point, otherwise it would be bedlam in terms of Resources. It is really on us to make the case where we can all stand together and say \"Yes - we really need this and here's why\".  It seems easy to answer the question \"why can't you use resource X?\".  I believe this thread and the plethora of previous back and forth threads and emails have made the case \"why Observation is insufficient for representing Variation in Clinical Genomics results\".  It is a big part of the solution - very critical, very important. It just falls short of giving us the structure for \"Variation\" as a first class thing (resource or data type). .... Like I said, if you share a Variation then you could make additional observations about it (was it observed, what was the gene, what was the frequency, what is its pathogenicity for a given disease).  <br>\nWhen folks are making statements about the pathogenicity of a variant they are doing in the context of a disease (the indication or some secondary indication based on secondary findings). They are NOT making an observation that is directly related to the patient. It is indirect in that the patient has the variant and has the indication. The pathogenicity is a piece of information to inform the physician so they can diagnose the patient. </p>\n<p>thanks for sharing and listening.</p>",
        "id": 176221491,
        "sender_full_name": "Larry Babb",
        "timestamp": 1569006157
    }
]