[
    {
        "content": "<p>As a follow up to call discussions and tracker on panels being orders that result in \"groupings\" of test results/observations in the genomics report, there are Service Request resource info that can address the issue.  </p>\n<p>See <a href=\"https://www.hl7.org/fhir/valueset-request-intent.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-request-intent.html\">https://www.hl7.org/fhir/valueset-request-intent.html</a>  </p>\n<p>The original order is for a single test order/result, or panel order or profile order( a grouping of sub panels) each with their own result items reported as part of Diagnostic Report .</p>\n<p>It should resolve the tracker and need for groupings that appear in the diagnostic report for panels.  Recommend that CG recognize the context and info provided on the order side of things that end up reported as part of the diagnostic report and structured as other lab tests, panels in other laboratory areas.  </p>\n<p>Also, Service Catalog has firmed up their resources that are used to generate the Service Catalog and resources/structure used for lab catalogs/menus/CLIA Specimen Collection Manual.  Quest shared examples of the 4 types of orders:  single test order/result; panel order with one or more results; reflex order (conditional add on order depending on result values), and profile (physician convenience panel/tiered orders/grouping of panels).  The same data model/resources would be used for genomics test orders as well.  Attaching Service Catalog examples (see slides 11-15) <a href=\"/user_uploads/10155/vfiyevTaAC061ZKTUW3-gZQ3/OO_Catalog_resources_discussion_20190305.pptx\" target=\"_blank\" title=\"OO_Catalog_resources_discussion_20190305.pptx\">OO_Catalog_resources_discussion_20190305.pptx</a></p>\n<p>fyi <span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span>  <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> <span class=\"user-mention\" data-user-id=\"196553\">@James Jones</span> <span class=\"user-mention\" data-user-id=\"191719\">@Gil Alterovitz</span> <span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span> <span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span></p>",
        "id": 160168375,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1551932953
    },
    {
        "content": "<p>Do you mean you want a link to the original order in the result?</p>",
        "id": 160290867,
        "sender_full_name": "Bret H",
        "timestamp": 1552053429
    }
]