[
    {
        "content": "<p>Hi all, wanted to follow up today's discussion with <a href=\"http://build.fhir.org/observation.html#resource\">http://build.fhir.org/observation.html#resource</a> which provides the rule: <br>\n<code>\"dataAbsentReason SHALL only be present if Observation.value[x] is not present\".</code> Since we set value[x] to 0..0 on region-studied, dataAbsentReason could theoretically be used, but using this along with <code>no call</code> or <code>indeterminate</code> as a value on other Observations is improper. </p>\n<p>Further description of the field: </p>\n<blockquote>\n<p>Null or exceptional values can be represented two ways in FHIR Observations. One way is to simply include them in the value set and represent the exceptions in the value. For example, measurement values for a serology test could be \"detected\", \"not detected\", \"inconclusive\", or \"specimen unsatisfactory\".</p>\n<p>The alternate way is to use the value element for actual observations and use the explicit dataAbsentReason element to record exceptional values. For example, the dataAbsentReason code \"error\" could be used when the measurement was not completed. Note that an observation may only be reported if there are values to report. For example differential cell counts values may be reported only when &gt; 0. Because of these options, use-case agreements are required to interpret general observations for null or exceptional values.\"</p>\n</blockquote>",
        "id": 204442777,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1595261658
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> -- That actually makes me wonder if our way of not allowing <code>Observation.value[x]</code> is even appropriate?</p>",
        "id": 204443080,
        "sender_full_name": "Kevin Power",
        "timestamp": 1595261843
    },
    {
        "content": "<p>I agree we need to re-think value[x] on region-studied, since we are viewing it as its own observation and not a panel like Grouper (where we also removed value[x], which is valid as long as one of the .hasMember Findings have a value). </p>\n<p>Also the Implications, I recall seeing  that as long as components have a value you don't need one on the Observation itself, will have to track that down...</p>",
        "id": 204443990,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1595262365
    },
    {
        "content": "<p>Interestingly, the FHIRpath expression of constraint/rule 6,<br>\n<code>obs-6 - dataAbsentReason SHALL only be present if Observation.value[x] is not present  - dataAbsentReason.empty() or value.empty()</code><br>\nSeems to suggest any panel Observation matching their described pattern:</p>\n<blockquote>\n<p>\"For grouping related observations such as for a \"panel\" or \"battery\". In this case the Observation.code represents the \"panel\" code, typically Observation.value[x] is not present, and the set of member Observations are listed in Observation.hasMember. This structure permits nested grouping when used with DiagnosticReport (e.g. complex micro isolate and sensitivities report).\"</p>\n</blockquote>\n<p>would also have to supply a <code>dataAbsentReason</code>... not sure this is intended. I've never seen an error from that rule on HAPI/etc. </p>\n<p><a href=\"http://hl7.org/fhir/codesystem-data-absent-reason.html#data-absent-reason-not-permitted\">not-permitted</a> may be appropriate.</p>",
        "id": 204445375,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1595263183
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> Hi Jamie. I was thinking that the intent wouldn't be to use dataAbsentReason on region-studied, but rather, on Variant. (Observation.value for variant profile includes various data absent reasons, such as 'no call', which we'd have to think through).</p>",
        "id": 204449072,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1595265156
    },
    {
        "content": "<p>In other words, region-studied is making explicit assertions about noncallable regions, whereas you may also want to make an explicit assertion about a variant in a noncallable region, in which case you'd use the variant profile, with an observation.value of not callable or perhaps a data absent reason.</p>",
        "id": 204450253,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1595265721
    },
    {
        "content": "<p>Thanks for the explanation <span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span> - I think that makes sense to me. Variant(Observation).valueCodeableConcept is currently bound to a LOINC answer list with Present, Absent, No Call, Indeterminate.  I concur with Bob D that we need to think through a value of \"No Call\" and if it is really the same thing we are talking about here.</p>",
        "id": 204545546,
        "sender_full_name": "Kevin Power",
        "timestamp": 1595337259
    },
    {
        "content": "<p>The \"recommendation is to include notions of other, unknown, etc. into value sets if the element is coded, NOT to use [DAR]\".</p>\n<p>(per Lloyd's comment here:  <a href=\"#narrow/stream/179202-terminology/topic/Extensible\">https://chat.fhir.org/#narrow/stream/179202-terminology/topic/Extensible</a>)</p>",
        "id": 204711765,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1595446285
    },
    {
        "content": "<p>data absent reason seems both appropriate and useful to me.  Use what all ready exists in FHIR</p>",
        "id": 205113164,
        "sender_full_name": "Bret H",
        "timestamp": 1595854710
    },
    {
        "content": "<p>My comment above refers to a general recommendation for value set bindings.</p>\n<p>FHIR defines generic data absent reason and null flavor extensions, but those extensions are limited in their ability to describe nuanced reasons for missing data.</p>",
        "id": 205167536,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1595883550
    }
]