[
    {
        "content": "<p>As we discussed on today's call, I will be \"taking the lead\" on an effort to develop a \"user friendly\" guide for creating a PGx report using our IG (hopefully the first of others to come)   - here is the initial document: <a href=\"https://docs.google.com/document/d/12QOAuQ7-tHRkGu3JASlss6iT4Qbk4u6lhu7KaqOuMoE/edit?usp=sharing\">https://docs.google.com/document/d/12QOAuQ7-tHRkGu3JASlss6iT4Qbk4u6lhu7KaqOuMoE/edit?usp=sharing</a>   I mentioned today the question of including or not including an overview of ordering the report and that is but many of the questions we will need to answer as we develop this guidance (which will become a page in  our IG). Please use this Zulip thread to ask questions of the WG or me, put forward ideas, etc..  thank you!!</p>",
        "id": 226543386,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1613495295
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196476\">@Arthur Hermann</span>  sent you via email as well. You might find these old slides useful. We've moved to the consolidated spec, but slide 18 will be really useful.</p>\n<p><a href=\"https://drive.google.com/file/d/1-oHoLjIle9Xc_cPhv56quUeyA2LZymyh/view?usp=sharing\">https://drive.google.com/file/d/1-oHoLjIle9Xc_cPhv56quUeyA2LZymyh/view?usp=sharing</a></p>",
        "id": 228435138,
        "sender_full_name": "Bret H",
        "timestamp": 1614701053
    },
    {
        "content": "<p>There are also examples in the IG that can be used in the use case you are describing (why reinvent and when you can reuse)</p>",
        "id": 228435710,
        "sender_full_name": "Bret H",
        "timestamp": 1614701238
    },
    {
        "content": "<p>The IG also has a couple of relevant graphics</p>",
        "id": 228435769,
        "sender_full_name": "Bret H",
        "timestamp": 1614701264
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/uv/genomics-reporting/pharmacogenomics.html\">http://hl7.org/fhir/uv/genomics-reporting/pharmacogenomics.html</a> provides the current information as a place to expound from</p>",
        "id": 228438599,
        "sender_full_name": "Bret H",
        "timestamp": 1614702150
    },
    {
        "content": "<p>Here is the CORRECT and UPDATED link to the Google doc which contains a link so that you can comment:  <a href=\"https://docs.google.com/document/d/12QOAuQ7-tHRkGu3JASlss6iT4Qbk4u6lhu7KaqOuMoE/edit?usp=sharing\">https://docs.google.com/document/d/12QOAuQ7-tHRkGu3JASlss6iT4Qbk4u6lhu7KaqOuMoE/edit?usp=sharing</a></p>",
        "id": 228443986,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1614704129
    },
    {
        "content": "<p>Thanks Bret!!  I hadn't seen these slides before.. they are very helpful!!  What was the impetus to create this slide deck and who was it shown to?</p>",
        "id": 228444798,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1614704418
    },
    {
        "content": "<p>I presented the slides over two WG meetings about a year ago as part of our WG moving to he current implication profiles. Will take a look at your documentation. I briefly went through it and found the figures expansive but very informative. The document targets a comprehensive view - really stands alone from the IG as a 'Walkthrough of the HL7 CG FHIR IG through the PGx lens' I think it would be a good Tab #2. Leaving the current sections in the IG as they are (or moving them to the relevant Structure definition pages).  This would mean that the document can be super comprehensive - taking on as much scope as possible - even a little on oncology versus germline medication recommendations. What do you think?</p>",
        "id": 228595220,
        "sender_full_name": "Bret H",
        "timestamp": 1614779945
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> - thanks for the context. Regarding the placement of the PGx \"User Guide\".. I would like to get input from members of the working group. <br>\n<span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> ,  <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span>  - can we be sure to get this item onto a Tuesday meeting agenda or follow-up in some other way that you feel is best? My specific concerns are that we don't make this \"guide\" hard to find and that we don't confuse the folks using the IG by having some information about PGx reporting as we currently have here:  <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/pharmacogenomics.html\">http://build.fhir.org/ig/HL7/genomics-reporting/pharmacogenomics.html</a>  while also showing this  info in-depth in the \"User Guide\" . Of course we do want the IG to have all of the resources used in PGx reports, explained in detail, either in this \"User Guide\" or within the IG in general.  As to including Oncology - I personally don't believe we should do that unless we have time to thoroughly explore and document the use case within the \"User Guide\". We won't have time to do so for this version of the \"Guide\" which will be part of our Ballot in May, however we could go back to it in the future and add that use case.</p>",
        "id": 228811521,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1614877736
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196476\">@Arthur Hermann</span> <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span>  Here are some <a href=\"https://github.com/emerge-ehri/fhir-specification/tree/master/Sample%20Reports/Standard\">sample reports</a> we generated with STU1 for eMERGE, these reports include both Gene Panel and PGx results. Unfortunately, to reduce scope, we did not generate the variant profiles for PGx but stopped at Genotypes. Hope it can still be useful.</p>",
        "id": 228813280,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1614878344
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> <span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span>  <span class=\"user-mention\" data-user-id=\"196476\">@Arthur Hermann</span> I added this item for March9th.</p>",
        "id": 228813728,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1614878495
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196476\">@Arthur Hermann</span> - My thinking is that your \"User Guide\" should replace the pharmacogenomics page we have today. I think having two similar pages would cause confusion, so I hope you can incorporate its contents into your user guide.  What do you think?</p>\n<p>Definitely no plans to do this for Oncology for the May ballot, unless someone is willing to volunteer asap?</p>",
        "id": 228849600,
        "sender_full_name": "Kevin Power",
        "timestamp": 1614891706
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> I agree with everything you stated ...it is my intention to incorporate appropriate info from current PGx page.  I then would hope to replace current page..</p>",
        "id": 228853767,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1614893398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> as long as the useful information for the components of the profile make it to the structure definition. The current information is a nice abbreviation.</p>",
        "id": 228952122,
        "sender_full_name": "Bret H",
        "timestamp": 1614950782
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> -Are you suggesting that we need better documentation on the StructureDef itself for the components?</p>",
        "id": 228963907,
        "sender_full_name": "Kevin Power",
        "timestamp": 1614955229
    },
    {
        "content": "<p>We briefly mentioned this on call last week, most of the content on <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/pharmacogenomics.html\">http://build.fhir.org/ig/HL7/genomics-reporting/pharmacogenomics.html</a> should likely be presented on <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/StructureDefinition-therapeutic-implication.html\">http://build.fhir.org/ig/HL7/genomics-reporting/StructureDefinition-therapeutic-implication.html</a> rather than removed when we update the first page.</p>",
        "id": 229313428,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1615216180
    },
    {
        "content": "<p>I wanted to note that the following Jira's were pushed to the PGx work that I am leading. However after looking at them, I don't believe that any of them will be addressed by the PGx \"User Guide\" (except possibly the image issue in the first). Therefore, we will likely want to consider how to triage them another way:  <a href=\"http://jira.hl7.org/browse/FHIR-16493\">FHIR-16493</a> Relation of PgX Example to Specimen analyzed to produce Diagnostic Report results<br>\n<a href=\"http://jira.hl7.org/browse/FHIR-16082\">FHIR-16082</a> PGx Impact - Allele functional status<br>\nUseful codes/terms but hesitate to add additional components to the structure.<br>\n<a href=\"http://jira.hl7.org/browse/FHIR-19844\">FHIR-19844</a> PGx High Risk Allele Medication Impact is confusing Review pattern</p>",
        "id": 229727633,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1615404576
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/w5_3To2NKJDveH07KP_mMlRs/Modified-v2-schema-overview-for-PGx-exam.jpg\">Modified-v2-schema-overview-for-PGx-exam.jpg</a> <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  and anyone else who would like to chime in... based on our decision to change the gene coverage box to region studied, I need to determine the proper color for that box after the text change. I changed it as per the attached, but I am not sure that this would be the correct color coding. Can anyone help me determine what the correct color would be? Also Mullai - do you know the meaning of the numbers within the circles - some being black and some being white? I can't figure out why some are black... thanks to all!</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/w5_3To2NKJDveH07KP_mMlRs/Modified-v2-schema-overview-for-PGx-exam.jpg\" title=\"Modified-v2-schema-overview-for-PGx-exam.jpg\"><img src=\"/user_uploads/10155/w5_3To2NKJDveH07KP_mMlRs/Modified-v2-schema-overview-for-PGx-exam.jpg\"></a></div>",
        "id": 229738070,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1615408184
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196476\">@Arthur Hermann</span> the numbers map to the components identified in the BCM and LMM sample reports; Figures 2 and 3 on this <a href=\"https://emerge-fhir-spec.readthedocs.io/en/stable/design.html\">page</a>. The color of the number in the circles is not significant.</p>",
        "id": 229741407,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1615409299
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> for the information on the numbers.. I do understand that they map to the sample report (as I am also modifying colors and numbers there).. it is strange to me that the color of the number has no importance.. but happy to understand. Still need input from others on what color the Region Studied \"box\" and number circle should be....</p>",
        "id": 229744006,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1615410174
    },
    {
        "content": "<p>A reminder to all that the PGx Report \"User Guide\" must be completed within the next week! I ask that everyone please read through it (note that the code and snippets still need to be added, but all other content is complete, pending input from the Working Group). My request is that you: </p>\n<ol>\n<li>Read through the entire document as if you were trying to create a PGx report. Does it flow well, make sense, provide the necessary information? </li>\n<li>Read all comments. There are a few items that need additional information, but I am not able to provide it. I need someone from the WG to assist. </li>\n<li>We need to determine if the table at the end of document should remain, and if so, what columns it should contain. I personally feel it is helpful. However, if it remains, I need folks to provide examples for that field and any other text which is required for additional columns.</li>\n</ol>\n<p>Thank you all in advance for your help in making this a useful example of how to use our IG!   The Document is here: <a href=\"https://docs.google.com/document/d/12QOAuQ7-tHRkGu3JASlss6iT4Qbk4u6lhu7KaqOuMoE/edit?usp=sharing\">https://docs.google.com/document/d/12QOAuQ7-tHRkGu3JASlss6iT4Qbk4u6lhu7KaqOuMoE/edit?usp=sharing</a></p>",
        "id": 231373702,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1616442499
    },
    {
        "content": "<p>Updated the examples shown today to include instances of our task profile for medication change recommendations and an overall-interpretation instance. Branch should be updating shortly, please browse the report at <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/branches/emerge-examples/DiagnosticReport-PGxGenomicsReportEMERGE.html\">http://build.fhir.org/ig/HL7/genomics-reporting/branches/emerge-examples/DiagnosticReport-PGxGenomicsReportEMERGE.html</a> and a sample Task at <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/branches/emerge-examples/Task-PGxRecEx04.html\">http://build.fhir.org/ig/HL7/genomics-reporting/branches/emerge-examples/Task-PGxRecEx04.html</a></p>",
        "id": 233354191,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1617728319
    }
]