[
    {
        "content": "<p>Do we have an understanding for how Precision Of Boundaries should be used? <a href=\"https://loinc.org/81288-3/\">https://loinc.org/81288-3/</a> </p>\n<p>Is this no longer supported in the FHIR Spec? </p>\n<p>If it isn't (even if it is), does anyone have information/background on what it was originally intended to convey as a LOINC code associated with the structural variant spec in V2? I'm trying to understand how fuzzy boundaries should be approached and am not sure I'm interpreting the purpose of this LOINC correctly.</p>",
        "id": 215611631,
        "sender_full_name": "Rachel Kutner",
        "timestamp": 1604509588
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"249407\">@Rachel Kutner</span> it seems there is a contradiction in the term description and the scale of 81288-3. I think the original intent of the term was probably meant to be narrative/text (since it says that in the description) rather than \"nominal\". The idea being, you can either use the two other LOINC codes to report the range (numerically) or use 81288-3 to use text. I'll ping LOINC and let them know there is a contradiction in the term description.</p>\n<p>It was not carried over from V2 to FHIR. However, the two range codes (inner start-end and outer start-end) are in the Variant profile. </p>\n<p>Looking at the LRI, there is a note for both inner start-end and outer start-end that \"this content... provides a way to describe the uncertainty in the edge positions of structured variation. These are available in NCBI's dbVar file, not commonly reported today\". I can do some digging and see if there is additional guidance from NCBI.</p>",
        "id": 215618937,
        "sender_full_name": "Liz Amos",
        "timestamp": 1604512889
    },
    {
        "content": "<p>it should probably be associated with the Structural Variant profile 81297-4 (or maybe it was at one time and then removed - I think there was some changing going on since it's still marked as \"Trial\" status)</p>",
        "id": 215619174,
        "sender_full_name": "Liz Amos",
        "timestamp": 1604512984
    }
]