[
    {
        "content": "<p>My understanding is that many labs use the AMP Tier System guidelines for indicating the clinical significance of a Somatic Variant result to clinicians. The LOINC code 90344-6  -- Level of evidence indicates the AMP tier system as one of the example answer lists. </p>\n<p>I have 2 questions regarding this. </p>\n<ol>\n<li>\n<p>Why don't we have answer lists for the other example answers for Level of Evidence? If Tier System values come back, how do we expect them to be sent/received? As free-text rather than codes?</p>\n</li>\n<li>\n<p>These terms aren't just Level of Evidence - they conflate level of evidence (strong, possible, etc.) with a clinical implication (benign, pathogenic, etc). Why are we using terms that represent a mix of things as though they only indicate Level of Evidence? What's the big picture idea of how these concepts will work with other parts of the message to appropriately represent the clinical implications of a result? </p>\n</li>\n</ol>\n<p>If there's more information on this design/decision process, I'd be grateful to be pointed to it. This is something that's been a challenge for us in terms of discretely representing complex implications.</p>",
        "id": 195436326,
        "sender_full_name": "Rachel Kutner",
        "timestamp": 1588002468
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"249407\">@Rachel Kutner</span> - A fine set of questions.  We have discussed in the past, but as tends to happen with our group, we never got to a final conclusion. <span aria-label=\"frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"frown\">:frown:</span>  If you haven't seen it before, we have this as a 'future discussion' in our Tuesday notes: <a href=\"https://docs.google.com/document/d/12-uBrMmav71a3_c9h_FXQteJo_I5Kt72NEBYXZuwhFg/edit#heading=h.s1sybg8b266\" title=\"https://docs.google.com/document/d/12-uBrMmav71a3_c9h_FXQteJo_I5Kt72NEBYXZuwhFg/edit#heading=h.s1sybg8b266\">https://docs.google.com/document/d/12-uBrMmav71a3_c9h_FXQteJo_I5Kt72NEBYXZuwhFg/edit#heading=h.s1sybg8b266</a></p>\n<p>I might suggest you review the proposals there and see if they help/hurt?  We might even want to discuss this in tomorrow's call?  <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> ?</p>",
        "id": 195443534,
        "sender_full_name": "Kevin Power",
        "timestamp": 1588005694
    },
    {
        "content": "<p>I would definitely favor splitting the conflated concepts. One option we haven't considered is giving these tiered values their own component, separate from the underlying concepts, so folks who only have AMP tier will be able to send it without adding extra confusion -- similar to how we dealt with dbSNP in the past</p>",
        "id": 195446807,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1588007079
    },
    {
        "content": "<p>We (Epic) have implemented the HL7v2 clinical genomics spec with some alterations with the goal of being able to send/receive/store discrete genomic results. Based on feedback in the medical community, we expanded the terms we accept for Clinical Significance (<a href=\"https://loinc.org/53037-8/\" title=\"https://loinc.org/53037-8/\">https://loinc.org/53037-8/</a>) to include the AMP Tier System when a variant is returned with a Genomic Source of Somatic. </p>\n<p>Short term this seems to be in line with how labs and clinicians expect these results to be represented; however, it seems long term there might be structural benefits to splitting this information out in the storage, even if they are used to depict the same information (\"Potenitally Benign\" --&gt; \"Potential\" and \"Benign\"). It seems like it could allow more flexibility for the same set of terms to apply to a broader range of applications.</p>\n<p>Of note: When we asked a pathologist a few years ago about the idea of splitting these concepts out, they weren't thrilled about the idea of having more fields to fill out - they interpreted it as having more work for them to do to document the same information. But if it isn't a manual workflow, I'm not sure those draw backs would apply.</p>",
        "id": 195450271,
        "sender_full_name": "Rachel Kutner",
        "timestamp": 1588008713
    },
    {
        "content": "<p>I thought we've talked about this before with Swapna from LOINC last year and there was going to be changes (inlc. new LOINC codes). Someone would have to check out WG mtg and weekly mtg notes, but I am very certain we landed in agreement with breaking it apart (as <span class=\"user-mention\" data-user-id=\"249407\">@Rachel Kutner</span>  is describing). <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  did we have any notes from the convos with Swapna?</p>",
        "id": 195581462,
        "sender_full_name": "Bret H",
        "timestamp": 1588087940
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191913\">Kevin Power</span> <a href=\"#narrow/stream/179197-genomics/topic/Representing.20Significance.20and.20Confidence.20in.20FHIR.2FHL7.20specs/near/195443534\" title=\"#narrow/stream/179197-genomics/topic/Representing.20Significance.20and.20Confidence.20in.20FHIR.2FHL7.20specs/near/195443534\">said</a>:</p>\n<blockquote>\n<p>If you haven't seen it before, we have this as a 'future discussion' in our Tuesday notes: <a href=\"https://docs.google.com/document/d/12-uBrMmav71a3_c9h_FXQteJo_I5Kt72NEBYXZuwhFg/edit#heading=h.s1sybg8b266\" title=\"https://docs.google.com/document/d/12-uBrMmav71a3_c9h_FXQteJo_I5Kt72NEBYXZuwhFg/edit#heading=h.s1sybg8b266\">https://docs.google.com/document/d/12-uBrMmav71a3_c9h_FXQteJo_I5Kt72NEBYXZuwhFg/edit#heading=h.s1sybg8b266</a></p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> -- I included the link in my response above. ^^^</p>",
        "id": 195583539,
        "sender_full_name": "Kevin Power",
        "timestamp": 1588088804
    },
    {
        "content": "<p>also discussed Oct 17, 2019 and September 11, 2019</p>",
        "id": 196299191,
        "sender_full_name": "Bret H",
        "timestamp": 1588680927
    }
]