[
    {
        "content": "<p>Re: Inclusion of Sanger confirmation information (<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19829\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19829\">GF#19829</a>), we'd like to open up discussion on whether confirmations of NGS results should be separate Observations (likely) and if so, are they additional Variant profiles (duplicating many components), or something simpler?</p>",
        "id": 168323961,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1560787823
    },
    {
        "content": "<p>Two things:<br>\n1. I lean towards a simple 'Confirmation Status' profile that points at what the confirmation testing was about (perhaps via Observation.focus?), we would need a good Observation.code, Observation.method could indicate 'Sanger', and the ConfirmationStatus.value contains the status (perhaps there is a good value set out there for this?).<br>\n2. Perhaps this is a good question for O&amp;O?  Seems other types of Observations might have a similar requirement and maybe there is already a pattern?</p>",
        "id": 168324954,
        "sender_full_name": "Kevin Power",
        "timestamp": 1560788523
    },
    {
        "content": "<p>I wonder if this could be a use of the RegionStudied profile... saying the specific variant regions were completely studied and verified (method as Sanger). Is that asking too much? Thoughts, <span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span> ?</p>",
        "id": 168342882,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1560801893
    },
    {
        "content": "<p>I was kinda thinking of another option, where we primarily represent each test, and then have optional associations that indicate concordance. So for instance, imagine a patient that had a variant detected and reported based solely on Sanger sequencing. </p>\n<p><span class=\"user-mention\" data-user-id=\"196553\">@James Jones</span> I like where you're going with RegionStudied :-). A very interesting recent article (<a href=\"https://jmd.amjpathol.org/article/S1525-1578(18)30291-5/pdf\" target=\"_blank\" title=\"https://jmd.amjpathol.org/article/S1525-1578(18)30291-5/pdf\">https://jmd.amjpathol.org/article/S1525-1578(18)30291-5/pdf</a>) suggests that we can algorithmically tier variants into high confidence true positives (may not need confirmation); candidate true positives (likely should have confirmation); and high confidence false positives (wouldn't be reported). Just thinking out loud here, but if we had a 'high confidence subregion' and a 'middle confidence subregion' component, I'd be able to represent high and middle confidence subregions in the RegionStudied profile, and then use that information by a decision support appplication to alter the strength of the recommendation.</p>",
        "id": 168347845,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1560805826
    },
    {
        "content": "<p>Other groups have certainly asked for more structure in modeling individual tests inside a larger report...</p>",
        "id": 168348017,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1560805961
    },
    {
        "content": "<p>I suppose we could use Region Studied, but it seems pretty heavy handed to me.  Plus, I think in most cases when they do confirmation, the labs are basically saying \"this variant was confirmed by Sanger\", not necessarily \"I confirmed everything in this region\"?  But maybe I am off base?</p>",
        "id": 168350610,
        "sender_full_name": "Kevin Power",
        "timestamp": 1560808172
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> I agree that using RegionStudied is probably too much to do prior to publication. And I understand that labs often report 'confirmed by Sanger', so I don't mind adding some type of flag if it's of value to someone, above and beyond what's in the narrative report. But I also feel like introducing the flag gives us yet another way of representing analytic validity. How would you differentiate, say, one variant that was 'mid-level confidence' and therefore subjected to sanger sequencing vs. another variant that was 'high confidence' and therefore not confirmed with Sanger?</p>",
        "id": 168454256,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1560891147
    },
    {
        "content": "<p>Well, your comments make me wonder - does this solve a computational problem now?  Meaning, do we think the 'Sanger Confirmation' needs to be a computable value for the first release, or is simply stating it in the report sufficient?  Tagging <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> since she logged the tracker.</p>",
        "id": 168456077,
        "sender_full_name": "Kevin Power",
        "timestamp": 1560892511
    },
    {
        "content": "<p>The more I think about it, the more uncomfortable I am with us not giving Variant a uniform way to convey confidence. I almost feel it should be required to enter into an EMR...</p>",
        "id": 168853093,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1561385730
    },
    {
        "content": "<p>Unless there is already one suggested somewhere I'm not seeing</p>",
        "id": 168853206,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1561385797
    },
    {
        "content": "<p>Maybe this is something for a future \"daughter IG\" and not the universal one, but I think we need to set aside a component apart from method for comments like this. Thoughts??</p>",
        "id": 168853818,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1561386249
    },
    {
        "content": "<p>Observation.note could also function here if we provide guidance saying so but I envision this being coded in the near future.</p>",
        "id": 168853911,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1561386333
    },
    {
        "content": "<p>Confidence is something we need to spend some time on, but the biggest problem  is what I haven't seen - I don't know how or if this is delivered today, and what the senders and receivers will expect.  This is likely because the labs only deliver things they are 'confident' in today.  But in tomorrow's world, the lines will get blurred.  We just need a solid proposal to start from, and if it causes us to rework / break some things from our first release, that is OK.</p>",
        "id": 168854764,
        "sender_full_name": "Kevin Power",
        "timestamp": 1561386933
    },
    {
        "content": "<p>And if we think the Sanger Confirmation is all tied up in this confidence, then perhaps we should defer it?</p>",
        "id": 168854856,
        "sender_full_name": "Kevin Power",
        "timestamp": 1561386992
    },
    {
        "content": "<p>On call today we discussed a Variant component for \"confidence\" with example values of (Confirmed/High/Medium/Low/Unknown), considering results in the paper <a href=\"https://jmd.amjpathol.org/article/S1525-1578(18)30291-5/fulltext\" target=\"_blank\" title=\"https://jmd.amjpathol.org/article/S1525-1578(18)30291-5/fulltext\">https://jmd.amjpathol.org/article/S1525-1578(18)30291-5/fulltext</a>. High indicating high confidence true positives (don't need confirmation), Medium indicating candidate true positives (in need of confirmation), and Low indicating high confidence false positives (included for completeness). </p>\n<p>Not 100% sold on H/M/L as labs must specify algorithm, but would love to have the group consider if this concept is inside the 80% or the 20%</p>",
        "id": 168880889,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1561406792
    },
    {
        "content": "<p>Seems like a pretty good middle ground to me.  I am not sure about the value set though.</p>\n<p>I suppose we could consider a Confidence Method component to go along with it in case they wanted to indicate how they determined it.</p>",
        "id": 168893864,
        "sender_full_name": "Kevin Power",
        "timestamp": 1561418682
    },
    {
        "content": "<p>To provide more context - for clinical reports, every variant reported includes a confirmation status, it does not have to be Sanger. For example, we validate CNVs using MLPA and NGS with Sanger.  Would <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>'s  recommendations in the second thread be a good start? As <span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span>  had suggested, the notion of confidence should also be helpful though I am not sure of the value set. Another point to note, if it is a research report, we don't need confirmation. Would the DescribedVariant be an appropriate Observation to include this info?</p>",
        "id": 169298191,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1561816419
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> thanks for the input. Which recommendation of mine are you referring to?  Having a separate profile for the confirmation?  And do you not want to combine the confirmation and confidence concepts?</p>\n<p>Regarding your comments about a research report not having a confirmation, any approach we take should be optional. </p>\n<p>If we include the confirmation as a component, we would certainly want to include it in the Variant profile.</p>",
        "id": 169343198,
        "sender_full_name": "Kevin Power",
        "timestamp": 1561907292
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> Here is your recommendation 1. I lean towards a simple 'Confirmation Status' profile that points at what the confirmation testing was about (perhaps via Observation.focus?), we would need a good Observation.code, Observation.method could indicate 'Sanger', and the ConfirmationStatus.value contains the status (perhaps there is a good value set out there for this?).<br>\nPerhaps we could also additionally include the confidence element?</p>",
        "id": 169359931,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1561940284
    },
    {
        "content": "<p>One reason I was thinking the confidence element would be helpful is, for example, a case where two variants are identified. One is deemed high confidence and therefore no confirmatory testing is performed, whereas the other is intermediate confidence and therefore has confirmatory testing. Without the confidence element, all we'd see is that one was confirmed and one wasn't. As for value set for confidence, I'm suggesting we start with something very simple, based on <a href=\"https://jmd.amjpathol.org/article/S1525-1578(18)30291-5/fulltext\" target=\"_blank\" title=\"https://jmd.amjpathol.org/article/S1525-1578(18)30291-5/fulltext\">https://jmd.amjpathol.org/article/S1525-1578(18)30291-5/fulltext</a>: 'high confidence (definition: likely TP); low confidence (definition: likely FP); intermediate confidence (definition: probably TP but may need confirmation). This would be just an example value set, to let us get more experience with it.</p>",
        "id": 169399894,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1561991308
    },
    {
        "content": "<p>I agree the confirmation and confidence concepts are different and think both should be included, particularly since our IG currently gives no guidance in how to represent any of that info elsewhere and it could solve computable needs right now</p>",
        "id": 169402153,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1561992842
    },
    {
        "content": "<p>I was originally thinking we could just add \"confirmed\" as another answer in the confidence value set...</p>",
        "id": 169402268,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1561992929
    },
    {
        "content": "<p>I can't make the FHIR subgroup today, but we just need a proposal to review.  I will admit to being a bit nervous about introducing a new(ish) concept this late in the game, but if we can identify a straightforward proposal, and soon, I don't see why we couldn't vote on it.</p>",
        "id": 169402468,
        "sender_full_name": "Kevin Power",
        "timestamp": 1561993068
    },
    {
        "content": "<p>Proposal tweaked on call today:</p>\n<p>To keep it as simple as possible to cover the use cases of specifically stating a variant is confirmed and/or in a high confidence area deemed not needing confirmation, we could add a single \"Confirmation\" component to variant. Example Answer list would contain \"Sanger\", \"MLPA\", \"not needed\" (High confidence true positive), \"needed\" (likely needs confirmation), and \"unknown\". May want to link with others from our current (extensible) observation.method list: <a href=\"https://r.details.loinc.org/AnswerList/LL4048-6.html\" target=\"_blank\" title=\"https://r.details.loinc.org/AnswerList/LL4048-6.html\">https://r.details.loinc.org/AnswerList/LL4048-6.html</a></p>",
        "id": 169432808,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1562016463
    },
    {
        "content": "<p>It may be more natural to split it into 2 components, 1 for confirmationMethod and one for confirmationStatus. Thoughts?</p>",
        "id": 169433241,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1562016893
    },
    {
        "content": "<p>Interestingly, that answer list just has 'sequencing' that includes Sanger - so certainly would need to be extensible.  But otherwise, I think a component called Confirmation Method sounds good.</p>\n<p>Regarding Confirmation Status, I guess we just need to concretely define what the answer list would be?  </p>\n<p>Did the FHIR subgroup still want to recommend components of Variant for these, or a separate profile that references Variant?</p>",
        "id": 169436940,
        "sender_full_name": "Kevin Power",
        "timestamp": 1562020238
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> You seemed to like the separate profile approach.  I can see the simplicity of just having new component(s) on Variant.  In short, I am torn between our options.</p>",
        "id": 169437277,
        "sender_full_name": "Kevin Power",
        "timestamp": 1562020630
    },
    {
        "content": "<p>I agree: having confirmation method and status as separate components seems to be cleaner.But these two items are clearly linked together which is not possible with one component.</p>",
        "id": 169467250,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1562060939
    },
    {
        "content": "<p>We could solve this with an invariant.</p>",
        "id": 169467264,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1562060954
    },
    {
        "content": "<p>Or we could say that a variant conformation should be its own profile on Observation.</p>",
        "id": 169467398,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1562061116
    },
    {
        "content": "<p>This is on the agenda for today's meeting, so we can review our options.</p>",
        "id": 169484722,
        "sender_full_name": "Kevin Power",
        "timestamp": 1562077204
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>  any consensus on this?</p>",
        "id": 170649258,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1562862852
    },
    {
        "content": "<p>I am afraid we don't have a consensus yet. <span aria-label=\"frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"frown\">:frown:</span> I hope this one is a topic next Monday / Tuesday.  But of course, we always welcome additional input, ideas, or proposals</p>",
        "id": 170676325,
        "sender_full_name": "Kevin Power",
        "timestamp": 1562882231
    },
    {
        "content": "<p>we discussed this during the last FHIR call:<br>\n<a href=\"https://docs.google.com/document/d/1FGCQRtxJKyHhnC1uB_t4sJZ9yXbLMGOqPXHPr5tSLLQ/edit#bookmark=id.o5puo7wbprdm\" target=\"_blank\" title=\"https://docs.google.com/document/d/1FGCQRtxJKyHhnC1uB_t4sJZ9yXbLMGOqPXHPr5tSLLQ/edit#bookmark=id.o5puo7wbprdm\">https://docs.google.com/document/d/1FGCQRtxJKyHhnC1uB_t4sJZ9yXbLMGOqPXHPr5tSLLQ/edit#bookmark=id.o5puo7wbprdm</a></p>",
        "id": 171081378,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1563372442
    },
    {
        "content": "<p>and had three options:</p>\n<ul>\n<li>1 component</li>\n<li>2 components </li>\n<li>its own observation profile</li>\n</ul>",
        "id": 171081421,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1563372480
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> thanks for discussing this.  I am currently including this as a note element in Variant.  If CG roadmap includes treating variant as more of a KB item, then including confirmation as a component in variant probably voids future proofing.  I am now leaning more towards an Observation profile.<br>\nRe Clem's comment,  while we report only on confirmed variants for clinical reports, we can report without confirmation for research reports.</p>",
        "id": 174934190,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1567642331
    },
    {
        "content": "<p>Interesting article I just read, describing the Medical Genome Initiative (<a href=\"https://genomemedicine.biomedcentral.com/articles/10.1186/s13073-020-00748-z\">https://genomemedicine.biomedcentral.com/articles/10.1186/s13073-020-00748-z</a>). From the article \"The themes of analytical validity, clinical utility, data infrastructure, and test interpretation and reporting emerged as areas where this guidance was most needed\". I wonder if they might be a good group to talk to, if we try to tackle a representation of analytic validity.</p>",
        "id": 203455533,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1594338144
    },
    {
        "content": "<p>confidence in the a call is a quality statement about the methodology. 1) Why is would a Clinical  Lab report a low confidence variant?  2) Is this low confidence in the call that there is a variant? OR low confidence that the sequencing  method  actually detected nucleotide over the relevant positions for the variant?  Keep it simple.  A component  is appropriate to me ,  confidence is a qualifier - NOT an independent observation.</p>",
        "id": 205113835,
        "sender_full_name": "Bret H",
        "timestamp": 1595855063
    },
    {
        "content": "<p>Wondering if we can revisit this. We have a scenario where we'll be receiving a raw VCF file plus a separate file showing those variants that have past some type of confirmatory testing. We are exploring the use of both files in a decision support pipeline, but need to differentiate those that are / are not confirmed. I'd like to propose something relatively simple for starters, that we add a 'variant-confirmation-status' component, with HIGH/INTERMEDIATE/LOW values: </p>\n<p>variant-confirmation-status</p>\n<ul>\n<li>HIGH: High confidence true positive variant call. Suitable for clinical reporting.</li>\n<li>INTERMEDIATE: Candidate true positive variant call. Unable to confirm without additional testing.  </li>\n<li>LOW: High confidence false positive variant call.</li>\n</ul>",
        "id": 219892566,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1607975038
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span> - Any publicly available value set we could try to leverage? I am betting the answer is no, but just wondering if we should look.</p>",
        "id": 220009111,
        "sender_full_name": "Kevin Power",
        "timestamp": 1608051663
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> Not that I know of.  The HIGH/INTERMEDIATE/LOW was inspired by this article [https://www.jmdjournal.org/article/S1525-1578(18)30291-5/pdf], which includes this picture: <a href=\"/user_uploads/10155/qHAijed8pGcM5KqvQ34h6Saz/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/qHAijed8pGcM5KqvQ34h6Saz/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/qHAijed8pGcM5KqvQ34h6Saz/image.png\"></a></div>",
        "id": 220010295,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1608052139
    },
    {
        "content": "<p>If the group can review that article and feels the options are good, then that is good enough for me. When I ask about a value set, I don't necessarily mean \"a pre-existing, codified list of values\" (though that is always great). But maybe better stated question would be \"is there a list of answers from a reputable source?\"  Often times a list proposed in an article from a well regarded source is perfectly fine for input.</p>",
        "id": 220016094,
        "sender_full_name": "Kevin Power",
        "timestamp": 1608054602
    },
    {
        "content": "<p>Can/should we marry this with guidance on how to declare a variant already confirmed?</p>",
        "id": 220017284,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1608055109
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> not sure I'm following. Can you expand on that a bit?</p>",
        "id": 220017404,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1608055177
    },
    {
        "content": "<p>Would we suggest labs to use this component to mark confirmation status where they did orthogonal testing? Could a fourth value of \"confirmed\" work?</p>",
        "id": 220017569,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1608055240
    },
    {
        "content": "<p>I was thinking that if a lab did orthogonal testing, they would use a value of HIGH.</p>",
        "id": 220017691,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1608055295
    },
    {
        "content": "<p>I do wonder if we need to represent  'variant-confirmation-method' in some way?</p>",
        "id": 220027206,
        "sender_full_name": "Kevin Power",
        "timestamp": 1608059540
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> I think I'm kinda neutral on the need to represent variant-confirmation-method in that I just need to know that the lab considers it confirmed. That said, I don't mind adding it if others need it.</p>",
        "id": 220052121,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1608071286
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span> -- So, we have this in the backlog: <a href=\"https://jira.hl7.org/browse/FHIR-19829\">https://jira.hl7.org/browse/FHIR-19829</a><br>\nIt came from <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> so perhaps we need to get her take on this for the value set, and if method is really required?</p>",
        "id": 220054768,
        "sender_full_name": "Kevin Power",
        "timestamp": 1608072710
    },
    {
        "content": "<p>In my mind they are 2 separate requests, one to support listing confirmation test method and one to flag unconfirmed results as high confidence. Mullai's use cases could be approximate by using 'high' for confidence level, but that list would really be built from the perspective of a computational analysis rather than a separate test.</p>",
        "id": 220055106,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1608072886
    },
    {
        "content": "<p>Our use case does two things - indicate the confirmation method and result of the confirmation. The primary intent is to communicate that the variant was confirmed.<br>\nRegarding the other use case mentioned by <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span> - flag unconfirmed results as high confidence- we typically don't do that in a final report, only confirmed variants are resulted in a final report. However, a preliminary report might list a variant that is not confirmed yet.  The preliminary report will eventually be overridden by a final report.</p>",
        "id": 220179332,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1608156144
    },
    {
        "content": "<p>Is anything other than Sanger confirmation/testing used routinely? And can it be assumed that we don't need to give the primer set? Also, wouldn't confirmation testing be part of the 'package' of the method of the lab? How deep do you need to have the report go? The simplicity of High/Intermediate/Low as reported by the lab is easy to use. It requires trusting the lab's determination. In practice, how is the method description of the confirmation testing used? Does a person use it in decision making?</p>",
        "id": 228598794,
        "sender_full_name": "Bret H",
        "timestamp": 1614781185
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> , I will add this item back to the agenda for the Apr 06th  meeting so that we can get more feedback.  Our lab primarily uses Sanger for SNPs and MLPA for CNVs.  Yes, confirmation testing is part of the package. The report is rather light - all we indicate is \"Confirmed by Sanger sequencing\" for the variant. We do not use High/Intermediate/Low; I see that the confidence status is optional (variant-confidence-status (0..1)), with our current pipeline, we will very likely not include the confidence status field.</p>",
        "id": 232945030,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1617393782
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  <span class=\"user-mention\" data-user-id=\"196553\">@Jamie Jones</span>  I might be spacing out. Jira 19829 shows that we added a new component variant-confidence-status, and I could have sworn it was there, but now I don't see it in the latest build.</p>",
        "id": 268091150,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1642205600
    },
    {
        "content": "<p>Well it would seem it didn’t get applied for some reason. I will try to knock it out</p>",
        "id": 268092138,
        "sender_full_name": "Kevin Power",
        "timestamp": 1642206525
    },
    {
        "content": "<p>Thanks Kevin</p>",
        "id": 268093740,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1642208094
    },
    {
        "content": "<p>Yes it should be in</p>",
        "id": 268093921,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1642208266
    },
    {
        "content": "<p>This has been applied:</p>\n<p>HL7/genomics-reporting: master rebuilt<br>\nCommit: <a href=\"http://jira.hl7.org/browse/FHIR-19829\">FHIR-19829</a></p>\n<p>Add new CS and VS for variant confidence status<br>\nAdd component slice to Variant profile<br>\nAdd documentation to Variant Reporting<br>\nAdd examples<br>\n(also includes a minor QA fix to remove errors of duplicate resource names where title text between parens is ignored)<br>\n(Kevin Power) <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span></p>",
        "id": 268131149,
        "sender_full_name": "Kevin Power",
        "timestamp": 1642261057
    },
    {
        "content": "<p>I did apply it directly to master, but welcome everyone to review and provide some feedback. I will admit I am not really crazy about my attempt of documentation on the Variant Reporting page.</p>",
        "id": 268131212,
        "sender_full_name": "Kevin Power",
        "timestamp": 1642261135
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191913\">Kevin Power</span> <a href=\"#narrow/stream/179197-genomics/topic/Sanger.20confirmation.2Ftesting/near/268131212\">said</a>:</p>\n<blockquote>\n<p>I did apply it directly to master, but welcome everyone to review and provide some feedback. I will admit I am not really crazy about my attempt of documentation on the Variant Reporting page.</p>\n</blockquote>\n<p>Kevin - I looked on the new Variant Reporting page....  below is a suggested \"improved version\" (hopefully).  I just edited for clarity and ease of reading...  please feel free to ignore if you don't agree with these edits.. </p>\n<p>Variant confidence status provides a way to indicate the reporting organization’s confidence that the variant is truly positive. Noting the confidence level may be important in the overall interpretation of the variant and related implications. Confidence is noted as High, Intermediate or Low. The following example shows how to express a high variant confidence:</p>\n<p>It is important to note that variant confidence status is not a required component. If the reporting organization’s confidence levels are not structured in a way that it can be reported using this standard coding system, implementers must determine other ways to ensure that confidence in a variant call is understood. For example, a laboratory might only send structured variants when the confidence is 'high' that they are truly positive.</p>",
        "id": 268315597,
        "sender_full_name": "Arthur Hermann",
        "timestamp": 1642453839
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"196476\">@Arthur Hermann</span> - I made these changes and you can see them here:<br>\n<a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/branches/master/sequencing.html#variant-confidence\">http://build.fhir.org/ig/HL7/genomics-reporting/branches/master/sequencing.html#variant-confidence</a></p>",
        "id": 268396195,
        "sender_full_name": "Kevin Power",
        "timestamp": 1642515341
    }
]