[
    {
        "content": "<p>All feedback welcome: (attn <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> )</p>\n<p><a href=\"https://docs.google.com/document/d/10BdwflZG2AXEj0WcMVIXQ-aIK-R4H7JaTLPQlQn98is/edit#heading=h.pmlg6i9o8epo\" target=\"_blank\" title=\"https://docs.google.com/document/d/10BdwflZG2AXEj0WcMVIXQ-aIK-R4H7JaTLPQlQn98is/edit#heading=h.pmlg6i9o8epo\">https://docs.google.com/document/d/10BdwflZG2AXEj0WcMVIXQ-aIK-R4H7JaTLPQlQn98is/edit#heading=h.pmlg6i9o8epo</a></p>",
        "id": 153977688,
        "sender_full_name": "Kevin Power",
        "timestamp": 1532457119
    },
    {
        "content": "<ul>\n<li>The bindings makes it specific to only CG so would not be a general Observation extension - but that is OK.</li>\n</ul>",
        "id": 153977694,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532461967
    },
    {
        "content": "<ul>\n<li>The cardinality should be 0..1 right?</li>\n</ul>",
        "id": 153977695,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532461994
    },
    {
        "content": "<p>We didn't feel qualified to decide if it should apply to a general Observation, so decided to scope it down to our use case.  </p>\n<p>RE: Cardinality - It is possible labs might want to reference their own definitions of what makes a 'secondary findings', or we might have other bodies (like European Society of Human Genetics <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3660957/\" target=\"_blank\" title=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3660957/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3660957/</a>) who publish their own guidelines.  In either case, it is possible a variant might be shared due to more than one policy / guideline.</p>",
        "id": 153977696,
        "sender_full_name": "Kevin Power",
        "timestamp": 1532462184
    },
    {
        "content": "<p>As the DataType is CodeableConcept 0..1 should be fine. The different CodeSystems then will fit into CodeableConcept.Coding, which is 0..*</p>",
        "id": 153977860,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1532515022
    },
    {
        "content": "<p>My only concern is that is that a single CodeableConcept/multiple coding setup implies the codings are really the same concept, just from different termonolgies. That may not be the case here - as the different policies/guidelines referenced might be defined differently?  Not sure when (or if) that will become an issue.</p>",
        "id": 153978005,
        "sender_full_name": "Kevin Power",
        "timestamp": 1532545450
    },
    {
        "content": "<p>It doesn't imply that they're the same concept, it implies that they're all encodings of the same concept.  The granularity/expressiveness could be different, but they're all describing the \"whole\" concept at some level of granularity.  So \"dog\", \"miniature poodle\", \"mammal\" would all be valid codings for my dog and could all be codings within the same codeable concept.  However, \"black\", \"furry\" and \"high-strung\" would not be appropriate codings within a single CodeableConcept because they aren't all trying to represent the same concept - they're describing different aspects.</p>",
        "id": 153978006,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532545798
    },
    {
        "content": "<p>It seems that Lloyd's original tracker (<a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15823\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15823\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15823</a>) was approved today by O&amp;O. Can someone confirm if the plan is to add the extension to base Observation or instead to one of the profiles in the CG IG? <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 153981087,
        "sender_full_name": "Kevin Power",
        "timestamp": 1533238939
    },
    {
        "content": "<p>Base observation - it won't just be for us.</p>",
        "id": 153981119,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533239846
    },
    {
        "content": "<p>I.e. it'll be a 'core' extension.</p>",
        "id": 153981120,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533239846
    },
    {
        "content": "<p>OK - The 'secondary-finding' as proposed is VERY genomics specific, which is why in the google doc I suggested tying it to one of the CG profiles in our IG. I don't really have a problem with it being on a core extension, but I don't feel it will be very broadly applicable as proposed today.</p>",
        "id": 153981283,
        "sender_full_name": "Kevin Power",
        "timestamp": 1533249826
    },
    {
        "content": "<p>Ah.  The name and the definition/binding don't seem to jive in terms of specificity...</p>",
        "id": 153981319,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533251944
    },
    {
        "content": "<p>ACMG refers to \"secondary findings\", hence why I chose the name.  And I really like the classification called out in page 3 of this document and the it's distinction of \"incidental\" versus \"secondary\": <a href=\"https://bioethicsarchive.georgetown.edu/pcsbi/sites/default/files/Clinician%20Primer%20Incidental%20Findings%2010.30.16.pdf\" target=\"_blank\" title=\"https://bioethicsarchive.georgetown.edu/pcsbi/sites/default/files/Clinician%20Primer%20Incidental%20Findings%2010.30.16.pdf\">https://bioethicsarchive.georgetown.edu/pcsbi/sites/default/files/Clinician%20Primer%20Incidental%20Findings%2010.30.16.pdf</a><br>\nSo if there is a mismtach now, how do we best resolve it?  Move the extension to one of our profiles (my preference)?  Broaden the definition and leave it where it is?  Other?</p>",
        "id": 153981797,
        "sender_full_name": "Kevin Power",
        "timestamp": 1533302678
    },
    {
        "content": "<p>If it's specific to genetics, then call it genetic-secondary-finding or something like that.</p>",
        "id": 153981807,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533307022
    },
    {
        "content": "<p>(If we feel that this concept is truly limited to genetics)</p>",
        "id": 153981808,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533307033
    },
    {
        "content": "<p>please... NO... secondary findings are very common with many tests.</p>",
        "id": 153981812,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533307183
    },
    {
        "content": "<p>I thought so, but I got pushback from OO for even proposing the notion.  They seemed to feel that all other secondary findings were handled as reflex tests, which are flagged by other means.</p>",
        "id": 153981813,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533307275
    },
    {
        "content": "<p>has that been reviewed by the Radiology domain? They have secondary findings all the time.   <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> <span class=\"user-mention\" data-user-id=\"191960\">@Brad Genereaux</span> ?</p>",
        "id": 153981816,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533307428
    },
    {
        "content": "<p>The extension as currently defined is focused on genetics - so if we want to broaden the definiiton, we will certainly have to re-work the current proposal.  For genetics, it is important to have the ability to indicate the \"why\" behind this result being delivered - as in, this variant is related to the ACMG guidelines.</p>",
        "id": 153981818,
        "sender_full_name": "Kevin Power",
        "timestamp": 1533307677
    },
    {
        "content": "<p>Im trying to ask that we not do this in a genomics specific way...  the result would then be special extensions for all other modalities (blood work secondary findings, x-ray secondary findings, ecg secondary findings, etc...), and that would not be helpful overall. I know that genomics is special... but not really</p>",
        "id": 153981820,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533307862
    },
    {
        "content": "<p>The idea of using the same extension regardless of modality is fine with me, but I suppose it might depend on the requirements of the other modalities.  I would be happy to work with anyone on the topic to define a more widely applicable solution.</p>",
        "id": 153981822,
        "sender_full_name": "Kevin Power",
        "timestamp": 1533308068
    },
    {
        "content": "<p>I think it's not clear if we're all thinking of the same thing when we talk about \"secondary findings\" (even when it's specific to the laboratory reporting context).  It seems that there wasn't sufficient clarity and agreement to be able to move forward with this as a core Observation element, so my suggestion was to agree to add the genetics-specific extension as proposed in the Google doc.  We can then get experience with this and if it seems that the need is actually more general then we can consider broadening it and adding it to core in a future release.  I don't quite agree with Lloyd's characterization that OO \"seemed to feel that all other secondary findings were handled as reflex tests\".  That's definitely not the case, but the issue was rather around what is and isn't a \"secondary finding\", as I mentioned before, and what the implications would be of a lab labeling a \"result\" as a \"secondary finding\" (i.e. what are the expectations around how and how much the clinician needs to consider the finding in the care of the patient).  The extension for genomics is a way to move this forward and gain experience.</p>",
        "id": 153981824,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1533309265
    },
    {
        "content": "<p>okay, then please put a note into the extension expressing this and asking for broad review. That is a fine position in my view for right now.</p>",
        "id": 153981839,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533310729
    },
    {
        "content": "<p>Are there even secondary findings on an observation? Or are these separate observations? I certainly understand a DiagnosticReport containing primary and secondary findings/observations, but I'm not sure I agree that an observation itself can have a secondary finding.</p>",
        "id": 153981862,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1533316615
    },
    {
        "content": "<p>This proposal was to make an extension that indicates when a particular observation is a secondary finding.  It would be referenced from a DiagnosticReport.results along with all primary findings.</p>",
        "id": 153981864,
        "sender_full_name": "Kevin Power",
        "timestamp": 1533317188
    },
    {
        "content": "<p>Ah, a \"flag\" on the observation, not additional findings in the observation. Got it. That makes more sense.</p>",
        "id": 153981866,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1533317550
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Between a genomics-specific extension, and making it a core element, we have the option of a core extension.</p>\n<p>As John says, secondary/incidental findings are common in Radiology. (Yup, patient cracked a vertebrae, and oh, by the way, there's a nodule on the lung you might want to follow up on.) My initial thoughts are yes, this would be useful to be able to record. I'm not sure if recording it in the observation or on the report is correct, i.e. a particular observation is/isn't incidental vs. these are the primary findings and these are the secondary. Is there value in knowing an observation is incidental when referenced on its own, or in the absence of having a report; or does it only become meaningful in the context of a report? I expect there is value knowing it independent of a report, but don't immediately have a use case.</p>\n<p>I would suggest we make this a core extension on observation, and see how the community reacts. I'm not sure about unsolicited vs. incidental vs. secondary terminology. And we should be clear about interpretation when absent.</p>",
        "id": 153981873,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1533319385
    },
    {
        "content": "<p>What I was thinking (but probably didn't actually say) was a standard (core) extension that addresses the genomics use case.  If it's straightforward enough for it to include other use cases as well, then I'm fine with that.  But getting back to Kevin's comment that \"if we want to broaden the definition, we will certainly have to re-work the current proposal\", we would have to decide how much re-work is needed and is reasonable (my thought was to keep it fairly minimal).  I think the standard (core) extension is the right place to do it.  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Are you creating the extension (we didn't discuss that in OO)?</p>",
        "id": 153981885,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1533320457
    },
    {
        "content": "<p>The answer to that is: If I have to... ;)  (I.e. No offense if you're willing to take it on :))</p>",
        "id": 153981933,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533327759
    },
    {
        "content": "<p>I would welcome comments on the proposal to make it broadly applicable as a standard extension.  Make comments here:<br>\n<a href=\"https://docs.google.com/document/d/10BdwflZG2AXEj0WcMVIXQ-aIK-R4H7JaTLPQlQn98is/edit\" target=\"_blank\" title=\"https://docs.google.com/document/d/10BdwflZG2AXEj0WcMVIXQ-aIK-R4H7JaTLPQlQn98is/edit\">https://docs.google.com/document/d/10BdwflZG2AXEj0WcMVIXQ-aIK-R4H7JaTLPQlQn98is/edit</a></p>",
        "id": 153981949,
        "sender_full_name": "Kevin Power",
        "timestamp": 1533328708
    },
    {
        "content": "<p>Hi Kevin &amp; all,<br>\nmaybe i miss-understood the google document but here are my thoughts:<br>\nA secondary finding is a general abstract concept independent of CG.<br>\nIn the Google Doc, there are ValueSet Bindings to ACMG SF; these itself are using  MIM disorder numbers.<br>\nMy, maybe to trivial approach would be to have a core extension which contains a fixed code or a bound valueSet to express the fact that this observation is a secondary finding. What kind of secondary finding (e.g. BREAST-OVARIAN CANCER, FAMILIAL, SUSCEPTIBILITY TO, 1; BROVCA1 )  should be part of the observation itself.</p>",
        "id": 153982539,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1533564860
    },
    {
        "content": "<p>Therefore i currently can't see the benefit of binding to ACMG-SF-V1</p>",
        "id": 153982541,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1533564884
    },
    {
        "content": "<blockquote>\n<p>ACMG refers to \"secondary findings\", hence why I chose the name.  And I really like the classification called out in page 3 of this document and the it's distinction of \"incidental\" versus \"secondary\": <a href=\"https://bioethicsarchive.georgetown.edu/pcsbi/sites/default/files/Clinician%20Primer%20Incidental%20Findings%2010.30.16.pdf\" target=\"_blank\" title=\"https://bioethicsarchive.georgetown.edu/pcsbi/sites/default/files/Clinician%20Primer%20Incidental%20Findings%2010.30.16.pdf\">https://bioethicsarchive.georgetown.edu/pcsbi/sites/default/files/Clinician%20Primer%20Incidental%20Findings%2010.30.16.pdf</a></p>\n</blockquote>\n<p>These codes on page3 would be the correct binding for the extension (in the CG domain)</p>",
        "id": 153982542,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1533565017
    },
    {
        "content": "<p>You are suggesting the codes be:<br>\nIncidental Finding: Anticipatable<br>\nIncidental Finding: Unanticipatable<br>\nSecondary Finding<br>\n?</p>",
        "id": 153982560,
        "sender_full_name": "Kevin Power",
        "timestamp": 1533566502
    },
    {
        "content": "<p>yes, for completeness we could add Primary Finding as well. Maybe other domains also have their \"special codes\" for SF and would add them.<br>\nIn the end we would have a ValueSet with all needed code to express different kinds of \"secondary findings\"</p>",
        "id": 153982567,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1533566635
    },
    {
        "content": "<p>I like those definitions, but not the examples -- I'd much rather have four examples on the same test. <br>\nDo we really want to the ability for sites to extend this list? A fixed list would simplify processing. An implementation could always put an extension on this extension if they want to categorize \"secondary\" further. Or we add an optional element for a more specific code, but have one element that only has (primary, secondary, incidental: anticipatable, incidental: unanticipatable). <br>\nAlthough, having just argued for a fixed list, I'd suggest we make the values heirarchical, and add one more:</p>\n<ul>\n<li>primary</li>\n<li>secondary</li>\n<li>incidental<ul>\n<li>incidental: anticipatable</li>\n<li>incidental: unanticipatable</li>\n</ul>\n</li>\n</ul>",
        "id": 153983230,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1533660439
    },
    {
        "content": "<p>That list seems reasonable to me.  I don't have a preference in flat versus heirarchical.  I think as long as we (CG) can add an extension to the extension to further categorize Secondary, we should be covered.</p>",
        "id": 153983278,
        "sender_full_name": "Kevin Power",
        "timestamp": 1533667175
    },
    {
        "content": "<p>Hierarchy allows you to sy \"incidental\" without commenting on whether it's anticipatable or not</p>",
        "id": 153983284,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533667417
    }
]