[
    {
        "content": "<p>At the WGM, we discussed the following tracker:<br>\n<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14044\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14044\">14044</a> / Clarify Sequence.structureVariant fields<br>\nThe group has some general confusion around how this data structure is to be used?  If Sequence is a way to encode a sequence, it doesn't seem like structureVariant has enough information for that purpose.  It seems we either need to be more detailed, or perhaps remove it until needed.  Does anyone have input?</p>",
        "id": 154006790,
        "sender_full_name": "Kevin Power",
        "timestamp": 1539024549
    },
    {
        "content": "<p>I'm by no means an expert on study of structural variants but from an outside perspective, I think being able to say \"the observed sequence is like the the reference sequence up to structural differences\" makes sense to me. Not sure what the real use cases for structural variants are here, and exactly what information is needed to be represented for them, but I feel we should start there if possible.</p>\n<p>I know applying tracker 16249 will add a codeableConcept with LOINC 48019-4 (DNA Change Type) to Sequence as structuralVariant.type, does this address the immediate concern?</p>",
        "id": 154006847,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1539029993
    },
    {
        "content": "<p>I think that helps, but the current structure only talks about \"where did I find something\", but gives nothing about \"oh, here is what I found\" - I think adding the change type will help that, but we are still missing things.</p>",
        "id": 154006861,
        "sender_full_name": "Kevin Power",
        "timestamp": 1539030990
    },
    {
        "content": "<p>An example of a structural variant from our molecular tumor board: </p>\n<p><strong>TMPRSS2-ERG</strong> = The fusion gene (ERG exon 2 with TMPRSS2 exon 1) has prognostic significance in prostate CA and indicates a worse prognosis.</p>\n<p>Variant: Deletion ( chr21:39878474_42874496)<br>\nTranscript: NM_001243429.1 and NM_001135099.1<br>\nInfluence on protein level: activating<br>\nRef. (PMID): 26880803 ; 20586617 ; 25728532</p>",
        "id": 154006961,
        "sender_full_name": "Dora Walter",
        "timestamp": 1539076959
    },
    {
        "content": "<p>as far as I understood the purpose of the sequence resource (representing a string of basepairs (or amino acids in a compact manner), I am not sure if structural variant is required since any complex mutation can be also represented as an insertion and deletion e.g. a Translocation of a large junk of DNA. A translocation can result in a gene fusion but this would be described in a genetic observation since it is kind of a \"interpretation\" of the mutation. I still don't fully understand the potential relations between the sequence resource and all the possible genetic-observation profiles.</p>",
        "id": 154007416,
        "sender_full_name": "Gideon Giacomelli",
        "timestamp": 1539183614
    }
]