[
    {
        "content": "<p>CG'ers - Since it is a constant topic now days, and we  have the R4 dates looming  to hit with any changes to the Sequence resource - I have put together a comparison document.  We can start coming up with some alternatives and discussions, but wanted to see if this format made sense.  Of course, welcome any and all feedback:<br>\n<a href=\"https://docs.google.com/spreadsheets/d/1z4DodoLYawW-s0jbFKQg_xpwir8rEORkNjMfemvqxE0/edit#gid=0\" target=\"_blank\" title=\"https://docs.google.com/spreadsheets/d/1z4DodoLYawW-s0jbFKQg_xpwir8rEORkNjMfemvqxE0/edit#gid=0\">https://docs.google.com/spreadsheets/d/1z4DodoLYawW-s0jbFKQg_xpwir8rEORkNjMfemvqxE0/edit#gid=0</a></p>",
        "id": 153982829,
        "sender_full_name": "Kevin Power",
        "timestamp": 1533594638
    },
    {
        "content": "<p>we just discussed this topic in the weekly call and there are quite some open issues how to proceed and come to a common understanding. For me the purpose of the sequence resource is not clearly understood. Should it represent sequence data or also mutations which is also covered quite well by observations right now. Anyway it looks like this will be a topic in baltimore to be discussed</p>",
        "id": 153995779,
        "sender_full_name": "Gideon Giacomelli",
        "timestamp": 1536682051
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"196701\">@Gideon Giacomelli</span>  - Sorry I missed the call today, but good to hear some conversation was started.  I think of Sequence like this: It represents the Sequence data, but it has a variety of ways that it can represent the sequence such that a consumer should be able to create it.  To answer your question about \"mutations\" - given a reference sequence, and list of a variants, someone should be able to take that reference, apply the variants, and come up with the sequence.  So, the list of 'variants' on the Sequence resource is really a short cut to sending the full sequence.</p>\n<p>I am fairly sure that is right, but welcome <span class=\"user-mention\" data-user-id=\"191719\">@Gil Alterovitz</span> or <span class=\"user-mention\" data-user-id=\"196553\">@James Jones</span>  (or I suppose anyone listening on <a class=\"stream\" data-stream-id=\"179197\" href=\"/#narrow/stream/179197-genomics\">#genomics</a>) to weigh in.</p>",
        "id": 153995799,
        "sender_full_name": "Kevin Power",
        "timestamp": 1536687023
    },
    {
        "content": "<p>I totally agree, as a consumer of a Genetic Diagnostic Report (e.g. Practicioner in a Hospital) i don't care about the Sequence, i only want to know the variants compared to the reference sequence. These will be described variants.<br>\nSequences would be needed in Bioinformatics or inside a Lab i suppose.</p>",
        "id": 153995824,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1536689209
    },
    {
        "content": "<p>That is true, but we do need to consider other use cases where the sequence data is important.</p>",
        "id": 153995853,
        "sender_full_name": "Kevin Power",
        "timestamp": 1536692418
    },
    {
        "content": "<p>i know, i just wanted to explain the clinical use case. I‘m super interested in other usecases which have the need for the actual sequence itself.</p>",
        "id": 153995881,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1536695067
    },
    {
        "content": "<p>Kevin is absolutely right here, sorry for the delayed response. The variant information on sequence was included as an alternate method to describe the sequence. Rather than building it from scratch you could say \"It's <em>this</em> reference/other sequence, but with <em>these</em> variants\". I do think this should be made clearer on the resource documentation itself, particularly now that there are dedicated variant profiles, etc.</p>",
        "id": 153997073,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1536944650
    },
    {
        "content": "<p>When considering the desire to be able to encapsulate and send VCF file data to certain places in FHIR, I wonder if we should be looking to extend the sequence resource here rather than restrict it further and use the heavier observations and clunky attachments from other specs.</p>\n<p>That may be totally out of scope for now, but we have the opportunity to keep all of the \"specialized\" genomics data we want to send in the custom resource in a concise way, rather than in bulky observations to users who won't need to look at it.</p>",
        "id": 153997644,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1537287092
    },
    {
        "content": "<p>I would like to propose we separate those two things - As we talked, I could see value in having a home for sending the VCF file basically as something simple like an attachment.  Like <span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> stated, the VCF is such a \"common currency\" in this field that I can see value in us supporting it in a very basic (and optional) way.</p>\n<p>While the conversation started as \"could a VCF replace Sequence?\", I feel like we moved away from that being a possibility.  There are still things that Sequence can do today that would not be covered by a VCF.  So, we still need to grapple with the Sequence / Observation overlap discussion.</p>\n<p>Is it worth our time to evaluate what that \"bulky observation\" approach might look like? Can we say for sure it is bulkier?  I will have to admit I have let myself believe it is, for what seem like good reasons.  But perhaps it is worth a determination of how much bulkier is it? And \"bulkiness\" wouldn't be the only criteria we should consider.</p>",
        "id": 153997652,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537288850
    },
    {
        "content": "<p>Observation is absolutely bulkier and less elegant than Sequence.  If that were the sole consideration, Observation profiles would never have been on the table.  The issue is our ability to propagate data to (and more importantly through) systems that are not going to be designed with genetics in mind.  If you imagine data coming from genomic specific software and then propagating information into a lab's generic reporting software, then sent as a diagnostic report to an EHR, then uploaded into a patient's Apple phone, then downloaded into another EHR where it'll be looked at by someone like Bob Dollin, then made available to a genetics-aware decision support system, what are the chances the decision support system is going to have the data it needs in each of the two scenarios: all data is represented using (bulkier) Observations or all data is represented using the more concise Sequence?  </p>\n<p>I think the answer is clear that data propagation is much more likely to be successful using Observations.  We <em>can</em> choose to go with both approaches, where \"key\" information is made available through Observation and more detailed information is only shared using Sequence.  The question then is \"What information are Bob and the CDS system ok with not having access to?\"</p>",
        "id": 153997655,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537289515
    },
    {
        "content": "<blockquote>\n<p>The question then is \"What information are Bob and the CDS system ok with not having access to?\"</p>\n</blockquote>\n<p>Or, is the appropriate framing - \"What information are Bob and the CDS system ok with not have access to <em>via Observation and take extra steps to get from Sequence?</em>\"</p>\n<p>I think it is clear that to get <em>and utilize</em> this data (even our Observation profiles) will take a genomics aware system.</p>",
        "id": 153997671,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537291146
    },
    {
        "content": "<p>I am confused as to where the breakdown in propagating data stored in a sequence resource happens in the Lloyd's example. We seem to be assuming that all of the multiple (arbitrarily deeply) nested observation profiles hanging off a diagnosticReport will make it through okay, but not our custom FHIR resources they reference? What about references to Device profiles and other lower-maturity resources?</p>",
        "id": 153997698,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1537292480
    },
    {
        "content": "<p>Device will be more common than Sequence as many Observations are specifying the used Device.<br>\nThe DiagnosticReport and the Observations can be handled by most of the systems, the referenced Sequence wont make it through.<br>\nThe question to me is if information from Sequence will be important at this level (HIS, iPhone, etc.) or would they work with only describedVariants and other Observation profiles anyway.</p>",
        "id": 153997702,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537293262
    },
    {
        "content": "<p>I think in general, the \"propagation\" of data is at risk in the short term until other resources become normative or at least more mature.  Since Observation is close to normative, it has a head start.  And I agree with <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> - things like Device are more likely to be more broadly implemented.</p>\n<p>I think the comment by <span class=\"user-mention\" data-user-id=\"196553\">@James Jones</span>  about \"arbitrarily deep\" is really asking - Will systems support the relationships + all sorts of components in their \"standard\" implementation of Observation?  If that answer to that as yes, then that system would meet the \"pass through\" test.  It could at least store and maintain everything it is given, but likely not make much use of that data.</p>",
        "id": 153997703,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537293839
    },
    {
        "content": "<p>Displaying and navigating through them in a pleasant way is certainly going to benefit from further support, but I'm very surprised we are worried about any FHIR resources failing the \"pass through\" test, with their inherited base structure and standardized data types. </p>\n<p>Either way, being able to pass the sequence/quality informatics data downstream for further analysis by researchers and regulators seems very valuable, even if it won't all be directly viewed in the clinic or by the patient.</p>",
        "id": 153997714,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1537296153
    },
    {
        "content": "<blockquote>\n<p>Displaying and navigating through them in a pleasant way is certainly going to benefit from further support, but I'm very surprised we are worried about any FHIR resources failing the \"pass through\" test, with their inherited base structure and standardized data types.</p>\n</blockquote>\n<p>I might have misunderstood your earlier statement.  In short, I don't know that our group needs to worry about this level of detail.  We should base any of our thinking on the path to normative for the resources we are using and considering.</p>\n<blockquote>\n<p>Either way, being able to pass the sequence/quality informatics data downstream for further analysis by researchers and regulators seems very valuable, even if it won't all be directly viewed in the clinic or by the patient.</p>\n</blockquote>\n<p>There is value, but I still wonder where we draw the line with FHIR?  What level of detail do we model in FHIR, versus when should something like GA4GH specs take over?  I honestly don't know, but that boundary doesn't feel completely clear to me (yet).</p>",
        "id": 153997715,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537296961
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> Your interpretation of what I said was certainly a follow-up I meant to imply, and I agree on both points--thanks for the discussion!</p>",
        "id": 153997716,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1537297736
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  I'm glad to hear you say that ('boundary doesn't feel completely clear to me'), because I feel the same way, and I feel that the boundary is likely to change as we learn to leverage more detailed genomic data. I'm beginning to think that we should also be considering a set of FHIR GACS Operations, because knowing what we need returned to us from an GACS can be thought of as requirements for Sequence resource or our Observation profiles.</p>",
        "id": 153997717,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1537297832
    },
    {
        "content": "<blockquote>\n<p>I'm beginning to think that we should also be considering a set of FHIR GACS Operations, because knowing what we need returned to us from an GACS can be thought of as requirements for Sequence resource or our Observation profiles</p>\n</blockquote>\n<p>I would think a GACS would more likely want to implement something from GA4GH or other relevant spec, not FHIR?  I would expect them to do something like <a href=\"https://samtools.github.io/hts-specs/htsget.html\" target=\"_blank\" title=\"https://samtools.github.io/hts-specs/htsget.html\">htsget</a>  or other things found in the <a href=\"https://www.ga4gh.org/ga4ghtoolkit/genomicdatatoolkit/\" target=\"_blank\" title=\"https://www.ga4gh.org/ga4ghtoolkit/genomicdatatoolkit/\">GA4GH Genomic Data Toolkit</a>.  I am really concerned about FHIR taking on that level of detail.<br>\nPerhaps some of our CG / GA4GH folks could weigh in?  <span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span>  <span class=\"user-mention\" data-user-id=\"196622\">@Larry Babb</span></p>",
        "id": 153997737,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537299409
    },
    {
        "content": "<p>That's a good question, and it may be that a clinical decision support application will need to support both FHIR and htsget. From a GACS, I anticipate (at least) needing information on variants, haplotypes, genotypes, and regions studied. I'm finding that it's a bit of a learning curve, to figure out how best to extract that information from BAM/VCF, whereas FHIR GACS Operators might be more intuitive and consumable by the clinical informatics community.</p>",
        "id": 153997770,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1537301551
    },
    {
        "content": "<p>I don't know that \"extra steps\" will be an option.  The chances of you having access to the original lab or system where the sequence data existed if you're the decision-making system or the secondary EHR is pretty low.  I know in theory you could have the URL and query it RESTfully - but for that to work, you'd also have to have authorization on the original server, and that's typically hard to come by.</p>",
        "id": 153997777,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537302005
    },
    {
        "content": "<p>My expectation is that if the Sequence doesn't propagate through a system, then nothing downstream will have any mechanism to access that discrete data.</p>",
        "id": 153997778,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537302037
    },
    {
        "content": "<p>I agree that \"normative\" is one of the considerations for adoption.  But even if Sequence were going normative this round too, I think its adoption would suffer because it's such a specialized space.  <em>Everyone</em> needs Observations - and the base structure is pretty easy to manage and maps well to persistence structures almost every system has.  Sequence is a lot tougher for folks to wrap their heads around.  And few, if any, systems will have dedicated persistence layers that know how to manage that sort of structure.</p>",
        "id": 153997780,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537302199
    },
    {
        "content": "<blockquote>\n<p>whereas FHIR GACS Operators might be more intuitive and consumable by the clinical informatics community.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span>  - They will only be intuitive and consumable if we have the time to put into them to make them that way.</p>",
        "id": 153997817,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537306170
    },
    {
        "content": "<blockquote>\n<p><em>Everyone</em> needs Observations - and the base structure is pretty easy to manage and maps well to persistence structures almost every system has.  Sequence is a lot tougher for folks to wrap their heads around.  And few, if any, systems will have dedicated persistence layers that know how to manage that sort of structure.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  - While I agree with the premise that everyone needs Observations, I won't say Sequence is a lot tougher for folks to wrap their heads around.  Our current IG is not for the faint of heart, and it will take a great deal of time and research to really understand and appropriately implement.  It could be argued that if we took an approach of building a first class resources for our data, it could be significantly easier for people to understand.  That of course comes at the cost of needing every system to, from scratch, implement resources  that are different.</p>\n<p>It still feels like we can find something in between.  I still don't have a feel for where that balance is.</p>",
        "id": 153997822,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537307201
    },
    {
        "content": "<p>The IG only needs to be understood by those producing the content and those doing the decision support.  To all of the intervening systems, it's just a bunch of Observations like any other.  They don't necessarily need to understand the details.  And a generic Observation rendering tool should still get it right-enough for anyone who just wants to look at it.</p>",
        "id": 153997825,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537307440
    },
    {
        "content": "<p>BTW - A <a href=\"#narrow/stream/4-implementers/subject/Observation.20value.20attachment\" title=\"#narrow/stream/4-implementers/subject/Observation.20value.20attachment\">conversation</a> that is related to some of our discussion for those that want to follow along.</p>",
        "id": 153997826,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537307448
    },
    {
        "content": "<p>Sequence is tougher because it requires domain-specific knowledge.  Observation is just a name-value pair (or a collection of them) which tends to be easier for people to \"get\".</p>",
        "id": 153997827,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537307484
    },
    {
        "content": "<p>Also, an investment in Observation can meet lots of use-cases.  An investment in Sequence only makes sense if you're doing lots of genetic stuff.</p>",
        "id": 153997828,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537307522
    },
    {
        "content": "<blockquote>\n<p>And a generic Observation rendering tool should still get it right-enough for anyone who just wants to look at it.</p>\n</blockquote>\n<p>This probably should be the case now that I read this, but I am not sure I agree with this (specifically the \"right-enough\" comment).   I would have to think about how a generic viewing tool looking at our observations would work.</p>",
        "id": 153997832,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537307615
    },
    {
        "content": "<p>If our IG requires that a lab who wants to share <em>all</em> variants as Observations instances (WES ~ 4-5k, WGS ~ 4-5m) - I see implementors saying \"nope, sorry, my underlying data storage for observations was never intended for that\" - also receiving docs may say \"nope, sorry, my observation viewer will blow up\" and might just go back to \"where is my PDF please?\"</p>\n<p>I will admit it - I say that as an implementor whose underlying \"observation infrastructure\" won't handle that volume.  Can it handle small(ish) subsets of that?  Sure, with some tweaks, it would be fine.  However, I do <em>not</em> feel using Observations to deliver 4k (or 4m) VUSs will ever work.</p>\n<p>Hence why I go back to framing like this:<br>\n1) Observations as used for genomic data that is clinically (actionable/relevant/important/???)  <br>\n2) The CG workgroup should not define standards for bioinformatics in FHIR (or any product for that matter)<br>\n3) Sequence (or something else) (perhaps in combination of an optional VCF as an attachment) can express something in-between</p>\n<p>The lines between those groupings are still too fuzzy to me, but should ask - Does this group agree / disagree with those statements?</p>",
        "id": 153997845,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537309104
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> I think I like your heuristics, but can you expand on number 2? I do think there are opportunities for GA4GH and HL7 CG to work together,  to define, say, a translation from (relevant portions of) SAM/VCF into FHIR objects.</p>",
        "id": 153997849,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1537309466
    },
    {
        "content": "<p>I don't feel our group should be in the business the standards like BAM, FASTQ, htsget, BED, etc... anything that already has a home somewhere else.  Could we take a page from Imaging and learn how <a href=\"http://build.fhir.org/imagingstudy.html\" target=\"_blank\" title=\"http://build.fhir.org/imagingstudy.html\">ImagingStudy</a> wraps around DICOM?  Does Sequence ~= ImagingStudy, and DICOM ~= bioinformatics standards?  Maybe, I think we even mention that in previous discussions.  If that is what you mean <span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span> then perhaps there is something there.</p>\n<p>I just want us to be careful that we don't force FHIR into something where it is not needed.</p>",
        "id": 153997850,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537310742
    },
    {
        "content": "<p>I agree with #1 and #2.  I'm not clear on the value of #3.  What is the \"in-between\" use-case?  Who needs that data?  And how is it going to propagate?</p>",
        "id": 153997934,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537325593
    },
    {
        "content": "<p>I agree with #1 and #2. I also see the idea behind #3: capturing metadata of  raw data, similar to Imaging Study. The actual raw-data could then be attached as an Attachment.</p>",
        "id": 153998022,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537345784
    },
    {
        "content": "<p>What metadata is worth capturing that we're fine not propagating?</p>",
        "id": 153998078,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537363820
    },
    {
        "content": "<p>We want to propagate all relevant metadata. I meant that i can see the need of sending Sequence Metadata and embed/link the actual sequence File.</p>",
        "id": 153998095,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537365145
    },
    {
        "content": "<p>As a profiled observation or as a sequence.</p>",
        "id": 153998096,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537365187
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> - We should be careful when considering \"raw-data\" as an Attachment.  I am fairly OK with the VCF, but assuming you mean things like BAM, FASTQ, I am not OK with that.  I like the approach with Sequence.repository and referring to that raw data, but I don't think we want to use a FHIR Attachment.</p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - To be clear, by \"not propagating\", you mean \"not propagating through a system that ONLY implements Observation, DiagnosticReport, RiskAssessment, Device, etc ...\" correct?  If so, I don't think that is a fair assessment.  If we held everything to that rule, no new resource would ever be created would it?</p>\n<p>Let's start building a list of \"in-between\" uses cases.  I can provide two:</p>\n<p>1) <span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span>'s notion of \"Region Coverage and Quality\"</p>\n<p>2) Delivering all detected variants</p>",
        "id": 153998097,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537365194
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> yes i meant VCF Files, not FASTQ etc</p>",
        "id": 153998098,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537365459
    },
    {
        "content": "<p>Oy, and a 3rd \"in-between\" example (I say Oy because it is the most obvious and the real intention of Sequence today):</p>\n<p>3) Represent the actual sequence (ACTG....) that was observed</p>",
        "id": 153998099,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537365596
    },
    {
        "content": "<p>Where an existing file format is desired to use, then use DocumentReference. It can provide the metadata to any arbitrary file that has a mime-type. This is used for some proprietary formats such as WORD. It is also used for generic forms like non-FHIR xml schema, or even CSV.</p>",
        "id": 153998101,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537366471
    },
    {
        "content": "<p>The ImagingStudy resource is a very thin metadata for the deeper knowledge that can be probed and retrieved using DICOM, where the http RESTful flavor of DICOM is prefered. The structure of ImagingStudy is the basic structure of DICOM. Study-&gt;Series-&gt;Instance is a progressively deeper structure. Where all actual data lives at the instance level, but is structured within series which are structured within a study. There is also a degenerate form that just lists the key images for a purpose (like a specific Observation).</p>",
        "id": 153998102,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537366651
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> Resources reflect the data elements and data structures systems already deal with and support.  It's certainly true that the existence of resources might entice some system developers to enhance the capabilities of their systems to support a resource.  But the typical pattern is that systems simply expose the data they already have and manage using the resource appropriate to that type of data.  As a result, I expect we'll only see most systems surfacing support for the Sequence (and RiskAssessment and other more essoteric resources) if they already have a specific interest in and support for those concepts as distinct notions in their systems.  Introducing a net new resource is considerably more work - and, at in most cases, will at best happen after the low-hanging fruit of \"already supported\" concepts has been addressed and will be subject to a financial business case assessment.</p>",
        "id": 153998111,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537367646
    },
    {
        "content": "<p>And, in the worst case, implementers see Sequence, decide against &amp; rebuilt Sequence as a profile on Observation.</p>",
        "id": 153998115,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537367805
    },
    {
        "content": "<p>Now, it may be that the demand for genomics data will be sufficiently high that applications across the whole propagation pathway will prioritize introducing support for Sequence and we'll see wide support for it over a period of a couple of years rather than 10-15+.  Our decision should be informed by a realistic assessment of what labs, EHRs and organizations like Apple are committed to doing in the near-ish term.</p>",
        "id": 153998116,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537367828
    },
    {
        "content": "<p>The worst case is that implementers throw away Sequence data.</p>",
        "id": 153998117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537367846
    },
    {
        "content": "<p>Converting Sequence to Observation is a much more positive outcome - but is only a likely outcome if we define exactly what that conversion should look like and - ideally - provide tools for doing so.</p>",
        "id": 153998118,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537367898
    },
    {
        "content": "<p>There is just as likely revolt against putting the sequence within Observation as unwelcome bloat... All of these are good reasons why we go through \"Standard for Trial Use\" to see what works vs what we think might work.</p>",
        "id": 153998120,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537368032
    },
    {
        "content": "<p>so in STU it is good to have alternatives for the market to \"Trial Use\"</p>",
        "id": 153998122,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537368070
    },
    {
        "content": "<p>What if we do both? Sequence Resource including Mappings to a profiled Observation? Too much work?</p>",
        "id": 153998126,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537368241
    },
    {
        "content": "<p>A full mapping might be one path forward - and perhaps a standard operation that can handle the converstion.  That then gives implementers the choice of how to access and share the data - and it gives us a chance to evaluate what implementers are actually willing to do.</p>",
        "id": 153998147,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537368955
    },
    {
        "content": "<p>I do think it would be interesting to at least sketch out what a sequence profile of Observation would look like.  Perhaps we could do a session on that at the WGM?</p>",
        "id": 153998152,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537369155
    },
    {
        "content": "<p>As a bit of an aside, from what I understand about htsget, it doesn't simply return a VCF, but rather, just the relevant portion of VCF (or SAM, etc) - so, a much smaller package. It may be worth discussing how we envision, say, a clinical decision support application interacting with a GACS, and how it will leverage FHIR and/or htsget.</p>",
        "id": 153998162,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1537369852
    },
    {
        "content": "<blockquote>\n<p>I do think it would be interesting to at least sketch out what a sequence profile of Observation would look like.  Perhaps we could do a session on that at the WGM?</p>\n</blockquote>\n<p>Genomics sessions at the WGM is mo-we, so thursday at the wgm would be an option</p>",
        "id": 153998165,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537370146
    },
    {
        "content": "<p>I am leaving Wed evening, so Thurs would leave me out.  I would be OK taking one of our current \"FHIR Reconciliation\" blocks Tuesday or Wednesday and discussing.  Perhaps we could even have a breakout during the Connectathon to draft something, then review with the broader group Tues or Wed?</p>",
        "id": 153998166,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537370325
    },
    {
        "content": "<p>sounds great</p>",
        "id": 153998177,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537370733
    },
    {
        "content": "<blockquote>\n<p>I would think a GACS would more likely want to implement something from GA4GH or other relevant spec, not FHIR?  I would expect them to do something like <a href=\"https://samtools.github.io/hts-specs/htsget.html\" target=\"_blank\" title=\"https://samtools.github.io/hts-specs/htsget.html\">htsget</a>  or other things found in the <a href=\"https://www.ga4gh.org/ga4ghtoolkit/genomicdatatoolkit/\" target=\"_blank\" title=\"https://www.ga4gh.org/ga4ghtoolkit/genomicdatatoolkit/\">GA4GH Genomic Data Toolkit</a>.  I am really concerned about FHIR taking on that level of detail.</p>\n</blockquote>\n<p>This is a scope question.  If bioinformatics tooling is implemented as part of a clinical genomics workflow, should the scope of FHIR (which is clinical in nature) expand to include it?  If so, how far upstream should we go?</p>\n<p>My current thinking restricts the core of FHIR genomics to clinically reported results (and relevant metadata).  If there is need to support the exchange of file formats used by upstream systems, then we could find a way to connect to and leverage GA4GH (or other) specs to handle the details.</p>",
        "id": 153998197,
        "sender_full_name": "Bob Freimuth",
        "timestamp": 1537372082
    },
    {
        "content": "<p>I support this notion too, with some caveats. Let's say, for instance, I have an 'in-between' use case, which isn't addressed by an existing bioinformatics API. An advantage of a FHIR GACS Operation is that we define exactly what data we need, and leave it to the GACS to do the translation. My own feeling is that the scope of FHIR Genomics is a bit broader than clinically reported results, and should include vetted and approved clinical genomics use cases. In other words, if there is genomics data that is used by a clinical application, it is in scope for FHIR Genomics.</p>",
        "id": 153998219,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1537373424
    },
    {
        "content": "<blockquote>\n<p>Where an existing file format is desired to use, then use DocumentReference. It can provide the metadata to any arbitrary file that has a mime-type. This is used for some proprietary formats such as WORD. It is also used for generic forms like non-FHIR xml schema, or even CSV.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  - If we consider a <a href=\"https://samtools.github.io/hts-specs/VCFv4.3.pdf\" target=\"_blank\" title=\"https://samtools.github.io/hts-specs/VCFv4.3.pdf\">VCF</a>, DocumentReference doesn't feel quite right.  In our case, we will have a DiagnosticReport to track much of the context (subject, encounter ...) and metadata (status, category,  ...), so Attachment still feels right to me.  But I will admit, as discussed in the other thread, the boundaries between some of those options are pretty fuzzy to me.</p>",
        "id": 153998308,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537379734
    },
    {
        "content": "<p>VCF is one of those data types that we would previously have conveyed using Observation.valueAttachment with a reference to a Binary.  Further discussion about whether DocumentReference should/should not be used for such things should happen in the existing <a href=\"#narrow/stream/4-implementers/subject/Observation.20value.20attachment\" title=\"#narrow/stream/4-implementers/subject/Observation.20value.20attachment\">Implementer's thread</a>.</p>",
        "id": 153998311,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537380132
    },
    {
        "content": "<p>We've gotten into some slightly varied topics here and I'm partially at fault for talking about VCF data, but the question of \"where we draw the line\" with GA4GH and embedding raw bioinformatics data seems to be a concern for future enhancement requests and isn't <em>directly</em> related to the overlap between sequence and observation as it is now.</p>\n<p>Toward that end, we accepted a resolution to <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16252&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16252&amp;start=0\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16252&amp;start=0</a> on July 31st, and stated the committee is \"considering options for modifying the resource and anticipates potential changes being brought forward in an upcoming ballot\". After reading that and not seeing any other related trackers I'm a bit unsure of the immediate pressure to resolve this overlap and/or reevaluate the domain before balloting again, but here goes:</p>\n<p>Apart from the metadata, the overlap seems to be in the ability to describe variants in both places (although it's been said that in Sequence those fields are intended for defining the sequence, and are optional). My suggestion would be to have the IG state that we use observation profiles for describing variants where possible, where they can then be interpreted as parts of complex variants or haplo/genotypes. This would line up with the variant fields being restricted in the previous \"definitional\" sequence profile that we discontinued.</p>",
        "id": 153998354,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1537385024
    },
    {
        "content": "<p>I think this discussion has been good for exploring several things, so short of a concrete comment / proposal from anyone, I could see this very broad discussion being broken down like this:</p>\n<p>1 - Log a tracker to update the IG similar to what <span class=\"user-mention\" data-user-id=\"196553\">@James Jones</span> recommended - more clearly documenting when one should use Sequence.variant compared to our IG profiles (perhaps it could include other guidance as well).</p>\n<p>2 - Log a tracker for us to consider allowing a VCF to be delivered.</p>\n<p>3 - Log a tracker to consider removing Sequence.structuralVariant (I made a comment on the spreadsheet as to why I think we should consider it).</p>\n<p>4 - Maybe not a tracker, but have someone volunteer to draft guidance/thoughts on boundaries between FHIR and GA4GH (or other bioinformatic standards).</p>\n<p>5 - Not a tracker, but I would still like to workup a draft of what a \"sequence profile of Observation\" would look like to compare to what we have today and present it to the group.  I had suggested we review it at the WGM, but that might be premature.</p>\n<p>Other thoughts?</p>",
        "id": 153998393,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537395352
    },
    {
        "content": "<p>I'm happy to undertake Sequence profile of Observation, but no chance of it being done before (or at) the WGM.</p>",
        "id": 153998394,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537395498
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> I might suggest broadening 3 a bit - there may be other revisions we want to consider for Sequence (such as the representation of quality). I'm happy to help with 4.</p>",
        "id": 153998408,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1537397474
    },
    {
        "content": "<p>Perhaps #3 can stay as is, but we always welcome additional trackers to make things better.  I think your statement also overlaps a bit with #4 anyway, so welcome any drafting you would want to do.</p>",
        "id": 153998422,
        "sender_full_name": "Kevin Power",
        "timestamp": 1537400158
    },
    {
        "content": "<p>Do we want to reopen some of these discussions re: VCF here or break out a new substream?</p>",
        "id": 154022808,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1543944241
    },
    {
        "content": "<p>New please</p>",
        "id": 154022810,
        "sender_full_name": "Kevin Power",
        "timestamp": 1543944369
    }
]