[
    {
        "content": "<p>Breaking this into a new thread, here is the relevant comments:</p>\n<p>Patrick Werner: <br>\nGreat discussion so far, but the topic is getting mixed up a little, i think we should start new topics for the different discussions (e.g. region studied).<br>\nMy focus was the DiagnosticReport and how to capture panels, requests for panels and the result of a panel in a clinical context.<br>\nAfter reading/hearing all the Input i just want to provide my understanding of it:</p>\n<p>When ordering a panel i put the code for a panel in ServiceRequest.code.<br>\nISSUES:<br>\nServiceRequest.code: how to capture panelCode -&gt; list of gene codes to look at. This would be important to capture, preferably as a FHIR resource, but i can't find a fitting one.<br>\nServiceRequest.code has the cardinality: 0..1 - how do i order a \"custom panel\" -&gt; a list of gene codes to look at if only one code is allowed.<br>\nSo reporting alle studien genes and the results is possible with our profiles. Ordering a panel or a list of genes to be studied is currently not completely supported (see issues above)</p>\n<p>Lloyd McKenzie: <br>\nIn the ServiceRequest you can use the orderDetail element to refine the order (e.g. listing the specific genes of interest). In general when ordering a panel of tests though, every single test that could be resulted separately must be a separate ServiceRequest. They are linked by having a common requisition identifier. For example, if you order a custom blood panel, every test is a separate ServiceRequest, even though they're all ordered together.</p>\n<p>Patrick Werner: <br>\nThanks @Lloyd McKenzie for the explanation. So if i order a 700 gene panel i would place 700 ServiceRequests ignoring that these tests would be executed on one NGS chip? So i would never order a Panel ID - i always would place the seperated requests? Or do i misunderstand the meaning of<br>\n\"could be resulted separately ?\"</p>\n<p>Lloyd McKenzie: <br>\nYou could just order a test at the level of the panel without listing the genes at all. If you're only wanting a subset of the genes tested, whether you use different service requests or a single request with multiple orderDetails depends on where state lives. If some pieces can be resulted while others aren't (or some pieces cancelled while others aren't), you'll need separate serviceRequests. If it's one immutable order that either gets reported or doesn't, then you can have a single ServiceRequest with orderDetails listing the genes.</p>",
        "id": 153991901,
        "sender_full_name": "Kevin Power",
        "timestamp": 1535634561
    },
    {
        "content": "<p>While there are lots of things to consider here, I did want to focus on a point from  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>\n<div class=\"codehilite\"><pre><span></span>If some pieces can be resulted while others aren&#39;t (or some pieces cancelled while others aren&#39;t), you&#39;ll need separate serviceRequests. If it&#39;s one immutable order that either gets reported or doesn&#39;t, then you can have a single ServiceRequest with orderDetails listing the genes.\n</pre></div>\n\n\n<p>In my experience, for large gene panels, the lab will always report something.  So in a 700 gene panel, it is possible that there might be some pieces that are not reportable for some reason, but I don't think it is appropriate to break into 700 service requests to support a gene-by-gene reporting approach.</p>",
        "id": 153991906,
        "sender_full_name": "Kevin Power",
        "timestamp": 1535635448
    }
]