[
    {
        "content": "<p>The new 0.4 version of the TaskRecFollowup profile within the GenomicsReport seems to have a non-extensible required 1..1 code which is bound to an answer list  that has 3 options <br>\n<code>Genetic counseling recommended | Confirmatory testing recommended | Additional testing recommended</code><br>\nI do think the enhancements from the previous 0.3 version are an improvement, but it seems to be too limiting now. </p>\n<p>In my first example report I need to code the following two recommendations...</p>\n<blockquote>\n<p>It is recommended that correlation of these findings with the clinical phenotype be performed. Genetic counseling for the patient and at-risk family members is recommended.</p>\n</blockquote>\n<p>Should we be constraining the codes?</p>\n<p>Or am I able to use the code.text option instead of the bound answer list to apply the first recommendation.</p>\n<p>Ideally I would like to have it be something like this</p>\n<blockquote>\n<p>task 1<br>\n. status . requested<br>\n. intent . proposed<br>\n. code.text . \"It is recommended that correlation of these findings with the clinical phenotype be performed\"<br>\n. description . \"It is recommended that correlation of these findings with the clinical phenotype be performed. </p>\n<p>task2<br>\n. status . requested<br>\n. intent . proposed<br>\n. code.system <a href=\"http://loinc.org\" target=\"_blank\" title=\"http://loinc.org\">http://loinc.org</a><br>\n. code.code . LA14020-4<br>\n. code.display . \"Genetic counseling recommended\"<br>\n. description . \"Genetic counseling for the patient and at-risk family members is recommended.\"</p>\n</blockquote>\n<p>Any help would be appreciated.</p>",
        "id": 179997058,
        "sender_full_name": "Larry Babb",
        "timestamp": 1573006236
    },
    {
        "content": "<p>With a 'required' binding as we have today, I don't think your first task instance is valid.  I could see making the binding strength 'extensible' which would allow what you have above.</p>\n<p>Or would the correlation task also be performed by a genetic counselor?  If so, perhaps it would make sense to deliver this as a single task?  I really do not know, but wondering.</p>",
        "id": 180039284,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573051867
    },
    {
        "content": "<p>i do not know either. but i think it is safe to say that we would likely not be able to come up with a \"required\" list, regardless of how many experts we convened. making it extensible is much more reasonable, unless the author of this concept had some very specific plans which are not apparent.</p>\n<p>the other option is to forego making the \"code\" required (change it to 0..1) so that when folks want/need to simply communicate the recommendation as a descriptions string or paragraph, they can do so.</p>",
        "id": 180047028,
        "sender_full_name": "Larry Babb",
        "timestamp": 1573056266
    },
    {
        "content": "<p>Sounds like making extensible is the way to go here - do you mind logging a tracker?</p>",
        "id": 180059905,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573063569
    },
    {
        "content": "<p>just added <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=25187&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=25187&amp;start=0\">#25187</a></p>",
        "id": 180074322,
        "sender_full_name": "Larry Babb",
        "timestamp": 1573072895
    },
    {
        "content": "<p>just a generic word of caution. In Hl7v2, much of the genetic report came as comments. If the recommendation is actionable maybe consider looking at the profiles from the clinical decision support space. of course, having the genetic variant observation discreetly is a huge step. use your judgement, I'm just suggesting caution in general.</p>",
        "id": 181037856,
        "sender_full_name": "Bret H",
        "timestamp": 1574098856
    }
]