[
    {
        "content": "<p>The terminologies -&gt; code systems page has a good list of genomics code system canonical URLs. But I feel that this section should be expanded with some more details to enable good use of these code systems. For instance, I know from looking at examples that the coded value for HGNC is the id, and the display value is the gene name. But one could easily not pick up on that - and think perhaps the gene name <em>is</em> the code. There would be similar scope for misalignment in lots of the genetics code systems.<br>\nI'd love to see \"Using [genomic codesystem] with FHIR\" pages (ala 'using SNOMED with FHIR'). Is that on anyones radar? And where would that page live - does it live in the new unified genomics IG, or in the core where the terminologies are currently listed? Or should the list of genomics codesystems all move to the IG?</p>",
        "id": 153947053,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1521690027
    },
    {
        "content": "<p>it should be in the base spec, and I'll happily add stuff like that if people do the work to come to agreement - it can be hard to run it to the ground. <span class=\"user-mention\" data-user-id=\"191926\">@Joel Schneider</span></p>",
        "id": 153947077,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521697543
    },
    {
        "content": "<p>I can see some of the ways codesystems have been used in some of the CG examples - but it is hard to know if these are just ad-hoc attempts at usage or something that was the process of agreement. (guessing the former). The CSIRO has some interest in getting some of these code systems into ontoserver - at which point aligning (or driving) an official 'right way' would be useful. <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> <span class=\"user-mention\" data-user-id=\"191389\">@Alejandro Metke</span> . HPO and HGNC at least?</p>",
        "id": 153947089,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1521698119
    },
    {
        "content": "<p>well, pretty much the right way is to work from one of the fully fleshed out pages - loinc or snomedct, and for a small group of users to adapt to the code system in question, and then forward to me to add to the spec. i'll eyeball it, cross check with vocab co-chairs, and then add it with a note about it's status</p>",
        "id": 153947093,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521698197
    },
    {
        "content": "<p>You might have seen it, but I wanted to point to our new genomics reporting IG: <a href=\"http://build.fhir.org/ig/HL7/genomics-unified/index.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-unified/index.html\">http://build.fhir.org/ig/HL7/genomics-unified/index.html</a></p>\n<p>The CG examples you are seeing in core today will be different with the new IG.  Determining the right terminologies has started and we have ideas, but it needs some work to be honest, and certainly needs to be documented better.  Perhaps <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  might have more to say.</p>",
        "id": 153947179,
        "sender_full_name": "Kevin Power",
        "timestamp": 1521725918
    },
    {
        "content": "<p>I've done some exploration of how the official IMGT/HLA nomenclature could be used in a FHIR setting, as a (genomic) CodeSystem.  However, that effort has been on the back burner for a while, and is due for a few revisions.<br>\nPreliminary artifacts produced so far include a proof-of-concept terminology service, and a code system bundle:<br>\n<a href=\"http://mac-and-fhir-prototype.us-east-1.elasticbeanstalk.com\" target=\"_blank\" title=\"http://mac-and-fhir-prototype.us-east-1.elasticbeanstalk.com\">http://mac-and-fhir-prototype.us-east-1.elasticbeanstalk.com</a><br>\n<a href=\"https://s3.amazonaws.com/nmdp-fhir-terminology/who/fhir-imgt-hla-terminology-20170729.zip\" target=\"_blank\" title=\"https://s3.amazonaws.com/nmdp-fhir-terminology/who/fhir-imgt-hla-terminology-20170729.zip\">https://s3.amazonaws.com/nmdp-fhir-terminology/who/fhir-imgt-hla-terminology-20170729.zip</a><br>\nI'd be happy to have comments or discussion on this stuff, and expect to revisit it during future connectathons (hopefully May).</p>",
        "id": 153947193,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1521726951
    },
    {
        "content": "<blockquote>\n<p>You might have seen it, but I wanted to point to our new genomics reporting IG: <a href=\"http://build.fhir.org/ig/HL7/genomics-unified/index.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-unified/index.html\">http://build.fhir.org/ig/HL7/genomics-unified/index.html</a><br>\nThe CG examples you are seeing in core today will be different with the new IG.  </p>\n</blockquote>\n<p>Yes I have seen - your email about IG Review was what prompted my posting. Part of my question is related to whether the future work in the genomics terminology space (i.e better documentation) should be living in the Genomics IG or staying in the core. Grahame seems to be indicating that he is happy for it to stay in the core</p>",
        "id": 153947429,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1521759043
    },
    {
        "content": "<p>well, the general guidance is that if everyone has to follow it whatever , it should be in the core. And that's the case for using these code systems. - it isn't like 'you use it this way with the IG, otherwise, whatever'. No, there's only one way... and so it goes in core</p>",
        "id": 153947430,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521759308
    },
    {
        "content": "<p>We'll start with HPO. I'll write the page once I'm done with the new transformation and send to Grahame for review.</p>",
        "id": 153947431,
        "sender_full_name": "Alejandro Metke",
        "timestamp": 1521759345
    },
    {
        "content": "<p>The IG we are building will be our recommendation.  We are working on it outside of the core today, but based on guidance from FMG, we may end up publishing it as part of core by September.  As  you develop this of documentation <span class=\"user-mention\" data-user-id=\"191389\">@Alejandro Metke</span> , we can work with you to review it and get it into our IG.</p>",
        "id": 153947494,
        "sender_full_name": "Kevin Power",
        "timestamp": 1521813283
    },
    {
        "content": "<p>That's great <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>. I'll keep you in the loop.</p>",
        "id": 153947792,
        "sender_full_name": "Alejandro Metke",
        "timestamp": 1522036145
    },
    {
        "content": "<p>what is the use case for HPO? please clarify?</p>",
        "id": 153949005,
        "sender_full_name": "Bret H",
        "timestamp": 1522320415
    },
    {
        "content": "<p>There was a person chosen as the CG WG vocab representative. Can't recall there name at the moment. Have they been involved?</p>",
        "id": 153949006,
        "sender_full_name": "Bret H",
        "timestamp": 1522320579
    },
    {
        "content": "<p>We haven't really done much with terminologies yet other than retaining mentions of the terminologies explicitly bound in the v2 space</p>",
        "id": 153949049,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1522332967
    },
    {
        "content": "<blockquote>\n<p>what is the use case for HPO? please clarify?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> our clinical users exchange HPO codes with the genomics lab (on test order) to narrow down the genes of interest. And we also want to record them against any genomic artifacts for later queries ('find me all the undiagnosed samples exhibiting abnormality of axial muscles')<br>\nThe coverage of HPO overlaps with SNOMED but not enough for our users</p>",
        "id": 153949604,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1522623672
    },
    {
        "content": "<p>Thanks.</p>",
        "id": 154659235,
        "sender_full_name": "Bret H",
        "timestamp": 1546967134
    },
    {
        "content": "<p>HPO is open, SNOMED is not.  HPO is gaining significant traction in GA4GH, lead by Melissa Haendel.  While primarily used more on the research side, NCATS is looking at it for clinical/translational as well.  I certainly wouldn't count it out.</p>",
        "id": 160125034,
        "sender_full_name": "Bob Freimuth",
        "timestamp": 1551899504
    }
]