[
    {
        "content": "<p>Here is a draft of high level themes that we should look to address for STU2.  With this list, we can ask for volunteers to help drive the discussion and make recommendations.  Here is my list (in no particular order), and of course I welcome feedback/input from everyone:</p>\n<ul>\n<li>Definitional versus Observational - How do we go about defining a set of definitional entities where needed?</li>\n<li>Implications - Can we better harmonize our implication profiles to make them more usable?</li>\n<li>Methodology - How to best represent the methodology behind the test? (this should probably include reevaluating region studied)</li>\n<li>Tooling support for genomic specific code systems (HGNC, HGVS, SO, etc ...)</li>\n<li>LOINC requests for any remaining 'TBD codes'</li>\n</ul>\n<p>Other things I considered, but wasn't quite sure they warranted a theme:</p>\n<ul>\n<li>Report Interp/Text - Better guidance on interpretations + the 'snippets of text' that are often important to support those interps.</li>\n<li>Breaking the IG into more specific IGs</li>\n<li>Ensuring our IG is compatible/works nicely with other IGs</li>\n</ul>\n<p>-- Please note, there will be overlap among these themes, and I am not sure how to best address that.  I doubt we can eliminate it entirely.</p>",
        "id": 179980476,
        "sender_full_name": "Kevin Power",
        "timestamp": 1572989894
    },
    {
        "content": "<p>Getting more labs involved in looking at the spec (and planning to implement it)?</p>",
        "id": 179983087,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572991530
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> I might suggest introducing the notion of sharing knowledge statements or variant-centric assertions / evidence to represent or build knowledge in contrast to the Observational subject-centric approach to sharing statements about what was or wasn't observed in a single specimen/subject.  By understanding the need to share these variant-centric statements in FHIR, I believe, it would shed significant light on how the definitional data types should be represented so that they could be shared across both subject-centric observations of variants as well as variant-centric statements of knowledge and annotations to provide the evidence and inputs needed to support CDS and other clinical/research use cases in the domain of precision medicine.</p>",
        "id": 180025893,
        "sender_full_name": "Larry Babb",
        "timestamp": 1573042653
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> - I was thinking that would be part of the Definitional versus Observational theme?</p>",
        "id": 180028566,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573044838
    },
    {
        "content": "<p>I have moved the list to this Google doc - continue to ask for additional feedback please:  <br>\n<a href=\"https://docs.google.com/document/d/17r-HNm-gyqthepU40gqh39uYK9PV3HmBl1VM-vW6TuY/edit\" target=\"_blank\" title=\"https://docs.google.com/document/d/17r-HNm-gyqthepU40gqh39uYK9PV3HmBl1VM-vW6TuY/edit\">https://docs.google.com/document/d/17r-HNm-gyqthepU40gqh39uYK9PV3HmBl1VM-vW6TuY/edit</a></p>",
        "id": 180433346,
        "sender_full_name": "Kevin Power",
        "timestamp": 1573486737
    },
    {
        "content": "<p>Added \"revisiting DAM use case descriptions\" to the miscellaneous section of the list.</p>",
        "id": 180436044,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573488615
    },
    {
        "content": "<p>I know there's no immediate call for feeding DIM content back into the IG in its entirety, but I believe it should help us in converting topics listed and/or missing from the DAM into usable guidance in the IG</p>",
        "id": 180436222,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1573488745
    },
    {
        "content": "<p>I think we should also make some statement about what will not be changed. As different parts of our spec mature at different paces, we should help implementers know what we consider more 'done.'</p>",
        "id": 181038482,
        "sender_full_name": "Bret H",
        "timestamp": 1574099333
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> Do you have a list of any parts of the spec you think are less likely to change? I feel the ideology represented on index.html is solid, but we have open issues with findings, implications, and region-studied so I think it is hard to predict where proposals will solidify. Certainly we will need to maintain a changelog for future versions, outlining changes we do make. Would that satisfy your concern?</p>",
        "id": 181040224,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574100593
    },
    {
        "content": "<p>If we want to model separate levels of maturity in anything other than text, we may need separate IG-level packages</p>",
        "id": 181040485,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574100756
    },
    {
        "content": "<p>Realized I don't see phenopackets on here, group seemed very interested in alignment/sponsoring phenopackets-on-fhir IG in Atlanta, and they may have some overall approach that could benefit our implication profiles. (see <a href=\"https://aehrc.github.io/fhir-phenopackets-ig/profiles.html\" target=\"_blank\" title=\"https://aehrc.github.io/fhir-phenopackets-ig/profiles.html\">https://aehrc.github.io/fhir-phenopackets-ig/profiles.html</a>)</p>",
        "id": 181062638,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574115491
    },
    {
        "content": "<p>WOW, that is quite a piece of work.  There is so much there that a quick review isn't going to be enough.  What specifically did you see that might benefit our implication profiles?</p>",
        "id": 181064506,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574117137
    },
    {
        "content": "<p>a changelog is something. The question is, will it be visible enough for implementers. We have problems with new implementers not looking at both the snapshot and differential...as well as the implementers being new to FHIR. As a WG adding more on the structured def page would be useful. But we need more wg members to be involved to get that done.'</p>",
        "id": 181131754,
        "sender_full_name": "Bret H",
        "timestamp": 1574182802
    },
    {
        "content": "<p>So, wanted to try and keep this conversation moving.  Sorry, I have been completely swamped today but here goes.</p>\n<p>Given the variety of answer lists we have today, if we continue to move forward with this consolidation approach, we have two ways that I can see we can handle the answer/values that I added to the STU2 Themes document under Implications:</p>\n<ul>\n<li>Use the Observation.valueCodeableConcept to reflect the answers (like what sort of Prediction, what sort of Metabolism effect, etc ...) - we would either need to create a new ValueSet with everything rolled into one, or leave the binding as a open - and provide guidance in text.</li>\n<li>Use the Observation.valueCodeableConcept as something simple (like Present/Absent), and then introduce components to hold the sort of answers I mention above.  To Jamie's point, this would be made better by adding some invariants (and probably textual guidance) to help ensure that we help ensure the appropriate component \"answer\" is sent to match the corresponding Observation.code.</li>\n</ul>\n<p>If there are other ideas/thoughts of how this could be done, please share.</p>",
        "id": 181163287,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574204256
    },
    {
        "content": "<p>Are we sure that diagnostic implications should be lumped into the same profile as others? The use case seems quite different at first glance, and I believe <span class=\"user-mention\" data-user-id=\"220680\">@Alexander Mankovich</span> showed concern here as well</p>",
        "id": 181172418,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574213538
    },
    {
        "content": "<p>At this point, I am not sure of anything <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span> what were the concerns?  What would the right answers be for a diagnostic implication? That often helps me think through how well it aligns.</p>",
        "id": 181173213,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574214607
    },
    {
        "content": "<p>Well a diagnostic implication would be indicating a potential link to a cancer presence, as opposed to others which I believe assume the cancer is already present as a context for selection/projected outcome (usually of a particular therapy)</p>",
        "id": 181173464,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574214945
    },
    {
        "content": "<p>The data elements may be similar but systems will have to perform different logic based off the codes</p>",
        "id": 181173605,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574215098
    },
    {
        "content": "<p>Could potentially split the associated cancer off into \"predicted-cancer\" vs \"cancer-context\", for example</p>",
        "id": 181173632,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574215161
    },
    {
        "content": "<p>This is an example of an overall modeling question that I haven't seen answered yet...</p>",
        "id": 181173637,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574215199
    },
    {
        "content": "<p>Are there other missing data elements?</p>",
        "id": 181174332,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574216146
    },
    {
        "content": "<p>My question is if different use cases for the same concept warrants it being a different concept</p>",
        "id": 181174448,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574216335
    },
    {
        "content": "<p>Gets us back to the level of evidence discussion, haha</p>",
        "id": 181174459,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574216355
    },
    {
        "content": "<p>I don’t know the answer to that one but it does feel like we continue to circle back to the same set of questions. If they do need to be defined separately, I sort of wonder about the value of consolidation of the profiles?</p>",
        "id": 181174834,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574216976
    },
    {
        "content": "<p>Well if we can make good arguments that the elements that look similar in English can be aligned without sacrificing usability it is valuable.</p>",
        "id": 181174915,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574217106
    },
    {
        "content": "<p>If not, we have better guidance for why they are separate!</p>",
        "id": 181175049,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1574217284
    },
    {
        "content": "<p>Agreed that seems to be a key decision to validate. I had assumed that it would be ok when combining  <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 181175136,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574217406
    },
    {
        "content": "<p>For context I believe diagnosis for CML requires a positive test for a BCR-ABL gene fusion. There are also numerous examples of genetic associations  with particular cancer subtypes such as breast cancer. Still not sure which of your approaches would work best but hope that's informative</p>",
        "id": 181234766,
        "sender_full_name": "Alexander Mankovich",
        "timestamp": 1574274288
    },
    {
        "content": "<p>After a review of some examples in this space, would it make this any clearer if we dropped the name 'implication' and used 'significance' ?  I think that would make it clearer that our code/value should represent what sort of significance it is, then the components should support it?</p>\n<p>In my head, that feels better - but is it really?</p>",
        "id": 181237657,
        "sender_full_name": "Kevin Power",
        "timestamp": 1574276502
    },
    {
        "content": "<p>hmmm, i like significance - but had no problem with implication. After thinking a bit about merging profiles i now don't see a benefit of merged profiles with too many  invariants compared to different profiles.</p>",
        "id": 181295311,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1574335332
    },
    {
        "content": "<p>But if we can merge some, i'm in for it. Prognostic and Predictive are looking quite similar, so these could be merged? But after reading the paper about the definition of predictive, prognostic and diagnostic i assume our prognostic profile might be wrong?</p>",
        "id": 181295426,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1574335475
    },
    {
        "content": "<p>How so <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> ?</p>",
        "id": 181295457,
        "sender_full_name": "Bret H",
        "timestamp": 1574335519
    },
    {
        "content": "<p>Be cautious about dithering on language.</p>",
        "id": 181295474,
        "sender_full_name": "Bret H",
        "timestamp": 1574335546
    },
    {
        "content": "<p>Do we have a topic here for Phenopackets?</p>",
        "id": 186825922,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1580243774
    },
    {
        "content": "<p>Not a specific one</p>",
        "id": 186826019,
        "sender_full_name": "Kevin Power",
        "timestamp": 1580243834
    },
    {
        "content": "<p>Definitional vs observational on Variant feels like it won't be separate structures this time around--but we could and should separate them in our textual representation.</p>",
        "id": 189715461,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1583343618
    },
    {
        "content": "<p>I think small strides we can make here will help:</p>\n<ul>\n<li>Consider collapsing some related components (HGVS)</li>\n<li>Appropriately group/sort the components, both within the profile and the diagrams.</li>\n<li>Additional textual documentation on the <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/sequencing.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/sequencing.html\">Sequencing</a> page to help implementors see the connections that are not obvious otherwise.</li>\n<li>Perhaps implement a few invariants?</li>\n</ul>",
        "id": 189728163,
        "sender_full_name": "Kevin Power",
        "timestamp": 1583351522
    },
    {
        "content": "<p>I'd add to this variant component grouping a \"must support\" review for the key observational and (at least one) definitional group. The other \"nice to have\" potentially redundant components could be left out of the must-supports - a much less heavy-handed approach than removing them entirely.</p>",
        "id": 189732993,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1583354671
    },
    {
        "content": "<p>when does this thread expire. I'm interested in a set of specific-binding deliverable targets. A target release date and a plan for timing of future enhancements/upgrades/changes.  <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span>  and fhries (its a lot to ask, but a closing date on new topics added to STU2 might be helpful to move the needle)</p>",
        "id": 190654929,
        "sender_full_name": "Bret H",
        "timestamp": 1584290319
    },
    {
        "content": "<p>hoping to give this some screen time today</p>",
        "id": 190732248,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1584370189
    }
]