[
    {
        "content": "<p>Hi All,<br>\nForgive me if something like this has already been dealt with, I tried searching and didn't see anything obvious. We're trying to capture all the data generated by whole exome sequencing.</p>\n<p>From a sample we get this data: raw reads (fastq files), an aligned genome (bam file), and variants (vcf files).</p>\n<p>Are Observations appropriate for tracking these files? Would it make sense to bundle them in a Component?</p>\n<p>Any guidance would be welcome.</p>\n<p>Thanks.</p>",
        "id": 201788943,
        "sender_full_name": "Damien Jones",
        "timestamp": 1592949368
    },
    {
        "content": "<p>Hi Damien, welcome to #genomics! </p>\n<p>Due to the size of those files, they would likely each get their own DocumentReference resource if you wanted to put them in FHIR directly. In general, our group is focused on lab result reporting, so we have defined an extension for documents like these to be added to DiagnosticReport (see <a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/extension-SupportingInfo.html\">http://build.fhir.org/ig/HL7/genomics-reporting/extension-SupportingInfo.html</a> in our Implementation Guide). </p>\n<p>Much of the clinically actionable data represented in these files can be represented in Observation using our other structures, but we don't recommend using Observation to refer to the files directly.</p>\n<p>You could also consider using Composition resource to group together the DocumentReferences, if it is not in the context of a ServiceRequest.</p>\n<p>Hope this helps</p>",
        "id": 201850522,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1593007322
    },
    {
        "content": "<p>Thanks Jamie,</p>\n<p>I'll check out the extension and Composition.</p>",
        "id": 203014445,
        "sender_full_name": "Damien Jones",
        "timestamp": 1594054700
    },
    {
        "content": "<p>look for  fields that are of type 'reference.' don't know if you have read the base spec on the data type but it is worth knowing how to communicate the logical location location of a file. There is also MEDIA.</p>",
        "id": 205112843,
        "sender_full_name": "Bret H",
        "timestamp": 1595854534
    }
]