[
    {
        "content": "<p>The ObsVariant profile provides a lot of levers to share different kinds of variation SNPs, InDels, CNVs, etc... <br>\nIt appears as if a subset of the component fields aim to provide a computationally reliable representation of the genomic-level sequence, position, ref and alt states of the variant. As most folks know this set of fields is critical at accurately representing the genomic data that defines the variant change and can provide valuable computational utility of the information in downstream processes. </p>\n<p>However, it does not appear as if the same component structure is available for a transcript only or amino acid only representation. If the ObsVariant is only meant to accurately reflect genomic sequence observations then this might make sense, but if the ObsVariant is meant to be able to pass just about any type of sequence variation regardless of the type of sequence molecule then you may want to consider how to handle the components that would correspond to attributes like transcript start-end, transcript ref, transcript alt, amino acid start-end, amino acid ref, amino acid alt.</p>\n<p>This is one of the many forthcoming challenges with using ObsVariant to share definitional data accurately and precisely in a standard form within HL7's FHIR resources.</p>\n<p>Suggestion: If there was a set of classes or data types to define a sequence allele with precise and/or imprecise end points such that the underlying sequence could be representative of any type of molecule that contained a sequence of residues, then this might provide a foundational structure for building the accurate genomic representations that are targeted in testing, linked to observed findings and linked to variant evidence and knowledge that is inherently represented in reporting and the upstream processes used to fulfill clinical assessments used by clinical reporting.</p>\n<p>Having these critical definitional structures embedded in these higher-order observations that add additional context and transform the definitional representation into case-specific or instantiated forms of variants makes it virtually impossible to reasonable share the breadth of data structures and associated evidence/knowledge needed to share computationally useful genetic results.</p>",
        "id": 175901150,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568723829
    },
    {
        "content": "<p>who actually sequences amino acids currently? is there really mass spec data being passed around? Consider the comments in ObsVaraint transcript/aa component.</p>",
        "id": 175907064,
        "sender_full_name": "Bret H",
        "timestamp": 1568727769
    },
    {
        "content": "<p>In the <a href=\"https://cancervariants.org/\" target=\"_blank\" title=\"https://cancervariants.org/\">VICC</a> they often get folks reporting amino acid forms of variation, on which they attach evidence, annotations and knowledge for sharing with labs that may or may not use it to report on results and findings for somatic testing.</p>\n<p>My understanding is that while they may not actually sequence amino acids, the data and knowledge in these variant level databases may only be reported based on the amino acid sequence.  If so, then wouldn't HL7 need to provide a means for representing these forms of variation?</p>\n<p>Some reporting labs may choose to only report back the amino acid variation form. Without the basis of the amino acid sequence and its start/stop positions, one would have to rely solely on the p. HGVS expression (I presume).  How would downstream systems and clinical research efforts ever reliably find and understand what that data is without a structured computational form that is consistent and alignable to some reference?</p>",
        "id": 175909423,
        "sender_full_name": "Larry Babb",
        "timestamp": 1568729265
    }
]