[
    {
        "content": "<p>It seems that most of the other WGs doing FHIR work are using the gforge tracker to keep track of issues/suggestions. We (CG) really haven't and I think we should. I think this is how it works... If I want to submit a change request, I would click on the \"Propose a change\" link on the bottom of the resource/profile page and enter my change there. I tried this by adding a suggestion of changing Variation to Variant. While looking there, I noticed a few suggestions that I wasn't aware of. Should these tracker entries be automatically sent to the co-chairs or WG listserv?</p>",
        "id": 153828168,
        "sender_full_name": " Bob Milius",
        "timestamp": 1463508553
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span> . I do think we should use an issue/bug tracker but I believe gforge will be replaced soon. I'm not sure if we should start using it to then soon change to another (hopefully better) system. </p>\n<p>A big issue that I see is that the genomics resource/profiles are already very behind from the latest versions that I have (available at genomics-advisor). If we do start using gforge soon, we should make sure that people look at the latest versions so there aren't issues that have already been addressed. At this time, I've addressed all the ones brought up at Montreal.</p>",
        "id": 153828179,
        "sender_full_name": "Gaston Fiore",
        "timestamp": 1463512794
    },
    {
        "content": "<p>realistically, it will take 6 months + to change from gForge. You should definitely start using it now - don't wait</p>",
        "id": 153828185,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463513487
    },
    {
        "content": "<p>certainly anyone outside your group will expect you to use the same issue tracking system as the rest of fhir</p>",
        "id": 153828186,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463513510
    },
    {
        "content": "<p>process wise, split between the trunk and a branch will become increasingly problematic for engagement</p>",
        "id": 153828187,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463513540
    },
    {
        "content": "<p>I didn't know the switch was 6 months away. That is indeed a long time. We'll use gForge then. <span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span> , we should probably vote so I can commit the latest code.</p>",
        "id": 153828197,
        "sender_full_name": "Gaston Fiore",
        "timestamp": 1463513897
    },
    {
        "content": "<p>Yes, we should. Is there a list of changes/differences between the current build and the one at genomics-advisor?</p>",
        "id": 153828205,
        "sender_full_name": " Bob Milius",
        "timestamp": 1463514379
    },
    {
        "content": "<p>I'll write a bulleted list of all changes for Thursday.</p>",
        "id": 153828212,
        "sender_full_name": "Gaston Fiore",
        "timestamp": 1463515553
    },
    {
        "content": "<p>thanks!</p>",
        "id": 153828215,
        "sender_full_name": " Bob Milius",
        "timestamp": 1463515704
    },
    {
        "content": "<p>Good morning <span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span> . I've summarized all changes since Montreal. Please let me know any comments, concerns, questions, suggestions, etc that you have. Thanks!<br>\n<a href=\"https://docs.google.com/document/d/1URLniQsNoSkXAdB2yeWSJaf08G_F78mn_GugLwk6KOg/edit?usp=sharing\" target=\"_blank\" title=\"https://docs.google.com/document/d/1URLniQsNoSkXAdB2yeWSJaf08G_F78mn_GugLwk6KOg/edit?usp=sharing\">https://docs.google.com/document/d/1URLniQsNoSkXAdB2yeWSJaf08G_F78mn_GugLwk6KOg/edit?usp=sharing</a></p>",
        "id": 153828445,
        "sender_full_name": "Gaston Fiore",
        "timestamp": 1463582431
    }
]