[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span> , if <code>variant</code>, <code>referenceSeq</code>, and <code>structureVariant</code> were all moved from the Sequence resource to the Observation profile as <span class=\"user-mention\" data-user-id=\"191923\">@Amnon Shvo</span> proposes, how would you carry out the workflow that you described at yesterday's meeting? Will it be affected? If so, how? <span class=\"user-mention\" data-user-id=\"192093\">@Jonathan Holt</span> , if you have any input, please chime in as well. Thanks a lot!</p>",
        "id": 153830210,
        "sender_full_name": "Gaston Fiore",
        "timestamp": 1464360120
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191490\">@Gaston Fiore</span> ,    I think that we need to flush out the goals of the sequencing resource to better understand the placement of attributes.  I will also need to defer to <span class=\"user-mention\" data-user-id=\"191923\">@Amnon Shvo</span> for his vision of his proposed changes.     My take is that we need to separate the genomic data from the observation and from the interpretation.    The genetic testing report ( the interpretation) refers to multiple observations ( the observation profile) which references the sequence Resource (data) in a \"show your work\" approach to make it unambiguous.  The more granular bioinformatics files ( VCF, SAM/BAM) are in separate repositories.   The second goal of the sequence resource is to enable storage and querying of raw data, without having to dive into the VCF or alignment files.   </p>",
        "id": 153830221,
        "sender_full_name": "Jonathan Holt",
        "timestamp": 1464364245
    },
    {
        "content": "<p>I agree <span class=\"user-mention\" data-user-id=\"192093\">@Jonathan Holt</span> . What is not clear to me is whether it is necessary to have <code>variant</code> and <code>structureVariant</code> in Sequence for querying raw data. <span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span> , in your HLA cases, when querying variants, it is necessary to have those elements in Sequence, right? I'm also trying to understand with specific examples whether moving those elements to the Observation profile would adversely affect querying.</p>",
        "id": 153830246,
        "sender_full_name": "Gaston Fiore",
        "timestamp": 1464373856
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153830254,
        "sender_full_name": "Gaston Fiore",
        "timestamp": 1464375903
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191490\">@Gaston Fiore</span> Short answer: I don't know. I need to see how our HLA use case works by moving variant from sequence to observation. I need to see it mocked up with examples. In our use case, we need to represent a consensus sequence from a lab that includes one or more sequence blocks (e.g. some but not all of the exons in the gene). In the group of sequence blocks, I need to see whether the lab has determined phase between any of them, or if it is unknown. I also need to know whether each sequence-block is a novel variant as compared to the the IPD-IMGT/HLA allele database. This level of detail is somewhere between primary data and interpretation. The sequence blocks are a result of aligning/assembling the raw reads, which could change depending on the tools/algorithms used, but are then used to make an allele assigment. One person's interpretation is another's primary data. In the end, I'll have to mock it up with examples and see if it works, and even if it does, whether it's more awkward/cumbersome.</p>",
        "id": 153830423,
        "sender_full_name": " Bob Milius",
        "timestamp": 1464541863
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span> . As a software engineer, I completely agree that we need examples. I was going to go back to an email you sent a couple of month ago with background on your use cases. Let me know when/as you work on this. I want to participate. Working examples through are key to the bottom-up approach that I want to pursue. Thanks Bob!</p>",
        "id": 153830536,
        "sender_full_name": "Gaston Fiore",
        "timestamp": 1464614878
    }
]