[
    {
        "content": "<p>If we have a variant that we have associated with both a DB ID and an HGVS nomenclature, would it be ok to document  it this way?</p>\n<p>component(variation-code)<br>\n|--code<br>\n--|--valueCodeableConcept<br>\n------|--coding<br>\n------|--system= DB system (i.e. Clinvar)<br>\n------|--code = DB code (i.e. Clinvar id)<br>\n--|--text = HGVS data</p>\n<p>If not, where should that type of information live?</p>\n<p>Edit: Better format the component</p>",
        "id": 229020873,
        "sender_full_name": "Hayden Bader",
        "timestamp": 1614976796
    },
    {
        "content": "<p>I suppose you could put the HGVS in text but not sure why you would ?  We have other component slices for HGVS expressions.</p>",
        "id": 229235566,
        "sender_full_name": "Kevin Power",
        "timestamp": 1615167884
    },
    {
        "content": "<p>Which slices?</p>\n<p>There is a DNA Change which (if it corresponds to the HL7V2) corresponds specifically to transcript change. AA Change corresponds to Amino Acid Change, and Genomic DNA Change is self evident. But where would an HGVS Name that is the compilation of more than one of these go? Often HGVS names are sent with c. and p. together, for example, and we need a place to send that information.</p>",
        "id": 229301866,
        "sender_full_name": "Rachel Kutner",
        "timestamp": 1615211859
    },
    {
        "content": "<p>Yea, those are the other slices I am talking about. I am not sure we had considered when a single HGVS representation includes a combo (like c. and p. together). I might have to go remind myself, but is that valid HGVS? Or is it a short-cut for commonly known variants? Where have you put the combo names in V2?</p>",
        "id": 229303639,
        "sender_full_name": "Kevin Power",
        "timestamp": 1615212497
    },
    {
        "content": "<p>Using hgvs as \"display\" in the codeableConcept has been done before for clinvar IDs that also show an hgvs, and I think it is preferable to \"text\"</p>",
        "id": 229305060,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1615212986
    },
    {
        "content": "<p>I think we want to push for our hgvs fields to be fully valid hgvs strings but that display spot could be used for whatever is most convenient (assuming a canonical display is not provided by the code system)</p>",
        "id": 229305398,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1615213128
    },
    {
        "content": "<p>Agree with Jamie.  The example found here: <a href=\"https://www.ncbi.nlm.nih.gov/clinvar/variation/53158/\">https://www.ncbi.nlm.nih.gov/clinvar/variation/53158/</a> <br>\nWould look something like this:</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>      \"valueCodeableConcept\" : {\n        \"coding\" : [\n          {\n            \"system\" : \"http://www.ncbi.nlm.nih.gov/clinvar\",\n            \"code\" : \"53158\",\n            \"display\" : \"NM_000492.3(CFTR):c.-9_14del (p.Met1fs)\"\n          }\n        ]\n      }\n</code></pre></div>",
        "id": 229307216,
        "sender_full_name": "Kevin Power",
        "timestamp": 1615213812
    },
    {
        "content": "<p>All right. That makes sense. Do we have any recommendation for what should go into the text elements of the various component codeable concepts in the Observation Variant profile?</p>",
        "id": 229307769,
        "sender_full_name": "Hayden Bader",
        "timestamp": 1615214001
    },
    {
        "content": "<p>We haven't documented guidance for when/if to use text, so I guess we default to the FHIR guidance.</p>",
        "id": 229311053,
        "sender_full_name": "Kevin Power",
        "timestamp": 1615215276
    },
    {
        "content": "<p>HGVS often will be sent like this: RefSeq.X(Gene):c.123X&gt;Y (p.X213Y)</p>\n<p>Where each piece is a valid HGVS term (though protein sequence may be missing the refseq), and they string them together. This is very common, and we need a place to be able to send this information if it's stored without explicit relation to an external database.</p>\n<p>Where should we send this information in these cases? We cannot send it here in the display field without a code/code system, can we? In that case, my expectation would have been to send it via Text, as I don't see another place to send it.</p>",
        "id": 230345573,
        "sender_full_name": "Rachel Kutner",
        "timestamp": 1615815743
    },
    {
        "content": "<p>To me, the first question to answer is this: Is the HGVS expression Rachel references above a valid HGVS expression? Or, is it a HGVS like expression some systems use? I think the answer to that question can help guide us in determining where to put it.</p>",
        "id": 230383456,
        "sender_full_name": "Kevin Power",
        "timestamp": 1615828024
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"249407\">@Rachel Kutner</span>  you can always break the HGVS down to it's component pieces and send with the discrete components for position, reference etc..</p>",
        "id": 232753437,
        "sender_full_name": "Bret H",
        "timestamp": 1617282650
    },
    {
        "content": "<p>We have other values that are sent in those fields. If we send multiple, is there a way to tell which go with which piece when receiving the message, vs which were recorded separately?</p>",
        "id": 232757993,
        "sender_full_name": "Rachel Kutner",
        "timestamp": 1617284532
    }
]