[
    {
        "content": "<p>Hello <a class=\"stream\" data-stream-id=\"179197\" href=\"/#narrow/stream/179197-genomics\">#genomics</a> friends - I have been working on triaging our ballot comments. In this context, triaging means making sure the request is clear and getting started on building a proposal to address the comment. At times the resolution is pretty easy, and I can easily write up the proposal and queue up the comment for a forth coming block vote. Other times, I need to reach out to the commenter and get some clarification.</p>\n<p>We will have ballot comments that require some analysis to identify the best solution. For those, we like to reach out to other work group members to help develop a proposal. If there is anyone here that is interested in participating in this process, please let me know! Many hands can make light work!</p>\n<p>What would be expected of you?</p>\n<ul>\n<li>As a co-chair works on triaging JIRAs, you might be assigned or tagged on the JIRA. You would be asked to provide some sort of input. Could be anything from do some sort of research on a topic, working on content (think about definitions, descriptions, etc ...), or just general brainstorming.</li>\n<li>It only requires that you have an HL7 JIRA account. We have others (for now) that can take the proposals and do the rest of the process (update the JIRA with the formal proposal, arrange the vote, apply the change to the IG, etc ....)</li>\n<li>You are free to decline if something is assigned to you that you are not able to help with.</li>\n</ul>\n<p>If you are interested, please respond here! If you have specific things you are interested in, we can try to narrow your engagement as an SME to those areas.</p>\n<p>All are welcome!!</p>\n<p>Thanks for your consideration.</p>",
        "id": 240398914,
        "sender_full_name": "Kevin Power",
        "timestamp": 1622067391
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> Time permitting, I'd like to help.</p>",
        "id": 240400960,
        "sender_full_name": "Bob Dolin",
        "timestamp": 1622068876
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"193751\">@Bob Dolin</span> - Will likely send some (more) your way soon <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 240401459,
        "sender_full_name": "Kevin Power",
        "timestamp": 1622069260
    },
    {
        "content": "<p>I might have some well-defined time.</p>",
        "id": 256141744,
        "sender_full_name": "Bret H",
        "timestamp": 1633385586
    }
]