[
    {
        "content": "<p>Question for the group (not sure if this is the right place), how much effort has been put into thinking about routing to various payers? Is that within scope of this project or is the intention that anyone implementing this would need to integrate with everyone explicitly?</p>",
        "id": 185141009,
        "sender_full_name": "Mathew Bramson",
        "timestamp": 1578507621
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"220683\">@Mathew Bramson</span> Can you expand on what you mean by 'routing to various payers'? The primary use case for this IG is for a single application to connect to a single health plan / PBM to access pharmacy benefit information. It's unlikely (in fact, unlikely) a member of a commercial health plan would have two or more commercial health plans / PBMs they would need to connect to.</p>",
        "id": 185866332,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1579211991
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"220683\">@Mathew Bramson</span> , <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> . Apologize for not seeing your note earlier.  <br>\nAs Ryan noted, we'd expect that a given patient would typically have a single payer--and the exchange is designed to involve just one payer per request.<br>\nI'm guessing you're wondering how a client app would connect to the different payers associated with its different users... whether it would need to integrate with a separate end point for each payer, versus connecting to a hub or using some other kind of approach. <br>\nIf so... <br>\nThe guide doesn't tread very far into that area, other than to say that determining the patient's payer/eligibility is out of its scope. And it uses FHIR messaging in the profile to facilitate routing through an intermediary. <br>\nIs that what you're wondering about? <br>\nI'm interested in your thoughts</p>",
        "id": 185877561,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1579221768
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238597\">@Frank McKinney</span> that's exactly what I was asking about. I had heard rumbling that this group had been considering the problem of a central directory to route such requests (but had ultimately considered it out of scope).</p>",
        "id": 185956290,
        "sender_full_name": "Mathew Bramson",
        "timestamp": 1579294796
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"220683\">@Mathew Bramson</span> We are still considering putting together a central directory. The problem right now on the provider side is that all of the FHIR end points aren't available across all providers who have gone live either because of technical or legal reasons. For health plans, it's still far too early. There is language in the proposed rules that will help tackle these challenges once they go final (assuming the language is still included).</p>",
        "id": 187291526,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1580755784
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> Interesting! That makes sense. Presumably there'd need to be some standard around authentication? Or is the feeling that routing based on URL and just relying on HTTPS sufficient?</p>\n<p>I had not heard anything about language to this effect. Where can I see that?</p>",
        "id": 187364855,
        "sender_full_name": "Mathew Bramson",
        "timestamp": 1580828162
    },
    {
        "content": "<p>URL is sufficient. The challenge is a) not all providers have a portal (shocking, I know) and 2) many EHR vendors have developed systems which may prohibit the discovery of a specific instance/provider site.</p>",
        "id": 187366619,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1580829263
    }
]