[
    {
        "content": "<p>Quick question: looking through <a href=\"https://confluence.hl7.org/display/CAR/RTPBC+Project\">https://confluence.hl7.org/display/CAR/RTPBC+Project</a> and the linked resources, I'm not seeing a regulatory mandate for this functionality, just a \"broad set of stakeholders, including Congress, CMS, and the White House who have expressed strong support\". I wanted to double-check that there's no current requirement to support this kind of capability (with the CARIN IG or otherwise)?</p>",
        "id": 208385660,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1598642970
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> do you have a quick take on this? Just want to make sure I'm not missing something.</p>",
        "id": 208703584,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1598973934
    },
    {
        "content": "<p>Great question <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>. The answer is not yet, but it's likely coming.  More below. . .</p>\n<p>In one of the CMS proposed rules (<a href=\"https://s3.amazonaws.com/public-inspection.federalregister.gov/2020-02085.pdf#page=560\">https://s3.amazonaws.com/public-inspection.federalregister.gov/2020-02085.pdf#page=560</a>) it mentions a concept called a beneficiary real-time benefit (RTBT) tool:  <br>\nAs described in section V.G. of this proposed rule, the proposed new paragraphs at ยง423.128(d)(4) and (5) would require each Part D plan to implement a beneficiary RTBT no later than January 1, 2022. This tool would allow enrollees to view a plan-defined subset of the information included in the prescriber RTBT system which includes complete, accurate, timely, and clinically appropriate patient-specific real-time formulary and benefit information (including cost, formulary alternatives, and utilization management requirements). Plans would be able to<br>\nuse existing secure patient portals to fulfill this requirement, to develop a new portal, or to use a computer application. </p>\n<p>In the final CMS rule (<a href=\"https://www.govinfo.gov/content/pkg/FR-2020-06-02/pdf/2020-11342.pdf\">https://www.govinfo.gov/content/pkg/FR-2020-06-02/pdf/2020-11342.pdf</a>) it removes the Beneficiary RTBT requirement, but it does say the topic of a \"Beneficiary Real Time Benefit Tool (RTBT) (ยง 423.128)\" will be addressed under the header: \"Requirements to be Addressed Later in 2020\". As a result, we are assuming now that we have a published standard (I'm not sure if it's 'official' yet but it's gone through the complete HL7 process), CMS may require a Beneficiary RTBT in the future similar to what the CARIN Benefit Check IG provides.</p>",
        "id": 208730396,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1598986085
    },
    {
        "content": "<p>Ironically, the IG was just published today. Here is the official STU1 version. <a href=\"http://hl7.org/fhir/us/carin-rtpbc/\">http://hl7.org/fhir/us/carin-rtpbc/</a></p>",
        "id": 208757025,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1598999248
    }
]