[
    {
        "content": "<p>Hi All,</p>\n<p>I'm in the process of drafting profiles for few Health Interactions. As decided before, each health interaction is represented as a document (FHIR Composition). Majority of the sections are modeled with Observation resource.<br>\nMajority of the health interactions requires mapping the venue where the activity has happened. </p>\n<p>Examples: <br>\n1. While recording Blood Spot Screening and Hearing Screening, we have to capture where the screening has happened. <br>\n2. While recording Health Check Assessments,  we have to capture where the examinations/assessments has happened. <br>\n3. While drafting Newborn Delivery (birth) Health interaction, we have to capture the location of birth. ( atm, we have modeled this as Patient.birthPlace extn). But we want to follow a consistent approach</p>\n<p>To profile the Venue, I can think of the following options:<br>\nOption 1: Use Composition.encounter.location, please note the encounter resource here is used for administrative purpose only<br>\nOption 2: Use an extension in the Observation profile to capture location where the Observation/Procedure was made<br>\nOption 3:  Use Observation.performer(Organization)</p>\n<p>My preference is to use Option 1. However Option 2 and 3 probably gives greater flexibility to capture individual locations. </p>\n<p>Any suggestion?</p>",
        "id": 157822914,
        "sender_full_name": "Shovan Roy",
        "timestamp": 1549582503
    },
    {
        "content": "<p>Think there is an issue in mixing recording a question on performance of an action (as an Observation) and the context of the procedure itself - elements of Observation are about the context of the recording the answer to the question - i.e. encounter where the question was asked and the performer as asker of the question - not the performer of the procedure</p>",
        "id": 158090918,
        "sender_full_name": "Brett Esler",
        "timestamp": 1549946337
    },
    {
        "content": "<p>if you really want to record the Procedure details then could use Procedure resource; Procedure.notDone to indicate it was or was not done; Procedure.subject is child; Procedure.context is encounter (with Organization.serviceProvider for organization providing encounter) ; performedDateTime for timing of procedure;  Procedure.location for the physical location</p>",
        "id": 158091311,
        "sender_full_name": "Brett Esler",
        "timestamp": 1549946856
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> , what is your view on using Composition.encounter.location. I want to use this as a common approach which is applicable to all documents in NCDHC.  meas this should be usable even we are not using any Observation/Procedure in the composition.</p>",
        "id": 158487705,
        "sender_full_name": "Shovan Roy",
        "timestamp": 1550101724
    }
]