[
    {
        "content": "<p>Ok. Let's get started. <br>\nI think that the CIMI FHIR Resource Profile SHALL map back to the CIMI FHIR logical models. What should be the requirements?</p>",
        "id": 153894901,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1498107189
    },
    {
        "content": "<p>I think they should. Convertably?</p>",
        "id": 153895020,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498163744
    },
    {
        "content": "<p>Does that mean that we use a CIMI archetype first to generate a FHIR logical model and then generate a  FHIR profile from there? What does the extra step buy? </p>",
        "id": 153895214,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1498479869
    },
    {
        "content": "<p>which extra step? the archetype or the logical model? </p>",
        "id": 153895215,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498481925
    },
    {
        "content": "<p>The archetypes come from CIMI. The profile is the goal. So I see the logical model as an additional step. Could be necessary, but I don't know why.</p>",
        "id": 153895223,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1498489911
    },
    {
        "content": "<p>it's primarily a technical thing - a staging point. From the point of view of administering the journey, it's helpful, in that's the intent of the archetype restated in FHIR language, before dealing with the heavy lifting of the mapping. </p>",
        "id": 153895249,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498510577
    },
    {
        "content": "<p>having that intermediate has all sorts of tooling benefits</p>",
        "id": 153895250,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498510595
    },
    {
        "content": "<p>I understand the question you are asking as 'how useful is that intermediary step to end-users'. And my answer is, that depends on their skills and background. For someone with CIMI exposure, the answer is probably, not very much - there's not much to learn from restating the same thing in a different format. </p>",
        "id": 153895251,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498510671
    },
    {
        "content": "<p>but for someone with a FHIR background.... it'll make much more sense </p>",
        "id": 153895252,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498510690
    },
    {
        "content": "<p>My experience of converting from archetypes to logical models is that the FHIR binding to terminology is much more precise than the archetype syntax, and the minimum expectations are much higher - archetype editors generally don't use the syntax they have to be specific about terminology, and the FHIR logical model conversion actually requires some heavy lifting around getting the terminology binding correct. and this means that the logical model itself says some new things</p>",
        "id": 153895255,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498510793
    },
    {
        "content": "<p>but that's driven by style and policy, and I expect CIMI will be getting the terminology bindings correct in the source model. (And I strongly advise CIMI to do so, should that not be the case)</p>",
        "id": 153895256,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498510840
    },
    {
        "content": "<p>I expect the CIMI archetypes to get the terminology right -- that's the idea, anyway. Another point of CIMI is to be platform independent, so we wouldn't want to make FHIR logical modelling a requirement for all transforms. (Though we might.) But making it part of the FHIR transform may be exactly right. As you say, sounds like a design decision. </p>",
        "id": 153895299,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1498566962
    },
    {
        "content": "<p>in principle, the FHIR Logical model should be iso-morphic with the archetype. So it's a style issue how you do your content</p>",
        "id": 153895301,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498570716
    },
    {
        "content": "<p><em>should be</em></p>",
        "id": 153895302,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498570720
    },
    {
        "content": "<p>It would be my understanding of the CIMI goals relative to terminology binding:</p>\n<p>1)  Was sufficient to produce FHIR Profiles that weren't deficient in comparison to other methods<br>\n   2)  Achieve alignment with the cross-family terminology binding guidelines being produced in the Vocab group<br>\n   3)  Provide necessary binding semantics to cope with DL and Non-DL based terminologies (such as LOINC, RxNorm, ICD-10, etc)</p>\n<p>So, I would expect that whenever a gap was discovered between the binding capability of FHIR and CIMI, that would be something the group would want to identify and correct.</p>\n<p>Do others feel differently about this?</p>",
        "id": 153895564,
        "sender_full_name": "Richard Esmond",
        "timestamp": 1498686726
    },
    {
        "content": "<p>The biggest question I always ask myself relative to Iso-morphic transforms between Archetypes and FHIR is one of granularity.  The FHIR world seems to want a much smaller number of Profiles which use optionality and flattening to reduce the total count.</p>\n<p>If we use Fractures as an example.  The CIMI Fracture Hierarchy would wind up with 100+ detailed clinical models (DCMs) which would themselves be composed of small reusable bits, which might contain several layers of more abstract ancestors.  But it isn't hard for me to imagine that with a bit of gap analysis it would be possible for those 100+ individual archetypes to be transformed to FHIR Logical Models and then back to Archetypes without loss.  But usually that isn't what people are talking about when they talk about iso-semantic transforms between FHIR and CIMI.</p>\n<p>Most of the conversations about transforming CIMI into FHIR involve creating a schematic-anchor at some parent point and aggregating a larger number of DCMs below that point to create a single FHIR Profile that can transport an entire 'class' of DCMs.  An example might be going to far, but what if a single FHIR Profile were created for all Fractures, with optionality being used when certain data-elements only applied to a subset of the bones.  (Sagittal / Distal, Etc. )  Flattening would also often be employed during this transform.</p>\n<p>And this type of aggregation and flattening isn't particularly conducive to round-trips.</p>\n<p>So my question to the FHIR community is:</p>\n<p>Who tolerant is the community going to be to large numbers of very definitive FHIR Profiles vs. wanting smaller numbers of less definitive ones?</p>",
        "id": 153895565,
        "sender_full_name": "Richard Esmond",
        "timestamp": 1498687498
    },
    {
        "content": "<p>well, that's a good question. my general view, which I've stated a number of times, is that 100s of variant models is a no-go. You have to establish regularity, and move the hyper-variance into terminologies. </p>",
        "id": 153895652,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498742407
    },
    {
        "content": "<p>the key difference that makes is the tabular format; there's a limited amount of structural variance. </p>",
        "id": 153895653,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498742439
    },
    {
        "content": "<p>I think that the current CIMI approach that ignores this concern is never going to penetrate into real software systems </p>",
        "id": 153895654,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498742478
    },
    {
        "content": "<p>at least, that's my opinion. What the community will accept... that's as yet undetermined</p>",
        "id": 153895655,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498742516
    },
    {
        "content": "<p>you're right that the interconversion between archetype and FHIR Logical model is neither here nor there in this respect; it's just a syntax etc change. </p>",
        "id": 153895656,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498742567
    },
    {
        "content": "<p>I think that's correct. It's natural for software enigneers to look at such a bunch of profiles and look for <em>structural</em> commonalities, which leads to common features of the implementing software (e.g. same database tables, same classes)  Having hundreds of them means a big effort in finding these commonalities.  This leads me to think that even though there may be reasons to logically create multiple cimi artifacts (because the modelled concepts are logically different), software engineers care more about structurally differences.   Which will lead to a different opinion on when to create a new model, and when to combine two models in one.</p>",
        "id": 153895822,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1498821308
    },
    {
        "content": "<p>Another thought. Maybe the detailed CIMI models are actually (partial) example instances of some common structure.</p>\n<p>I also would really like the requirement stated that the CIMI FHIR Profiles SHALL populate the &lt;mapping&gt; back to the original CIMI archetypes. We need computable traceability from implementation back to specification, so you can automatically check progress and conformance/compliance to specs.</p>",
        "id": 153896068,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1499252608
    },
    {
        "content": "<p>I wish I could  disagree with Grahame about the broader EMR communities desire for less variance, but it's going to be a long while before highly dynamic systems evolve that are less impacted by highly complex schemas.  We have databases that do well with dynamic and complex schemas, but we don't have any EMR / healthcare systems built on top of  them.  Over-time I personally suspect we will see many more of these, but not overnight.</p>\n<p>But when you enter the realm of the niche focused platforms, such as the one from my parent company PenRad, that is where you see a high payback for complex and highly computable schema.  PenRad is only sold to Breast Imaging centers and used solely by breast-focused Radiologists, so its worth it to have  two dozen tables with 60-70 different value-sets which contain around 650 individual concepts.   </p>\n<p>And the Oncologists, Pathologists and Surgeons down-stream are very interested in the rich and computable data-stream.  But I suspect that we would be waiting a very long time before a mainstream EMR vendor was interested in adopting two dozen profiles solely for breast reporting.  </p>\n<p>One last comment on per-coordination:</p>\n<p>We will be needing to author new SNOMED Concepts - somewhere in the few-hundred range if we rely on the information model and post-coordination fields.  If we were to produce all the combinations necessary to avoid post-coordination in the information model, we would be looking at thousands just for breast.  So, I'm not sure that pre-coordination is that much more practical.  This is the stuff that keeps me up at night.  (LOL)</p>",
        "id": 153896105,
        "sender_full_name": "Richard Esmond",
        "timestamp": 1499277600
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191421\">@Michael van der Zel</span> agree about the mapping backwards. </p>",
        "id": 153896258,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499374776
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191718\">@Richard Esmond</span> It's not a technology thing. It's about how people think. 1 table with 1000 rows has 1/1000th of the complexity of 1000 tables with 1 row. (technology may magnify the problem, but can't reduce it)</p>",
        "id": 153896259,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499374840
    }
]