[
    {
        "content": "<p>How is CIMI planning to map ClinicalFinding? FHIR Observation is supposed to be only simple, atomic results, not complex assessments. More complex assessments are either ClinicalImpression or perhaps DiagnosticReport.  If you have one CIMI class mapping to several FHIR classes, there could be a problem.</p>",
        "id": 153898843,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1501186845
    },
    {
        "content": "<p>it would make life more challenging</p>",
        "id": 153898846,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501187649
    },
    {
        "content": "<p>but I'm not sure that this is quite correct:</p>",
        "id": 153898847,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501187658
    },
    {
        "content": "<p>\"More complex assessments are either ClinicalImpression or perhaps DiagnosticReport\"</p>",
        "id": 153898848,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501187671
    },
    {
        "content": "<p>i think it depends on what 'assessment' means - it's an ambiguous word that is used for both a process of observation, and a a decision making exercise</p>",
        "id": 153898850,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501187710
    },
    {
        "content": "<p>I'll add that we have use cases that use the \"component\" element of Observation to model the results of an assessment. There's overlap in that use case with QuestionnaireResponse, but using Observation disconnects the results from what we see as the more \"workflow\" representation in QuestionnaireReponse.</p>",
        "id": 153898888,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1501194704
    },
    {
        "content": "<p>right. that disconnect is both good and bad depending on the context in which you are using the data</p>",
        "id": 153898890,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501195403
    },
    {
        "content": "<p>I have always wondered about the wisdom of Observation.component. It forces slicing. I could see a workable alternative where (for example) Systolic and Diastolic appear as extensions. Was that pattern investigated? What were the pros and cons?</p>",
        "id": 153898902,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1501198081
    },
    {
        "content": "<p>well, you're going to get slicing either way. and extensions and deeply complex extensions aren't a happy place - extensions aren't a perfect solution by any means, but the more complex they are, the less perfect they are. Initially Observation.component has come and gone as we argued about it</p>",
        "id": 153898905,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501198305
    },
    {
        "content": "<p>There's kind of 2 real needs for Observation.component:<br>\n- complex tuples as the observation. systolic and diastolic are kind of a special case because people argue about how seperable they are<br>\n- machines that generate a set of inter-related data as a cluster</p>",
        "id": 153898906,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501198394
    },
    {
        "content": "<p>Yes, one could argue BP is a panel, and Systolic and Diastolic are individual observations.  But under the assumption they are not, you are stuck slicing. But somehow, multiple extensions doesn't seem like slicing to me. <br>\nAlso, thanks for the history. There's certainly a need for representing \"clusters\" but that is neutral in terms of whether it's components or extensions.</p>",
        "id": 153898907,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1501198527
    },
    {
        "content": "<p>well, it depends how complex the clusters are... own reference ranges, interpretations, error codes. More complexity is not neutral</p>",
        "id": 153898908,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501198751
    },
    {
        "content": "<p>indeed, they could be a panel, that's what we did at one stage. but then you have a separability problem.</p>",
        "id": 153898909,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501198771
    },
    {
        "content": "<p>While I have your attention, what do you think about using Observation for something like an assessment. The example I'm fighting with is a clinician's judgment on disease progression. It is a clinical assessment that takes into account multiple pieces of evidence, and results in a conclusion that either the disease is progressing, or not (oversimplifying here). Could Observation be used?</p>",
        "id": 153898911,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1501198936
    },
    {
        "content": "<p>PC defined ClinicalImpression for that</p>",
        "id": 153898913,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501199166
    },
    {
        "content": "<p>well, no. I need to be carefu</p>",
        "id": 153898914,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501199186
    },
    {
        "content": "<p>ClinicalImpression is for the decision making process - what did I consider, what evidence did I look at, why did I eliminate things... now what is our plan</p>",
        "id": 153898915,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501199221
    },
    {
        "content": "<p>that's not the same as the decision about whether a disease is progressing or not - I'd take that up with PC</p>",
        "id": 153898916,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501199246
    }
]