[
    {
        "content": "<p>I am creating a profile that defines a hierarchy of fhir instances, comprised of a top level Diagnostic Report and multiple child Observations. There are some identical overlapping fields in Diagnostic Report and observation that if all are set would contain duplicate data references.</p>\n<p>Example. Both Diagnostic Report and Observation contain a Subject reference. The subject reference in each item would be identical, 'cause they all pertain to the same subject.</p>\n<p>Should I</p>\n<p>a) set cardinality to zero everywhere except in the top level Diagnostic Report, and assume that anyone interested in the these values will look for it only in the Diagnostic Report<br>\n or<br>\nb) Create a duplicate reference to the same subject and encounter in each child observation.</p>\n<p>Option a) is cleaner with identical data not being replicated in multiple locations.<br>\nOption b) allows searching on a child observation by these values (if searchable) and removes the need of searching up the hierarchy tree to find these values.</p>\n<p>Any opinions/established precedent?</p>",
        "id": 185852478,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1579204267
    },
    {
        "content": "<p>yes this is specified explicitly in the base FHIR specification: (a) is not-conformant, and there's never any expectation that you should go and hunt around for resources that may or may not provide context, and that wouldn't affect the indexing - be specific on each resource. So it's definitely (b). Specifically:</p>\n<blockquote>\n<p>Because resources are processed independently, relationships are not considered to be transitive. For example, if a Procedure resource references a Patient as its subject, and has a Procedure resource as its reason, there is no automatic rule or implication that the condition has the same patient for its subject. Instead, the subject of the condition must be established directly in the Condition resource itself. Another way to state this is that the context of the subject is not \"inherited\", nor does it \"conduct\" along the relationship to condition.</p>\n</blockquote>",
        "id": 185876549,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1579220608
    }
]