[
    {
        "content": "<p>While reviewing the CARIN for BB refresh with my partner in crime <span class=\"user-mention\" data-user-id=\"326428\">@Bryan Briegel</span>, we noticed a potential issue wrt NDC codes for Pharmacy claims.</p>\n<p>Specifically, our understanding is that 11-digit NDC codes (with no hyphens) are the norm in billing / financial data.<br>\nThis is backed up by the \"EOB Pharmacy\" tab of the informative CPCDStoFHIRProfilesMapping spreadsheet.<br>\nSpecifically, row 301, column M of this spreadsheet lists the following:</p>\n<div class=\"codehilite\"><pre><span></span><code>ExplanationOfBenefit    item    detail  productOrService            1..1    CodeableConcept Billing, service, product, or drug code 38  National drug code\n&quot;[1..1] CHAR(11)\nIndustry standard code&quot;\n</code></pre></div>\n<p>The required binding for this field links to a valuset with \"all codes defined in <a href=\"http://hl7.org/fhir/sid/ndc\">http://hl7.org/fhir/sid/ndc</a>\".<br>\nBut then we also stumbled onto <a href=\"https://www.hl7.org/fhir/ndc.html\">https://www.hl7.org/fhir/ndc.html</a> which says that this system is for</p>\n<blockquote>\n<p>The 10 digit NDC code, with \"-\" included. Note that different NDC codes have different positions for the \"-\": 1234-5678-90, 12345-6789-0, or 12345-678-90. The \"-\" must be correct for each NDC code</p>\n</blockquote>",
        "id": 237682801,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1620316440
    },
    {
        "content": "<p>Does this system allow for either the 10-digit (with hyphens) or the 11-digit (no hyphens) variety?<br>\nIs either/or acceptable for C4BB?</p>",
        "id": 237683300,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1620316610
    },
    {
        "content": "<p>It looks like maybe there was a separate code system defined for the 11-digit variety under <a href=\"https://jira.hl7.org/browse/HTA-12\">https://jira.hl7.org/browse/HTA-12</a> ?<br>\nBut I don't see it at <a href=\"https://terminology.hl7.org/codesystems.html\">https://terminology.hl7.org/codesystems.html</a> so maybe its still work-in-progress?<br>\n<span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> can you shed any light on this one?</p>",
        "id": 237687004,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1620317941
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span> Yes, I can shed some light (at least a little).  We had considerable discussion of this in Vocab (I can try to locate the threads later) and came to a solution for how to manage it.  The consensus was that NDC is a single code system, but it's one with two different sets of identifiers (the 10 and 11 digit codes) for each concept.  So there will be only a single 'system' url for it in FHIR, with both identifiers available in the code system, along with code system properties that allow defining the needed value sets, such as ones with only the 11 digit or only the 10 digit codes.  But in the FHIR model each concept can only have a <strong>single</strong> code (not multiple ones).  So in FHIR,  to have both the 10 and 11 digit codes we have to create duplicate concepts for each NDC, and then to declare that both the 10 and 11 digit concepts are equivalent in meaning we will provide a ConceptMap that shows that and provides the way to translate from one to the other (10 to 11 digit, or vice versa).  I know that sounds pretty complicated, and it is (much more so than usual), but probably it won't be that bad to actually use in practice - once it's available.  That gets to the next part, which is how to implement this on the <a href=\"http://tx.fhir.org\">tx.fhir.org</a> terminology server.  It turns out that in Grahame's server architecture (which is the base for <a href=\"http://tx.fhir.org\">tx.fhir.org</a>), the NDC code system is based on a database representation (not all of them are - many of the smaller ones, particularly, use FHIR CodeSystem resources, but some of them, like NDC, do not).  So all of the needed data is already in the database (at least it will be once we've updated to a more recent version), but Pascal code needs to be written to transform from the database representation and expose the content via the FHIR API as the ValueSet resources and their associated expansions, with the correct 10 and/or 11 digit codes being returned as described above.  So that's where it stands presently, waiting for that code to be written.  I'm hoping to be able to get to that and get it done fairly soon (unless Grahame tackles it, but I'm not sure that he's going to be able to do that any time in the very near future).</p>",
        "id": 237695090,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1620321047
    },
    {
        "content": "<p>Thanks Rob!  <br>\nCan you confirm that the 10-digit variety will include the hyphens and that the 11-digit variety will <em>not</em>?</p>\n<p>Do you know if there's a plan for updating <a href=\"http://build.fhir.org/ndc.html\">http://build.fhir.org/ndc.html</a> to indicate that this system includes both the 10-digit (with hyphens) and 11-digit (no hyphens) varieties?</p>",
        "id": 237699005,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1620322681
    },
    {
        "content": "<p>And maybe some guidance on when to use which?</p>",
        "id": 237699160,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1620322738
    },
    {
        "content": "<p>Re: concept maps, is the idea that this will be mapping between concepts in two different \"systems\" (both consistent with source NDC codes, but partitioned by length)? So looking at the <code>system</code> URLs, we'd see one representing the official NDC system and one representing some kind of Shadow system for the \"dispreferred\" partition?</p>",
        "id": 237707197,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620325903
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span> Yes, that's correct about the hyphens.  I don't there's an actual plan (yet), but there is an intent that this will be described in the \"Using NDC and NHRIC Codes with FHIR\" page.  Most of these \"Using XXX with FHIR\" pages likely will be moving to <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a> - but I'm not sure when that will happen.  I agree that we should add some guidance that describes which one to choose and when to do it (and how to go from one to the other when you need to).</p>",
        "id": 237712213,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1620327830
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> This concept map will be between two codes in the same code system (the same 'system' url of <a href=\"http://hl7.org/fhir/sid/ndc\">http://hl7.org/fhir/sid/ndc</a> for both), and in both directions.  So there wouldn't be any \"shadow\" system, or any notion of one being \"preferred\" and the other \"dispreferred\".  You could (and we did) argue, though, whether that is correct.  Because NDC is only officially published with the 10-digit (with hyphens) codes, and it's the drug database providers and NCPDP who have come up with and use the 11-digit codes.  But I would describe the conclusion, which led to deciding that NDC with both 10 and 11 digit codes for concepts is actually a single code system, as that even though the \"official\" publication is only of the 10-digit codes, the use of the 11-digit code format is also expected and at least implicitly sanctioned by the FDA as the code system publisher (we may have used some different wording to describe it, but that's the idea).</p>",
        "id": 237714553,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1620328823
    },
    {
        "content": "<p>Circling back around to what this means to CARIN for BlueButton.  Are we comfortable saying either the 10-digit code (with hyphens) OR the 11-digit code are allowed at this point?  Is it worth providiing any guidance on which to use?</p>",
        "id": 237828809,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1620396537
    },
    {
        "content": "<p>That sounds like the right decision to me, although of course I would like to see RX Norm codes propagated alongside :-)</p>",
        "id": 237829452,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620396795
    },
    {
        "content": "<p>Trying to provide more granular <em>requirements</em> on how to use NDC is an uphill battle. Clients that want to work with NDC codes should do their best to understand the full set of NDC codes.</p>",
        "id": 237829631,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620396853
    },
    {
        "content": "<p>If there's consensus on more granular <em>guidance</em> , that would probably be worth including so that systems making a choice for the first time could take it into account.</p>",
        "id": 237829724,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620396899
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> <br>\nPat can correct me, but the intent was to always use the 11 digit NCD code. The administrative side of the system uses the 11-digit. We've been  waiting on guidance from vocabulary as to how to correctly indicate that. I thought there was some guidance added to the guide by Pat Tayor indicating 11 digit was needed.</p>",
        "id": 238491313,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1620832620
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> <span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span> The intent is to use the 11 digit NDC code.  To Mary Kay's point, the administrative side of the system uses 11 digits.  Guidance is not specifically provided in the IG although it is called out by implication based on the mapping document.  Jira <a href=\"http://jira.hl7.org/browse/FHIR-32660\">FHIR-32660</a> was defined requesting the clarification be added to the profile notes <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span> <span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span></p>",
        "id": 239585098,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1621515056
    },
    {
        "content": "<p>This is an FYI to let everyone know that <a href=\"http://tx.fhir.org\">tx.fhir.org</a> does have partial support now for both the 10 and 11 digit NDC codes.  By partial support, I mean that you can do a CodeSystem $lookup using both code variations (e.g., <a href=\"http://tx.fhir.org/r4/CodeSystem/$lookup?system=http://hl7.org/fhir/sid/ndc&amp;code=0409-3718-01\">0409-3718-01</a> and <a href=\"http://tx.fhir.org/r4/CodeSystem/$lookup?system=http://hl7.org/fhir/sid/ndc&amp;code=00409371801\">00409371801</a>) and that will be successful (also $validate-code and other operations should work).  What is not yet available on <a href=\"http://tx.fhir.org\">tx.fhir.org</a> is a 'code-type' (or similar name) property and filter that can be used to define something like an \"NDC 11-digit only\" value set.  That should be coming, though (although I can't say exactly when it will be there).  Some resource examples that show how that is expected to work are posted on this <a href=\"#narrow/stream/179202-terminology/topic/Multiple.20Codes.20for.20Concepts\">topic</a> (on June 15th).</p>",
        "id": 243012156,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623934353
    },
    {
        "content": "<p>The current version of NDC on <a href=\"http://tx.fhir.org\">tx.fhir.org</a> is outdated (20190321).  That should be updated soon (I expect within the next 48 hours).</p>",
        "id": 243012585,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1623934600
    },
    {
        "content": "<p>Here's a further FYI that the additional implmentation for the NDC 10 and 11 digit codes has now been done on <a href=\"http://tx.fhir.org\">tx.fhir.org</a>.  Here's an example: <code>http://tx.fhir.org/r4/CodeSystem/$lookup?system=http://hl7.org/fhir/sid/ndc&amp;code=00409371801</code>.  You should now be able to create value sets that contain only 11-digit or 10-digit codes, using the <code>code-type</code> property.  The NDC content is still out of date (I wasn't able to get to that within 48 hours), but I'm hoping to take care of that today.</p>",
        "id": 243930944,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1624634800
    },
    {
        "content": "<p>Just want to confirm that an 11 digit NDC with hyphens would not be considered valid?  \"49483-0604-50\" vs. \"49483060450\"**</p>\n<p>** - that is an NDC11 for the biggest package and strongest dose of ibuprofen which we probably all collectively could use. ;-)</p>",
        "id": 243960910,
        "sender_full_name": "Kate Dech",
        "timestamp": 1624649873
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217850\">@Kate Dech</span> Yes, the NDC11 codes should be without dashes.  To say that they are \"not valid\" is slightly difficult, because the 11-digit codes aren't actually published as part of the NDC source in the first place.  But the 11-digit codes are \"semi-officially\" recognized and have important usage in some particular contexts, and in every case that I'm aware of they are represented without the dashes.</p>",
        "id": 244488969,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1625087747
    },
    {
        "content": "<p>And I can also report that the NDC content on <a href=\"http://tx.fhir.org\">tx.fhir.org</a> has now been updated to be current as of 2021-06-27.</p>",
        "id": 244489059,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1625087781
    }
]