[
    {
        "content": "<p>Hi All,</p>\n<p>I'm with Aetna and implementing the CARIN EOB, Coverage profiles. We are making a few assumption and wanted to see what other health plans are doing. Please let me know if this isn't the right stream to post this in.</p>\n<p>Questions......</p>\n<ol>\n<li>EOB.payee - Description: recipient of benefits payable - Is this the billing provider? We are assuming it's the billing provider.</li>\n<li>Enterer - Description: Author of the claim - Reference to Practitioner or PractitionerRole -  How do we determine which resource to use for our referenece? </li>\n<li>When mapping claims data to MedicationRequest - Status is required - We are defaulting it to 'completed' since we are assuming the claim was received since the prescription was filled. </li>\n<li>HealthClaim status - defaulting to 'unknown'</li>\n<li>Date searches for Coverage - If a single date is given, we only return the coverages where the start and end date is in between the start and end dates of the coverage span. If a date span is given in search, we would return all coverage spans that fall in to that date range. </li>\n<li>Regarding the rule to provide history back to 1/1/2016 - would this be Service Date or Adjudication Date? Assuming it's Adjudication Date</li>\n</ol>\n<p>Thanks in advance.<br>\nJoel</p>",
        "id": 199702495,
        "sender_full_name": "Joel Hansen (Aetna)",
        "timestamp": 1591242558
    },
    {
        "content": "<p>Mhh, there should not be anything mapped to MedicationRequest . . . pharmacy claim meds go inside the ExplanationOfBenefit</p>",
        "id": 199742439,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1591275627
    },
    {
        "content": "<blockquote>\n<ol start=\"5\">\n<li>. . . If a date span is given in search, we would return all coverage spans that fall in to that date range.</li>\n</ol>\n</blockquote>\n<p>That should be that overlap the specified date span - so if <code>. . . &amp;ge2018-01-01&amp;le2020-01-01</code> coverages for any part of those two years match. (see the column about ranges at <a href=\"http://hl7.org/fhir/search.html#prefix\">http://hl7.org/fhir/search.html#prefix</a>)</p>",
        "id": 199743489,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1591276094
    },
    {
        "content": "<p>Michele, <br>\nThanks for the reply.  We'll take another look at that reference to MedicationRequest. Also, thanks for the link to the prefixes.</p>",
        "id": 199752574,
        "sender_full_name": "Joel Hansen (Aetna)",
        "timestamp": 1591279991
    },
    {
        "content": "<p>#6 - We are planning to build based on DOS. Rule did call out Date of Service(DOS) for both Patient Data Access API and Payer-Payer Data Exchange.</p>",
        "id": 199763229,
        "sender_full_name": "Bhanu Vemuri",
        "timestamp": 1591284189
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"197261\">@Bhanu Vemuri</span> !</p>",
        "id": 199771367,
        "sender_full_name": "Joel Hansen (Aetna)",
        "timestamp": 1591287279
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"296344\">@Joel Hansen (Aetna)</span> I'm copying a few of our technical leadership team to weigh in. <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> <span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span> <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span>. For #6, it's definitely DOS back to 1/1/2016.  I would also encourage you to examine the deck we provided to the CARIN community meeting earlier in this thread. <a href=\"#narrow/stream/204607-CARIN-Blue.20Button.20IG/topic/API.20and.20Search.20Params/near/199681980\">https://chat.fhir.org/#narrow/stream/204607-CARIN-Blue.20Button.20IG/topic/API.20and.20Search.20Params/near/199681980</a></p>",
        "id": 199922213,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1591384706
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> Thanks for the reply. I'll take a look at that community meeting deck as well.</p>",
        "id": 199922946,
        "sender_full_name": "Joel Hansen (Aetna)",
        "timestamp": 1591385100
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"296344\">@Joel Hansen (Aetna)</span> , thank you for your questions. Have you looked at the guidance provided within the CARIN BB IG's CPCDS-to-FHIR mapping document? The balloted version is available on <a href=\"http://hl7.org/fhir/us/carin-bb/2020Feb/Mapping_from_CPCDS_to_FHIR_Resources.html\">this</a> page (Mapping Worksheet section) while an updated interim copy is available on <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=82911348\">this</a> page. We will be making updates to the interim copy during the IG's ballot reconciliation.</p>\n<p>Please see answers below:</p>\n<ol>\n<li>The billing provider is EOB.provider. When the EOB.payee.type is provider, EOB.payee.party should be the same billing provider.</li>\n<li>We do not map the personnel completing claims; only the billing provider.</li>\n<li>We do not map to MedicationRequest. In any case, from the standpoint of claims, I believe MedicationDispense may be more appropriate and may be considered for mapping in the next version (STU2). For now, please refer to the EOBPharmacy profile in the mapping document.</li>\n<li>Did you mean EOB.status? If so, please refer to the mapping document for values.</li>\n<li>We do not map Coverage start and end dates (but plans can still populate and return them). For Coverage and other resources' search information, please see updated interim copy of Search document on <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=82911348\">this</a> page.</li>\n<li>It is Service Date.</li>\n</ol>\n<p>Regards,<br>\n-Amol Vyas</p>",
        "id": 200081136,
        "sender_full_name": "Amol Vyas",
        "timestamp": 1591613037
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> Thanks for the reply and the update. </p>\n<p>One more question, when it comes to searching by date, like date of service on EOB; do all Prfixes have to be supported by the search?</p>",
        "id": 200290353,
        "sender_full_name": "Joel Hansen (Aetna)",
        "timestamp": 1591736723
    }
]