[
    {
        "content": "<p>Do we all agree that the specs to follow for app authorization to access the data are the SMART on FHIR ones: <a href=\"http://www.hl7.org/fhir/smart-app-launch/\">http://www.hl7.org/fhir/smart-app-launch/</a> ?</p>",
        "id": 197745037,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589572512
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> yes, that's what the IG says</p>",
        "id": 197745222,
        "sender_full_name": "Benjamin Langley",
        "timestamp": 1589572629
    },
    {
        "content": "<p>OK, thanks</p>",
        "id": 197747708,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589574020
    },
    {
        "content": "<p>The use case is apps used by patients to access their data, so the relevant flow is standalone launch sequence: <a href=\"http://www.hl7.org/fhir/smart-app-launch/#standalone-launch-sequence\">http://www.hl7.org/fhir/smart-app-launch/#standalone-launch-sequence</a></p>",
        "id": 198063627,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589894212
    },
    {
        "content": "<p>.../metadata should be accessible without authorization, and the returned CapabilityStatement should contain the OAuth2 authorize and token URLs (that's the first step in that flow)</p>",
        "id": 198063717,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589894258
    },
    {
        "content": "<p>Access should typically be only to the data of the patient, so access scope can be a general <code>Patient/*.read</code> or specific <code>Patient/ExplanationOfBenefit.read Patient/Coverage.read Patient/Pateint.read . . . .</code></p>",
        "id": 198063957,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589894388
    },
    {
        "content": "<p>The app typically needs the id of the patient, so <code>launch/Patient</code> should be supported</p>",
        "id": 198064033,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589894414
    },
    {
        "content": "<p>..and <code>offline_access</code> for confidential app that want a refresh token</p>",
        "id": 198064111,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589894457
    },
    {
        "content": "<p>The <code>state</code> parameter passed to the authorization server must be preserved (typically app use it to keep track of each authorization sequence), see <a href=\"http://www.hl7.org/fhir/smart-app-launch/#step-1-app-asks-for-authorization\">http://www.hl7.org/fhir/smart-app-launch/#step-1-app-asks-for-authorization</a>: 'The authorization server includes this value when redirecting the user-agent back to the client.'</p>",
        "id": 198064385,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589894592
    },
    {
        "content": "<p>Finally: bonus for supporting OpenID connect for single-sign on (<code>openid fhirUser</code> scopes)</p>",
        "id": 198065799,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589895243
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> maybe this should be emphasized? Most of the server appear not to be compliant and I just heard from people saying 'we are not planning to implement it'</p>",
        "id": 198220031,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589990596
    },
    {
        "content": "<p>I agree <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>, we'd like clarification on whether we need to implement 'SMART App Launch' or just OAuth2/OpenID from the perspective of the 2021 CMS ruling. We are under the assumption that SMART App Launch is out of scope for the 2021 ruling. Thanks.</p>",
        "id": 198231342,
        "sender_full_name": "Aju Jacob",
        "timestamp": 1589995943
    },
    {
        "content": "<p>The CMS ruling does not really specify that level of detail, does it? It just point to CARIN BB IG - that _does_ include SMART app launch</p>",
        "id": 198234058,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589997232
    },
    {
        "content": "<p>Also: if you do not have SMART app launch how do the app know which (FHIR) patient to use? Which permissions scopes to require?</p>",
        "id": 198234144,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589997266
    },
    {
        "content": "<p>The CARIN BB IG will call out compliance with the SMART Application Launch Framework IG</p>",
        "id": 198239682,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1589999865
    },
    {
        "content": "<p>... is required</p>",
        "id": 198242042,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1590001020
    },
    {
        "content": "<p>Proposed language (language is not final): <br>\nThe IG will require the use of the SMART App Launch Framework’s standalone launch sequence and data holders SHALL support the use of the launch/Patient scope. The use of the launch/Patient scope will make it clear to an application the patient context that must be used for the duration of the connection. The authorization sequence supports the ability for data holders to provide a patient selection widget that can be used to enable delegated access to member information. Details about the SMART App Launch Framework and standalone launch sequence can be found here: <a href=\"http://www.hl7.org/fhir/smart-app-launch/#standalone-launch-sequence\">http://www.hl7.org/fhir/smart-app-launch/#standalone-launch-sequence</a></p>",
        "id": 198317344,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1590066053
    },
    {
        "content": "<p>Agree with <span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span> and <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span>. Health plans need to implement the SMART App Launch Framework standalone launch sequence similar to what the provider community has implemented to support user authentication. This is critically important for multiple reasons including: the health care app community uses today as the central way in which they are authenticating users, it's a proven framework that is working in production today, and it's the primary way a health plan/data holder will know the request is coming from an individual by leveraging the member portal UN/PW for authentication.</p>",
        "id": 199387975,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1591027709
    },
    {
        "content": "<p>Hello, I work with the States running their Medicaid programs helping them to meet the CMS mandate on interoperability and Patient Access. While working with couple of States, we realize that most of them dont have an existing Member (Patient) Portal where members have already registered and have existing user credentials. OAuth and OpenID Connect standards do expect a member to have their user credentials already set up with the healhplan (State Medicaid in this case) before they can utilize the third party app to access their health data through API. I was wondering if you have any recommendation for patient authentication flow in these circumstances. </p>\n<p>When there is already an existing member portal credential available, we are designing the API so that member can authenticate themselves by providing the userid and password of their Member portal account.</p>",
        "id": 209028112,
        "sender_full_name": "Sudheesh Thuruthiyil",
        "timestamp": 1599166398
    },
    {
        "content": "<p>For organizations that do not have an existing way to authenticate their beneficiaries... part of the job of ensuring API access will be creating a way to authenticate their beneficiaries. Common approaches for bootstrapping this kind of thing include knowledge-based identity proofing; this is sometimes combined with mailing out a sign up code to a person's home address.</p>",
        "id": 209034838,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599170640
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"337176\">@Sudheesh Thuruthiyil</span>: We would be happy to further discuss offline how you could procure an identity and access management (IAM) solution independent of developing a portal portal infrastructure and still use SMART. I will send you an email offline to discuss.</p>",
        "id": 210059556,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1600115743
    }
]