[
    {
        "content": "<p>We are working on audit logging and audit trail. We are trying to figure out how much history to track in our auditlog. We started at 1 year of history, but it seems like that might not be enough. Just checking to see what others are planning and if anyone has any idea how far back CMS might go during an Audit.</p>",
        "id": 200290791,
        "sender_full_name": "Joel Hansen (Aetna)",
        "timestamp": 1591736929
    },
    {
        "content": "<p>yes it is common for audit logs to be maintained for a short period of time, just long enough for all the expected analysis to be done.  This analysis is usually driven by business needs, and regulations including local regulations.  The timeframe is also recognizing that these analysis is also not usually a priority task so often gets delayed. The typical is to copy the logs to offline media when purging from real-time database access, to cover the exceptions. Further, the purging is often done using different timeframes per the kind of audit log entry. For example, because HIPAA requires an accounting of disclosures back 7 years, this often drives EXPORT type audit events to be preserved for 7 years while other events are purged at 1 year (alternatively these potential disclosure events are moved into a purpose specific system or report)   --- so the answer is  going to vary greatly, and be more based on local regulations and speed at which analysis can be done.</p>",
        "id": 200408377,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591791780
    },
    {
        "content": "<p>see <a href=\"http://build.fhir.org/secpriv-module.html#audit\">http://build.fhir.org/secpriv-module.html#audit</a></p>",
        "id": 200408503,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591791844
    },
    {
        "content": "<p>I welcome recommendations for improving the text in the spec, so if you get good advice, please recommend it with a change request.</p>",
        "id": 200408598,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591791919
    },
    {
        "content": "<p>It seems like AuditEvent was intended for use with req/res within a FHIR server, i.e. you'd query AuditEvents just like any other FHIR resource. Thoughts on publishing AuditEvent to a logstream? So the AuditEvents are not maintained (or queryable) by the FHIR server proper; but rather, downstream of the logstream, e.g. your SIEM tool.</p>\n<p><a href=\"#narrow/stream/179247-Security-and.20Privacy/topic/HL7.20v2.20MITM/near/196130176\">https://chat.fhir.org/#narrow/stream/179247-Security-and.20Privacy/topic/HL7.20v2.20MITM/near/196130176</a><br>\nSeems to suggest pick your poison?</p>",
        "id": 200734423,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1592002913
    },
    {
        "content": "<p>yes you can do that, and I know of implementations that have. Thus they really are just using the json encoding of AuditEvent to provide a structure to their logstream.   Doesn't mean that you can't add a FHIR compliant query supporting only AuditEvent on your audit log server</p>",
        "id": 200764423,
        "sender_full_name": "John Moehrke",
        "timestamp": 1592051962
    },
    {
        "content": "<p>In fact the basis for AuditEvent, being the IHE-ATNA profile, does use syslog as the transport.</p>",
        "id": 200764494,
        "sender_full_name": "John Moehrke",
        "timestamp": 1592052072
    }
]