[
    {
        "content": "<p>We recently had a question come in regarding the what the expected values of an ExplanationOfBenefit.related.reference element should be. This is an Identifier type element (meaning it is a business identifier) defined in the base FHIR standard as \"An alternate organizational reference to the case or file to which this particular claim pertains.\"<br>\nThe question is: What needs to be populated in this Identifier object.<br>\nMy assumption here would be that it would include whatever information is necessary to identify the related claim, including who the assigner is. There may be several ways of doing that in an Identifier type object, so I thought I would open it up for an implementer or a payer to add some more insight from their perspective. Perhaps <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> or <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> ?</p>",
        "id": 225887557,
        "sender_full_name": "Corey Spears",
        "timestamp": 1612982757
    },
    {
        "content": "<p>After follow-up with the CARIN BB project team, the EOB related.reference is meant to refer to related adjusted claims that already have a claim number. <br>\nBy default it is assumed that the same organization (payer) that is providing the original claim information is also the one that assigned any related claim number. <br>\nAssuming that is the case, the only element that should have to be populated under normal circumstances in the related.reference is value (ExplanationOfBenefit.related.reference.value) since the assigner can be inferred by the context of the resource.<br>\nI would note that this is a little different than common Identifier practice. I will research this further and hope to post more information on this thread.<br>\n<span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span></p>",
        "id": 226023288,
        "sender_full_name": "Corey Spears",
        "timestamp": 1613063010
    },
    {
        "content": "<p>As noted above, the use of the Identifier type in this IG is a little different than best practice for FHIR Identifiers. That is to say, where we want computationally unique identifiers. In the CARIN BB use case for related claims, computationally unique identifiers may not be readily available, but there is value in providing those identifiers for other uses, such as human to human interactions. This could be aided by providing an Identifier.type.text in addition to the identifier.value.</p>",
        "id": 227519039,
        "sender_full_name": "Corey Spears",
        "timestamp": 1614120842
    },
    {
        "content": "<p>To add some more clarification. After discussion with the group, this related reference is the relation to another EOB, not a claim specifically.</p>",
        "id": 230085936,
        "sender_full_name": "Corey Spears",
        "timestamp": 1615578035
    }
]