[
    {
        "content": "<p>We have a client who does not have diagnosis data with their claims.  I see that in the C4BB professional profile this is set as required, how should handle this?</p>",
        "id": 234200100,
        "sender_full_name": "Jason Buys",
        "timestamp": 1618249296
    },
    {
        "content": "<p>The CARIN BB Implementation Guide is meant to reflect data that is included with claims transactions. Do you have more information on your use case or could you join us in a call to discuss?</p>",
        "id": 234266593,
        "sender_full_name": "Corey Spears",
        "timestamp": 1618288019
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> Medicaid programs for long term care at home for the elderly may not have a diagnosis related to it because it's being billed for things like meal service. Like <span class=\"user-mention\" data-user-id=\"404961\">@Jason Buys</span>  asked, how do we code this if there's no diagnosis on the claim. <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> Do you guys have thoughts on this?</p>",
        "id": 234776435,
        "sender_full_name": "Ngan MacDonald",
        "timestamp": 1618533113
    },
    {
        "content": "<p>Isn't the patient in the LTC facility for a reason? Dementia - that's a diagnosis. Why is the LTC facility billing for room and board? Diagnosis - Dementia.</p>",
        "id": 234854000,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1618580217
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"363271\">@Ngan MacDonald</span> <span class=\"user-mention\" data-user-id=\"404961\">@Jason Buys</span> My understanding is that all claim formats require at least one diagnosis code. What format are the claims are being billed on?  <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span></p>",
        "id": 235553117,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1619027377
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span> No, the patient is frail. In Wisconsin, there is Medicaid programs directed towards keeping patients in their home. There are a host of non-diagnostic services (house cleaning, meals on wheels, etc. that are not tied to a specific diagnosis. <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> Not all claim formats require a diagnosis in this case. The patient is assessed as frail and need additional support. <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> Have you guys dealt with implementors for Medicaid Care Organizations that are more social type of support than medical support?</p>",
        "id": 235684254,
        "sender_full_name": "Ngan MacDonald",
        "timestamp": 1619100556
    },
    {
        "content": "<p>Wouldn't that fall under:<br>\n 2021 ICD-10-CM Diagnosis Code R54  <br>\nAge-related physical debility<br>\n2016 2017 2018 2019 2020 2021 Billable/Specific Code Adult Dx (15-124 years)<br>\nR54 is a billable/specific ICD-10-CM code that can be used to indicate a diagnosis for reimbursement purposes.<br>\nThe 2021 edition of ICD-10-CM R54 became effective on October 1, 2020.<br>\nThis is the American ICD-10-CM version of R54 - other international versions of ICD-10 R54 may differ.<br>\nICD-10-CM Coding Rules<br>\nR54 is applicable to adult patients aged 15 - 124 years inclusive.<br>\nApplicable To<br>\nFrailty<br>\nOld age<br>\nSenescence<br>\nSenile asthenia<br>\nSenile debility</p>",
        "id": 235687670,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1619101718
    },
    {
        "content": "<p>If we don't have the diagnosis on the claim, so I'm not saying that there are none applicable, just a question of what happens if we don't have it.</p>",
        "id": 235693563,
        "sender_full_name": "Ngan MacDonald",
        "timestamp": 1619103708
    },
    {
        "content": "<p>Depends on the consumer of the resource, do they care if the diagnosis is populated. <br>\nPayor, probably cares. Member, probably not. Validator, cares.</p>",
        "id": 235696824,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1619104558
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"363271\">@Ngan MacDonald</span>  Could you provide the actual documentation where you think a claim format does not require a diagnosis code? Both the 837 Institutional and 837 Professional claim absolutely require at least one diagnosis code. It is not even a situational data element.  The UB-04 manual also requires at least one diagnosis on the UB-04 and the 1500 instruction manual directs the diagnosis be reported.</p>",
        "id": 235724455,
        "sender_full_name": "Gail Kocher",
        "timestamp": 1619115532
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"231038\">@Gail Kocher</span> I'm not trying to say that a claim format doesn't require a diagnosis code, I'm trying to introduce a situation in which claims are sent in non-EDI format, are paid for by Medicaid in the state and in this situation, the diagnosis code is not required.</p>",
        "id": 235730172,
        "sender_full_name": "Ngan MacDonald",
        "timestamp": 1619117853
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"363271\">@Ngan MacDonald</span>  The paper claim forms also require diagnosis codes.</p>",
        "id": 235730674,
        "sender_full_name": "Gail Kocher",
        "timestamp": 1619118058
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"231038\">@Gail Kocher</span> Medicaid doesn't require a diagnosis code. They are phasing in zcodes for SDOH type of situations, but it's not rolled out.</p>",
        "id": 236690328,
        "sender_full_name": "Ngan MacDonald",
        "timestamp": 1619708907
    },
    {
        "content": "<p>PlannetNetwork Profile definition:<br>\nA Network refers to a healthcare provider insurance network. A healthcare provider insurance network is an aggregation of organizations and individuals that deliver a set of services across a geography through health insurance products/plans. A network is typically owned by a payer.</p>\n<p>In the PlanNet IG, individuals and organizations are represented as participants in a PLan-Net Network through the practitionerRole and Plan-Net-organizationAffiliation resources, respectively.</p>\n<p>Question:<br>\n1.Do we create one PlannetNetwork profile for Medicaid? Yes, and by extension the Plannet Insurance profile.<br>\nIf so, how do we identify Medicaid for the data elements needed to create the PlannetNetwork profile (which is based on the Organization profile)?</p>\n<p>For example, Organization ID.<br>\nMedicaid does not have a provider ID. How do we identify Medicaid?</p>",
        "id": 254557619,
        "sender_full_name": "Anil Samuel",
        "timestamp": 1632412003
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"443912\">@Anil Samuel</span>, Your question does not match the topic of this thread nor the scope of the <a class=\"stream\" data-stream-id=\"204607\" href=\"/#narrow/stream/204607-CARIN-IG-for-Blue-Button.C2.AE\">#CARIN IG for Blue Button®</a> stream. <br>\nPerhaps you could post it in the <a class=\"stream\" data-stream-id=\"229922\" href=\"/#narrow/stream/229922-Da.2BVinci.2BPDex.2BPlan-Net\">#Da+Vinci+PDex+Plan-Net</a> stream to get to the right audience?</p>",
        "id": 254559561,
        "sender_full_name": "Corey Spears",
        "timestamp": 1632412717
    }
]