[
    {
        "content": "<p><span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> Howdy, friendly CARIN and FHIR folks. I'm staring at a chunk of our (CMS Blue Button) data schema and mapping and also the CARIN IG and kinda' just... stumped. Maybe someone here can help. Here's what we've got:</p>\n<ol>\n<li>At the line/item level in our claims, we have a bunch of identifiers in the raw data that are <em>probably</em> all \"synonyms\" for each other, or at least related to each other: <code>PRF_PHYSN_NPI</code>, <code>PRF_PHYSN_UPIN</code>, <code>CARR_PRFRNG_PIN_NUM</code>, then <code>ORG_NPI_NUM</code>, and then <code>TAX_NUM</code>.</li>\n<li>We also have a bunch of fields _related_ to those, e.g. <code>PRVDR_STATE_CD</code>, <code>PRVDR_SPCLTY</code>, etc.</li>\n<li>Right now, we're almost certainly doing the wrong thing: mapping <code>PRF_PHYSN_NPI</code> when it's present to an <code>EOB.careTeam</code> entry that's just a <code>Reference.identifier</code> and then hanging most everything else off of it as an extension.</li>\n<li>We <strong>do not</strong> have a reliable, canonical source of provider data accessible to us right now that we can trust matches the data in the claims.</li>\n</ol>\n<p>I'm thinking that this approach will need to shift in a future (backwards incompatible) version of our API, but I'm not entirely sure what the right approach would be. Data at scale is messy, and so we can't really rely on any one of those fields to always be present, or for any particular combo of them to be. We need a mapping solution that works both when the only thing present is <code>PRF_PHYSN_UPIN</code>, or the only thing present is <code>TAX_NUM</code>, or when <strong>all</strong> of the fields are present.</p>\n<p>Right now my best idea is that we should be mapping these to <code>EOB.careTeam</code> entries that are instead contained <code>Practitioner</code> and/or <code>Organization</code> resources. Except <code>TAX_NUM</code> -- we have no way of knowing if that refers to a person or to an org, and so it'll probably have to be mapped to a separate <code>EOB.careTeam</code> entry that's just a <code>Reference.identifier</code>. So: any one line item might refer to three separate <code>EOB.careTeam</code> entries.</p>\n<p>Does that all sound kinda' sorta' right or does someone have a simpler approach?</p>",
        "id": 217202910,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1605737123
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"192789\">@Karl M. Davis</span> our friendly CMS friend. ;) Since this sounds like it's specific to CMS, my suggestion is for <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span> to invite you to attend one of our upcoming small group IG development calls with <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> <span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span> <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> and others so we can brainstorm the best approach here. We can then bring a draft solution back to the broader HL7 community through our public CARIN calls and via this chat to get their thoughts on a suggested approach. Will that work?</p>",
        "id": 218367808,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1606783664
    },
    {
        "content": "<p>Karl,</p>\n<p>What you are looking at are the additional identifiers for the provider that is being referenced that come in on claims. Some are from Prior to NPI and others are still 'allowed' within the claim. </p>\n<p>At the claim line (for Inpatient Claims) there can be an Operating Physician, Other Operating Physician, Rendering Provider, Referring Provider.<br>\nFor each referenced provider you can have: NPI, State License Number (thus state identifier needed), Provider UPIN, Location Number, and Provider Commercial Number.  Tax IDs at the line level are no longer allowed (with the 5010 at least). Only a billing provider or pay to provider now has a tax id.</p>\n<p>Others are elements required by Medicare for editing during adjudication - State Code and billing/attending provider Specialty</p>\n<p>There are a lot of things you 'could' do here. Could 'derive' orgaznization/practitioner from the claim type or specialty. Does the EOB really need the Tax ID of the operating surgeon from 5 years ago?</p>\n<p>And I agree with Ryan, an overall industry approach would be helpful - Medicare won't be the only payer with this issue!</p>",
        "id": 218724312,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1607015281
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192789\">@Karl M. Davis</span> .  Is the list you provided your complete lists or examples?  I have some preliminary thoughts on how some of these could be mapped.  <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span> <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span></p>",
        "id": 218855083,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1607098912
    },
    {
        "content": "<p>We're on it! Our smaller team will work with <span class=\"user-mention\" data-user-id=\"192789\">@Karl M. Davis</span> to develop a draft approach and we'll present it on our HL7 CARIN calls in January for those who are interested in weighing in.</p>",
        "id": 219998685,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1608047747
    },
    {
        "content": "<p>I need a Zulip remind me bot to yell at me about this next week. Right now, we have an internal meeting scheduled to brainstorm approaches for later this week, though with illnesses and weather and all that I suspect it’s going to get postponed until early next year.￼</p>",
        "id": 220017183,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1608055076
    }
]