[
    {
        "content": "<p>There has been a bit of discussion regarding the definition of Must Support and how it is used in the CARIN BlueButton. The <a href=\"http://hl7.org/fhir/us/carin-bb/2022Jan/General_Guidance.html#must-support\">current ballot MS definition</a> has the following lines of interest:</p>\n<ul>\n<li>Health Plan API actors SHALL be capable of populating all data elements as part of the query results as specified by the CARINBlueButtonHealthPlanAPICapabilityStatement.</li>\n<li>In situations where information on a particular data element is not present and the reason for absence is unknown, Health Plan API actors SHALL NOT include the data elements in the resource instance returned as part of the query results.</li>\n</ul>\n<p>Interpretations I have heard of this is that servers (Health Plan API actors) must be able to create instances with the data elements marked as Must Support (meaning they must somehow support the concept (i.e. capture/store/derive it) and be able to express it in a FHIR instance). However, in any particular instance, the data may not be available and therefore not be present in such instances. (e.g. if patient given name is 0..* MS, the system would have to have the field in the DB, but if the info was not available for a particular patient, the FHIR resource created without it would still be considered conformant))</p>\n<p>The concern raised with this interpretation is that this would require servers to add these elements to their system in order to add the ability to send the data (even if these servers never end up doing so in practice). My understanding from those that raised the concern is that the intent for BB was to require the data be present only if it is supported (in any capacity) and the instance had the data. (e.g. a system would still be conformant if it did not support patient given name at all in the previous example).</p>\n<p>With that intent in mind, it seems to me that the definition of Must Support would need to be rewritten and the effects of such a rewrite would need to be evaluated (as the requirement: if you have the data, then send it; is very different than: you must be able to have the data to send)). </p>\n<p>It would be helpful if <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> and <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> could weigh in.<br>\ncc: <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>  <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span></p>",
        "id": 275444887,
        "sender_full_name": "Corey Spears",
        "timestamp": 1647383801
    },
    {
        "content": "<p>The implementers concern is correct.  If you mark something as 'mustSupport' and the system doesn't support it, then (barring language in the spec that declares otherwise), a system would have to add that capability to their software in order to conform.  You could revise the first bullet to say:<br>\nHealth Plan API actors SHALL be capable of populating all data elements <strong>they possess</strong> as part of the query results...</p>",
        "id": 275445388,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647384083
    },
    {
        "content": "<p>The intention in some places that mustSupport is used is absolutely to drive new capabilities into software in order to comply with the IG.</p>",
        "id": 275445469,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647384124
    },
    {
        "content": "<p>Note that, if you soften the language, then a system could comply that had no capability of sending <em>any</em> optional elements in the spec (which might be too low a bar to be useful).</p>",
        "id": 275445530,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647384162
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . This comports with my position on the current CARIN BB Must Support definition (and explains it in a different way than I have been).<br>\nAlso, thanks for the additional note. I agree, with the potential concern about where the bar is set (a system would not have to support any MS elements except those with a min lower cardinality of 1), which is why I think we would need to evaluate  the effect of each MS element to make sure the intent applies for each.</p>",
        "id": 275447046,
        "sender_full_name": "Corey Spears",
        "timestamp": 1647385144
    },
    {
        "content": "<p>Personally, I think it is a mistake to allow IGs to redefine the meaning of Must Support. Does that mean that if I write an IG I can change Must Support: Do whatever you want. An extreme example but when we have regulation that governs the use of IGs having one IG say Must Support = A while the other says Must Support = X and there are shared resources is another layer of complexity. (Oh that resource, in this instance, was exported under the IG X rule of support.)</p>",
        "id": 275502004,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1647432981
    },
    {
        "content": "<p>you can only change what must support means within your IG, you can't redefine other IGs definitions of must support, including those other IGs that you dependon...</p>",
        "id": 275505104,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647434829
    },
    {
        "content": "<p>That said, it was all we could do at the time... I think we now can do better, with a vocabulary of flavors of what people are using must support for today.</p>",
        "id": 275505167,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647434869
    },
    {
        "content": "<p>That's what I'm saying, when there are 2 IGs and there are resources in common and they must both be used due to regulation. Then how can Must Support have different definitions?</p>",
        "id": 275511952,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1647438353
    },
    {
        "content": "<p>They can differ in many ways, but regulated systems will need to support the union of the requirements.</p>",
        "id": 275512103,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647438410
    },
    {
        "content": "<p>Personally I find \"Must Support\" a distraction. That is: I find it's easier to think about the specific \"SHALL\" requirements that apply to specific data elements. I say this because \"Must Support\" itself doesn't need to have any consistent meaning even within an IG (let alone across IGs), so it's really just a reminder to \"navigate to this other page of the IG where more requirements are listed\" (rather than a clear indication or requirement in its own right).</p>",
        "id": 275512575,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647438616
    },
    {
        "content": "<p>Simple example - one IG is for a decision support solution, one is for a simple patient portal app.  For the first, mustSupport might mean \"must consider in logic\" and in the second case it might mean \"must persist, display to the user and allow data entry\".  There would literally be no overlap in the functionality between the two systems - the decision support system wouldn't persist, display or allow data capture of anything, and the patient portal app wouldn't have any decision support logic.</p>",
        "id": 275513314,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647438973
    },
    {
        "content": "<p>Must support is <em>always</em> tied to the specific use-case the IG is intended to satisfy.</p>",
        "id": 275513395,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647439021
    },
    {
        "content": "<p>The CARIN IG was defined under the premise that Must Support meant that a payer must provide data if it is available.  It doesn't make sense to require data a payer doesn't have.  I am concerned this new interpretation undermines the design of the CARIN IG and adds weighty requirements that don't provide value to the end consumer.  With this new interpretation, how will an IG convey that data must be provided if the payer or any other data server has it but isn't required if the data is not available?    <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span>  <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> <span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span> <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> <span class=\"user-mention\" data-user-id=\"192054\">@Viet Nguyen</span> <span class=\"user-mention\" data-user-id=\"331378\">@Vanessa Candelora</span></p>",
        "id": 275646957,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1647521632
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> I think you're saying you agree with the proposal at the top of the thread to add two words (\"they process\") to the definition as Lloyd suggested?</p>",
        "id": 275661485,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647527527
    },
    {
        "content": "<p>The problem is that the premise you mention, <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span>  was not written into the definition for CARIN BlueButton. While it may not meet the intention of the use case developers, I do not believe it to be a new interpretation of the text included in these parts of the CARIN BB MustSupport definition. The 2 components of the MS definition are nearly exact copies of US Core, and I believe what has been mentioned above is the overwhelming interpretation of those requirements.</p>\n<p>It sounds like we need to re-evaluate how the MS definition is written for this IG, likely picking up what <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> mentioned (\"they process\"), and look for potential unintended consequences of that change.</p>",
        "id": 275663654,
        "sender_full_name": "Corey Spears",
        "timestamp": 1647528367
    },
    {
        "content": "<p>An IG can do that (indicate mustSupport only means 'support if available').  However it must be explicit in the IG's definition of mustSupport.  It's not a default assumption.  And it creates a challenge in that some data that might be 'important' to be supported is now completely optional if the payer doesn't currently have that capability.</p>",
        "id": 275669206,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647530395
    },
    {
        "content": "<p>Yeah, we are going to have the be careful in our new definition. The general idea is that all of the data from the payers claims submission and processing that matches up with data elements in the guide needs to show up in the data made available to the member through the API. If we are too sloppy, there will be convenient loopholes to get out of the need to supply most any data (e.g. they have the data in their claims system, but they don't already have it as part of their current member portal API they built the FHIR API from, so therefore it is not data they are processing <em>for that purpose</em>).</p>",
        "id": 275672690,
        "sender_full_name": "Corey Spears",
        "timestamp": 1647531554
    },
    {
        "content": "<p>And to be clear: this community has a lot of shared context about these goals (and limitations) stemming from <a href=\"https://www.cms.gov/Regulations-and-Guidance/Guidance/Interoperability/index\">CMS requirements</a> (emphasis mine)</p>\n<blockquote>\n<p>Payers are required to make a patient’s clinical data, <strong>defined as those data the payer maintains</strong> that are included in the USCDI version 1, available via the Patient Access API.</p>\n</blockquote>\n<p>So the concept of \"those data the payer maintains\" is quite easy to justify, and was probably implicit in the current BB IG language.</p>",
        "id": 275673438,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647531803
    },
    {
        "content": "<p>Weighing in from a physician perspective, it might be helpful to think of this issue in terms of the end user. We agree with the commenters saying must support for data maintained by the payer, but we would also argue the definition of must support should include “those data the payer maintains or processes”. The question from our view is what would a reasonable physician likely expect from a payer when 1) querying a payer for supplemental medical information about their patient; and 2) when engaging with a payer for payment or operations purposes about their patient? In both instances, the payers should be expected to return data they maintain or process.</p>",
        "id": 276076672,
        "sender_full_name": "Celine A Lefebvre",
        "timestamp": 1647879607
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Yes, CMS's requirement of payers to make a patient's data, defined as those data the payer maintains, available to the Patient Access API, was a concept implicit in the current BB IG language.  I recommend adding the words \"they maintain\" to the IGs definition of Must Support <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> would you concur?  <span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span></p>",
        "id": 277136796,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1648643691
    },
    {
        "content": "<p>If you add \"they maintain\" to the must support definition that means that I don't have to populate or _be capable_ of populating if I don't maintain it?</p>",
        "id": 277142618,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1648646213
    },
    {
        "content": "<p>That is correct. For the general audience, it is important to note that CARIN BlueButton data is derived from the primary business process of claims processing. If the information is not used for that process, this IG should not require payers to add the ability to communicate it for Blue Button (There still would not be any process for which they would collect the data and therefore, practically speaking, it would never be populated in real world use).</p>\n<p>I have added a new ticket and solicit all to add comments for us to consider as we address the issue in the coming week or two: <a href=\"http://jira.hl7.org/browse/FHIR-36675\">FHIR-36675</a></p>",
        "id": 277218254,
        "sender_full_name": "Corey Spears",
        "timestamp": 1648685320
    },
    {
        "content": "<blockquote>\n<p>If you add \"they maintain\" to the must support definition that means that I don't have to populate or _be capable_ of populating if I don't maintain it?</p>\n</blockquote>\n<p>AND</p>\n<blockquote>\n<p>That is correct. </p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  -- Bring back any fond memories of our original US Core definition?</p>",
        "id": 277433714,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1648826270
    },
    {
        "content": "<p>CMS Guidance   <a href=\"https://www.cms.gov/Regulations-and-Guidance/Guidance/Interoperability/index\">https://www.cms.gov/Regulations-and-Guidance/Guidance/Interoperability/index</a>  requires \"that payers share the USCDI data they maintain with patients via the Patient Access API\".  The payer is accountable to comply with the CMS regulation.</p>",
        "id": 277475054,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1648845604
    },
    {
        "content": "<p>We need to separate </p>\n<ol>\n<li>When a query responder HAS the DATA. For this, I agree that they can't respond with data they do not have.</li>\n<li>When the responder's data repositories can support INCOMING data upstream from a future request. For this situation, I refer to US Core definition of Must Support - #pvxBPJ4Te7<br>\nSpecifically: \"US Core Responders SHALL be <em>capable</em> of populating all data elements as part of the query results as specified by the US Core Server Capability Statement.\" Italics for emphasis.</li>\n</ol>",
        "id": 277905248,
        "sender_full_name": "Viet Nguyen",
        "timestamp": 1649175751
    },
    {
        "content": "<p>So, the big question <span class=\"user-mention\" data-user-id=\"192054\">@Viet Nguyen</span> , Can you claim conformance if you canNOT support the INCOMING data upstream from a future request?</p>",
        "id": 277926420,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1649184324
    },
    {
        "content": "<p>Apologies, chiming in a bit late here but glad that we're discussing (or re-discussing?) this key concept.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/204607-CARIN-IG-for-Blue-Button.C2.AE/topic/CARIN.20BB.20MustSupport.20Definition/near/275513395\">said</a>:</p>\n<blockquote>\n<p>Must support is <em>always</em> tied to the specific use-case the IG is intended to satisfy.</p>\n</blockquote>\n<p>100% agreed. This is the basis of how the Common Payer Consumer Data Set (CPCDS) canonical data model definition drives the CARIN BB FHIR profile requirements through MustSupport under the CARIN BB/CMS Patient Access API use case.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"243554\">Pat Taylor</span> <a href=\"#narrow/stream/204607-CARIN-IG-for-Blue-Button.C2.AE/topic/CARIN.20BB.20MustSupport.20Definition/near/277136796\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> Yes, CMS's requirement of payers to make a patient's data, defined as those data the payer maintains, available to the Patient Access API, was a concept implicit in the current BB IG language.  I recommend adding the words \"they maintain\" to the IGs definition of Must Support <span class=\"user-mention silent\" data-user-id=\"192132\">Amol Vyas</span> would you concur?  <span class=\"user-mention silent\" data-user-id=\"191529\">Corey Spears</span></p>\n</blockquote>\n<p>Yes. IMO, always a good idea to provide additional guidance where possible, to clarify use case.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"192054\">Viet Nguyen</span> <a href=\"#narrow/stream/204607-CARIN-IG-for-Blue-Button.C2.AE/topic/CARIN.20BB.20MustSupport.20Definition/near/277905248\">said</a>:</p>\n<blockquote>\n<p>We need to separate </p>\n<ol>\n<li>When a query responder HAS the DATA. For this, I agree that they can't respond with data they do not have.</li>\n<li>When the responder's data repositories can support INCOMING data upstream from a future request. For this situation, I refer to US Core definition of Must Support - #pvxBPJ4Te7<br>\nSpecifically: \"US Core Responders SHALL be <em>capable</em> of populating all data elements as part of the query results as specified by the US Core Server Capability Statement.\" Italics for emphasis.</li>\n</ol>\n</blockquote>\n<p>I believe <span class=\"user-mention\" data-user-id=\"192054\">@Viet Nguyen</span>  hit the nail on the head; might the word <strong>capable</strong> as used in US Core MustSupport definition (<a href=\"http://hl7.org/fhir/us/core/conformance-expectations.html#must-support-elements\">http://hl7.org/fhir/us/core/conformance-expectations.html#must-support-elements</a>), allow for US Core Responders to not populate MS data elements that they do not maintain <strong>now</strong> (per the MS rules based on their cardinality) but still be conformant? These Responders can start populating those very same MS data elements (per the MS rules based on their cardinality) when they start maintaining them <strong>in the future</strong> and continue their conformance. I.e.</p>\n<p><em>US Core Responders <strong>SHALL be capable of populating</strong> all data elements as part of the query results as specified by the US Core Server Capability Statement.</em></p>\n<p>is not to be confused as:</p>\n<p><em>US Core Responders <strong>SHALL populate</strong> all data elements as part of the query results as specified by the US Core Server Capability Statement.</em></p>\n<p>Would love to hear what others think of this interpretation but this was the basis on which we have always maintained that the CARIN BB's MustSupport definition is aligned with US Core's.</p>\n<p>I also agree that this could possibly be abused by some Responders as a way to expose less data elements than what is MustSupport-ed and actually maintained, but that is where patients, members, Requestors/app developers can help highlight these instances comparing information presented by the same Responders on their portals, paper/electronic statements, apps, etc. I suspect that that may be the underlying spirit of CMS's/Fed government's rules around patient access to data.</p>\n<p>Other thoughts? <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 277927321,
        "sender_full_name": "Amol Vyas",
        "timestamp": 1649184731
    },
    {
        "content": "<p>To me, when it says Responders must be capable of populating an attribute. To me that means that an auditor can say, \"Show me a populated x, and if you cannot you fail.\" Doesn't mean that the Responder has to maintain that attribute for 99.99% of the resources in their system. But the system must be capable of doing so for the items the auditor is examining. Conformance is a data collection problem not a responder problem. The system must be capable of collecting the info, even if they choose not to the majority of the time.</p>\n<p>If you change conformance to MUST DO unless you don't want to(not capable of maintaining), then there is no point in even having must support.</p>",
        "id": 277928661,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1649185327
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span>  nailed what triggered us to improve the US Core definition: </p>\n<blockquote>\n<p>To me, when it says Responders must be capable of populating an attribute it means that an auditor can say, \"Show me a populated x, and if you cannot you fail.\"</p>\n</blockquote>\n<p>In a prior version of US Core (3.0.0 and 3.0.1) we had this text:</p>\n<blockquote>\n<p>NOTE: US Core Responders who do not have the capability to store or return a data element tagged as Supported in US Core profiles can still claim conformance to the US Core profiles per the US Core conformance resources.</p>\n</blockquote>\n<p>During conversations with Inferno (<span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>  and <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span> ) + several vendors <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> and I removed this text and removed many MS that were problematic for vendors to consistently support. US Core now reflects what a system will return when they have the data -- not what they will return IF they support the field and IF they have the data.</p>",
        "id": 277932090,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1649186950
    },
    {
        "content": "<blockquote>\n<p>Doesn't mean that the Responder has to maintain that attribute for 99.99% of the resources in their system. </p>\n</blockquote>\n<p>If a server can show one populated x, that is enough evidence that server is \"capable\" of populating x</p>",
        "id": 277937643,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1649189757
    }
]