[
    {
        "content": "<p><span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> </p>\n<p>Howdy all! Long time no see. The second half of 2019 was rather bonkers for me, with large architectural changes happening behind the scenes with Blue Button, and then the birth of our second child in November. I'm back from paternity leave as of last week, though, and starting to try and figure out what's in store for 2020.</p>\n<p>One of the many questions on my mind is this: <strong>What does this community (the CARIN Blue Button community, and also the wider FHIR community in general) need to be successful in 2020 that isn't already nailed down?</strong></p>",
        "id": 188509749,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1582077284
    },
    {
        "content": "<p>Obviously, I'm wondering specifically about things that folks feel either I or our little CMS Blue Button team can help with. (Not going to be solving world peace or anything like that soon.) <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 188509829,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1582077373
    },
    {
        "content": "<p>Just to seed the conversation a bit, I've got some ideas kicking around already (just things that are under consideration; no commitments)...</p>",
        "id": 188509851,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1582077446
    },
    {
        "content": "<ul>\n<li>Adding support for the CARIN Blue Button spec in a v2 of the CMS Blue Button 2.0 API.<ul>\n<li>We would have loved to do this last year, this quarter, etc. but just haven't been able to dedicate the resources yet.</li>\n</ul>\n</li>\n</ul>",
        "id": 188509906,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1582077516
    },
    {
        "content": "<ul>\n<li>More external blog posts about our internal architecture, technical tradeoffs, etc.<ul>\n<li>I've heard rumors of some other folks implementations that went badly awry (e.g. 20 minute response times for queries), so perhaps just being more open about how we did things would be helpful?</li>\n</ul>\n</li>\n</ul>",
        "id": 188509977,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1582077685
    },
    {
        "content": "<ul>\n<li>Better documentation of our API, e.g. interactive and rich Swagger docs.<ul>\n<li>I suspect this would be more useful for our users than other implementers, but maybe I'm wrong?</li>\n</ul>\n</li>\n</ul>",
        "id": 188510117,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1582077905
    },
    {
        "content": "<ul>\n<li>More participation in CARIN/FM calls, etc.<ul>\n<li>Already started trying to carve out time for all this again. Given everything else going on, it's tricky to manage.</li>\n</ul>\n</li>\n</ul>",
        "id": 188510178,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1582077981
    },
    {
        "content": "<ul>\n<li>Frequent posting of inspirational GIFs, e.g. the \"just hang in there\" kitty?</li>\n</ul>",
        "id": 188510190,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1582078040
    }
]