[
    {
        "content": "<p>Just curious - I saw a reference to a potential PSS for CARIN BB Pass ID on PIE's agenda this morning, but wasn't able to attend the quarter. What's a pass id? Is any more information available?</p>",
        "id": 224116040,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1611701221
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> CARIN is looking to develop a digital membership ID card with our health plan partners that consumers can use in an application of their choice. The PSS is located here: <a href=\"https://jira.hl7.org/browse/PSS-1671\">https://jira.hl7.org/browse/PSS-1671</a>. Happy to answer any questions you may have.</p>",
        "id": 224193973,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1611760029
    },
    {
        "content": "<p>For some reason that link seems to require a login. Is this expected?</p>",
        "id": 224194152,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611760107
    },
    {
        "content": "<p>Thank you, Ryan! Seems like a neat project.</p>",
        "id": 224225274,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1611771914
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span>  - I thought I had seen an agenda item for reviewing/discussing  that at the WGM, but of course, now I can't find it.  Did you review that PSS already at WGM and if so, which session so I can catch the recording?  thanks!</p>",
        "id": 224260367,
        "sender_full_name": "Carie Hammond",
        "timestamp": 1611787952
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/204607-CARIN-IG.20for.20Blue.20Button.C2.AE/topic/CARIN.20Pass.20ID/near/224194152\">said</a>:</p>\n<blockquote>\n<p>For some reason that link seems to require a login. Is this expected?</p>\n</blockquote>\n<p>It's on the HL7 JIRA which is where HL7 posts the PSS documents. You may need a log in to access it. <span class=\"user-mention\" data-user-id=\"194116\">@Carie Hammond</span> we did not review it at the WGM. I'm adding <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span> to discuss where and when it will be reviewed within FM and PIE. I believe we have discussed it within FM (minutes under the FM group) and may be presenting to PIE soon. Input welcome!</p>",
        "id": 224265582,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1611791083
    },
    {
        "content": "<p>Thanks - I'll be on the lookout</p>",
        "id": 224266124,
        "sender_full_name": "Carie Hammond",
        "timestamp": 1611791498
    },
    {
        "content": "<p>Hello all, <br>\nWe met with PIE last week and plan to return to the PIE WG as early as the 2/2 call. We need to make a few adjustments to the PSS based on feedback we received from PIE.</p>",
        "id": 224266446,
        "sender_full_name": "Mark Roberts",
        "timestamp": 1611791709
    },
    {
        "content": "<p>We should include MAY support for GET base/patient?_identifier=PASSID System|somecode</p>\n<p>This will allow the pass id to be used by consumers (and bring us closer to alignment with us core patient)</p>",
        "id": 224278572,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611802112
    },
    {
        "content": "<p>There is also a challenge around SMART scoping if we do not know the exact FHIR patient id (think we have a few options).</p>",
        "id": 224278590,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611802167
    },
    {
        "content": "<p>HI Mark, we have collected a lot of great onboarding materials as part of the CARIN connectathons. Can these materials be shared with the community plan implementers? I am attempting to gather training materials for a series that will be hosted by ACAP, alongside Mark Scrimshire. The CARIN content would be a great addition.</p>",
        "id": 224928372,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612296249
    },
    {
        "content": "<p>What is the advantage of the PASS ID over a health plan member id? Once CAQH is up we should define code systems for our member identifiers (perhaps our FHIR URL or public portal URL). A universal patient ID does not need to come from a single code system. I can even imagine an information (ID matching) network between trusted payers. We have a code system for a member ID we agreed to use in CARIN IG. Maybe a combination of Organization.identifier:payerid and Member ID. </p>\n<p>From an execution perspective, if we can get someone to log into two portals we can create a link. The more portals they add the more links we can create. The clinical data that includes a member id can now be linked as well.</p>\n<p>Basically, I think that any identity proofed ID can work. Is this an incorrect assessment?</p>",
        "id": 225113165,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612407121
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"260046\">@Cille Kissel Watkins</span> , do you have anything you can post here?</p>",
        "id": 225315567,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612540188
    },
    {
        "content": "<p>I was going on about following the WEDI standard because I think that will help us build trust in our member ids and coverage cards (if we begin to build an identity proofed member id network). When consumer logs in, it may be a good opportunity to create whatever identifier we decide to rally around.</p>",
        "id": 225316173,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612540440
    }
]