[
    {
        "content": "<p>Hi All, Can someone help me understand the Context for Practitioner? Meaning, is the Practitioner profile data intended to be  relevant at the point in time of the claim? The questions comes down to how do you source the Practitioner and PractitionerRole profiles, via claims or provider directory?  I intended to have this conversation yesterday during the WG session, though it appeared to be cancelled.  Appreciate any guidance that can be offered. <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span></p>",
        "id": 198048939,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1589885824
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> would you be able to help answer my question?</p>",
        "id": 198176518,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1589968893
    },
    {
        "content": "<p>Our tech team can weigh in here. <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> <span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span></p>",
        "id": 198187320,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1589975960
    },
    {
        "content": "<p>My take would be from provider directory if possible - the more up to date and complete data the better (in our system that's not the case currently, we return the providers data as it was entered together with the claim, but we'd like to get the provider directory data there at some point)</p>",
        "id": 198193489,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589979319
    },
    {
        "content": "<p>If sourcing Practitioner Profile out of the directory, couldn't there be a disconnect with Practitioner demographic detail provided on the claim?  Or is the intention to use PractitionerRole to represent the practitioner's engagement based on the claim detail with a reference to Practitioner for demographic details?</p>",
        "id": 198196202,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1589980561
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197108\">@Jason Teeple</span> This has been a topic of debate lately. The guidance that we are proposing is that this will depend upon the source system if they can provide the Patient, Practitioner, and Practitioner role as of the date of service of the claim or if they maintain only the current state of the Provider and Member. Not all payers systems are configured in the same way. </p>\n<p>We are currently thinking of ways to make it clear that a referenced resource was communicated as of the date of service or if the current state of the referenced resource was provided. We have considered using the \"Active\" flag to communicate this. When \"Active\" is true the referenced resouce is the active version of the resource, otherwise it is a historical instance of the resource. </p>\n<p>I agree with <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> that when a member is viewing an EOB the provider's current information would be more relevant, especially since the adjudication results would not change over time. Claims information must always be communicated as of the claims adjudication date and the Coverage(insurance) information must always be provided as of the date of service.</p>",
        "id": 198197112,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1589980997
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> and <span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span>.  Having clarity around the Patient, Practitioner, and PractitionerRole would be helpful when talking with mapping folks.  I could see a scenario where Patient and Practitioner are current state and PractitionerRole is date of service. As Patient and Practitioner could be sourced out of eligibility and Provider Repos, respectively. And PractitionerRole is source out of the claim line.</p>\n<p>The CARIN BB Patient Profile gets interesting, compared to USCore Patient Profile as it appears there is an attempt at some Master Data Management. The WG might need to address this topic at some point.</p>",
        "id": 198213966,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1589988015
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"197108\">@Jason Teeple</span> . As <span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span> pointed out, the context of the content of the adjudicated claim/EOB as well as the content of the referenced resources (for example, Coverage, Patient, Practitioner, etc) is currently being discussed. The attempt is to position the IG unambiguously such that Payers are not necessarily burdened with additional implementation complexity and at the same time the 3rd party client app user experience matches as much as possible with that of a Health Plan Member Portal user. An EOB, in the traditional sense, is usually a (paper/pdf) document consisting of static snapshots of adjudicated claim, member, practitioner and coverage information as of the date of service, regardless of when it is printed or downloaded. Moreover, to your point, the 3rd party apps can always have access to the latest/current version of the Patient/Member, Practitioner or Coverage through other existing (FHIR/non-FHIR) APIs (such as Member Directory, Provider Directory or Eligibility/Benefit Lookup). As far as allowing a Payer to express the context (date of service or current) of its response clearly, we're considering a few options including 1) using meta.lastUpdated for all referenced resources, or 2) having the Payer use the document paradigm to return the data as of the service date (or a regular bundle to return the current data).</p>\n<p>Regarding the Patient profile identifiers, we've updated the min cardinality of all Identifier slices except memberIdentifier to 0. We will also introduce a new optional slice to capture a master member identifier (i.e. belly button identifier) that Payers might want to convey to the 3rd party apps. This is aligned with similar work being done within DaVinci where they've introduced a new Identifier type of \"UMB\" (for Unique Member Identifier). We plan to provide clarification around this basic support for mastering within the narrative for the slices/profile.</p>\n<p>Other thoughts?</p>",
        "id": 198423286,
        "sender_full_name": "Amol Vyas",
        "timestamp": 1590140831
    },
    {
        "content": "<p>Hello ... I'm fairly new to all of this, so I don't have much history. However, it seems to me that you're working hard to define something that sounds a lot like a FHIR Person to me. From my perspective, which is that of a payor, we can create Person instances for people who create accounts to access our APIs. From there, we would consider Patients as analogous to what we know as Member, individuals who enroll in a plan of benefits (Coverage), like Medicare or Medicaid. Since we offer both plan types, consolidating information for dual eligible Persons into a single Patient is proving problematic. </p>\n<p>I'm not entirely sure how this idea works with bulk transfer of information, but on the surface at least, it makes the Patient Access API much easier to implement.</p>\n<p>Comments are appreciated.</p>",
        "id": 204098377,
        "sender_full_name": "Charlie Filkins",
        "timestamp": 1594912794
    },
    {
        "content": "<p>It might make it easier to implement, but all the existing implementations (CMS BlueButton, EHRs) and the SMART standard use Patient, not Person - so we are stuck with that</p>",
        "id": 204099237,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1594913121
    },
    {
        "content": "<p>Person is a linking resource.  It's never allowed to be directly referenced as a subject or other actor.</p>",
        "id": 204100084,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594913458
    },
    {
        "content": "<p>Thank you both for your replies. Maybe someday we can amend the earlier decisions to make life easier.</p>",
        "id": 204195681,
        "sender_full_name": "Charlie Filkins",
        "timestamp": 1594985718
    },
    {
        "content": "<p>Good Morning Team, Does Blue Button provides any logs for us to track who tried to access the API?</p>",
        "id": 242873138,
        "sender_full_name": "Sai Valluripalli",
        "timestamp": 1623846747
    },
    {
        "content": "<p>Most of the IG's define the operations to support and the data structure. The logs (audits) you capture are dictated by other mechanisms like HITECH (I think I got that right)  etc. It's probably easier to track who did access data as opposed to who tried, as in some cases all you might have about who tried is an ip address.</p>",
        "id": 242874455,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1623847479
    },
    {
        "content": "<p>Thank you Daniel.</p>",
        "id": 242874626,
        "sender_full_name": "Sai Valluripalli",
        "timestamp": 1623847584
    }
]