[
    {
        "content": "<p>New Publication: STU Update Release 1.1 of HL7 FHIR® Implementation Guide: Consumer Directed Payer Data Exchange (CARIN IG for Blue Button®), Release 1 - US Realm: <a href=\"http://www.hl7.org/fhir/us/carin-bb/STU1.1\">http://www.hl7.org/fhir/us/carin-bb/STU1.1</a></p>",
        "id": 245237050,
        "sender_full_name": "Corey Spears",
        "timestamp": 1625689350
    },
    {
        "content": "<p>Can someone explain why there are breaking changes in a minor update? For instance, the way profiles are represented in the meta field for all resources is one such example. Is this intended? Can we not rely on minor version updates of the IG to be backwards compatible in the future?</p>",
        "id": 245830152,
        "sender_full_name": "Ryan Conley",
        "timestamp": 1626185494
    },
    {
        "content": "<p>Also, do you have a response as to how requiring the profile may be considered bad design due to the burden it puts on the consumers?</p>\n<p><a href=\"#narrow/stream/179166-implementers/topic/.E2.9C.94.20How.20to.20handle.20Implementation.20Guide.20versions\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/.E2.9C.94.20How.20to.20handle.20Implementation.20Guide.20versions</a></p>",
        "id": 245842099,
        "sender_full_name": "Ryan Conley",
        "timestamp": 1626190051
    },
    {
        "content": "<p>Thanks for the inquiry. <br>\nWhile we attempt to minimize the number of breaking changes in an STU Update, there is no requirement that STU Updates not contain breaking changes. There were a number of issues with the 1.0.0 version of the IG that made it not possible to implement for several uses that were intended to be supported. It was determined that it was important to make an update available as soon as possible to implementers.</p>\n<p>All of these changes where subject to the STU Update peer review process and have been reviewed and approved by the sponsoring WG, co-sponsoring WGs, FMG, and TSC. <br>\nThere was extensive conversation in particular regarding requiring meta.profile. In general, it is not a best practice to require meta.profile unless there is a significant business need to do so. It was ultimately determined that this was necessary in order to enable servers to handle the scale of transactions and management of the resources over time (including handling potential changes to the IG over time).</p>",
        "id": 245851501,
        "sender_full_name": "Corey Spears",
        "timestamp": 1626194159
    },
    {
        "content": "<p>Regarding:</p>\n<blockquote>\n<p>It was ultimately determined that this was necessary in order to enable servers to handle the scale of transactions and management of the resources over time</p>\n</blockquote>\n<p>Is there documentation of rationale / other considerations from discussion on this point? It's not clear to me how this relates to \"scale of transactions\" (if anything, I'd expect applying a rigid system of fixed profile tags might lead to fragility that prevents scaling, e.g., scaling servers up to support multiple uses of data with the same core data set.)</p>",
        "id": 245861534,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626198501
    },
    {
        "content": "<p>There is not a collected documentation of rationale. There have been several meetings on the topic (One can find a number of them by searching for the ticket number 30375 on Confluence). As I understand it, this is a concern driven by payer focused organizations. <br>\nI am an imperfect messenger for detailing the need that drove this decision, so maybe one of the main proponents can provide a more solid explanation. Otherwise we could possibly arrange some time in the Financial Management WG to review.</p>",
        "id": 245886009,
        "sender_full_name": "Corey Spears",
        "timestamp": 1626209682
    }
]