[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> How do we represent a claim reversal in the spec?  If a claim was mistakenly paid (with no cost to the patient) and then payment was recovered, how should this be represented.  To the consumer, they wouldn't know about the mistake.</p>",
        "id": 206967310,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1597432895
    },
    {
        "content": "<p>In general, this would be the equivalent of a Claim Void business process, which is similar to the Claim Adjustment business process except no new claim is generated. Essentially, the 3rd party app will see a previously seen \"active\" status adjudicated claim/EOB but with a \"cancelled\" status.</p>",
        "id": 206989724,
        "sender_full_name": "Amol Vyas",
        "timestamp": 1597444403
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197108\">@Jason Teeple</span> You send a Claim Reversal (Cancel) see <a href=\"http://hl7.org/fhir/financial-module.html#uses\">http://hl7.org/fhir/financial-module.html#uses</a>. The specifics of how you would perform this depends on the exchange mechanism you are implementing.</p>",
        "id": 207456159,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1597867876
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> - Wouldn't a claim reversal require a Task resource, which is not part of the IG?<br>\nWhere I am getting hung up is on the following:<br>\nA patient accesses an Inpatient EOB on 7.1.20, they see a total amount of $15,000.  One month later (8.1.20), they go back into the same Inpatient EOB and see a total for -$10,000.  <br>\nIn between 7.1.20 and 8.1.20, the payer made adjustments to the payment amount.<br>\nWould versioning of the  EOB handle the difference b/c the 3rd party would have to get version 1 ($15k) and version 2 (-$10K) , do some math to determine the EOB is really for $5k? <br>\nOr is there something else I am missing?</p>",
        "id": 207458498,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1597869207
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197108\">@Jason Teeple</span> The IG is not about using FHIR eClaims in the US - current HIPAA regulation requires X12 adn NCPDP standards for US eClaims. The IG is just for receiving Claims data for Patients, or other purposes, using the FHIR Explanation of Benefit. So if the insurer re-adjudicates a Claim then you would expect 2 EOBs which would be for the same Claim and presumably same EOB id, different .meta.versionId.</p>",
        "id": 207460962,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1597870748
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> Would the second EOB show a negative amount (assuming an adjustment of $10k) or the new total amount ($5k)?  My thought is that the second EOB would show a negative not a new total.</p>",
        "id": 207462138,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1597871437
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197108\">@Jason Teeple</span> The new total ($5K) in the same way that a new version of a Patient resource to correct their birthdate would show the correct birthdate not the delta from the incorrect date.</p>",
        "id": 207485551,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1597894313
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> I was not expecting this response.   When a claim system makes an adjustment, the outcome is negative or positive number that needs to be applied to the previous version. (I acknowledge that every claim system is different)  Wouldn't we be obfuscating aggregation/transactional details?  In the end, someone has to do the math, either it is done before the resource or by the developer.  <br>\nI appreciate the help on this topic as I have been receiving a lot of questions from our mapping teams.</p>",
        "id": 207510465,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1597921266
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span>  Spoke with SME and aggregation isn't done at the claim system level for medical claims.  Each claim system is different.  If we only report out the most current version of the claim it could show a negative number.  If we withhold reversals, then we'd be misrepresenting information.  It would be more prudent to give the 3rd party devs all the information so they have all the appropriate details to share with the end consumers.  We'd have to let the 3rd party app represent the information.</p>",
        "id": 207557486,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1597948296
    }
]