[
    {
        "content": "<p>I am fairly new to the CARIN IG for Blue Button. In trying to understand the CPCDS, we are trying to understand is this a layout for a data file, or is it really just a set of data elements? We have found mappings from CPCDS to the FHIR resources, but can not find anything which shows the actual layout of CPCDS beyond just listing the data elements and saying that it is a flat file.</p>\n<p>Can someone please help us to understand what the CPCDS is to look like?  Thanks.</p>",
        "id": 209554645,
        "sender_full_name": "Christopher Gracon",
        "timestamp": 1599678687
    },
    {
        "content": "<p>CPCDS is a logical model not a physical data model. It was used during the development of the CARIN IG to help define the FHIR resources. </p>\n<p>The CARIN IG defines an adjudicated claims API. Within the claims data there are references to other resources (patient/member, coverage, practitioner, etc). The data needed to fulfill the needs of the CARIN IG is defined through must support flags and required fields.</p>",
        "id": 209560293,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1599681695
    },
    {
        "content": "<p>Why do I see, in multiple places, mention of a flat file format to help bridge implementation support? There is a CPCDS CSV format to FHIR converter from Diameter Health [1], Synthea has a CPCDS CSV export option [2], and 1upHealth has a CPCDS to FHIR \"data adapter\" [3]. I have seen presentations from the CARIN Alliance where \"flat file format\" is literally written into the list of deliverables [4]. \"Flat File Format Specification Representing CPCDS Data Elements\" sounds like a \"physical model\" to me. It would be nice to see a \"canonical\" flat file specification, coming from the CARIN Alliance, for folks that are working with CPCDS and want a bridge to CARIN BB FHIR support.</p>\n<p>[1] <a href=\"https://github.com/DiameterHealth/cpcds-converter\">https://github.com/DiameterHealth/cpcds-converter</a><br>\n[2] <a href=\"https://github.com/synthetichealth/synthea/wiki/CPCDS-Export\">https://github.com/synthetichealth/synthea/wiki/CPCDS-Export</a><br>\n[3] <a href=\"https://1up.health/products/cms-rule/cpcds-to-fhir\">https://1up.health/products/cms-rule/cpcds-to-fhir</a><br>\n[4] <a href=\"https://www.carinalliance.com/wp-content/uploads/2019/07/CARIN-Blue-Button-Framework_071519.pptx\">https://www.carinalliance.com/wp-content/uploads/2019/07/CARIN-Blue-Button-Framework_071519.pptx</a></p>",
        "id": 212111879,
        "sender_full_name": "John Timm",
        "timestamp": 1601663829
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span> any thoughts on the above? <span aria-label=\"point up\" class=\"emoji emoji-1f446\" role=\"img\" title=\"point up\">:point_up:</span></p>",
        "id": 212301111,
        "sender_full_name": "John Timm",
        "timestamp": 1601905754
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192334\">@John Timm</span> several others are also interested in using the CPCDS as a physical model. Particularly vendors who want to have a standardized way to deliver an interoperability solution for payers. Payers who are utilizing a vendor may need to producing a CPCDS file. Payers who are creating an in-house solution may find it unnecessary to first create a CPCDS file. </p>\n<p><span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> may be able to point you toward the other initiatives around CPCDS that you have not already identified.</p>",
        "id": 212303648,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1601906866
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span>  Mapping first to a row/column format with some traditional ETL tools may be a valuable \"stepping stone\" towards CARIN BB FHIR support for some payers. If we can agree on what CPCDS looks like in CSV format, we could have a \"standard\" tool to go from CPCDS &lt;-&gt; FHIR (conceivably available in open source).</p>",
        "id": 212317117,
        "sender_full_name": "John Timm",
        "timestamp": 1601912327
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"192334\">@John Timm</span> A flat file format was something  we discussed early on but we didn't know how much demand there would be for creating one (so it became a lower priority) and frankly, haven't had the time to work on it to date. We would welcome yours and others thoughts on what could be created that we could review as an implementation team and overall HL7 community.</p>",
        "id": 212322083,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1601914440
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> I have surveyed the CSV format used in a few different projects. I will circle back with my colleagues and see if we can come up with a \"recommended\" CSV format for CPCDS.</p>",
        "id": 212329345,
        "sender_full_name": "John Timm",
        "timestamp": 1601917981
    },
    {
        "content": "<p>That would be great. Thank you!</p>",
        "id": 212339075,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1601922857
    },
    {
        "content": "<p>I continue to recommend against trying to standardize a CSV structure here; it'll perpetuate confusion about what the canonical data models look like, and there's no need for a consensus standards process on something flat/limited in this way.</p>",
        "id": 212342366,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1601924366
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  I'm not suggesting a \"normative\" standard. I'm simply suggesting something that is \"informative\" / \"recommended\" if you want to leverage CPCDS as CSV.</p>",
        "id": 212342849,
        "sender_full_name": "John Timm",
        "timestamp": 1601924600
    },
    {
        "content": "<p>That helps on the \"long-term energy expended\" front -- but keep in mind that the entire Blue Button IG at this point is still at the trial use stage. The notion of \"CPCDS &lt;-&gt; FHIR\" causes confusion because folks reading the spec come away with this impression that CPCDS is something independent.</p>",
        "id": 212343132,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1601924752
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192334\">@John Timm</span> We are also looking at defining a recommended CSV format for CPCDS Data elements. Happy to collaborate and come up with a common format that is more reusable.</p>",
        "id": 212753376,
        "sender_full_name": "Dharmesh Patel",
        "timestamp": 1602193733
    },
    {
        "content": "<p>Hi All, I was wondering if anyone has discussed the best way to format specific structured fields in the data dictionary.  For example:<br>\nMapID 130 (Patient Name): Format as HL7 datatype XPN?<br>\nMapID 176 (Service Facility Address): Format as HL7 datatype XAD?<br>\nDoes this seem like a reasonable way to handle this?  Has anyone chosen a different approach?</p>",
        "id": 216149289,
        "sender_full_name": "Spencer Kathol",
        "timestamp": 1604959754
    },
    {
        "content": "<p>Not 100% sure I am understanding the question, but names should be structured as <a href=\"http://hl7.org/fhir/datatypes.html#HumanName\">http://hl7.org/fhir/datatypes.html#HumanName</a> and addresses as <a href=\"http://hl7.org/fhir/datatypes.html#Address\">http://hl7.org/fhir/datatypes.html#Address</a></p>",
        "id": 216150762,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1604960710
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"363194\">@Spencer Kathol</span>  XPN and XAD are v2 data types.  better to use v3 / FHIR, as suggested by <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span></p>",
        "id": 216151274,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1604961055
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> <span class=\"user-mention\" data-user-id=\"191402\">@Scott Robertson</span> the target format is certainly FHIR - we are attempting to define a flat file format using the CPCDS data dictionary with the expectation it will end up as FHIR HumanName/Address.  My thought was HL7v2 notation seems to be a better fit to embed this structured data within a CSV flat file.  Does that make sense?</p>",
        "id": 216151815,
        "sender_full_name": "Spencer Kathol",
        "timestamp": 1604961379
    },
    {
        "content": "<p>Hi I'm new to the context and trying to understand CARIN IG for BB. I wanted to know that having a CPCDS to FHIR converting mechanism would ease up the mapping task when creating FHIR resources. (eg: a place where we need to create CARIN profiled FHIR resources from an X-12 message or other custom message, having intermediate CPCDS could be an advantage or not?)</p>",
        "id": 224718246,
        "sender_full_name": "Isuru Samaranayake",
        "timestamp": 1612182484
    },
    {
        "content": "<p>CPCDS is often used as an intermediate conversation when using a vendor solution. Some may find it easier to convert to CPCDS than directly to FHIR. Once the data is in CPCDS it can be ingested by a vendor and they can provide some or all parts of the interop solution.</p>",
        "id": 224753786,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612197657
    },
    {
        "content": "<p>Long term there may be benefits of going through the mapping process to FHIR, and it may be beneficial to have that experience in-house, but this is an implementation decision you will need to make. I hope this vague advice is helpful!</p>",
        "id": 224753871,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612197702
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"246928\">@Josh Lamb</span>  for the clarification. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 224775007,
        "sender_full_name": "Isuru Samaranayake",
        "timestamp": 1612206287
    }
]