[
    {
        "content": "<p>Hi team - what field in the CPCDS EOB file would represent the main billing code or visit type (i.e. medium complex office visit)?</p>",
        "id": 200106463,
        "sender_full_name": "Christopher Marchand",
        "timestamp": 1591627147
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> any insight on the above ^ ? I do not see any field representing this in CPCDS EOB.</p>",
        "id": 200688075,
        "sender_full_name": "Christopher Marchand",
        "timestamp": 1591977401
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"216373\">Christopher Marchand</span> <a href=\"#narrow/stream/204607-CARIN-Blue.20Button.20IG/topic/CPCDS.20EOB.20Data.20Fields/near/200688075\">said</a>:</p>\n<blockquote>\n<p>Hi team - what field in the CPCDS EOB file would represent the main billing code or visit type (i.e. medium complex office visit)?</p>\n<p><span class=\"user-mention silent\" data-user-id=\"192132\">Amol Vyas</span> any insight on the above ^ ? I do not see any field representing this in CPCDS EOB.</p>\n</blockquote>\n<p>Hi Christopher, per the type (profile) of the adjudicated claim/EOB, I believe you will find this information in one of couple of profile structures.</p>\n<ul>\n<li>For institutional/facility (inpatient/outpatient) claims - Type Of Bill (Type Of Care sub-field). Note that Type Of Bill structure will be consolidated into one field in the upcoming update to the IG.</li>\n<li>For professional/non-clinician claims - Procedure Codes (CPT/HCPCS Level 1, 2)</li>\n</ul>\n<p>For more information, the current IG <a href=\"http://hl7.org/fhir/us/carin-bb/2020Feb/Mapping_from_CPCDS_to_FHIR_Resources.html\">page</a> and the May FHIR Connectathon CARIN BB <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=80119564\">track</a>'s latest materials <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=82911348\">page</a>, list the a) CARIN BB profile mapping and b) CARIN BB profile comparison in the their current and updated versions, respectively. We will be deploying these and other  updates that are approved as part of the IG's HL7 ballot reconciliation process so far to the build <a href=\"http://build.fhir.org/ig/HL7/carin-bb/index.html\">environment</a> soon.</p>\n<p><span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> , <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> : Please feel free to validate above.</p>",
        "id": 200833889,
        "sender_full_name": "Amol Vyas",
        "timestamp": 1592169253
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span>, <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> , <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span>  <strong>Do you have a date when you will have the IG updated with the latest mapping documents and specs?</strong> I am struggling to follow all the changes and notice that there are conflicting materials on different pages and sources which is making development complicated.</p>",
        "id": 204085605,
        "sender_full_name": "Christopher Marchand",
        "timestamp": 1594907320
    },
    {
        "content": "<p>The mapping document and specs should reflect the one dated May 15th.  The next published version will include the May 15th version.  We are working on another update and are targeting completing it within the next two weeks.  The most current version is attached to JIRA-26741  <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span></p>",
        "id": 204432144,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1595256784
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> , <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> , <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> , <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> , <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span>  - Can you also update the CPCDS Mapping spreadsheet that is published on the CARIN Confluence page?  I have been using that as the guide so it's good to know that there is a more recent version - and one soon to follow in a few weeks. </p>\n<p>Also I have specific questions about the adjudication amount type categories from the original mapping to the 0513 version.  </p>\n<ol>\n<li>There had been a category code for Allowed. That isn't in the current set.  Is Eligible to be used in it's place?  </li>\n<li>There had been a category code for Payment (generically to represent the total, not the split out between payment to provider and payment to patient). Is Benefit to be used in its place?</li>\n<li>You still have PaidByPatient and in the IG the definition is \"The amount paid by the patient at the point of service.\" That is a very different description than what I see in the Data Element Index of the mapping artifact. That description is more about what the payer determined the total member responsibility: \"Amount that is calculated by the processor and returned to the pharmacy as the total amount to be paid by the patient to the pharmacy; the patient’s total cost share, including copayments, amounts applied to deductible, over maximum amounts, penalties, etc.\"  My business cohorts think this desciption more aptly fits Member Liability.   Can we get clarification on the Data Element Index and IG Code Definitions which Code should be used for \"Amount that is calculated by the processor and returned to the pharmacy as the total amount to be paid by the patient to the pharmacy; the patient’s total cost share, including copayments, amounts applied to deductible, over maximum amounts, penalties, etc.\"?</li>\n</ol>\n<p>cc: <span class=\"user-mention\" data-user-id=\"270256\">@Bapi Behera</span>, <span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span></p>",
        "id": 204589826,
        "sender_full_name": "Kate Dech",
        "timestamp": 1595358735
    },
    {
        "content": "<p>By the way, I do want to acknowledge what a fabulous job you guys did with the profile+the CPCDS mapping.  Not only do we know the structure, but where to put the data in that structure. Please don't misinterpret my questions about the minutiae as criticism! To me it shows you guys nailed the basics!! And I'm able to get into the nitty-gritty details because of it.</p>",
        "id": 204728771,
        "sender_full_name": "Kate Dech",
        "timestamp": 1595456021
    },
    {
        "content": "<p>That said, I do have another nitty-gritty question (sorry!). eob.supportingInfo.sequence.  On the pharmacy profile, you have some named slices always setting the sequence = 1.  And then some say \"reference supportinginfo.sequence rule.\"  What is this rule? I would have assumed each supportingInfo array would get a unique number - slice name or no slice name.  Thoughts?</p>",
        "id": 204729047,
        "sender_full_name": "Kate Dech",
        "timestamp": 1595456174
    },
    {
        "content": "<p>Hi Kate, Thanks for the compliment!  No problem with the questions.  </p>\n<p>1:  Yes, allowed has been changed to eligible; we've standardized on a term HL7 had previously defined.  </p>\n<ol start=\"2\">\n<li>Benefit is different from the payment to the provider or patient as it will include the deductible, co-pay and co-insurance payable by the patient to the provider.  The payer will typically pay either the provider or the patient.   </li>\n<li>The amount paid by patient is different for medical and pharmacy claims.  For medical, it is the amount paid by the patient at the point of service and typically represents a co-pay.  Retail pharmacy is typically a point of service transaction; the member liability is what is paid by the patient as they purchase the prescription.  </li>\n<li>The supportinginfo.sequence rule is in the Rules tab.  It states that client app implementations should look up supportingInfo elements based on the category values instead of the sequence rules.  May I get back with you to answer your question why some of the sequences call out a value = 1 and others call out the rule? <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span> <span class=\"user-mention\" data-user-id=\"270256\">@Bapi Behera</span> <span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span></li>\n</ol>",
        "id": 205278846,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1595964058
    },
    {
        "content": "<p>Hi again Kate, good catch on the question about the sequences! .. all should call out the rule.  We've updated the worksheet; the updates will be reflected in the next published version.  Pat<br>\n<span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span> <span class=\"user-mention\" data-user-id=\"270256\">@Bapi Behera</span> <span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span></p>",
        "id": 205396981,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1596048095
    },
    {
        "content": "<p>Hello - This is John Achoukian from HealthTrio. I am new here.The JSON examples we see on the <a href=\"http://build.fhir.org/ig/HL7/carin-bb/Examples.html\">http://build.fhir.org/ig/HL7/carin-bb/Examples.html</a> site for EOB profiles provide a ‘total’ element that is ‘not mandatory’ nor ‘must support’. The JSON examples do not include ‘item’, ‘adjudication’, or ‘payment’ elements which are all indicated as ‘must support’. Our client maintains ‘billed amount’, ‘allowed amount’, and ‘paid amount’ at both the claim and claim line item level. Can you provide some direction as to what EOB resource elements must be populated?</p>",
        "id": 206613239,
        "sender_full_name": "John Achoukian",
        "timestamp": 1597170903
    },
    {
        "content": "<p>The ones with min cardinality = 1</p>",
        "id": 206614932,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1597171690
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"325599\">@John Achoukian</span> Our team can help. We're making a few updates to the examples. <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span></p>",
        "id": 206775999,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1597287010
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> - We are looking forward to updated examples and any additional guidance on what EOB resource elements must be populated, especially instances where we have financial (billed, allowed, paid) data at both the claim and claim item level.</p>",
        "id": 206850230,
        "sender_full_name": "John Achoukian",
        "timestamp": 1597342550
    },
    {
        "content": "<p>Hi Pat - in review of these comments, we have resolved that eligible is allowed, though we had been thinking benefit would have been the candidate.  Interrogation of the examples in the C4BB IG, show benefit and eligible always hold the same value.  In reading above, it almost looks like benefit is/may be a larger value than eligible, as it appears benefit is not 'net down' of not covered and discount amounts.  Would you have an example where benefit and eligible might be different amounts, and what would another name for benefit be?  (eg eligible == allowed) - thank you! <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span></p>",
        "id": 235537023,
        "sender_full_name": "Bryan Briegel",
        "timestamp": 1619021029
    }
]