[
    {
        "content": "<p>According to conformance is a singleton:<br>\n... diagnosis   S   1..*    BackboneElement Pertinent diagnosis information<br>\n.... type   S   1..1    CodeableConcept Timing or nature of the diagnosis<br>\nBinding: C4BB Claim Inpatient Institutional Diagnosis Type (required)<br>\nThis example shows it as an array though (I assume other examples may as well):<br>\n<a href=\"http://hl7.org/fhir/us/carin-bb/ExplanationOfBenefit-EOBInpatient1.json.html\">http://hl7.org/fhir/us/carin-bb/ExplanationOfBenefit-EOBInpatient1.json.html</a><br>\n  \"diagnosis\" : [<br>\n    {<br>\n      \"sequence\" : 1,<br>\n      \"diagnosisCodeableConcept\" : {<br>\n        \"coding\" : [<br>\n          {<br>\n            \"system\" : \"<a href=\"http://hl7.org/fhir/sid/icd-10-cm\">http://hl7.org/fhir/sid/icd-10-cm</a>\",<br>\n            \"code\" : \"S06.0x1A\"<br>\n          }<br>\n        ]<br>\n      },<br>\n      \"type\" : [<br>\n        {<br>\n          \"coding\" : [<br>\n            {<br>\n              \"system\" : \"<a href=\"http://terminology.hl7.org/CodeSystem/ex-diagnosistype\">http://terminology.hl7.org/CodeSystem/ex-diagnosistype</a>\",<br>\n              \"code\" : \"principal\"<br>\n            }<br>\n          ]<br>\n        }<br>\n      ]<br>\n    }<br>\n  ]</p>",
        "id": 218750910,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1607027854
    },
    {
        "content": "<p>The base EOB resource it is an array 0..{splat}, CARIN BB confuses the issue by making it 1..1 because they require it. The CARIN IG should probably be 1..{splat} to show required to have, without obscuring the array-ness of the element. If there can only be 1, is there a cardinality rule that says only one slot of the array is allowed to be filled or would that just be a rule?</p>",
        "id": 219341131,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1607523501
    },
    {
        "content": "<p><code>diagnosis</code> is an array in the base specs, and is  required and can have multiple values in CARIN BB (1..*). <code>diagnosis.diagnosis[x]</code> and <code>diagnosis.type</code> are NOT arrays in the base specs, they can both have at most a single value, and CARIN BB makes them required. The example matches that</p>",
        "id": 219346498,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1607525613
    },
    {
        "content": "<p>Really?<br>\n<a href=\"http://hl7.org/fhir/R4/explanationofbenefit.html\">http://hl7.org/fhir/R4/explanationofbenefit.html</a><br>\n.. diagnosis        0..*    BackboneElement Pertinent diagnosis information<br>\n.... sequence       1..1    positiveInt Diagnosis instance identifier<br>\n.... diagnosis[x]       1..1        Nature of illness or problem<br>\nICD-10 Codes (Example)<br>\n..... diagnosisCodeableConcept          CodeableConcept <br>\n..... diagnosisReference            Reference(Condition)    <br>\n.... type       0..*    CodeableConcept Timing or nature of the diagnosis. &lt;-- Looks like an array to me<br>\nExample Diagnosis Type Codes (Example)</p>",
        "id": 219348951,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1607526684
    },
    {
        "content": "<p>Oh yes, you are very right, sorry - I was looking at <code>diagnosis[x]</code> - <code>type</code> is an array, and yes, it would make more sense to make to 1..* instead than 1..1 but that ship has sailed I guess</p>",
        "id": 219349770,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1607527045
    },
    {
        "content": "<p>If you think there is an error, <em>please</em> create a Jira issue against the specification.<br>\nDevelopment of the IG continues for additional EOB types, and inevitable mopping up operations can be included.</p>",
        "id": 219354066,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1607528708
    },
    {
        "content": "<p>In the case of Inpatient EOB, I think that diagnosis.type should be 1..1 and is not an error. Based upon the allowable diagnosis types, multiple would be invalid.</p>",
        "id": 219354999,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1607529086
    },
    {
        "content": "<p>multiple might be invalid use, but by documenting it this way it appears to be a singleton not an array, and the base spec is an array. So there needs to be some indicator here that it's still an array, but you are only allowed 1 filled slot, my opinion. <br>\nAlso, if I was considering making a jira issue, what project in jira would be used for the CARIN IG.</p>",
        "id": 219389279,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1607543739
    },
    {
        "content": "<p>Okay, I see the the point you were trying to raise originally now. The example has diagnosis.type as an array with a single entry. This is valid since the structure is an array. Are you asking for a notation within the example?</p>",
        "id": 219397283,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1607547754
    },
    {
        "content": "<p>I do not understand what's the point of forbidding more than one type - as long as there is a valid type what does it matter if there are other?</p>",
        "id": 219399056,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1607548572
    },
    {
        "content": "<p>I think the conformance page needs to have some way of saying this is still an array, this IG didn't change the data type from CodeableConcept[] to CodeableConcept. I know it's not allowed to change the data type, but the way it is now it reads like it did. If the only thing I read was the CARIN IG conformance, then I would think it was a singleton; if I then compared the CARIN example to the conformance I'd think the example was wrong for having an array. Only after going back to base FHIR would I see that it is actually an array and realize that the CARIN IG conformance mislead me.</p>",
        "id": 219399115,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1607548601
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> in general I agree, I think the intent was to indicate that something is, as an example, either 'Primary' or 'Secondary' it cannot be both. </p>\n<p><span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span>  From a UI/Rendering perspective is this an issue? It may be, I am just trying to think of how that would help, or if it would add clutter. The structure definition will provide explicit type information.</p>",
        "id": 219399751,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1607548885
    },
    {
        "content": "<p>I don't have a UI. What I have is a bunch of FHIR novices (myself inc) developing a server, which means there are questions around, the example has this, the output is this, the conformance page is this, the base FHIR says this doesn't that contradict what is here..... I know what it is now so I can explain it to them, I was hoping to forestall anybody being confused.</p>",
        "id": 219404893,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1607551167
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span> - I think you are taking issue with FHIR IG rendering conventions, not the IG.  Once the decision was made (not by me) to constrain the maximum cardinality of diagnosis.type to 1, that is how it looks.   Always. </p>\n<p>In other words, you would make the same comment about any IG that you looked at.    To the extent that is correct, I recommend the IG Creation thread.</p>",
        "id": 219412070,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1607554718
    }
]