[
    {
        "content": "<p>I've noticed some differences between the EOB Professional, Outpatient-Institutional, and Inpatient-Institutional profiles outside of the variances a billing-novice like myself would expect (e.g. admissionperiod is only listed as 'must support' for Inpatient).</p>\n<p>I used red text to highlight the odd-one-out, except for cases where it was a 1v1 comparison.</p>\n<p>Codes &amp; Types<br>\n<a href=\"/user_uploads/10155/oGUbbByU2njFQ6yRIQf4WWOR/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/oGUbbByU2njFQ6yRIQf4WWOR/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/oGUbbByU2njFQ6yRIQf4WWOR/image.png\"></a></div><p>Cardinality<br>\n<a href=\"/user_uploads/10155/NtEHvjFMZTwdugiLCqnvRxfO/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/NtEHvjFMZTwdugiLCqnvRxfO/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/NtEHvjFMZTwdugiLCqnvRxfO/image.png\"></a></div><p>Must Support Flags<br>\n<a href=\"/user_uploads/10155/QB4tdJ13L7aWD-Hg4S0peAyJ/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/QB4tdJ13L7aWD-Hg4S0peAyJ/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/QB4tdJ13L7aWD-Hg4S0peAyJ/image.png\"></a></div><p>Would appreciate folks letting me know if some of these elements should indeed be different across the profiles, vs what might be something that can be updated.</p>",
        "id": 218617242,
        "sender_full_name": "Mark Rogers",
        "timestamp": 1606942039
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> <br>\nHi <span class=\"user-mention\" data-user-id=\"366830\">@Mark Rogers</span>  -- focus on fields that are MS.   The example value sets you've identified are on fields that are not MS, so the profiles don't specify a binding (and the base resource has an example binding).</p>",
        "id": 218618368,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1606942593
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> - Thanks, that does make sense, I do now see that Inpatient profile's MS flag is the differentiator for the careTeam.qualification, procedure.type, and procedure[x] bindings.</p>\n<p>What do you think about the MS flag &amp; cardinality differences?</p>",
        "id": 218619834,
        "sender_full_name": "Mark Rogers",
        "timestamp": 1606943231
    },
    {
        "content": "<p>They are all by intent, based on the properties of the different EOBs.   The best side-by side comparisons are here -- <a href=\"http://hl7.org/fhir/us/carin-bb/STU1/Common_Payer_Consumer_Data_Set.html\">http://hl7.org/fhir/us/carin-bb/STU1/Common_Payer_Consumer_Data_Set.html</a></p>\n<p>I also recommend reviewing the notes on each profile, which should provide insight into the mysteries of billing.   See for example:  <a href=\"http://hl7.org/fhir/us/carin-bb/STU1/StructureDefinition-C4BB-ExplanationOfBenefit-Inpatient-Institutional.html#notes-on-fields\">http://hl7.org/fhir/us/carin-bb/STU1/StructureDefinition-C4BB-ExplanationOfBenefit-Inpatient-Institutional.html#notes-on-fields</a></p>",
        "id": 218623570,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1606945136
    },
    {
        "content": "<p>Reviewing those documents (before I created the initial post), I didn't see the kind of nuance to clear up my confusion.</p>\n<p>Just for an example, what about the processNote.text? I didn't see anything in the CPCDS or profile notes about why it is MS for Inpatient-Institutional and Outpatient-Institutional, but is not MS for Professional.</p>",
        "id": 218628110,
        "sender_full_name": "Mark Rogers",
        "timestamp": 1606947393
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span></p>",
        "id": 218629017,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1606947941
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"366830\">@Mark Rogers</span> -- didn't mean to imply that you hadn't read the notes.   Apologies.  As a billing-naive person, I found the notes and the comparison chart illuminating.</p>",
        "id": 218629205,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1606948042
    },
    {
        "content": "<p>No worries, I think we're in the same boat!</p>",
        "id": 218629668,
        "sender_full_name": "Mark Rogers",
        "timestamp": 1606948281
    },
    {
        "content": "<p>Morning! <br>\nWe may want to start a thread for US Realm Claim Billing nuances! Remember, in the US we can come up with an exception for for every rule, so ...</p>\n<p>What you are seeing is the differences between inpatient, outpatient and professional/DMEPOS billing. <strong>In general</strong>, for an acute inpatient stay there MUST be an admission date and once discharged a discharage date - but we know that hospitals generally bill monthly and people remain in the hospital over a monthend. SO, we there are 'statement dates' - the dates this claim is being submitted for.  Once the person is discharged a 'complete' claim will be submitted with all the charges for the entire stay, with an admission, discharge date and statement dates. An inpatient claim MUST  have an admission date. </p>\n<p>If you are an outpatient, you are technically not 'admitted' to the hospital (NO discussion of Observation stays here), so admission date not required - BUT it could be there IF you are in having services done that will be billed on the inpatient claim once you are admitted (go in a few days early to give blood, have MRI/CT Scan that is inclusive in the inpatient charge...).</p>\n<p>For inpatient billing there will always be a revenue code, and there MAY be a CPT/HCPCS code. For professional services there will always be a CPT/HCPCS.  </p>\n<p>AND every payer may require different information.</p>",
        "id": 218718644,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1607013005
    },
    {
        "content": "<p>Is there any sort of documentation I could peruse on 'how the sausage gets made',  as it were, for how each fields were/weren't given MS &amp; how cardinality was assigned? I'm still stumped on questions like \"why does the Professional profile not require processNote.text but the other two profiles do require it\".</p>",
        "id": 218728727,
        "sender_full_name": "Mark Rogers",
        "timestamp": 1607017303
    },
    {
        "content": "<p>A process note without text would hold no information so this may not have much impact. May be something to keep track of for a future version?</p>",
        "id": 218733619,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1607019490
    },
    {
        "content": "<p>I suppose in this case, I'm worried that a Blue Button app that tells patients why their claims were denied can't show them this information for why Dr Smith's claim was rejected if a payer's system adheres strictly to releasing must-support fields.</p>\n<p>Meanwhile, it can tell them why Memorial Hospital's claim was denied. And, it would be because the Inpatient-Institutional profile mandates processNote.text while it's not mandated for Professional.</p>\n<p>It looks like the enhancement of adding denial explanations into the IG was approved for inclusion in JIRA (<a href=\"https://jira.hl7.org/browse/FHIR-28244\">https://jira.hl7.org/browse/FHIR-28244</a>) and I didn't immediately see any notes excluding Professional from scope.</p>\n<p>Should we create an additional JIRA to toggle the Professional profile to must-support for processNote.text too?</p>",
        "id": 218766519,
        "sender_full_name": "Mark Rogers",
        "timestamp": 1607036111
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"366830\">@Mark Rogers</span> Would you forward your original request to my email at <a href=\"mailto:pat.taylor@bcbsa.com\">pat.taylor@bcbsa.com</a>?  I can't access Zulip from my work computer.  It would be helpful to have your screen shots available as I r2search your questions.    For example, I'm seeing Professional and Non Clinician .processNote marked as Must Support  <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> <span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span></p>",
        "id": 218866683,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1607103910
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> , You are correct, ProcessNote is always must support. There are some minor discrepancies with the must support flag on processNote.Text.</p>",
        "id": 218867559,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1607104266
    },
    {
        "content": "<p>In this particular instance, wouldn't the denial reason on a Professional claim be included in item.adjudication[denialReason]?</p>",
        "id": 218879661,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1607109761
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> Nope, the processNote.text looks like it's something else, at least going off of the JIRA explanation:</p>\n<p>*This is a line level payer specific reason conveying a denial explanation to a member, typically goes on the EOB when the payment is denied or disallowed.  This is not the same as the CARC / RARC codes payers provide to providers. *</p>\n<p>The item.adjudication[denialReason] would be the CARC/RARC, while processNote.text would be...something else? Maybe a human-readable sentence or two? Don't know myself.</p>",
        "id": 219384134,
        "sender_full_name": "Mark Rogers",
        "timestamp": 1607541415
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"366830\">@Mark Rogers</span> <br>\nThanks for your analysis.  Below are our responses.  Some observations require explanations; others will require minor updates to the IG.</p>\n<p>careTeam.qualification is only required for Professional and is tagged as MS.  There is no MS on Outpatient as it is not required.  However, it should reflect the ExampleProviderQualificationCodes from the base Resource, like that for Inpatient.  We will update the IG replacing the US Core Provider Specialty (NUCC) Value Set with the Example Value Set on Outpatient.</p>\n<p>procedure.type:  This is accurate.  .procedure is only defined for Inpatient.  Values are ICD Procedure Codes.  item.productOrService is the FHIR data element for the CPT / HCPCS procedure codes.  These codes do not have a procedure type.  The FHIR data elements are not required and default to the definition in the base Resource. </p>\n<p>procedure[x]:  This is accurate.  The reason is the same as that given for procedure.type.</p>\n<p>item.location:  Item.location is only required for Professional and should be tagged as MS.  We will update.</p>\n<p>item.serviced:</p>\n<ul>\n<li>\n<p>Inpatient:  Admission and Discharge dates are mapped to a slice supporting.Info.admissionperiod</p>\n</li>\n<li>\n<p>Outpatient:  Service date should be a date but not a period.  I see it is mapped to a slice.  The slicing could be avoided by putting the MS on item.serviced[x] instead of item.serviceDate, since the only option available for serviced[x] is Date.  We will update.  </p>\n</li>\n<li>\n<p>Professional:  Service from and through dates are mapped to item.service.servicePeriod.  It should be tagged as MS.  We will update. </p>\n</li>\n</ul>\n<p>Cardinality:</p>\n<p>Adjudication.denialreason.reason is accurate as denial reasons are provided only at the item level in Professional</p>\n<p>.billableperiod is accurate as this situation only applies to Inpatient as an admission may span multiple billing periods if the admission is an extended duration, such as a burn or Covid patient</p>\n<p>.insurance for Inpatient should be 1..*.  We will update</p>\n<p>.item.adjudication for Professional should be 1..*.  We will update</p>\n<p>.item.adjudication.adjudicationamounttype is accurate.  It’s required on Professional but not on Inpatient or Outpatient.</p>\n<p>.item.adjudication.denialreason is accurate.  It’s required on Professional but not on Inpatient or Outpatient.</p>\n<p>.item.revenue for Outpatient should be 1..1.  We will update</p>\n<p>.procedure.type is accurate as it is only required for Inpatient.  See note above.</p>\n<p>.supportingInfo: cardinality is accurate.  It is based on number of required slices (1..*)</p>\n<p>IP:  1..*.  -- admissionPeriod is 1..1</p>\n<p>OP: 0..*.  none are 1..1</p>\n<p>Prof: 0..*.  none are 1..1</p>\n<p>Pharm: 3..*.  dayssupply, dawcode and refillnum are 1..1. (1 + 1 + 1 =&gt; 3)</p>\n<p>.supportingInfo.pointoforigin.code cardinality for Inpatient should be 0..1.  We will update.</p>\n<p>MustSupport</p>\n<p>adjudication:adjudicationamounttype.amount for Inpatient appears to be MS in the IG</p>\n<p>billablePeriod start and end MS is accurate; it applies only to Inpatient</p>\n<p>careTeam.qualification is accurate; it applies only to Professional</p>\n<p>.created for Professional should be MS.  We will update</p>\n<p>.diagnosis for Outpatient should be MS.  We will update</p>\n<p>.item.adjudication[allowedunits]value for Professional should be MS.  We will update</p>\n<p>.item.modifier for Professional should be MS.  We will update</p>\n<p>.item.productOrService for Professional should be MS.  We will update</p>\n<p>.item.quantity for Professional should be MS.  We will update</p>\n<p>.payment.date for Professional should be MS.  We will update</p>\n<p>.procedure, <a href=\"http://procedure.date\">procedure.date</a> and .procedure.type and procedure[x] are accurate.  Procedure only applies to Inpatient.  They are ICD procedure codes.  The CPT / HCPCS procedure codes are reported in item.productOrService</p>\n<p>processNote.text for Professional should be MS.  We will update.</p>\n<p><span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"246928\">@Josh Lamb</span> <span class=\"user-mention\" data-user-id=\"197108\">@Jason Teeple</span></p>",
        "id": 220587990,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1608560331
    }
]