[
    {
        "content": "<p>Hello All (<span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> , <span class=\"user-mention\" data-user-id=\"193764\">@Ricky Bloomfield</span> , <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> , <span class=\"user-mention\" data-user-id=\"197072\">@Paul Church</span>, <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span>, <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span> , others):</p>\n<p>Are we allowed to modify an ExplanationOfBenefit resource that has an \"Active\" status? If so, it would greatly simplify these discussions. Otherwise my suggestion for how to define _lastUpdated is below: </p>\n<p>Per my understanding there are only two opportunities for the _lastUpdated date to be set. Once when the resource is initially created (status of “Active”), and again when the resource status is changed to “Cancelled”.  My understanding is based upon: <a href=\"https://www.hl7.org/fhir/financial-module.html#resource-status\" title=\"https://www.hl7.org/fhir/financial-module.html#resource-status\">https://www.hl7.org/fhir/financial-module.html#resource-status</a> AND <a href=\"https://build.fhir.org/ig/HL7/carin-bb/StructureDefinition-CARIN-BB-ExplanationOfBenefit-definitions.html#ExplanationOfBenefit.status\" title=\"https://build.fhir.org/ig/HL7/carin-bb/StructureDefinition-CARIN-BB-ExplanationOfBenefit-definitions.html#ExplanationOfBenefit.status\">https://build.fhir.org/ig/HL7/carin-bb/StructureDefinition-CARIN-BB-ExplanationOfBenefit-definitions.html#ExplanationOfBenefit.status</a>. </p>\n<p>We should also impose a status restriction on ExplanationOfBenefit.Status to only allow values of \"Active\" and \"Cancelled\". This is based upon our requirement to only communicate Adjudicated claims. We can also call out within the IG that a financial resource must be \"Cancelled\" and a new resource must be created (with status of \"Active\") in order to make modifications. </p>\n<p>It will be difficult to provide guidance to systems that are utilizing a facade because we would have to know details about how their claims are processed. I was initially going to use a facade but found it difficult to represent point in time financial resources using this approach.</p>",
        "id": 193098707,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1586205650
    },
    {
        "content": "<p>It's always hard to provide guidance to facades because there's such a variety of stuff behind them. In my mind the fundamental principle is that lastUpdated has to be no earlier than the most recent time where the server's response to a resource request was changed to a different value, but may be later than that. It's ok for a no-op change to advance lastUpdated, or for a collection of resources (e.g. an EoB and its supporting resources) to report that their lastUpdated is the max of all lastUpdated in the collection. The only case that's not allowed is when a client searching by _lastUpdated would miss an update that they could have found by inspecting all of the resources from scratch.</p>\n<p>Does that help at all?</p>\n<p>Even if you make the EoB immutable except for the status -&gt; cancelled transition, are all of the supporting resources necessarily immutable? That seems like a very limiting assumption.</p>",
        "id": 193104542,
        "sender_full_name": "Paul Church",
        "timestamp": 1586208601
    },
    {
        "content": "<p>Paul hit the nail on the head for me.  We shouldn't be writing any special guidance for <code>lastUpdated</code>, beyond having it reflect times when the resource content has changed.</p>",
        "id": 193110975,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1586212285
    },
    {
        "content": "<p>I am in 100% agreement and did not mean to imply otherwise. This thread may be missing some context if you were not on the workgroup call earlier.  We discussed before that ExplanationOfBenefit was immutable, so to me that means that opportunities to set _lastUpdated would be limited to two instances in time (resource creation and resource cancellation). </p>\n<p>Right now I am just looking for clarity on if we can update an \"Active\" explanation of benefit resource. If we cannot how deeply does this restriction extend, e.g. are all referenced resources locked when we create an EOB?</p>",
        "id": 193112510,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1586213364
    },
    {
        "content": "<blockquote>\n<p>are all referenced resources locked when we create an EOB?</p>\n</blockquote>\n<p>Thanks -- I think I'm indeed missing context. Are you saying if an EoB references a patient, you might want to \"lock\" the patient?</p>",
        "id": 193112839,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1586213627
    },
    {
        "content": "<p>We discussed today that if the referenced patient changed we would not need to create a new EOB but it left the implication open that if other resources changed we would need a new EOB. A few months back I remember discussing a case where the EOB should reference a point in time instance of Practitioner, Coverage, PractitionerRole, and other resources that could impact payment but this was never strongly defined. I am also not clear if an EOB in general can be updated, or if its just the EOB.Status field that cannot be updated once it is created, outside of Active -&gt; Cancelled.</p>",
        "id": 193113616,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1586214172
    },
    {
        "content": "<p>It's not clear to me why this IG needs to deal with this level of what I'd consider to be \"internal\" implementation details; isn't it possible that different systems will make different choices on this front?</p>",
        "id": 193113773,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1586214259
    },
    {
        "content": "<p>That sounds like great advice to me.</p>",
        "id": 193113845,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1586214309
    },
    {
        "content": "<p>Hello everyone, <span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span>  , <span class=\"user-mention\" data-user-id=\"193764\">@Ricky Bloomfield</span>  , <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span>  , <span class=\"user-mention\" data-user-id=\"197072\">@Paul Church</span> , <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> , <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span> <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> <span class=\"user-mention\" data-user-id=\"195889\">@Nick Radov</span> </p>\n<p>Yes, modifying an ExplanationOfBenefit resource that has an \"Active\" status is allowed.  Mark Scrimshire can confirm, but my understanding is that there is no CMS requirement to keep the prior transaction.  </p>\n<p>However, unless we establish a rule otherwise, payers could keep the prior transaction with a status of \"Cancelled\".   Adding Nick Radov.  To your point, the IG should restrict values to \"Active\" and \"Cancelled\"</p>",
        "id": 193309864,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1586348121
    },
    {
        "content": "<p>Note that an EOB is as of a point in time, which is the date of service.  Changes to an EOB would reflect changes in the way the claim was adjudicated; for example, a previously denied claim was paid after the payer received additional information.  Changing any underlying information, such as provider name, would not trigger a new EOB.</p>",
        "id": 193317116,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1586351559
    },
    {
        "content": "<p>On a related note, we would support a 'MUST SUPPORT'  requirement for date of service and last update date.</p>",
        "id": 193317336,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1586351643
    },
    {
        "content": "<p>My bad.. should be 'SHALL'</p>",
        "id": 193317517,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1586351726
    }
]