[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> At the connectathon we were given an opportunity to provide feedback on the IG. I wanted to open up a thread to capture this feedback. I am capturing this list from memory so anyone can feel free to include anything I missed or any new concerns. </p>\n<p>1.)  It would be helpful to provide expanded text descriptions on the properties for CARIN resources. The FHIR spec allows for profiles to expand text descriptions without applying additional constraints. Most of the descriptions are inherited from either the US Core or the base resource descriptions and I think we are missing an opportunity to provide clarity and example values. This will be especially helpful for healthplans that may lack experience working with FHIR or HL7 specifications. </p>\n<p>2.) It would be good to specify use cases for the various resources. This will help to highlight the business value that the resources can create. For example, we could specify that the Coverage resource can be used as a virtual member id card. Or that the Organization resource associated with Payor can contain customer service contact information regarding the insurance policy. It was suggested that healthplans work with their customer service departments to determine pain points so that we can capture additional high value use cases for these resources. </p>\n<p>3.) It would be helpful to publish the CARIN profiles to <a href=\"http://Simplifier.net\" target=\"_blank\" title=\"http://Simplifier.net\">Simplifier.net</a>. As of now the profiles are unclaimed on Simplifier. This will make the process of ingesting the profiles and performing validation easier in some cases.</p>",
        "id": 183368630,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1576250575
    },
    {
        "content": "<p>To keep pushing on examples: I don't see any resource examples listed at <a href=\"http://build.fhir.org/ig/HL7/carin-bb/profiles.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/carin-bb/profiles.html\">http://build.fhir.org/ig/HL7/carin-bb/profiles.html</a> . What  data were used during the connectathon for testing?</p>",
        "id": 183380631,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1576257993
    },
    {
        "content": "<p>For the \"meat\" of profiles on EOB, there's a long list of <code>supportingInfo</code> slices (see <a href=\"http://build.fhir.org/ig/HL7/carin-bb/StructureDefinition-CARIN-BB-ExplanationOfBenefit-Outpatient-Facility.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/carin-bb/StructureDefinition-CARIN-BB-ExplanationOfBenefit-Outpatient-Facility.html\">here</a> for instance). These render like...</p>\n<p><a href=\"/user_uploads/10155/eplSismV4iTwN2Ekl0sbRFkr/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/eplSismV4iTwN2Ekl0sbRFkr/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/eplSismV4iTwN2Ekl0sbRFkr/pasted_image.png\"></a></div><p>A couple of issues here (and with all the other slices):</p>\n<ol>\n<li><em>patientDischargeStatusCode</em> has no documentation stating what this field means.</li>\n<li><em>patientDischargeStatusCode</em> has no constraints indicating which sort of <code>value[x]</code> it should have.</li>\n<li>Assuming <em>patientDischargeStatusCode</em> is meant to use some kind of Code Coding or CodeableConcept as its value... I can't see how this works. <code>ExplanationOfBenefit.supportingInfo.value[x]</code> doesn't support <code>[x]</code> of Code or Coding or CodeableConcept. I'm probably missing something basic here, but I'm having trouble determining <em>what</em>.</li>\n</ol>",
        "id": 183380896,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1576258239
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  I agree that there should be descriptions of the slice definitions. If i am understanding your question, the name is confusing since patientDischargeStatusCode is not a code, the type is ExplanationOfBenefit.SupportingInfo. PatientDischargeStatusCode.value[x] supports boolean, string, quantity, attachment, and Reference(Resource).</p>",
        "id": 183382899,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1576259801
    },
    {
        "content": "<p>But what does a \"patientDischargeStatusCode\" of <code>true</code> mean? or <code>\"foo\"</code>? or <code>15</code>? Or <code>{\"url\": \"http://\"...}</code>? Or <code>{\"reference\": \"http://...\"}</code></p>",
        "id": 183383026,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1576259895
    },
    {
        "content": "<p>In other words, without documenting the meaning of the slice and providing constraints on the allowed values, defining a slice accomplishes nothing.</p>",
        "id": 183383047,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1576259929
    },
    {
        "content": "<p>(Especially without examples showing the authors' intent and allowing a reader to guess.)</p>",
        "id": 183383064,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1576259947
    },
    {
        "content": "<p>I understand your point. Everyone will interpret this differently without an explicit definition or constraints. I have been frustrated trying to populate this resource due to this very issue.</p>",
        "id": 183383397,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1576260178
    },
    {
        "content": "<p>... and <code>supportingInfo</code> slices seem to be the majority of what's defined in the profiles.</p>",
        "id": 183384034,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1576260653
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span> - is there any registration for IG meeting to clarify the contained resources?</p>",
        "id": 183585345,
        "sender_full_name": "Elkhan Yusubov",
        "timestamp": 1576526853
    },
    {
        "content": "<blockquote>\n<p>Hi <span class=\"user-mention silent\" data-user-id=\"246928\">josh lamb</span> - is there any registration for IG meeting to clarify the contained resources?</p>\n</blockquote>\n<p>I think that what we are saying is that we will probably not have any use case that requires a contained resource but we may want to support included resouces based upon how the server is being queried. E.g. calling GET on patient/123 would not include the organization that is referenced but performing a search with the _include=organization param would include organization. I liked Paul's suggestion to support a PatientEverything with a _since param. This would include all related resources by default.</p>",
        "id": 183586542,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1576527701
    },
    {
        "content": "<p>The Da Vinci PDEx IG recommended the use of a Patient/123456/$everything operation.</p>",
        "id": 183586651,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1576527770
    },
    {
        "content": "<p>Can anyone confirm that the data elements that must be supported as per the CPCDS are represeted in the profiles with a minimum cardinality of \"1..\" with a \"Must Support\" value of true? There was some concerns raised during the call that health plans would be omitting data elements that are required but this should not be possible if we are validating against the published profiles.</p>",
        "id": 183587402,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1576528284
    },
    {
        "content": "<p>Resources returned by _include or $everything won't be contained - they'll just be side by side withing the returned bundle</p>",
        "id": 183587708,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1576528462
    },
    {
        "content": "<blockquote>\n<p>Can anyone confirm that the data elements that must be supported as per the CPCDS are represeted in the profiles with a minimum cardinality of \"1..\" with a \"Must Support\" value of true?</p>\n</blockquote>\n<p>In FHIR, these two modeling approaches (min cardinality \"1..\", vs Must Support=true) are used for two different purposes. \"Must Support\" might be used even for cases of optional elements (i.e. for things that aren't always present, but that a server must implement support for).</p>",
        "id": 183591781,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1576531081
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> for context, at the connectathon some example data used contained resources and some clients found that problematic. In my opinion the use case was not suitable for contained resources; there was no particular reason they couldn't have been normal resources. We just need to make sure everyone is on the same page - there was some confusion over terminology.</p>",
        "id": 183596301,
        "sender_full_name": "Paul Church",
        "timestamp": 1576534056
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Understood. Without both \"1..\" and MustSupport = true a property may be required but support would not be required. </p>\n<p>The heart of my question was that I want some confirmation that validating against the profiles should reflect the CPCDS requirements.</p>",
        "id": 183596899,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1576534542
    },
    {
        "content": "<p>I'm not sure I follow this. By definition (for FHIR), required means cardinality 1..x. I do not know the CPCDS requirements, but typically such requirements include things that can't be validated in an instance (e.g. an element may be required to be present if some condition that is outside the resource being validated is true)</p>",
        "id": 183598013,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576535363
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  thanks for the input, I was referencing a comment by <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> in the CARIN Benefit Check IG stream: <br>\n\"b) 1..1 and mustSupport are orthogonal. If something is 1..1 and not mustSupport, then nothing stops the sender from populating the element with a fixed value (or even a fixed extension that says something like 'not supported'). And on the receiving side, a mandatory element not marked as mustSupport is free to be ignored and thrown away. mustSupport is what sets conformance expectations that the system must be able to store/display/\"allow user entry of\"/\"consider in decision support\"/\"do whatever with\" the element. So typically if an element is 1..1 it will also be flagged as mustSupport.\"</p>",
        "id": 183599591,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1576536603
    },
    {
        "content": "<p>yes typically, but not always. (there's <em>always</em> edge cases)</p>",
        "id": 183599700,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576536706
    },
    {
        "content": "<p>Got it <span class=\"user-mention\" data-user-id=\"197072\">@Paul Church</span> , thanks. And yes, contained resources won't sit well with most clients</p>",
        "id": 183602541,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1576539255
    },
    {
        "content": "<p>Can someone also point to the licensing requirements for the codesystems used within ExplanationOfBenefit resource? I was going through the terminology within <a href=\"https://build.fhir.org/ig/HL7/carin-bb/terminology.html\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/carin-bb/terminology.html\">https://build.fhir.org/ig/HL7/carin-bb/terminology.html</a> and its not clear what code systems require a subscription to get the full set of values. My assumption is that anything provided by <a href=\"http://hl7.org\" target=\"_blank\" title=\"http://hl7.org\">hl7.org</a> will not require a subscription. <span class=\"user-mention\" data-user-id=\"240296\">@Zanub Malik</span>  FYI</p>",
        "id": 183694853,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1576618901
    },
    {
        "content": "<p>any code systems we define do not require a commercial license -they have some kind of open source license.</p>\n<p>but this is not necessarily true of any code systems that we 'provide' - in that many code systems have a license such that we can distribute the content to you as part of an IG, but you have to acquire a license to use it. We should say so explicitly on each on of these</p>\n<p>note that this is general advice; I haven't looked at this particular IG</p>",
        "id": 183695026,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576619038
    },
    {
        "content": "<p>From today's fmg call, there are outstanding build errors that need to be fixed if the guide is going to continue on to ballot:</p>\n<ol>\n<li>\n<p>need to update the hl7 logo, and</p>\n</li>\n<li>\n<p>need to fix the footer</p>\n</li>\n</ol>\n<p>These can be fixed independently or by updating to the latest standard template.</p>",
        "id": 183793104,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1576705188
    },
    {
        "content": "<p>note: switching to the standard template is probably not such a good idea to do at the last minute</p>",
        "id": 183793218,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576705266
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span>  Within the IG I am seeing an error on Adjudication: \"Unknown reference to #ExplanationOfBenefit.item.adjudication<br>\nHeader-level adjudication\".</p>",
        "id": 184331816,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1577465916
    }
]