[
    {
        "content": "<p>I'm having a hard time trying to figure out the proper structure for data-absent-reason in the case when I don't have a code for the item:productOrService property.  The notes of the IG do state that this can occur in an inpatient setting and that the appropriate thing to do is to include the data-absent-reason extension.  </p>\n<p><a href=\"http://build.fhir.org/ig/HL7/carin-bb/StructureDefinition-C4BB-ExplanationOfBenefit-Inpatient-Institutional.html#notes-on-fields\">http://build.fhir.org/ig/HL7/carin-bb/StructureDefinition-C4BB-ExplanationOfBenefit-Inpatient-Institutional.html#notes-on-fields</a><br>\n\"A CPT / HCPCS code may not be available on an inpatient institutional claim. The cardinality of the HL7 base EOB Resource for item.productOrService is 1..1 if .item is provided.  Since .item.revenue is required it means that item.productOrService must be populated.  Since the profile is not able to relax the cardinality of the resource, it is recommended payers provide a data absent reason when a CPT / HCPCS code is not available.\"</p>\n<p>I am trying to add the following instead of \"productOrService\".</p>\n<p>\"_productOrService\": {<br>\n    \"extension\": [<br>\n         { \"url\": \"<a href=\"http://hl7.org/fhir/StructureDefinition/data-absent-reason\">http://hl7.org/fhir/StructureDefinition/data-absent-reason</a>\",<br>\n           \"valueCode\":\"unknown\" } ]</p>\n<p>I get errors when validating (using <a href=\"https://inferno.healthit.gov/validator/\">https://inferno.healthit.gov/validator/</a>) that \"productOrService\" is required.  Should I not be putting the \"_\" in front of my property perhaps?  Perhaps there is no way to do this without getting a validation error and I don't know that I should just be looking past that particular error in this case.</p>\n<p>If we figure this out, I would love if the example in the IG (<a href=\"http://build.fhir.org/ig/HL7/carin-bb/ExplanationOfBenefit-InpatientEOBExample1.json.html\">http://build.fhir.org/ig/HL7/carin-bb/ExplanationOfBenefit-InpatientEOBExample1.json.html</a>) had at least one of the line items updated to show how this is done as it is likely a common scenario for others.</p>",
        "id": 225600832,
        "sender_full_name": "Fred Harmon",
        "timestamp": 1612815214
    },
    {
        "content": "<p>I've found another random example of data-absent-reason someone was using on a Observation resource but it led me to the following solution. This also throw errors in the Inferno validator but I'm beginning to believe the validators don't know how to handle data-absent-reason perhaps.</p>\n<p>Here I am adding the extension to the code itself instead of the productOrService which seems more accurate. I'm thinking this seems way more accurate as I'm representing that I don't know the code. Now the validator throws an error about \"No code provided\" but this is why I'm thinking it won't ever really be able to handle this.</p>\n<p>\"productOrService\": {<br>\n\"coding\": [{<br>\n\"code\": {<br>\n\"extension\": [<br>\n{ \"url\": \"<a href=\"http://hl7.org/fhir/StructureDefinition/data-absent-reason\">http://hl7.org/fhir/StructureDefinition/data-absent-reason</a>\",<br>\n\"valueCode\":\"unknown\"<br>\n} ]<br>\n}<br>\n}]<br>\n}</p>",
        "id": 225600915,
        "sender_full_name": "Fred Harmon",
        "timestamp": 1612815244
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"329482\">@Fred Harmon</span> <br>\nI see that this question was answered on the implementers stream. For others that may be interested, I thought I would put the resolution on this stream too.<br>\nThe issue is that there is a required binding for the CodeableConcept that is also a required element (cardinality of 1..1) one cannot use a data absent reason and no code value. You can see Lloyd's description in this thread - <a href=\"#narrow/stream/179166-implementers/topic/Data-absent-reason.20on.201.2E.2E1.20element.20with.20Required.20binding.3F\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Data-absent-reason.20on.201.2E.2E1.20element.20with.20Required.20binding.3F</a><br>\nAs stated, the CARIN BB identified this as an issue with item.productOrService for the inpatient IG and have a Jira ticket (<a href=\"https://jira.hl7.org/browse/FHIR-30357\">https://jira.hl7.org/browse/FHIR-30357</a>) for  technical correction that we will be reviewing and plan on releasing shortly. The resolution involves adding the \"not-applicable\" code of the data-absent-reason CodeSystem to the item.productOrService  bound ValueSet for inpatient institutional.<br>\nHere is a list of tickets that are planned for the technical correction: <a href=\"https://jira.hl7.org/browse/FHIR-30375?jql=project%20%3D%20FHIR%20AND%20Specification%20~%20%22CARIN%22%20AND%20Grouping%20%3D%20Technical_Corrections\">https://jira.hl7.org/browse/FHIR-30375?jql=project%20%3D%20FHIR%20AND%20Specification%20~%20%22CARIN%22%20AND%20Grouping%20%3D%20Technical_Corrections</a></p>",
        "id": 225884904,
        "sender_full_name": "Corey Spears",
        "timestamp": 1612981785
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> , had meant to do that and forgot.  Long time man, hope all is well.</p>",
        "id": 225885036,
        "sender_full_name": "Fred Harmon",
        "timestamp": 1612981827
    }
]