[
    {
        "content": "<p>I am looking for guidance on how to implement the ExplanationOfBenefit Pharmacy profile when a claim contains multiple medications.  I do not see anything in the IG that explicitly states or requires that the EOB Pharmacy must contain only one medication (item), but the cardinality of the supportingInfo slices (dayssupply, dawcode, and refillNum) implies this is the case.</p>\n<p>We receive claims with multiple medications from various sources and do need to map those claims to the ExplanationOfBenefit resource.</p>\n<p>What would be the recommended guidence for outputting the supportingInfo slices for each medication (item) on the claim?</p>",
        "id": 273655136,
        "sender_full_name": "Melissa Benzie",
        "timestamp": 1646147514
    },
    {
        "content": "<p>You can and should put all medications associated with a single claim in the same EoB.<br>\nThe supportingInfo slice can be linked up with the particular line item. Put a unique id in the <a href=\"http://EoB.supportingInfo.id\">EoB.supportingInfo.id</a> and link in the item by placing that id in the EoB.item.informationSequence</p>",
        "id": 273693304,
        "sender_full_name": "Corey Spears",
        "timestamp": 1646161362
    },
    {
        "content": "<p>Thanks for the explanation.</p>",
        "id": 273702730,
        "sender_full_name": "Melissa Benzie",
        "timestamp": 1646165282
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span>  after reviewing your explanation a bit more I have questions...</p>\n<p>Is the recommendation to link the supportingInfo slices to the item via the <code>EOB.supportingInfo.id</code> to the <code>EOB.item.informationSequence</code> documented in the IG?  It seems to make sense to have the link be via the <code>EOB.supportingInfo.sequence</code> to the <code>EOB.item.informationSequence</code>.  This would align with how the item -&gt; <code>careTeamSequence</code>, <code>diagnosisSequence</code>, and <code>procedureSequence</code> elements link to the <code>careTeam</code>, <code>diagnosis</code>, and <code>procedure</code>.  Also, the <code>EOB.supportingInfo.id</code> is a string not a positiveInt which is the datatype for the <code>EOB.item.informationSequence</code>.</p>\n<p>I would like to link it as we already link the others (careteam, diagnosis) using the sequence, but if this is required/documented by the IG, I will do linking via the id.  Please let me know, thanks.</p>",
        "id": 273838460,
        "sender_full_name": "Melissa Benzie",
        "timestamp": 1646240085
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"203993\">@Melissa Benzie</span> , You are right. Good catch. I will just have to chalk it up to multi-tasking poorly. It should be the <code>ExplanationOfBenefit.supportingInfo.sequence</code> used to match up with <code>ExplanationOfBenefit.item.informationSequence</code>.</p>",
        "id": 274645379,
        "sender_full_name": "Corey Spears",
        "timestamp": 1646803709
    },
    {
        "content": "<p>The slices cardinality is wrong then, isn't it? There can be multiple dayssupply, dawcode, refillnum</p>",
        "id": 274695701,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1646836465
    },
    {
        "content": "<p>Good catch <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>, I see this may be an issue in other EoB profiles as well, but most notably for the Pharmacy EoB. I have added a ticket and will take the issue to the CARIN Alliance for discussion.<br>\n<a href=\"https://jira.hl7.org/browse/FHIR-36235\">FHIR-36235 - EoBs do not allow for multiple repetitions of SupportingInfo slice when needed</a></p>",
        "id": 274710434,
        "sender_full_name": "Corey Spears",
        "timestamp": 1646842318
    },
    {
        "content": "<p>OK, thanks</p>",
        "id": 274713721,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1646843638
    },
    {
        "content": "<p>thanks for following up and clarifying <span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> and <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> .</p>",
        "id": 274733129,
        "sender_full_name": "Melissa Benzie",
        "timestamp": 1646851299
    },
    {
        "content": "<p>After discussion today with the CARIN Alliance, we determined that the other IGs are not affected as the supportingInfo slices are indeed at the claim level. However, the Pharmacy EoB prescription specific slices need to be associated with line items. The current decision is to unbound the maximum cardinality for those slices and make item.informationSequence to MS and cardinality 1..* (since the prescription related supportingInfo slices are item specific).</p>",
        "id": 274927236,
        "sender_full_name": "Corey Spears",
        "timestamp": 1646968790
    },
    {
        "content": "<p>Thanks for aligning the implementation guide with our implementation!</p>",
        "id": 274981929,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1647008949
    },
    {
        "content": "<p>The matter of multiple medications in a single claim has been discussed during the FM call today. During that call, we were unable to find instances where there would be multiple medications (one per line) on a single EoB where the daw code, refill number, refills authorized, etc. would be unique to the medication. <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>  and <span class=\"user-mention\" data-user-id=\"203993\">@Melissa Benzie</span> , can you provide some specifics of the use case and some examples?</p>",
        "id": 275440497,
        "sender_full_name": "Corey Spears",
        "timestamp": 1647380965
    },
    {
        "content": "<p>We have examples of claims with multiple medications and the daw code, refill number, and days supply values are unique for each medication.  Seeing this on claims  from VA Medicaid and NC Medicaid sources.</p>",
        "id": 275537011,
        "sender_full_name": "Melissa Benzie",
        "timestamp": 1647447740
    },
    {
        "content": "<p>Thanks Melissa. Besides being Medicaid claims, is there anything notable about these medications linking them together? Are they components? Are they part of packs? are they somehow related to a specific therapy regimen?<br>\nAre these actually sent in the same claim transaction?</p>",
        "id": 275606097,
        "sender_full_name": "Corey Spears",
        "timestamp": 1647490944
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> </p>\n<blockquote>\n<p>Are these actually sent in the same claim transaction?</p>\n</blockquote>\n<p>For these Medicaid sources, the daw code, days supply, and refill # are all provided to us at the line level (ie once for each medication).  </p>\n<blockquote>\n<p>During that call, we were unable to find instances where there would be multiple medications (one per line) on a single EoB where the daw code, refill number, refills authorized, etc. would be unique to the medication. </p>\n</blockquote>\n<p>We have taken a closer look at the medicaid claims which contain multiple medications and do not have the same daw code, refill number and days supply.  After examining the claims more carefully, we do not think those claims are valid examples.  </p>\n<p>We are seeing for all the other claims with multiple medications, they do have the same daw code, refill number, and days supply.  </p>\n<p>Thank you for your quick response, help and guidance in understanding these types of claims.</p>",
        "id": 275843192,
        "sender_full_name": "Melissa Benzie",
        "timestamp": 1647627558
    }
]