[
    {
        "content": "<p>Working with Anthem a requirement came up to make available the amounts a member paid against a claim (and a claim item) from their HSA account</p>",
        "id": 254409729,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632333238
    },
    {
        "content": "<p>That to the best of my understanding is not currently covered in <a href=\"https://hl7.org/fhir/us/carin-bb/stu1.1/ValueSet-C4BBAdjudication.html\">https://hl7.org/fhir/us/carin-bb/stu1.1/ValueSet-C4BBAdjudication.html</a> - so we used a custom code</p>",
        "id": 254409919,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632333302
    },
    {
        "content": "<p>Worth considering adding it to the specs? Cannot find any existing issue about HSA - happy to add one</p>",
        "id": 254410000,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632333338
    },
    {
        "content": "<p>That is not included in the guide today. Can you please enter a ticket for us to consider? Are there other types of payer aware/managed accounts that should be considered, like FSA, others?</p>",
        "id": 254423396,
        "sender_full_name": "Corey Spears",
        "timestamp": 1632338587
    },
    {
        "content": "<p>How does Paid from an HSA account differ from Paid by Patient? How would a payer know that the member paid their portion of the bill via HSA, cash, check or CC?</p>",
        "id": 254426370,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1632339690
    },
    {
        "content": "<blockquote>\n<p>How would a payer know that the member paid their portion of the bill via HSA, cash, check or CC</p>\n</blockquote>\n<p>I am not sure, but apparently Anthem does: it has two separate fields for paid by patient and paid from HSA</p>",
        "id": 254440703,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632345317
    },
    {
        "content": "<p>Created <a href=\"https://jira.hl7.org/browse/FHIR-33996\">https://jira.hl7.org/browse/FHIR-33996</a></p>",
        "id": 254441559,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632345723
    },
    {
        "content": "<p>Maybe they know if it came from an HSA because of the reporting needed to make sure HSA money only goes to valid destinations? I'm not up to speed on how that stuff works.</p>",
        "id": 254441861,
        "sender_full_name": "Paul Church",
        "timestamp": 1632345874
    },
    {
        "content": "<p>_they know everything_</p>",
        "id": 254443246,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632346606
    },
    {
        "content": "<p>Following this thread/JIRA. We are a PBM Payer and also have an ask to represent the HSA/FSA payment tied to a claim.  I'm not sure it's adjudication payment type - as a payer we aren't making the payment. The savings account administrator makes the payment It's more like a related Payment based on/referencing this claim from an HSA account to a provider or a member.  They want to be able to view that in the context of the claim that triggered the payment.<br>\n<span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span></p>",
        "id": 257453910,
        "sender_full_name": "Kate Dech",
        "timestamp": 1634166992
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> - Something occurred to me re-reading your note. The adjudication amount type slice in C4BB has a required binding to that value set - <a href=\"http://hl7.org/fhir/us/carin-bb/ValueSet/C4BBAdjudication\">http://hl7.org/fhir/us/carin-bb/ValueSet/C4BBAdjudication</a>. If Anthem created their own code, would that make them out of conformance with C4BB (and did they do it anyway to be able to send the data they felt was needed)? Thanks!</p>",
        "id": 259278499,
        "sender_full_name": "Kate Dech",
        "timestamp": 1635356955
    },
    {
        "content": "<p>Good point, I though that the slice was open, but it is actually closed (why?!), so adding that code (that we did) does break conformance</p>",
        "id": 259281383,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1635358014
    },
    {
        "content": "<p>(hard to believe that it would really matter for clients ?)</p>",
        "id": 259281458,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1635358048
    },
    {
        "content": "<p>Yup, looks closed with a required binding on the discriminator property. I am not sure why that was done as it predates my direct involvement. This is the time to re-evaluate. I will raise this with CARIN and the FM WG.<br>\nIf this was made open, would it b sufficient to address <a href=\"https://jira.hl7.org/browse/FHIR-33996\">https://jira.hl7.org/browse/FHIR-33996</a>?</p>",
        "id": 259295463,
        "sender_full_name": "Corey Spears",
        "timestamp": 1635363647
    },
    {
        "content": "<p>If that was open, it would certainly help. Although it would be nice to have consistent codes for this type of a payment or reimbursement. (Are there separate codes for HRA or HSA or FSA or just one code for member reimbursement by account?)</p>",
        "id": 259396988,
        "sender_full_name": "Kate Dech",
        "timestamp": 1635431419
    },
    {
        "content": "<p>To be honest, we have been hard pressed to find someone to talk to us about the need. It was not clear that this information would even be available to many data suppliers. Who might be able to talk to us about the requirements?</p>",
        "id": 259420643,
        "sender_full_name": "Corey Spears",
        "timestamp": 1635440715
    },
    {
        "content": "<p>It may make sense to get a couple of payer representatives to talk about different types of adjustments. <br>\nWe have one category of 'member payment reductions' - <br>\nFSA = Flexible Savings Account<br>\nHRA = Health Reimbursement Arrangement<br>\nHSA = Health Savings Account<br>\nMIX = Combined Savings Account<br>\nMRA = Member Rebate Account<br>\nMSA = Member Savings Account<br>\nVBA = Voluntary Emp Bnfcry Assn<br>\nALT = Alternate Patient Pay<br>\nBut there are other adjustments which may reduce the member responsibility (like LICS for MCARE), Coverage Gap Discounts, and also penalties which may increase the member responsibility.</p>",
        "id": 259431452,
        "sender_full_name": "Kate Dech",
        "timestamp": 1635445499
    },
    {
        "content": "<p>Sorry one more thing... It looks like <a href=\"http://EOB.total\">EOB.total</a> has an extensible binding to C4BB Total Category Discriminator (extensible) so it may be possible to add these codes to the total. It's item.adjudication where it's a required binding. I doubt that HSA/FSA/HRA tie payments to a line items.</p>",
        "id": 259453768,
        "sender_full_name": "Kate Dech",
        "timestamp": 1635456004
    },
    {
        "content": "<p>This come from Anthem, not me directly. I asked someone there to chime in</p>",
        "id": 259456782,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1635457808
    },
    {
        "content": "<p>(and yes, making it open would definitely help - and I think it is a good idea in general for all the slicing, not much sense in preventing servers to add more slices with their own stuff)</p>",
        "id": 259456832,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1635457849
    },
    {
        "content": "<blockquote>\n<p>FSA = Flexible Savings Account<br>\nHRA = Health Reimbursement Arrangement<br>\nHSA = Health Savings Account<br>\nMIX = Combined Savings Account<br>\nMRA = Member Rebate Account<br>\nMSA = Member Savings Account<br>\nVBA = Voluntary Emp Bnfcry Assn<br>\nALT = Alternate Patient Pay</p>\n</blockquote>\n<p>What would be the CodeSystem for these account types?</p>",
        "id": 259891155,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1635786356
    },
    {
        "content": "<p>Hi FM Co-Chairs here:</p>\n<p>to indicate an HSA Payment:<br>\nThere would need to be a Coverage resource for the HSA.<br>\nEOB.insurance.coverage = HSA Policy <br>\nEOB.item.adjudication.category = 'benefit'<br>\nEOB.item.adjudication.amount.value = the amount paid/payable from the HSA Policy</p>\n<p>Feel free to join the FM Calls on Tuesday mornings if you have additional questions.<br>\nTHANKS!!</p>",
        "id": 259911209,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1635796138
    },
    {
        "content": "<p>Assuming that there are 3 payers on a claim. 2 (HSA + HDHP) insurance and 1 \"cash\".</p>\n<p>Thus the 1st payer is HDHP, that eob will reference the focal coverage resource HDHP plan.<br>\nThe second payer is HSA, that eob will reference the focal coverage resource HSA plan, plus a reference to the prior payer (HDHP).</p>\n<p>Correct?</p>",
        "id": 259917896,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1635799202
    },
    {
        "content": "<p>I don't get it, EOB.item.adjudication.category = 'benefit' is an existing code, how do you know that it is a payment from an HSA?</p>",
        "id": 259924200,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1635802224
    },
    {
        "content": "<p>EOB1. \"benefit\" was paid by referenced coverage (an HDHP plan)<br>\nEOB2. \"benefit\" was paid by referenced coverage (an HSA plan)</p>",
        "id": 259986547,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1635855096
    },
    {
        "content": "<p>So you have to have two different ExplanationOfBenefits? Don't think that's what is wanted</p>",
        "id": 259988666,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1635856366
    },
    {
        "content": "<p>So if you have an HSA payment you need two ExplanationOfBenefits?</p>",
        "id": 259988667,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1635856366
    },
    {
        "content": "<p>I think it comes down to what is HSA? Is HSA a form of currency like cash or credit card or is it insurance?<br>\nIf it's insurance, then it has a coverage and an EOB is a record of payment/adjudication by 1 insurance plan.<br>\nIf it's currency, then it's just \"paid by patient\" and be done with it.</p>\n<p>It sounds like it is treated as insurance, thus it is treated like an insurance plan. When you have 2 insurance plans you get two EOB. </p>\n<p>This is just me stitching various comments together, I'm a technologist not an insurer.</p>",
        "id": 259989637,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1635856944
    },
    {
        "content": "<p>My understanding - To the patient it is very different, as it is non-taxed-money, and thus the patient has obligations to track for tax purposes. But to the healthcare org and insurance, it is just \"paid by the patient\", simply cash to them.</p>",
        "id": 259995250,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635859968
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span> an HSA is a pre-tax spending account which acts like 'cash' for settling patient responsibility on health services.</p>",
        "id": 260026587,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1635872702
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> Yes you may have multiple EOBs, if a claiming mechanism was used (although on the FM call none of the providers or payers had that use case) then you may have multiple EOBs as the HSA may not be managed by the payer.</p>",
        "id": 260027141,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1635872940
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> <a href=\"#narrow/stream/204607-CARIN-IG.20for.20Blue.20Button.C2.AE/topic/Paid.20from.20HSA.20account.20amounts/near/254409729\">said</a>:</p>\n<blockquote>\n<p>Working with Anthem a requirement came up to make available the amounts a member paid against a claim (and a claim item) from their HSA account</p>\n</blockquote>\n<p>I understand what an HSA is. The question arose how to know if an HSA paid for a bill vs paying cash vs insurance. If \"paid by patient\" means paid by patient using any currency type (cash, HSA) then there is no way to differentiate between the types. <br>\nThere seem to be 2 possible solutions, add more adjudication categories to say, \"paidbypatientcash\", \"paidbypatientHSA\", \"paidbypatientetc\".... but there isn't anything on the claim form to indicate patient swiped HSA card vs patient swiped debit vs credit vs cash.<br>\nOR <br>\ntreat HSA as an insurance in which case it becomes Coverage and the adjudication category of \"benefit\" would be used to indicate amount paid by the insurance (HSA). Also problematic unless HSA account acts like insurance, which I don't think does.</p>\n<p>I think the correct answer is: There is no current way to tell whether the \"paidbypatient\" amount was by cash, HSA or other. Unless you are in the Provider's practice where you can see the assorted transactions against the patient account. But it won't be on the EOB.</p>",
        "id": 260028644,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1635873632
    },
    {
        "content": "<p>However, I understand that some payers do know if the \"paidbypatient\" amount was cash, HSA or other.  A recommendation is to add \"paidbypatientcash\" and \"paidbypatientHSAHRAorother\" to the adjudication value set and let payers determine which value best works for them.</p>",
        "id": 260984082,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1636548629
    }
]