[
    {
        "content": "<p>We are currently planning for CMS 9123 rule and have some questions regarding members opting-in to Payer-to-Payer during enrollment.  From the prior ruling that was pulled back:  impacted payers must create a process to allow members to opt-in to permit the payer to use the Payer-to-Payer API for bulk access with other payers at enrollment and quarterly with concurrent payers as described below.<br>\n1)  If a member does not provide consent at enrollment how are payers handling this?  Are procedures being put in place for post-enrollment capture?<br>\n2)  Are any payers leveraging pre-enrollment systems to handle consent?  It seems this ruling would change some of our enrollment forms if we end up touching the pre-enrollment process which would be a large effort.<br>\n3)  Once a member grants consent at enrollment how long is it valid?  Will other payers proactively ask members if they have concurrent plans?  How often?<br>\n4)  If a member revokes consent are payers removing the \"other payer\" data or just stopping the transition of data going forward?<br>\n<span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span></p>",
        "id": 263482214,
        "sender_full_name": "Mark Neumuth",
        "timestamp": 1638470400
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"360036\">@Mark Neumuth</span>  These are great questions! Let me copy a few folks on this email to hopefully get them to chime in here <span class=\"user-mention\" data-user-id=\"260046\">@Cille Kissel Watkins</span> <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"394481\">@Caitlyn Campi</span> <span class=\"user-mention\" data-user-id=\"423929\">@Vijey Kris Sridharan</span> <span class=\"user-mention\" data-user-id=\"270281\">@Barbara Valeno</span></p>",
        "id": 263486833,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1638472402
    },
    {
        "content": "<p>Payer-to-payer is covered under the DaVinci PDex specification, so you might be best asking your questions on <a class=\"stream\" data-stream-id=\"235286\" href=\"/#narrow/stream/235286-Da-Vinci-PDex\">#Da Vinci PDex</a>.  You're also free to join the Friday calls.  (Instructions are here: <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=40738760\">https://confluence.hl7.org/pages/viewpage.action?pageId=40738760</a>.)  We're actually under active discussion about how best to manage consent expectations - both for coverage transition and for parallel coverage.</p>",
        "id": 263497429,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638477545
    },
    {
        "content": "<p>Is consent really needed for transfer between two covered entities? HIPAA suggests no and that consent would be opt out</p>",
        "id": 263714961,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1638632834
    },
    {
        "content": "<p>at the federal level, correct... but states may have more restrictive consent requirements.. and businesses can always offer more consent to the patient than minimally required by HIPAA</p>",
        "id": 263715046,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638632905
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"360036\">@Mark Neumuth</span> I think a lot of this depends on how you are planning to implement against the Payer to Payer requirement. If you are using the Patient Access API technology, the opt in and data exchange happens real time regardless of pre/during/post enrollment. You can integrate this feature into many different areas of your technology. Humana does currently allow prospective members to share their Blue Button 2.0 data with Humana to inform their shopping experience. For this flow, the member is able to stop sharing by logging into their previous insurer's portal and stop sharing of data moving forward. This typically translates into deactivation of access and refresh tokens previously assigned to us as the client. The individual is also able to email our support team and ask for us to delete their historical data received from the third party entity, and we will respond within a few business days. </p>\n<p>If you're using PDex / HRex, then I would expect that there would be an opt-in form developed that could be slotted in just after the person enrolls in the new plan. The form is not necessarily required by HIPAA, but logistically necessary to ensure you can capture the member ID and other necessary details to make the call to the prior insurer for the person's data. The form should indicate how long the consent is valid for; just my personal opinion, but I would recommend 6 months to make sure that enrollment does occur and that you catch any new data that might come through at the tail end of their old coverage. In theory, you could prompt the new member to go back and fill out the same consent form many times after the initial enrollment if they declined to do it the first time. It might help encourage them to do it by educating them on what the benefit to them will be. I'm not sure if insurers are planning on using refresh tokens for this flow, but we would still be able to honor requests to delete historical data upon request to our email support team.</p>",
        "id": 263858648,
        "sender_full_name": "Cille Kissel Watkins",
        "timestamp": 1638801598
    }
]