[
    {
        "content": "<p>I apologize if this was already submitted in JIRA. I was struggling to get the right filters to see if this has already been sent in.</p>\n<p>I with a PBM and one item that has come up as a data element that would be useful for members is to see - along with which refill number a claim was for - but also how many refills have been authorized by the prescriber.  The Pharmacy EOB Profile includes the refill number (00 for first fill, 01 for  the first refill etc.). But there isn't an element or CPCDS data mapping for the number of refills authorized.  </p>\n<p>The use case we have is to alert a patient that a prescription must be renewed of if they had their last fill.</p>\n<p>Is this something that could be added to the Pharmacy EOB profile? Or would we have to populate a reference to  a MedicationRequest Resource  (which has an aligned element 'numberOfRepeatsAllowed') and _include that resource with the results? I worry about one more resource which would likely repeat the same data as what is on the EOB (patient, medication, prescriber, substitution allowed) just to add one more element. But I agree that it is an attribute more of prescription than of claim.</p>\n<p>Thanks for weighing in and let me know if I should submit a JIRA for this to be considered! Appreciate the help!</p>\n<p><span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span> , <span class=\"user-mention\" data-user-id=\"270256\">@Bapi Behera</span></p>",
        "id": 252689869,
        "sender_full_name": "Kate Dech",
        "timestamp": 1631219294
    },
    {
        "content": "<p>I don't recall such a JIRA ticket. Would you mind adding it? It is always great to be able to trace the origination of an issue.<br>\nFYI <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span></p>",
        "id": 252707220,
        "sender_full_name": "Corey Spears",
        "timestamp": 1631227449
    },
    {
        "content": "<p>Adding an element to the profile would not mean that the source systems have it</p>",
        "id": 252722223,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1631239559
    },
    {
        "content": "<p>Thanks Corey! I created <a href=\"https://jira.hl7.org/browse/FHIR-33487\">https://jira.hl7.org/browse/FHIR-33487</a>.</p>",
        "id": 252808402,
        "sender_full_name": "Kate Dech",
        "timestamp": 1631289402
    }
]