[
    {
        "content": "<p>Hi all,</p>\n<p>Looking at the Pharmacy EOB's item.adjuciation:denialreason, I see that both item.adjudication and item.adjudication.reason both have max cardinality of 1. However, looking at the NCPDP 2.2 PAH specification, it looks like there could be up to five different 'reject codes' (511-FB).</p>\n<p>Being fairly new to NCPDP, this might be a remedial question, but is this a problem? Would it be customary to have some sort of 'primary' reject code (omitting the secondary/tertiary/etc reject codes), or should we duplicate the adjudication slices to have one slice be 'submitted'/$20/reason#1 and another slice be 'submitted'/$20/reason#2? Or, should item.adjudication.reason get changed to have a cardinality of 0..*?</p>\n<p>Thanks,<br>\nMark</p>",
        "id": 223679008,
        "sender_full_name": "Mark Rogers",
        "timestamp": 1611339595
    },
    {
        "content": "<p>You can supply multiple codes in the item.adjudication[].denialreason.reason (coadeableconcept). </p>\n<p>More than one code may be used in CodeableConcept. The concept may be coded multiple times in different code systems (or even multiple times in the same code systems, where multiple forms are possible, such as with SNOMED CT). Each coding (also referred to as a 'translation') is a representation of the concept as described above and may have slightly different granularity due to the differences in the definitions of the underlying codes. </p>\n<p>So as long the the reasons are translations of eachother, at least.</p>",
        "id": 223770904,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611431216
    },
    {
        "content": "<p>That's the problem with the NCPDP Reject Codes though, since the NCPDP 2.2 PAH spec allows multiple reject codes (7X, 8A, etc) for the one claim/item. As a result, I'm unsure how to represent a scenario where a given item was rejected with three distinct NCPDP Reject codes (vs a simpler System A's code + System B's code, etc).</p>",
        "id": 223928405,
        "sender_full_name": "Mark Rogers",
        "timestamp": 1611594368
    }
]