[
    {
        "content": "<p>I wanted to gauge the community's support for including guidance as part of the IG regarding a uniform application registration process. I imagine it would be jarring for application developers to have a different registration process for each payer they wished to support. </p>\n<p>Do we think this could fall within the scope of the IG? Would we want it to? </p>\n<p>Somewhat related, how will application developers interface with all of the various health plans? This could be a huge task for an app developer if they need to reach out to all 300+ payers individually. I am not sure how an app developer could reasonably find all of the various payers app registration pages.</p>",
        "id": 198798818,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1590516141
    },
    {
        "content": "<p>This is currently a big problem when trying to connect to providers. Having something uniform would be great, but I do not know if it is realistic to try to put it in the implementation guide</p>",
        "id": 198811287,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1590521989
    },
    {
        "content": "<p>Yes, but it should not be specific to CARIN Blue Button. There is an effort in the SMART-on-FHIR space, mostly around Argonaut, to work this problem as a unified problem that can be used in many domains such as payers.</p>",
        "id": 198812953,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590522771
    },
    {
        "content": "<p>I know 1UP Health put together a directory of apps who signed the CARIN code of conduct. It may be good to have a similar directory, where an app developer can find links to the registration pages for all of the various payers.</p>",
        "id": 198816382,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1590524428
    },
    {
        "content": "<p>We are working on this <span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span> with <span class=\"user-mention\" data-user-id=\"212982\">@Aaron Seib</span> <span class=\"user-mention\" data-user-id=\"195299\">@Luis Maas</span> on this topic. We have a list of the apps who have signed the CARIN code of conduct on <a href=\"http://MyHealthApplication.com\">MyHealthApplication.com</a>. We also are recommending health plans leverage <a href=\"http://UDAP.org\">UDAP.org</a> to assist in registering trusted apps.</p>",
        "id": 199388654,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1591028030
    },
    {
        "content": "<p>On the recommendation to use UDAP's DCR... Looking into details from UDAP site, it seems that this DCR implementation is in Draft status. Two questions here, 1. Any tentative date for a \"final\" version? 2. Any issue with the standard OAuth DCR spec (RFC 7591) that made the team recommend UDAP's implementation instead?</p>",
        "id": 201314860,
        "sender_full_name": "Bruno R Neves",
        "timestamp": 1592508617
    },
    {
        "content": "<p>We are planning to categorize vendors apps into \"trusted\" and \"not trusted\" based on  CARIN code of conduct attestation. Intent is to allow apps that sign CARIN code of conduct connect with us through UDAP and others through the manual registration process. like to hear thoughts about it from others? Also, how payers can validate a specific app that connecting with us through UDAP is signed the CARIN code of conduct as this information persisted outside the payers systems?</p>",
        "id": 206569052,
        "sender_full_name": "Bhanu Vemuri",
        "timestamp": 1597149509
    },
    {
        "content": "<blockquote>\n<p>how payers can validate a specific app that connecting with us through UDAP is signed the CARIN code of conduct</p>\n</blockquote>\n<p>I don't believe you can<br>\nVery few (no?) app currently support UDAP</p>",
        "id": 206570630,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1597150495
    },
    {
        "content": "<p>To me, this is mixing two very different concepts: how apps register (technical question), and whether they follow a specific set of terms (policy question).</p>",
        "id": 206626882,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597177708
    },
    {
        "content": "<p>If the recommendation is to use udap, why restrict it to only certain apps?</p>",
        "id": 206626902,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597177725
    },
    {
        "content": "<p>I should also say (I've said it in other forums) that recommending UDAP in the IG before we have production experience with it seems premature.</p>",
        "id": 206626949,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597177755
    },
    {
        "content": "<p>Agreed <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  From the beginning, the SMART App Launch Framework has been listed as a SHALL and UDAP has been listed as a SHOULD in the CARIN for Blue Button IG. <span class=\"user-mention\" data-user-id=\"197261\">@Bhanu Vemuri</span> We would be interested in testing this at either the Patient Access API event next week or the HL7 connectathon in September. <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span> <span class=\"user-mention\" data-user-id=\"195299\">@Luis Maas</span> <span class=\"user-mention\" data-user-id=\"212982\">@Aaron Seib</span> can help you get connected to some apps who may be interested.</p>",
        "id": 206775889,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1597286857
    },
    {
        "content": "<p>We are still actively reviewing this approach but we would be interested in the community's comments on the attached draft regarding third-party app registration using UDAP. Please include your thoughts in the chat or the attached Google Doc. <a href=\"https://docs.google.com/document/d/1HgOlUWMEsZHBChuP4DACRka4ap2S8UwSTkAz4oY6bCo/edit\">https://docs.google.com/document/d/1HgOlUWMEsZHBChuP4DACRka4ap2S8UwSTkAz4oY6bCo/edit</a> </p>\n<p>Our intent would be to include this guidance in the IG as a SHOULD rather than a SHALL once we get the community's input. <span class=\"user-mention\" data-user-id=\"197261\">@Bhanu Vemuri</span> and others: It would be great to work with <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"195299\">@Luis Maas</span> <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span> to see if we could try and test this approach soon.</p>",
        "id": 206776300,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1597287581
    },
    {
        "content": "<p>I don't think we're agreeing -- \"SHOULD\" level guidance is a recommendation; I'm saying it's premature to recommend supporting external specifications that our implementation community doesn't have real experience with. This would be better scope for follow-on IGs.</p>",
        "id": 206776612,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597288031
    },
    {
        "content": "<p>Hi Ryan et al.  - coincidentally Bhanu and I have a call scheduled tomorrow to discuss further - definitely a topic we are excited to share more about.</p>",
        "id": 206777603,
        "sender_full_name": "Aaron Seib",
        "timestamp": 1597289451
    },
    {
        "content": "<p>It's certainly worth further discussion. Our health plan colleagues have expressed interest in more of an automated app registration approach but it's unclear how many will use it out of the gate. We've also been following the lead of ONC FAST, DaVinci, and Carequality who have all discussed using UDAP.</p>",
        "id": 206778571,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1597291091
    },
    {
        "content": "<p>From an implementors perspective, UDAP would be a scope increase for application registration. We will be required to support the manual process, even if we used UDAP. I am not imagining a flood of application developers that would justify automating this process.</p>",
        "id": 206779549,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1597292599
    },
    {
        "content": "<p>Please include <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> and <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> who do have real world experience. The lessons the EHR community have learned should not need to be re-invented by the payer community.</p>",
        "id": 206809792,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597322594
    },
    {
        "content": "<p>Agree John. We've reached out to both.</p>",
        "id": 207648197,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1598023897
    }
]