[
    {
        "content": "<p>CARIN BB and other IGs are continuing to evolve. For example, <a href=\"http://hl7.org/fhir/us/davinci-pdex/StructureDefinition/hrex-coverage\">http://hl7.org/fhir/us/davinci-pdex/StructureDefinition/hrex-coverage</a><br>\nwas recently added, and it's unclear how this will co-exist with the CARIN Coverage <a href=\"http://build.fhir.org/ig/HL7/carin-bb/StructureDefinition-C4BB-Coverage.html\">http://build.fhir.org/ig/HL7/carin-bb/StructureDefinition-C4BB-Coverage.html</a>.</p>\n<p>With issues like this in mind, what is the recommended version to meet the CMS Interoperability rules and meet market expectations for 2021? It's obviously best to offer full support, but if means the target is constantly moving then implementation becomes difficult or impossible.</p>",
        "id": 213462552,
        "sender_full_name": "Art Huston",
        "timestamp": 1602784112
    },
    {
        "content": "<p>We are freezing our development (= Anthem) at the end of this month - the changes are already causing us quite a lot of trouble having an end point that is already live. The rules suggest but not mandate the CARIN BB implementation guide, so whatever we managed  to implement would have to do</p>",
        "id": 213472591,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1602788531
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"329477\">@Art Huston</span> Our IG hasn't had any major changes since September although we fully recognize we haven't published it yet. We are mainly doing clean-up right now but we do recognize folks need to make a call to 'cut off' any additional changes to hit a 1/1 date. Latest build with the associated updates is always located here: <a href=\"https://build.fhir.org/ig/HL7/carin-bb/index.html\">https://build.fhir.org/ig/HL7/carin-bb/index.html</a>. <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span> </p>\n<p>Current status of the open issues (not many) are in the .ppt below. Approved HL7 FM workgroup timeline for publication is below: <br>\n10/13 <br>\n•   Discussion regarding including the “Personas document” as part of the CARIN IG for Blue Button® or in a supplemental guide<br>\n•   Submit all remaining Jira tickets to FM WG and PIE WG that will not be deferred<br>\n10/20<br>\n•   Financial Management workgroup votes on remaining Jira tickets<br>\n•   Possible vote to include the “Personas document” in the CARIN IG for Blue Button or as part of a supplemental guide<br>\n10/27<br>\n•   Detailed walkthrough of the CARIN IG for Blue Button® with the FM workgroup<br>\n11/3<br>\n•   Vote to publish the CARIN IG for Blue Button® as an STU1 version</p>\n<p><a href=\"/user_uploads/10155/E3Jykf_lstJDuP94tfqn_nDZ/CARIN-Consumer-Directed-Payer-Data-Exchange-IG-Ballot-Reconciliation-2020-1015.pptx\">CARIN-Consumer-Directed-Payer-Data-Exchange-IG-Ballot-Reconciliation-2020-1015.pptx</a></p>",
        "id": 213491439,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1602797993
    }
]