[
    {
        "content": "<p>Stream created by <span class=\"user-mention silent\" data-user-id=\"286087\">Dave Hamill</span>.</p>",
        "id": 261856410,
        "sender_full_name": "Notification Bot",
        "timestamp": 1637186430
    },
    {
        "content": "<p>Question:<br>\nDoes 'resume' mentioned on page 5 of the RFI refer to company capabilities or is HL7 looking for individual resumes? If the latter, can they be included separately from the 10-page limit?</p>\n<p>Any resume information is not part of the 10-page limit.</p>\n<p>Answer:<br>\nBecause the request is more of an RFI than RFP, company capabilities would be very useful.    Then, if you have a team targeted to support the work and have their resumes, include them as well.   If resumes aren’t available, then a brief description of the roles of the team members that would support the work – something so that we can see you have the necessary resources to support your solution.</p>",
        "id": 262501358,
        "sender_full_name": "Dave Hamill",
        "timestamp": 1637695315
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"286087\">@Dave Hamill</span> I know this is a channel for the RFI but I was wondering if there is a list of desired capabilities or proposals and if there was a way to contribute to those without participating directly in the RFI process?</p>",
        "id": 274407790,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1646667100
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"214452\">@Rob Dingwell</span> </p>\n<p>Rob, <br>\nUnfortunately, I'm not sure I'll be able to answer your question.   I've attached the RFI here in hopes that it may (and let me know if the attachment doesn't work -- I'm a Zulip novice, and have never attached a file in Zulip).</p>\n<p>Also, we haven't progressed much since receiving the RFI proposals as the stakeholders needed to create a detailed RFP based on the RFI proposals.</p>\n<p>I can suggest that you reach out to either of the main stakeholders, HL7's <a href=\"mailto:diego@HL7.org\">diego@HL7.org</a> Chief Standards Implementation Officer Viet Nguyen (<a href=\"mailto:viet@HL7.org\">viet@HL7.org</a>) and/or HL7's Deputy Chief Standards Implementation Officer Diego Kaminker (<a href=\"mailto:diego@HL7.org\">diego@HL7.org</a>).  They will be able to provide more detail than I can.</p>\n<p>Or feel free to reach out to me via email to discuss further... <a href=\"mailto:dhamill@HL7.org\">dhamill@HL7.org</a></p>",
        "id": 274761946,
        "sender_full_name": "Dave Hamill",
        "timestamp": 1646864861
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"214452\">@Rob Dingwell</span> </p>\n<p><a href=\"/user_uploads/10155/6poTYBd_oC3cbw_anbhWTLyO/HL7_RFIP_FHIR_Sandbox_Revised.pdf\">HL7_RFIP_FHIR_Sandbox_Revised.pdf</a></p>",
        "id": 274762053,
        "sender_full_name": "Dave Hamill",
        "timestamp": 1646864903
    }
]