[
    {
        "content": "<p>I understand from Lloyd that the latest FHIR build now includes initial draft resources for Research Study and Research Subject.  These are being used for the Structured Data Capture stream used by PCORI.  Please check them out and comment.</p>",
        "id": 153857464,
        "sender_full_name": "Wayne Kubick",
        "timestamp": 1479377230
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/researchstudy.html\" target=\"_blank\" title=\"http://build.fhir.org/researchstudy.html\">http://build.fhir.org/researchstudy.html</a> and <a href=\"http://build.fhir.org/researchsubject.html\" target=\"_blank\" title=\"http://build.fhir.org/researchsubject.html\">http://build.fhir.org/researchsubject.html</a></p>",
        "id": 153857479,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479378047
    },
    {
        "content": "<p>Uuuuuh, thanks Wayne and Lloyd, splendid!!</p>",
        "id": 153857494,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1479379755
    },
    {
        "content": "<p>I'll need to re-evaluate <code>Consent</code> on whether it's now suitable for informed consent; we still use <code>Contract</code> for informed consent in our DSTU-2 implementation, so would not work with <code>ResearchSubject.consent</code>.</p>",
        "id": 153857497,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1479379952
    },
    {
        "content": "<p>Yeah, I'm hoping that Consent is going to evolve in a more general direction and will eventually support Consent for activity beyond just Consent for information disclosure.  Contract seems non-ideal</p>",
        "id": 153857498,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479380040
    },
    {
        "content": "<p>Agreed 👍🏼</p>",
        "id": 153857501,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1479380849
    },
    {
        "content": "<p>The team working on Consent are eager to make it useful. Please provide your comments, suggestions, concerns. We can't hit a target we don't see.</p>",
        "id": 153857543,
        "sender_full_name": "John Moehrke",
        "timestamp": 1479389123
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191948\">@Sam Hume</span> FYI</p>",
        "id": 153857583,
        "sender_full_name": "Geoff Low",
        "timestamp": 1479406465
    },
    {
        "content": "<p>Neither of those URLs ever finish loading, is there somewhere else I could see them?</p>",
        "id": 153857699,
        "sender_full_name": "Geoff Low",
        "timestamp": 1479467263
    },
    {
        "content": "<p>That's the only place they're hosted at the moment.  FHIR requires a semi-modern browser (newer version of IE or Chrome or Firefox).  Maybe try using a different browser?</p>",
        "id": 153857703,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479467408
    },
    {
        "content": "<p>These look like a good start. Some questions/comments:</p>\n<p>1. For <code>ResearchStudy</code>, are you imagining that this might provide data to fuel a search site like <a href=\"https://clinicaltrials.gov/\" target=\"_blank\" title=\"https://clinicaltrials.gov/\">https://clinicaltrials.gov/</a>  ? Or is that clearly out of scope? The intro text doesn't make it clear. But if it's in-scope, I'd suggest reviewing the details provided there.</p>\n<p>2. <code>Principal Investigator</code> should end in \"pal\", not \"ple\".</p>\n<p>3. Why is \"study arm\" in <code>ResearchSubject</code> a string and not a coding?</p>",
        "id": 153857850,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1479512096
    },
    {
        "content": "<p>From <a href=\"http://clinicaltrials.gov\" target=\"_blank\" title=\"http://clinicaltrials.gov\">clinicaltrials.gov</a>, I'd consider things like study collaborator, primary/secondary outcome measures, brief + official title, summary + detailed description, study design (allocation, endpoint, intervention, masking, purpose), a list of interventions separate from arms, so each arm can point to the (set of) interventions it uses, a list of publications, an indicator of whether the study is still recruiting (this is not derivable from <code>period.end</code>), details about how many people have been enrolled.</p>",
        "id": 153857854,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1479546908
    },
    {
        "content": "<p>Brief title is there, detailed description is there, allocation, intervention, masking and purpose are there, as are interventions and publications and enrollment (not all of those things will live on the ResearchStudy itself.  Keep in mind that what we capture needs to be the content that's going to be core for all times of research studies - clinical &amp; pre-clinical across all jurisdictions</p>",
        "id": 153857878,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479590980
    },
    {
        "content": "<p>Thanks for these details, Lloyd. I selected those attributes because I was having trouble seeing where they appeared. Where do things like publications and interventions appear? And masking, etc? I couldn't find them. </p>",
        "id": 153857943,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1479679158
    },
    {
        "content": "<p>Also I'm not sure I understand your point about what's in scope -- are you saying that supporting a trial registry is out of scope for this resource? </p>",
        "id": 153857944,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1479679239
    },
    {
        "content": "<p>Look at the mappings to see where stuff lives.  A trial registry is certainly in scope, but core probably wouldn't contain anything that would be specific to a registry but wouldn't be used in the day-to-day execution of a study.</p>",
        "id": 153857955,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479710214
    },
    {
        "content": "<p>Finally got to take a look; looking great already, thanks Lloyd! Some thoughts on <code>ResearchStudy</code>:</p>\n<p>- <code>identifier</code>, could this be <code>0..*</code>? It's possible that a trial is registered in multiple repositories, e.g. <a href=\"http://ClinicalTrials.gov\" target=\"_blank\" title=\"http://ClinicalTrials.gov\">ClinicalTrials.gov</a> and WHO's<br>\n- <code>status</code>, would it make sense to be able to discern between *enrolling*, *no longer enrolling*, *data collection complete*, *data published* or similar? (I made these up on the spot, just checking whether it's desirable at all). Or have a separate <code>enrollmentStatus</code> or similar?<br>\n- <code>site</code>, maybe add a <code>primarySite</code>; or make <code>site</code> a backbone element with a reference and allowing to specify a site as the primary site?<br>\n- extending this thought to investigators: since there usually is one site PI, maybe this could really be a backbone element <code>ResearchStudySite</code> that has a PI and can be marked primary?<br>\n- something that will more and more become important are the <code>publications</code> coming from a study. Is the intention that that would go into <code>relatedArtifacts</code>?<br>\n- same would apply to <code>documents</code> that relate to the trial (like IRB approval, FDA approval, ...); <code>relatedArtifacts</code>?<br>\n- lastly, <code>acronym</code>; many of the larger trials have an acronym; make this a property, or a standard extension?</p>",
        "id": 153857982,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1479737829
    },
    {
        "content": "<p>In a ResearchKit environment, the goal for us is to be able to represent all the sections of the consent document, for which we right now are using <code>Contract.term</code>. It sounds like <code>Consent</code> is not aimed at being able to represent a contract document, but rather represent a signed consent. So our needs would probably be best met by some changes to <code>Contract</code>, rather than <code>Consent</code>.</p>\n<p>ResearchKit knows a handful of different section types, so for <code>term.type</code> we use <strong>http://researchkit.org/docs/Constants/ORKConsentSectionType</strong> for system and e.g. <strong>DataGathering</strong> for code.</p>\n<p>We use <code>term.text</code> for a short (1-2 sentence) explanation of the section. Then we use an extension for a <strong>title</strong> and another extension for the full text (1+ paragraphs) of the section. We'd make this a markdown element.</p>\n<p>We use other extensions to specify which static image and which animation video to show at the top of each section – I guess this really can stay a custom extension.</p>\n<p>Lastly, for <code>subject</code> we use a contained <code>Group</code> and in <code>Group.characteristic</code> we define simple eligibility criteria (such as \"Are you over 18?\"). If we'd use <code>ResearchStudy</code> this abuse could go away and the same Group would reside in <code>ResearchStudy.enrollment</code>.</p>\n<p>So, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , does it sound like using <code>Contract</code> to model the consent we like people to sign, using <code>ResearchStudy.enrollment</code> to define eligibility criteria (which in a ResearchKit app are asked before guiding through consent), then once consented creating creating a <code>Consent</code> resource referencing our contract, creating a <code>ResearchSubject</code> resource referencing a <code>Patient</code> and referencing the consent is a sensible way to model enrollment?</p>",
        "id": 153857990,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1479740816
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <span class=\"user-mention\" data-user-id=\"192017\">@Nagesh Bashyam</span> note</p>",
        "id": 153858024,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479759756
    },
    {
        "content": "<blockquote>\n<p>Look at the mappings to see where stuff lives</p>\n</blockquote>\n<p>But <a href=\"http://build.fhir.org/researchstudy-mappings.html\" target=\"_blank\" title=\"http://build.fhir.org/researchstudy-mappings.html\">http://build.fhir.org/researchstudy-mappings.html</a> doesn't show any of this <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>",
        "id": 153858026,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1479760778
    },
    {
        "content": "<p>First off, this is great that you are building this.  </p>\n<ul>\n<li>With respect to the <code>identifier</code>studies are usually referred to using a sponsor assigned identifier (eg CSOM230BBE01T for <a href=\"https://clinicaltrials.gov/ct2/show/NCT01895296\" target=\"_blank\" title=\"https://clinicaltrials.gov/ct2/show/NCT01895296\">https://clinicaltrials.gov/ct2/show/NCT01895296</a>), but are also registered in one or more clinical trial registries; of which <a href=\"http://clinicaltrials.gov\" target=\"_blank\" title=\"http://clinicaltrials.gov\">clinicaltrials.gov</a>, WHO, EudraCT are examples.   </li>\n<li><code>sponsor</code> should be multiple valued, sponsor and collaborators per  the <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  comment is the pattern used by <a href=\"http://ct.gov\" target=\"_blank\" title=\"http://ct.gov\">ct.gov</a>. </li>\n<li>Study Phase might be useful  </li>\n<li><code>arm</code> and Research plan (<code>protocol</code>) should be linked; so <code>arm</code> should have an attribute that is an Identifier.  Is <code>PlanDefinition</code> intended to be able to be turned into an execution plan, a la the BPMN capability mentioned in IHE RPE?</li>\n<li>I assume that the <code>principalInvestigator</code>is the Study Investigator, but there would also be one or more nominated site Investigators probably through the <code>ResearchStudySite</code> concept per <span class=\"user-mention\" data-user-id=\"191339\">@Pascal Pfiffner</span> </li>\n<li>I think there would be value in having the concept of inclusion/exclusion criteria, with the basic stub of a study condition/conditions on the inclusion element.   Having this information exposed in a structured fashion would make FHIR an interesting mechanism for finding studies.</li>\n<li><code>ResearchSubject.identifier</code> - can you clarify what is meant by \"Business Identifer for event\"?</li>\n</ul>",
        "id": 153858478,
        "sender_full_name": "Geoff Low",
        "timestamp": 1480077996
    },
    {
        "content": "<p>Structured eligibility criteria is definitely a want, but oh so many obstacles...</p>",
        "id": 153858514,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1480086582
    },
    {
        "content": "<p>Oh, I agree.  We've done projects in the past within the PhUSE group to try and develop a model using RDF to be able to reason out INC/EXC (and, yes, I'm well aware that we were in no way the first to have a go at that, EHR4CR were another group ).  Unsurprisingly, we hit a wall pretty quickly as how people phrase the criteria ends up in the worst sort of branching logic you could imagine.  That said, condition is important (and should probably be required in cases where we are beyond Phase I, and it seems to me that it is about as low lying fruit as we could go) - find me the <code>ResearchStudy</code> instances where <code>eligibilityStatement.inclusionCriteria.primaryCondition</code> is <code>Type I IDDM</code>.  Again, maybe that's not a current use case, but it should be I think.  Recruiting subjects to studies is one of the most costly activities you'll undertake, which is strange given that most a Study Participants view the experience favourably.</p>",
        "id": 153858544,
        "sender_full_name": "Geoff Low",
        "timestamp": 1480178323
    },
    {
        "content": "<p>Yes indeed, being able to specify (primary) conditions would already go a long way to get us from an \"excruciating  long\" list of potential trials to merely a \"rather long\" list. I did not read that point right. Just thinking out loud: a bunch of inc/exc <code>Condition</code>, <code>Observation</code>, <code>Medication</code> and maybe even <code>Procedure</code> could be interesting to work with.</p>",
        "id": 153858735,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1480364670
    },
    {
        "content": "<p>Absolutely agreed. I've not been aligned with the SDC group in the past - so I lack context on what's been discussed.  As a vendor in the Bipharma industry I can seen the value of including the eligibility criteria as both a consumer and a producer of Resources.</p>",
        "id": 153859855,
        "sender_full_name": "Geoff Low",
        "timestamp": 1480667671
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191339\">@Pascal Pfiffner</span> 'identifier' - done<br>\n'status' - Not sure about this.  Realistically there are a bunch of sub-elements to a study, each with a status.  Not sure we can capture all the nuances in store.  Certainly something for the group to discuss.<br>\n'site/primarySite' - we could have an element or a flag<br>\n'relatedArtifacts' - Dunno what the proper balance is here between distinct core elements, extensions and relatedArtifacts.  I think this is sort of a place-holder and we'll need further discussion<br>\n'acronym' - I was nervous about putting something like this into core.  It seemed odd to assert that 80% of systems that deal with trials would support a distinct element for this purpose.  Figured I'd leave it to the experts to argue this one<br>\n'consent' - this bit is under evolution.  Neither contract nor consent are ideal fits at the moment, but my hope is that Consent will eventually become a good fit.<br>\nAgree with your thoughts on Group/ResearchSubject/Patient<br>\n<span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> I hadn't defined the mapping properly.  They should show up once the next commit gets processed<br>\n<span class=\"user-mention\" data-user-id=\"192121\">@Geoff Low</span> <br>\n- we can figure out how sophisticated to make sponsor.  I'm fine with making it repeat.  I'm a bit more leary of making it overly sophisticated, but we can see what RCRIM thinks the 80% is<br>\n- we'll have to figure out how the notion of \"Arm\" should be represented in ActivityDefinition.  It may need to be a standard extension for the purpose.  (The idea of \"arm\" isn't common for PlanDefinition in general)<br>\n- My expectation is there would be a ResearchStudy instance for the overall study as well as for each study site, so the site-specific investigator would be identified on the site-specific instance<br>\n- inclusion/exclusion criteria are intended to be handled through Group.  It's semi-structured there and can be made more structured through extensions<br>\n- \"business identifier for event\" is a standard description.  We can override it with a definition that's more intuitive/useful</p>",
        "id": 153860430,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1480904348
    },
    {
        "content": "<p>Sounds great and welcome back!</p>\n<p>- agree on <code>status</code>, probably makes sense to discern status and enrollment status. The latter is per site, could be something to put on that element if we created one (<a href=\"http://CT.gov\" target=\"_blank\" title=\"http://CT.gov\">CT.gov</a> does per-site-status as well) or we use nested research studies as you mention. I haven't thought that through entirely.</p>\n<p>- good points on `acronym. I'm thinking that if a study/trial has one, everyone will refer to it via acronym, but not all trials have one. IMHO this field could be core without causing anxiety; it's a well known concept for trials, if your system doesn't support it the field is left empty with you knowing that your system probably should support it. You're likely right however that it's not supported by 80% of the systems.<br>\nAlso, studies often have a <strong>short title</strong> (needs to be specified in Swiss IRB submissions for example); people are using this inconsistently as far as I can tell. <a href=\"http://CT.gov\" target=\"_blank\" title=\"http://CT.gov\">CT.gov</a> has a <strong>brief title</strong> and an <strong>official title</strong> field, with trials usually specifying a shorter title in the _brief_ field, so not simply the acronym. Some trials have put their acronym into the <strong>other identifiers</strong> section, but often the acronym is not captured standalone (on <a href=\"http://CT.gov\" target=\"_blank\" title=\"http://CT.gov\">CT.gov</a>).<br>\nLong story short, <strong>title</strong>, <strong>shortTitle</strong> and <strong>acronym</strong> are distinct data elements a trial could have. Need to discuss what should be core.</p>",
        "id": 153860588,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1480933850
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191339\">@Pascal Pfiffner</span> 'Group' has status, though I'm not sure that covers enrollment terribly well.<br>\n- We try to be cautious about adding things that are \"easy to ignore\".  The general philosophy in FHIR is to only include things in core that we expect the vast majority of systems to support.  Exceptions to that approach need to be thought about very carefully or the resource becomes over-complex.  (And ResearchStudy is at very high risk for that :))</p>",
        "id": 153860667,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1480949126
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Thanks.  I think we'd need to make the distinction between a primary Sponsor and collaborators, maybe as <code>sponsorType</code> attribute (with possible values Primary, Collaborator, ???)?  I would want to search for studies by PharmaA, and limit it to cases where <code>sponsorType</code> is Primary or Collaborator. </p>",
        "id": 153860713,
        "sender_full_name": "Geoff Low",
        "timestamp": 1480952865
    }
]