[
    {
        "content": "<p>Hi, this looks very interesting and I'm assuming the idea would be to allow FHIR to work seamlessly in Semantic Web environments and perhaps create a FHIR-style \"health information ontology\". I was wondering if you are following OBO principles and targeting to be a member of the OBO Foundry? I guess this would be primarily extending the Information Artifact Ontology if that was the case?</p>",
        "id": 153818197,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1458971114
    },
    {
        "content": "<p>We have been talking on and off with Barry smith about this. But it's not smooth going, there are several problems:</p>",
        "id": 153818198,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458971542
    },
    {
        "content": "<p>- while FHIR has pretty good internal consistency, the actual resources are not 'ontologically pure'. We believe that they can be used well,,but we accept that most users don't care about that</p>",
        "id": 153818199,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458971547
    },
    {
        "content": "<p>- Barry smith believes that we need to force them to, and that FHIR will only be useful (at least from his point of view) if/when we do</p>",
        "id": 153818200,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458971584
    },
    {
        "content": "<p>- we don't agree  with that</p>",
        "id": 153818201,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458971598
    },
    {
        "content": "<p>- further, actually attempting to map FHIR concepts - either internal or resource - usually finds s gulf between the two</p>",
        "id": 153818202,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458971657
    },
    {
        "content": "<p>- so work hasn't actually progressed, though it sounds in theory like it should be useful</p>",
        "id": 153818203,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458971690
    },
    {
        "content": "<p>Well Semantic Web community is probably more difficult than openEHR ;) I have a PhD student who's looking at similar things, I'll see if I can get him help with this. This certainly looks like a very worthwhile thing to do - albeit more academic at the outset but things will change.</p>",
        "id": 153818204,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1458971811
    },
    {
        "content": "<p>Sounds like something worth trying</p>",
        "id": 153818211,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458977691
    }
]