[
    {
        "content": "<p>I have created a new terminology stream for discussions about CodeSystem, ValueSet, ConceptMap, and the terminology service.</p>",
        "id": 153837135,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468184211
    },
    {
        "content": "<p>This stream remains focused on RDF, Turtle, RDF related reasoning, and bindings/mappings from FHIR to other ontologies</p>",
        "id": 153837136,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468184254
    },
    {
        "content": "<p>which is <a href=\"https://chat.fhir.org/#narrow/stream/terminology\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/terminology\">here</a> to save you looking</p>",
        "id": 153837145,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1468191413
    },
    {
        "content": "<p>Our terminology team has two questions on the ConceptMapEquivalence Value Set. First, can you provide the source (or reference) for these codes and definitions? Second, we have maps in which we have not asserted the map equivalence (map type = source “has” target). One way to address that scenario would be to retrospectively review and update the map equivalence. A second option would be for the code to be optional, and a third option would be add a concept to the value set of “unspecified association” or “associated to.” Although we have the capability in our organization to assert map equivalence, I expect many organizations (systems) may not, and so near-term, what do others think of a recommendation to make the code optional or add a concept to the value set that supports this scenario? </p>",
        "id": 153841082,
        "sender_full_name": "Amy Knopp",
        "timestamp": 1469550639
    },
    {
        "content": "<p>first, there are both value set and code system references - is that what you mean? </p>",
        "id": 153841105,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469564468
    },
    {
        "content": "<p>second, I'm not sure I follow. how are they 'associated'? Presumably you could rule out many of the equivalence values, yes?</p>",
        "id": 153841106,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469564512
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191898\">@Amy Knopp</span> I would expect that a default value of 'inexact' would be reasonable</p>\n<p>We too have been struggling to pick apart the meaning and implications of the various codes.</p>",
        "id": 153841442,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1469685847
    },
    {
        "content": "<p>Grahame,<br>\nThe code system reference is: System URL: <a href=\"http://hl7.org/fhir/concept-map-equivalence\" target=\"_blank\" title=\"http://hl7.org/fhir/concept-map-equivalence\">http://hl7.org/fhir/concept-map-equivalence</a>. Is there an existing reference standard from which these codes/concepts are based? The scenario we have is when the map equivalence has not been asserted. They may be equal or they may be wider. We may change our approach going forward to assert the map equivalence more accurately, but for now, we have many mappings in which the ConceptMap.element.target.equivalence is unspecified (e.g. we provide the appropriate LOINC code to map to for a lab result, but don’t specify whether the concept map is equal or wider). Near-term we need to decide if we are going to leave the ConceptMap.element.target.equivalence as uncoded (even though it is “required”) or pick the best of the options provided (and not have it be accurate). Our recommendation is to either leave the map equivalence code as optional or provide a concept in the value set (<a href=\"http://hl7.org/fhir/ValueSet/concept-map-equivalence\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/concept-map-equivalence\">http://hl7.org/fhir/ValueSet/concept-map-equivalence</a>) for “unspecified association” or “associated to” (which I suspect may be needed by many organizations that do not have terminology servers that support this richness.</p>\n<p>Your near and long-term recommendations are welcome.</p>\n<p>-Amy Knopp, Terminology Manager, Mayo Clinic</p>",
        "id": 153841496,
        "sender_full_name": "Amy Knopp",
        "timestamp": 1469724959
    },
    {
        "content": "<p>Thank you, Michael for your input. We are considering the use of \"inexact\" (which will be inaccurate) or not coding the ConceptMap.element.target equivalence (which will be non-conformant). </p>",
        "id": 153841497,
        "sender_full_name": "Amy Knopp",
        "timestamp": 1469725098
    },
    {
        "content": "<p>I agree that if this is a required element the value set needs to include \"Unspecified\". The problem with making the element optional is that it allows laziness to creep in, but I would understand that is a change that should also be considered.</p>",
        "id": 153841505,
        "sender_full_name": "Robert McClure",
        "timestamp": 1469731785
    },
    {
        "content": "<p>but you can rull out unmatched, and disjoint, right? Maybe we should create a parent concept for equal, equivalent, narrower, wider and inexact. Called 'related to'?</p>",
        "id": 153841515,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469733933
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I agree, that is another solution but while I think it's semantically correct, I'm not sure that it helps because the inferencing capabilities don't seem that useful, but I might be missing something. Even so, your solution is workable and I don't think it would lead to misuse (I hope.)</p>",
        "id": 153841546,
        "sender_full_name": "Robert McClure",
        "timestamp": 1469735729
    },
    {
        "content": "<p>well, it's saying at least that the association is no 'not this one' </p>",
        "id": 153841549,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469735861
    },
    {
        "content": "<p>My terminologists would be very happy with related_to -- often maps are built for use-cases where inferencing is not required.<br>\nI would strongly object to unspecified; it offers no advantage over making the equivalence optional; it can't be used to disabiguate related_to and unmatched, which will lead to problems of ambiguity</p>",
        "id": 153841625,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1469773885
    },
    {
        "content": "<p>+1 for related_to, as Grahame described</p>",
        "id": 153841642,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1469795300
    }
]