[
    {
        "content": "<p>What are the considerations around whether to leverage FHIR value sets and/or coding system outside of FHIR, such as in CCDA?  (This question came up in context of Lisa Nelson asking about using <a href=\"http://build.fhir.org/valueset-care-team-category.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-care-team-category.html\">http://build.fhir.org/valueset-care-team-category.html</a> in CCDA because those codes are not available in LOINC)</p>",
        "id": 153872500,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1487368723
    },
    {
        "content": "<p>there's no really any technical issues; we assign OIDs to all our value sets and code systems, so you'd just use the OID and the code. there might be some policy issues, but I think we would work through those</p>",
        "id": 153872503,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487370236
    },
    {
        "content": "<p>Would policy issues include consideration for backwards compatibility in case the value sets change?</p>",
        "id": 153872505,
        "sender_full_name": "Emma Jones",
        "timestamp": 1487371232
    },
    {
        "content": "<p>I don't know. We'd certainly have to consider that, but I'm not sure how we'd handle it</p>",
        "id": 153872512,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487372502
    },
    {
        "content": "<p>I see no reason that we would not use FHIR value sets (even code systems to make a different value set) in other standards, like C-CDA. As Grham notes, they provide an OID so we can use that id. As for \"backward compatability\" - I'm not sure what that is supposed to mean. I assume FHIR manages versions of value set definitions (right <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>?) and code systems so a binding of a value set could reference the specific definition version. The issue is to get to a specific expansion you also need indicate what code system version is to be used. </p>",
        "id": 153872527,
        "sender_full_name": "Robert McClure",
        "timestamp": 1487385787
    },
    {
        "content": "<p>FHIR-defined code systems are only intended to be used for \"structural\" type elements in FHIR or as a temporary placeholder until an appropriate terminology is defined elsewhere, with a v3 code system being the fall-back.  FHIR codes are not subject to harmonization and changes are totally at the will of the responsible work group (and ballot).  This particular terminology should be migrated to v3 (where CDA can easily take advantage of it too)</p>",
        "id": 153872541,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487401420
    },
    {
        "content": "<p>well, I think that increasingly 'migrated to v3' is a misnomer</p>",
        "id": 153872560,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487434779
    },
    {
        "content": "<p>harmonization is not a perfect solution either</p>",
        "id": 153872561,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487434791
    },
    {
        "content": "<p>what we should do - and it's a policy that we will do - is migrate both fhir and v3 code system maintenance (non structural codes) towards a common maintenance policy that resolves the procedural issues I referred to above. In the meantime, anyone using these FHIR code systems outside fhir, well, caveat emptor</p>",
        "id": 153872562,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487434865
    },
    {
        "content": "<p>anyway, the issues are policy and procedural not technical</p>",
        "id": 153872563,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487434886
    },
    {
        "content": "<p>Yes.  I was getting ready to say something similar.  </p>",
        "id": 153872567,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1487435325
    },
    {
        "content": "<p>I'm reflecting our current agreement with the vocabulary WG.  We can certainly change the rules, but we should be explicit about doing so.</p>",
        "id": 153872759,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487570436
    },
    {
        "content": "<p>Yes, I agree.  It may be time to think about doing that as we're moving into working on STU4/Normative.</p>",
        "id": 153872834,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1487603593
    }
]