[
    {
        "content": "<p>I would like to slice a Coding element to indicate the preferred use of certain codes for certain scenarios. This is similar to what the is done with the slicing directly on <code>Condition.code</code> in the <a href=\"http://www.hl7.org/fhir/uv/ips/STU1/StructureDefinition-Condition-uv-ips.html\">IPS Condition profile</a>. However, as I understood <a href=\"#narrow/stream/179166-implementers/topic/Slicing.20non-repeating.20elements.20to.20define.20a.20choice\">from this long discussion</a>, slicing of non-repeating, non-polymorphic fields like <code>Condition.code</code> will not be (generally) supported, so I am trying use slicing directly on <code>CodeableConcept.Coding</code> instead. The slices I want are defined by single codes, but from different code systems. I thought this might work with pattern-slicing but there I am forced to pick out a single element inside <code>Coding</code> (at least Forge wants me to do that) so I cannot provide a pattern involving both <code>system</code> and <code>code</code>. I suppose I could also bind each slice to a different single-code ValueSet &amp; discriminate on that, though that somehow seems a little heavy-handed. Would that be the recommended approach or is there another way to achieve this?</p>",
        "id": 249331536,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628840238
    },
    {
        "content": "<p>Forge doesn’t offer you „$this“ when selecting the discriminator in the drop-down box. However, you can simply enter it directly. Then on each slice you can add a pattern with code and system.</p>",
        "id": 249332696,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1628841405
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"409859\">@Rob Langezaal</span> FYI, sounds like a small but good improvement to offer this directly</p>",
        "id": 249332750,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1628841463
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span> I thought I tried that and it still generated an error, but seeing you answer I tried again and it works <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 249342275,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628849026
    },
    {
        "content": "<p>And yes, would be nice to have this directly in Forge.</p>",
        "id": 249342354,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628849064
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"194703\">Morten Ernebjerg</span> has marked this topic as resolved.</p>",
        "id": 249342365,
        "sender_full_name": "Notification Bot",
        "timestamp": 1628849084
    },
    {
        "content": "<p>Note that you can't slice by value set unless you're using a 'required' binding.  If you're slicing by system, that's fine.</p>",
        "id": 249364526,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628863667
    },
    {
        "content": "<p>Ah, good to know!</p>",
        "id": 249370184,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1628866406
    }
]