[
    {
        "content": "<p>Just need to check whether my understanding is correct:</p>\n<p>If a Profile A requires a Reference to conform to Profile B1 (and B only!),<br>\nthen an derived Profile A' can add an additional target B2 (not derived from B1) to the ElementDefinition.</p>\n<p>Multiple targets on an ElementDefinition means the target has to match any profile,<br>\nso an Instance <strong>a</strong> referencing an Instance <strong>b</strong> might be valid against A' but not against A,<br>\nif <strong>b</strong> is valid against  B2 but not B1.</p>\n<p>Is that right? Is that how it is supposed to be? Or are additional targets in derived profiles only allowed if they are also derived from the original target?</p>",
        "id": 200121753,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1591633125
    },
    {
        "content": "<p>Profile A` can't add additional options that aren't permitted by the base profile.  It can define variants on what A allows, but can't introduce anything that wouldn't be valid against A.</p>",
        "id": 200122128,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591633301
    },
    {
        "content": "<p>Ok, so I <em>can</em> add additional TargetProfiles, but only if they are constraints of the original TargetProfile, correct?</p>",
        "id": 200122475,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1591633460
    },
    {
        "content": "<p>right</p>",
        "id": 200122794,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591633600
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 200123170,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1591633781
    },
    {
        "content": "<p>they don't have to have the original TargetProfile as their base though.</p>",
        "id": 200139326,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591641669
    },
    {
        "content": "<p>you could have A that constrains Observation.code, and on Observation.performer constrains it to Practitioner B1 that makes telecom required.</p>",
        "id": 200139532,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591641763
    },
    {
        "content": "<p>So Profile A' still must restrict Practitioner.performer to B1, but it may also additionally add Practitioner profile C that says that Practitioner must have a name, without any relationship to B1</p>",
        "id": 200139666,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591641840
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179177-conformance/topic/Adding.20TargetProfiles.20in.20derived.20Profiles/near/200139666\">said</a>:</p>\n<blockquote>\n<p>So Profile A' still must restrict Practitioner.performer to B1, but it may also additionally add Practitioner profile C that says that Practitioner must have a name, without any relationship to B1</p>\n</blockquote>\n<p>My reading of the spec suggests this is not the case.  The definition of <code>targetProfile</code> says:</p>\n<blockquote>\n<p>If any profiles are specified, then the content must conform to at least one of them.</p>\n</blockquote>\n<p>Since Profile A only has one targetProfile on Practitioner (called B1), then references to Practitioner in instances of A <em>must</em> conform to B1.  Now if A' adds another targetProfile to Practitioner (called C) that constrains a <em>different</em> part of Practitioner than B1, instances of A' are only required to conform to <em>one of</em> Practitioner profiles, B1 <em>or</em> C.  If an instance of A' had a Performer that conformed only to C, then it would be valid against A' but would <em>not</em> be valid against A.  Therefore, I don't think it is valid to add additional targetProfiles unless they are strictly a more constrained version of the already existing targetProfiles.</p>",
        "id": 200142472,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1591643195
    },
    {
        "content": "<p>Which in my reading says: If Practitioner profile C also says that telecom is required, then Grahame's  example would work, although C doesn't state it was derived from B1. Correct?</p>",
        "id": 200199582,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1591694619
    },
    {
        "content": "<p>Yes, <span class=\"user-mention\" data-user-id=\"196115\">@Mareike Przysucha</span> -- that's my reading of it as well.  It doesn't have to be formally related to B1, but it has to have at least the same constraints (or more constrained versions of them).</p>",
        "id": 200220809,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1591706420
    }
]