[
    {
        "content": "<p>I have been asked whether there is an option to indicate in a profile, which elements are allowed to be changed on an update: e.g. you can change the date on a Procedure but not the Patient-Reference. Of course, systems can always return errors if business logic is violated when processing an update, but I think there is also a benefit in telling Clients beforehand what they can and cannot do. <br>\nAny ideas on how to profile that?</p>",
        "id": 274394386,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1646661441
    },
    {
        "content": "<p>There are no discrete data elements for that purpose.  Often the rules vary based on business state as well as who's making the change.  For example, changing the drug on a MedicationRequest in 'draft' state is fine.  Changing it once it's active it not.  Similarly, there may be restrictions on who's allowed to correct a patient's birthDate.</p>",
        "id": 274445640,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646681689
    },
    {
        "content": "<p>possibly this could be a use-case for Permission, but it is not yet today a use-case for Permission. Unclear what the use-case need is.</p>",
        "id": 274450697,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646683975
    },
    {
        "content": "<p>It's almost like you need an <code>onUpdate</code> constraint that would allow you to use FHIRPath with built-in <code>$current</code> and <code>$updated</code> variables so you can do whatever checks you want and return <code>true</code>/<code>false</code>.  That said, I bet you might run into some gnarly FHIR path depending on the complexity of what you need to do.</p>",
        "id": 274472273,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1646694482
    },
    {
        "content": "<p>I have such a thing in my server - see EventDefinition</p>",
        "id": 274497434,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1646715978
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> you got an example of such an EventDefinition?</p>",
        "id": 274955200,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1646993568
    },
    {
        "content": "<p>not off hand</p>",
        "id": 274955232,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1646993589
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> might</p>",
        "id": 274955242,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1646993596
    },
    {
        "content": "<p>I am not sure whether this needs to be computable for a validator. I'd leave it to the server to decide where these checks happen (whether it's interface logic or business logic or database logic). I am merely looking for a way to indicate through  profile to a client what can and cannot be changed, so they can adapt and e.g. allow/not allow user edits in the UI. In the simplest of cases, it could be a boolean flag on element level.<br>\nBut I agree, that a dependency on Resource status is avalid use case.</p>",
        "id": 276044932,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1647866948
    }
]