[
    {
        "content": "<p>The spec is unclear regarding how <code>ElementDefinition</code> properties that are arrays should be handled in <code>differentials</code>.  The basic question is that if a parent definition has an element with <code>foo: [a, b, c]</code> and a profile's corresponding differential element has <code>foo: [d]</code>, what is the resulting snapshot?  Does the differential value <em>replace</em> the whole array (e.g., snapshot is <code>foo: [d]</code>) or is the differential value <em>additive</em> (e.g., snapshot is <code>foo: [a, b, c, d]</code>)?</p>\n<p>It seems that maybe it is context dependent.  For example, for <code>ElementDefinition.type</code>, the type array in the differential element definitely <em>replaces</em> the inherited type array (otherwise there would be no way to narrow types).  BUT... looking at some existing IGs, it looks like <code>ElementDefinition.constraints</code> is <em>additive</em> (e.g., the differential can list only <em>new</em> constraints, but the snapshot will contain new <em>and</em> inherited constraints).</p>\n<p>Are these rules outlined anywhere?  We need a definitive approach to ensure we generate the correct differentials in SUSHI.</p>",
        "id": 205933275,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1596561029
    },
    {
        "content": "<p>Ping.  Does no one know how this is supposed to work?</p>",
        "id": 207624746,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1598010251
    },
    {
        "content": "<p>there's an outstanding task to write this up somewhere</p>",
        "id": 207625172,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598010708
    },
    {
        "content": "<p>there is a set answer, represented in the snap shot tests</p>",
        "id": 207625226,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598010724
    },
    {
        "content": "<p>constraints are additive. Types are special and how that works is written up in the spec. Differentials... not sure</p>",
        "id": 207625254,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598010754
    }
]