[
    {
        "content": "<p>We have been asked how to add German display labels to FHIR Profiles, and after bouncing a few ideas around (ElementDefinition.mapping, Translate-Extension on <a href=\"http://ElementDefinition.name\" target=\"_blank\" title=\"http://ElementDefinition.name\">ElementDefinition.name</a>, ElementDefinition.alias) we came to the conclusion that it would be much more useful to associate labels with FHIRPath expressions rather than elements to enable things like „Mobile Number“: Patient.telecom.where(use=‚mobile‘) etc.</p>\n<p>Having such associations could then be used to support both the creation of Questionnaires with prepopulation/data extraction services as well as templates for narrative generation.</p>\n<p>However, we are uncertain of how to represent these associations in FHIR. Could this be a CodeSystem with FHIRPath-Expressions as Codes and Labels as DisplayValues? ConceptMap? Something else?</p>",
        "id": 175094695,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567797113
    },
    {
        "content": "<p>I'm not sure that I understand. You can provide code system supplements that contain german display equivalents for the codes - that looks like your use case above. Or you can use the translation extension to put alternate displays on elements. </p>\n<p>What you've asked feels like you're trying to put displays on things that don't have displays?</p>",
        "id": 175103503,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567803856
    },
    {
        "content": "<p>If you're wanting to give specific labels to particular paths into elements, that's starting to tread into the place of Questionnaire - where you're creating a distinct data model for display that exposes resource elements in a different way than they're naturally represented within the resources.</p>",
        "id": 175106013,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567805796
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  we're not looking at translating codes but at creating shareable translations for FHIR element names, like \"birthDate\" -&gt; \"Geburtsdatum\".<br>\nWe have been thinking about SDC-Questionnaires, but I thought the same kind of translations could be useful to generate Narrative templates. I am thinking about having a common structure that maps Element paths to display labels as a source to generate both the Questionnaire for data capture as well as the Narrative for presentation...</p>",
        "id": 175137244,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567855907
    },
    {
        "content": "<p>As another example, date values would be presented differntly in a German UI (\"02.09.1980\" instead of \"1980-09-02\")<br>\nI couldn't represent that by just adding a translation to the element , but I could do it with a FHIRPath-Expression...</p>",
        "id": 175137345,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567856111
    },
    {
        "content": "<p>I suppose a SDC-Questionnaire with FHIRPath expressions to prepopulate the items could in fact double as a Narrative template... It's just a different way of rendering it.<br>\nIt's just that a Questionnaire seems a bit of an obscure way to maintain the translations...But with the ongoing discussions about creating reuseable parts for Questionnaires, i guess, why not...?</p>",
        "id": 175137575,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1567856626
    },
    {
        "content": "<p>I'd encourage <em>not</em> changing the date format for presentation.  While yyyy-mm-dd isn't the typical format used in either Europe or North America, it's unambiguous and understood in both places.</p>",
        "id": 175142308,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567865573
    },
    {
        "content": "<blockquote>\n<p>creating shareable translations for FHIR element names</p>\n</blockquote>\n<p>The IG tooling expects that you'll do that using the <a href=\"http://hl7.org/fhir/StructureDefinition/translation\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/translation\">http://hl7.org/fhir/StructureDefinition/translation</a> extension</p>",
        "id": 175155354,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567890073
    },
    {
        "content": "<blockquote>\n<p>As another example, date values would be presented differntly in a German UI (\"02.09.1980\" instead of \"1980-09-02\")<br>\nI couldn't represent that by just adding a translation to the element , but I could do it with a FHIRPath-Expression...</p>\n</blockquote>\n<p>For Dates I would also say that the UI can present them in the appropriate format without the need to do anything in FHIR. Knowning the machine readable date plus the language is sufficient to display any date or datetime.</p>",
        "id": 175411399,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1568191023
    },
    {
        "content": "<p>That's true for the computable data, not for the transmitted narrative.  However, the narrative could theoretically be seen by people in any country, so unambiguous is best.</p>",
        "id": 175426427,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568205436
    }
]