[
    {
        "content": "<p>I am working on a profile (in Forge) and want to introduce a ValueSet binding for the allowed codes in a fieldof  type CodeableConcept. A binding could be added at three levels:</p>\n<p>1. Field itself (X)<br>\n2. coding (X.coding)<br>\n3. coding.code field (X.coding.code)</p>\n<p>Looking at examples, it seems most common to have a binding to the field itself (case 1). However, the bound ValueSet often looks (to a casual observer, at least) like smt. that could equally well be bound to coding.code (case 3), namely a list of codes. Actually, I suppose it is generally not quite clear to me how ValueSet bindings work for fields with a complex data type (since the codes would then seem to also have to be complex objects).</p>\n<p>A particular case I was pondering is when the ValueSet corresponds to all codes from a single coding system. It seems that is also often covered with a binding to the whole field (X), but I would have thought the more precise thing would be to fix X.coding.system to the relevant system and then bind a ValueSet to X.coding.code.</p>\n<p>Is there some guidance/discussion of this available? (didn't find any yet)</p>",
        "id": 155174053,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1547563588
    },
    {
        "content": "<p>Bind to the top level unless you need multiple bindings, in which case put the \"main\" binding at the top level and then slice CodeableConcept.coding and define additional bindings on each slice.  <em>Never</em> bind to coding.code as the binding needs to take into account both the code + system.  Bindings on \"code\" should only occur for elements that only have a type of <code>code</code> - e.g. Patient.gender</p>",
        "id": 155174854,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547564178
    },
    {
        "content": "<p>Consider that a required binding on top level requires only one instance of coding to comply to the given ValueSet, whereas doing it on a lower level (without slicing ) requires <em>all</em> instances of coding to comply to the binding.</p>",
        "id": 155187513,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1547573214
    },
    {
        "content": "<p>Which is why you do it on the lower level, it should always be with slicing :)</p>",
        "id": 155196718,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547580328
    },
    {
        "content": "<p>Thanks a lot, that cleared up several things for me!</p>",
        "id": 155233678,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1547622846
    }
]