[
    {
        "content": "<p>Whats the intended lifecycle on careteams? In my setup, careteams are sort of static - eg. careteams groups a set of pracititioners, and the careteams can themselves treat multiple patients. Moreover, careteams don't tend to update much - they more or less reflect the team of people that you work with on a daily basis. While this seems like a good fit for the careteam resource so far, it seems a bit muddy that patients can also be part of a careteam in that sense that the practitioner members seldom change on the careteam, and the careteam can exist for years without changed. However the list of patients that are treated by the careteam can grow indefinitely over time as the team treats more and more patients and they too can be members.</p>",
        "id": 208062090,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1598428378
    },
    {
        "content": "<p>Shouldn't the practitioner then also have a set of patients that they provide care for?</p>",
        "id": 208062274,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1598428507
    },
    {
        "content": "<p>Sounds like a question for PC <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 208062392,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598428566
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> could you please elaborate on the current design?</p>",
        "id": 208503700,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1598820537
    },
    {
        "content": "<p>I can raise this with Patient Care, but based on past discussions, we've identified multiple categories of CareTeams.  The <a href=\"http://build.fhir.org/careteam.html#bnc\">http://build.fhir.org/careteam.html#bnc</a> summarizes the different use cases.</p>\n<blockquote>\n<p>The CareTeam includes all the people and organizations who plan to participate in the coordination and delivery of care and is assigned to:</p>\n<ul>\n<li>a single patient, or</li>\n<li>a group (such as a married couple in therapy or a support group), or</li>\n<li>an event, prior to a subject being identified (such as a code blue team or emergency response team)</li>\n</ul>\n</blockquote>\n<p>The above aligns with subject of Patient (singular), Group (e.g. married couple), or not valued (e.g. event based).  The resource doesn't support multiple subjects.  If the same set of Practitioners are treating 2 to N Patients, then I would expect to have 2 to N instances of CareTeam.  Each Patient (subject) would have their own unique CareTeam.status, period, reason despite CareTeam.participant.member referencing the same Practitioners</p>",
        "id": 208620043,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1598910839
    },
    {
        "content": "<p>After Patient Care briefly discussed, we concluded that we wanted to log a change request (done:  <a href=\"http://jira.hl7.org/browse/FHIR-28457\">J#28457</a>) to clarify when to use Group vs multiple CareTeam instances (one per patient).  <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> Feel free to add yourself as a watcher and/or comment on the <a href=\"http://jira.hl7.org/browse/FHIR-28457\">J#28457</a></p>",
        "id": 209541430,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1599672135
    },
    {
        "content": "<p>I would say a careteam is still a careteam, regardless of a prior identification of the subject or not - at least in real life. If careteam cannot be used or is not intended to be used to model a group of clinicians across delivery of care to different patients, what resource should then be used <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  ?</p>",
        "id": 209545867,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599674133
    },
    {
        "content": "<p>You can absolutely use a CareTeam in absence of a patient (event-based care team)</p>",
        "id": 209546016,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1599674199
    },
    {
        "content": "<p>my case is not event based. My case concerns more or less static careteams that covers care for multiple patients.</p>",
        "id": 209546237,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599674295
    },
    {
        "content": "<p>my careteams are sort of micro organizations with 4-5 clinicians that provide care for eg. 20 patients</p>",
        "id": 209546369,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599674359
    },
    {
        "content": "<p>and those 20 patients are not a group as such.</p>",
        "id": 209546524,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599674426
    },
    {
        "content": "<p>Feel free to comment on the JIRA if you would like more examples added of CareTeams without a subject.  The piece that might warrant yet another JIRA is clarifying whether your use case could be solved with the patient-specific CareTeams (plural) all referencing the same CareTeam (for providers)</p>",
        "id": 209546988,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1599674648
    },
    {
        "content": "<p>I would like to add that my careteams are also required to be externally identifiable as they are subject to be referenced from other systems. From that perspective, it would seem odd if the system needed 20 different careteams each with the same identifier</p>",
        "id": 209547430,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599674890
    },
    {
        "content": "<p>For example:<br>\nCareTeam [1] has no subject and all CareTeam.participant.members are Practitioners<br>\nCareTeam [2] is specific to Patient A and its CareTeam.participant.member references CareTeam [1]<br>\nCareTeam [3] is specific to Patient B and its CareTeam.participant.member references CareTeam [1]<br>\nCareTeam [N] is specific to Patient N and its CareTeam.participant.member references CareTeam [1]</p>",
        "id": 209547519,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1599674954
    },
    {
        "content": "<p>yes, thats one logical way to solve it. I'll give you that</p>",
        "id": 209548225,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599675389
    },
    {
        "content": "<p>but what is gained since a caretem can eg. be referenced from an episodeofcare which has its own patient reference</p>",
        "id": 209548406,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599675490
    },
    {
        "content": "<p>Seems like you are suggesting that you might want CareTeam.subject to support 0..* but that implies all subjects share the exact same CareTeam attributes (which I don't think is true).  For example:</p>\n<ul>\n<li>The time period (when the team came into effect per patient/subject) will differ.  </li>\n<li>The reason/Condition will differ (Condition.subject is singular as well)</li>\n</ul>",
        "id": 209548529,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1599675575
    },
    {
        "content": "<p>might you use HealthcareService or Organizatino? It can be many layers of Organization within Organization..... so you could use it for a team  <a href=\"http://build.fhir.org/administration-module.html#dir-reg\">http://build.fhir.org/administration-module.html#dir-reg</a></p>",
        "id": 209548697,
        "sender_full_name": "John Moehrke",
        "timestamp": 1599675667
    },
    {
        "content": "<p>but essentially you can build a graph where the careteam has patient A as subject, and the careteam is referenced on EoC which has patient B as patient reference</p>",
        "id": 209548833,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599675744
    },
    {
        "content": "<p>but that case maybe apply to multiple places</p>",
        "id": 209548922,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599675809
    },
    {
        "content": "<p>In the example of EpisodeOfCare (which is one category of CareTeam), I agree that there is some overlap in the CareTeam attributes and the EpisodeOfCare (since EpisodeOfCare has a time period and diagnosis/Condition too) - meaning you might not need the patient-specific CareTeams(?).  It seems possible that EpisodeOfCare references the non-subject specific CareTeam [1] in my earlier example.  However, there are other types of CareTeams (unrelated to a given EpisodeOfCare) where the dates/reason are captured as part of patient-specific CareTeam.</p>",
        "id": 209549228,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1599675997
    },
    {
        "content": "<p>I dont need patient specific careteams in my setup as it brings nothing but overhead. My point here is mostly that the case is possible (and maybe even likely) , but the documentation does not really cater for that case, eventhough it seems pretty central, IMHO.</p>",
        "id": 209550788,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599676822
    },
    {
        "content": "<p>the case being the careteam that isn't (necessarily) defined as a team \"prior to a subject being identified\" as well as not being patient specific.</p>",
        "id": 209550905,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599676905
    },
    {
        "content": "<p>my case would then be a fourth bullet, if I may suggest</p>",
        "id": 209550992,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599676948
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> whats your take on that?</p>",
        "id": 209561358,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599682258
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179177-conformance/topic/careteam.20lifecycle/near/209548697\">said</a>:</p>\n<blockquote>\n<p>might you use HealthcareService or Organizatino? It can be many layers of Organization within Organization..... so you could use it for a team  <a href=\"http://build.fhir.org/administration-module.html#dir-reg\">http://build.fhir.org/administration-module.html#dir-reg</a></p>\n</blockquote>\n<p>well ... yes and no. I can easily see that healthcareservice has some potential, and in some areas it could be an ok fit, however it totally lacks the part about participants</p>",
        "id": 209561826,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599682540
    },
    {
        "content": "<p>Agree that we should consider adding a fourth bullet to describe another use case....feel free to log a JIRA with any proposed language that you think covers your use case.</p>",
        "id": 209570399,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1599686492
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-28461\">https://jira.hl7.org/browse/FHIR-28461</a></p>",
        "id": 209605607,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599724202
    }
]