[
    {
        "content": "<p>So Lloyd and I have a question for people</p>",
        "id": 182926575,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575870893
    },
    {
        "content": "<p>the validator is in process, and it comes across an element that has multiple profiles associated with it. It's valid if any one of the profiles is valid.</p>",
        "id": 182926589,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575870925
    },
    {
        "content": "<p>so let's say none of the profiles are, because every one of them has an error.</p>",
        "id": 182926599,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575870947
    },
    {
        "content": "<p>what we do now is report the primary (proximal?) error: this is not valid against any of the possible profiles</p>",
        "id": 182926646,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575870970
    },
    {
        "content": "<p>then we report all the errors that we found trying to match against the profiles.</p>",
        "id": 182926655,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575870984
    },
    {
        "content": "<p>but .... they're not errors in the same sense as other errors we report</p>",
        "id": 182926660,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575871004
    },
    {
        "content": "<p>but they're not warnings either....</p>",
        "id": 182926664,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575871011
    },
    {
        "content": "<p>any thoughts?</p>",
        "id": 182926671,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575871019
    },
    {
        "content": "<p>The errors might just be categorized as information?</p>",
        "id": 182927939,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1575873220
    },
    {
        "content": "<p>we're concerned that calling them warnings or information will be confusing since they are kind of errors</p>",
        "id": 182928217,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575873644
    },
    {
        "content": "<p>I think that failing to conform to a profile is only an error if there is a requirement to conform to the profile. All of the errors against the profiles are just information, the only error is the proximal one.</p>",
        "id": 182928647,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1575874392
    },
    {
        "content": "<p>But if you're failing to conform to a set of acceptable profiles, which non-conformance is the error?</p>",
        "id": 182929400,
        "sender_full_name": "Jim Steel",
        "timestamp": 1575875512
    },
    {
        "content": "<p>You can't tell which profile was the 'intended' profile the instance should have been valid against.  The challenge is that the validation results against <em>each</em> of the candidate profiles might have error, warning and information messages - and any of those might be the clue that makes it obvious why the instance isn't validating successfully against one of the target profiles.  If we change the severity of the profile validation reported back, it may be confusing and we'd be collapsing errors, warnings and possibly information messages into a single level.  That would also mean it wouldn't be obvious which of the complaints were the actual 'error'.</p>",
        "id": 182956420,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575899377
    },
    {
        "content": "<p>I think that the error should just be that the instance doesn't conform to any acceptable profiles and list the profiles. They can either then add a <code>meta.profile</code> (which I know is contentious here) or resubmit the $validate operation with a profile parameter. Don't try to guess what the user is doing.</p>",
        "id": 183007881,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1575931224
    },
    {
        "content": "<p>we're not trying to guess what the user is doing, just how to communicate what the validator is saying, and why</p>",
        "id": 183007948,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575931288
    },
    {
        "content": "<p>Suppressing the detailed errors is certainly a viable approach.  As a developer, it means more digging, but from an end user perspective, it's much less overwhelming.</p>",
        "id": 183008076,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575931403
    },
    {
        "content": "<p>more digging that wouldn't be possible for profile (as oppose to targetProfile which Jason was talking about)</p>",
        "id": 183008221,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575931503
    },
    {
        "content": "<p>but if we added the errors as an extension to OperationOutcome.issue, we could be explicit: <br>\n- error at path: None of the applicable profiles apply:<br>\n  +(extension): profile XXXX: error <br>\n  +(extension): profile XXXX: error</p>",
        "id": 183008374,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575931593
    },
    {
        "content": "<p>Could be a honking lot of extensions.  Perhaps render into a table in the detail?</p>",
        "id": 183008450,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575931663
    },
    {
        "content": "<p>Well, you sort of are trying to guess what the user is doing since you're trying to decide what errors to report. My proposal is just to say \"I don't know what you're trying to do, this is all wrong, it doesn't comply with any of my profiles. Try again and be more explicit.\"</p>",
        "id": 183008516,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1575931700
    },
    {
        "content": "<p>Regarding extensions, I guess I want to see what the JSON would look like before I got too excited. Sounds like a lot of extensions. Still think it is easier to just fail and say try again and tell me what this is supposed to be.</p>",
        "id": 183008834,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1575931934
    },
    {
        "content": "<p>but you can't be more explicit, and it may not be at all obvious why the validator thinks it doesn't comply</p>",
        "id": 183008840,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575931943
    },
    {
        "content": "<blockquote>\n<p>tell me what this is supposed to be.</p>\n</blockquote>\n<p>That's just not the point.</p>",
        "id": 183008866,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575931961
    },
    {
        "content": "<blockquote>\n<p>but you can't be more explicit</p>\n</blockquote>\n<p>Then I guess I don't know what we're talking about. The validate operation has a way to specify the profile. The resource has a way to specify the profile (meta.profile). The validator jar doesn't?</p>",
        "id": 183008966,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1575932037
    },
    {
        "content": "<p>because the acute presentation of this problem is for ElementDefinition.type.profile, not ElementDefinition.type.targetProfile</p>",
        "id": 183009529,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575932308
    },
    {
        "content": "<p>Oh, I see.</p>",
        "id": 183010700,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1575933105
    },
    {
        "content": "<p>Grahame : any reason to prefer extensions over rendered detail?  Do we think anyone would compute on these?</p>",
        "id": 183014275,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575936185
    },
    {
        "content": "<p>yes:</p>\n<ul>\n<li>we render the operation outcome</li>\n<li>there are people post-processing the operation outcome</li>\n</ul>",
        "id": 183015075,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575936940
    },
    {
        "content": "<p>Could be in the coded value. My fork if the net client puts in the system value as the profile url that is being processed, and the code as the invariant key (though this is a little more specific of a case, it thought could be relevant thought)</p>",
        "id": 184584945,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1577859240
    },
    {
        "content": "<p>is there a resolution to this problem? I am working on a draft of the IHE MHD profile using the IG publisher, and my examples are getting this warning. Yet my examples do match. in my IG examples I do explicitly include the profile each resource should be valid to, and have confirmed individually that they do. But in the transaction Bundle there is a miss of some kind to find the resource conformant to the overall profile. I don't know that I have the problem from this thread, but I am completely at a loss. Happy to have someone tell me where I messed up<br>\n<a href=\"http://build.fhir.org/ig/IHE/ITI.MHD/branches/master/index.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/IHE/ITI.MHD/branches/master/index.html\">http://build.fhir.org/ig/IHE/ITI.MHD/branches/master/index.html</a></p>",
        "id": 184603013,
        "sender_full_name": "John Moehrke",
        "timestamp": 1577893764
    }
]