[
    {
        "content": "<p>So, when I think about splitting Conformance up into a list of features, this is the kind of issues I think we should look at:</p>\n<ul>\n<li>Instead of a fixed list of features (like we have now), we will need a valueset of pre-coordinated codes that identify a feature</li>\n<li>If a feature is not a simple key/value pair, what do we do?  How to handle features that have multiple aspects? Sub-features?</li>\n</ul>",
        "id": 153826912,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1462982484
    },
    {
        "content": "<p>I think you need to explain this better</p>",
        "id": 153826913,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462982518
    },
    {
        "content": "<p>I have no idea what you mean</p>",
        "id": 153826914,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462982521
    },
    {
        "content": "<p>Apart from this, I like the recent suggestion of defining an operation that the client could execute to ask the server: \"do you support this?\", which means that features should be a declarative statment of capabilities, but can also be used in the context of a client asking support for a feature.</p>",
        "id": 153826917,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1462982579
    },
    {
        "content": "<p>? I don't think it's that complex what I am saying?  Isn't a conformance statement basically a list of  &lt;feature-code, support for feature&gt; pairs?</p>",
        "id": 153826921,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1462982679
    },
    {
        "content": "<p>I think it's a little more than that. It's a structure 6 levels deep...</p>",
        "id": 153826936,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462983436
    },
    {
        "content": "<p>Yes, so one of my bullets was: \"if a feature is not a simple key/value pair...\"</p>",
        "id": 153826943,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1462983645
    },
    {
        "content": "<p>I'll look at Conformance and give it a shot to see what it could look like.</p>",
        "id": 153826944,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1462983664
    },
    {
        "content": "<p>note that you could simplify the model and that would increase the size of the instance</p>",
        "id": 153826945,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462983724
    },
    {
        "content": "<p>unless we'd introduce a Feature resource maybe (I think that was suggested previously)</p>",
        "id": 153826947,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1462983861
    },
    {
        "content": "<p>But then requesting ALL features would result in a Bundle that's certainly bigger than the current Conformance statement</p>",
        "id": 153826949,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1462983894
    },
    {
        "content": "<p>Hence the operation</p>",
        "id": 153826950,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1462983903
    },
    {
        "content": "<p>okay, then, I'll take this seriously. When I connect to a server, there's 3 different questions I want to ask:<br>\n- what version is it running?<br>\n- what resources does it support? <br>\n- for the intersection of the resources I'm interested in and it supports, what operations and search parameters are supported? </p>",
        "id": 153826953,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462987120
    },
    {
        "content": "<p>that suggests that we could split Conformance on resource, and have a ResourceFunction thing for each resource + search parmaters</p>",
        "id": 153826954,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462987175
    },
    {
        "content": "<p>and then 2 operations on conformance: $do-you-dot-this, and $conformance-for?resources=name,name,name....</p>",
        "id": 153826955,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462987205
    },
    {
        "content": "<p>Well, I don't think that fixes that problem that there are ever more things people like to express... as Chris said:</p>\n<blockquote>\n<p>Finally, it would allow definition of custom features (URI identified) without need for conformance extensions.</p>\n</blockquote>\n<p>Of course, there's a tension here that we might well have a list of features that no client understands or know to ask for.</p>",
        "id": 153826960,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1462988345
    },
    {
        "content": "<p>and they sound like extensions</p>",
        "id": 153826961,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462988717
    },
    {
        "content": "<p>I think it helps with the problem by breaking up the resource, and also allowing you to say which resources you are interested in </p>",
        "id": 153826962,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462988752
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I think the list of questions asked also includes some less obvious configuration distinctions (external URLs, @profile slicing) and ALL of this should be queried not just in the general context (pre-authentication) but also in a specific security context (post-authentication).</p>",
        "id": 153826964,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1462989143
    },
    {
        "content": "<p>Might be a bit late for this...but I'd envision a flat list of features:<br>\npatient-read (<a href=\"http://hl7.org/fhir/FeatureDefinition/patient-read\" target=\"_blank\" title=\"http://hl7.org/fhir/FeatureDefinition/patient-read\">http://hl7.org/fhir/FeatureDefinition/patient-read</a>)<br>\npatient-vread (<a href=\"http://hl7.org/fhir/FeatureDefinition/patient-vread\" target=\"_blank\" title=\"http://hl7.org/fhir/FeatureDefinition/patient-vread\">http://hl7.org/fhir/FeatureDefinition/patient-vread</a>)<br>\npatient-update (<a href=\"http://hl7.org/fhir/FeatureDefinition/patient-update\" target=\"_blank\" title=\"http://hl7.org/fhir/FeatureDefinition/patient-update\">http://hl7.org/fhir/FeatureDefinition/patient-update</a>)<br>\nmessage-event-patient-link (<a href=\"http://hl7.org/fhir/FeatureDefinition/message-event-patient-link\" target=\"_blank\" title=\"http://hl7.org/fhir/FeatureDefinition/message-event-patient-link\">http://hl7.org/fhir/FeatureDefinition/message-event-patient-link</a>)<br>\n...<br>\nmaybe grouped with a category or something.<br>\nConformance then just become a list of features supported with the query operation to check for a subset.  Query could be pre or post authentication (general server features, features in my context).</p>",
        "id": 153826973,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1462990153
    },
    {
        "content": "<p>I'd then roll OperationDefintion, the potential MessageEventDefintion, and other feature defs into a FeatureDefinition resource with a canonical URL.  Describe the feature here and link to TestScripts that technically define the feature.</p>",
        "id": 153826974,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1462990246
    },
    {
        "content": "<p>An implemented that wanted to publish a feature then would have a consistent way of doing so and a server would have a consistent way to tell clients if that new feature is supported.</p>",
        "id": 153826975,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1462990301
    },
    {
        "content": "<p>Doesn't make the Conformance smaller...but makes querying it for a set of features simple XPath (<code>//feature[url/@value='http://.../patient-read']/supported</code> or something)</p>",
        "id": 153826976,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1462990403
    },
    {
        "content": "<p>Would also give a nice scope for security</p>",
        "id": 153826977,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1462990512
    },
    {
        "content": "<p>Chris I you are conflating concepts. The security model i a different thing than the object/Resource model. They are related, but different.  What you have described seems very close to the OAuth 'scopes' that are being developed in projects like HEART and SMART. These projects 'have' a security model, so can lockdown this kind of thing. Where as the core FHIR specification can be used in many security models. It is only when you have a deployment project that you have enough Privacy and Security policy defined.</p>",
        "id": 153826986,
        "sender_full_name": "John Moehrke",
        "timestamp": 1462991493
    },
    {
        "content": "<p>Hi John - I hope that's not what I'm doing...that's not my intent.  I'm trying to define features/operations we've defined in FHIR in a abstract and consistent way so that implementations have something to hold on to when they (independently) define security models.</p>",
        "id": 153826997,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1462993083
    },
    {
        "content": "<p>I'm not prescribing *how* the security implementations refer to these things, I'm just giving them a *what* to refer to consistently (I think).</p>",
        "id": 153826998,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1462993130
    },
    {
        "content": "<p>I guess I don't think it's significantly \"conflating\" to say that a client should be able to ask for a list of features after authentication as long as we don't say anything about how they authenticate, how they are authorized, etc.  They just are asking \"now that I'm within my particular context, what things can I still do?\"</p>",
        "id": 153827001,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1462993291
    },
    {
        "content": "<p>then I might have misunderstood... sorry</p>",
        "id": 153827002,
        "sender_full_name": "John Moehrke",
        "timestamp": 1462993384
    },
    {
        "content": "<p>No worries - it's a fair and important question. We don't want to dictate security models, but we also need to foster some kind of consistency for interoperability to work.</p>",
        "id": 153827003,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1462993454
    },
    {
        "content": "<p>Another thought on this - with a feature list you could add this into an IG and fully define compliance for a purpose (if I understand IGs correctly).</p>",
        "id": 153827442,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1463077642
    },
    {
        "content": "<p>I think this is an idea that deserves consideration (maybe some prototyping).</p>",
        "id": 153827444,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1463077776
    },
    {
        "content": "<p>its' still not clear to me what this idea actually looks like </p>",
        "id": 153827447,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463077941
    },
    {
        "content": "<p>Me too! Just saying I'm intrigued.</p>",
        "id": 153827448,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1463077962
    },
    {
        "content": "<p>I'll try and put a straw-man together...</p>",
        "id": 153827451,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1463078125
    },
    {
        "content": "<p>At the last WGM I proposed an IG that brought together the Document Sharing resources (ala MHD), and added to this patient directory, provider directory, consent management, audit logging. Most importantly it was going to define a deployment environment with a specific set of Policies (Privacy Policy, Security Policy, data retention policy, service level policy, etc). The result would have been a deployment IG, that could have driven connectathon tests beyond core FHIR Resouce interop... but it got shot down because HSI can't own anything. I ran out of energy to fight the system...</p>",
        "id": 153827715,
        "sender_full_name": "John Moehrke",
        "timestamp": 1463137694
    }
]