[
    {
        "content": "<p>I have a profile where I've walked int a bunch of datatypes. i want to turn off extensions for them - how do I do that in Forge?</p>",
        "id": 153898711,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501140305
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, you can't... :/ Currently, Forge generates the extension slice entry for you. But the slicing component is not visible in the UI and you cannot customize it. We're aware of the limitation, but haven't given this much priority as users haven't asked for it.</p>",
        "id": 153898715,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501141884
    },
    {
        "content": "<p>.. but... how could they not?</p>",
        "id": 153898716,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501142853
    },
    {
        "content": "<p>;-)</p>",
        "id": 153898717,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501142856
    },
    {
        "content": "<p>I remember Lloyd asking for this about a year ago, always trying to stretch the limits... ;p<br>\nEventually I'd like Forge to support this, but it is currently not high on our TODO list.<br>\nAs always, we may reconsider based on popular demand.</p>",
        "id": 153898718,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501143224
    },
    {
        "content": "<p>I assume you only need acccess to the extension slicing component and cardinality, as the remaining properties are not likely to be constrained? Design-wise, I've been thinking to integrate controls for these key extension properties into the UI of the parent element. So e.g. if you click on Patient.identifier, the element properties window would also provide access to the slicing and cardinality properties of the Patient.identifier.extension child element, e.g. tucked away at the bottom. This way, Forge could support advanced scenario's without cluttering the UI all too much. Do you think that would work?</p>",
        "id": 153898719,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501143749
    },
    {
        "content": "<p>what I want to do is simply say 'no extensions here'</p>",
        "id": 153898720,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501144702
    },
    {
        "content": "<p>it should be routine for everyone for implementation profiles - turning extensions off everywhere unless you specifically use them</p>",
        "id": 153898721,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501144749
    },
    {
        "content": "<p>I think your design proposal is ok</p>",
        "id": 153898722,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501144784
    },
    {
        "content": "<p>Agreed, thank you for the feedback.<br>\nBecause of this limitation in Forge, users can not follow best practices and close extension slices. Do you consider this a big problem for FHIR? If so, maybe we should reconsider priorities.</p>",
        "id": 153898724,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501145885
    },
    {
        "content": "<p>well, I think it's an issue. take, for example, this:</p>",
        "id": 153898728,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501153589
    },
    {
        "content": "<p>hmm. I'll have to do a bit of work before I can post what I wanted to get you to look at ....</p>",
        "id": 153898729,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501153730
    },
    {
        "content": "<p>here: <a href=\"http://build.fhir.org/ig/grahamegrieve/medicalert/StructureDefinition-Member.html#template\" target=\"_blank\" title=\"http://build.fhir.org/ig/grahamegrieve/medicalert/StructureDefinition-Member.html#template\">http://build.fhir.org/ig/grahamegrieve/medicalert/StructureDefinition-Member.html#template</a></p>",
        "id": 153898732,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501154720
    },
    {
        "content": "<p>see all the extension elements all over the place - a big mess....</p>",
        "id": 153898733,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501154736
    },
    {
        "content": "<p>You're generating example resource templates from the profile? I can see the noisy extension elements. And these would disappear if the profile  explicitly closes the extension slice?</p>",
        "id": 153898739,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501155073
    },
    {
        "content": "<p>sets max = 0</p>",
        "id": 153898742,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501155091
    },
    {
        "content": "<p>yes. (actually that wouldn't disappear right now, but I'm working on that)</p>",
        "id": 153898743,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501155107
    },
    {
        "content": "<p>OK get it</p>",
        "id": 153898746,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501155158
    },
    {
        "content": "<p>I'll discuss this with our team. I think this will have to wait until after september WGM, as we're now focusing on some UI improvements.</p>",
        "id": 153898747,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501155235
    },
    {
        "content": "<p>ok thanks</p>",
        "id": 153898748,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501155248
    },
    {
        "content": "<p>I think saying \"no extensions here\" is a poor design choice.  It's much better to just say \"these are the supported extensions\".  But prohibiting extensions you don't support creates unnecessary interoperability barriers.  I agree there will be some cases where this is necessary, but it shouldn't be common - and definitely shouldn't be encouraged</p>",
        "id": 153898814,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501170510
    },
    {
        "content": "<p>That's true for all elements - constraining elements to max=0 should be a last resort</p>",
        "id": 153898815,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501170547
    },
    {
        "content": "<p>if i'm creating a profile that describes what my system gives you to read and I'm not using extensions - which is by for the more common in all circumstance - then that's exactly what the profile should so: you won't find extensions here</p>",
        "id": 153898845,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501187604
    },
    {
        "content": "<p>I think that's a very complicated way of doing it. You'd have to declare non-support for extensions, modifier extensions, id and every other element on Element eveywhere.  Super-verbose and super-annoying.  Much cleaner - and just as expressive - to just have a profile that lists everything you <em>do</em> support and mark those as \"must-support\".  Anything that's not marked as must-support is something you shouldn't expect to receive.</p>",
        "id": 153898940,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501214325
    },
    {
        "content": "<p>it's a question of who it's verbose and annoying for</p>",
        "id": 153898950,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501218412
    },
    {
        "content": "<p>I would expect it would be verbose for both author and consumer.  It would tripple the size of most profiles to do that - exclude every element you don't support and every child element you don't support.  I can't think of anyone it would be easier for unless you wanted a validator to always raise an error if a system omitted something other than what it said it supported.  (You could still raise a warning if elements were present where mustSupport = false)</p>",
        "id": 153898961,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501222644
    },
    {
        "content": "<p>well, we could enhance the validator to make warnings like that.</p>",
        "id": 153898965,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501225517
    },
    {
        "content": "<p>I actually already have :)  They're \"hints\" at the moment.  They trigger if validation is happening against a profile that contains any mustSupport=true elements.</p>",
        "id": 153898985,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501230608
    },
    {
        "content": "<p>I think I understand this stream -  you are discussing is whether every element (including extensions ) should be explicitly defined as either \"in\"  in Lloyds case or \"out\" in Grahame's.    I assume when profiling that If I don't say anything about an element ( i.e.,  - an extension)  it is 'undefined'  and the profile user can choose to use these unspecified elements or not.  So is neither in or out.   Why would you put constraints on things you may not have gathered any requirements about and may never be able to get that information?   Both way seem overly prescriptive and verbose to me.</p>",
        "id": 153899526,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501355571
    },
    {
        "content": "<p>Marking \"mustSupport=true\" on the elements you support isn't terribly verbose.</p>",
        "id": 153899528,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501355774
    },
    {
        "content": "<p>You are right,  I got a little carried away.</p>",
        "id": 153899536,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501358571
    },
    {
        "content": "<p>in my case, I am describing the data produced by a system. There's no uncertainty here; no, maybe it might be useful. I know <em>exactly</em> what is and isn't going to be produced, and I'm communicating that</p>",
        "id": 153899538,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501363302
    },
    {
        "content": "<p>But the same information is conveyed by saying \"this is what I support\" (i.e. mustSupport = true).  Setting cardinality on everything you <em>don't</em> support to 0 is way overkill.  (And hard to do and super-verbose)</p>",
        "id": 153899556,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501385843
    },
    {
        "content": "<p>Late to the party, but thought I'd chime in. We've done the max:0 thing frequently as a matter of contract specificity.  \"We will never send extensions here, and the absence of extensions here should not be interpreted as null or no data\".  This allows us to a) provide guarantees to our clients and b) prevent potential security issues as our system <em>may not</em> send extensions in these areas (they are removed so the resource is conformant).</p>",
        "id": 153903316,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1503441183
    },
    {
        "content": "<p>Quick question. Does anyone have an example of a profile structure definition that has a complex extension with extensions that are constrained to a specific valueset? I'm trying to make the structure def and I'm getting Snapshot for <a href=\"http://...profile\" target=\"_blank\" title=\"http://...profile\">http://...profile</a> does not contain differential element with id: AllergyIntolerance.extension:allergyintolerance-substanceexposurerisk.extension.valueCodeableConcept</p>\n<p>Thanks</p>",
        "id": 153903578,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1503585186
    },
    {
        "content": "<p>Profile: <a href=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-patient.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-patient.html\">http://hl7.org/fhir/us/core/StructureDefinition-us-core-patient.html</a><br>\nExtension: <a href=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-race.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-race.html\">http://hl7.org/fhir/us/core/StructureDefinition-us-core-race.html</a></p>",
        "id": 153903582,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1503586446
    },
    {
        "content": "<p>Thanks Igor, but this isn't what I meant. In this case the extensions on the extensions are required bound to valuesets. I mean the situation where the parent profile is constraining the extension's child extension to a specific valueset. I hope I'm describing this properly.</p>",
        "id": 153903590,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1503587571
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196572\">@Travis Stenerson</span>, I've created an example profile that specifies a custom binding on a child element of a complex extension:<br>\n<a href=\"https://simplifier.net/share/MichelR/1\" target=\"_blank\" title=\"https://simplifier.net/share/MichelR/1\">https://simplifier.net/share/MichelR/1</a></p>",
        "id": 153903670,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1503650901
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  Ah yes this is exactly what I was looking for Michel. Thank you.</p>",
        "id": 153903735,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1503671423
    },
    {
        "content": "<p>No problem. This is quite advanced. Fortunately there's tooling available and you don't have to author such  profiles manually... (btw I created the example in Forge)</p>",
        "id": 153903736,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1503671578
    }
]