[
    {
        "content": "<p>Hi all. My name is Hannes and I'm currently working on a profile for 11073-1010X standard. I want to constraint various resources and I'm asking myself: Do I have to repeat the contact element for every StructureDefinition or can I assign a \"global\" contact for the entire profile? Thank you in advance!</p>",
        "id": 153814917,
        "sender_full_name": "Hannes Ulrich",
        "timestamp": 1457646022
    },
    {
        "content": "<p>what's the contact element specifically? </p>",
        "id": 153814920,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457646684
    },
    {
        "content": "<p>Since the StructureDefinition can contain a contact element with name and publisher and I define various of them: do I  have to repeat myself or is there a way to define the a single contact for all structured definitions in this special profile? </p>",
        "id": 153814922,
        "sender_full_name": "Hannes Ulrich",
        "timestamp": 1457647039
    },
    {
        "content": "<p>you mean, like ValueSet.contact? then no, it's an anonymous type, so there's no way to reuse at that level. Where as Device.Contact you can, because it is a typed element, and you can profile the type and refer to the type</p>",
        "id": 153814924,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457647408
    },
    {
        "content": "<p>One of the enhancements I've requested for Forge is the ability to have a default set of metadata that automatically gets populated unless you choose to override.  (Because I agree that filling it in each time is a pain ...)</p>",
        "id": 153814927,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1457647671
    },
    {
        "content": "<p>ah I see what the question was. Sorry, I answered the wrong one</p>",
        "id": 153814928,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457647705
    },
    {
        "content": "<p>Since the Furore Forge is a tool written for Windows OS and I'm using an UNIX system, I'm interested in the actual plain XML. So I do have to repeat the StructureDefinition.contact.X every time I'm defining one?</p>",
        "id": 153814932,
        "sender_full_name": "Hannes Ulrich",
        "timestamp": 1457648619
    },
    {
        "content": "<p>yes</p>",
        "id": 153814936,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457649371
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 153814945,
        "sender_full_name": "Hannes Ulrich",
        "timestamp": 1457649624
    }
]