[
    {
        "content": "<p>Have you any suggestion about how to indicate for a choice (e.g. Observation.effective[x]) the reason for absence ?</p>",
        "id": 154015046,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1541146067
    },
    {
        "content": "<p>It works for single elements (e.g. effectiveDateTime) but the IG publisher fails when this extension is applied to a choices..</p>",
        "id": 154015047,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1541146295
    },
    {
        "content": "<p>Seems like a tooling limitation. FHIR allows extensions everywhere.</p>",
        "id": 154015088,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1541155499
    },
    {
        "content": "<p>Do you suggest I should move this thread to the IG creation stream ?</p>",
        "id": 154015108,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1541161463
    },
    {
        "content": "<p>You always have to pick a concrete type in order to extend.  You can't extend \"choice\" directly because it doesn't manifest as a type.  So just pick one (typically the simplest one) and extend that with dataAbsentReason.</p>",
        "id": 154015158,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541170143
    },
    {
        "content": "<p>Yes but if I profile the effective[x] by using effectiveDateTime (with the data-absent-reason extension); I'm no more allowed to instantiate this choice with - for example - an effectivePeriod. .. Or I misunderstood your suggestion...</p>",
        "id": 154015183,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1541174695
    },
    {
        "content": "<p>What I'd like to say is I'd expect you valorize the effective element as DateTime or period, but if you have not, please let me know why the value is absent</p>",
        "id": 154015186,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1541174883
    },
    {
        "content": "<p>and it seems that I'm not allowed either to slice the effective[x] and add the extension to each slice... (effective[x] has max=1)</p>",
        "id": 154015190,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1541175108
    },
    {
        "content": "<p>You must pick one of those two.  In one of them, you can also allow for a reason why the data is absent.  You can't indicate data being absent in a type-independent way</p>",
        "id": 154015192,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541176090
    }
]