[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> and I were discussing slicing and the topic of default slices came up.  During profiling, there are times when you'd like to constrain all instances that don't conform to any existing slices.  Generally for me this is when there is no good way to fix the other slices or they are too numerous to enumerate.  Opened <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12198\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12198\">GF#12198</a> on this.  Has anyone else experienced this?</p>",
        "id": 153850891,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1474981695
    },
    {
        "content": "<p>One of the challenges we face is how to present a default slice in a user interface in a comprehensible and intuitive way. In Forge, the default children of a sliced element are hidden and instead the actual slices are presented as child nodes. If we'd want to support the proposed default slicing contstraints, Forge would have to show the (currently hidden) child elements, as well as any actual slices. However this would clutter the UI and probably confuse the end user.  As of yet, I haven't come up with a user friendly and intuitive visualisation. Suggestions are welcome.</p>",
        "id": 153850892,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1474982562
    },
    {
        "content": "<p>I would present it as a sibling to the named slices as (default)</p>",
        "id": 153850893,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1474982913
    },
    {
        "content": "<p>What you're calling \"default children\" isn't actually default but rather the unsliced children, correct?</p>",
        "id": 153850894,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1474982940
    },
    {
        "content": "<p>Yes, I am referring to the ordinary child elements of the unsliced child element, e.g. the child elements of \"Patient.Identifier\". I like you're suggestion of a \"[default]\" slice, that would be clear to the user. I'd have to do some UI work, as the regular children would then be pushed down one level and I'd have to dynamically update all the associated UI and ViewModel bindings. But it's possible.</p>",
        "id": 153850895,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1474983712
    },
    {
        "content": "<p>So there are 2 things here: the (all) element which is not sliced - what we have today.  And a (default) slice for all instances that are not \"in\" the existing slices:</p>\n<div class=\"codehilite\"><pre>Patient\n  identifier (discriminator: system)\n    (all)  &lt;--- We have this today - the unsliced elements\n      system (min:1)\n    (ssn)\n      system (fixed: http://.../ssn)\n    (mrn)\n      system (fixed: http://.../mrn)\n    (default)  &lt;--- This is the new thing, everything that is not an ssn or mrn.\n</pre></div>",
        "id": 153850897,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1474983895
    },
    {
        "content": "<p>Ah, so these default constraints would be separate from/in addition to the regular child elements?</p>",
        "id": 153850899,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1474984186
    },
    {
        "content": "<p>They would apply to everything *not* already constrained by existing slices</p>",
        "id": 153850900,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1474984211
    },
    {
        "content": "<p>So then Forge would have to display virtual child nodes for both \"[all]\" and \"[default]\" slice constraints?</p>",
        "id": 153850901,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1474984280
    },
    {
        "content": "<p>Only if needed...but yes.  Forge already needs the (all)</p>",
        "id": 153850902,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1474984331
    },
    {
        "content": "<p>I'm no UI guy, but I'd probably use some visual aid to distinguish between a parent/child relationship (Patient-&gt;identifier) and an element/slice relationship (identifier-&gt;ssn).  Maybe just a different color/style for the branch lines or something...</p>",
        "id": 153850903,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1474984428
    },
    {
        "content": "<p>Indeed, concrete slices are already indicated by a special icon (currently a sliced pie chart). So this would discern the slices from the virtual \"[all]\" and \"[default]\" nodes.</p>",
        "id": 153850911,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1474986160
    },
    {
        "content": "<p>I could easily bind visibility of the virtual nodes to a global toggle, so the user could selectively show/hide these elements. This would allow for a \"basic\" vs. \"advanced\" view. Just as the user can currently toggle visibility of the inherited common resource elements such as meta.</p>",
        "id": 153850912,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1474986264
    },
    {
        "content": "<p>I'm not sure I understand the use case; you want elements that don't match a slice to be constrained, but differently to the rules that apply to all slices?</p>",
        "id": 153850916,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474988625
    },
    {
        "content": "<p>Yes.  Mostly for labeling/definition reasons, but potentially other constraints as well.</p>",
        "id": 153851436,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1475245510
    },
    {
        "content": "<p>There are many cases where we'd like the set of slices to be complete and need an \"other\" bucket.</p>",
        "id": 153851437,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1475245553
    },
    {
        "content": "<p>I'm not entirely sure that would go with further slicing. It's kind of a lot easier to understand if it's final</p>",
        "id": 153851458,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475260014
    }
]