[
    {
        "content": "<p>We are creating profiles for data to be send to a quality registry. For registries it is common to need data like:<br>\n\"The patient took Picoprep/Citrafleet”. So either X or Y. And the patient has a histrory of either A or B or C.</p>\n<p>Currently the registry entry is filled out with a form by the practitioner, which just defines true/false to these question, but we translate those to the appropriate Medication/Condition/Observation resources. However, as far as I know, there is no way of expressing X or Y in FHIR in for example MedicationStatements is there? So I'm leaning towards creating registry specific codes for there cases, and in the future (when these items can be prepopulated by the EMR) these can be replaced by specific codes for X and Y.<br>\nHowever, this pattern is reoccuring, and it seems a bit of a shame that when we have 2 standardized codes that could be used, we cannot, and have to create and use something totally non-standardized, non-reusable. So I wanted to make sure there isn't any other option to express something like this.</p>\n<p>Any suggestions?</p>",
        "id": 230486527,
        "sender_full_name": "Marten Smits",
        "timestamp": 1615889080
    },
    {
        "content": "<p>It's a tight one. Can't use CodeableConcept for this either as it's just about one concept. At the end of the day your problem boils down to uncertainty about the data, and allergyintolerance solves this <a href=\"https://www.hl7.org/fhir/extension-allergyintolerance-certainty.html\">with an extension</a>.</p>\n<p>I'd go for the following: record both of the drugs (so 2 resources), tie them together with a common identifier, and add a modifier (important) extension for the certainty.</p>\n<p>This'll make it more interoperable than custom codes - you'd be able to search on either drug using the standard interface with standard codes and you'll get a result. If you want to get more semantic information about it, you can, it'll be there thanks to the common identifier and the certain extension.</p>",
        "id": 230493316,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1615892733
    },
    {
        "content": "<p>Thanks for your input Vadim! But I'm afraid this over complicates stuff  as well. Custom extensions and identifiers don't seem more interoperable than custom codes in my opinion. This is rather tricky isn't it?</p>",
        "id": 231007155,
        "sender_full_name": "Marten Smits",
        "timestamp": 1616152420
    },
    {
        "content": "<p>Right. Interoperability is about the same understanding. So, every self defined profile, code or whatever complicates making progress in that regard.</p>",
        "id": 231286206,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1616407685
    },
    {
        "content": "<p>You're unlikely to get full interoperability in this case because a lot of systems won't understand what's going on.  So your objective should be maximum safety - i.e. trigger the right decision support, show up in the right searches.  That means a separate resource for each of the 'or' clauses and flagging each of them as uncertain.  You can use extensions or common business identifiers in an attempt to link the collection as a single 'statement' but lots of systems won't recognize them.  So put in the code.text and ideally the narrative the full or-clause so a human can see it.</p>",
        "id": 231306891,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616418695
    },
    {
        "content": "<p>If we wanted to come up with a better solution for this, what committee might be interested? This has be a very, very common problem in real-world usage of FHIR over the last couple years for me....</p>",
        "id": 239098974,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1621261813
    },
    {
        "content": "<p>which particular problem?</p>",
        "id": 239147988,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1621280471
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Asserting an observation of a list of OR'd conditions, e.g. a Questionnaire response to \"Have you had any of nausea, headache, or sore throat (yes/no)?\"</p>",
        "id": 259883709,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1635783162
    },
    {
        "content": "<p>can you be more specific?</p>",
        "id": 259911678,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635796358
    },
    {
        "content": "<p>Questionnaire makes it easy to say \"Have you had any of nausea, headache or sore throat (yes/no)\" - but how do you express that in Condition if you only have codes for \"nausea\", \"headache\", and \"sore throat\" but not the combination of them.</p>",
        "id": 259914833,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635797786
    },
    {
        "content": "<p>I'm not understanding the question - is it 'how do you say things that your terminology doesn't allow you to say'?</p>",
        "id": 259915300,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635798003
    },
    {
        "content": "<p>I think it's \"Can the data model allow me to say things the terminology doesn't allow me to say.\"</p>",
        "id": 259924654,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635802481
    },
    {
        "content": "<p>umm no? how could it?</p>",
        "id": 260046451,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635881696
    },
    {
        "content": "<p>Well...the terminology has codes for each of the concepts, but there's no conceptual (or syntactic) construct for \"one of\". The model could introduce the construct. With where we are today, I'd suggest a standard extension on Observation with that effect, probably a modifier extension at the root or on Observation.code.</p>",
        "id": 260680785,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1636388627
    },
    {
        "content": "<p>There's always a tension between the expressivity and expressibility of the information and terminology models.  I suggest giving careful consideration to both sides of that before deciding what's the \"right\" way to do this.</p>",
        "id": 260682248,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1636389218
    }
]