[
    {
        "content": "<p>In the spreadsheets for defining resources &amp; profiles, we have the ability to capture developer notes (work group comments).  That information isn't rendered in the publication, but is *extremely* useful to capture to-dos, questions about mappings or requirements, notes about committee discussion that aren't appropriate to surface in rationale, etc.  However, there's no element in the StructureDefinition resource to capture that sort of information - presumably the thought is you'd just embed it in comments or something.  However, it means that when using tools like Forge, there's no means of capturing this essential information.  Should we add the notion of \"developer note\" to ElementDefinition?  Should we add it to other areas in Conformance resources?  Or perhaps define a standardized extension and get Forge to support it?</p>",
        "id": 153828308,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463532307
    },
    {
        "content": "<p>it doesn't appear anywhere in the implementations....</p>",
        "id": 153828316,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463532894
    },
    {
        "content": "<p>I know it doesn't appear in implementations - but it's still useful to capture when authoring artifacts - which means it needs to show up and be persisted in tools like Forge and perhaps your terminology editor</p>",
        "id": 153828339,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463534448
    },
    {
        "content": "<p>sounds like an extension to me </p>",
        "id": 153828350,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463534803
    },
    {
        "content": "<p>I'm ok with it being an extension.  Is it reasonable to get that extension supported in Forge?  And where all would we want it?  Certainly on ElementDefinition.  Would we want it directly on IG or StructureDefinition?  Would it be relevant inside ValueSet and/or CodingSystem anywhere?</p>",
        "id": 153828354,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463534982
    },
    {
        "content": "<p>you can ask</p>",
        "id": 153828372,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463540730
    },
    {
        "content": "<p>I'd define it so it could be anywhere in a conformance resource</p>",
        "id": 153828374,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463540750
    },
    {
        "content": "<p>Do we actually have a way of saying \"anywhere under resource x\"?</p>",
        "id": 153828392,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463543140
    },
    {
        "content": "<p>no</p>",
        "id": 153828396,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463543864
    },
    {
        "content": "<p>FHIR could define an official extension on StructureDefinition, such as these:<br>\n<a href=\"http://hl7.org/implement/standards/fhir/structuredefinition-extensions.html\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/structuredefinition-extensions.html\">http://hl7.org/implement/standards/fhir/structuredefinition-extensions.html</a><br>\nThe extension would be allowed on the root StructureDefinition resource and on ExtensionDefinition components.<br>\nWe could then implement out-of-the-box support for this in Forge and optionally also in <a href=\"http://simplifier.net\" target=\"_blank\" title=\"http://simplifier.net\">simplifier.net</a>.</p>",
        "id": 153828593,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1463660114
    }
]