[
    {
        "content": "<p>The other day I had a discussion with <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> about the handling of the differential in logical models. Currently, Forge only populates the snapshot of a logical model and leaves the differential empty. I thought this was a bug in Forge, as I expected it to be closer aligned to a StructureDefinition of one of the core resources. Meaning that a differential as well as a snapshot is present. Could someone elaborate on the reasons for this implementation choice? I'm curious about it as I can't find an invariant mandating this behaviour as a rule?</p>",
        "id": 171496324,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1563867354
    },
    {
        "content": "<p>Or to ask the other way around: would anyone object to a new behaviour of Forge where Logical Models would also contain a differential? Would that break current tooling? Would the IG publisher be able to handle it?</p>",
        "id": 171582004,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1563949586
    },
    {
        "content": "<p>No objections? We really want to make sure that we don't break any existing stuff. The change would harmonise our current snapshot generation process and also help systems which rely on regenerating snapshots when receiving a StructureDefinition for  Logical Model.</p>",
        "id": 171933135,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1564395199
    },
    {
        "content": "<p>What would the differential be from? Or - what's the source model that is being changed...</p>",
        "id": 173078609,
        "sender_full_name": "David Hay",
        "timestamp": 1565661813
    },
    {
        "content": "<p>source model would be the base definition where the logical model is derived/constrained from</p>",
        "id": 173087600,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1565675469
    },
    {
        "content": "<p>I would prefer to just develop the differential in a logical model and let the publishing stack handle the snapshot generation, this prevents inconsistencies between snapshot and differentials.</p>",
        "id": 173087686,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1565675586
    },
    {
        "content": "<p>the ig publisher handles snapshot generation for specialization in logical models, I have created a pull request to support also constraint snapshot generation see <a href=\"https://github.com/hapifhir/org.hl7.fhir.core/pull/59\" target=\"_blank\" title=\"https://github.com/hapifhir/org.hl7.fhir.core/pull/59\">https://github.com/hapifhir/org.hl7.fhir.core/pull/59</a></p>",
        "id": 173088045,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1565676036
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span> yes, that makes sense. Serializing logical model definitions to the differential component (instead of snapshot) would allow deriving models from Resource, DomainResource or another logical model.</p>",
        "id": 173095955,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1565685524
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ?</p>",
        "id": 173095971,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1565685544
    },
    {
        "content": "<p>I'm still not sure what the \"differential\" is showing a difference compared to... I suppose if there is a baseDefinition, the differential is the difference from baseDefinition. But, if there is no baseDefinition, then it seems like snapshot is appropriate. I'd encourage a constraint indicating \"if no baseDefinition, snapshot SHALL exist and differential SHALL NOT exist. otherwise, differential SHALL exist and snapshot MAY exist.\"</p>",
        "id": 173133242,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1565717233
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span>, all FHIR types are derived from <code>Resource</code> or <code>Element</code>. <code>Element</code> has a recursive definition: <code>Element.extension</code> is of type <code>Extension</code>, which is derived from... <code>Element</code>! This implies that the child element <code>Element.extension</code> (indirectly) inherits constraints from the root of <code>Element</code>. So by expanding the snapshot of <code>Element</code>, the profile actually pulls in constraints from itself. Pretty cool.</p>",
        "id": 173186140,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1565773239
    },
    {
        "content": "<p>right. Logical models are no different from the base types that we define in FHIR itself with a diff on Element or Resource, and then generating the snapshot</p>",
        "id": 173261237,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565837389
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> does this mean that I should update Forge and implement <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span>'s proposed change? i.e. serialize logical models to differential component, instead of the snapshot component.</p>",
        "id": 173528463,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1566206336
    },
    {
        "content": "<p>yes, though you could serialise to both too</p>",
        "id": 173530305,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1566208125
    },
    {
        "content": "<p>Great, thanks! <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span> please take note</p>",
        "id": 173671675,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1566317544
    }
]