[
    {
        "content": "<p>I have been looking at cases where the a server can make stronger claims about the data it makes available than on the data it is willing to accept. Specifically, I am thinking of cases where there are resource elements that (a) the submitting client <em>cannot</em> always fill, but (b) the receiving server <em>can</em> always fill based on internal knowledge or context, if required. The server could thus guarantee that this element will always be present when the resource is retrieved.</p>\n<p>This is of course nicely in line with <a href=\"https://en.wikipedia.org/wiki/Robustness_principle\">Postel's law</a> (lenient with input, strict with output). However, I imagine there would be cases where it would be useful to communicate these differences to the clients, rather than just giving the \"lowest common denominator\" (element not required) as one would do in a profile. For instance, researchers consuming data from a system might rely on the presence of codes from a specific code system that the server adds upon resource creation, if missing (and which submitting clients cannot always supply).</p>\n<p>Are there approaches within FHIR to communicating such input/output differences, other than through written documentation? (e.g. systems that have distinct \"incoming an \"outgoing\" profiles for a given resource type)</p>",
        "id": 207521319,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1597929824
    },
    {
        "content": "<p>US core has done this for content types on documents - systems will accept more formats than they'll return. <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> how was that represented again?</p>",
        "id": 207571959,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597956065
    },
    {
        "content": "<p>I think you are referring to this <a href=\"https://build.fhir.org/ig/HL7/US-Core/clinical-notes-guidance.html#using-expand\">https://build.fhir.org/ig/HL7/US-Core/clinical-notes-guidance.html#using-expand</a></p>",
        "id": 207580367,
        "sender_full_name": "Eric Haas",
        "timestamp": 1597961449
    },
    {
        "content": "<p>yes, thanks. So it's not quite the same, but a similar concept</p>",
        "id": 207580631,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597961622
    },
    {
        "content": "<p>Thanks, I'll have a look at that</p>",
        "id": 207614593,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1598002109
    }
]