[
    {
        "content": "<p>ok, so here's the thing:<br>\nexposition:<br>\nI have a resource ChargeItemDefinition, that defines rules of whether or not a BillingCode is applicable in a specific context. And I have the ChargeItem resource that provides the context for an instance. ChargeItem points to ChargeItemDefinition.<br>\nNow I want to define an operation, that evaluates the rules in ChargeitemDefinition in the context of a ChargeItem instance. </p>\n<p>problem:<br>\nHow do I define a FHIRpath expression in the ChargeItemDefinition resource that is evaluated in the context of the ChargeItem. I feel like I need some sort of placeholder for that, but I can't find any documentation on how to do that...</p>\n<p>...or is that out of scope for FHIRpath and I need to read up on CQL? <span class=\"emoji emoji-1f61d\" title=\"stuck out tongue closed eyes\">:stuck_out_tongue_closed_eyes:</span></p>",
        "id": 153956552,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525708345
    },
    {
        "content": "<p>You would need the concept of having several instances of resources in the evaluation workspace of your evaluator and being able to refer to them from a FHIRPath expression.  I am not aware we have that in FhirPath....</p>",
        "id": 153956561,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1525708786
    },
    {
        "content": "<p>So FHIRPath only works within the scope of one single resource? I didn't realize that...</p>",
        "id": 153956565,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525709026
    },
    {
        "content": "<p>FHIRPath can certain traverse referenced types and profiles</p>",
        "id": 153956569,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525709102
    },
    {
        "content": "<p>Ok, so I guess it's not a big deal to create an expression to say ChargeItem.code=1234 is not allowed, if ChargeItem.subject.gender=male, or something... My problem is, that I need to persist the expression outside the ChargeItem resource...</p>",
        "id": 153956577,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525709325
    },
    {
        "content": "<p>..but then apply it to ChargeItem...</p>",
        "id": 153956579,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525709344
    },
    {
        "content": "<p>Does this dynamicValue thing in the Definition resources help?</p>",
        "id": 153956584,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525709463
    },
    {
        "content": "<p>There's no environment-variable in FHIRpath that could access the parameters of an operation, is there? I mean I could pass the ChargeItem instance id when calling the operation and then maybe do something like param.resolve()</p>",
        "id": 153956591,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525709859
    },
    {
        "content": "<p>Doesn't PlanDefinition have the exact same problem with action.condition.expression and action.dynamicValue.expression...? <br>\nThese expressions wouldn't resolve whithin the context of the PlanDefinition but rather in the context given by the in-parameters of PlanDefinition/$apply, if I read the spec right side up...</p>",
        "id": 153956615,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525711346
    },
    {
        "content": "<p>...or am I overthinking this? I might as well just add some prose to the operation description saying that all expressions in ChargeItemDefinition need to be evaluated in the scope of the ChargeItem resource and leave the rest to business logic of whichever system implements the operation...</p>",
        "id": 153956623,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525712140
    },
    {
        "content": "<p>I'd recommend leaving the implementation to the server.  Different servers might implement differently.  (I'll avoid the temptation to comment on the wisdom of business rules being tied to administrative gender... :&gt;)</p>",
        "id": 153956638,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525714286
    },
    {
        "content": "<p>You say that now, that I found the %context variable ! :-(</p>",
        "id": 153956662,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525718272
    },
    {
        "content": "<p>So I'd define my expressions relative to %context and put some prose into the definition, that %context needs to be replaced by the current ChargeItem instance at runtime and leave the rest to the implementer's invention. Fair?</p>",
        "id": 153956664,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525718384
    },
    {
        "content": "<p>ok, first draft: I have a definition for billing code 30110 in the current ChargeItem resource that may not be billed in combination with the code 13250. So I need to make sure, the code 13250 does not appear in the current ChargeItem's Account. %context is supposed to be replaced with the instance of the current ChargeItem at runtime.</p>\n<div class=\"codehilite\"><pre><span></span>    <span class=\"nt\">&lt;applicability&gt;</span>\n        <span class=\"nt\">&lt;description</span> <span class=\"na\">value=</span><span class=\"s\">&quot;Exclude: 13250&quot;</span><span class=\"nt\">/&gt;</span>\n        <span class=\"nt\">&lt;language</span> <span class=\"na\">value=</span><span class=\"s\">&quot;text/fhirpath&quot;</span><span class=\"nt\">/&gt;</span>\n        <span class=\"nt\">&lt;expression</span> <span class=\"na\">value=</span><span class=\"s\">&quot;ChargeItem.where(code=&#39;http://fhir.de/CodingSystem/kbv/ebm|13250&#39; and account=%context.account).count() = 0&quot;</span><span class=\"nt\">/&gt;</span>\n    <span class=\"nt\">&lt;/applicability&gt;</span>\n</pre></div>\n\n\n<p>My syntax may be way off, but before I refine it: is this generally something you could do using FHIRPath without breaking it?</p>",
        "id": 153956670,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525720597
    },
    {
        "content": "<p>um. I think this topic has ventured too deep into the scope of the fhirpath-stream... I'll ask over there...</p>",
        "id": 153956673,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525720747
    }
]