[
    {
        "content": "<p>The discussion around the variability of implementation guides shows that the kind of support highly varies between different IGs. In order to formalize that, a new optional attribute supportType with coded information (0..*) would be helpful.</p>",
        "id": 188185099,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1581666660
    },
    {
        "content": "<p>I don't understand how this could be standardized with a code.  If you have two different elements that describe different types of decision support systems, they might both describe expectations that the element \"must be considered in decision support logic\" - but the meaning behind that would be different based on the context of each application - so what would having a standard code for the notion of \"must be considered in decision support logic\" wouldn't really be buying you anything - and the fact that a system declared that it considered the element in decision support logic wouldn't necessarily be meaningful.  The only thing you could truly count on is a CapabilityStatement that specifically declared it complied with the CapabilityStatement of a specific IG.</p>\n<p>Even for storing information, it's possible that the storage expectations could differ.  Just because you know how to store an element for lab Observations doesn't necessarily mean you know how to store the same element for psychiatric evaluation Observations - or vice versa.</p>",
        "id": 188214118,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581692971
    },
    {
        "content": "<p>The idea behind is not to predefine the codesystem, that should be left for an IG. So you can define behaviour or expectations as codes, and assign them where appropriate. So it is not hidden in the text anymore.</p>",
        "id": 188224747,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1581699693
    },
    {
        "content": "<p>If it's defined by the IG, then you haven't helped interoperability by making it a code - developers still need to read and implement the definition of the code.  The reality is that there's <em>lots</em> of text that must be read when you implement an IG - not everything can be exposed in a computable artifact.</p>",
        "id": 188225460,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581700202
    },
    {
        "content": "<p>If we're going to define something like this, I'd like the use-case to come from the implementer community defining how they'd use it.</p>",
        "id": 188225528,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581700230
    },
    {
        "content": "<p>this has been suggested before. I'm sympathetic to this notion - that we should create an extension, define the code system, and start populating the code system with known statements about must-support, but leave it extensible. I think that there's a finite number of variations of the theme, maybe 10-20... it seems like something it would be useful for us to define if it's possible</p>",
        "id": 188269405,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1581742650
    },
    {
        "content": "<p>We should consider several _<em>code</em>_ as <span class=\"user-mention\" data-user-id=\"191549\">@Frank Oemig</span> suggested: <strong>support/usage</strong> (Mandatory , Required, Required but may be empty) from an information producer's stand-point, <strong>processing</strong> (Process, Store, Display, etc.) from an information consumer's stand-point (e.g. a health application using a US Core conformant FHIR API). We should also discuss whether \"local extensions\" may be explicitly prohibited. <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=55936723#FHIRUSConformance:SpecificationOutline-SupportandPresenceRules\" target=\"_blank\" title=\"https://confluence.hl7.org/pages/viewpage.action?pageId=55936723#FHIRUSConformance:SpecificationOutline-SupportandPresenceRules\">https://confluence.hl7.org/pages/viewpage.action?pageId=55936723#FHIRUSConformance:SpecificationOutline-SupportandPresenceRules</a></p>",
        "id": 189496975,
        "sender_full_name": "Ioana Singureanu",
        "timestamp": 1583160352
    },
    {
        "content": "<p>Notions of 'mandatory' have nothing to do with mustSupport - that's driven by cardinality which is totally orthogonal to mustSupport.  mustSupport is about \"what are systems expected to be able to do with the data\" - persistence, rendering, inclusion in decision support logic, etc.  However, there are nuances for all of those things.  If you must persist, must you be able to exactly round-trip?  Are you able to modify the data before storage or retrieval?  Are you allowed to reject non must-support data?  Also, there's expected behavior for the sender vs. the consumer.  Once you start putting together all of the combinations and permutations, you're looking at a <em>lot</em> of codes.  Even if you have two identical situations that say something around \"must include in decision support\", the meaning of that will of course vary based on the type of decision support envisioned by the IG.  I'm really not clear on how any system is going to consume that and do anything usefully 'computable' on it.</p>",
        "id": 189504466,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583164650
    },
    {
        "content": "<p>Agreed, there are a lot of different ways someone may support a resource or attribute. Exactly for that purpose it makes sense to summarize it. Unless the support for each attribute is different, but then it ends up in something that is not implementable.<br>\nReengeneering IGs led to the list <span class=\"user-mention\" data-user-id=\"191968\">@Ioana Singureanu</span> talks about, at least in principle. Of course it needs a more thorough analysis, but we are working on it.</p>",
        "id": 189509442,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1583167356
    },
    {
        "content": "<blockquote>\n<p>more thorough analysis</p>\n</blockquote>\n<p>That would be good - have we got a survey of existing FHIR IGs on this subject?</p>",
        "id": 189524816,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583176218
    },
    {
        "content": "<p>Yes, this is the result of a Conformance project. <span class=\"user-mention\" data-user-id=\"191968\">@Ioana Singureanu</span> ?</p>",
        "id": 189573521,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1583225871
    }
]