[
    {
        "content": "<p>we are looking into how to compare if (document) bundles are equivalent, but don't have to be equal:</p>\n<ol>\n<li>different id's within the bundles should not matter, also if referenced via type\\id or uuid should not matter</li>\n<li>different positions of resources within the bundle should be ignored</li>\n<li>narrative text, meta elements, extensions to narrative, comments should be ignored</li>\n</ol>\n<p>is there somebody who has already done work in this area and has some tips? or even java code? has the java validator some code which could help with that <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and <span class=\"user-mention\" data-user-id=\"248736\">@Mark Iantorno</span> ?</p>",
        "id": 264852061,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1639486246
    },
    {
        "content": "<p>Interesting challenge, I'm not sure you can ignore text however, as that's an integral part of a FHIR Document.</p>",
        "id": 264852816,
        "sender_full_name": "René Spronk",
        "timestamp": 1639486596
    },
    {
        "content": "<p>For other bundle types, this boils down to a discussion of equivalence between 2 resources.</p>",
        "id": 264853158,
        "sender_full_name": "René Spronk",
        "timestamp": 1639486757
    },
    {
        "content": "<p>I haven't done anything like that in the java code. It would be useful though - a comparison framework built on base that takes an advisor to check whether to compare elementsm and if so, how to check them (order, id, extensions, everything, treat one as a pattern)</p>",
        "id": 264908795,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639508480
    },
    {
        "content": "<p>interesting thought</p>",
        "id": 264909107,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1639508564
    },
    {
        "content": "<p>very useful, but also highly dependent on the policy definition of what equivalent looks like.  not sure your stated policy would be universal.</p>",
        "id": 264933543,
        "sender_full_name": "John Moehrke",
        "timestamp": 1639519733
    }
]