[
    {
        "content": "<p>This came from IPS. There is a <a href=\"https://github.com/HL7/fhir-ips/blob/master/resources/MedicationStatement-uv-ips.structuredefinition.xml\" target=\"_blank\" title=\"https://github.com/HL7/fhir-ips/blob/master/resources/MedicationStatement-uv-ips.structuredefinition.xml\">profile on MedicationStatement</a> that seeks to extend MedicationStatement.effective[x] (dateTime | Period).</p>\n<p>The extension should apply on both effectiveDateTime and effectivePeriod. Forge 21.0 for R4 (<span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>) will happily allow you to do this by first defining two type slices on effective, one per type, and then slice both slices again for the extension (basically the same thing twice. When you send that through the IG Publisher 0.9.5 (<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>) this is seen as illegal. In any case it is a cumbersome solution and does not scale well as the number of types goes up.</p>\n<p>The other option I could think of is just handcrafting the slicing on MedicationStatement.effective[x].extension directly and define the extension once only. That seemed more appropriate, but is not supported by Forge, which will silently throw away that extension.  IG Publisher will render that as expected</p>\n<p>So question remains: what's the recommended way to define an extension on a polymorphic element?</p>\n<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 165035599,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1557194798
    },
    {
        "content": "<p>we discussed this at the last meeting, and decided on your option 2, and I believe that Rob and I got it working - but I can't speak to when Forge will update for that</p>",
        "id": 165055135,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557220584
    },
    {
        "content": "<p>Right.  We did decide on option 2 and I believe that is working (I can verify).  Hadn't tried it out yet with Forge.</p>",
        "id": 165055266,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1557220706
    },
    {
        "content": "<p>Well that's instant satisfaction :-) Thanks both!</p>",
        "id": 165063056,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1557229079
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span>, let's discuss this during a coffee break.</p>",
        "id": 165071875,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1557236786
    }
]