[
    {
        "content": "<p>I'm seeing a behavior in my profiles where I have extensions defined that does not seem correct to me and I'm hoping someone can help me understand this.<br>\nIf an extension is defined in the context of a resources or profile, there does not seem to be any enforcement to which resources or profile the extension is created for.<br>\nExample. <br>\n    1) I created extension called extA with context for ProcedureRequest.<br>\n    2) Create a profile and extend the base resource to add ExtA and save, and restart the FHIR service.<br>\n    3) Post a ProcedureRequest request including the new extension and the ProcedureRequest resource is created as expected - works fine. <br>\n    4) But I can also post some other resource, example an Organization request including an extension (ExtA), and the organization resource is created with this extension. I think this should error and not create this resource with this extension. <br>\n    5) If I create a resource with an extension not defined at all in my system all, I get an error as expected based on my system configuration. <br>\n        a. \"diagnostics\": \"The extension <a href=\"https://foo/some-extension/undefined\" target=\"_blank\" title=\"https://foo/some-extension/undefined\">https://foo/some-extension/undefined</a> is unknown, and not allowed here\"</p>\n<p>Similarly if I created two profiles on the same resource (ProcedureRequestProfile1 and ProcedureRequestProfile2)<br>\nProcedureRequestProfile1 has the extension defined<br>\nProcedureRequestProfile2 does not have the extension<br>\nI would expect that if I posted a request using the profile ProcedureRequestProfile2 with and extension defined in ProcedureRequestProfile1  to error and not create the resource, but it does create the resource.</p>\n<p>Is there some additional configuration that I'm missing ?</p>",
        "id": 153940616,
        "sender_full_name": "M Crenshaw",
        "timestamp": 1519661777
    },
    {
        "content": "<p>Servers could raise an error for that, but don't have to.  (Servers don't have to validate input at all if they don't want to)</p>",
        "id": 153940618,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519662326
    },
    {
        "content": "<p>See here:<br>\n<a href=\"http://hl7.org/implement/standards/fhir/structuredefinition-definitions.html#StructureDefinition.context\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/structuredefinition-definitions.html#StructureDefinition.context\">http://hl7.org/implement/standards/fhir/structuredefinition-definitions.html#StructureDefinition.context</a><br>\n<a href=\"http://hl7.org/implement/standards/fhir/structuredefinition-definitions.html#StructureDefinition.context\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/structuredefinition-definitions.html#StructureDefinition.context\">http://hl7.org/implement/standards/fhir/structuredefinition-definitions.html#StructureDefinition.context</a></p>",
        "id": 153940619,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1519662333
    }
]