[
    {
        "content": "<p><a href=\"https://www.hl7.org/fhir/stu3/documents.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/stu3/documents.html\">https://www.hl7.org/fhir/stu3/documents.html</a><br>\n\"Any resource referenced directly in the Composition SHALL be included in the bundle when the document is assembled.\"<br>\nDoes this also apply to resource with logical identifiers, or does it only refer to literal references?</p>\n<p>Specifically, if our Composition.subject (Patient) only contains Text and a Patient Identifier (but no Reference), do we still need to include the Patient resource in the bundle? (which is located on another FHIR server)</p>",
        "id": 160108523,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1551888264
    },
    {
        "content": "<p>Ick.  There's no expectation to resolve references that don't have an actual URL reference.   That said, not including the subject of the document in the document is going to break a lot of things - including the formal algorithm for rendering the document.</p>",
        "id": 160109709,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551888994
    },
    {
        "content": "<p>What use is a document that's patient-specific that can't be resolved to the patient?</p>",
        "id": 160109820,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551889049
    },
    {
        "content": "<p>They have enough information (the identifier) to be able to resolve it against a patient on another server, or on their own internal server/database. We could include a near-empty Patient resource with just an identifier, but is that particularly more helpful, other than syntactically helpful in not breaking any rendering tools?</p>",
        "id": 160110254,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1551889273
    },
    {
        "content": "<p>A document is expected to be consumeable \"on its own\".  Not having the subject included means that the subject doesn't need to be known to consume and understand the document - from a computable or human-readable perspective.  There certainly are documents where that would be true (e.g. a document describing a protocol).  But I can't understand how a clinical document could be consumed by itself that wouldn't expose the name, gender, date of birth and other key information about the subject of all of the other information in the document.</p>",
        "id": 160111714,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551890342
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> I think there's a SD aspect to this in regard to documents.</p>",
        "id": 160151910,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551915496
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span> I think this would be a good topic for SDWG to discuss in May during our joint FHIR-I session. But I agree with Lloyd...ick. Personally I think that you should have a Patient resource, but it may only have Patient.text and Patient.identifier in it. But that's my 2 cents, would be good to hear from SDWG on this.</p>",
        "id": 160402152,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1552198607
    },
    {
        "content": "<p>I would expect a set of Profiles that declare various kinds of accessibility and/or quality. Where highly interop clinical documetns would require Patient resource. Sometimes, especially in async pushing (like email) having a Patient reference is likely less useful than including the patient ID and text of patient name.</p>",
        "id": 160518117,
        "sender_full_name": "John Moehrke",
        "timestamp": 1552338556
    }
]