[
    {
        "content": "<p>There are constraints written as FHIRPath expressions that could be written as element constraints.  For example, dom-1 has <code>contained.text.empty()</code> which could be written max:0 on path <code>Resource.contained.text</code></p>",
        "id": 153911263,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1506615278
    },
    {
        "content": "<p>It seems to me that avoiding expressions to the greatest extent possible allows for the most optimization by validators, especially when considering search to find candidates for profile conformance.  How would everyone feel about changing these?</p>",
        "id": 153911264,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1506615369
    },
    {
        "content": "<ul>\n<li>dom-1, dom-2, dom-4</li>\n</ul>",
        "id": 153911265,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1506615581
    },
    {
        "content": "<p>Except that I don't want that dom-1 constraint at all, it prevents containing narrative only resources. (logged the issue)</p>",
        "id": 153911936,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1506988010
    },
    {
        "content": "<p>(but do agree that we should try and simplify as you've suggested)</p>",
        "id": 153911937,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1506988042
    },
    {
        "content": "<p>there's a reason that particular constraint is written by FHIRPath, which is that contained resources do not need to be DomainResources. In general, it is better to use structured constraints in preference to an invariant expression, and I always choose to when I can</p>",
        "id": 153911966,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1506999632
    },
    {
        "content": "<p>dom-4 could be an exception to that, but it already applies over the top of the resource, and it seemed to me that the complication of expressing in a structured form - given that dom-1 to dom-3 couldn't be - wasn't justified. (walking into the contained resource at the level of Resource). How does that help code generators, for instance.</p>",
        "id": 153911967,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1506999729
    }
]