[
    {
        "content": "<p>I'm looking to make the case the FHIR's conformance system/IGs are a good solution for a large enterprise to govern their internal interoperability. I contend that independent business domains within an enterprise need to define models/profiles in a way very similar to how national and sub-national organizations define IGs.</p>\n<p>Has anyone written or seen any writing on this topic?<br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Others!</p>",
        "id": 252695670,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1631221522
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 252695833,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1631221580
    },
    {
        "content": "<p>I have certainly had similar position. And within the VA I am trying hard to push for this, not making much progress at all. However within an organization there are far more needs to include requirements beyond Interoperability.  Even on an API specification there is absolute reason to include capacity, reliability, remediation, etc. These are things that are beyond the scope of an interoperability standards organization like HL7, IHE, DICOM, etc. Thus, my experience is that the API can be defined using an IG, but the change to a new way of documenting an API is a hard thing to overcome. </p>\n<p>That said, when the API is FHIR; the use of an IG does bring with it huge benefits in that one can have proven examples, and one can bring forward off-the-shelf toolkits (hapi), and bring forward testing platforms that can import the specification.  So with FHIR there are some big improvements.</p>\n<p>CDA had some of this, but never as as complete and not readily available.</p>",
        "id": 252778699,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631276961
    },
    {
        "content": "<p>I usually mention IHE as doing more in terms of Enterprise Architecture than just technical profiles</p>",
        "id": 252798942,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631285545
    },
    {
        "content": "<p>IHE (and some other institutions that are copying the good parts) have Data models, and transactions..</p>",
        "id": 252799331,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631285702
    },
    {
        "content": "<p>in terms of Enterprise Governance, you have Enterprise Architecture. You also have Enterprise Data Management. That latter is much much easier to do with FHIR</p>",
        "id": 252800680,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631286240
    },
    {
        "content": "<p>And regions further refine the international specifications to regional specifications. Like more specific vocabulary, security models, privacy models, trust frameworks like a PKI CA, remediation policies... </p>\n<p>further refinement too. So the idea of using an IG to document an API that is used only within an organization is certainly possible. I just have found resistance to writing internal API documentation in a different form than \"this is the way we have always documented APIs\".</p>",
        "id": 252800902,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631286330
    }
]