[
    {
        "content": "<p>One of the outstanding issues for logical models is how to do fixed values for non-FHIR types. The challenge here is that ElementDefinition.fixed[x] (and ElementDefinition.pattern[x] ) are restricted to FHIR types (as they must be), so if you're defined a complex type, you can't define a fixed value for it.</p>\n<p>This is actually a problem for if you want to define a fixed value or a pattern for a BackboneElement on a FHIR resource - so it's not really specific to logical models, it just comes up more often</p>",
        "id": 243837352,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624564167
    },
    {
        "content": "<p>really, the only idea I have is to define a complex extension that can carry a value for a complex type, reusing the extension internally as necessary.</p>",
        "id": 243837465,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624564218
    },
    {
        "content": "<p>seeking thoughts from others about this</p>",
        "id": 243837495,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624564237
    },
    {
        "content": "<p>Timing is a type of BackboneElement. Does it have the same problem?</p>",
        "id": 243861230,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1624578788
    },
    {
        "content": "<p>Another way this problem surfaces is when trying to define R3 model using an R4 structure definition.  Are the types in the [x] the types those from the definining or the defined model? As it is the first, you cannot give example[x] for the R3 types you are defining, since you need to express them in R4. In practice, not a big problem, I admit, but it's still there.</p>",
        "id": 243885683,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1624607740
    },
    {
        "content": "<p>r3 expressing R4 - a bigger problem</p>",
        "id": 243892697,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624612915
    },
    {
        "content": "<p>yes</p>",
        "id": 243906825,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1624623035
    },
    {
        "content": "<p>OK.  I'll bite.  But first I have a few questions.</p>\n<p>As discussed in previous threads, <a href=\"http://hl7.org/fhir/R4/elementdefinition.html#interpretation\">FHIR prohibits fixed[x]/pattern[x] for specializations</a>, so should we assume that this is for R5 and would be accompanied by a change to that table?</p>\n<p>I had previously thought that another reason for <em>not</em> allowing fixed[x]/pattern[x] in specializations is that it would usually be pointless. It doesn't make much sense to define a new element and then fix its value since whatever it represents can just be implicit in the definition of what's being specialized (e.g., if there is no room for variation, why create an element for it?). The only use case where it really adds value is if a <em>parent</em> defines an element but then a child fixes its value.  BUT... that's a contraint, and I've been told previously that specializations <em>cannot</em> constrain elements from their parent.  Which means that the only meaningful use case I can think of is actually invalid. So... am I misunderstanding something here?</p>",
        "id": 243968353,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1624653602
    },
    {
        "content": "<p>possibly you are, because I have no idea why this is relevant. there can be constraints on logical models, and that's what we're taking about</p>",
        "id": 243969708,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624654525
    }
]