[
    {
        "content": "<p>As expected, most workgroups with FHIR resources were talking about FMM levels.  One thing I noticed was how FMM2's requirements were being evaluated.  Many used the 3 main reference implementations (Grahame, HAPI, and Spark) implementing the resource as being adequate to meet the 3 implementer requirement.  From my perspective this was *not* the intent for anything outside the infrastructure/conformance realm - we want implementers kicking the tires with real data, not just supporting the containers.</p>",
        "id": 153827449,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1463078081
    },
    {
        "content": "<p>What did others hear?</p>",
        "id": 153827450,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1463078085
    },
    {
        "content": "<p>well, there's some conformance resources where our implementations are real and solid. But mostly, we don't count.</p>",
        "id": 153827462,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463079015
    },
    {
        "content": "<p>the committees I sat in were not counting those servers for anyhting</p>",
        "id": 153827463,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463079042
    },
    {
        "content": "<p>No, the WGs I was in where really looking for three vendors in their field.</p>",
        "id": 153827613,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1463092625
    },
    {
        "content": "<p>The real test isn't can you receive, store, and return (communication)... but can you rise to the definition of \"Interoperability\" and that means doing something useful with the result. So the test is really can two clients interoperate, not can one client talk to a reference server.  It does though mean we should indicate that FMM1 requires three reference serves have implemented the resource; before we require at FMM2 'interoperability'. (Note different measure with messaging than REST).</p>",
        "id": 153827716,
        "sender_full_name": "John Moehrke",
        "timestamp": 1463137965
    }
]