[
    {
        "content": "<p>Hello, we have created a number of profiles using Forge (and have the snapshot generation turned on) and are working on ensuring it is valid against the STU3 published schema and schematrons.</p>\n<p>However, validating against STU3 structuredefinition.sch results in the error:<br>\n<code>eld-14: Constraints must be unique by key</code><br>\nWhich is located in the structuredefinition.sch's rule context of <code>f:StructureDefinition/f:snapshot/f:element</code></p>\n<p>Looking for instances of <code>/StructureDefinition/snapshot/element/constraint/key/@value</code> returns many instances of keys that are indeed not unique, such as: </p>\n<ul>\n<li>\"dom-1\", \"dom-2\", \"dom-3\" &amp; \"dom-4\" all of which are constraints of <a href=\"https://www.hl7.org/fhir/domainresource.html#invs\" target=\"_blank\" title=\"https://www.hl7.org/fhir/domainresource.html#invs\">DomainResource</a></li>\n<li>\"ele-1\" which is a constraint of <a href=\"https://www.hl7.org/fhir/element.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/element.html\">Element</a></li>\n<li>\"ext-1\" which is a constraint of Extension </li>\n<li>\"per-1\" which is a constraint of <a href=\"http://www.hl7.org/fhir/datatypes-definitions.html#period\" target=\"_blank\" title=\"http://www.hl7.org/fhir/datatypes-definitions.html#period\">Period</a></li>\n</ul>\n<p>So it appears that these low level constraints are 'inherited' from their various predecessor types. However, as each (e.g.) element in the profile snapshot section has the 'ele-1' constraint, the schematron rule enforcing key uniqueness cannot be passed.</p>\n<p>Alternatively, this may be an error in the schematron. Any poking in the right direction would be appreciated.</p>",
        "id": 153892261,
        "sender_full_name": "Rob Eastwood",
        "timestamp": 1496621543
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192270\">@Rob Eastwood</span>, interesting finding. Unfortunately I don't have a quick solution, as I think this needs to be resolved in the FHIR standard first. My reasoning would be:<br>\n- Constraints defined by a certain profile should also apply to derived/referencing profiles.<br>\n- So we want the snapshot to merge all the inherited (externally defined) constraints.<br>\n- Inevitably, snapshots are then expected to contain duplicate instances of the same common constraint(s).<br>\nI think the proper solution would be to update the eld-14 validation rule to only apply to the differential component; i.e. constraints should be unique by key in the differential component of the defining profile.</p>",
        "id": 153892299,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1496671980
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> - that makes sense. <br>\nMay I ask, what would be the proper way to have the eld-14 validation update raised up?</p>",
        "id": 153892330,
        "sender_full_name": "Rob Eastwood",
        "timestamp": 1496703659
    },
    {
        "content": "<p>Keys only have to be unique within the scope of a single element (whether in snapshot or differential), so there should be no need to update the spec.  If there's a single element anywhere in a StructureDefinition with multiple constraints with the same key, that would be a problem.</p>",
        "id": 153892334,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496705942
    },
    {
        "content": "<p>Apologies for the noise <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - please scratch that.<br>\nOn closer examination it turns out that it was a local issue in content that we fed into Forge, which had the constraint key duplication.<br>\nBut also thank you both for your explanations.</p>",
        "id": 153892343,
        "sender_full_name": "Rob Eastwood",
        "timestamp": 1496711785
    }
]