[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> Think I've spotted a bug in Forge - if you create a profile that modifies one of the common elements (e.g. change cardinality of id element), then open in Forge with the \"Expand common elements\" turned off - I get the following error:</p>\n<p>Unexpected ElementDefinition at index 3 with path '&lt;ResourceName&gt;.identifier.use' from basePath = '&lt;ResourceName&gt;'</p>\n<p>Turning \"Expand common elements\" back allows you to open the profile OK.</p>",
        "id": 153820065,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1459958647
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191495\">@Jonny Rylands</span> thank you for the bug report! I will investigate the issue.</p>",
        "id": 153820138,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1460017358
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191495\">@Jonny Rylands</span> I can reproduce and confirm the reported issue.<br>\nBecause the common resource elements may be confusing for some users, I tried to make this behavior configurable. Your bugreport demonstrates that I cut one corner too many. To deal with this, I think that Forge always has to expand the full snapshot, including elements inherited from the abstract (Domain)Resource base class. Then I can re-implement the configuration setting as a visibility toggle that shows/hides the common elements. I'll try this now, stay tuned.</p>",
        "id": 153820154,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1460020397
    },
    {
        "content": "<p>OK thanks.  Or even a message to say that you need to open the profile with the common elements setting enabled?</p>",
        "id": 153820176,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1460023725
    },
    {
        "content": "<p>Nah, I'd rather not bother the user, unless strictly necessary. Looks like I can solve this elegantly via a global visibility toggle. Stay tuned...</p>",
        "id": 153820182,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1460026962
    }
]