[
    {
        "content": "<p>Forge 16.4 for STU3 is now available for download from <a href=\"https://simplifier.net/forge\" target=\"_blank\" title=\"https://simplifier.net/forge\">https://simplifier.net/forge</a>.<br>\nThis new release represents a minor update with a number of FHIR compatibility fixes and some UI improvements.<br>\nUsers of earlier STU3 releases are advised to upgrade to the new version.</p>\n<p>Highlights:</p>\n<ul>\n<li>\n<p>Update the FHIR .NET API library (<a href=\"https://github.com/ewoutkramer/fhir-net-api\" target=\"_blank\" title=\"https://github.com/ewoutkramer/fhir-net-api\">https://github.com/ewoutkramer/fhir-net-api</a>) to 0.93.5-beta2.<br>\n  Includes bug fixes for the snapshot generator and element id generator.</p>\n</li>\n<li>\n<p>Support the ElementDefinition.type.versioning property.<br>\n  This property was introduced by STU3 and is now supported by Forge.</p>\n</li>\n<li>\n<p>Improved support for (complex) element type profiles.<br>\n  Fix invalid validation warnings concerning element type (target) profiles.<br>\n  Forge now re-expands child elements when the type.profile property has changed.<br>\n  Changes in the type.targetProfile property no longer trigger re-expansion.</p>\n</li>\n<li>\n<p>Improved support for choice type elements.<br>\n  Properly rename type choice elements that are a child of a named slice.</p>\n</li>\n<li>\n<p>Support constraints on inherited slice entry.<br>\n  Forge no longer generates (unjustified) validation warnings when a derived profile further constrains the slice entry inherited from a base profile.</p>\n</li>\n<li>\n<p>Named slices do NOT inherit minimum cardinality from base profile.<br>\n  Instead, named slices always have a default minimum cardinality of 0.<br>\n  This ensures that a profile can always introduce one or more optional slicing constraints.</p>\n</li>\n<li>\n<p>Fix invalid change tracking in derived profiles.<br>\n  In some circumstances (specifically when deriving from a sliced profile), the previous release could determine some<br>\n  invalid relationships to elements in the base profile. This would break change tracking; some existing profiling constraints<br>\n  would not be marked with a yellow pen and would be excluded from the serialized output. This has been fixed.</p>\n</li>\n<li>\n<p>Restore editing of ElementDefinition.comment properties.<br>\n  Fix broken edit controls for the .comment property.</p>\n</li>\n<li>\n<p>Serialized output now always includes the StructureDefinition.derivation property.</p>\n</li>\n<li>Structure elements now also provide a context menu, as an alternative for the toolbar.</li>\n<li>Header bar now also displays an image link to <a href=\"http://simplifier.net\" target=\"_blank\" title=\"http://simplifier.net\">http://simplifier.net</a></li>\n<li>Improved memory cache invalidation.<br>\n  When (re-)loading a profile, Forge should now tries to open the most recently saved version.</li>\n</ul>\n<p>Happy profiling!</p>\n<p>Michel Rutten</p>",
        "id": 153899889,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501602781
    }
]