[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> Hi Michel, noticed something in Forge - not sure what is the correct behaviour.  If you extend a 0..*element, then slice the element and add a slice, the extension disappears from the treeview, however is still present in the differential XML.</p>",
        "id": 153846531,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1473158501
    },
    {
        "content": "<p>The extension appears after the setup slice but before the added slice.  I'm assuming this means that the \"default slice\" (i.e. when slice rules are open or openAtEnd) has the extension, but the added slice does not?</p>",
        "id": 153846532,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1473159640
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191495\">@Jonny Rylands</span> When you click the Slice button, Forge hides all existing child elements constraints of the selected element in the UI. However the constraints are still present in the in-memory object graph and will still be serialized to XML. I'd like Forge to also provide access to default constraints of a sliced element, but I'm struggling how to model this in the UI without confusing the user. I have some ideas about it, but currently this is not on our near-term roadmap.</p>",
        "id": 153846533,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1473159805
    },
    {
        "content": "<p>OK thanks.  Possibly add extra slice with a \"(default)\" suffix to the name?  Appreciate it's tricky to make it clear to the user! </p>",
        "id": 153846534,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1473160326
    },
    {
        "content": "<p>Yes, I was thinking along those lines. I've made a ticket in our Jira system, eventually I'll get around to this.</p>",
        "id": 153846543,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1473164762
    },
    {
        "content": "<p>+1 for \"(default)\"</p>",
        "id": 153846572,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473173307
    },
    {
        "content": "<p>Except it's not the default slice, it's things that apply to all slices.  If I slice <a href=\"http://Patient.name\" target=\"_blank\" title=\"http://Patient.name\">Patient.name</a> into \"officialName\" and \"usualName\" and then add (not in either slice) the Patient.name.given element with min=1, then given must always be present regardless of the rules in the slices.  So, maybe (all) rather than (default).</p>",
        "id": 153846824,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1473381442
    },
    {
        "content": "<p>Would be nice though to have a default too...all elements NOT in one of the slices.</p>",
        "id": 153846825,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1473381582
    }
]