[
    {
        "content": "<p>New: Forge Release 14.7 for DSTU2 1.02 - San Antonio 2017 Edition</p>\n<p>A new Forge release is now available for download from <a href=\"http://www.simplifier.net/\" target=\"_blank\" title=\"http://www.simplifier.net/\">http://www.simplifier.net/</a><br>\nRelease 14.7 introduces new advanced profiling features and stability improvements.</p>\n<p>New features:</p>\n<ul>\n<li>Support cardinality constraints on the root element of an Extension definition</li>\n<li>Improved support and compliance for polymorphic choice type elements and type slicing</li>\n<li>Resolve and merge external datatype and extension profiles on load<br>\n  When opening a profile, Forge now tries to resolve all referenced external element type profiles and extension definitions.<br>\n  External references are resolved from the directory that contains the opened profile and from subdirectories below.<br>\n  Resolved structures are (rebased and) merged into the referencing profile, as subtrees of the referencing profile elements.</li>\n</ul>\n<p>This allows you to define inline constraints on child elements defined by external profiles and extensions<br>\n  from within your own profile, in order to override element constraints of the external structures.</p>\n<p>Forge now supports this behavior for:</p>\n<ul>\n<li>elements mapped to a core type</li>\n<li>elements mapped to a custom type profile</li>\n<li>choice type elements constrained to a single (complex) datatype, e.g. value[x] =&gt; valueCodeableConcept</li>\n<li>extension elements (mapped to an extension definition)</li>\n</ul>\n<p>UI improvements:</p>\n<ul>\n<li>\n<p>File Menu - Reload command (Ctrl+L)<br>\n  Reload the selected resource from disk</p>\n</li>\n<li>\n<p>Help Menu - Help command (F1)<br>\n  Improved and updated online documentation at <a href=\"http://docs.simplifier.net/projects/forge-docs/\" target=\"_blank\" title=\"http://docs.simplifier.net/projects/forge-docs/\">http://docs.simplifier.net/projects/forge-docs/</a></p>\n</li>\n<li>\n<p>Context-sensitive Help command (Ctrl+F1)<br>\n  Open documentation of the currently selected profile element on the official HL7 FHIR website</p>\n</li>\n</ul>\n<p>Release 14.7 also fixes a number of issues reported by the community.</p>\n<p>Users of Forge release 14.4(.1) will automatically receive an update notification on application startup.<br>\nUsers of earlier release can download and install the new release manually.</p>\n<p>If you would like to submit a comment, suggestion or bug, we welcome your feedback at <a href=\"mailto:forge@furore.com\" title=\"mailto:forge@furore.com\">forge@furore.com</a>.<br>\nVisit <a href=\"https://simplifier.net/ui/Info/Pricing\" target=\"_blank\" title=\"https://simplifier.net/ui/Info/Pricing\">https://simplifier.net/ui/Info/Pricing</a> for more information about our support plans.</p>\n<p>Best wishes for 2017 and happy profiling!</p>",
        "id": 153866454,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1484226479
    }
]