[
    {
        "content": "<p>I have built a Composition StructureDefinition profile based off of the C-CDA Transfer Summary using Forge. When I run the build with only 3 section slices the build completes successfully. However, when I create all 29 sections, the build fails with  \"Exception in thread \"main\" java.lang.OutOfMemoryError: GC overhead limit exceeded\". Is there a reason the build is only limited to 64m (ANT_OPTS=-Xms64m )?  Is there a way I should look at addressing this other than adjusting the heap size? On a similar note, is there a way to decrease the size of the profile in Forge (I see Forge adds a lot of definition, comments, and requirements by default that I did not add. Is there a way to remove that)?</p>",
        "id": 153817331,
        "sender_full_name": "Corey Spears",
        "timestamp": 1458663009
    },
    {
        "content": "<p>Hi Corey, Forge tries to merge missing values from the underlying base resource. If you clear certain properties, effectively the values will be inherited from the base profile, as defined by the current FHIR standard. FHIR seems to lack a way to explicitly clear certain inherited values in a derived profile (this could be a topic to discuss at the next WGM). Also, Forge tries hard to emit a small differential, but the result might still contain some unnecessary nodes, because of my sloppy coding ;p</p>",
        "id": 153817333,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1458669214
    },
    {
        "content": "<p>Corey, how big is all 29 sections? and which build is failing? the main FHIR build?</p>",
        "id": 153817335,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458673902
    },
    {
        "content": "<p>Grahame, I am trying to build it on my local machine (before checking it in). Each section has 8 differential elements each containing a short, description, comments, min, max, base, type, and mapping. I will try the build again with a smaller version of the profile to see where the issues arise. Is there a quick way to start the build at the profile or better yet, just build my single profile?</p>",
        "id": 153817354,
        "sender_full_name": "Corey Spears",
        "timestamp": 1458682990
    },
    {
        "content": "<p>no there's no quick way. Sorry. It's on the to do list, but it has never quite got to the top</p>",
        "id": 153817359,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458683164
    },
    {
        "content": "<p>but 64? that's just the ant memory. the fhir build uses 1GB+</p>",
        "id": 153817361,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458683188
    }
]