[
    {
        "content": "<p>I believe you should be able to constraint the elements of a setup slice, as per Graeme Grieve:</p>\n<p>\"You can definitely constrain sub-elements of the setup slice. For example, you can say \"the only kinds of telecoms allowed are phone numbers\" and then slice to say that there must be one home number and can be up to two work numbers.\"</p>\n<p>Is there any plan to support this in Forge?</p>",
        "id": 153815005,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457652515
    },
    {
        "content": "<p>Hi Jonny, yes I would like to support this, but it's challenging. I'll quote my response to Lloyd on this topic in the implementers chat today:</p>\n<p>\"In Forge, the element treeview represents slice constraints as child nodes of the sliced element. The original child elements of a sliced element are hidden in the treeview. The UI clearly expresses the relationship between the sliced element and the associated slices, however it also prevents the user from constraining the original child elements.<br>\nIf the spec indeed allows this, then Forge should support it too. However I'm afraid that displaying both the original child elements as well slices will clutter the UI and is likely to confuse the user. Alternatively, displaying slices as following siblings (like they are defined in StructureDefinition) would require quite invasive and time-consuming changes in the application, and frankly that is not a feasible option at the moment. Some kind of toggle button that controls the visibility of the original child nodes might work, but I'm not fully convinced. I'll add an issue to our tracker and ponder on the UI.\"</p>",
        "id": 153815215,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1457710340
    },
    {
        "content": "<p>Michel - yes I appreciate creating an intuitive UI to represent this would be very tricky!  Thanks.</p>",
        "id": 153815392,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457957464
    },
    {
        "content": "<p>Hi Jonny, I'm open to suggestions on how to present this in the Forge UI and welcome your input. So please feel free to share your thoughts.</p>",
        "id": 153815397,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1457958489
    }
]