[
    {
        "content": "<p>Sorry, I'm a bit of a noob with Profiling... But obviously I'm doing something wrong: Why is my Profile expanding all the meta Elements and why does the Extension I added to the bottom of the resource appear at the top?<br>\n<a href=\"https://simplifier.net/FHIRABENDSandbox/KbvBetriebsstaette\" target=\"_blank\" title=\"https://simplifier.net/FHIRABENDSandbox/KbvBetriebsstaette\">https://simplifier.net/FHIRABENDSandbox/KbvBetriebsstaette</a></p>",
        "id": 153844623,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471874511
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> Forge expands the snapshot component when uploading to simplifier. The current version uses built-in custom logic that generates some redundant info. Specifically, Forge expands all elements, regardless of wether the differential actually specifies any related constraints. We have now implemented improved snapshot generation logic in the open source FHIR .NET API. The new logic also provides support for advanced concepts such as name references and derived profiles. The next version of Forge will leverage the FHIR .NET API for snapshot expansion.</p>\n<p>Concerning the order of extension elements, Simplifier displays the elements in the order they are defined; specifically extension elements are displayed before other elements. However Forge explicitly displays extension elements below regular elements. This is a custom visualisation that is specific to Forge. </p>",
        "id": 153844636,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1471878036
    },
    {
        "content": "<p>Oookay! I guess I was just confused because I was comparing my profile to the LabNorway stuff. I guess the latter have somehow been postprocessed or been built with a different Forge version, then.</p>",
        "id": 153844637,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471879194
    },
    {
        "content": "<p>Simplifier is not yet capable of performing a snapshot expansion itself. So the visual rendering depends on existing snapshot component in the uploaded resource. We are planning to integrate the new snapshot generator logic in the FHIR .NET API into simplifier. Then the platform can generate a full and correct expansion itself.</p>",
        "id": 153844638,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1471879831
    },
    {
        "content": "<p>We're working on it! ;p</p>",
        "id": 153844639,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1471879847
    },
    {
        "content": "<p>It's still a bit weird though, that any other Observation-Profile on Simplifier looks far less bloated than mine...</p>",
        "id": 153844782,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471950923
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> If you're interested, I can provide you with the latest (beta) Forge binaries, so you can evaluate the new snapshot expansion logic in the API.</p>",
        "id": 153844794,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1471953924
    },
    {
        "content": "<p>sure! Thanks!</p>",
        "id": 153844805,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471966240
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> I've sent you a pm with a DropBox link to the latest Forge development build.</p>",
        "id": 153844807,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1471967422
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  i think i just run in the same problem as Simone. If i upload an differential profile to simplifier it gets transformed to a snapshot one with expanded meta elements. Could you also send me the Link to the latest beta release of Forge?</p>",
        "id": 153844954,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1472050778
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> the internal beta version is not publicly available. We are planning to publish a new official release in time for the upcoming HL7 WGM in Baltimore. The new release will include the new snapshot generation logic.</p>",
        "id": 153845106,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1472126510
    }
]