[
    {
        "content": "<p>Hi. We are using the .NET FHIR Validator to validate all resources, and have run into a problem with extensions. It seems it is not possible to add multiple extensions for a given resource, but rather create a complex extension that supports multiple extensions in one extension profile. Is this a correct assumption?<br>\nI have trouble creating the \"extended\" extensions using Forge. I've tried creating Extentions containing sub extension elements of a given type, but they dissapear the next time they are opened. I've not found any examples of this online, are there any guidelines on the best way to create and reference them in the output data? I've seen examples using the #-tag:<br>\n  &lt;extension url=\"<a href=\"http://wwww.fhir.orionhealth.com/Profile/nma#original-code\" target=\"_blank\" title=\"http://wwww.fhir.orionhealth.com/Profile/nma#original-code\">wwww.fhir.orionhealth.com/Profile/nma#original-code</a>\"&gt;<br>\nDo these refer to the extension name of the sub-extensions?</p>",
        "id": 153864041,
        "sender_full_name": "Odd A. S. Dahl",
        "timestamp": 1482166406
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192254\">@Odd A. S. Dahl</span> You should be able to create and edit complex extensions in Forge. Seems like you found a bug. I'll investigate and try to reproduce.</p>",
        "id": 153864251,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1482229000
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>. Do you know about any guidelines on best practices for creating these complex extensions (in Forge)?</p>",
        "id": 153864257,
        "sender_full_name": "Odd A. S. Dahl",
        "timestamp": 1482234280
    },
    {
        "content": "<p>@Odd It should be fairly simple to design a complex extension in Forge using the toolbar commands. (unless there's a bug... ) The Add command adds a new complex child element below the active node. Typically you will then constrain the value[x] node to a specific data type. The Extend command allows you to introduce external extensions within another extension. I'll try to fix this issue in the upcoming release. Stay tuned!</p>",
        "id": 153864261,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1482235610
    }
]