[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> as someone who is constantly switching between Forge and Oxygen for precision vs. bulk editing I'd really appreciate a \"Reload from disk/source\" feature. The way that Oxygen implements this, is that it auto-reloads the open file from disk upon return to the application when it doesn't have unsaved changes in Oxygen. If there are unsaved changes in Oxygen it asks you whether or not you want to reload. A true time saver for my type of workflow. If the resource is opened from an external source, then most bets are off for auto reloading, but a manual reload would be be appreciated. Currently I find myself closing and reopening profiles a lot.</p>\n<p>Thanks in advance</p>",
        "id": 153856517,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1478865111
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span>, great suggestion! We are planning a complete rewrite of Forge file management towards a folder/file based approach, similar to popular IDEs. A Reload command is certainly on the planned feature list and eventually I'd also like to hook up OS file change notifications.<br>\nI'm currently finishing a complete rewrite of the internal change tracking logic. The upcoming (beta) Forge release will leverage the new snapshot generator from the .NET FHIR API library to properly expand user profiles. The logic to generate the output differential has also been completely rewritten, as the old approach clearly reached it's limits. The new logic is much more efficient and maintainable. The initial release probably won't be completely flawless, but eventually this will allow us to iron out all the remaining issues involving the diff. Next I'm going to start working on file management.</p>",
        "id": 153856529,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1478874435
    },
    {
        "content": "<p><img alt=\":thumbsup:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/thumbsup.png\" title=\":thumbsup:\"></p>",
        "id": 153856533,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1478875723
    }
]