[
    {
        "content": "<p>Is there a way to convey concepts like \"for the scope of this profile, prescription is defined as ... \"?</p>",
        "id": 153917661,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509808030
    },
    {
        "content": "<p>As separate from the data elements of the resource?  Not at present.</p>",
        "id": 153917664,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1509810457
    },
    {
        "content": "<p>indeed, separate. I am looking for a way to exchange a dictionary of terms. Code list does not meet  the purpose but something similar could work.</p>",
        "id": 153917667,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509818358
    },
    {
        "content": "<p>Hoping to get more input: The problem of exchanging glossaries is not really new, but from my work in Data Governance I realize that good practices exist, but interoperability is hard</p>",
        "id": 153918791,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510300609
    },
    {
        "content": "<p>a way to exchange terms would be great.</p>",
        "id": 153918792,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510300657
    },
    {
        "content": "<p>could we consider another resource for that? in the vocabulary module,i am missing  \"Concept\"/\"Term\" or a \"ConceptList\" / \"TermList\"</p>",
        "id": 153918793,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510300873
    },
    {
        "content": "<p>attributes like (from top of my head): term, definition, acronym, scope, owner, status (approved, proposed, onboarded)</p>",
        "id": 153918794,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510300981
    },
    {
        "content": "<p>use cases for now are simple: someone has defined a term in their scope of work, but before it can be mapped and used in specifications, it needs to be sent to someone else for onboarding and checking duplicates etc.<br>\nor someone submits concepts to another party, to see if they speak the same language in their core concepts</p>",
        "id": 153918800,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510301216
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> what do you think?</p>",
        "id": 153918801,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510301223
    },
    {
        "content": "<p>isn't this a code system?</p>",
        "id": 153918823,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510308269
    },
    {
        "content": "<p>Code systems define symbols (codes) with the intention of allowing those symbols to be shared for computer interoperability.  Glossaries define words that will appear in free text targeted at humans and do not define computable symbols.  They also tend not to define relationships or hierarchies and there's no such thing as a value set based on a glossary that I've ever encountered</p>",
        "id": 153918848,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510316939
    },
    {
        "content": "<p>yes, they are different. Things like \"prescription\", \"patient\", \"disease\", \"condition\", \"long term\"</p>",
        "id": 153918869,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510329160
    },
    {
        "content": "<p>Jose, what's the reason for doing this computably?  Why not just a page of HTML text?</p>",
        "id": 153918872,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510329606
    },
    {
        "content": "<p>system A and system B can have different definitions of these terms, and if they exchange the glossaries, it becomes clear. Every merger, acquisition, new integration can require an alignment of terms.</p>",
        "id": 153918873,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510329782
    },
    {
        "content": "<p>however, that is not the primary case or trigger.</p>",
        "id": 153918874,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510329794
    },
    {
        "content": "<p>the case where I saw this most recently is not at runtime, but at design time: documentation editors should be able to add a term and this triggers the whatever-workflow-to-accept-a-term.</p>",
        "id": 153918875,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510329946
    },
    {
        "content": "<p>The trigger is that i see this need in projects, and I am working on data governance. I realized that FHIR already covers one of the most complex areas (code sets and mappings) but not one of the simplest (exchange of business terms)</p>",
        "id": 153918876,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510329999
    },
    {
        "content": "<p>we're transforming this from an art into a science, and one thing missing out there (for other industries, not only health) is the exchange of business terms.</p>",
        "id": 153918877,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510330061
    },
    {
        "content": "<p>Systems don't have definitions for words - humans do.  Systems don't use words, they use codes</p>",
        "id": 153918882,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510330431
    },
    {
        "content": "<p>What is the use-case for computably exchanging business terms and why is it a \"FHIR\" problem?</p>",
        "id": 153918884,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510330467
    },
    {
        "content": "<p>use cases are design-time. i found one yesterday: in SDOs, people are always defining terms and someone wants to collect those terms, to see which terms are new, which ones have been changed.</p>",
        "id": 153918886,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510330690
    },
    {
        "content": "<p>this is not runtime and is not for systems, so i just wondered if healthcare had a standard for this, I would gladly adopt it as the default standard in my Data Governance things</p>",
        "id": 153918887,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510330743
    },
    {
        "content": "<p>i can use xls or xml, but how fun is that?</p>",
        "id": 153918888,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510330774
    },
    {
        "content": "<p>now seriously, I am looking at mechanisms to align design specificaitons, and one thing that is common is the need to provide glossaries in machine readable formats, to support any workflows - onboarding, maintenance...</p>",
        "id": 153918889,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510330877
    },
    {
        "content": "<p>ISO standards have a chapter for terms, and it is important to build a standard terms list.</p>",
        "id": 153918891,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510330915
    },
    {
        "content": "<p>and there are things like MeSH, INN, lots of terms that do not have a code and we still want to exchange</p>",
        "id": 153918892,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510330960
    },
    {
        "content": "<p>the need to manage glossaries is quite common on data-driven companies, especially those not sitting ona data monolith</p>",
        "id": 153918894,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510331031
    },
    {
        "content": "<p>HL7 contributes to a standard glossary whose name escapes me at the moment - you can chat with the vocab WG</p>",
        "id": 153918899,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510332684
    },
    {
        "content": "<p>Can you expand on  the onboarding/maintenance workflows that would require glossaries in a machine readable format?</p>",
        "id": 153918900,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510332728
    },
    {
        "content": "<p>Jose, are you looking for a way to customize a glossary inside your IG? Or is using a HL7 managed glossary that is well-managed be sufficient given that glossary is easily included in your IG narrative (where markdown has hyper-links to the definitions in the HL7 managed glossary)?</p>",
        "id": 153918902,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510333034
    },
    {
        "content": "<p>This request comes from looking at SKMT being a manual process (hopefully SKMT is the glossary you are referring to, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> )</p>",
        "id": 153918974,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510389594
    },
    {
        "content": "<p>there is more to glossary management, but here is the initial scope I am thinking of:</p>",
        "id": 153918975,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510389924
    },
    {
        "content": "<ul>\n<li>an editor in HL7 defines a concept (e.g. \"Prescription\")</li>\n<li>an editor  in ISO also defines the concept \"prescription\"</li>\n<li>an editor  in NCPDP also defines the concept \"prescription\"</li>\n<li>the workflow can be a simple one as this:<p>1. both concepts have status \"draft\" and get sent to the glossary manager<br>\n 2. Glossary manager sees that the term does not exist and assigns status \"proposed\"<br>\n 3a. if the definitions align, and status is \"proposed\", they get sent back to the SMEs, who must do a review. if they are agreed, they get merged into one term with status \"approved\", and scope =ISO, HL7, NCPDP <br>\n 3b1. if definitions do not match, the groups get the definitions and a note to align the definitions. If they do align on definitions, terms are exchanged back and we go to step 3a.<br>\n 3b2. If NCPDP does not want to align with a broader definition and wants to keep a local definition, they get a local term approved, scope =NCPDP. ISO and HL7 get one common term with one definition.</p>\n</li>\n</ul>\n<p>Thus glossary capture becomes glossary management. <br>\n(this is a part of the scope of what I am working with atm, but would allow us to advance a bit)<br>\nAnd this is not really sensible unless the submission is in a structured format. So, to start doing glossary management, we need some interoperability</p>",
        "id": 153918976,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510390890
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , for IG, this translates in : part of our IG would have some terms, which can be a pointer to an existing term, or a new proposed term</p>",
        "id": 153918977,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510390957
    },
    {
        "content": "<p>That sounds like an interesting process, though not necessarily one that fills me with joy.  In any event, it seems outside the scope of FHIR?</p>",
        "id": 153919030,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510400267
    },
    {
        "content": "<p>It is broader than FHIR is doing, yes.</p>",
        "id": 153919031,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510400321
    },
    {
        "content": "<p>i can simply use a code system and disregard the codes.</p>",
        "id": 153919032,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510400349
    },
    {
        "content": "<p>and add a definition.</p>",
        "id": 153919034,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510400353
    },
    {
        "content": "<p>i agree is not a joyful thing. But copy-pasting terms and managing them manually is messy even for silo companies.</p>",
        "id": 153919035,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510400404
    },
    {
        "content": "<p>this gets fun when we talk Mergers and Acquisitions, making BI systems, for biling and administrative vs clinical...</p>",
        "id": 153919036,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510400435
    },
    {
        "content": "<p>Jose, have you looked at <a href=\"http://www.skmtglossary.org\" target=\"_blank\" title=\"http://www.skmtglossary.org\">http://www.skmtglossary.org</a>? <span class=\"user-mention\" data-user-id=\"192038\">@Heather Grain</span> may  be able to tell you about an existing solution.</p>",
        "id": 153919101,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1510466280
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> yes, this question comes after looking at skmt and our ihe glossary processes and the need for interoperability. ans also from my experience in setting up glossary processes. I spoke with Heather and skmt seems to use manual data entry</p>",
        "id": 153919106,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510477276
    }
]