[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I've been working with IG publisher and the highlighting of the \"must supports\" in the snapsho view t is confusing .  It  gets worse when you have around 50% of the elements as must supports.  IMO is visual noise and should be scrapped.   Any other opinions.</p>",
        "id": 153840106,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469059037
    },
    {
        "content": "<p>I think it's not at all useful for something like DAF where it's not the final word in the implementation</p>",
        "id": 153840107,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469059144
    },
    {
        "content": "<p>I'm not sure why the 50% would make a difference.  Whether what you must support is a large portion of the elements or a small portion, it visually calls out what you need to worry about and what you can reasonably ignore.  Obviously how likely you are to ignore the non-must support content depends on the nature of the specification.  DAF is going to be seen as an implementable specification by some and not by others, so some will want it and others might not.  Can you explain more about how it's confusing?</p>",
        "id": 153840143,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469068035
    },
    {
        "content": "<p>At any thing larger than about 15% of highlight it becomes a random mess. see <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10388\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10388\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10388</a></p>",
        "id": 153840147,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469068543
    },
    {
        "content": "<p>Lloyd won't think that's too messy</p>",
        "id": 153840149,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469069105
    },
    {
        "content": "<p>The random mess is just the reality - must support elements are sprinkled semi-randomly through the snapshot.  The problem is it's hard to see where they are - and it's really quite important to see where they are.  In my profiles, I've got 70-80% highlight sometimes (not a lot needs to be supported).  But it's hugely useful for the implementers because they can clearly see which items they need to care about and which ones they don't.</p>",
        "id": 153840154,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469073760
    },
    {
        "content": "<p>I can see that it would be distracting if you don't care about \"must support\", but not caring about mustSupport should be pretty rare . . .</p>",
        "id": 153840155,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469073794
    },
    {
        "content": "<p>I think that's the core issue - the more the profile reflects actual implementation, the more that statement is true</p>",
        "id": 153840157,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469075726
    },
    {
        "content": "<p>Well, even if a profile is designed to be further constrained, knowing what's called out as \"must support\" vs. not is just as important as what's minOccurs=1 - and we strongly highlight those elements too.  The interpretation may shift from \"I can ignore those elements\" to \"downstream profiles might choose to ignore those elements\", but there's still a clear difference of \"must support this\" and \"don't have to support this\"</p>",
        "id": 153840159,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469075945
    },
    {
        "content": "<p>how do we strongly highlight those? </p>",
        "id": 153840160,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469076107
    },
    {
        "content": "<p>I think its a usability thing.  If its too confusing it won't be read.  I vote for letting  the implementation guide editors decide on how they want too display these things. </p>",
        "id": 153840161,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469076181
    },
    {
        "content": "<p>I thnk it would better to make the flags stand out more. make the S white on red background, say</p>",
        "id": 153840162,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469076192
    },
    {
        "content": "<p>like little chilis in a chinese restaurant  menu <br>\nfor the spicy stuff</p>",
        "id": 153840163,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469076227
    },
    {
        "content": "<p>I vote agaainst letting the IG editors decide these things. Not only to I have support deciding that in the generation, every one has to figure out what they mean in each guide</p>",
        "id": 153840164,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469076258
    },
    {
        "content": "<p>But as an editor you already have a choice of using your own styles if you want anyway. Is this any different?</p>",
        "id": 153840168,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469076618
    },
    {
        "content": "<p>yes. it is. For several reasons, we only support using fhir.css, and not changing the styles that affect the generated code. </p>",
        "id": 153840169,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469076787
    },
    {
        "content": "<p>we do this for both technical/generation/support reasons, as well as consumer consistency about this</p>",
        "id": 153840170,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469076815
    },
    {
        "content": "<p>I expect to bleed on this anyway </p>",
        "id": 153840171,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469076823
    },
    {
        "content": "<p>for editor's own content, they can use whatever style they want </p>",
        "id": 153840172,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469076844
    },
    {
        "content": "<p>the other thing is that I mostly use inline styling - saves me from having to figure out a precoordinated explosion of named styles, or trying to set up generation of styles as well as styled elements</p>",
        "id": 153840173,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469076904
    },
    {
        "content": "<p>OK that is not how I interpreted it from reading the iG publisher guide.  but i wasn't planning to create my own styles.   I agree using the hot chili icons   :-)  for the must supports or at least making the flags more prominent.</p>",
        "id": 153840174,
        "sender_full_name": "Eric Haas",
        "timestamp": 1469077078
    },
    {
        "content": "<p>Having something in that one column isn't enough  The row needs to be highlighted in some way - so when you're reading descriptions you can skip past the ones that don't matter.  Or looking at cardinalities or whatever.</p>",
        "id": 153840213,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469080215
    },
    {
        "content": "<p>The 1..x stuff at least makes the element name bold.  And it doesn't influence whether you want to read the description or not.  MustSupport does.</p>",
        "id": 153840214,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469080264
    },
    {
        "content": "<p>Whatever we do needs to be something that impacts the whole line.  If background higlighting is too much, we could change the text color perhaps.  But it needs to be something so that whichever column I'm scanning, I know what to ignore and what to pay attention to.</p>",
        "id": 153840215,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469080359
    },
    {
        "content": "<p>The 1..x makes the element name bold... no</p>",
        "id": 153840217,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469080789
    },
    {
        "content": "<p>Did it not used to?</p>",
        "id": 153840222,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469082992
    },
    {
        "content": "<p>no. </p>",
        "id": 153840223,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469083012
    },
    {
        "content": "<p>never has</p>",
        "id": 153840224,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469083016
    },
    {
        "content": "<p>I change the current build not to highlight by background color but with Eric's chillies, so we could see what it looks like</p>",
        "id": 153840225,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469083052
    },
    {
        "content": "<p>should be built soon</p>",
        "id": 153840226,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469083062
    },
    {
        "content": "<p>You built DAF?  (Because it won't manifest except in profiles where mustUnderstand gets declared)</p>",
        "id": 153840227,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469083108
    },
    {
        "content": "<p>wrong. Check <a href=\"http://hl7-fhir.github.io/lipidprofile.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/lipidprofile.html\">http://hl7-fhir.github.io/lipidprofile.html</a></p>",
        "id": 153840228,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469083140
    },
    {
        "content": "<p>It doesn't convey the same message.  The chillies approach says \"these rows are important\" but it doesn't say \"these rows are unimportant and can be ignored\" which is what's wanted.  We want to clearly show which rows implementers don't have to worry about and the chillie approach doesn't get us there.</p>",
        "id": 153840273,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469088194
    },
    {
        "content": "<p>Ran this past the customer who'd requested the original change and they're comfortable with the chillies approach, though they'd prefer that the descriptive text of non-must support rows was a different color or something distinct.</p>",
        "id": 153840337,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469125782
    },
    {
        "content": "<p>thanks. </p>",
        "id": 153840339,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469129001
    }
]