[
    {
        "content": "<p>If we have an exampleScenario as part of an IG, and if we want the ExampleScenario to be rendered and added to the IG pages, can we point to the exampleScenario, and use page.kind=resource?</p>",
        "id": 153921786,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1511862083
    },
    {
        "content": "<p>is that the idea?</p>",
        "id": 153921787,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1511862099
    },
    {
        "content": "<p>seems better than what i am doing now, which is a)render the page, b) adding the page manually to the ig.</p>",
        "id": 153921788,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1511862128
    },
    {
        "content": "<p>I am not sure if this is wat you are asking.   but for the ig publisher  you have to manually add pages to the ig.  It won't poopulate them based on what is  in Implementation guide.</p>",
        "id": 153921880,
        "sender_full_name": "Eric Haas",
        "timestamp": 1511888201
    },
    {
        "content": "<p>We'll need to get the IGPublisher to generate appropriate fragments for ExampleScenario instances.  Then we'll need to create templates that put those fragments where they ought to be.</p>",
        "id": 153921883,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1511888306
    },
    {
        "content": "<p>Yep, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> my doubt was if once these fragments/templates are done, we can avoid the manual editing that <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> mentions</p>",
        "id": 153921890,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1511889188
    },
    {
        "content": "<p>I am hoping that  if you add the resource to the implementationGuideInput, then the machine will use that to render the pages as defined, without having to add a page as well.</p>",
        "id": 153921892,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1511890002
    },
    {
        "content": "<p>Well, there is a need to add a page for every resource, but depending on the IG publisher framework, this can happen automagically behind the scenes.</p>",
        "id": 153921901,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1511891754
    }
]