[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> / <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Typically logical model are snapshot only. For the logical models under <a href=\"https://github.com/HL7/fhir-cda/tree/master/resources\" target=\"_blank\" title=\"https://github.com/HL7/fhir-cda/tree/master/resources\">fhir-cda</a> however there is even a derivation relationship, profile-on-profile if you will.</p>\n<p>In V3 that this project is modeling, all datatypes inherit from an abstract datatype ANY. Each datatype then either adds or constrains other attributes/elements. Example:</p>\n<p>CS constrains CV, CV constrains CE, CE constrains CD, CD extends ANY.</p>\n<p>This means (in my mind) that differential matters. Forge currently disregards the differential and leaves it as-is. Should the differential support in logical models not be beefed up?</p>",
        "id": 165801231,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1558006688
    },
    {
        "content": "<p>that's a forge question, I think. the answer for the validator/ig-publisher is 'yes. and I think that's already how it is'</p>",
        "id": 165803102,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558008341
    },
    {
        "content": "<p>Ok so maybe this a Forge thing. I've tested what would happen if I delete the snapshot and let Forge operate solely on the differential. Forge will happily open it. Upon save (with snapshot), the snapshot is created but misses the base properties, and also the differential is gone at that point.</p>",
        "id": 165809863,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1558013672
    },
    {
        "content": "<p>Forge support for Logical Models is based on feedback from the core team.</p>\n<ul>\n<li>When opening a Logical model in Forge, the element definitions  are loaded from the snapshot component, if present, or from the differential component otherwise.</li>\n<li>When saving a logical model, Forge serializes the list of element definitions to the snapshot component. The differential component is always cleared.</li>\n</ul>",
        "id": 166071629,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1558346308
    },
    {
        "content": "<p>I don't think that the second is our advice. At least, I think it's not right</p>",
        "id": 166073791,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558348427
    }
]