[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> / <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> When I save a Logical Model with Forge STU3, it looses all ElementDefinition.base definition. Example <a href=\"https://github.com/HL7/fhir-cda/blob/master/resources/II.xml\" target=\"_blank\" title=\"https://github.com/HL7/fhir-cda/blob/master/resources/II.xml\">datatype II</a>.</p>\n<p>I believe that those paths are important so I can say \"this II.nullFlavor path is actually taken from ANY.nullFlavor\". Grahame could attest to the exact function it has. In any case I'm assuming Forge should not loose that info.</p>",
        "id": 165800899,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1558006333
    },
    {
        "content": "<p>yes it's important</p>",
        "id": 165803168,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558008374
    },
    {
        "content": "<p>it's possible that the IG publisher will rebuild it?</p>",
        "id": 165803171,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558008382
    },
    {
        "content": "<p>Just checked. Yes and No. The resulting output contains the paths, but the qa.html will still complain it had to build them:</p>\n<p>element.base cannot appear if there is no base on the structure definition [snapshot.exists() implies (snapshot.element.base.exists() = baseDefinition.exists())]</p>\n<p>So either the error in qa.html is superfluous because it will add that info anyway, or the StrucDefs really should have had them</p>",
        "id": 165809454,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1558013399
    },
    {
        "content": "<p>hm that's a bug then. I agree that it either does and doesn't complain, or doesn't</p>",
        "id": 165809606,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558013486
    },
    {
        "content": "<p>Looks like you're trying to implement derived logical models, which Forge does not support. You may be able to hack it, but I've never tested this nor spent any time thinking about what this means. This probably explains why <code>ElementDefinition.base</code> component remains empty. Forge assumes that all element definitions in a logical model are derived from <code>Element</code>, repeating this everywhere would be redundant.</p>",
        "id": 166072075,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1558346763
    },
    {
        "content": "<p>That explains that part. For now what I do is check the model using Forge and restore all base elements that Forge removes before committing to Github. I also manually keep diff and snapshot in sync  if I do any reordering in Forge. \"Bit\" of a hassle, but manageable. Forge at least prevents making a number of other common mistakes made easily by hand. To make Forge truly useful here, I think we'll eventually need LoMo-on-LoMo support comparable to Profile-on-Profile</p>",
        "id": 166074070,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1558348684
    }
]