[
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=25031\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=25031\">GF#25031</a> raises the issue of the fact that the methodology... assumes... that the base of everything is Element. Element defines 2 properties: id an extension. What happens if a logical model wants to define id and extension properties?</p>\n<p>This isn't an academic question - the CDA logical model needs to do that for both elements, and right now, the CDA logical model is broken on these elements. In general, we have 3 options I can think of:</p>\n<ul>\n<li>\n<p>introduce some kind of 'override' key word so that we can redefine existing elements. This is a feature of many OO heirarchies, but it works variably well. In the CDA context xml:id (which is <a href=\"http://Element.id\" target=\"_blank\" title=\"http://Element.id\">Element.id</a>) still needs to useable as well as <a href=\"http://InfrastructureRoot.id\" target=\"_blank\" title=\"http://InfrastructureRoot.id\">InfrastructureRoot.id</a> </p>\n</li>\n<li>\n<p>Change (clarify?) the methodology that logical models can inherit from some abstract base of Element that has no properties. Maybe called 'Base' or something. Then CDA can define the elements it needs... which doesn't really actually fix the problem since CDA still has 2 id proprties, an element and attribute</p>\n</li>\n<li>\n<p>rename the .id and .extension elements in the CDA logical model and put some extension on them to say that on the wire they have different names to the logical model</p>\n</li>\n</ul>",
        "id": 178554656,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571505137
    },
    {
        "content": "<p>I'm not sure to what degree I should think about these as tooling issues in the java validator stack vs methodology issues in the specification itself. I kind of feel as though these are generic issues for logical model users, and so likely of interest to the dotnet snapshot generator/validator, not just the java one. </p>\n<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> <span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> (<span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span> <span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span> fyi) + <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 178554736,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571505274
    },
    {
        "content": "<p>btw, the question of extensions in CDA is complicated. CDA allows extensions - any XML in  foreign namespace, though in practice all the extensions I have seen have been RIM content in a different namespace. Because of that, I've said that these can map to Element.extension, though how to make that happen in practice hasn't been investigated. And arbitrary XML of any type won't map to Element.extension except as base64Binary which is less than ideal. </p>\n<p>(I have heard discussion about using FHIR content as extensions in CDA directly, in the FHIR Namespace, but I've never actually seen it)</p>",
        "id": 178554881,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571505578
    },
    {
        "content": "<p>My leaning is to say that logical models should inherit from \"base\" rather than Element.  Whether ids and extensions can exist, where they're allowed can all vary.  Logical models should generally define that.  Though I realize that creates issues for the Re- use of FHIR data types.</p>",
        "id": 178554998,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571505723
    },
    {
        "content": "<p>I agree with Lloyd. #2 seems best to me. I also think it would be the MOST backwards compatible with existing implementations, which is a nice bonus.</p>",
        "id": 178555242,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1571506175
    },
    {
        "content": "<p>#2 alone is not enough to solve the CDA problem....</p>",
        "id": 178563171,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571518786
    },
    {
        "content": "<p>And I don't know whether it's just at tooling issue or a methodology one. I think it's methodology, since we need a formal definition of the base...</p>",
        "id": 178563231,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571518824
    },
    {
        "content": "<p>The fact CDA has an element and an attribute with the same name means that CDA will need to deal with one of their names getting changed in the logical model.  That's just a software reality.  (And something implementers of CDA have been doing behind the scenes for ages)</p>",
        "id": 178571861,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571535855
    },
    {
        "content": "<p>IMHO Bridging the gap to CDA is extremely useful, however let's not throw the baby out with the bathwater and destabilize FHIR infrastructure itself in the process.</p>\n<p>Both the <code>.id</code> and <code>.extension</code> fields are quite fundamental to FHIR and probably hard coded into most, if not all, existing processing logic. Allowing these fields to be redefined/overridden would break all this existing logic and require a considerable amount of additional complexity, further increasing the implementation and maintenance burden.</p>\n<p>The <code>Element.id</code> field was introduced to allow unique element identification in <code>StructureDefinition</code> resources. It seems this is only useful if the element is mandatory. For if consumers can no longer rely on this information, they would need an alternative element indentification scheme, defeating the original purpose of the <code>.id</code> element altogether.</p>\n<p>Only a base class without the <code>.extension</code> child element would seem to be relatively straightforward to support, with minimal impact to consumers.</p>",
        "id": 178593857,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1571578443
    },
    {
        "content": "<p>StructureDefinition wouldn't change<br>\n. We're only talking about logical models.</p>",
        "id": 178595602,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571581942
    },
    {
        "content": "<p>The functional requirements (CDA) concern logical models. Solution #1 and (to a lesser extent) #2 propose changes to the type system, on which all of FHIR is based, with relations to FHIRPath, mapping language etc. Fundamental changes to the type system of a normative spec require a particularly strong motivation - without understating the importance of the actual CDA support use case.</p>\n<p>#1. Introducing \"override\" into the type system would open up a can of worms, especially for system elements one would expect to be non-overrideable. IMHO the complexity doesn't seem warranted to address this specific single use case.</p>\n<p>#2. Introducing another base class level below <code>Element</code> could be considered a natural extension to the type system. However similar to #1, introducing optionality/ambiguity to system elements is quite fundamental. Also, this approach does not allow multiple <code>.id</code> elements to co-exist and does not address the CDA use case - suggesting this is a solution without a problem.</p>",
        "id": 178601505,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1571591599
    },
    {
        "content": "<p>firstly, I do not think that CDA is the only example. Else I wouldn't propose doing something about it. </p>\n<p>#1 yes this is a pernicious change. I only proposed it because it appears in most OO formalisms. We're certainly not going to use it in FHIR Definitions</p>\n<p>#2 Introducing a base class below Element would make no difference to anything that exists since everything that exists explicitly inherits from Element and outside of Logical models there would be no reason to change that </p>\n<p>I think it needs a combination of #2 and #3 to fully solve the CDA use case</p>",
        "id": 178602135,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571592542
    },
    {
        "content": "<p>I think I'd prefer #3 as the proper way of addressing this. This would effectively encapsulate the additional complexity within (de)serializer logic. The extensions that capture the actual on-the-wire names would neatly map to serialization attributes in source code. No changes to the current type system are required. Can be implemented on demand, e.g. via custom serializer classes. Would also provides an escape for any other element naming conflicts that might arise in some future use case.</p>",
        "id": 178602152,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1571592592
    },
    {
        "content": "<p>the tricky bit for me there is that in CDA, InfrastructureRoot.id_ and II.extension_ have the wrong names. You use the right names on the wire... sure. but everywhere else, in profiles, when rendering the logical model.... you use the wrong name....</p>",
        "id": 178602221,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571592676
    },
    {
        "content": "<p>where as with #2 and #3 the Any properties can by .xmlId and .extensions leaving the very important properties .id and .extension with the right name.</p>",
        "id": 178602268,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571592729
    },
    {
        "content": "<p>with regard to #2, the right question is:</p>\n<p>\"what is the impact on Logical models of having extensions anywhere\"</p>",
        "id": 178602273,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571592752
    },
    {
        "content": "<p>I actually expected that to come up as the subject first</p>",
        "id": 178602275,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571592763
    },
    {
        "content": "<p>You mean allowing logical models to introduce extension elements?</p>",
        "id": 178602333,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1571592877
    },
    {
        "content": "<p>BTW The CDA use case involves using <code>StructureDefinition</code> to capture a (non-FHIR) wire format. Calling this a logical model seems inappropriate and a bit confusing, as you cannot create a (FHIR) instance from a logical model, i.e. unsuitable for (FHIR) data exchange. If we decide to introduce support for this type of application, maybe we should also introduce a separate <a href=\"http://hl7.org/fhir/valueset-structure-definition-kind.html\" target=\"_blank\" title=\"http://hl7.org/fhir/valueset-structure-definition-kind.html\">StructureDefinitionKind</a>?</p>",
        "id": 178603212,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1571594087
    },
    {
        "content": "<p>My base concern is that 'id' and 'extension' have no place in a v2 model (and lots of other models).  The only reason they're there is because of FHIR baggage.  And it sucks when designers can't do what they want with their logical models because of unnecessary inherited baggage.</p>",
        "id": 178606250,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571599280
    },
    {
        "content": "<p>Indeed, the unfortunate naming conflict introduces pain for v2 designers. I wouldn't consider the default <code>.id</code> and <code>.extension</code> elements unnecessary, as they have an important function in FHIR itself and introducing optionality for system elements comes with a price.<br>\nI'd like to keep in mind that the main responsibility of the type system is to make FHIR itself work. Support for logical models could be added naturally and without breaking things. But in this case, we're talking about a potential new application that appears to be \"close enough\" to fit <code>StructureDefinition</code>, if we just fumble the type system a little bit. I'm worried that this could be overreaching - and set an unfortunate precedent for a normative standard.</p>",
        "id": 178615585,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1571614947
    },
    {
        "content": "<p>I'm not entirely sure I follow the concern. We wouldn't be changing anything for FHIR, since everything would still inherit from Element or Resource</p>",
        "id": 178619370,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571621933
    },
    {
        "content": "<p>we'd be explicitly defining an abstract ancestor for both (which all the reference implementations have, I think)</p>",
        "id": 178619379,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571621968
    },
    {
        "content": "<p>Logical models were introduced as a sort of after thought, but they've proven quite useful.  They shouldn't have to inherit stuff they don't need just because the tooling chain originally evolved that way.</p>",
        "id": 178619956,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571623007
    },
    {
        "content": "<p>My concerns are about introducing optionality for omnipresent system elements that processing logic can safely rely on - for now. Sure, we can introduce another \"bare\" base class. This implies that consumers that rely on standardized FHIR element id's will not be able to process CDA models. If logic can no longer rely on <code>.id</code>, then we can just as well deprecate the element altogether. And allowing system elements such as <code>.id</code> and <code>.extension</code> to be redefined will be a cause for confusion, e.g. when models get mixed up. Theoretically, yes we can make this work. I'm more worried about practical implications.</p>",
        "id": 178636291,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1571647546
    },
    {
        "content": "<p>I cannot find where Logical model is even formally defined in the spec, so imho it does not justify changes at a crucially core level like this.<br>\nI'm wondering whether instead LogicalModel should be defined explicitly as an ancestor to StructureDefinition.</p>",
        "id": 178693779,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1571688896
    },
    {
        "content": "<p>I don't understand how this is relevant. Making logical model and ancestor to StructureDefinition is irrelevant to this change.</p>",
        "id": 178694093,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571689088
    },
    {
        "content": "<p>and I don't understand why this is 'crucially core' - we wouldn't actually be changing anything that matters to anything anywhere that already exists</p>",
        "id": 178694113,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571689114
    },
    {
        "content": "<blockquote>\n<p>This implies that consumers that rely on standardized FHIR element id's will not be able to process CDA models</p>\n</blockquote>\n<p>Are there such a thing? But yes, proposal #2 implies that the element model will need to change such that it doesn't hard code an id, that's true. Does the dotnet element model actually do anything with the id element?</p>",
        "id": 178694701,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571689424
    },
    {
        "content": "<p>the java ElementModel class doesn't even have id as an explicit field; it comes out of the definitions and is transparent</p>",
        "id": 178694860,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571689525
    },
    {
        "content": "<p>No, as far as I can see the .NET API is not dependent upon the value of <a href=\"http://Element.id\" target=\"_blank\" title=\"http://Element.id\">Element.id</a>.<br>\nThe SnapshotGenerator can be instructed to make sure they are filled, and users may rely on that.<br>\nBut for details on that I still refer back to <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> .</p>",
        "id": 178696037,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1571690279
    },
    {
        "content": "<p>so there seems to be some kind of confusion here. There's no proposed change to the snapshot generator; the <a href=\"http://ElementDefinition.id\" target=\"_blank\" title=\"http://ElementDefinition.id\">ElementDefinition.id</a> property will still exist, and still be populated as specified.</p>",
        "id": 178696187,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571690366
    },
    {
        "content": "<p>.id will still exist in all existing FHIR content - no change.</p>",
        "id": 178696212,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571690386
    },
    {
        "content": "<p>Just that a logical model can declare that it is based on a type that doesn't have .id and .element in the content of the logical model</p>",
        "id": 178696335,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571690474
    },
    {
        "content": "<p>I think I need a more concrete example of how that would look in a real StructureDefinition to see the difference it would make. And a more sound definition of what a Logical Model actually is.</p>",
        "id": 178696923,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1571690808
    },
    {
        "content": "<p>BTW: The .NET API indeed has a 'Base' class that is the base for everything, even for Element.</p>",
        "id": 178696932,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1571690816
    },
    {
        "content": "<p>I think of \"Logical Model\" as \"non-FHIR data model\"</p>",
        "id": 178696958,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571690834
    },
    {
        "content": "<p>(Though some logical models might still use FHIR types)</p>",
        "id": 178696976,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571690848
    },
    {
        "content": "<p>But still expressed <em>in</em> FHIR StructureDef, isn't it?</p>",
        "id": 178696980,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1571690857
    },
    {
        "content": "<p>yes. So here is what it would look like. the current definition of CDA Any is:</p>\n<div class=\"codehilite\"><pre><span></span><span class=\"nt\">&lt;StructureDefinition</span> <span class=\"na\">xmlns=</span><span class=\"s\">&quot;http://hl7.org/fhir&quot;</span><span class=\"nt\">&gt;</span>\n  <span class=\"nt\">&lt;id</span> <span class=\"na\">value=</span><span class=\"s\">&quot;ANY&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;url</span> <span class=\"na\">value=</span><span class=\"s\">&quot;http://hl7.org/fhir/cda/StructureDefinition/ANY&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;version</span> <span class=\"na\">value=</span><span class=\"s\">&quot;0.0.1&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;name</span> <span class=\"na\">value=</span><span class=\"s\">&quot;ANY&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;title</span> <span class=\"na\">value=</span><span class=\"s\">&quot;ANY: DataValue (V3 Data Type)&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;status</span> <span class=\"na\">value=</span><span class=\"s\">&quot;active&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;experimental</span> <span class=\"na\">value=</span><span class=\"s\">&quot;false&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;date</span> <span class=\"na\">value=</span><span class=\"s\">&quot;2019-10-21T18:39:49+00:00&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;publisher</span> <span class=\"na\">value=</span><span class=\"s\">&quot;HL7&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;kind</span> <span class=\"na\">value=</span><span class=\"s\">&quot;logical&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;abstract</span> <span class=\"na\">value=</span><span class=\"s\">&quot;true&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;type</span> <span class=\"na\">value=</span><span class=\"s\">&quot;ANY&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;baseDefinition</span> <span class=\"na\">value=</span><span class=\"s\">&quot;http://hl7.org/fhir/StructureDefinition/Element&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;derivation</span> <span class=\"na\">value=</span><span class=\"s\">&quot;specialization&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;snapshot&gt;</span>\n</pre></div>",
        "id": 178697793,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571691333
    },
    {
        "content": "<p>This would change to:</p>",
        "id": 178697799,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571691338
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><span class=\"nt\">&lt;StructureDefinition</span> <span class=\"na\">xmlns=</span><span class=\"s\">&quot;http://hl7.org/fhir&quot;</span><span class=\"nt\">&gt;</span>\n  <span class=\"nt\">&lt;id</span> <span class=\"na\">value=</span><span class=\"s\">&quot;ANY&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;url</span> <span class=\"na\">value=</span><span class=\"s\">&quot;http://hl7.org/fhir/cda/StructureDefinition/ANY&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;version</span> <span class=\"na\">value=</span><span class=\"s\">&quot;0.0.1&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;name</span> <span class=\"na\">value=</span><span class=\"s\">&quot;ANY&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;title</span> <span class=\"na\">value=</span><span class=\"s\">&quot;ANY: DataValue (V3 Data Type)&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;status</span> <span class=\"na\">value=</span><span class=\"s\">&quot;active&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;experimental</span> <span class=\"na\">value=</span><span class=\"s\">&quot;false&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;date</span> <span class=\"na\">value=</span><span class=\"s\">&quot;2019-10-21T18:39:49+00:00&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;publisher</span> <span class=\"na\">value=</span><span class=\"s\">&quot;HL7&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;kind</span> <span class=\"na\">value=</span><span class=\"s\">&quot;logical&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;abstract</span> <span class=\"na\">value=</span><span class=\"s\">&quot;true&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;type</span> <span class=\"na\">value=</span><span class=\"s\">&quot;ANY&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;baseDefinition</span> <span class=\"na\">value=</span><span class=\"s\">&quot;http://hl7.org/fhir/StructureDefinition/Base&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;derivation</span> <span class=\"na\">value=</span><span class=\"s\">&quot;specialization&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;snapshot&gt;</span>\n</pre></div>",
        "id": 178697829,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571691356
    },
    {
        "content": "<p>so the only thing that changes is the stated baseDefinition.</p>",
        "id": 178697887,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571691366
    },
    {
        "content": "<p>then, this would mean that in the CDA model had not declared that it has .id and .extension</p>",
        "id": 178697903,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571691380
    },
    {
        "content": "<p>Thank you for writing out the example. For consistency I would then expect this to imply that the StructureDef for Element also gets <code>&lt;baseDefintion value =\"http://hl7.org/fhir/StructureDefinition/Base\"&gt;</code>. <br>\nAnd I assume there would be a rule that says you can only use types based on Base in a StructureDef of kind 'logical'?</p>",
        "id": 178699121,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1571692150
    },
    {
        "content": "<blockquote>\n<p>For consistency I would then expect this to imply that the StructureDef for Element also gets &lt;baseDefintion value =\"<a href=\"http://hl7.org/fhir/StructureDefinition/Base\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/Base\">http://hl7.org/fhir/StructureDefinition/Base</a>\"&gt;. </p>\n</blockquote>\n<p>yes</p>\n<blockquote>\n<p>And I assume there would be a rule that says you can only use types based on Base in a StructureDef of kind 'logical'?</p>\n</blockquote>\n<p>well, no, since Element is based on base. And would need no rule to say that we couldn't when we wouldn't? Not sure about that... but there is no intent to do anything different</p>",
        "id": 178699423,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571692369
    },
    {
        "content": "<p>Resource would also baseDefinition = \"<a href=\"http://hl7.org/fhir/StructureDefinition/Base\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/Base\">http://hl7.org/fhir/StructureDefinition/Base</a>\"&gt;</p>",
        "id": 178699452,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571692402
    },
    {
        "content": "<blockquote>\n<p>Resource would also baseDefinition = \"<a href=\"http://hl7.org/fhir/StructureDefinition/Base\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/Base\">http://hl7.org/fhir/StructureDefinition/Base</a>\"&gt;</p>\n</blockquote>\n<p>Having a common base for Element and Resource is definitely a change that makes things more consistent. But that is a substantial change to normative content isn't it?</p>",
        "id": 178699617,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1571692521
    },
    {
        "content": "<p>yes, but not a breaking change. So this is an R5 discussion.</p>",
        "id": 178699796,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571692675
    },
    {
        "content": "<p>OK. Then back to CDA - Trying to understand this from a FHIR perspective as I'm not familiar with CDA itself.<br>\nIt's not that they don't want .id and .extension. They want it but with a different meaning.<br>\nWhereas much effort has gone into harmonizing naming and meaning throughout definitions (through the use of patterns for example), we would explicitly allow modellers to deviate from this.<br>\n(PS: Continuing tomorrow - getting late here..)</p>",
        "id": 178700046,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1571692895
    },
    {
        "content": "<p>CDA already has elements .id and .extension in inherited classes.</p>",
        "id": 178700114,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571692932
    },
    {
        "content": "<p>CDA does want .xmlId (say) to do what .id does. And .something that's equivalent to .extension</p>",
        "id": 178700161,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571692977
    },
    {
        "content": "<p>yes, this is deviation in meaning, but because it has already happened, in this case</p>",
        "id": 178700187,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571693005
    },
    {
        "content": "<p>As for .id: it already has different meanings in <a href=\"http://Element.id\" target=\"_blank\" title=\"http://Element.id\">Element.id</a> and <a href=\"http://Resource.id\" target=\"_blank\" title=\"http://Resource.id\">Resource.id</a>. You might conclude that a third would not hurt <em>or</em> that we should not confuse things any further and hence not introduce a third.<br>\nAs for .extension: If we allow overloadiong the term 'extension' I don't see how we ever get this explained to people getting into FHIR.</p>\n<p>Maybe the question is also from what perspective this is meant to be understood:</p>\n<ol>\n<li>\n<p>Being able to handle CDA documents as FHIR resources - then the definition of CDA in FHIR should adapt to what's already in FHIR to make it fit in the mental model of people working with FHIR. <br>\nOr:</p>\n</li>\n<li>\n<p>Just using the FHIR StructureDef (with kind = logical) as a vehicle to formally describe CDA - then it should resemble CDA as much as possible to make it fit the mental model of people working with CDA.</p>\n</li>\n</ol>\n<p>And from a programmers mind I would say: adapt that what you want to express (CDA) to the language at hand (FHIR) and not the other way round. By comparison: If I want to model education in C# I may have to model the concept of 'class' but I simply can't call a variable or property 'class'. So I find another term.</p>",
        "id": 178730162,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1571729626
    },
    {
        "content": "<p>you are speaking in defense of my option #3.</p>",
        "id": 178730266,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571729715
    },
    {
        "content": "<p>Indeed</p>",
        "id": 178730274,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1571729736
    },
    {
        "content": "<p>And trying to get the arguments for / against it clearer since I'm no CDA or FHIR modelling pro.</p>",
        "id": 178730336,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1571729795
    },
    {
        "content": "<p>the problem is that this requires everything to use the wrong element names in CDA. And any other content models where .id is used. Which doesn't seem unlikely to me</p>",
        "id": 178730648,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571730161
    },
    {
        "content": "<p>but the more general problem is: .id and .extension are clearly FHIR specific concepts, where a StructureDefinition is not necessarily describing something that is. So it's a simple proposal: Define a Base type that both Element and Resource specialise. What I haven't figured out is why you and Michel are so freaked out by that</p>",
        "id": 178730732,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571730248
    },
    {
        "content": "<p>with the belief that it somehow alters the fabric of StructureDefinition itself</p>",
        "id": 178730742,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571730269
    },
    {
        "content": "<p>I'm not freaking out:<br>\n- I even like the harmonization that a common Base would bring.<br>\n- Technically it is not a huge problem - at least not for the .NET FHIR API (can't speak for other implementers).</p>\n<p>I guess you touch upon the problem with: \"but the more general problem is: .id and .extension are clearly FHIR specific concepts, where a StructureDefinition is not necessarily describing something that is.\": The discrepancy between using something that is clearly FHIR (StructureDefinition) to describe something that is outside of the FHIR realm. That is what is covered by Logical Models, but lacking a formal definition of Logical Model I foresee trouble for people less involved in this understanding this in the long run.</p>\n<p>One other thing that I don't understand fully: If you want to construct a structure with elements derived from Base, you need to change ElementDefinition.type to Base instead of Element, not?</p>",
        "id": 178731727,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1571731283
    },
    {
        "content": "<p>It should bei possible to derive structure definitions from an appropriate base...</p>",
        "id": 178863396,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1571843454
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span> for thinking along. No worries <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, I am not <em>freaking out</em> - that involves a different kind of tone and language <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span> . As Christiaan mentions it appears feasible to implement #2/#3 in the .NET API. I'm just trying to get a clear picture of the potential impact and considering if we are making a proper trade off.</p>\n<p><span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span> made another interesting observation: the mapping engine is also driven by <code>StructureDefinition</code> resources describing a (non-FHIR) input format. So providing a generic solution for dealing with or avoiding element naming conflicts will be helpful in a broader scope than just CDA. Certainly a compelling motivation to address the issue at hand.</p>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> it appears to me that the StructureDefinitions we are talking about are not exactly \"logical models\", but definitions of non-FHIR serialization formats that allow instantiation. It seems useful to introduce a new <code>StructureDefinition.kind</code> value to identify this class of structures with special rules, e.g. allow different element base. What do you think?</p>",
        "id": 178934391,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1571908926
    },
    {
        "content": "<p>with regard to the definition of logical model.. maybe. We went back and forth on this during R4 balloting.</p>",
        "id": 178935850,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571910333
    },
    {
        "content": "<p>What would the StructureDefinition of Base look like?<br>\nI assume Base should not have any elements, so it can indeed be the base of everything.<br>\nBut a StructureDefinition must have either a differential or a snapshot (or both), and both must have at least one element.</p>",
        "id": 180210289,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1573200847
    },
    {
        "content": "<p>I tried a Base StructureDefintion with just the 'Base' element itself in the snapshot and differential. See <a href=\"https://github.com/ahdis/cda-core-2.0/blob/develop/resources/Base.xml\" target=\"_blank\" title=\"https://github.com/ahdis/cda-core-2.0/blob/develop/resources/Base.xml\">https://github.com/ahdis/cda-core-2.0/blob/develop/resources/Base.xml</a></p>",
        "id": 180239748,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1573226852
    },
    {
        "content": "<p>The <a href=\"https://www.hl7.org/fhir/definition.xml.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/definition.xml.html\">Defintion Pattern</a> which is defined as a Logical Model has no baseDefinition to Element and provides only a snapshot (no differential) with no id/extension in the pattern.</p>",
        "id": 180316023,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1573310785
    },
    {
        "content": "<p>can you make a task to fix this in R5 please</p>",
        "id": 180329838,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573331267
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=25199\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=25199\">GF#25199</a>: <strong>Workflow Patterns have no baseDefinition</strong></p>",
        "id": 180406029,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1573461197
    },
    {
        "content": "<p>Resurrecting this conversation w/ a couple of notes and questions, since I don't see resolution in this thread.  This is relevant to the FSH team as we implement support for logical models.</p>\n<ol>\n<li>Given that <a href=\"http://build.fhir.org/types.html#Base\">Base</a> exists in R5, I assume that the resolution of this conversation was indeed to introduce a new top-level base type (<code>Base</code>) <em>without</em> <code>id</code> and <code>extension</code>.</li>\n<li>But I also see that the pattern logical models (like <a href=\"http://build.fhir.org/definition.xml.html\">Definition</a>) still have <em>no</em> <code>baseDefinition</code>.  Is this a valid option for logical models or <em>should</em> logical models always extend <em>something</em> (at least <code>Base</code>)?</li>\n<li>What does this mean for logical models in R4?  Are they just stuck w/ <code>id</code> and <code>extension</code>? Or (as in 2 above) can they choose to have <em>no</em> <code>baseDefinition</code> at all?</li>\n<li>While I have your ear... are there rules regarding what logical models can and cannot set as their <code>baseDefinition</code>?  For example, (a) can their base definition be of any <code>kind</code>: <code>logical</code>|<code>complex-type</code>|<code>primitive-type</code>|<code>resource</code>? (b) Can their base definition be a <code>constraint</code> or must their base always be a <code>specialization</code>?</li>\n</ol>",
        "id": 235259368,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1618871317
    },
    {
        "content": "<p>#1 yes<br>\n#1 they should extend Base<br>\n#1 unclear. In practice, the tooling fakes Base up so it can be used anyway<br>\n#1 good question, and I don't know what the answer is</p>",
        "id": 235288360,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618895253
    },
    {
        "content": "<p>Regarding #4, the CDA LogicalModels contain a few examples where <code>constraint</code> is being used. It works fine in the .NET as well as the Java tooling. See <a href=\"https://github.com/HL7/cda-core-2.0/blob/e8f5e61c3219c056db51f853e81415c4a14bce0f/input/resources/ST.xml\">https://github.com/HL7/cda-core-2.0/blob/e8f5e61c3219c056db51f853e81415c4a14bce0f/input/resources/ST.xml</a></p>",
        "id": 235302631,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1618905011
    },
    {
        "content": "<p>Thanks Grahame and Alexander.  Re #4, Alexander's example is a case of a logical model <em>being</em> a constraint.  I was wondering if a logical model can have a parent/baseDefinition that is a constraint.  I guess I don't see why not...  Of course, to tie 4a and 4b together, we could ask if a logical model can declare a resource profile as it's baseDefinition (e.g., can I build a LM whose base definition is the BP vital sign profile).</p>",
        "id": 235334904,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1618921881
    },
    {
        "content": "<p>In that case, the LM would be an abstraction based on the resource profile. <br>\nIf i understand correctly, I don't see how that would work:<br>\nThe LM has a few things that it cares about (to oversimplify): Patient, Date, Location, Systolic and Diastolic pressure . 2 of these 4 elements happen to be implemented as slices in the profile, the others are discrete elements. What does it mean if the LM abstracts that? Each slice is its own element at the root level? Or each slice is a sibling under another element?</p>",
        "id": 235337457,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1618922943
    },
    {
        "content": "<p>I'm not saying it doesn't work, I'm just wondering if/how we can cover the gap</p>",
        "id": 235337664,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1618923010
    },
    {
        "content": "<p>I wouldn't suggest we do anything smart there, <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>.  I was just suggesting it would inherit the structure as-is (slices and all).  So, if that's not valid in an LM, then I'd be more inclined to say using a constraint as a parent is not supported rather than creating special rules about how to convert it to automatically 1st class top-level elements.  That's too complicated.  I don't think we want complicated.</p>",
        "id": 235363073,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1618932266
    },
    {
        "content": "<p>I still don't know the answer and partly because I can't imagine a circumstance where it would be useful</p>",
        "id": 235411559,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618951329
    },
    {
        "content": "<p>We are getting close to completing our work to add support for logical models and resources to SUSHI. Based on discussions in this stream (and others) and with an eye towards completing the current work, we are limiting the creation of logical models to be <code>derivation = 'specialization'</code>.  Creating logical models to be <code>derivation = 'constraint'</code> can be considered at some point in the future if the community thinks it would be useful.</p>\n<p>We are currently allowing the logical model's \"Parent\" (<code>baseDefinition</code>) to be: <code>Base</code>, <code>Element</code>, and any other logical model (where <code>kind = 'logical'</code> and <code>derivation = 'specialization'</code>). This begs a couple of questions:</p>\n<ul>\n<li>Should we disallow other logical models to be the <code>baseDefinition</code> (keeping only <code>Base</code> and <code>Element</code> as allowed <code>baseDefinition</code>)?</li>\n<li>Assuming we continue to allow logical models to be the <code>baseDefinition</code>, should we also allow a logical model's <code>baseDefinition</code> to be a resource (where <code>kind = 'resource'</code> and <code>derivation = 'specialization'</code>)?  </li>\n</ul>\n<p>We see no difference in allowing either logical models or resources to be the <code>baseDefinition</code> and are inclined to support both. Since one can only add new elements in the definition of a logical model and cannot change any of the inherited elements from the <code>baseDefinition</code>, we see no reason to exclude either logical models or resources as a <code>baseDefinition</code>. </p>\n<p>That said, we would like to hear thoughts from the community to make sure we are not missing anything and that what we are thinking makes sense.</p>",
        "id": 237722748,
        "sender_full_name": "Joe Paquette",
        "timestamp": 1620332689
    },
    {
        "content": "<p>I</p>",
        "id": 237735064,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620337252
    },
    {
        "content": "<p>I'm not sure what your context for 'support' is. I don't think we have any methodological rule that you can't derive logical models from resources, but I don't think there's much point to doing that</p>",
        "id": 237735123,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620337296
    },
    {
        "content": "<p>We couldn't find anything that forbade it in the spec, but weren't sure if there were any known (or expected) issues in the tooling.  As far as I remember, the IG Publisher didn't complain when we passed in a logical model based on a resource, but that wasn't enough evidence to make us feel comfortable that it was an okay thing to do.</p>\n<p>I'm not sure there would be much point to it either, but we've learned not to be surprised by the ingenuity of IG authors ;-).  And we don't wont to explicitly forbid something without a good reason for doing so.</p>\n<p>That said, I <em>assume</em> that logical models cannot declare a <em>profile</em> as their parent because that might introduce things that are otherwise not allowed in logical models (like slicings), right?</p>",
        "id": 237737096,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1620338382
    },
    {
        "content": "<p>I'm pretty sure that I've said before that it's not illegal, but we have no idea how the tools would behave, or should behave</p>",
        "id": 237745574,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620343450
    }
]