[
    {
        "content": "<p>Consider a simple extension definition such as birthplace: <a href=\"http://hl7.org/fhir/extension-birthplace.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-birthplace.html\">http://hl7.org/fhir/extension-birthplace.html</a></p>\n<p>The value element is constrained to a single datatype (Address). Therefore, the <code>value[x]</code> element is renamed to <code>valueAddress</code>. According to FHIR spec, the associated element id would then be <code>Extension.value[x]:valueAddress</code>. The <code>valueAddress</code> part _should_ be equal to the element sliceName, however in this case the birthplace extension definition does NOT explicitly specify a sliceName <code>valueAddress</code> for the value element; apparently, the value is implied.</p>\n<p>Q: Should the snapshot generator, when expanding the differential of an extension definition such as birthplace, include the _implied_ sliceName (such as <code>valueAddress</code>) in the snapshot component? Or should the validator consider such an extension definition as invalid, i.e. require sliceName on choice type elements constrained to a single type? However this would not solve the issue for all existing published STU3 extensions.</p>\n<p>Currently, I think the .NET snapshot generator does not do this. However this would solve some issues downstream. For example, when generating element ids from path and sliceName. Or when further constraining the value element in a derived/referencing profile.</p>",
        "id": 153976863,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1532096071
    },
    {
        "content": "<p>I think it should be consistent. Does the java snapshot generator make it so?</p>",
        "id": 153976892,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532117830
    },
    {
        "content": "<p>Not sure, but I'll check</p>",
        "id": 153977269,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1532344091
    }
]