[
    {
        "content": "<p>I just commented on <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9195\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9195\">GF#9195</a></p>",
        "id": 153830881,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464760560
    },
    {
        "content": "<blockquote>\n<p>I don't know how I'd compare bindings to see if profiles were compatible</p>\n</blockquote>\n<p>An added binding could either:<br>\na. Restrict an existing binding to a subset<br>\nb. Add an additional constraint, leaving the original binding</p>\n<p>In either case, aggregating the bindings wouldn't be functionally valid since in a. a code valid in the profile would also be valid in the base.</p>\n<blockquote>\n<p>I don't know how you'd know how to generate a UI. What do you do with multiple bindings?</p>\n</blockquote>\n<p>I'm assuming that you're currently populating a \"drop-down\" list with valid values from a single list.  However, IF the situation exists where I need both a local coding and a standard coding (via slicing of coding), how would you render?  Probably ask for one of each?<br>\nThe complex situation is where a single code may satisfy many bindings.  I guess the UI will have to take a coding, check it against all bindings, and then ask for more if needed?  This is already the case though...</p>\n<blockquote>\n<p>what happens during snapshot derivation? Those rules are already complex</p>\n</blockquote>\n<p>They get simple - just aggregate bindings.  If you can determine that one VS is a subset of another, you could rationalize, but leaving them all doesn't break anything...</p>",
        "id": 153831610,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1464984488
    },
    {
        "content": "<p>unfortunately it does matter. I have to get it right. :-(</p>",
        "id": 153831703,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1465125316
    },
    {
        "content": "<p>While I certainly feel the pain of adapting existing tooling, in this situation the question, I think, is more about communicating the real world situation.  If multiple bindings are required (common, well understood use case), then communicating them with multiple binding tags is the clear way to communicate that.  The tools must then figure out what how to accommodate.  I know we're shooting for \"easy to implement\", but this makes the other side (content implementation) MUCH harder in these scenarios (forces @profile slicing).</p>",
        "id": 153831827,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1465223403
    }
]