[
    {
        "content": "<p>Does it make sense to indicate MustSupport on a Logical Model? <br>\nIf so, what would that mean? A functional need to support it (which is then expected in the implementation)?  or something else?</p>",
        "id": 180869183,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1573850082
    },
    {
        "content": "<p>The meaning would have to be defined for the logical model</p>",
        "id": 180869564,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573850401
    },
    {
        "content": "<p>In other words: please propose the wording ;-)</p>",
        "id": 180913295,
        "sender_full_name": "René Spronk",
        "timestamp": 1573912843
    },
    {
        "content": "<blockquote>\n<p>In other words: please propose the wording ;-)</p>\n</blockquote>\n<p>Me, I'm using Logical Models to capture the functional part of a specification - common ground between business and developers - which will then have to be derived towards implementations. So I have this so far:</p>",
        "id": 180915222,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1573916323
    },
    {
        "content": "<p>For Logical Models</p>\n<ul>\n<li>Functional Analysis MUST take into account the \"Must support\" data elements and their definition and constraints<ul>\n<li>Implementation of “Must Support” logical data elements, MUST inherit the behaviour and constraints defined for the logical data element</li>\n<li>“Must Support” elements not needed in a particular implementation MAY be excluded from implementation but such exclusion MUST be described</li>\n</ul>\n</li>\n<li>Elements derived from “Must Support” logical data elements SHOULD inherit the field’s “Must Support” flag</li>\n</ul>",
        "id": 180915312,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1573916489
    },
    {
        "content": "<p>Looking for feedback</p>",
        "id": 180915359,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1573916524
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> <br>\nThese are very weak conditions. I read the first conditions to mean must support means \"must implement as specified or document an excuse\". The last condition is weaker than what applies to derived profiles, where must support is inherited undiminished.</p>",
        "id": 180979279,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1574036871
    },
    {
        "content": "<blockquote>\n<p>MUST inherit the behaviour and constraints defined for the logical data element</p>\n</blockquote>\n<p>I think that if you say that readers must pay attention to definitions and constraints you have assumed the readers are antagonistic or unskilled. Such readers will always find something that you have left out which they can ignore and blame on your incomplete statement. Leave out statements that amount to \"be competent\".</p>",
        "id": 180979325,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1574036961
    },
    {
        "content": "<p>Maybe<br>\nIn the context of this implementation guide, must support SHALL be interpreted as follows:</p>\n<ul>\n<li>Implementations SHALL either implement the element as defined or shall omit the element and provide a documented reason for its omission (where?)</li>\n</ul>",
        "id": 180979376,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1574037031
    },
    {
        "content": "<p>I don't think that documenting an excuse ist appropriate or acceptable for mustSupport elements. The basic idea for mustSupport was the establishment of minimal requirements. If this is broken there is no ground for any trust.</p>",
        "id": 181086880,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1574146583
    },
    {
        "content": "<blockquote>\n<p>Maybe<br>\nIn the context of this implementation guide, must support SHALL be interpreted as follows:</p>\n<ul>\n<li>Implementations SHALL either implement the element as defined or shall omit the element and provide a documented reason for its omission (where?)</li>\n</ul>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> Thanks. I will rephrase. But the idea is not to say \"be competent\", rather \"the logical model constraints must be reflected in the technical implementation, e.g. FHIR resource constraints\". <br>\nI don't know if is is clear - When I wrote \"implementations\" I mean \"the FHIR profiles (or CDA or V2...) that will be derived from this\".</p>",
        "id": 181099181,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1574159913
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> <br>\n Your wording \"the logical model constraints must be reflected in the technical implementation, e.g. FHIR resource constraints\" is much more informative than my expression \"be competent\". <br>\nIf an implementation does not follow the expectation \"the logical model constraints must be reflected in the technical implementation, e.g. FHIR resource constraints\" I would not call it a competent implementation.</p>",
        "id": 181177544,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1574221574
    },
    {
        "content": "<p>Exactly. We have two problems: a spec must bei precise with exact requirements. Excuses shall not be allowed per se. Implementation must be correct and conformant. If this does mit map adaptations are necessary in both sides.</p>",
        "id": 181191868,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1574242875
    },
    {
        "content": "<p>Thanks. This is a logical model and I am talking about \"Must Support\" so I expect this is at a different level than a technical spec.</p>",
        "id": 181192132,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1574243148
    },
    {
        "content": "<p>My initial idea was to map the logical model to the profiles, and see when there is a \"must support\" on the logical model that is not present or not \"must support\" on the profiles</p>",
        "id": 181192391,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1574243233
    },
    {
        "content": "<p>Doe that goal make sense?</p>",
        "id": 181192399,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1574243242
    },
    {
        "content": "<p>MustSupport in or within logical models should not differ from resourcen/profiles.</p>",
        "id": 181192485,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1574243327
    },
    {
        "content": "<blockquote>\n<p>MustSupport in or within logical models should not differ from resourcen/profiles.</p>\n</blockquote>\n<p>That would apply for the physical layer on fhir (profiles) but not for other standards - other standards do not have the \"must support\" option. And the definition of Must Support on the physical layers may differ.. which is exactly why I wondered if we could put it on the logical layer</p>",
        "id": 181197579,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1574247995
    },
    {
        "content": "<p>What do you mean with 'other standards'?</p>\n<p>And mustSupport represents the corresponding construct in other layers..</p>",
        "id": 181216276,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1574263033
    },
    {
        "content": "<p>Maybe we have different ideas of the meaning and use of a FHIR logical model.<br>\nMaybe that needs to be stated before the meaning of must support is defined.</p>",
        "id": 181258418,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1574290234
    },
    {
        "content": "<p>Well, a logical model is a structural definition with certain attributes. MustSupport is a tag indicating whether an attribute needs specific handling or not. The kind is then described in an IG. Or not?</p>",
        "id": 181288593,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1574329122
    },
    {
        "content": "<p>One example for context: IHE Pharmacy has a profile for medication in v2, and one in CDA.<br>\nI proposed next step should be a common model that could be used to contain common specs, and then we apply specs onto technical standards. Cardinality, bindings,... and possibly things like MustSupport. Logical Model is not implementable, it just contains things that should be on both implementable standards.</p>",
        "id": 181622328,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1574415583
    },
    {
        "content": "<p>OK, that opens the question for whether we would like to have information models as UML diagrams or structure definitions? The first is necessary for interoperability, the latter for implementations. However, they are highly related.</p>",
        "id": 181630962,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1574423805
    },
    {
        "content": "<p>Why (and how) would UML diagrams be <strong>necessary</strong> for interoperability?  That doesn't seem to me an obvious assertion to make, but I could be missing your point - maybe you can clarify?</p>",
        "id": 181891043,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1574744777
    },
    {
        "content": "<p>some people can't think without UML <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 181891263,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574745227
    },
    {
        "content": "<p>Well, If the underlying logic and relationships are clear, you can have other mechanism to document that. But UML as a graphic notation is easy to read, mache mit for everyone.<br>\nInteroperability is more than mapping and understanding single fields/attributes. It is also about complex structures from different perspectives. Hierarchic views are single serialized perspectives only..<br>\nMost projects fail because of missing understanding. Migrating to FHIR for example does not fix this..</p>",
        "id": 182032981,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1574871117
    },
    {
        "content": "<p>indeed I often way that when presenting. But there are other ways to generate useful diagrams than UML. Of course, we can generate UML diagrams for logical models, so I'm actually wondering what we are discussing?</p>",
        "id": 182033154,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574871226
    },
    {
        "content": "<p>A single logical model is hierarchic, isn't it?<br>\nSo what you generate is just a visualization.<br>\nUML models are cyclic graphs. So we would need a generator that create a visualization for a set of interlinked logical models/structure definitions...</p>",
        "id": 182034001,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1574871684
    },
    {
        "content": "<p>well, we'd only need that if we were generating from something that defined like that. Maybe you are talking about a generator for GraphDefinition?</p>",
        "id": 182034245,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574871833
    },
    {
        "content": "<p>Not yet, but good idea.<br>\nRight now I am talking about visualizing the way a set of logical models are related.</p>",
        "id": 182044419,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1574878433
    },
    {
        "content": "<p>That means GraphDefintion in FHIR</p>",
        "id": 182048509,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574881281
    },
    {
        "content": "<p>Including Details?</p>",
        "id": 182059910,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1574889933
    },
    {
        "content": "<p>Yes. GraphDefinition refers to StructureDefinitions, so it describes the overall structure in detail.</p>",
        "id": 182275784,
        "sender_full_name": "René Spronk",
        "timestamp": 1575188955
    }
]