[
    {
        "content": "<p>I got some frowns from some NIST folks about making Min &gt; 0 elements Must Support.   When profiling, I typically make everything a must support since if it isn't  I don't include in a diff.    The documentation doesn't discourage its usage and I think its consistent with my definition of Must Support.   Would like some other opinions.</p>",
        "id": 153899537,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501359102
    },
    {
        "content": "<p>You don't have to make elements with a min &gt; 0 mustSupport.  If you don't, you're saying receivers are allowed to ignore them and senders are allowed to just send a fixed value but not have a capability for the user to set them or be able to store them, etc.  Deciding that something HL7 has said is so important it must be present in every instance is appropriate to ignore is certainly not a decision to make lightly, but it's a decision you're allowed to make...</p>",
        "id": 153899557,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501385960
    },
    {
        "content": "<p>I have wondered what the meaning of setting this true or false. I find that in standards language the word \"support\" is an ambiguous word. I never know what it means. It seems closest to the meaning one would get from a hangman's noose... which is not good.... I am still not clear what it means. Receivers are allowed to ignore, are you saying that by setting it true that I am forcing some specific action that receivers must do? Where is that behavior defined? I never get to define the behavior, all I get to do is set true/false... I am equally unclear on sender...</p>",
        "id": 153899581,
        "sender_full_name": "John Moehrke",
        "timestamp": 1501423145
    },
    {
        "content": "<p>It's only used in implementation guides or profiles and the requirement is that the implementation guide define exactly what \"support\" means - whether that's store, be able to display, consider as part of decision support, include in statistical analsysis, etc.</p>",
        "id": 153899583,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501428645
    },
    {
        "content": "<p>so there is an expectation that the IG narrative contains clarification... Okay, I can work with that.  I suspect we will need to evolve this into a set of well defined values. For example, it is common in profiles to need a flag to tell the sender actor that if they have the value, they shall send it (RE or R2). This kind of a flag to the sender is common. Recipients behavior is less common to encode into the message semantics.</p>",
        "id": 153899666,
        "sender_full_name": "John Moehrke",
        "timestamp": 1501502230
    },
    {
        "content": "<p>See <a href=\"http://hl7.org/fhir/us/core/guidance.html#must-support\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/guidance.html#must-support\">US-Core</a> for our definition - It borrows heavily from RE.</p>",
        "id": 153899681,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501515735
    },
    {
        "content": "<p>Am I correct in thinking that mustSupport=true resembles \"required\" in V3? If so then you could not create a derived profile without mustSupport=true right? So if my US core profile says mustSupport=true for SSN then this prohibits (derived) use of the profile on anonymous patients in research for example.</p>",
        "id": 153899876,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1501592875
    },
    {
        "content": "<p>We are working on NL core and I tend to think that I do not want to limit derived use too much. So I'm left with the options</p>\n<ul>\n<li>to make everything in the differential mustSupport=true like US core, </li>\n<li>to make nothing mustSupport=true and instead add a notion that mention in the differential in itself suggests mustSupport or explain (comply or explain), </li>\n<li>to weigh at least every optional path for importance and potentially make every min &gt; 0 path mustSupport=true (although that is sort of redundant)</li>\n</ul>",
        "id": 153899877,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1501593140
    },
    {
        "content": "<p>well, those are a good set of choices to consider...</p>",
        "id": 153899992,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501617579
    }
]