[
    {
        "content": "<p>Hi all, what does it mean when an element is labelled as 'must support ' in a US core profile? I have read the content on  <a href=\"http://hl7.org/fhir/us/core/guidance.html#must-support\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/guidance.html#must-support\">http://hl7.org/fhir/us/core/guidance.html#must-support</a>. But how can I know which one of the conclusions mentioned in the guide apply for that context? Thank you</p>",
        "id": 153922032,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1511956108
    },
    {
        "content": "<p>The particular use case that apples to sender for a given data element.  It boils down to \"send it if you have it\"  You won't know a priori.</p>",
        "id": 153922053,
        "sender_full_name": "Eric Haas",
        "timestamp": 1511965892
    },
    {
        "content": "<p>The definition of must-support is to be defined in the profile as it might be different. In this case it is defined much like R2 or RE is defined in other specifications... if you have it you MUST send it.  But a recipient has no idea if the sender is indeed following that MUST clause, as a recipient must handle empty as well as filled...  Testers hate this kind of quasi-requirement, only testable by forcing the sender to have a patient with that data so that their test can fail when they don't see the data. And that doesn't cover cases where the sender is an app that simply has no way of having that value...    It thus is an indicator to the sending app writer that 'you really should implement support this element if at all possible, and if you have the data you should consider it a required element to populate'</p>",
        "id": 153922059,
        "sender_full_name": "John Moehrke",
        "timestamp": 1511967636
    },
    {
        "content": "<p>yes to enforce it you have to create a <a href=\"http://hl7.org/fhir/testscript.html\" target=\"_blank\" title=\"http://hl7.org/fhir/testscript.html\">TestScript</a>   and grade the implementation...</p>",
        "id": 153922075,
        "sender_full_name": "Eric Haas",
        "timestamp": 1511970350
    },
    {
        "content": "<p>What are different categories (elements which are mandatory, elements labelled must-support etc) of elements in a generic US core profile?</p>",
        "id": 153922251,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1512040677
    },
    {
        "content": "<p>We  took a lot from our HL7 V2 experience.  for usages  see Ch2 for a detailed discussion of sender and receiver requirements:</p>\n<ul>\n<li>R (SHALL)= Required where cardinality  (1..) = MUST to be present or fails validation</li>\n<li>RE( Must Support) cardinality  (0..) + Must Support flag= true = MUST be present if you have the data (need test scripts to validate)</li>\n<li>C(a/b) = there is some invariant that affects the usage of an element a based on element b</li>\n<li>O  (MAY)  cardinality (0..) : no guidelines but you won't fail vaildation either way  formally not defined.</li>\n</ul>\n<p>SHOULD is in between RE and O - more like a nice to have  but you won't fail vaildation either way</p>",
        "id": 153922306,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512058475
    },
    {
        "content": "<p>In us core we only document the R , and RE and C(a/b) cases.  everything falls in to the O category or is defined by the base standard.</p>",
        "id": 153922307,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512058636
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  Thank you</p>",
        "id": 153923120,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1512553795
    },
    {
        "content": "<p>the java validator currently gives a hint:</p>",
        "id": 153966864,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528172991
    },
    {
        "content": "<p>Information @ ClinicalDocument.realmCode[1] (line 4, col27) : Instance includes element that is not marked as 'mustSupport' in the corresponding profile and was validated against a profile containing mustSupport=true elements.</p>",
        "id": 153966865,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528173004
    },
    {
        "content": "<p>I think that this concern is misplaced, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> (who added this). If a profile has must-support things, and also leaves some things as optional, that's got nothing to do with the implementers. I think it should be a warning about the profile itself - that it has things labelled as must-support but also optional things that are not. We shouldn't bother the users with something so arcane</p>",
        "id": 153966866,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528173078
    },
    {
        "content": "<p>or we should add an extension to the profile that turns this on - but even then, I'm troubled because we validate across a network of profiles...</p>",
        "id": 153966867,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528173107
    },
    {
        "content": "<p>This is paticularly clear when you're dealing with CDA where some thigns are labelled as must support in base specification itself</p>",
        "id": 153966868,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528173358
    },
    {
        "content": "<p>It's useful when validating example instances when creating implementation guides.</p>",
        "id": 153966872,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528174326
    },
    {
        "content": "<p>You want to know if your examples are including things that implementers aren't expected to support.  In some cases, the solution is to strip the content as unnecessary (and confusing to implementers).  In many cases, the solution is to mark as \"mustSupport\" elements you had forgotten to mark as mustSupport.  And in some cases, you'll just suppress the warning.</p>",
        "id": 153966873,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528174404
    },
    {
        "content": "<p>If we want to have a flag to trigger the check, that's fine.  But it's absolutely needed where it's used.</p>",
        "id": 153966874,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528174435
    },
    {
        "content": "<p>is it appropriate anywhere else?</p>",
        "id": 153966877,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528174653
    },
    {
        "content": "<p>When you're authoring a system, it can be useful to know if you're spitting out data that consuming systems aren't expected to support.</p>",
        "id": 153966881,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528175425
    },
    {
        "content": "<p>So perhaps not at runtime, but certainly during testing.</p>",
        "id": 153966882,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528175439
    },
    {
        "content": "<p>so I don't really think that this is something that is inferred because must-support is found somewhere in the profile.</p>",
        "id": 153966883,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528175490
    },
    {
        "content": "<p>I think it's an actual setting outright. And I don't think that the message is very good</p>",
        "id": 153966884,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528175520
    },
    {
        "content": "<p>If you want to trigger it with a configuration parameter, that could work.  What do you think the message should say instead?</p>",
        "id": 153966887,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528177662
    },
    {
        "content": "<p>The element %1 is not marked as 'mustSupport' in the profile %2. Consider not using the element, or marking the element as must-Support in the profile</p>",
        "id": 153966889,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528177801
    },
    {
        "content": "<p>ok</p>",
        "id": 153966903,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528178234
    },
    {
        "content": "<p>new validator parameter -hintAboutNonMustSupport. Lloyd, can you document it at the bottom of this page:</p>",
        "id": 153966917,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528179511
    },
    {
        "content": "<p><a href=\"http://wiki.hl7.org/index.php?title=Using_the_FHIR_Validator\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Using_the_FHIR_Validator\">http://wiki.hl7.org/index.php?title=Using_the_FHIR_Validator</a></p>",
        "id": 153966918,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528179530
    },
    {
        "content": "<p>also now a boolean parameter in the ig json file by the name of hintAboutNonMustSupport</p>",
        "id": 153966920,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528179779
    },
    {
        "content": "<p>Documented for the validator and the IGPublisher</p>",
        "id": 153967047,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528207368
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I noticed that you didn't include the commas following the value for the added parameters in IG Publisher Documentation:</p>\n<blockquote>\n<p>\"check-aggregation\" : true // Warning if aggregation not declared on differential elements of type Reference<br>\n   \"check-mustSupport\" : true // Warning if mustSupport not declared on elements appearing in differential<br>\n   \"hintAboutNonMustSupport\" : true //Info validation if elements appear in examples when not marked as mustSupport=true in one of the corresponding profiles</p>\n</blockquote>",
        "id": 153967148,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1528227329
    },
    {
        "content": "<p>We were missing commas a few other places too.  Now all fixed</p>",
        "id": 153967154,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528229249
    }
]