[
    {
        "content": "<p>Question about NamingSystem. If we use that resource to create a 'namespace' for a set of identifiers, then because the NamingSystem doesn't have a 'url' property, it suggests that Identifier.system must resolve directly to the NamingSystem resource (ie it's a URL not a URI) - correct? </p>",
        "id": 153820935,
        "sender_full_name": "David Hay",
        "timestamp": 1460412334
    },
    {
        "content": "<p>i guess</p>",
        "id": 153820937,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1460412779
    },
    {
        "content": "<p>most of the other conformance resources to have this property, suggesting it's an oversight. I'll add a tracker...</p>",
        "id": 153820941,
        "sender_full_name": "David Hay",
        "timestamp": 1460414229
    },
    {
        "content": "<p>It's not an oversight.  NamingSystem has multiple identifiers present and none of them are canonical.</p>",
        "id": 153820967,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460431834
    },
    {
        "content": "<p>You can't possibly have all of the Identifier.system values resolve to the NamingSystem.  It's possible one of them might, but there's no guarantee.  NamingSystem isn't used the same way that things like StructureDefinition and ValueSet which will be pointed to in implementation guides.  NamingSystems will generally live in the master registry and you'll search by whatever OID/GUID/URI you have.</p>",
        "id": 153820968,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460431951
    },
    {
        "content": "<p>Thanks for the clarification...</p>",
        "id": 153820973,
        "sender_full_name": "David Hay",
        "timestamp": 1460432113
    },
    {
        "content": "<p>Speaking of search: Where would I put a set of keywords for a NamingSystem, e.g. if you want your NamingSystem to pop up when people search for Driver's License, Driving License or Driving Permission?</p>",
        "id": 153821703,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460622130
    },
    {
        "content": "<p>Right now, we have useContext, but that's not quite the same as keywords.  We don't use keywords on any of our infrastructure resources at the moment.  Logic being that it's probably easier to have the user look up the list of allowed codes and find the one you want, then search than it is to predict what terms a user might think up to use to find their desired concept.  (And, in principle, the code system could have multiple display names and/or aliases provided as part of the code definition that could help when searching in the value set.)</p>",
        "id": 153821806,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460645947
    },
    {
        "content": "<p>True. But not true if your NamingSystem is an identifier namespace. You can't type a Driver's License Number into the Simplifier SearchBox and expect to find the proper NameingSystem....</p>",
        "id": 153821819,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460650316
    },
    {
        "content": "<p>No, it'd be a two-step process.  You'd type \"Driver's License Number\" into a search box that would look against the value set and then use the resulting code to search NamingSystem</p>",
        "id": 153821823,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460651473
    },
    {
        "content": "<p>Not sure we're talking about the same issue here.... In Germany we have Identifiers for insured Patients, usually refered to as \"Krankenversichertennummer\". However, the same number is printed on the Health Insurance Card (\"eGK\"), so some people refer to it as the \"eGK-Nummer\". How do I make sure, any Implementer browsing a Registry like Simplifier finds the right NamingSystem if he wants to encode such an identifier, no matter which of the two aliases he's searching for...?</p>",
        "id": 153821831,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460652774
    },
    {
        "content": "<p>Two steps.  First they'd have to query on the value set used by the German NamingSystem registry to find out what the code is they should use when searching the NamingSystem.  They could run an expansion on the value set searching for terms whose display names contained either of those terms and should find the code.  Once they've got the code, they can search NamingSystem.  If you wish, you can submit a change request to add keyword to NamingSystem (and presumably most or all of the other Conformance resources as the use-case would be the same).  I was just sharing the rationale for why it wasn't already there.</p>",
        "id": 153821833,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460658809
    },
    {
        "content": "<p>Sorry I don't understand \"value set used by the German NamingSystem registry\".</p>",
        "id": 153821901,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1460723028
    },
    {
        "content": "<p>When you have a collection of NamingSystems you want to be able to search using NamingSystem.useContext, the server you're searching on should have a profile for NamingSystem.  That profile should indicate what ValueSet applies to the NamingSystem.useContext for that server.  Hopefully it will have codes for things like eGK-Nummer and those codes will also include Krankenversichertenuumer as an alias or display name or as part of the description.  That's the theory at least.</p>",
        "id": 153821932,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460727117
    },
    {
        "content": "<p>Wait. Before I start yelling \"change request\", I need to understand what \"value set used by German NamingSystem registry\" means...<br>\n I am missing something here...</p>",
        "id": 153824976,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1462626668
    },
    {
        "content": "<p>So - If you want to have control over what codes are going to be used to support searching for naming systems, you need to have a system over which such control can be exercised.  The most logical place for that to occur is standing up a registry in Germany whose responsibility is to track German-relevant namespaces.  If you stand up a registry, then the Conformance/Profiles for that registry can set constraints on what must/can be populated for NamingSystem instances on that server - including what ValueSet is bound to NamingSystem.useContext.  That will allow you to ensure that instances are consistently encoded.</p>",
        "id": 153825069,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1462631051
    }
]