[
    {
        "content": "<p>If an element is defined as being a Reference with an aggregation mode of \"contained\" or \"bundled\", is it legitimate to populate the reference such that it doesn't resolve (e.g. with only an identifier or a display or extension, but no reference)?  (If the reference is present, it's an error if it doesn't resolve to a contained or bundled location - as specified by the aggregation mode.)</p>",
        "id": 153927934,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515390030
    },
    {
        "content": "<p>I don't know</p>",
        "id": 153927936,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515392073
    },
    {
        "content": "<p>I have a client who'd like it to be an error, but the spec isn't super clear.  The real question is whether the expectation for bundled/contained/referenced comes into play if the element is present or only if the [element].reference is present.</p>",
        "id": 153927937,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515392257
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14402\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14402\">GF#14402</a></p>",
        "id": 153927969,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515428252
    },
    {
        "content": "<p>I am almost ready to rewrite the validator to not have just success/failure but also \"undecided\".  I think this is clearly a case where -from a validation point of view- you cannot say whether it's wrong or right...</p>",
        "id": 153928129,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1515510069
    },
    {
        "content": "<p>is that undecided? Or did you get to the point that you know that it is NOT wrong... That is a decision, so is not undecided.</p>",
        "id": 153928130,
        "sender_full_name": "John Moehrke",
        "timestamp": 1515510443
    },
    {
        "content": "<p>Luckily, I am still in a stage where I can easily change the term ;-)   In three-valued boolean logic I see both \"unknown\" and \"undetermined\" being used..</p>",
        "id": 153928133,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1515511290
    },
    {
        "content": "<p>not sure how to interpret the difference between those two. How about  inconclusive</p>",
        "id": 153928134,
        "sender_full_name": "John Moehrke",
        "timestamp": 1515511641
    },
    {
        "content": "<p>I like that.</p>",
        "id": 153928135,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1515512333
    },
    {
        "content": "<p>I don't think \"undecided\" is useful for a standard.  Something is either legal or it's not.  Sometimes we have things that \"might\" be issues - or at least go against good practice and raise warnings rather than errors, but this doesn't seem like a space where that's necessary.</p>",
        "id": 153928138,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515513486
    },
    {
        "content": "<p>The standard needs to make clear in what context aggregation mode applies - is it when the element is present, when the Reference.reference element is present or when the Reference.reference.value is present.</p>",
        "id": 153928139,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515513559
    },
    {
        "content": "<p>That's a relatively straight-forward thing for us to clarify - we just need to figure out what we want...</p>",
        "id": 153928140,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515513585
    },
    {
        "content": "<p>Lloyd, I agree - that's why I said \"from a validation point of view\": there are run-time circumstances (unresolvable links, terms servers unreachable) etc that would lead to \"inconclusive\".   Maybe this specific issue is not so much run-time but indeed just plain wrong.</p>",
        "id": 153928141,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1515514328
    },
    {
        "content": "<p>I think inconclusives should be handled as warnings/infos.  But this case I think we can tighten down to be an error.</p>",
        "id": 153928148,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515517448
    },
    {
        "content": "<p>I agree with Llyod, an <code>info</code> is a good established term for this.</p>",
        "id": 153928433,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1515684951
    }
]