[
    {
        "content": "<p>I am working on a security IG that is going to set some requirements for ALL resources derived from DomainResource. Specifically a defined set of codes for .meta.security... How do I do this at the DomainResource level?</p>",
        "id": 183211306,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576105260
    },
    {
        "content": "<p>You should be able to profile DomainResource.  How the validator would handle that against an instance is an open question.  Presume the IG has a narrow scope in terms of the context in which the resources would be used that would allow assertion of security codes?  Because it couldn't be done at an international or even U.S.-wide level.</p>",
        "id": 183212800,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576106407
    },
    {
        "content": "<p>I don't think this is possible at this time</p>",
        "id": 183213365,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576106954
    },
    {
        "content": "<p>it's not clear to me that it's even allowed</p>",
        "id": 183213387,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576106976
    },
    {
        "content": "<p>I am willing to try...</p>",
        "id": 183217936,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576111214
    },
    {
        "content": "<p>The bigger part of this is profiling Bundle.meta.security... so that is what I am focusing on first.</p>",
        "id": 183217954,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576111245
    },
    {
        "content": "<p>but, the overall is that yes there is a need to say that all the resources within a bundle that is compliant with XYZ profile and thus ABC regulation SHALL be marked with tag LMNOP...</p>",
        "id": 183218031,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576111325
    },
    {
        "content": "<p>Or said another way...Given a subset of the vocabulary bound to DomainResource.meta.security in a given IG, when a system declaring conformance to that IG is declaring that they use a subset of codes according to that IG, such that no data (or bundes) will be sent with vocabulary outside that subset and all data consumed with that vocabulary will be processed according to the rules of the IG. It seems this is only possible to say in narrative?</p>",
        "id": 183262733,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576160198
    }
]