[
    {
        "content": "<p>Do we have any definitions on types of profiles. It seems in the UK we have several types: </p>\n<ul>\n<li>core profiles - which give UK rules</li>\n<li>domain/home nation rules - such as NHS National Services (England), Digital Medicines, etc. May focus on domain data models.</li>\n<li>rule profiles - which can be additional applied to either of the above, they state simple rules such as English NHS Identifier is mandatory</li>\n</ul>",
        "id": 203075320,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1594108473
    },
    {
        "content": "<p>also in domain definition would be regional profiles.</p>",
        "id": 203075390,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1594108552
    },
    {
        "content": "<p>Yes, we do. We are working on that in the Conformance WG.</p>\n<p>The most important separation is constrainable vs. implementable. The latter is without optionalities and a constraint on the first.<br>\nConstrainable profiles can be constrained again.</p>\n<p>Core profiles are high level constrainable profiles.</p>\n<p>Further on one can have:</p>\n<ul>\n<li>annotation p.</li>\n<li>localizations</li>\n<li>...</li>\n</ul>",
        "id": 203105196,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1594130070
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191549\">@Frank Oemig</span>  the \"core\" profile was not named \"base\" profiles ?</p>",
        "id": 203489145,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1594375154
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191687\">@Kevin Mayfield</span>  not sure if it could help, but for the IT REALM we tried to classify our profiles as follows <a href=\"http://www.hl7.it/fhir/base/design.html#profili-tipologie\">http://www.hl7.it/fhir/base/design.html#profili-tipologie</a> (unfortunately it is in Italian). <br>\nIn brief :</p>\n<ul>\n<li>profiles that apply for any scope and any \"thing\" (a generic profile for a FHIR resource); </li>\n<li>those that are used to represent a specific \"thing\" resource independently on the scope;</li>\n<li>those specified for a specific purpose (independently on the \"thing\" represented)</li>\n<li>those used for a specific scope and \"thing\".<br>\nWe consider to include the first two categories in our FHIR base IG and the latter in (future) scope specific IGs.</li>\n</ul>",
        "id": 203490635,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1594376233
    },
    {
        "content": "<p>there is a missing orthogonal dimension, not represented in the picture, that is the jurisdiction. On top of them we may more generic UV (in future EU) profiles and, downstream, regional, organizational specialized profiles.</p>",
        "id": 203491055,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1594376526
    },
    {
        "content": "<p>Side note: I was thinking i was possibly crazy when I started making for Belgium (and IHE) an IG to explain how our IGs would work.<br>\n<span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> I really like this IG. I'm glad to see I'm not that crazy (or not alone.)</p>",
        "id": 203492614,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594377764
    }
]