[
    {
        "content": "<p>How do I indicate that my ImplementationGuide and/or CapabilityStatement is happy with a specific resource that is not constrained? For example my Server is happy with Patient resource. It seems I can't create a StructureDefinition that has no constraints? Or is that just a tooling issue? Or is there some better way to say that my IG likes the Patient resource as published by FHIR?</p>",
        "id": 153922835,
        "sender_full_name": "John Moehrke",
        "timestamp": 1512420505
    },
    {
        "content": "<p>Refer to the structure definition that defines the resource itself.</p>",
        "id": 153922839,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512421372
    },
    {
        "content": "<p>Good question:</p>\n<p>If you are talking about references to e.g., patient, the reference is the by default in the tooling if type is empty to the base Patient, are you as the author constraining it to the 'only' the base Patient resources vs say My_Patient resource in my implementation which has some swell extensions.  Or really saying 'I don't care' since I'm not defining that?</p>",
        "id": 153922868,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512442982
    },
    {
        "content": "<p>My approach has been to say nothing about the stuff I'm not constraining.  ( only the delta )  I assume that the rest in really undefined in the IG and left to the implementers to do interpret as they wish.</p>",
        "id": 153922870,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512443135
    },
    {
        "content": "<p>In this case (PDQm) we want to say ANY Patient. It could be core, it could be constrained, it could be extended. Any Patient resource.  Given this and the answer from Lloyd vs Eric; I don't know what to specify.</p>",
        "id": 153922947,
        "sender_full_name": "John Moehrke",
        "timestamp": 1512479909
    },
    {
        "content": "<p>If a system doesn't specify a profile at all, that <em>doesn't</em> mean they accept all data that's legal in the Patient resource - it means they're not documenting what they accept vs. not.  If you want to affirmatively say that you can handle everything that's in the  base Patient resource, then point to that resource.</p>",
        "id": 153922984,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512489088
    },
    {
        "content": "<p>Lloyd, you mention 'system'... I am specifying an IG thus capabilitystatement.kind=requirements... would you give the same answer? I am happy with it, just wanting clarity as the various use-cases for capabilitystatement seem to be somewhat confusing</p>",
        "id": 153922988,
        "sender_full_name": "John Moehrke",
        "timestamp": 1512489569
    },
    {
        "content": "<p>Yes, I'd give the same answer</p>",
        "id": 153922991,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512490377
    }
]