[
    {
        "content": "<p>When you read the standard (<a href=\"https://www.hl7.org/fhir/formats.html#table\" target=\"_blank\" title=\"https://www.hl7.org/fhir/formats.html#table\">https://www.hl7.org/fhir/formats.html#table</a> states what cardinalities are <strong>allowed</strong>, <a href=\"https://www.hl7.org/fhir/profiling.html#cardinality\" target=\"_blank\" title=\"https://www.hl7.org/fhir/profiling.html#cardinality\">https://www.hl7.org/fhir/profiling.html#cardinality</a> states that it is <strong>not used</strong>, <a href=\"https://www.hl7.org/fhir/profiling.html#5.1.0.8\" target=\"_blank\" title=\"https://www.hl7.org/fhir/profiling.html#5.1.0.8\">https://www.hl7.org/fhir/profiling.html#5.1.0.8</a> talks about <strong>ruling out</strong>) ... should this perhaps be harmonized a bit? <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I'm looking at you.</p>",
        "id": 153920702,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1511274588
    },
    {
        "content": "<p>so in the spirit of reusable profiling, is it better to basically spray out a lot of mustSupport on all fields that are 0..*/0..1 in ones profile instead of 0..0 on the fields that are unused as this basically makes it less reusable? <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> what is your take on this?</p>",
        "id": 153920704,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1511274850
    },
    {
        "content": "<p>and of course using 1..1/1..* where it makes sense</p>",
        "id": 153920735,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1511275892
    },
    {
        "content": "<p>I agree Jens! I think especially profiles that are rather on a top level like IHE or national profiles shouldn't set any cardinalities to 0..0 simply because they don't use or need the element unless they <em>explicitly</em> want to forbid their use.<br>\nI guess the \"mustSupport\" Flag is our best bet to mark the elements of relevance to a specific profile. It feels a bit like abuse, but it's the one thing that allows us to convey the information. Instances that don't use a flagged element are still valid and so are those who populate an unflagged element (which may be required in another profile the instance needs to conform to).</p>\n<p>The only problem I see with this is that derived profiles are unable to \"unflag\" elements if they don't support them. But the more I think about it, the more I tend to agree with <span class=\"user-mention\" data-user-id=\"191318\">@nicola (RIO/SS)</span> that maybe derived profiles aren't such a good idea after all...</p>",
        "id": 153920782,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1511294042
    },
    {
        "content": "<p>Constraining the upper cardinality at all essentially says \"you must customize your interface to not send me data that I could freely ignore\".  So rather than constraining the upper cardinality to 1, instead define a mandatory \"must support\" slice, where the discriminator is sufficiently narrow to identify the repetition you care about from others that might reasonably be present.  Rather than constraining the upper cardinality to 0, just don't mark the element as supported.  Setting max to 0 should only be done if it's clearly an error (e.g. someone sending you a deceased date when you don't want to receive dead patients) or if you're in one of those rare circumstances where there's legal responsibility attached to allowing something past your front door that you later ignore/throw away.</p>",
        "id": 153920845,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1511304897
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> -  it sounds like we are pretty aligned on this, and yes, regarding derived/inheritance - <span class=\"user-mention\" data-user-id=\"191318\">@nicola (RIO/SS)</span> I won't say that it should be avoided, but I would say use it with extreme caution - just as you do when doing software development. Now, if we could only get something sneaked into the profiling tools (<span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> wink, wink) that would make it a little more cumbersome to ie. change cardinality to 0..0  or making derived profiles or put info boxes in the face of others doing so (telling them a little about the consequences of their actions), we could all avoid that specifiers accidentally make their profiles too strict and narrow for reusable purposes.</p>",
        "id": 153920951,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1511337306
    },
    {
        "content": "<p>Haha, you recognize that feeling?   I started typing that I totally disagreed, but while stating my arguments, realized you are actually right ;-)</p>",
        "id": 153921454,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1511523178
    },
    {
        "content": "<p><span class=\"emoji emoji-1f914\" title=\"thinking face\">:thinking_face:</span> ... I know it all too well ... <span class=\"emoji emoji-1f606\" title=\"laughing\">:laughing:</span></p>",
        "id": 153921460,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1511524408
    }
]