[
    {
        "content": "<p>Hi. Is it possible to exchange the definition of an operation? I mean the actual logic.</p>",
        "id": 153917302,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509623865
    },
    {
        "content": "<p>This: System A has an operation patient$predict_life_expectancy . Can System A tell system B \"the predict_life_expectancy is defined by looking up the birthdate in a valueset (horoscope) and subtracting the value of (doomsday) from today, and updating the patient's attributes accordingly\".</p>",
        "id": 153917303,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509623908
    },
    {
        "content": "<p>you need to look into the clinical reasoning module</p>",
        "id": 153917304,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1509624066
    },
    {
        "content": "<p>The one that seems closest is activitydefinition</p>",
        "id": 153917305,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509624337
    },
    {
        "content": "<p>(perhaps activityDefinition could be in the Clinical Reasoning)</p>",
        "id": 153917306,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509624377
    },
    {
        "content": "<p>you should look at CQL actually</p>",
        "id": 153917308,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1509625858
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> , <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  IMHO, this question seems closely related to the 6th (optional) REST constraint, described in Fielding's thesis::  </p>\n<p><strong>5.1.7 Code-On-Demand</strong></p>\n<p>The final addition to our constraint set for REST comes from the code-on-demand style of Section 3.5.3 (Figure 5-8). REST allows client functionality to be extended by downloading and executing code in the form of applets or scripts. This simplifies clients by reducing the number of features required to be pre-implemented. Allowing features to be downloaded after deployment improves system extensibility. However, it also reduces visibility, and thus is only an optional constraint within REST.</p>",
        "id": 153917417,
        "sender_full_name": "Thomas Lukasik",
        "timestamp": 1509650542
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>, I'd second Grahame's recommendation. A CQL library that describes the logic would support sharing the behavior. Sharing the way that you want to evaluate it is something that would be done with PlanDefinition.</p>",
        "id": 153918923,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510347657
    }
]