[
    {
        "content": "<p>I'm not sure I understand the meaning of StructureDefinition.derivation.<br>\n<a href=\"http://build.fhir.org/structuredefinition-definitions.html#StructureDefinition.derivation\" target=\"_blank\" title=\"http://build.fhir.org/structuredefinition-definitions.html#StructureDefinition.derivation\">http://build.fhir.org/structuredefinition-definitions.html#StructureDefinition.derivation</a></p>\n<p>The Spec says \"If the definition is a specialization, then it adds new elements in the differential, and the snapshot includes the inherited elements.<br>\nIf the definition is a constraint, then it can not define new elements, it can only make new rules about existing content \"<br>\nAm I not always constaining, even if I add new elements? To me that would mean adding an extension, which in turn is a constraint on one slice of the base resource's extensions.</p>\n<p>What is the significance/consequence of either choice?</p>",
        "id": 153926209,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1513689044
    },
    {
        "content": "<p>Also: which one is the correct choice when defining an extension?</p>",
        "id": 153926211,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1513689094
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>, derivation=\"specialization\" indicates core resource &amp; datatype definitions. Such StructureDefinitions are allowed to introduce new elements. Derivation=\"constraint\" is for defining a profile on a core resource/datatype and for defining an extension definition (= constraint on core Extension).</p>",
        "id": 153926237,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1513696551
    },
    {
        "content": "<p>Ok, thanks. So the only place in Forge where derivation=specialisation would make sense is when defining a LogicalModel, right?</p>",
        "id": 153926238,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1513696626
    },
    {
        "content": "<p>Constraint is the default in Forge and I realized only today, that you can actually change that ;-)</p>",
        "id": 153926239,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1513696668
    },
    {
        "content": "<p>Correct, Logical models are considered to be \"specializations\" and are allowed to introduce new elements.<br>\nNote that in theory, FHIR could also allow \"derived\" logical models with derivation=constraint, based upon another logical model. However I deliberately decided not to support this in Forge initially, until the community starts asking for this feature.<br>\nIt doesn't make sense for the end user to change the derivation value. I'll make a note to display the derivation property value as read-only.</p>",
        "id": 153926251,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1513699141
    }
]