[
    {
        "content": "<p>Is any constraint that I should take in account when an element is sliced by value set binding ? <br>\nFor example, is it expected that all the bindings used in the slices are \"required\" bindings,  or at least one shall be required  or it might be any kind of binding (preferred, example,...).</p>",
        "id": 154023218,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1544031372
    },
    {
        "content": "<p>If the binding is not required, there are no syntactic limits to what is valid, so everything is in the slice, and it will overlap with any other slices that you define.</p>",
        "id": 154023352,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1544057242
    },
    {
        "content": "<p>Right.  That makes sense and that's what we've observed.  I think there are two basic ways to handle this.  One is to apply the preferred (or other not required) binding at the root level where the slicing is declared, where it serves de facto as the \"default\", and then there is a specific named slice with the required binding and an open slicing rule.  The second way is similar, but treats the two bindings as siblings - there is again the specific named slice with the required binding and then the additional slice with the preferred (or other not required) binding is the named '@default' slice with a closed slicing rule.  Logically I think that both of those should work.  What I haven't yet been able to accomplish is getting either of those approaches to be able to successfully recognize the slices and validate example data using them.  I keep getting lots of \"This element does not match any known slice for the profile\" information messages and various combinations of warnings and errors on the slicing validation with the various permutations.  If anyone has successfully done this and has the specific discriminator type and path and slice path syntaxes that worked, that would be helpful to see.</p>",
        "id": 154023444,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1544096328
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>, interesting, thanks for sharing. I assume that you're using the HAPI Java validator classes - or did you also try the .NET validator by chance?</p>",
        "id": 154024041,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1544439422
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>.  I didn't try the .NET validator, but that's a good suggestion.  I'll see about giving that a try in my Windows VM environment (I haven't actually used it before).</p>",
        "id": 154024053,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1544446811
    },
    {
        "content": "<p>FYI Ewout has created a simple GUI for the validator:<br>\n<a href=\"https://github.com/ewoutkramer/Furore.Fhir.ValidationDemo\" target=\"_blank\" title=\"https://github.com/ewoutkramer/Furore.Fhir.ValidationDemo\">https://github.com/ewoutkramer/Furore.Fhir.ValidationDemo</a><br>\nNote: the .NET API is available for FHIR DSTU2 and STU3; However R4 branch is still under development and R4 validator is not yet available.</p>",
        "id": 154024072,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1544451329
    },
    {
        "content": "<p>Yes, I was thinking that R4 isn't yet supported and was going to ask you to verify that for the validator, so thanks.  We are using R4, so I guess we'll need to wait a bit for that.</p>",
        "id": 154024099,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1544457360
    },
    {
        "content": "<p>I'm currently working on updating the snapshot generator in the .NET FHIR API library to R4. Once finished, we can update the validator tool.</p>",
        "id": 154024476,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1544546889
    },
    {
        "content": "<p>Sounds great.  What's the timeline?</p>",
        "id": 154024477,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1544546944
    },
    {
        "content": "<p>I hope to get something out of the door before Christmas.</p>",
        "id": 154024478,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1544547182
    },
    {
        "content": "<p>have you looked at the test cases for the java snapshot generator?</p>",
        "id": 154024634,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544565490
    },
    {
        "content": "<p>Have we addressed this yet?  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Do you have a pointer for the test cases (you can probably get to the right place quicker than I would)?</p>",
        "id": 157726931,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1549487791
    },
    {
        "content": "<p><a href=\"https://github.com/hapifhir/org.hl7.fhir.core/blob/master/org.hl7.fhir.r4/src/main/resources/snapshot-generation-tests.xml\" target=\"_blank\" title=\"https://github.com/hapifhir/org.hl7.fhir.core/blob/master/org.hl7.fhir.r4/src/main/resources/snapshot-generation-tests.xml\">https://github.com/hapifhir/org.hl7.fhir.core/blob/master/org.hl7.fhir.r4/src/main/resources/snapshot-generation-tests.xml</a></p>",
        "id": 157738684,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1549497340
    }
]