[
    {
        "content": "<p>Dear community, <br>\nsorry if my question is quite simple, I just want to confirm my theory or have it contradicted:</p>\n<p>I'm in the area of nursing summaries. There I have nursing problems, nursing goals, and nursing procedures. For them I can use classifications, e.g. NANDA &amp; NIC, ICNP, LEP, and SNOMED CT. In our nursing summary  we currently don't restrict to one classification but leave it open to the IT systems. Therefore we have no constraints to cardinality etc. </p>\n<p>My theory now is: If I profile this in Forge and want to tell people which <code>system</code> should be used in which context (e.g. <code>urn:oid:2.16.840.1.113883.6.97</code> for ICNP) I have the following options:</p>\n<ol>\n<li>make an open slice, add slices for each CodeSystem, and set codeSystem to a fixed value,</li>\n<li>profile Coding for each CodeSystem, make an open slice, slice for each CodeSystem, and reduce the type to the corresponding Coding, or</li>\n<li>profile Coding for each CodeSystem and add them as Profiles for the Type(s),<br>\nand these options are equivalent to each other, as no more constraints are made.<br>\nAm I right</li>\n</ol>\n<p>One minor drawback of 1. would be that if I get a CanonicalURL for one these classifications, I would have to look at each resource. Using Coding-profiles would just mean changing one profile.</p>\n<p>And before someone tells me: I know that Canonicals are preferred to OIDs, but as I do only have OIDs for most of the classifications, this is better than nothing. Those who have canonicalURLs are invited to contribute to <a href=\"#narrow/stream/179202-terminology/topic/canonicals.20for.20classifications.20of.20nursing.20interventions\" title=\"#narrow/stream/179202-terminology/topic/canonicals.20for.20classifications.20of.20nursing.20interventions\">https://chat.fhir.org/#narrow/stream/179202-terminology/topic/canonicals.20for.20classifications.20of.20nursing.20interventions</a>. <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 190086410,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1583770307
    },
    {
        "content": "<p>I think #1 is likely to be the most straightforward and understandable, based on how I'm reading your descriptions.  It's a little unclear to me how you are envisioning that #2 and #3 would look using the multiple profiles on Coding.  Maybe you could share some examples?</p>",
        "id": 190088395,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1583771208
    },
    {
        "content": "<p>Creating profiles for each Coding is a lot of extra effort/maintenance, and the effect wouldn't be any different, so option #1 would be preferred.</p>\n<p>Note: would strongly recommend submitting a change request asking for a URL for ICNP rather than going with urn:oid.</p>",
        "id": 190106234,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583781032
    },
    {
        "content": "<p>Thanks for your replies. <br>\nAs you, <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>, asked for examples: <br>\nFor #2 an example would be <a href=\"https://simplifier.net/germanenursingsummary/gensnursingprocedure\" target=\"_blank\" title=\"https://simplifier.net/germanenursingsummary/gensnursingprocedure\">https://simplifier.net/germanenursingsummary/gensnursingprocedure</a>.<br>\nFor #3 an example would be <a href=\"https://simplifier.net/germanenursingsummary/gensnursingproblem\" target=\"_blank\" title=\"https://simplifier.net/germanenursingsummary/gensnursingproblem\">https://simplifier.net/germanenursingsummary/gensnursingproblem</a>.</p>\n<p>In the corresponding implementation guide we now have #2 and #3, and I would like to reduce it to one option.</p>\n<p>Also please note for the <code>urn:oid</code>part: I know that the use of <code>urn:oid</code>should be avoided, that's why  I started the topic linked above. There I wrote that I submitted a change request. This request is currently waiting to be processed.</p>",
        "id": 190115517,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1583786481
    }
]