[
    {
        "content": "<p>Hey,</p>\n<p>i faced the problem of transporting a fixed text in a composition.section. Using text.div was my first idea, but i can not enter it as a fixed value. Is this correct or is this a forge bug?</p>\n<p>greetings Max</p>",
        "id": 185116994,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1578494265
    },
    {
        "content": "<p>Hello Max,<br>\nI think that is not a bug, but correct behaviour: text.div is a xhtml, and the xhtml-text is not an attribute, as it is content, which summarizes the section.<br>\nI ask myself if constraining the text of a section to a fixed value makes sense. Could you describe your use case a little bit more, perhaps another field fits better.<br>\nGreetings Mareike</p>",
        "id": 185119578,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1578495688
    },
    {
        "content": "<p>Composition.section.text is not XHTML.  It's markdown and it should be possible to set it to a fixed value.  It should also be possible to set even DomainResource.text to a fixed value.</p>",
        "id": 185125881,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578498686
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/composition-definitions.html#Composition.section.text\" target=\"_blank\" title=\"http://build.fhir.org/composition-definitions.html#Composition.section.text\">Composition.section.text</a> is of type Narrative, and in Narrative the div is of type xhtml, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> why should it be markdown?</p>",
        "id": 185131202,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1578501769
    },
    {
        "content": "<p>That's what I get for replying without double-checking the spec.  You're right, it's XHTML.  We haven't talked about how to do fixed or default values for that.  Best thing to do is probably submit a change request to have us clarify.  But I do think having fixed text for certain divs is a reasonable requirement.  Having certain sections in a document that contain boiler-plate narrative is a pretty common practice.</p>",
        "id": 185132524,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578502552
    },
    {
        "content": "<p>thanks, <span aria-label=\"cold sweat\" class=\"emoji emoji-1f630\" role=\"img\" title=\"cold sweat\">:cold_sweat:</span> i was already afraid i have to convert cda markup to markdown</p>",
        "id": 185133620,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1578503103
    },
    {
        "content": "<p>Sounds reasonable to allow fixed values here for a certain set of use cases, e.g. having a certain legally required text within a FHIR document.<br>\nAlso, while <span class=\"user-mention\" data-user-id=\"196115\">@Mareike Przysucha</span> has a point in case of the XML representation, there is basically no difference between attribute and content in the JSON representation (regarding XHTML content of div).</p>",
        "id": 185137496,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1578505394
    },
    {
        "content": "<blockquote>\n<p>But I do think having fixed text for certain divs is a reasonable requirement.  Having certain sections in a document that contain boiler-plate narrative is a pretty common practice.</p>\n</blockquote>\n<p>+1 from me</p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Who should submit the change request? Did you submit already?</p>",
        "id": 185188401,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1578553798
    },
    {
        "content": "<p>I have not.  As the proponent of the change, I'd encourage you to do so.  (One of my objectives with this community is to get as many people as possible in the practice of submitting changes - the immediate benefit is that the person with the immediate/pressing need will automatically be able to monitor the conversation as it occurs.  The longer-term benefit is that the more people who feel empowered to propose changes, the more and better feedback we'll get and the more useful the resulting specification will be.)</p>\n<p>To submit a change request, just click on the 'propose a change' link at the bottom of any page in the spec.  If you run into an issue, holler  :)</p>",
        "id": 185189762,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578555906
    },
    {
        "content": "<p>OK...I will do that</p>",
        "id": 185217607,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1578581056
    }
]