[
    {
        "content": "<p>When validating L01XE14 against <a href=\"http://tx.fhir.org\">tx.fhir.org</a> (via the java validator)this error is shown:</p>\n<div class=\"codehilite\"><pre><span></span><code>Terminology server: Check for supported code systems for http://www.whocc.no/atc\n   error: The code &quot;L01XE14&quot; is not valid in the system http://www.whocc.no/atc; The code provided (http://www.whocc.no/atc#L01XE14) is not  valid in the value set All codes known to the system for &quot;http://www.whocc.no/atc#L01XE14&quot;````\nDoes the ATC CS need an update?\n</code></pre></div>",
        "id": 197857522,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1589733685
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 197863589,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589741614
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> There are two issues here.  The first is that <a href=\"http://tx.fhir.org\">tx.fhir.org</a> currently is supporting only a \"by request\" subset of the ATC codes, because we don't have ready access to a full ATC distribution (we essentially have to get the codes one by one from the WHO ATC browser).  The 'L01XE14' code hasn't previously been requested and so is not currently in the package containing the codes that will be supported.  I can add it, along with any other codes that you may want to request to be supported, and that will take care of the first issue (for now, until we find a way to get a complete distribution).  The second issue, though, is that the latest package updates that have already been made aren't yet showing up on the <a href=\"http://tx.fhir.org\">tx.fhir.org</a> server.  I've been discussing that with <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and hopefully we'll have that solved soon.</p>",
        "id": 197864625,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1589743060
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <br>\nFor a chilean project, some years ago, we just bought ATC Excel Sheets from the WHO, would this help?</p>",
        "id": 197897753,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1589786193
    },
    {
        "content": "<p>if it's not illegal for you to give them to us, very much so</p>",
        "id": 197904525,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589790734
    },
    {
        "content": "<p>Yes, agree with <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> on that, <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>.  My biggest question/concern with that, of course, is once we have the full set of codes (if that is an option), what will we do for ongoing maintenance and updates?  Having everything in an older version without access to the current source and future updates would actually make us less flexible in being able to respond to requests for new codes.  If we are able to maintain multiple versions (which I suspect we can't do at the moment?), some with full content and others possibly partial, that might work - sort of - but overall it might also be too complicated and messy.  It's definitely a dilemma.</p>",
        "id": 197931174,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1589807221
    },
    {
        "content": "<p>don't understand this - loading all the content of an older version as well as everything else we have will be better than not doing it?</p>",
        "id": 197980447,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589828123
    }
]