[
    {
        "content": "<p>Somewhere along the line, I got the idea that constraint keys should be globally unique across an IG.  But I noticed in US Core that <code>us-core-1</code> is defined differently in multiple profiles -- so it obviously is <em>not</em> globally unique within the IG.  Looking at the doc, I see that it only guarantees uniqueness within a single Structure Definition.</p>\n<p>Because FSH treats invariants as 1st-class objects, however, their names (which correspond to <code>ElementDefinition.constraint.key</code>) are globally unique.  So in FSH right now, it is impossible to re-use the same constraint key across multiple profiles (except when you also want the definition of the constraint to be the same -- which is actually a good feature for re-use).</p>\n<p>Is it a best practice to have globally unique constraint keys (with <em>different</em> definitions), or is this something that we shouldn't care about and should allow to happen easily in FSH?</p>",
        "id": 213082103,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1602534091
    },
    {
        "content": "<p>The key is referring to something within the StructureDefinition.  There's no ability to point to a constraint independent of model, so enforcing uniqueness wouldn't accomplish much.  Also note that if a model inherits an invariant from a StructureDefinition defined in another IG, you can't use that key in your refined model, even though it might not appear elsewhere in the current IG.</p>",
        "id": 213089228,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602538881
    },
    {
        "content": "<p>I think it's fine if FSH doesn't support that</p>",
        "id": 213092997,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602542251
    },
    {
        "content": "<p>From an authoring perspective since there is no global invariant index (that I know of). The simplest approach was to increment within an SD.</p>",
        "id": 213229630,
        "sender_full_name": "Eric Haas",
        "timestamp": 1602631209
    },
    {
        "content": "<p>Incrementing within an SD isn't terribly future-proof.  (If a new invariant gets added in the base, you're faced with renumbering your invariants.)  It's better if you use a different prefix in the derived model than the parent model.  You only have to worry about being unique within the inheritance tree.</p>",
        "id": 213237544,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602638747
    },
    {
        "content": "<p>BTW -- after further review, I see I mis-spoke above.  I said that keys need only be unique within the SD, but actually, eld-14 (<code>constraint.select(key).isDistinct()</code>) only enforces uniqueness within the constraint array of an element.  So it's even possible to have duplicate keys within an SD as long as they're not in the same element.  Seems like a bad idea to me, but technically it is allowed.</p>",
        "id": 213281056,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1602678733
    }
]