[
    {
        "content": "<p>Does anyone know how to update a ValueSet from STU3 to R4 in Simplifier? I've changed the Project properties to R4, updated the dependencies but the ValueSet still shows up as STU3, even after updating it. So far, only deletion and re-upload worked. Is there an easier way?</p>",
        "id": 172126115,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1564578974
    },
    {
        "content": "<p>Same for ImplementationGuide...</p>",
        "id": 172128151,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1564580520
    },
    {
        "content": "<p>No. For 'regular' resources, there is no easier way than to upload a new version. Not knowing your use-case, generally it's good practice to have only one FHIR version per project.</p>",
        "id": 172131343,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1564582761
    },
    {
        "content": "<p>Implementation Guides are a special case.</p>",
        "id": 172131353,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1564582770
    },
    {
        "content": "<p>Use case is: I want to \"flip\" a FHIR-Project from STU3 to R4 :)</p>\n<p>BTW: Deleting and Re-Uploading the IG resource has worked for me. The only thing left now is all the Binaries that are still STU3. I'm just too lazy to reupload all of them. The R4 IG apparently doesn't mind... ;-)</p>",
        "id": 172131802,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1564583075
    },
    {
        "content": "<p>Interesting. Let me think if I can help you there.</p>",
        "id": 172131859,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1564583128
    },
    {
        "content": "<p>Maybe we should hide the FHIR version of images alltogether... Since it has no meaning.</p>",
        "id": 172131969,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1564583173
    },
    {
        "content": "<p>Hi Simone, as a quick and dirty workaround, you can download a ZIP file with all resources in the existing STU3 project, then create a new (separate) R4 project and import the ZIP file.</p>",
        "id": 172131976,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1564583176
    },
    {
        "content": "<p>I was thinking about that, but I was worried about losing the url key where the IG is presently published... I want everything to stay right where it is :)</p>",
        "id": 172133825,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1564584368
    },
    {
        "content": "<p>Do you? Assuming that you previously published an IG on STU3, then this document should remain available on the same url. A new IG version for R4 represents a separate resource and should be published on a new url.</p>",
        "id": 172135140,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1564585269
    },
    {
        "content": "<p>Note: you can always edit the homepage of the existing STU3 IG and manually add hyperlinks to new versions, e.g. for FHIR R4. Similar to how Grahame publishes the HL7 ballotable IGs.</p>",
        "id": 172135266,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1564585346
    }
]