[
    {
        "content": "<p>so I'm thinking of changing strategy with regard to the validator</p>",
        "id": 153844545,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471778713
    },
    {
        "content": "<p>at the moment, there is a validator for each version of the spec</p>",
        "id": 153844546,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471778728
    },
    {
        "content": "<p>I'm thinking of folding the validator into the IG publisher, and having only one, that does version 1.4.0, 1.6.0 and current. </p>",
        "id": 153844547,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471778782
    },
    {
        "content": "<p>I think that this is largely my interest as the maintainer of the various forks. </p>",
        "id": 153844548,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471778833
    },
    {
        "content": "<p>but I'm interested to see if there's any opinions about this that influence my thinking</p>",
        "id": 153844549,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471778863
    },
    {
        "content": "<p>I have been thinking about this too, as I am working on the .NET validator at the moment.  The validator does use the StructureDefinition POCO as input for the definition (but not for the instance data), so you either need to have multiple versions of the POCO around, or not use poco's at all (not even for the definition).   Which means you'd have to write your code for equality, ordering, cloning of the basic FHIR types again for the types you;'re going to use internally in your validator.</p>\n<p>Or have a set of STU3 StructureDefinitions that define the DSTU2 resources, so it's just a STU3 validator downgrading to DSTU2.</p>",
        "id": 153844599,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1471867304
    },
    {
        "content": "<p>I use elementmodel entirely for the validator, so the only POCO I need is the current conformance ones</p>",
        "id": 153844605,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471870970
    },
    {
        "content": "<p>ok, as of now, the validators in versions 1.4.0 and 1.6.0 (May and Sept ballots respectively) are no longer supported. They're still going to be there (balloted content and all) but anyone who reports any issues with them will be told to use the validator in the current build (which supports validating for those versions)</p>",
        "id": 153844710,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471916599
    }
]