[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> - do we have any open vocab issues that need resolving before ballot? </p>",
        "id": 153830330,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464393929
    },
    {
        "content": "<p>I'm not sure that we do, but I should check - I'll do that</p>",
        "id": 153830331,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1464393996
    },
    {
        "content": "<p>the only one that I see that's currently open is #10018 - Use v2/v3 aligned vocab for [Patient.]gender<br>\nI'll think if there are tracker items that we should add and get taken care of </p>",
        "id": 153830332,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1464394513
    },
    {
        "content": "<p>10018 is a question for PA not vocab, no?</p>",
        "id": 153830335,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464396208
    },
    {
        "content": "<p>Vocab methodology says PA isn't allowed to - all \"code\"-bound elements must use FHIR-defined vocabularies.  The policy is a Vocab issue.</p>",
        "id": 153830341,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464397136
    },
    {
        "content": "<p>well, there's 3 questions: alignment - which is not disallowed, using the same codes, and actual direct use of the code system. Only #3 is disallowed</p>",
        "id": 153830344,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464397367
    },
    {
        "content": "<p>I'm thinking about how we should decide this - PA (at least representation from the WG) has the specific desire for alignment (which we would generally agree with, I think) and owns the resource<br>\nthe particular policy regarding a 'code'-bound element is a FHIR methology issue (FHIR-I and/or MnM?) - and I'm not thinking that Vocab WG likely ever has specifically endorsed this? or has the authority to change it?</p>",
        "id": 153830357,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1464401978
    },
    {
        "content": "<p>no it was a joint decision with vocab in Paris. Wed Q1</p>",
        "id": 153830371,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464435484
    },
    {
        "content": "<p>I don't think we'll quickly change our mind, but PA can change the codes and thir values. I'm not in favour of changing male to M at this stage in the game for a very few people who haven't begun to look at the v2 -&gt; FHIR process</p>",
        "id": 153830372,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464435536
    },
    {
        "content": "<p>ok, makes sense - your memory on it is clearly much better than mine :)<br>\nso it sounds like it should go back to PA, then<br>\nand I agree - I'm not in favor of making that change</p>",
        "id": 153830382,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1464441254
    },
    {
        "content": "<p>I'm not keen to change from the current values either.</p>",
        "id": 153830472,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1464571533
    }
]