[
    {
        "content": "<p>I found a subtle bug in my validator, that I think is of interest to a broader audience.</p>\n<p>My base assumption is that the snapshot is always complete. To be more precise, I have an assumption in my validator that if an element has children in a StructureDefinition, it has all of the children for that element.  E.g. although in a differential you would just have Patient.name.family, the snapshot would have all the other siblings (like given) too.  That seemed a fair assumption, until I met a profile that constrained  Bundle.entry.resource.Meta. </p>\n<p>This highlighed a problem: the snapshot generator only knows that Bundle.entry.resource is of type Resource, so while walking into this element, it will expand it and add the elements of Resource under Bundle.entry.resource. However, in a real instance Bundle.entry.resource will contain more elements than those of Resource (say, <a href=\"http://Patient.name\" target=\"_blank\" title=\"http://Patient.name\">Patient.name</a>). Since my validator assumes a snapshot is \"complete\", it will now complain about the extra elements (all of them - except the ones from Resource) found in the instance.</p>\n<p>It's not insurmountable, but I thought I'd share the fact that snapshots are thus \"mostly complete\", but need some extra intelligence when dealing with \"contained\", Bundle.entry.resource and Parameters.parameter.resource, and maybe others.</p>",
        "id": 153896010,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1499160655
    },
    {
        "content": "<p>Make sure you add a test-case to the shared test cases :)</p>",
        "id": 153896023,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499182223
    },
    {
        "content": "<p>Great find!</p>",
        "id": 153896047,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1499232746
    },
    {
        "content": "<p>under what conditions does the snapshot generator walk into Bundle.Entry.resource?</p>",
        "id": 153896050,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499233368
    },
    {
        "content": "<p>Noted!</p>",
        "id": 153896205,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1499353005
    },
    {
        "content": "<p>You walk into it when you add constraints to Bundle.entry.resource.meta or Bundle.entry.resource.profile for example....</p>",
        "id": 153896206,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1499353055
    },
    {
        "content": "<p>(esoteric, ok, but possible)</p>",
        "id": 153896207,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1499353067
    },
    {
        "content": "<p>I don't even know what the java snapshot generator will do in that case</p>",
        "id": 153896328,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499427762
    }
]