[
    {
        "content": "<p>Hello, I'm currently creating a Patient profile derived on nl-core-patient, to specify our data requirements.<br>\nI've run into an issue while trying to specify the Patient's hospital record number, (UPN).</p>\n<p>The nl-core-patient profile slices the Patient.identifier on <strong>system</strong>. <br>\nWe can't define a system, since patients will belong to multiple hospitals, their UPN's will be defined by multiple systems for multiple hospitals.</p>\n<p>We had thought to instead create a slice that enforces the identifier.type and maybe also identifier.use.<br>\nHowever, we cannot add this slice, due to Patient.identifier already being sliced on its system.<br>\nWhen I try to instead reslice the @default slice, the official validator doesn't recognise @default as a slice-name, and 'system' is still being enforced.</p>\n<p>Does anyone know a good way to deal with this situation?<br>\nAm I perhaps best off creating a new profile, and not deriving from nl-core-patient instead?</p>",
        "id": 249711721,
        "sender_full_name": "Maurice Mulder",
        "timestamp": 1629203890
    },
    {
        "content": "<p>Hi Maurice!</p>\n<p>I believe you can add another slice to the <code>Patient.identifier</code> in a derived profile on nl-core-patient and add another discriminator based on the <code>.identifier.type</code> and/or <code>.identifier.use</code>. </p>\n<p>Edit: ah no, this will likely not work because the validator will not be able to match the instance against the added slice definition because it has no fixed system. Let me think...</p>",
        "id": 249828544,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1629280897
    },
    {
        "content": "<p>What kind of requirements/constraints to the added slice do you want to make? Do you want to enforce that the UPN is always given for example?</p>",
        "id": 249829444,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1629281463
    },
    {
        "content": "<p>Any additional hospital identifier will at least have a system, will it not? The current slicing is open, so you can do whatever you want. The only slice that matches the BSN slice, is one that matches the BSN system.</p>\n<p>If you don't know ahead which systems these hospitals will use, then there is no useful replacing it seem. Presumably if all you want is to say: require type and use, then an invariant could be useful?</p>\n<p><a href=\"https://simplifier.net/nictizstu3-zib2017/nl-core-patient\">https://simplifier.net/nictizstu3-zib2017/nl-core-patient</a> (for reference)</p>",
        "id": 249830614,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1629282340
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192301\">Ardon Toonstra</span> <a href=\"#narrow/stream/179181-netherlands/topic/Reslicing.20Identifiers.20on.20.20nl-core-patients/near/249829444\">said</a>:</p>\n<blockquote>\n<p>What kind of requirements/constraints to the added slice do you want to make? Do you want to enforce that the UPN is always given for example?</p>\n</blockquote>\n<p>Exactly, I want the implementer to know I need 1 UPN, and I want to make explicit how I select it.</p>",
        "id": 249836579,
        "sender_full_name": "Maurice Mulder",
        "timestamp": 1629286854
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191375\">Alexander Henket</span> <a href=\"#narrow/stream/179181-netherlands/topic/Reslicing.20Identifiers.20on.20.20nl-core-patients/near/249830614\">said</a>:</p>\n<blockquote>\n<p>Any additional hospital identifier will at least have a system, will it not? The current slicing is open, so you can do whatever you want. The only slice that matches the BSN slice, is one that matches the BSN system.</p>\n<p>If you don't know ahead which systems these hospitals will use, then there is no useful replacing it seem. Presumably if all you want is to say: require type and use, then an invariant could be useful?</p>\n<p><a href=\"https://simplifier.net/nictizstu3-zib2017/nl-core-patient\">https://simplifier.net/nictizstu3-zib2017/nl-core-patient</a> (for reference)</p>\n</blockquote>\n<p>Yes, I don't know the UPN's system ahead of time, but I wanted to create a UPN slice to indicate it is mandatory.</p>\n<p>The underlying requirement is: I need a Patient UPN to be communicated to me, the system will be different for each hospital sending me data.</p>\n<p>I'm sort of looking for a best practice here. How should I ask my implementers (via profiling) to indicate to me (in the data) which identifier is the UPN I should use?</p>\n<p>Am I perhaps better of (incrementally) putting the hospital's UPN systems in a value-set, and slice the UPN with a binding on that?<br>\nShould I just set the Identifier to be ordered, and specify that I will use the first non-BSN identifier?</p>",
        "id": 249837681,
        "sender_full_name": "Maurice Mulder",
        "timestamp": 1629287591
    },
    {
        "content": "<p>Without adding a slice in the derived profile you could:</p>\n<ul>\n<li>make <code>identifier</code> 1..* or 2..* depending on if you also require a BSN</li>\n<li>potentially add an invariant on the <code>identifier</code>slice to state that you require an identifier that is not a BSN, something like <code>identifier.where(system != 'http://fhir.nl/fhir/NamingSystem/bsn').exists()</code>The invariant can become as complex as you want, in order to determinate that a certain identifier exists.</li>\n<li>describe your requirements of the UPN identifier on the root <code>identifier</code></li>\n</ul>\n<p>Or you could make a slice for the UPN to document your requirements. This will however only work for documentation purposes and accept that it cannot be used for validation purposes because the instance cannot be matched to the added slice.<br>\nBinding a ValueSet with possible systems to <code>identifier.system</code> will mitigate this problem. The binding does however need to be of required strength for the validator to work. So with every addition of a system, you will need to update the ValueSet.</p>\n<p>I am not a big fan of making it an ordered slicing. I believe this is not a common practice, you won't get any validation out of it in this case, and you won't be able to add another slice in the profile anyway. I would rather work with the identifier cardinalities and invariants, or slice with bound ValueSet.</p>",
        "id": 249870594,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1629302031
    },
    {
        "content": "<p>Thanks a lot Ardon (as well as Alexander)! Using a complex invariant in this way makes a<br>\n lot of sense (and I think it's been mentioned above before as well.)<br>\nI suppose I got stuck on the idea of having a slice for the UPN per-se. Thanks for your detailed explanations.</p>",
        "id": 250326619,
        "sender_full_name": "Maurice Mulder",
        "timestamp": 1629709429
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"312458\">Maurice Mulder</span> has marked this topic as resolved.</p>",
        "id": 250461396,
        "sender_full_name": "Notification Bot",
        "timestamp": 1629797569
    }
]