[
    {
        "content": "<p>Hi all. After talks with ZorgDomein and earlier talks with other parties today we, Nictiz/MedMij reached some conclusions that I feel are helpful to share here. We'll be coming back on that next week during the WGM NL as well:<br>\n.<br>\nWe anticipate FHIR to take off in The Netherlands on STU3. STU3 became a fact today at <a href=\"http://hl7.org/fhir\" target=\"_blank\" title=\"http://hl7.org/fhir\">http://hl7.org/fhir</a>. Now that STU3 is live with some last minute polishing going on, it is time for the tools to update. Furore has posted a roadmap for that here <a href=\"https://thefhirplace.com/2017/03/02/simplifier-and-forge-migration-to-stu3/\" target=\"_blank\" title=\"https://thefhirplace.com/2017/03/02/simplifier-and-forge-migration-to-stu3/\">https://thefhirplace.com/2017/03/02/simplifier-and-forge-migration-to-stu3/</a><br>\n.<br>\nFor the first rounds of profiling and to accomodate pilots/kickstarts we have been working on DSTU2. The result of that may be found on Simplifier: <a href=\"https://www.simplifier.net/NL-BasicComponents\" target=\"_blank\" title=\"https://www.simplifier.net/NL-BasicComponents\">https://www.simplifier.net/NL-BasicComponents</a> and <a href=\"https://www.simplifier.net/Nictiz\" target=\"_blank\" title=\"https://www.simplifier.net/Nictiz\">https://www.simplifier.net/Nictiz</a>.<br>\n.<br>\nTheoretically we could start on STU3 profiling when Forge and Simplifier are ready. But that would be May 6 if the roadmap turns out to be accurate. This is difficult to wait for for ZorgDomein, but likely also for IKNL, potentially for people working on preparations for VIPP and what not. So we want to work ahead and this appears possible with a little help of <a href=\"http://github.com\" target=\"_blank\" title=\"http://github.com\">github.com</a>.<br>\n.<br>\nAs of today we'll feverishly be working on getting our development onto GitHub: <a href=\"https://github.com/Nictiz\" target=\"_blank\" title=\"https://github.com/Nictiz\">https://github.com/Nictiz</a>. Here you'll find 4 repositories NL-BasicComponents (DSTU2 / STU3) and MedMij (DSTU2 / STU3). The idea is this:<br>\n.<br>\n- Development/maintenance is fully out in the open on github (we worked in a closed environment before). This gives you all other features you may or may not already work with such as cloning, pull requests etc.<br>\n- A webhook allows publication of changes from github projects to be pushed to Simplifier allowing for assurance that profiles continue to be published as agreed upon. We have no intention of making any change how in we use Simplifier<br>\n- The STU3 repositories on GitHub allow for cutting edge access to these profiles. As soon as Simplifier is ready for it, we'll be publishing those there too<br>\n.<br>\nSome things are not yet worked out. Versioned canonical URLs, specific slicing issues and maybe more as we go, but we really hope to serve the community better by being as open as possible in every step. Input welcome.<br>\n<span class=\"user-mention\" data-user-id=\"191800\">@Ben Schrijver</span>, <span class=\"user-mention\" data-user-id=\"192814\">@Theo Stolker</span>, <span class=\"user-mention\" data-user-id=\"192440\">@Marc de Graauw</span>, <span class=\"user-mention\" data-user-id=\"191334\">@Marten Smits</span>, <span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span>, <span class=\"user-mention\" data-user-id=\"191437\">@Arianne van de Wetering</span>, <span class=\"user-mention\" data-user-id=\"192753\">@Melle Sieswerda</span></p>",
        "id": 153879235,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1490214356
    },
    {
        "content": "<p>Great job on getting things in motion this fast, thanks!</p>",
        "id": 153879238,
        "sender_full_name": "Ben Schrijver",
        "timestamp": 1490215399
    },
    {
        "content": "<p>+1</p>",
        "id": 153879852,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1490607152
    },
    {
        "content": "<p>I forked <a href=\"https://github.com/Nictiz/NL-BasicComponents-STU3\" target=\"_blank\" title=\"https://github.com/Nictiz/NL-BasicComponents-STU3\">https://github.com/Nictiz/NL-BasicComponents-STU3</a>, uploaded STU3 compliant versions and created a pull request. What I haven't done is create fhirpath for constraints. Of course, the decisions needed like canonical URL's, it's just my take, but this should be a decent start for discussion at the WGM.</p>",
        "id": 153879853,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1490607612
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192440\">@Marc de Graauw</span> I've merged your pull request into the master and done initial validation/updates. Marten and Ardon are working on checking/adding the fhirpath expressions (HumanName | Address). They might run into more things I missed. Thanks a Bundle!</p>",
        "id": 153879889,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1490617488
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191421\">@Michael van der Zel</span>  This morning I restructured the MedMij-DSTU2 repository and added Excel files containing mappings from the ZIBS to FHIR. Before creating the profiles these mappings were made to get an overview. They contain our notes and issues but these may be outdated and cannot be seen as complete. The profiles itself contain a mapping as well: the mapping element is populated with the ZIB’s concepts ID.   </p>",
        "id": 153880045,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1490689131
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span> Thanks. I will use that info for the MedMij ZIB Compliance check. TTY thursday / friday?!</p>",
        "id": 153880047,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1490690234
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span> I found the xlsx files. Great that mappings for DSTU2 and STU3 are in there, but is it not better to move the xls from the DSTU2 folder one level up?</p>",
        "id": 153880375,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1490860255
    }
]