[
    {
        "content": "<p>Hi all, </p>\n<p>My question is whether it's possible to constrain (elements in) a profile based on another profile rather than based on an element within the same profile?</p>\n<p>We are building a FHIR bundle for the DICA DHFA quality registry. In the DHFA registry, certain variables are only required when certain conditions are met. For example, the variable for complication only needs to be answered when the therapy variable has been answered as operative instead of conservative treatment. The therapy variable has been modelled in a Procedure profile derived from the zib-Procedure profile. The complication variable has been modelled in a Condition profile derived from the zib-Problem profile. </p>\n<p>I would now like to constrain whether the complication profile is provided based on the data provided within the procedure profile. How would I go about doing this? The documentation on FHIR Path (<a href=\"http://hl7.org/fhirpath/\">http://hl7.org/fhirpath/</a>) seems to only describe referencing elements within the same profile to build constraints.</p>\n<p>Best,<br>\nDavid</p>",
        "id": 250894663,
        "sender_full_name": "David Kijlstra",
        "timestamp": 1630049756
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"433986\">@David Kijlstra</span> ,<br>\nI think you will need to have some kind of resource/profile above these profiles that bundles and describes how to exchange the required information , for example a Bundle, List,  Composition, Questionnaire/QuestionnarieResponse or any other relevant resource that will reference both the Procedure and Condition profiles. In this profile, you can use the profile itself and FHIRPath to describe your business rules.</p>\n<p>Another option could be to describe it in plain old text in an implementation guide.  </p>\n<p>Does this help?</p>",
        "id": 251533629,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1630490531
    },
    {
        "content": "<p>Ah, I now read that you are doing this based on a Bundle! Very good. Let me try to give an example for how to use FHIRPath. You can use the resolve() function for references, but Bundle.entry.resource is not a reference :) but a resource straight away.</p>\n<p>The resolve() function is described by the FHIR spec itself: <a href=\"https://hl7.org/fhir/fhirpath.html#functions\">https://hl7.org/fhir/fhirpath.html#functions</a></p>",
        "id": 251533924,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1630490682
    },
    {
        "content": "<p>Here is an example on how to navigate into a specific resource in a Bundle, mind the where() and is() function. You can use the <a href=\"http://hl7.org/fhirpath/#types\">http://hl7.org/fhirpath/#types</a> functions to specify the resource type.</p>\n<blockquote>\n<p>Bundle.entry.resource.where(is(Binary).not()).where(meta.profile.empty()).empty()</p>\n</blockquote>",
        "id": 251534736,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1630491129
    },
    {
        "content": "<p>If you are crafting FHIRPath statements, I recommend using a FHIRPath tester :D (<a href=\"https://www.microsoft.com/en-us/p/fhirpath-tester/9nxv8qdq154v#activetab=pivot:overviewtab\">https://www.microsoft.com/en-us/p/fhirpath-tester/9nxv8qdq154v#activetab=pivot:overviewtab</a>)</p>",
        "id": 251535038,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1630491316
    }
]