[
    {
        "content": "<p>Hi All, I'm implementing an example application for the eOverdracht based on Nuts. Looking trough the documentation I noticed a few things:</p>\n<ul>\n<li>The Wiki (<a href=\"https://informatiestandaarden.nictiz.nl/wiki/vpk:V3.1_FHIR_eOverdracht#Example_instances\">https://informatiestandaarden.nictiz.nl/wiki/vpk:V3.1_FHIR_eOverdracht#Example_instances</a>) is linking to examples on simplifier, but there are none (yet?). These might be helpfull, so if anyone has any, an upload will be appreciated!</li>\n<li>There are a few typos in the Status docs of the eOverdracht Task profile. Is there a way of fixing these? The github repo (<a href=\"https://github.com/Nictiz/Nictiz-STU3-eOverdracht\">https://github.com/Nictiz/Nictiz-STU3-eOverdracht</a>) does not seems to be connected?</li>\n<li>The bottom link to this channel on this page (<a href=\"https://simplifier.net/nictiz-stu3-eoverdracht\">https://simplifier.net/nictiz-stu3-eoverdracht</a>) seems invalid (<a href=\"#narrow/stream/25-netherlands\">https://chat.fhir.org/#narrow/stream/25-netherlands</a>)</li>\n</ul>",
        "id": 247325610,
        "sender_full_name": "Steven van der Vegt",
        "timestamp": 1627388627
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"428849\">@Steven van der Vegt</span>,</p>\n<p>The page you're mentioning is an outdated version of the eOverdracht IG. The current version can be found here: <a href=\"https://informatiestandaarden.nictiz.nl/wiki/vpk:V4.0_FHIR_eOverdracht\">https://informatiestandaarden.nictiz.nl/wiki/vpk:V4.0_FHIR_eOverdracht</a></p>\n<p>That being said, it's true that examples are still MIA. The linked examples were removed from Simplifier because they were outdated, and new ones are not made yet for the eOverdracht profiles. For the individual zib profiles, examples can be found in the zib package (<a href=\"https://simplifier.net/nictizstu3-zib2017/~resources?category=Example&amp;sortBy=DisplayName_desc\">Simplifier</a>, <a href=\"https://github.com/Nictiz/Nictiz-STU3-Zib2017/tree/stable-2.x/Examples\">Github</a>).</p>\n<p>The Github project is actually linked to Simplifier, but you should use the <a href=\"https://github.com/Nictiz/Nictiz-STU3-eOverdracht/tree/eOverdracht4.0\">eOverdracht4.0 branch</a>. If you find any typos, please file a ticket in the <a href=\"https://bits.nictiz.nl/issues/?jql=project%20%3D%20EOVDR\">EOVDR-project of the BITS issue tracker</a> so change request are properly logged. If you'd like to accompany it with a pull request, that would be really awesome!</p>\n<p>I'll adjust the link on Simplifier, thanks for pointing this out.</p>",
        "id": 247428838,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1627456710
    },
    {
        "content": "<p>I saw that some of the typos were already fixed on the github branch you mentioned. Can it be those are not yet synchronized with Simplifier? I created a PR for a typo at: <a href=\"https://github.com/Nictiz/Nictiz-STU3-eOverdracht/pull/2\">https://github.com/Nictiz/Nictiz-STU3-eOverdracht/pull/2</a>. I requested an account for BITS, so I address other issues there. Thanks!</p>",
        "id": 247432511,
        "sender_full_name": "Steven van der Vegt",
        "timestamp": 1627459948
    },
    {
        "content": "<p>Thanks, much appreciated! I just re-synchronized the Simplifier project and it turns out that the Task wasn't properly synchronized yet.</p>",
        "id": 247584559,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1627566181
    },
    {
        "content": "<p>I'm currently trying to find my way through de docs for the eOverdracht and to put it mildly, as a newcommer it's not easy to navigate. There are multiple versions around and it is not always clear which one is the latest and should be used. It feels a bit work-in-progress. I really think someone should take look at this with the with the developer in mind. I really would like some real life FHIR examples.</p>\n<p>I'm currently implementing a simple version of the Advance Notice. I want to add a problem with a Nursing Intervention. Looking at the mappings between the ZIB <a href=\"https://zibs.nl/wiki/NursingIntervention-v3.1(2017EN)\">https://zibs.nl/wiki/NursingIntervention-v3.1(2017EN)</a> and <a href=\"https://simplifier.net/NictizSTU3-Zib2017/zib-NursingIntervention/~mappings\">https://simplifier.net/NictizSTU3-Zib2017/zib-NursingIntervention/~mappings</a> I wonder where do I add the Activity (NL-CM:14.2.10) on the FHIR profile?</p>",
        "id": 252782686,
        "sender_full_name": "Steven van der Vegt",
        "timestamp": 1631278858
    },
    {
        "content": "<p>Where can I find the values of the code systems InterventionNICCodelist and InterventionSnomedCodelist which I can use in the NL-CM:14.2.2 field?</p>",
        "id": 252784593,
        "sender_full_name": "Steven van der Vegt",
        "timestamp": 1631279721
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"428849\">@Steven van der Vegt</span> <br>\nI'm sorry to hear that you have trouble navigating this information, that's something we cannot change in the short term. The main entry point should be the Informatiestandaarden wiki. If you look at the <a href=\"https://informatiestandaarden.nictiz.nl/wiki/Landingspagina_Verpleegkundige_Zorg\">eOverdracht main page on the wiki</a>, you'll see a section \"Actuele versie\" with links to the relevant information. The main bullets are the Functioneel Ontwerp and Technisch Ontwerp. The Functioneel Ontwerp is based on the Dataset in ART-DECOR, which in turn is based on the Zorginformatiebouwstenen (zibs) 2017 edition. The Technisch Ontwerp is built on the Technisch Ontwerp, and implemented using the zib FHIR profiles which are linked there (which in turn link to Simplifier for visualization). Hope this helps a bit?</p>\n<p>The FHIR profile for zib NursingIntervention is a bit of an oddball. If you look at the main comment you'll see that it is a \"NursingIntervention as defined by the Dutch Health and Care Information models (Dutch: Zorginformatiebouwsteen or ZIB) version 3.1, release 2017 with an addaption by the 'VNN redactieraad 2018', where a informationmodel is proposed without the NursingProcedure container and attached mandatory Activity concept\" [sic]. So the Activity has been removed by request from the V&amp;VN.</p>",
        "id": 253059508,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1631524848
    },
    {
        "content": "<p>Regarding the code lists: <a href=\"https://zibs.nl/wiki/VerpleegkundigeInterventie-v3.1(2017NL)#InterventieSnomedCodelijst\">the zib page</a> links to a terminology browser for the SNOMED concept. The NICC codes are not relevant for eOverdracht.</p>",
        "id": 253063718,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1631526999
    }
]