[
    {
        "content": "<p>Hi all,</p>\n<p>Does any publicly available test server exist for testing any of the Dutch FHIR profiles? We're running an International Patient Access track at the FHIR Connectathon in January, and are interested in collecting information on all international FHIR implementations.</p>\n<p>At the connectathon, our main goal is to test as many client and server implementations as possible, against each other. We're interested in all country-specific server implementations, <strong>even if people running those servers would not be able to join the connectathon or the IPA track</strong> - as long as there is a test server or a sandbox environment publicly available.</p>\n<p>More info on the IPA track is in <a href=\"https://confluence.hl7.org/display/FHIR/2022-01+International+Patient+Access\">https://confluence.hl7.org/display/FHIR/2022-01+International+Patient+Access</a>.</p>\n<p>Beyond the connectathon, we're also interested in listing information on country-specific FHIR implementations in the IPA Implementation Guide.</p>",
        "id": 265819672,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1640188364
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> , we're not aware of any publicly available test server for any of the Dutch FHIR profiles that Nictiz maintains. It probably very well possible to upload the relevant packages to another public test server, but as far as we know there's nothing officially maintained out there.</p>\n<p>As a side note, I wonder how relevant the IPA efforts are to the situation in the Netherlands as a choice has been made to use a different approach (MedMij), which might not be very compatible (then again, I'm not very familiar with the IPA).</p>",
        "id": 265900572,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1640253320
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"216303\">@Pieter Edelman</span>!</p>\n<p>The aim of the IPA baseline specification is  to be a lowest common nominator we can find for implementations. Basically, just requiring SMART for app launch, some very light profiles for FHIR resources (depending on what the server supports) and a special <code>$docref</code> operation for getting a default summary of patient data.</p>\n<p>The authors recognize that app accreditation will be different in different implementations, for instance. But we're trying to make it easier for app developers to write apps that would be universally usable. This should also benefit providers of country-specific implementations as you'd get a wider selection of apps available.</p>\n<p>We expect further profiles to be built on top of the base level specification. These might cover things like app accreditation, language, or content formats. For instance, there might be an IPA profile for IPS and another for Nordic countries.</p>\n<p>In this first IPA connectathon we're particularly interested in finding out how far implementations like MedMij are from our baseline specification. And whether there is any interest in modifying either existing implementations or the IPA specification to reach wider compatibility.</p>",
        "id": 265902567,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1640254819
    },
    {
        "content": "<p>IPA spec: <a href=\"https://build.fhir.org/ig/HL7/fhir-ipa/\">https://build.fhir.org/ig/HL7/fhir-ipa/</a></p>",
        "id": 265905594,
        "sender_full_name": "René Spronk",
        "timestamp": 1640256988
    },
    {
        "content": "<p>I really hope that we (MedMij) will move towards more International specs. I will be at the upcoming connectathon. Can I help? <span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span></p>",
        "id": 266805242,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1641301676
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191372\">René Spronk</span> <a href=\"#narrow/stream/179181-netherlands/topic/FHIR.20Connectathon.2029/near/265905594\">said</a>:</p>\n<blockquote>\n<p>IPA spec: <a href=\"https://build.fhir.org/ig/HL7/fhir-ipa/\">https://build.fhir.org/ig/HL7/fhir-ipa/</a></p>\n</blockquote>\n<p>And the current Jan-2022 ballot: <a href=\"http://hl7.org/fhir/uv/ipa/2022Jan/\">http://hl7.org/fhir/uv/ipa/2022Jan/</a></p>",
        "id": 266805451,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1641301836
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191421\">@Michael van der Zel</span>, it would be awesome if you could join any of our sessions during the connectathon to at least discuss what we could do together.</p>",
        "id": 266806426,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1641302482
    },
    {
        "content": "<p>It would be even more awesome if you can think of a way of exposing some MedMij test servers for  people testing apps on the track. We could get a view on how far the implementation actually is from the IPA spec - and think of who should change and what.</p>",
        "id": 266806431,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1641302486
    },
    {
        "content": "<p>If not a test server, relevant documentation might be useful too.</p>",
        "id": 266806465,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1641302515
    },
    {
        "content": "<p><a href=\"https://informatiestandaarden.nictiz.nl/wiki/MedMij:V2020.01/FHIR_IG\">https://informatiestandaarden.nictiz.nl/wiki/MedMij:V2020.01/FHIR_IG</a></p>",
        "id": 266818842,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1641308885
    }
]