[
    {
        "content": "<p>Recently, we came aware of an issue in the Dutch <a href=\"https://simplifier.net/nictizstu3-zib2017/nl-core-humanname\">nl-core-humanname</a> datatype profile, which is used throughout the MedMij information standards to convey name information of persons. Right now, we're trying to figure out how we can align the proper use of the HumanName datatype with the adapted use this profile prescribes, and what the impact on existing implementations would be. Our current thinking is described <a href=\"https://bits.nictiz.nl/browse/MM-2102?focusedCommentId=56018\">here (BITS issue MM-2102)</a>. Any help would be greatly appreciated.</p>\n<p>The issue is fully described in the issue linked above and <a href=\"https://bits.nictiz.nl/browse/MM-1699\">issue MM-1699</a>, but to provide some background: this profile was created in order to capture the unique properties of Dutch names, more specifically to register all the parts that may make up a Dutch name. This is done by augmenting all repetitions of <code>HumanName.given</code> and <code>HumanName.family</code> using (core) extensions to specify the meaning of the part within a Dutch name. However, an interpretation error was made in specifying that several variations of the same given name could be captured within the _same_ HumanName instance, by augmenting their meaning using the extension -- specifically, the official names, initials and nicknames are all specified as repetitions of <code>.given</code> within the same HumanName instance. However, the nominal use for this datatype is that all repeating <code>.given</code> elements are _different_ names (which could be concatenated to provide the full name). Alternative representations of a name should be captured using _different_ instances of the HumanName datatype, where <code>HumanName.use</code> can specify whether it's an official name, a nickname, etc. (the nl-core-humanname profile doesn't touch <code>.use</code>).</p>\n<p>So now the problem is that there are many systems out there which will send different representations of a given name in the same HumanName instance (albeit marked as different name usages by the extension), and many systems that interpret repetitions of <code>.given</code> as variations of the same name. It is not possible to fix this without making a breaking change, but we think we can at least alleviate the situation by looking at <code>HumanName.given</code> -- please see the issue link above for full details. We'd like to hear if this is a valid way to go.</p>",
        "id": 238369084,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1620761522
    }
]