[
    {
        "content": "<p>I am strugling a bit with a registry that says it does FHIR, but in reality it does not. Well.. It uses REST and JSON, but for someone to state they use FHIR, my opinion is that they SHALL use FHIR resources and actually the full FHIR REST spec. Right?</p>",
        "id": 153939321,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1519200538
    },
    {
        "content": "<p>the minimum you need to do is return a capability statement, and do what it says.</p>",
        "id": 153939322,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519201292
    },
    {
        "content": "<p>Thanks. I'll ask them.. :-)</p>",
        "id": 153939323,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1519202157
    },
    {
        "content": "<p>The registry is not allowed to receive patient information. What is the best way to handle this? Create a Structure Definition on top of the Resource and restrict the patient (subject) references out (mask them) or pseudonymize it?</p>",
        "id": 153941452,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1519900800
    },
    {
        "content": "<p>This is a case where this system needs to receive de-identified data? Would love to work with you on how you do this.  I do suspect a good start is to use a StructureDefinition to define the chosen algorithm. The agent that does the de-identification on an object, could then tag it as having been de-identified and indicate the canonical URI of the StructureDefinition to indicate so. Easy algorithms are replace an element with a fixed value (e.g. \"removed\"), but even that likely needs extensions in the StructureDefinition.  See <a href=\"http://build.fhir.org/secpriv-module.html#deId\" target=\"_blank\" title=\"http://build.fhir.org/secpriv-module.html#deId\">http://build.fhir.org/secpriv-module.html#deId</a></p>",
        "id": 153941460,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519909669
    },
    {
        "content": "<p>I first have to convince them that doing REST and JSON is not equal to doing FHIR :-(</p>",
        "id": 153942685,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1520410368
    }
]