[
    {
        "content": "<p>Wat wordt de voertaal op dit forum? Het neigt nu naar Engels, hoewel er ook Nederlandse bijdragen zijn. Ik ben 100% voor Nederlands: er zijn genoeg Engelstalige streams, en het maakt deelname aan de discussie laagdrempeliger. Zie ook de soortgelijke discussie van op de Noorse stream. Ben het helemaal eens met wat daar staat: \"Ikke helt sikker p책 om engelsk er s책 lurt. Tror kvaliteten p책 diskusjonene blir bedre p책 norsk.\" Maar mogelijk ben ik een minderheid.</p>",
        "id": 153869343,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1485514801
    },
    {
        "content": "<p>It would be difficult for brand-new expats like me. I'm taking classes, but it'll be a long while away before I can use it fluently in a professional context :)</p>",
        "id": 153869344,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1485514953
    },
    {
        "content": "<p>Well, <span class=\"user-mention\" data-user-id=\"191363\">@Vadim Peretokin</span> , that's one good argument. (En succes met de Nederlandse les :-)</p>",
        "id": 153869345,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1485515820
    },
    {
        "content": "<p>Dank je wel :)</p>",
        "id": 153869346,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1485518217
    },
    {
        "content": "<p>I think 80% can be done in English which allows broader access, also for international companies with Dutch representation.</p>",
        "id": 153869347,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1485518513
    },
    {
        "content": "<p>The other 20% can be done in extensions :-)</p>",
        "id": 153869348,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1485518627
    },
    {
        "content": "<p>If a discussion is too hard to do in English, you could always switch to Dutch specifically of course.</p>",
        "id": 153869349,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1485518722
    },
    {
        "content": "<p>I agree this channel should be in English for non-native speakers like Vadim, and also important: discussions on which we would like the opinion of international FHIR experts or discussions that could be of interest to other countries like the \"voorvoegsel\" discussion we had earlier. </p>",
        "id": 153869578,
        "sender_full_name": "Marten Smits",
        "timestamp": 1485857668
    }
]