[
    {
        "content": "<p>The section on <a href=\"https://informatiestandaarden.nictiz.nl/wiki/FHIR_Profiling_Guidelines#Open_vs._Closed_Modeling\" target=\"_blank\" title=\"https://informatiestandaarden.nictiz.nl/wiki/FHIR_Profiling_Guidelines#Open_vs._Closed_Modeling\">Open/Closed modelling</a> in the Guidelines is not very clear. What would constitute closed modelling in FHIR? Is this just setting unneeded elements to 0..0 in your profile, or is more involved? Further, this paragraph is a list of pros and cons, but it isn't clear what approach was chosen for the ZIBs and Medmij (and why).</p>",
        "id": 153864546,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1482313458
    },
    {
        "content": "<p>We have chosen for \"open\" modeling for the ZIBs, since they are very general en not meant for one specific sue case. Excluding unspecified elements here is not an option, since we expect derived profiles for more specific use cases that may need those elements.</p>",
        "id": 153864557,
        "sender_full_name": "Marten Smits",
        "timestamp": 1482325145
    },
    {
        "content": "<p>Sound choice for ZIB. I'd like to comply with the Profling Guidelines, but I won't use open modelling. <br>\nIs it just using 0..0 vs not using this, or is more involved? I.e.  valueSets? (And note: open vs. closed modelling is not FHIR terminology, but v3 Template speak. Probably not everyone in the intended audience will understand the section.)</p>",
        "id": 153864559,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1482325904
    },
    {
        "content": "<p>I know it isn't FHIR speak, but I actually wasn't aware that this was a v3 thing. I thought it was self explanatory, but some introduction doesn't hurt I guess. <br>\nFor valueset bindings we have chosen for \"extensible\" binding instead of  \"required\" in the ZIB, for the same reason: we don't want to exclude any terminology that  the ZIB doesn't specify.</p>",
        "id": 153864565,
        "sender_full_name": "Marten Smits",
        "timestamp": 1482332575
    }
]