[
    {
        "content": "<p>Hi all,</p>\n<p>What would be an appropriate place to store the results of a Patient identity check, known as the \"WID Controle\", in the Patient resource?</p>\n<p>My initial thought is Patient.identifier:BSN.use with value \"official\".</p>\n<p>Many thanks.</p>\n<p>Kind Regards,</p>\n<p>Raymond Bakker<br>\nEnovation Group</p>",
        "id": 199593471,
        "sender_full_name": "Raymond Bakker",
        "timestamp": 1591173817
    },
    {
        "content": "<p>I think the WID controle is whether the identity has been confirmed - is that true?</p>",
        "id": 199593951,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591174173
    },
    {
        "content": "<p>Hi Jose, yes, specifically the legality of the provided identity document. So, that's actually a good remark because it is more about the document itself.</p>",
        "id": 199601884,
        "sender_full_name": "Raymond Bakker",
        "timestamp": 1591179568
    },
    {
        "content": "<p>I would not use \"official\" for that</p>",
        "id": 199612146,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591187085
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> ?</p>",
        "id": 199710658,
        "sender_full_name": "René Spronk",
        "timestamp": 1591253369
    },
    {
        "content": "<p>Why is it necessary to do this in FHIR when we never did this in V3 (eventually, although we initially planned to), and only did this in V2 because V2 is normally institution internal traffic.</p>\n<p>We don't do this in V3 (or FHIR) so far because there is no identified use case for it. By law you SHALL NOT send an unverified bsn. Hence, when you do send a bsn, it SHALL be a verified bsn based on identity document. How/what/when is not relevant to the receiver as he SHALL do that again himself.</p>",
        "id": 199710837,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591253570
    },
    {
        "content": "<p>The only use case I can think of today for FHIR is where FHIR replaces V2 for institution internal traffic. Is that the case here or is there something else I'm missing.</p>",
        "id": 199710860,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591253640
    },
    {
        "content": "<p>Hmm. So if the default is 'WID was verified', we may need a way to capture that the 'identity is uncertain' (like in v2) in case the default doesn't hold. This could be an extension, or it could be a meta tag.</p>",
        "id": 199711030,
        "sender_full_name": "René Spronk",
        "timestamp": 1591253807
    },
    {
        "content": "<p>Using identifier.use = official on a bsn probably makes sense, but never looked at identifier.use in any profile. It could not mean \"verified\", it could only mean \"this is the persons the most trusted for the identification\"</p>",
        "id": 199711118,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591253905
    },
    {
        "content": "<blockquote>\n<p>we may need a way to capture that the 'identity is uncertain' (like in v2)</p>\n</blockquote>\n<p>Maybe... if the same use cases for V2 apply. Is that the case?</p>",
        "id": 199711141,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591253943
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"308649\">@Raymond Bakker</span> what's the use case?</p>",
        "id": 199711158,
        "sender_full_name": "René Spronk",
        "timestamp": 1591253967
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> : there currently is no solid use case: the question is from a customer who asked for input on where to store such information in FHIR. <br>\nStrictly speaking the WID is only about the validity of the document that the person provided, not the person themselves, so perhaps it is indeed best to store it as meta information or by extension.<br>\nThanks!</p>",
        "id": 199841872,
        "sender_full_name": "Raymond Bakker",
        "timestamp": 1591340968
    },
    {
        "content": "<p>I could imagine newer applications using FHIR as their data store would want a place for it. I only ever remember implementing interfacing it to and from lab systems</p>",
        "id": 199881176,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1591366118
    },
    {
        "content": "<p>The \"person validity\" vs \"identity document validity\" ... I'm sorry that just cracked me up.</p>\n<p>but the first question is: \"Is there a use case?\" If there is we should cater for it. If there is not, then 'where do I put it', is a moot point.</p>",
        "id": 200228370,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591710030
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"200498\">@Brendan Keeler</span> was that a Dutch use case? The only requirement I know of today is between EHR and Lab system. This is traditionally solved using V2.</p>\n<p>When a GP orders stuff there is no such legal requirement. The lab can just assume validity of what the GP sends</p>",
        "id": 200228656,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1591710147
    }
]