[
    {
        "content": "<p>I am working on a model that has the structure of <a href=\"https://zibs.nl/wiki/MedicalDevice-v3.1.1(2018EN%20)\" target=\"_blank\" title=\"https://zibs.nl/wiki/MedicalDevice-v3.1.1(2018EN%20)\">MedicalDevice HCIM</a> to contain the data in parsed XML files, and I found something I did not quite know how to handle. As can be seen in the HCIM, both ProductDescription and Comment have kardinality (0..1). While on <a href=\"https://simplifier.net/NictizSTU3-Zib2017/zib-MedicalDevice\" target=\"_blank\" title=\"https://simplifier.net/NictizSTU3-Zib2017/zib-MedicalDevice\">MedicalDevice Simplifier</a> it shows that ,for both, an indefinite amount can be defined.</p>\n<p>My solution right now is to concatenate all the strings that can possibly found and puts them into the (0..1) field. This way, if multiple Strings are changed into a single String. So this way it fits into the by Nictiz defined parameters. </p>\n<p>Is this a good way to go about it? Should I instead return an error when multiple comments are found? Or just parse the first one and then the others?</p>",
        "id": 154835804,
        "sender_full_name": "Yuri Bonanno",
        "timestamp": 1547124172
    },
    {
        "content": "<p>You are referring to the 2018 prerelease version of the HCIM. We only support <a href=\"https://zibs.nl/wiki/MedicalDevice-v3.1(2017EN)\" target=\"_blank\" title=\"https://zibs.nl/wiki/MedicalDevice-v3.1(2017EN)\">MedicalDevice 2017</a>. Same issue applies there too though.</p>\n<p>The HCIM is a compatibility model and does not suggest to be a maximum number of properties for a given concept. The maximum number of properties for any concept is potentially infinite. E.g. any specialist will likely have a hundreds more properties that are not covered by the HCIM.</p>\n<p>That being said: if a system supports 2 descriptions or 2 comments for a medical device and exports those into FHIR, a receiving system is expected to be compatible with 1 of each based on the HCIM. If however the receiving system also supports 2 discrete descriptions/comments, it might import them as received.</p>\n<p>If the system only supports what the HCIM suggested (1 each), it could concatenate the descriptions and the comments into one each, or be prepared to loose every second description/comment and beyond. Sending an error is not an option because the sending system is not doing anything wrong.</p>\n<p>In practice I hope we will find that initially most systems will work like yours: implement the HCIM as well as possible. The profiles try to cater for the real world that is more detailed/complex than any given HCIM suggests. When systems are at least interoperable at HCIM level, we have done a lot already.</p>",
        "id": 154915464,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1547211850
    }
]