[
    {
        "content": "<p>van harte welkom om uw nieuwe stroom</p>",
        "id": 153814714,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457592022
    },
    {
        "content": "<p>Dankjewel Grahame. Goed hier te zijn tussen de andere \"FHIR minded folks'.</p>",
        "id": 153814717,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1457592125
    },
    {
        "content": "<p>one thing to learn with Zulip is that you the user have control over the topics in a stream, so you have to be careful about using them correctly</p>",
        "id": 153814719,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457592198
    },
    {
        "content": "<p>We'll have to learn as we go.</p>",
        "id": 153814729,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1457596983
    },
    {
        "content": "<p>Welkom iedereen. Zulip is het platform voor <a href=\"http://chat.fhir.org\" target=\"_blank\" title=\"http://chat.fhir.org\">chat.fhir.org</a> en is opgezet rondom streams (stromen). Ik vind het woord 'kanaal' de betere vertaling, maar dat is persoonlijk. 'netherlands' is het kanaal voor conversaties in het Nederlands. Merk op dat dit kanaal open is en dus kan de wereld meelezen. Als je denkt dat je iets later nog ergens anders wilt neerleggen, is het misschien handig om meteen in het Engels erover te praten. De meeste mensen in dit kanaal zullen het Engels gewoon machtig zijn.<br>\nProbeer on topic te blijven voor het kanaal is eigenlijk het enige dat telt. Voor de rest: fhir away...</p>",
        "id": 153814730,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1457597356
    },
    {
        "content": "<p>Goed initiatief Alexander. Ik ben blij dat er steeds meer hier naar Zulip verhuist<br>\n .</p>",
        "id": 153814733,
        "sender_full_name": "Marten Smits",
        "timestamp": 1457604279
    },
    {
        "content": "<p>I vote for English.</p>",
        "id": 153814742,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1457606984
    },
    {
        "content": "<p>Perfect. We zijn het eerste land met een eigen kanaal.  Hoor hier net in Zwisterland dat 60-70% van de communicatie tussen arts en ziekenhuis nog per FAX gaat, geen wonder dat we voorlopen met ons Zulip kanaal.</p>",
        "id": 153814747,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1457613414
    },
    {
        "content": "<p>Nou ... eigenlijk is australië ons voor geweest, maar daar woont Grahame, dus misschien telt dat niet</p>",
        "id": 153814748,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1457613515
    }
]