[
    {
        "content": "<p>Hello alltogether<br>\nI am not 100% sure if this is the right stream to post this issue. However, I didn't find any other stream related to ImagingStudy and Endpoint. Please point me to any better place, I'd be happy to switch. </p>\n<p>My question is pretty simple: the Endpoint resource is used within the ImagingStudy resource. An ImagingStudy can potentially have multiple endpoints, e.g. say the study is stored locally in the PACS and at the same time in another long-term archive. Ideally I'd add both endpoints (the internal one and the 'external' of the long-term archive) to the study. When loading the study I'd first try to get it from the local storage. If that fails one should try the next endpoint. <br>\nTo make this endpoint discovery process feasible I'd prefer to have something like a \"priority\", or \"preferability\", or \"order of access\", i.e. I need to know in which order I should contact the endpoints. <br>\nBesides the Endpoint.status I see nothing that could help me and I wonder if this usecase has been considered already?</p>\n<p>Thanks, Alexander</p>",
        "id": 218661157,
        "sender_full_name": "Alexander Röck",
        "timestamp": 1606981161
    },
    {
        "content": "<p>This is a good question for the Imaging Informatics workgroup (<span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> <span class=\"user-mention\" data-user-id=\"197037\">@Jonathan Whitby</span> <span class=\"user-mention\" data-user-id=\"277357\">@Christopher Lindop</span> ) none of whom were subscribed to this stream.</p>",
        "id": 218695345,
        "sender_full_name": "John Moehrke",
        "timestamp": 1607003840
    },
    {
        "content": "<p>I wasn't involved in any discussions around that  specific use case. However, we did consider multiple sources for images. Since the preferred endpoint might depend on the client, I'm not sure it should be in the resource itself, rather than in the client configuration. Some clients (such as an AI that provides input to the radiologist at the time the study is read) might want to use a local PACS, other clients might prefer the VNA; clients internal to the institution may have one preferred endpoint, while external clients might have another; and so on. You also have to consider that not all endpoints are equal: what does it mean for a client to prefer a WADO-RS endpoint over a QIDO-RS endpoint? What happens if not all endpoints have the full study contents? </p>\n<p>If it does make sense in your use case to record this, questions would be: whether the preference is an attribute of the endpoint or of the study; whether it a ranking or some sort of characterization of the endpoint that allows the client to make the determination (\"as a client, I prefer long term archives\"). If the attribute is on the Endpoint resource, then you have to consider whether this is a \"global\" ranking among all (DICOMweb) endpoint known to the server, and if so, how to maintain that ordering as endpoints are added or deleted. Personally, I would tend toward an extension on ImagingStudy.endpoint.</p>",
        "id": 218737154,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1607021201
    }
]