[
    {
        "content": "<p>Hello all! I watched the recording of <a href=\"https://hl7-org.zoom.us/rec/play/XMstYLL2_igAhABEsrRlAfSUd1vp69GTul3cql81r6RxmuTW9RCENQyGd9VkGnqd62PaMPg3rdw8kyjt.Mfrgy89ipnN9gg69\">the kick-off meeting</a> with great interest - it was a very good discussions, and I hope to contribute during the Connectathon.</p>",
        "id": 238810386,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1621017192
    },
    {
        "content": "<p>One of the points brought up at the kick-off was regarding the use of the FHIR base path vs. a URL parameter, i.e. </p>\n<div class=\"codehilite\"><pre><span></span><code>https://www.example-int.com/fhir/xdest1/...\n</code></pre></div>\n<p>vs.</p>\n<div class=\"codehilite\"><pre><span></span><code>https://www.exmple-int.com/fhir/....&amp;target=xdest1\n</code></pre></div>\n<p>I think there is an answer to that based on two things:</p>\n<ol>\n<li>Expectations of the originator - I think  one of the goals of this IG is to let the originators and responders in all cases remain blissfully unaware whether they are communicating via an intermediary or directly point-to-point. Having an extra URL parameter contradicts that goal. Besides, the meaning of <code>GET https://www.example-int.com/fhir/xdest1/Patient/123</code> is precisely defined in FHIR, while <code>GET https://www.example-int.com/fhir/Patient/123?target=xdest1</code> differs from the FHIR specification.</li>\n<li>We are talking about the <strong>public URL</strong> - I think the presentation and the posted diagram did a great job by bringing up that we are talking about the URL as seen by the outside world, which is not necessarily what is seen by the servicing application in the intermediary. It is not necessary for the intermediary to parse out the URL to find the destination. Instead, the intermediary needs to map the base URL (as defined by the FHIR specification) as a whole to the destination that base URL serves. </li>\n</ol>\n<p>One practical approach is to set up a reverse proxy at the intermediary that will convert all FHIR URLs with base URL of <code>https://www.example-int.com/fhir/xdest1/</code> to URLs like <code>https://www.example-int.com/fhir/....?target=xdest1</code>.  From what I understand, it is up to the intermediary to decide how they are going to represent the destination within the base URL, and therefore they control the mapping.</p>\n<p><span class=\"user-mention\" data-user-id=\"196338\">@Patrick Murta</span> <span class=\"user-mention\" data-user-id=\"193708\">@Durwin Day</span></p>",
        "id": 238814991,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1621019369
    },
    {
        "content": "<p>References and fullUrls in Bundles seem like they'd push the solution to app path components rather than query strings.   Since the reference data type is defined in the FHIR spec and I don't think that really allows for a query parameter in a literal reference (i.e. it doesn't match the regex in <a href=\"https://build.fhir.org/references.html#literal\">Literal References</a></p>",
        "id": 238820210,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1621021825
    },
    {
        "content": "<p>Also, for references, you can go relative, for Bundle fullUrls need to be absolute URLs (or UUIDs, but there was a whole discussion about that).</p>",
        "id": 238820271,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1621021860
    },
    {
        "content": "<p>Yes please make this kind of routing transparent for clients ;-)</p>",
        "id": 238820795,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621022110
    }
]