[
    {
        "content": "<p>Is there a way to create an \"aggregate\" IG?  In other words, what if I don't want to publish any <em>new</em> profile definitions, but rather want to assemble a unique grouping of existing definitions from other IGs?  Ideally the IG would publish those profiles/extensions in its own pages to avoid having to navigate all over the place.</p>\n<p>I could (and probably would) copy over the profiles/extensions into the IG's \"resources\" folder -- but I'm not sure that this would work because, IIRC, the publisher won't process any profiles/extensions that are outside of its own canonical URL.  Is that right?</p>\n<p>Follow-on question: what if I want mixed content?  What if I want an IG that <em>defines</em> some of its own profiles, but also \"inlines\" other profiles/extensions into the IG unchanged -- so that the IG can stand alone as documentation?</p>",
        "id": 162371629,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554237113
    },
    {
        "content": "<p>you can publish stuff with canonical URLs outside the IGs root, but it's a very bad idea for publishing/syncing reasons. why do you want to do that? Clone things and create version problems...</p>",
        "id": 162374735,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554239505
    },
    {
        "content": "<p>I understand there are certainly some dangers there.  We might need to do something like this to get around a short-term limitation in our own tooling -- so we're just trying to understand what is and is not possible.</p>\n<p>On the other hand, I can envision a future where some IGs aren't about <em>creating</em> new definitions, but rather curating and assembling existing definitions for a particular purpose.  I think that eventually we should think about what such an IG might look like (in published form).</p>",
        "id": 162427282,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554296915
    },
    {
        "content": "<p>Maybe I'm confused but it seems that you want to make your IG dependent on other IGs and have your own profiles that don't depend on the other IG? So a way to override a dependency? Am I understanding correctly?</p>",
        "id": 162428153,
        "sender_full_name": "David Pyke",
        "timestamp": 1554297521
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> -- that's not exactly what I'm trying to describe.  Sorry if it's hard for me to express it!</p>\n<p>The idea is that I might have a guide covering a certain topic -- and there are <em>already</em> profiles that would work well for this topic, but they are spread across multiple IGs.  I do not want to create my own profiles on top of them -- I just want to say that this IG declares that these are the profiles to be used: Profiles A and B from IG X, profiles C and D from IG Y, and profile E from IG Z.  My IG does not require that you support <em>all</em> of IG X, Y, and Z -- but rather, only the specific profiles I called out.  And I have nothing further to add to those profiles, so there is no reason for me to define new profiles based on them.</p>\n<p>Ideally, I could create an IG like that -- and for usability sake, it would <em>not</em> require the user to have to navigate to those profiles in their source IGs -- but rather, the relevant details would be collated into my IG so there is a single consistent set of documentation.</p>",
        "id": 162441716,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554307053
    },
    {
        "content": "<p>So you want to re-publish profiles that are authoritatively defined elsewhere as a user-convenience?</p>",
        "id": 162441878,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554307146
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/implementationguide-definitions.html#ImplementationGuide.dependsOn\" target=\"_blank\" title=\"http://hl7.org/fhir/implementationguide-definitions.html#ImplementationGuide.dependsOn\">http://hl7.org/fhir/implementationguide-definitions.html#ImplementationGuide.dependsOn</a> ?</p>",
        "id": 162441946,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1554307193
    },
    {
        "content": "<p>dependsOn points to the IG as a whole.  It doesn't identify specific artifacts you want to re-publish.</p>",
        "id": 162442048,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554307219
    },
    {
        "content": "<p>What we'd probably do is define a separate element that identifies what resources from dependent IGs you want to re-publish.  And then we'd need a convention for saying \"this version included for your convenience - for the authoritative version, see X\".</p>",
        "id": 162442156,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554307291
    },
    {
        "content": "<p>I can certainly see some utility to doing that.  CRD would probably have used it with the US Core profiles instead of just hyperlinking to them so that everything was in one nice neat package.</p>",
        "id": 162442261,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554307338
    },
    {
        "content": "<p>Would be cleaner to break up the dependent IG's into separate guides, allowing you to refer to specific subsets.</p>",
        "id": 162442300,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1554307365
    },
    {
        "content": "<p>We'd probably need to set a rule that for an official \"publication\", you could only point to dependent IGs which were themselves an official publication.</p>",
        "id": 162442311,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554307374
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> -- yes, I think you've got the gist of it.  If it can be done without copy/pasting sources into the \"aggregating\" IG, then that certainly is safer and more declarative.</p>",
        "id": 162442372,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554307412
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> That's not reasonable.  Any IG might require any arbitrary combination of US Core artifacts.  The only way to guarantee re-use would be to have a separate IG for each profile, which is a non-starter.</p>",
        "id": 162442382,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554307422
    },
    {
        "content": "<p>Yes, I see the problem. And often you don't control these referenced IGs.</p>",
        "id": 162442460,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1554307453
    },
    {
        "content": "<p>Just to be clear -- what I'm describing is not an immediate need -- but something we've been thinking about.  Not asking anyone to make it happen right now, but suggesting it's something that should be considered.</p>",
        "id": 162442491,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554307486
    },
    {
        "content": "<p>Somewhat reluctant in adding more fields to IG, especially special indirections - already a complex beast to implement...</p>",
        "id": 162442495,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1554307492
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> interesting feedback, food for thought.</p>",
        "id": 162442538,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1554307517
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> -- understood.  There are certainly some wrinkles to iron out.  One difficulty would be determining what of the source IG should be brought over?  For example, there might be a bunch of narrative guidance that exists only on the IG page and not in the structdef.  It seems it would be good to carry it over -- but then we're getting into styling and presentation..</p>",
        "id": 162442740,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554307647
    },
    {
        "content": "<p>I'll also note something that somebody suggested to me (which is a total paradigm change for FHIR, but interesting none-the-less)...  They wondered if profiles <em>should</em> be published independently -- so you just have a giant registry of versioned profiles and extensions -- and then <em>every</em> IG is really just an assembly of profiles into a guide.  E.g., IGs become 100% compositional.</p>",
        "id": 162443030,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554307813
    },
    {
        "content": "<p>As opposed to a mix of composition and definition.</p>",
        "id": 162443138,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554307901
    },
    {
        "content": "<p>This is a common thing that IHE does all the time. One must get the right governance. The new IG is defining a new context and use-cases, but re-using actors, transactions, and content from the previous IG. In this way you are leveraging re-use, while providing a new context for your reader. Even if that new context is simply changing the perspective at which one is viewing the exact same thing.</p>",
        "id": 162443296,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554308025
    },
    {
        "content": "<p>so, yes you are indicating in your aggregate IG that you are depending on the predicate IG... but for conformance claims you actually are calling upon the actors and transactions.... The benefit of this is that your aggregate IG can then pick-and-choose the actors and transactions it wants from the underlying IG.<br>\nFor example, eLTSS did this with US-Core based things...    Yes it says it is based on US-Core, but realistically it did not pull EVERYTHING from US-Core, it just leveraged (conformance) the things that are relevant.</p>",
        "id": 162443568,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554308196
    },
    {
        "content": "<p>I think porting text is ill-advised.  If text is important, you should link to it or if it's really important, deliberately copy the important stuff.</p>",
        "id": 162444389,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554308805
    },
    {
        "content": "<p>Also I think it's helpful to make a distinction between specifying dependencies to computable FHIR artifacts, distributed via packages, as opposed to referring to external documentation (narrative). In theory, we could define something like a \"filtered view\" on a package (not implying we should....) to address the former.</p>",
        "id": 162444781,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1554309063
    },
    {
        "content": "<p>This is the reuse we need in IHE indeed. This is not only for users to read - I am more interested in the testing bit. If I want to be compliant with the aggregated profile, I am picking and adding to the original profiles.</p>",
        "id": 162457862,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554317763
    },
    {
        "content": "<p>The level of what we reuse may not be an entire IG - depends on how granular is the IG. But then again, if we can have aggregate igs, we are no longer bound to one granularity level. So we could have an IG composed of other igs, and we select which ones we want to aggregate.</p>",
        "id": 162458338,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554318032
    },
    {
        "content": "<p>I'm not sure why the simple solution doesn't work: publish your IG with dependencies, and just link to the source of the definitions in the other IGs</p>",
        "id": 162461295,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554320014
    },
    {
        "content": "<p>does the fact that when a user clicks on some links, they go to a different place - does that matter?</p>",
        "id": 162461329,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554320036
    },
    {
        "content": "<p>It does matter somewhat.  Jumping into a different IG can be jarring.  And if you're not online and looking locally, the links won't resolve.</p>",
        "id": 162461500,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554320157
    },
    {
        "content": "<p>they will still resolve unless you are offline</p>",
        "id": 162462191,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554320674
    },
    {
        "content": "<p>There are lots and lots of external links in existing igs  so I don't  think that is the real sticking point is it?</p>",
        "id": 162462519,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554320910
    },
    {
        "content": "<p>HOwever,  I would guess that most readers would prefer inline content to links.</p>",
        "id": 162462662,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554321007
    },
    {
        "content": "<p>right. I'm sure you're right. They'll prefer a single inline guide right up to the point that they satart cutting code, at which point the version issues will leap out and smack them in the face</p>",
        "id": 162462748,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554321073
    },
    {
        "content": "<p>I hear the concerns... I think there are concerns to both approaches.  I think one potential usability issue is that since the IGs all look so similar (by design), if a user has to navigate to other IGs to view external definitions, they may not even notice they're in a different IG -- but then when they use the nav menu in that IG (say to click \"Home\" or \"Profiles\"), they're now completely out of context from the original IG.  In my opinion it is really easy to get lost... and the only way to get back to the original IG is via the back button since there is no bi-directional linking.</p>",
        "id": 162474389,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554329140
    },
    {
        "content": "<p>I could make the links with an external icon (like in the spec)</p>",
        "id": 162474499,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554329260
    },
    {
        "content": "<p>That would probably help, for sure -- but I still think the really consistent L&amp;F between the IGs makes it difficult to realize you really did jump into a totally different space.</p>",
        "id": 162474610,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554329358
    },
    {
        "content": "<p>... is it a totally different space?</p>",
        "id": 162474628,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554329389
    },
    {
        "content": "<p>If I'm in a domain-specific IG and I browse into another IG that has no links back to the domain-specific IG, <em>and</em> has a bunch of other profiles and extensions not relevant to my domain, then... yeah, I consider that a totally different space.</p>",
        "id": 162474766,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554329489
    },
    {
        "content": "<p>I guess I don't fully understand the versioning issues you're concerned about.  I mean, versioning can be an issue in general.  But... if you can only include external content via specific references (to a specific profile in a specific published version of an external IG) -- and the tooling is responsible for building the content inline in the new IG (so the author can't modify it) -- then what is the additional versioning danger?  How is that different than me depending on another IG the way we do today?</p>",
        "id": 162474954,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554329664
    },
    {
        "content": "<p>As a developer, an aggregate IG would actually mean I have all of exactly the right profiles in a single place, with no additional profiles I don't need.  There is no way for me to mistakenly download the wrong version of a dependency profile.  Otherwise, if I'm responsible for going out to every dependent IG, and finding and downloading the right version -- that seems more error-prone to me.</p>",
        "id": 162475215,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554329911
    },
    {
        "content": "<p>If you're reading the CDS Hook spec and you click on an \"in-guide\" profile, you've still got quick-links to the rest of the guide in the menu.  If you click on one of the US-core profiles, you're outside.  Which means that users get a yuckier experience when we reference external profiles.  That's not really what we want to happen.</p>",
        "id": 162475270,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554329976
    },
    {
        "content": "<p>Although, I guess if we can use the new NPM stuff to its full advantage, we could hopefully setup an ecosystem where I as the developer can have all the right dependency definitions downloaded and filtered for me via NPM.</p>",
        "id": 162475276,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554329983
    },
    {
        "content": "<blockquote>\n<p>links with an external icon</p>\n</blockquote>\n<p>They already should be there. they are in my IGs.</p>\n<p>I get what Chris is saying though that is why I change the background color of my IG so you know when you click out of them to the core spec.    </p>\n<p>Would it help to always open in new tab?  that can be annoying though <br>\nOr we could have the title bar alway be in view so you know where you are.</p>\n<p>What about some sort of binder for IGs   where you have a side bar indicating where you are at?</p>",
        "id": 162486023,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554341477
    },
    {
        "content": "<p>Different background color can differentiate IG from core, but hard to do with IG from IG - eventually we'll run out of colors.  The real issue is that you want the same feel for \"referenced\" profiles as you have for \"local\" profiles.  The US Core \"encounter\" profile is as much a 'part' of CRD as the locally-defined Coverage profile.  When you make navigating to each of them feel different (whether it's a new tab, new color, different menu, etc.), it's jarring.</p>",
        "id": 162491360,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554349098
    },
    {
        "content": "<p>I don't actually understand the problem with importing so long as the reference is to a stable release.  A specific version of CRD depends on a specific version of US Core.  If there's a new release of US Core, that doesn't impact CRD.  They only time a direct import would matter would be if there's a technical correction.  I don't have a sense that's going to be a common problem - and the only real impact is that if there's a technical correction on an imported artifact, then that should drive a technical correction on the importing IG.</p>",
        "id": 162491401,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554349200
    },
    {
        "content": "<p>I suspect this is a 'growing pain' problem. I hope we can mature toward the world where an IG can rely on an another IG without copying it; where an IG can orchistrate Actors from another IG without copying it; etc...</p>",
        "id": 162629648,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554475692
    },
    {
        "content": "<p>You absolutely <em>can</em> rely on and reference artifacts from another IG without copying.  But sometimes it's nice to \"import\".  (Note that importing is different from copying in that the source remains the original IG, it's just that that IG's content is included as part of the rendering of the target IG.</p>",
        "id": 162630560,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554476322
    },
    {
        "content": "<p>The best way to have a well controlled scope of all dependency artifacts is of course the very complete implementation of NPM package dependencies.</p>",
        "id": 162631598,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1554476984
    },
    {
        "content": "<p>That's what we rely on in Simplifier, Torinox and Forge.</p>",
        "id": 162631621,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1554476998
    },
    {
        "content": "<p>Also known as package.json</p>",
        "id": 162631717,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1554477033
    },
    {
        "content": "<p>The NPM mechanism isn't surfaced as a FHIR resource.  You can't pass an NPM package to another tool and have it understand the metadata if there isn't an ImplementationGuide.</p>",
        "id": 162633117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554477935
    },
    {
        "content": "<p>package.json isn't a FHIR standard.  It shouldn't replace the need for an ImplementationGuide.</p>",
        "id": 162633143,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554477961
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, I do see your point. Interesting discussion, I will have to give this some more thought.</p>",
        "id": 162633412,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1554478115
    }
]