[
    {
        "content": "<p>I still see a yellow TOC box with no contents on any IG page that does not have a subheading.  The template seems to have been generating it that way for a long time.  Is there any way that I'm not aware of to suppress that in the IG (without adding an otherwise unnecessary subheading), or to fix the template?  Or should we just continue to ignore it?  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 198162083,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1589959035
    },
    {
        "content": "<p>it's still an open issue on the template, so i'd ignore it for now until the template is fixed</p>",
        "id": 198163248,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589959945
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>.  Yes, that makes sense.  I recall that this came up previously, but I didn't locate anything on it last night.  Do you know of links to a tracker or previous topic(s)?</p>",
        "id": 198191729,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1589978363
    },
    {
        "content": "<p><a href=\"https://github.com/HL7/ig-template-base/issues/37\">https://github.com/HL7/ig-template-base/issues/37</a></p>",
        "id": 198197885,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589981332
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 198210175,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1589986540
    },
    {
        "content": "<p>Fixing it for XHTML content is more straight-forward than for markdown (because it's easier to parse XHTML to see if you've got headings)</p>",
        "id": 198210729,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589986741
    },
    {
        "content": "<p>As a general rule, pages that don't have enough content to have sub-headings are suspect.  IGs should generally have a small number of pages with lots of content rather than a large number of pages with minimal content - because the latter design creates much more work for the reader.</p>",
        "id": 198210845,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589986797
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/.22empty.22.20TOC.20box/near/198210845\">said</a>:</p>\n<blockquote>\n<p>As a general rule, pages that don't have enough content to have sub-headings are suspect.  IGs should generally have a small number of pages with lots of content rather than a large number of pages with minimal content - because the latter design creates much more work for the reader.</p>\n</blockquote>\n<p>That seems a strange thing to assert.  Shouldn't it depend on the IG authors and readers as to how exactly an IG is laid out?</p>",
        "id": 198212027,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1589987286
    },
    {
        "content": "<p>I'm speaking from a 'best practice' perspective.  Authors <em>can</em> create hundreds of small pages if they like, but the feedback I've seen from readers when faced with such IGs is that they don't generally like them.  For example, it's much better to have a single use-cases page that displays several printed pages worth of use-case text than it is to have a master 'use-cases' page with hyperlinks to separate pages for each use-case, each of which is a couple of paragraphs.  In the latter approach, the reader is constantly navigating back and forward just to be able to read through the use-cases.  There's no reason to force that.</p>",
        "id": 198214348,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589988178
    },
    {
        "content": "<p>Well, how \"suspect\" do you mean?  I think that the ones that we have in IPS (particularly Datatypes and Extensions, and also Copyrights) seem reasonable enough to be separate pages (to me, anyway).</p>",
        "id": 198214950,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1589988391
    },
    {
        "content": "<p>Individual resources - definitely.  It's more an issue when you're defining \"pages\" for human-readable content</p>",
        "id": 198215520,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589988606
    },
    {
        "content": "<p>I was referring to the IG pages (they are supposed to be human readable) where those profile artifacts are listed.</p>",
        "id": 198217147,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1589989317
    }
]