[
    {
        "content": "<p>Can I somehow \"overwrite\" general parts of a template? I'm currently using the hl7.fhir.template template for development, but since our IG is not an HL7 one I'd like to change the logos, colors ect. Or do I need to build my own template?</p>",
        "id": 179436191,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1572445118
    },
    {
        "content": "<p>derive your own template</p>",
        "id": 179436670,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1572445404
    },
    {
        "content": "<p>Is there any documentation on how to do this? I did not find anything on the publisher wiki...</p>",
        "id": 179437868,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1572446088
    },
    {
        "content": "<p>no/not yet</p>",
        "id": 179438057,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1572446184
    },
    {
        "content": "<p>Ok, is there a publicly accessible example for a derived template?</p>",
        "id": 179438291,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1572446317
    },
    {
        "content": "<p>you can do some local experimentation, but it will only work on your machine since others will not have the template (the template is downloaded automatically during the publication, and since the template you created is not published, others will not build it.</p>",
        "id": 179438343,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1572446357
    },
    {
        "content": "<p>%userprofile%\\.fhir\\packages is where your local templates are. you can start there</p>",
        "id": 179438456,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1572446415
    },
    {
        "content": "<p>Thank you! That will work for now.</p>",
        "id": 179438813,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1572446644
    },
    {
        "content": "<p>The plan is to have a \"generic\" template that doesn't include the HL7 colors or logo that other projects can use as a base and build their templates on top of.  The infrastructure to 'inherit' templates is not yet in place and probably won't be until late November.</p>",
        "id": 179448197,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572451547
    },
    {
        "content": "<p>Thanks for the information. Is there any estimation possible on when the \"generic\" template will be available? With the inheritance mechanism late November or later?</p>",
        "id": 179518141,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1572517542
    },
    {
        "content": "<p>Right now, we have a single HL7-specific template.  The 'generic' template will be produced once the inheritance mechanism is in place and will involve moving most of the content of the HL7 template out.</p>",
        "id": 179537278,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572532863
    }
]