[
    {
        "content": "<p>I am getting a new error during IG build that seems to indicate that an element of type Coding that has an extensible binding to a valueSet must hold values ONLY from that valueSet. I have one that is from that valueSet, but i also have two others that are not from that valueSet.  I am getting an ERROR from IG build on the others.</p>\n<p>Is this a new rule? (first to confirm that this did work before, but second do I understand the rule).</p>\n<p>In my case it is <code>AuditEvent.subtype</code></p>",
        "id": 271704493,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644692734
    },
    {
        "content": "<p>no that would be a bizarre rule.</p>",
        "id": 271707342,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644696399
    },
    {
        "content": "<p>Note that the binding covers all repetitions - which means that if the type is 'Coding', you can't send translations, only completely orthogonal codes.</p>",
        "id": 271712020,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644703562
    },
    {
        "content": "<p>I am confused. It seems that Grahame is saying that I should be able to put different codes than from the ValueSet, yet Lloyd is saying all codes in all repetitions must be from the valueSet. Which is it?</p>",
        "id": 271717821,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644711998
    },
    {
        "content": "<p>That's not what I said.  What I said is that if you send codes other than what's in the value set, they can't be translations, specializations or generalizations of codes that <em>are</em> in the value set.  I.e. the binding applies to all repetitions, not just one of them.  (Which is why we typically don't want tight bindings on repeating elements.)</p>",
        "id": 271723153,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644720673
    },
    {
        "content": "<p>Where's this documented and what's the rationale for preventing additional nuance? (The concept of \"completely orthogonal\" sounds definitionally perilous to me.)</p>",
        "id": 271724486,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644722979
    },
    {
        "content": "<p>Extensible says \"To be conformant, the concept in this element SHALL be from the specified value set if any of the codes within the value set can apply to the concept being communicated.\"<br>\nTypically, we use the CodeableConcept data type, and in that case, if you want to convey additional nuance, you send the appropriate code from the value set as well as your additional more nuanced code.  But you <em>must</em> send the code from the value set.</p>\n<p>However, in the case of Coding, there's no ability to send a translation, which means that your only choice if a code from the valueset applies is to send the code from the value set.  There's no opportunity to convey more nuance.  (Which is why, for a 0..* Coding if you're going to declare a tight binding, it's typically best to do it on a single slice rather than all repetitions.)</p>",
        "id": 271725056,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644724023
    },
    {
        "content": "<p>In practice, sending multiple granularities in a repeating Coding does not lead to any ambiguities or interoperability challenges that I'm aware of. The prohibition is just a side effect of the modeling choices that someone almost certainly didn't intend when creating the binding?</p>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> where is the binding in question defined?  We should probably throw IG build warnings whenever a tight binding is assigned to a Coding array (even if no example data are triggering a validation problem), to avoid mistakes in the constraint design and encourage slicing (otherwise these mistakes aren't noticed until it's too late -- like, after publication)</p>",
        "id": 271725406,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644724611
    },
    {
        "content": "<p>It's not a question of leading to ambiguities, it's a question of what the rules are.  I understand that the constraints might well not have been intended, but it doesn't change what they are.</p>",
        "id": 271727282,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644727757
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> it is AuditEvent, and R5 is already fixed.</p>",
        "id": 271750166,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644764728
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> so then I should NOT include ANY code from the valueset? That seems really contrary? Extensible is only extensible if you ignore the valueset?</p>",
        "id": 271750248,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644764857
    },
    {
        "content": "<blockquote>\n<p>@<strong>Josh Mandel</strong> it is AuditEvent, and R5 is already fixed.</p>\n</blockquote>\n<p>By slicing?</p>",
        "id": 271750301,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644764921
    },
    {
        "content": "<p>I don't see a repeating Coding in any of the elements of <a href=\"http://build.fhir.org/auditevent\">http://build.fhir.org/auditevent</a></p>",
        "id": 271750358,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644765006
    },
    {
        "content": "<p>they have all been changed to CodeableConcept and to Example/Preferred binding... Lloyd taught us the error of  the extensible way... but I did not know extensible forbids finer-grain codes.</p>",
        "id": 271753501,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644769364
    },
    {
        "content": "<p>Extensible doesn't forbid finer-grained codes as translations, but if there's a code in the valueset that applies (regardless of granularity), you must use it.</p>",
        "id": 271762933,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644783069
    },
    {
        "content": "<p>I shall ignore the ig builder error.</p>",
        "id": 271772596,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644796044
    },
    {
        "content": "<p>you still haven't told us what the error is, but I think you must have mis-understood it</p>",
        "id": 271775127,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644799492
    },
    {
        "content": "<p>I found it...   so, the answer to my top level question is... \"NO\". Which Grahame gave, but Lloyd then confused me.</p>",
        "id": 271823325,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644844169
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> has marked this topic as resolved.</p>",
        "id": 271823335,
        "sender_full_name": "Notification Bot",
        "timestamp": 1644844174
    }
]