[
    {
        "content": "<p>We are getting ready to create a \"stable\" release of our <a href=\"http://build.fhir.org/ig/dvci/vaccine-credential-ig/branches/main/\">SMART Health Cards: Vaccination &amp; Testing IG</a>. This is still outside the HL7 process as our <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=104573738\">PSS</a> is still making its way through the various approvals.</p>\n<p>In our case, \"stable\" is just a signal to our implementers that we don't expect any breaking changes in the near-term -- it doesn't have any meaning from an HL7 perspective.</p>\n<p><strong>My question:</strong> What should the version number for this \"stable\" release be?</p>\n<p>Right now, we have <code>v0.4.0-rc</code> for our current \"release candidate.\" The natural thing to do from a semantic versioning perspective is for our \"stable\" release to be <code>v1.0</code>. But will this have negative implications down the road when we publish through HL7?</p>\n<p>We want to avoid having to repeat or go backwards with the version numbers once this moves into HL7.</p>",
        "id": 237655825,
        "sender_full_name": "Max Masnick",
        "timestamp": 1620307028
    },
    {
        "content": "<p>STU1 is typically 0.1.0</p>",
        "id": 237655887,
        "sender_full_name": "David Pyke",
        "timestamp": 1620307066
    },
    {
        "content": "<p>STU1 is typically v1.0. And I think that there's very good reason for that. So your stable version should not be 1.0. typically, you won't be able to stop change when it goes through HL7. so you should not use something like 1.0. I wuld think 0.5 would do the job</p>",
        "id": 237656320,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620307222
    },
    {
        "content": "<p>We are getting ready to turn over our IG content to our sponsoring WG in preparation for our STU 1 ballot.</p>\n<p>At what point should we set the version number to <code>v1.0</code> in the IG?</p>\n<p>Right now our <a href=\"#narrow/stream/179252-IG-creation/topic/IG.20versioning\">CI build</a> says <code>0.6.0 - STU 1 (Proposed Ballot Version)</code>. I haven't bumped it up to <code>v1.0</code> yet because we have implementers actively looking at the IG, and their assumption will be once it says <code>v1.0</code> the content won't change until the version number changes again.</p>",
        "id": 246846638,
        "sender_full_name": "Max Masnick",
        "timestamp": 1626960681
    },
    {
        "content": "<p>We could do something like <code>v1.0-release-candidate - STU 1 (Proposed Ballot Version)</code> if that's acceptable from an HL7 standpoint</p>",
        "id": 246848017,
        "sender_full_name": "Max Masnick",
        "timestamp": 1626961346
    },
    {
        "content": "<p>1.0-ballot1 is what we're moving toward, but I don't know if the tooling supports that (both from a publishing perspective, but also a 'package management' perspective.  Until <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> says otherwise, ballot releases should be a 0.x.0 release.  The change to 1.0.0 comes during the QA period prior to final publication</p>",
        "id": 246860636,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626966574
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"322501\">Max Masnick</span> has marked this topic as resolved.</p>",
        "id": 246862764,
        "sender_full_name": "Notification Bot",
        "timestamp": 1626967605
    }
]