[
    {
        "content": "<p>I'd like to add an example in our IG that transforms one resource to another (ie. QuestionnaireResponse to a Bundle of Observations and Conditions).   I already got a mapping file that successfully transforms the resources using the org.hl7.fhir.validator.jar.  How should I include it my IG so it shows up in my examples list.</p>",
        "id": 208603799,
        "sender_full_name": "Joee Garcia",
        "timestamp": 1598901840
    },
    {
        "content": "<p>what exactly do you want to show up in the examples list?</p>",
        "id": 208605861,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598902816
    },
    {
        "content": "<p>Ideal would be to have the StructureMap instance (converted from the .map file) added to the examples list and when this example is displayed in the IG, there is a way to view the actual or contents of the .map file (either shown in another tab or accessible from a link somewhere).</p>",
        "id": 208623270,
        "sender_full_name": "Joee Garcia",
        "timestamp": 1598912961
    },
    {
        "content": "<p>so this should be as simple as simply adding the .map file as a resource and marking it as an example</p>",
        "id": 208624485,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598913736
    },
    {
        "content": "<p>The publishing infrastructure will allow pointing to a .map file and will automatically parse it?</p>",
        "id": 208626929,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598915429
    },
    {
        "content": "<p>it should. And I think I've already tested that</p>",
        "id": 208626946,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598915451
    },
    {
        "content": "<p>do you have an example somewhere? i tried it with the cda-fhir-maps ig and i <a href=\"http://build.fhir.org/ig/hl7ch/cda-fhir-maps/branches/mapsfile_in_ig/failure/build.log\">fail with an NPE</a>. I put the <a href=\"https://github.com/hl7ch/cda-fhir-maps/compare/mapsfile_in_ig?expand=1#diff-501d7c95814016502725c86b61b377ea\">.map file instead of the structuremap</a> and reference it in the same way from the IG resource (I moved the BundleToCda.map)? If the setup is correct I would offer to work on a PR.</p>",
        "id": 208657177,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1598948186
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217312\">@Joee Garcia</span> what we do currently is to convert the map to a StructureMap resource and add it to the ig as a StructureMap resource <a href=\"https://github.com/hl7ch/cda-fhir-maps\">e.g. cda-fhir-maps</a>. We set up an online conversion, if you have VSCode / RESTClient you can adapt the scripts in <a href=\"https://github.com/hl7ch/cda-fhir-maps/blob/master/cdatofhir.http\">here</a> to convert the maps to a StructureMap.</p>",
        "id": 208658527,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1598949131
    }
]