[
    {
        "content": "<p>I am trying to add patient and patient+clinical-status as search parameters to AllergyIntolerance, using the <a href=\"http://hl7.org/fhir/StructureDefinition/capabilitystatement-search-parameter-combination\">Search Parameter Combination extension</a>, and I have some questions questions:</p>\n<ol>\n<li>Is it OK to have only patient and patient+clinical-status listed, but not clinical-status by itself?</li>\n<li>In the FHIR core R4 package, there doesn't seem to the an AllergyIntolerance-patient search parameter defined. Is that a problem? <em>Answer:</em> No, the shared search parameter is <code>clinical-patient</code></li>\n<li>I am populating the IG's CapabilityStatement with the search parameters information. Is there another place to add that information? </li>\n<li>If I am not profiling the search parameters in any way, do I need to add them as resources to the IG?</li>\n</ol>",
        "id": 261857487,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1637186763
    },
    {
        "content": "<blockquote>\n<p>Is it OK to have only patient and patient+clinical-status listed, but not clinical-status by itself?</p>\n</blockquote>\n<p>I list em all, but I don't know if can omit them individually? </p>\n<blockquote>\n<p>I am populating the IG's CapabilityStatement with the search parameters information. Is there another place to add that information? </p>\n</blockquote>\n<p>We use Quick Starts documentation in US Core -  it is up to the author how they want to inform the reader</p>\n<blockquote>\n<ol>\n<li>If I am not profiling the search parameters in any way, do I need to add them as resources to the IG?</li>\n</ol>\n</blockquote>\n<p>no - we modify them in US Core specify type and conformance expectations for the optional elements like multiple ors , but you can just reference the core sps</p>",
        "id": 261860318,
        "sender_full_name": "Eric Haas",
        "timestamp": 1637188226
    },
    {
        "content": "<blockquote>\n<p>I list em all, but I don't know if can omit them individually?</p>\n</blockquote>\n<p>My question is even at a higher level - can I omit saying anything about  support for clinical-status by itself, but talk about patient+clinical-status?</p>",
        "id": 261860917,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1637188624
    },
    {
        "content": "<p>try it and see if it passes validation.</p>",
        "id": 261866680,
        "sender_full_name": "Eric Haas",
        "timestamp": 1637192340
    },
    {
        "content": "<p>It does... I'll do another check to see how far it can be pushed.</p>",
        "id": 261868583,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1637193744
    },
    {
        "content": "<p>well I think you can, because in out narrative we only display the SHALL SHOULD for combo searches and omit the MAY for the individual- even though they are in the CApstatement as MAY ( I may remove them at some point).  There is nothing prohibiting a client from trying a SP but the server can reject it too.</p>",
        "id": 261869003,
        "sender_full_name": "Eric Haas",
        "timestamp": 1637193955
    },
    {
        "content": "<p>The question is whether clinical-status on its own can be omitted from the capability statement (since it's present in core anyway)...</p>",
        "id": 261869321,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1637194158
    },
    {
        "content": "<blockquote>\n<p>do I need to add them as resources to the IG?</p>\n</blockquote>",
        "id": 261871023,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637195491
    },
    {
        "content": "<p>no</p>",
        "id": 261871024,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637195492
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/179252-IG-creation/topic/Adding.20a.20combination.20of.20search.20parameters/near/261869321\">said</a>:</p>\n<blockquote>\n<p>The question is whether clinical-status on its own can be omitted from the capability statement (since it's present in core anyway)...</p>\n</blockquote>\n<p>There is a lot stuff in the core, but because it is in the core does not mean that it will be implemented.  The  IG cap statement can provide that  expectation.  You could just say use em all + these swell combos, but when we asked we got a limited set that would be supported broadly and thus stuck with those.</p>",
        "id": 261879281,
        "sender_full_name": "Eric Haas",
        "timestamp": 1637202997
    },
    {
        "content": "<p>My findings so far are that there is no validation done to check that the components of a combination are search parameters on their own - see <a href=\"https://github.com/hapifhir/org.hl7.fhir.core/issues/665\">issue #665</a> on GitHub. It will be probably much easier to do that validation, if the individual components are present as SearchParameter in the capability statement for the IG, even if they are of the \"MAY\" type.</p>",
        "id": 261947376,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1637251257
    },
    {
        "content": "<p>Yes and we got feedback that having only some SP as MAY in capabilitystatement but omitting others we did not need was suggesting that those omitted are excluded, which is wrong but something to consider ( how the audience misinterprets things)</p>",
        "id": 261948187,
        "sender_full_name": "Eric Haas",
        "timestamp": 1637251543
    }
]