[
    {
        "content": "<p>Is it possible to locally alter the header of a template (eg fhir.base.template ) to, say, change the colour and add a new .gif - or is the approach to create a new template?</p>",
        "id": 189247745,
        "sender_full_name": "David Hay",
        "timestamp": 1582831751
    },
    {
        "content": "<p>In doing this, you're defining a new template, but it can be a new template that depends on another template that defines most of the behavior/appearance and just changes color scheme.  (Take a look at the FHIR template for an example of this.)  You can also define a template that is 'contained' within an IG and doesn't use the package infrastructure and isn't shared across IGs - take a look at the UTG IG for an example of this.</p>",
        "id": 189249154,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582832609
    },
    {
        "content": "<p>For the 'contained' option (UTG) , is that the framework/ig-template folder? Where do I place it in the folder structure?</p>",
        "id": 189252383,
        "sender_full_name": "David Hay",
        "timestamp": 1582834624
    },
    {
        "content": "<p>Yes, and you leave it exactly where it is.  If you don't wanted it nested under framework, you could move it elsewhere - just don't call it 'template'.  (The 'template' folder is a working folder that gets re-created every time the publisher is run.)</p>",
        "id": 189252764,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582834881
    },
    {
        "content": "<p>ta</p>",
        "id": 189253712,
        "sender_full_name": "David Hay",
        "timestamp": 1582835488
    },
    {
        "content": "<p>Do I have to tell the publisher that there is a framework folder (which is a peer with the input folder), or should it just find it? </p>\n<p>I added framework/ig-template/includes/_append.fragment-header.html  (where _append.fragment-header.html had some text in a div) expecting it to appear in the header, but it didn't...</p>",
        "id": 189276251,
        "sender_full_name": "David Hay",
        "timestamp": 1582853788
    }
]