[
    {
        "content": "<p>Dears, I notice that every time I generated the web ig the page \"artifacts.html\" is auto generated and contained all of (Profiles, Extensions, Examples, ValueSets and CodeSystem), but I do not need all of these to be in the same page (I need to separate them in multiple pages), could you help me in identify how the \"artifacts.html\" page is built, and how could I change on it (or at least choose what to aartifacts I need to be built in it) ?</p>",
        "id": 263971241,
        "sender_full_name": "Osaid Nabulsi",
        "timestamp": 1638866218
    },
    {
        "content": "<p>It's built using XSLT as part of the generic template.  The only way to change it is to modify the template (which would mean you couldn't use HL7's continuous integration build).  We've discussed leveraging Composition to allow defining alternative organizations of the content.  Your other choice is to define your own page(s) that list only the artifacts you care about and don't bother linking to the artifacts.html page at all.  (That said, you <em>should</em> provide a way to easily navigate to all of the artifacts in your IG.)</p>",
        "id": 264006080,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638886136
    },
    {
        "content": "<p>Thank you Osaid and Lloyd. I have this same question. I also want to separate artifacts into multiple pages. Since the artifacts are generated automatically, if I create separate pages, how do I indicate that I want ValueSets to generate on this page, and Profiles on this other page. etc.<br>\nDid you solve this <span class=\"user-mention\" data-user-id=\"314831\">@Osaid Nabulsi</span> ?</p>\n<p>I was going to ask <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> and then found this chat on the topic. Jose, do you have any instruction to share about this? (I stepped thru, at a slow pace, your recorded DevDays demo of the Belgian IG template. Thank you for that. So helpful.)</p>",
        "id": 273651063,
        "sender_full_name": "Sheila Connelly",
        "timestamp": 1646145980
    },
    {
        "content": "<p>There's a longer-term plan to allow doing this using Composition, but no timeline to get there yet.</p>",
        "id": 273652856,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646146662
    },
    {
        "content": "<p>Indeed. Allowing the artifacts page to be split - or tabbed - would mean some serious hacking to make your own XSLT (and maintain it, and have nobody to complain to). There was some discussion on reworking this so that the editor has a bit more control over the grouping and paging (with a Composition).</p>",
        "id": 273653450,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1646146833
    },
    {
        "content": "<p>The latter would need the thing that powers the community: Some time<br>\nAnd upvotes. Two things</p>",
        "id": 273653488,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1646146853
    },
    {
        "content": "<p>(Perhaps three things: Time, upvotes and enough chocolate :) )</p>",
        "id": 273653625,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1646146899
    },
    {
        "content": "<p>What I do is either :</p>\n<ol>\n<li>create direct links to the anchors in the FHIR artifacts page in menu bar like here:  <a href=\"http://build.fhir.org/ig/HL7/VhDir/\">http://build.fhir.org/ig/HL7/VhDir/</a></li>\n<li>create my own pages and ignore the artifacts page like here: <a href=\"http://build.fhir.org/ig/HL7/US-Core/\">http://build.fhir.org/ig/HL7/US-Core/</a> - it is still reachable via the breadcrumbs and TOC</li>\n</ol>",
        "id": 273658751,
        "sender_full_name": "Eric Haas",
        "timestamp": 1646148927
    },
    {
        "content": "<p>i tend to treat the artifacts page like a glossary. Figuring that my narrative pages need to be pointing at the most important artifacts; such that only those most familiar with the IG scope/purpose/intent will use the artifacts page. in this way the current artifacts page is functional, and having it be automatically generated and complete is useful.</p>",
        "id": 273659413,
        "sender_full_name": "John Moehrke",
        "timestamp": 1646149146
    }
]