[
    {
        "content": "<p>IG Publisher creates StructureDefinition resourcen where text field contains a div tag that contains a lot of html formatting information. Is there a way to \"tell\" IG Publisher to not create this div tag?</p>",
        "id": 272404928,
        "sender_full_name": "Moritz Kähler",
        "timestamp": 1645192949
    },
    {
        "content": "<p>Yes, there's an IG parameter you can use to indicate specific resources you don't want narrative for.  However, in most cases, every resource should have narrative.  Why do you want the narrative removed?</p>",
        "id": 272412800,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645196893
    },
    {
        "content": "<p>I don't want to remove the narrative, I want to remove all the HTML formatting. <br>\nCan you provide an example how to pass this parameter?</p>",
        "id": 272779029,
        "sender_full_name": "Moritz Kähler",
        "timestamp": 1645522582
    },
    {
        "content": "<p>In FSH you can use the typical caret syntax that allows you to access any field in the underlying StructureDefinition.  In this case, you would want something like:</p>\n<div class=\"codehilite\"><pre><span></span><code>* ^text.div = &quot;&lt;div&gt;My own narrative&lt;/div&gt;&quot;\n</code></pre></div>\n<p>or in this case, since the value <em>must</em> be xhtml, you might want to use the <code>\"\"\"</code> delimiters:</p>\n<div class=\"codehilite\"><pre><span></span><code>* ^text.div =\n  &quot;&quot;&quot;\n  &lt;div&gt;\n    &lt;p&gt;\n      My own narrative paragraph 1.\n    &lt;/p&gt;\n    &lt;p&gt;\n      My own narrative paragraph 2.\n    &lt;/p&gt;\n  &lt;/div&gt;\n  &quot;&quot;&quot;\n</code></pre></div>\n<p>No matter what, though, writing XHTML in FSH isn't super great -- even though it does have its uses.</p>",
        "id": 272801281,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1645536204
    },
    {
        "content": "<p>Narrative is, by definition, HTML.  That can't be changed.  You must, at minimum, wrap your text in a &lt;div&gt; and the text must render appropriately as XHTML.</p>",
        "id": 272812396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645541238
    }
]