[
    {
        "content": "<p>Hoping this is the right place to ask this - apologies if it isn't...</p>\n<p>We have the following ballot comments that are suggesting changes to US Core: <a href=\"https://jira.hl7.org/browse/FHIR-31008\">https://jira.hl7.org/browse/FHIR-31008</a>, <a href=\"https://jira.hl7.org/browse/FHIR-31005\">https://jira.hl7.org/browse/FHIR-31005</a>, <a href=\"https://jira.hl7.org/browse/FHIR-31004\">https://jira.hl7.org/browse/FHIR-31004</a></p>\n<p>They are about the fact that we have created \"clones\" of the US Core extensions for race, ethnicity, etc. for use on RelatedPerson - because the US Core extensions are only for use on Patient.</p>\n<p>How do we go about dealing with the comments? Do we need to assign them to the workgroup that owns US Core? Change the ticket specification?</p>",
        "id": 231913974,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1616733228
    },
    {
        "content": "<p>Re-assigning the work group is reasonable.  You can't change the specification if there are votes against them.  If the cross-project group decides changes are necessary, they can create their own tracker items and resolve these issues by pointing to the new tracker items (and their resolutions).</p>",
        "id": 231917514,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616736808
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191918\">@Sarah Gaunt</span>  can you prep it complete with  a resolution and and grouping “Discuss” I will look at today and sneak into block right away. If I understand correctly you want to extend the context to related person.</p>",
        "id": 232788171,
        "sender_full_name": "Eric Haas",
        "timestamp": 1617295523
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I think you should be able to extend contexts easily by just profiing them and adding new contexts on them.  Is that not a thing?</p>",
        "id": 232788346,
        "sender_full_name": "Eric Haas",
        "timestamp": 1617295589
    },
    {
        "content": "<p>Sure thing - thanks <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> !</p>",
        "id": 232812971,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1617305827
    },
    {
        "content": "<p>Ok have assigned to US Realm Task Force (not sure that's the correct workgroup though), proposed dispos, and assigned to you <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 232814026,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1617306326
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I'm not understanding your question - what do you mean by 'contexts'?</p>",
        "id": 233188079,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617636591
    },
    {
        "content": "<p>If you're talking about adding contexts to an extension by profiling, then no, that's not a thing.  Profiles can constrain, they can't extend.  All contexts permitted need to be in the base extension definition.</p>",
        "id": 233188241,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617636642
    },
    {
        "content": "<p>To be honest, I'm not sure we've ever discussed the notion of \"constraining\" contexts once established.</p>",
        "id": 233188314,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617636680
    },
    {
        "content": "<p>In reality contexts have not/ are not really given enough thought when creating extensions,  which is why would be nice to be able to add new contexts to existing profiles by some simple means (maybe a mod extension on SD?) instead of waiting for a new release.</p>",
        "id": 233199063,
        "sender_full_name": "Eric Haas",
        "timestamp": 1617641976
    },
    {
        "content": "<p>It might be nice, but it's absolutely not possible.</p>",
        "id": 233200532,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617642693
    }
]