[
    {
        "content": "<p>Many editors that run on windows use batch files, typically named _genOnce.bat or something to get the latest copy of the igpublisher, and then run the ig publisher</p>",
        "id": 191979015,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585288325
    },
    {
        "content": "<p>Lloyd has introduced those batch files into the base template as a way to distribute them but this is a problem - I can't build anything because my a/v is making all the tools blow up when the try to handle the file</p>",
        "id": 191979032,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585288372
    },
    {
        "content": "<p>and I can't really fault it - downloading executable code by a batch file sounds like a really insecure way to do things</p>",
        "id": 191979048,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585288403
    },
    {
        "content": "<p>I think Grahame's question is - is there an alternative way to handle launch other than batch files that would work on all Windows environments and would be less likely to upset AV software</p>",
        "id": 191979593,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585289144
    },
    {
        "content": "<p>Git for windows includes a Bash shell. Can shell scripts be used instead?  On my machine, the location is C:\\Program Files\\Git\\git-bash.exe if you need to check that it exists.</p>",
        "id": 192016843,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1585315954
    },
    {
        "content": "<p>Is Bash better than .bat from an AV/security perspective?  The biggest challenge is that we need something we can double-click on in the Windows  explorer folder that will \"just run\".  I expect that would be true of a .sh, so we'd need a .bat to invoke it (though it would mean we could put all the logic in the .sh file and have the .bat file be super simple &amp; static).  Are we confident that everyone who's installed any sort of Git client on a Windows machine will always have git-bash in that location?</p>",
        "id": 192021828,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585318144
    },
    {
        "content": "<p>can't we just exclude certain folders from A/V scanning?</p>",
        "id": 192031381,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1585321896
    },
    {
        "content": "<p>many people cannot exclude any folders - corporate managed</p>",
        "id": 192058049,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585332637
    },
    {
        "content": "<p>couldn't people that have such challenges rely on the pipeline currently set up using webhooks on github?</p>",
        "id": 192058331,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585332769
    },
    {
        "content": "<p>There's a decent number of people who need to be able to test when they don't have an internet connection.  Also, they don't always want to commit their stuff every time they make a change and want a build.  Some users of the tool chain won't use the CI build at all.</p>",
        "id": 192058717,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585332953
    },
    {
        "content": "<p>Jens, this is possible and is used. I have had IG editors that only used that, never had build local ability. As Lloyd points out, there is still a need for local builds, and making them better should always be on the table</p>",
        "id": 192059090,
        "sender_full_name": "John Moehrke",
        "timestamp": 1585333093
    },
    {
        "content": "<p>sure ... as I understand it, the challenge is that the tool is used by a very broad set of people</p>",
        "id": 192059827,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585333391
    },
    {
        "content": "<p>omitting bat/sh files makes it easier for some while it makes it a bit more difficult for others</p>",
        "id": 192059897,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585333428
    },
    {
        "content": "<p>what about putting the sh/bat files in another repo?</p>",
        "id": 192059918,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585333442
    },
    {
        "content": "<p>what is it that the batch files do?</p>",
        "id": 192060047,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585333496
    },
    {
        "content": "<p>The batch files (and shell scripts) do three things:  The first is responsible for downloading the current IGPublisher and putting it into either a project-specific folder or a parent folder (to allow sharing amongst a bunch of IGs).  It does this in a way that supports a variety of Windows versions.  The second checks to see where the IGPublisher is located and whether the system is connected to the internet or not and then launches the publisher with an appropriate tx server flag based on whether it's connected or not.  It also ensures Java uses UTF-8.  The final one does the same as the second, but launches the publisher in 'continuous' mode.</p>",
        "id": 192061052,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585333984
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> I'm interested in your comment on this thread please</p>",
        "id": 192067772,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585336859
    },
    {
        "content": "<p>Re: packaging and setup, one end of the spectrum is to release managed packages per platform, like going through the Windows Store, getting developer keys, signing release, etc. But that doesn't sound like what's required here...</p>",
        "id": 192068890,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1585337375
    },
    {
        "content": "<p>I'm unclear on why your tools are blowing up, though Grahame. If there's a <code>setup.sh</code> file (or whatever), why are you loading or running this when you go to build an IG? I would have thought that's a one-time developer-facing script that you run at the beginning of a process?</p>",
        "id": 192069023,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1585337426
    },
    {
        "content": "<p>I was simply copying it when installing the template package into the package cache. the A/V was preventing me from even having the batch file on my drive</p>",
        "id": 192071440,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585338830
    },
    {
        "content": "<p>But does <em>not having</em> the file break your build? I wouldn't think you need this file.</p>",
        "id": 192079136,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1585342668
    },
    {
        "content": "<p>The file is what kicks off the build</p>",
        "id": 192079304,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585342748
    },
    {
        "content": "<p>failing to install a package breaks everything. I won't tolerate dropping files at random from packages and having mystifying downstream errors</p>",
        "id": 192079391,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585342793
    },
    {
        "content": "<p>Wrong thread?</p>",
        "id": 192079510,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585342835
    },
    {
        "content": "<p>no the right thread. I'm explaining what the problem with the batch file was - it was in a template, and my A/V wouldn't let it exist on my drive. I didn't want to run it. Only instal the package that contained it</p>",
        "id": 192079682,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585342912
    },
    {
        "content": "<p>Hmm. What does it mean to install a package? Is it just cloning the git repository or something more?</p>",
        "id": 192087733,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1585348021
    },
    {
        "content": "<p>What <em>had</em> happened was as follows: We had added the .bat files into the IG template, which caused them to be incorporated into an NPM package.  The IGPublisher uses its NPM package manager to retrieve the package, stick it in the local cache, then extract the contents into a local 'template' folder for use in IG execution.  Some part of that process caused Grahame's AV to be unhappy and yank some of the content, which caused other parts of the process to not copy the full set of content into the template folder, which led to a failure of the IGPublisher.</p>\n<p>We've yanked that part of the process and will (shortly) be exploring a process where the .bat files try to update themselves directly from the source sitting in Git somewhere else.  That'll avoid dealing with NPM or package extraction, though it's possible the process will still make Grahame's AV unhappy - hope to know that soon.</p>",
        "id": 192088512,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585348568
    },
    {
        "content": "<p>I'm so confused. Probably because I don't know where/why IG authors (or just template authors?) are using these .bat files, and why they need to \"update themselves\". Also regarding the underlying issue: Grahame, can't you tell your antivirus software not to complain about this? Basically every npm package anywhere (like, in the public npm registry) contains executable (js) scripts, shell scripts, etc. This can't all be broken, right?</p>",
        "id": 192101353,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1585363327
    },
    {
        "content": "<p>Authors are using the batch files to grab the most recent publisher and to kick off a local build.  We want to auto-update them because sometimes we make enhancements to how the batch files function.  (This conversation started, in part, because we were considering using the batch/shell files to do some FSH pre-processing before Grahame revamped the IG publisher to make that unnecessary.  There will undoubtedly be future changes.  Right now, we have a straight-forward process of making sure people are running with the current publisher and current templates, but there's no good way to make sure they're running with the current batch/shell files.  The objective is to try to fix that.</p>",
        "id": 192102560,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585365251
    },
    {
        "content": "<blockquote>\n<p>Grahame, can't you tell your antivirus software not to complain about this?</p>\n</blockquote>\n<p>yes, well, in principle I could though it's getting harder to. but I actually had some conceptual sympathy for the AB here - a batch script that downloads itself from an internet server.... </p>\n<p>The real issue is that not everyone can configure their anti-virus like that</p>",
        "id": 192104358,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585368611
    },
    {
        "content": "<p>But with the bat files out of the template the problem is gone, right?</p>",
        "id": 192107524,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585374347
    },
    {
        "content": "<p>Maybe.  Haven't had a chance to test yet.  You still have bat files updating bat files, which it's possible some AV systems may be unhappy with</p>",
        "id": 192108159,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585375575
    },
    {
        "content": "<p>I might need to issue a signed executable to do the updating</p>",
        "id": 192108570,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585376329
    },
    {
        "content": "<p>We'll see.  If it's too big a pain to make work, we can just badger people on <a class=\"stream\" data-stream-id=\"179294\" href=\"/#narrow/stream/179294-committers.2Fannounce\">#committers/announce</a> to download the new ones from sample-ig or wherever.  First, let's see if a direct download causes grief.</p>",
        "id": 192109164,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585377514
    },
    {
        "content": "<p>The problem with a signed executable is then you have the issue of ensuring people have an up-to-date signed executable :)</p>",
        "id": 192109167,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585377540
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/Batch.20files/near/192109167\" title=\"#narrow/stream/179252-IG-creation/topic/Batch.20files/near/192109167\">said</a>:</p>\n<blockquote>\n<p>The problem with a signed executable is then you have the issue of ensuring people have an up-to-date signed executable :)</p>\n</blockquote>\n<p>...and for that (updating the executable) we can make a batch file :)  &lt;-- this should have been a joke</p>",
        "id": 192109335,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585377960
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/Batch.20files/near/192108159\" title=\"#narrow/stream/179252-IG-creation/topic/Batch.20files/near/192108159\">said</a>:</p>\n<blockquote>\n<p>Maybe.  Haven't had a chance to test yet.  You still have bat files updating bat files, which it's possible some AV systems may be unhappy with</p>\n</blockquote>\n<p>Obviously my AV is very lax, but it does not complain about the self-updating batch files.</p>",
        "id": 192109379,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585378005
    },
    {
        "content": "<p>We'll test it w/ Grahame and then stress test it w/ <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> :)</p>",
        "id": 192109504,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585378299
    },
    {
        "content": "<p>If the only/primary concern is to have the most recent version of the IG publisher - then consider <a href=\"https://stackoverflow.com/questions/4002462/how-can-i-write-a-java-application-that-can-update-itself-at-runtime\" title=\"https://stackoverflow.com/questions/4002462/how-can-i-write-a-java-application-that-can-update-itself-at-runtime\">https://stackoverflow.com/questions/4002462/how-can-i-write-a-java-application-that-can-update-itself-at-runtime</a> or something alike. There are a couple of tools that does this kind of thing</p>",
        "id": 192113865,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585386791
    },
    {
        "content": "<p>eg. <a href=\"https://github.com/update4j/update4j\" title=\"https://github.com/update4j/update4j\">https://github.com/update4j/update4j</a></p>",
        "id": 192113937,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585386859
    },
    {
        "content": "<p>i'm not reproducing OSGi</p>",
        "id": 192117924,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585393591
    },
    {
        "content": "<p>I don't believe you are</p>",
        "id": 192118872,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585395341
    },
    {
        "content": "<p>IMHO - if you want to distribute software that ensures that you run on the latest stuff, either use docker, an msi installer (with embedded updater) or something like <a href=\"https://github.com/update4j/update4j\" title=\"https://github.com/update4j/update4j\">https://github.com/update4j/update4j</a>. You could also embed into the publisher that it advises you to stop the current run if there's an internet connection and it can detect a newer version online. If it is crucial business logic, put it into the publisher itself. - ... just a thought</p>",
        "id": 192119076,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585395695
    },
    {
        "content": "<p>Installer is machine-wide.</p>",
        "id": 192121265,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585399306
    },
    {
        "content": "<p>We need to support several IGs in the same machine, some of them using different versions of the publisher. <br>\nThe batch files allow us to use a \"shared\" publisher jar for several IGs, or individual jars for some IGs.</p>",
        "id": 192121337,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585399351
    },
    {
        "content": "<p>They are a simple click-and-go solution, which we can zip with along with the IG, and tell a non-techie (after they install jelkyll...) - \"here, unzip this, click that, then that, and watch the output folder.\" <br>\nI thought of a Launcher as well, but if the current solution works...</p>",
        "id": 192121359,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585399426
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179252-IG-creation/topic/Batch.20files/near/192121337\" title=\"#narrow/stream/179252-IG-creation/topic/Batch.20files/near/192121337\">said</a>:</p>\n<blockquote>\n<p>We need to support several IGs in the same machine, some of them using different versions of the publisher. <br>\nThe batch files allow us to use a \"shared\" publisher jar for several IGs, or individual jars for some IGs.</p>\n</blockquote>\n<p>sounds a bit contradicting. How can a \"shared\" publisher be different versions of the publisher?</p>",
        "id": 192123563,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585402898
    },
    {
        "content": "<p>have there been cases for using older versions of the publisher?</p>",
        "id": 192123627,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585402963
    },
    {
        "content": "<p>In my machine I use the latest publisher version for all IGs, but when something goes wrong -or when I want to test a specific version of the publisher in one of the IGs, then I use a different jar for that IG, while all the others use the \"main\" publisher</p>",
        "id": 192125031,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585404529
    },
    {
        "content": "<p>do many other users share the same need to be able to run a multitude of different versions of the publisher?</p>",
        "id": 192125573,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585405367
    },
    {
        "content": "<p>I'd say about 2/3 of people publishing only have one IG.  But a small percentage of folks work with multiple IGs - and supporting different publisher versions is an uncommon but necessary capability for those folks.</p>",
        "id": 192126300,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585406462
    },
    {
        "content": "<p>And we don't need to have N times 100 mb to download and use disk space. One shared jar handles that</p>",
        "id": 192126366,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585406546
    },
    {
        "content": "<p>Btw, this is why I personally don't really care about a test branch of the IG Publisher. I can keep building locally by fetching the n-1 version of the jar ( <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> not sure if this helps)</p>",
        "id": 192126451,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585406720
    },
    {
        "content": "<p>i guess my own use is not representative for the average user then as I don't lack bandwidth nor diskspace and prefer to wrap it in docker an usually only use the latest version as I have no expectations of feature fixes back in time of the IG</p>",
        "id": 192126503,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585406798
    }
]