[
    {
        "content": "<p>Starting a new IG... but I must hit HL7 May ballot... so I am stuck starting today with current IG publication system... Understand that things will change... <br>\nIs there a starter IG I should copy? I guess I could start with US-Core, but was hoping there was a smaller starter...</p>",
        "id": 157037772,
        "sender_full_name": "John Moehrke",
        "timestamp": 1548693077
    },
    {
        "content": "<p>SDC might be a little bit smaller, but we don't have an official starter on the old style.</p>",
        "id": 157037916,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548693188
    },
    {
        "content": "<p>okay. I understand. just didn't want to miss a good starter if there was one.</p>",
        "id": 157038177,
        "sender_full_name": "John Moehrke",
        "timestamp": 1548693402
    },
    {
        "content": "<p><a href=\"https://github.com/Healthedata1/IG-Template2\" target=\"_blank\" title=\"https://github.com/Healthedata1/IG-Template2\">My IG-Template2</a>  is what I based on US Core on.  Doesn't follow Lloyd's framework though and The ReadMe is a little stale</p>",
        "id": 157039526,
        "sender_full_name": "Eric Haas",
        "timestamp": 1548694597
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  so you would recommend me going to your template2 rather than us-core?</p>",
        "id": 157039867,
        "sender_full_name": "John Moehrke",
        "timestamp": 1548694862
    },
    {
        "content": "<p>Yes that is how I start a new IG.</p>",
        "id": 157039991,
        "sender_full_name": "Eric Haas",
        "timestamp": 1548694983
    },
    {
        "content": "<p>Doesn't the IHE template work?<br>\nWould be good to  have some feedback on that, which is a minimum working ig with a basic set of pages.</p>",
        "id": 157052270,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1548704852
    },
    {
        "content": "<p>I don't see an IHE template yet... does one exist?  (Note I am not doing IHE work this week, so don't need it urgently)</p>",
        "id": 157056430,
        "sender_full_name": "John Moehrke",
        "timestamp": 1548708739
    },
    {
        "content": "<p>ihe template = ihe base profile to show how it works</p>",
        "id": 157056793,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1548709078
    },
    {
        "content": "<p><a href=\"https://wiki.ihe.net/index.php/IHE_FHIR_Profile_Publication/Getting_Started\" target=\"_blank\" title=\"https://wiki.ihe.net/index.php/IHE_FHIR_Profile_Publication/Getting_Started\">https://wiki.ihe.net/index.php/IHE_FHIR_Profile_Publication/Getting_Started</a></p>",
        "id": 157056865,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1548709119
    },
    {
        "content": "<p>This (IHE template) is clearly an adjustment on Lloyd's framework. I use Lloyd's framework  in my IG. I assume that you have replaced some of Lloyd's original assets and other items in the Framework directory to create the IHE images. Can you tell me which ones have been changed? I would be interested to see what it would take to make the PHD IG follow an IHE template. I might get assigned that in the near future. I don't think it would take much as long as all the changes are just cosmetic.</p>",
        "id": 176614815,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1569454074
    },
    {
        "content": "<p>Yes, it is Lloyd's previous framework with some CSS changes and content removed. Now we have a new template and that is where we will start next. In the next few days I hope to create the same base template based on Lloyd's template, but for now your best option is to use the official template which exists since 2 weeks ago</p>",
        "id": 176630808,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1569477060
    },
    {
        "content": "<p>Since I already have an IG following Lloyd's framework I was hoping for a minimal effort in trying the IHE version of the framework instead. In theory I would expect that all my content should remain the same, only changing the CSS files or whatever else was changed in the framework directory. However, the structure I saw seemed to double the directories, I see the same directories in two places, one as they are when using Lloyd's framework and then repeated in the 'basic' directory. Not sure I understand the hierarchy.</p>",
        "id": 176744493,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1569590195
    },
    {
        "content": "<p>I need a few hours to change that. Sorry, it is outdated since we have a common template</p>",
        "id": 176745129,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1569590725
    },
    {
        "content": "<p>The changes I did before were to better separate content from framework which is solved in the new template</p>",
        "id": 176745224,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1569590795
    },
    {
        "content": "<p>So, <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> do you want <br>\na) a changed template with a few changes to CSS?<br>\nb) a barebones IG?</p>",
        "id": 176774024,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1569609936
    },
    {
        "content": "<p>these are now quite well separated. I do recommend to use the new framework instead of going back to the precious one which is where I based that IHE bootstrapper. </p>\n<p>So basically use the sample-ig and you'll have it easier.</p>",
        "id": 176774159,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1569610031
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Actually I already have a completed IG and its in the final stages of cleaning up 2nd round ballot comments. I was just thinking of testing the IHE template with the content I already have to see what it would look like. I would have thought all I would (or should) need to do is to replace the framework directories with that for the IHE template.</p>\n<div class=\"codehilite\"><pre><span></span>\n</pre></div>",
        "id": 176788312,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1569620275
    },
    {
        "content": "<p>Yes, that should be. There are a few changes to the .bat and to the ant file, so if you want to do it, just get the IHE thing and then put your content there (not the other way around)</p>",
        "id": 176807425,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1569645557
    }
]