[
    {
        "content": "<p>I'm a new IG creator and I apologize in advance for my lack of technical knowledge / verbiage. We are seeing \"Binding: (unbound) (example)\" on an element that is not profiled in our IG. The same element is not labeled \"Binding: (unbound) (example)\" in the base spec.  For example, please see RiskAssessment.prediction.outcome [here] (<a href=\"http://build.fhir.org/ig/HL7/eLTSS/RiskAssessment-eltss.html\">http://build.fhir.org/ig/HL7/eLTSS/RiskAssessment-eltss.html</a>). It also occurs on RiskAssessment.method.  Does anyone know what is causing this and how to fix it? It was suggested that this may be an error in the IG publisher since we have not profiled this element.</p>",
        "id": 208271006,
        "sender_full_name": "Becky Angeles",
        "timestamp": 1598559757
    },
    {
        "content": "<p>there is no way to fix this without specifying the element and binding it to a value set in your profile.  The base resource doesn't have a binding on that element, so it is left up to profiles to do a proper binding.  The core spec doesn't list \"(unbound) (example)\" but it is in essence unbound since there is no binding specified.</p>",
        "id": 208271246,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598559881
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>. So if we don't want that element profiled, do we really have to specify a value set? I have no idea what value set we should use? Or should I tell the Jira tracker submitter that this is not an error and just a \"feature\" of the publisher?</p>",
        "id": 208272286,
        "sender_full_name": "Becky Angeles",
        "timestamp": 1598560406
    },
    {
        "content": "<p>that's a good question.  in a proper world, the resource in the spec would have a binding, even if it was just an example binding.  then you wouldn't see the error.  so I'm not sure what you can do in the meantime.  I suspect that the best you can do is respond that the error is not an error in your profile but an error in the underlying resource.</p>",
        "id": 208272597,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598560562
    },
    {
        "content": "<p>It's more of a rendering issue.  We've talked about having multiple views of the 'binding' list just as we have multiple views of the profile elements.  The 'snapshot' view would list all bindings (including ones your IG hasn't constrained and doesn't care about).  The differential view would only list bindings for elements you've constrained somehow and the 'must support' view would list bindings for all required, modifier and must-support elements (i.e. the ones implementers absolutely need to pay attention to).  However, we're not there yet.  I wouldn't recommend declaring bindings just because you don't like seeing 'unbound'.  That's not an error and not something you need to fix.</p>",
        "id": 208273705,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598561097
    },
    {
        "content": "<p>Thank you both - <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ! We will change our tracker resolution accordingly.</p>",
        "id": 208274119,
        "sender_full_name": "Becky Angeles",
        "timestamp": 1598561297
    }
]