[
    {
        "content": "<p>This seems like a strange bug, but I don't know what is causing it. I have a markdown file which is being converted to html. The page is accessed by clicking on some link. If I do not create a structure definition in the page, the page renders fine. However, if I add the following line to the md file<br>\n{% include StructureDefinition-PhdDevice-diff.xhtml %}<br>\nQuotes and other characters needs to be escaped or one gets rendered garbage. Typically in tables. I get one character that I cannot figure out what is causing the output (perhaps a line feed or CR?).</p>\n<p>So right now the easiest solution is not to render a SD in the page. When I figure out how to make a link to one, that might isolate the case and the bug won't occur.</p>",
        "id": 153999409,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537785342
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> I appreciate your dogged determination, but I'm not totally understanding why you don't use one of the established frameworks.  You're going through a lot of work, but within the next 1-2 months, HL7 will have a \"standard\" framework that we're going to expect all HL7 International IGs to be published based on - to ensure consistency of navigation and keep the learning curve for both implementers and maintainers as low as possible.</p>",
        "id": 153999438,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537800984
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> I appreciate your dogged determination, but I'm not totally understanding why you don't use one of the established frameworks.  You're going through a lot of work, but within the next 1-2 months, HL7 will have a \"standard\" framework that we're going to expect all HL7 International IGs to be published based on - to ensure consistency of navigation and keep the learning curve for both implementers and maintainers as low as possible.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Mainly because I dont know how. I copied a Frameworks directory from a project but could not get it to be recognized. So I took the material out of it and placed it into sub directories of the pages directory. I put the HL7 headers, nav bars, and footers there as well as the -layouts file. It worked.  I have the right 'templates' and my IG looks just like the pocd IG except the color of the nav bar is grey instead of red.</p>\n<p>That is probably configured in the css file. I'm not going to play with that now because I don't know that syntax. </p>\n<p>I can make the IG now and I have lots of pieces and links to pull together so I will do that first and then fix the color so it is consistent with the PoCD IG.</p>",
        "id": 153999447,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537803624
    }
]