[
    {
        "content": "<p>At some point, the code on line 56 of SuppressedMessageInformation.jave (within the 'contains' function) was changed from:<br>\n<code>        if (sm.message.equals(message)) {</code><br>\nto<br>\n<code>        if (sm.message.contains(message)) {</code></p>\n<p>It needs to change back.  The text in the suppressed message must be an exact match, not just a contains check.  (Matching against just the message or message + display is already handled elsewhere.)  With the code as it is now, I had a suppressed message in SDC that said this:<br>\n<code>WARNING: StructureDefinition.where(url = 'http://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-questionnaire-adapt'): The Implementation Guide contains no examples for this profile</code><br>\nHowever, because this suppressed message contained the 'message' part <code>The Implementation Guide contains no examples for this profile</code>, it was suppressing <em>all</em> occurrences of this message rather than just the specified location.  (Meaning I thought I had examples for all of my profiles, when in fact I didn't.)  Changing things back corrects this issue.</p>",
        "id": 265507102,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639957468
    },
    {
        "content": "<p>I thought this was done on purpose - so that the suppress warnings files weren't so big and messy. I'm sure that you asked me to clean up one of my suppress files on an FMG call saying that we didn't have to put the full message in anymore. Maybe I'm mis-remembering? But ALL my suppress files now rely on the contains rather than the equals.</p>",
        "id": 265517887,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1639971571
    },
    {
        "content": "<p>Not saying it's wrong to change it back to equals, just that it might cause suppress files to stop working.</p>",
        "id": 265518048,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1639971750
    },
    {
        "content": "<p>There are two options - full message, or the message from after the \":\" where the preceding part describes the location where the issue was detected.  (Grahame's added a couple of additional options, which are the full HTML and the internal key used for the message, though I doubt most people will use those.)</p>\n<p>We don't want just a 'contains' test because that will result in suppressing things you didn't intend to.  What's happening right now (with the bug) is that if you suppress a full message with location, it will incidentally suppress all occurrences of that message independent of location - and that's definitely <em>not</em> what's wanted.</p>",
        "id": 265519816,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639974236
    },
    {
        "content": "<p>Ah ok, makes sense. Sounds like my suppress files with just the stuff after the : will still work.</p>",
        "id": 265529698,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1639986286
    },
    {
        "content": "<p>it was done on purpose. And people do use it to suppress messages. The suppressed messages are still shown at the bottom of the page - you would want to check them anyway.</p>",
        "id": 265734989,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640121291
    },
    {
        "content": "<p>but I don't want a war over this, so I've changed it so it does a case insensitive equality check unless you have % at the start and/or end of the message</p>",
        "id": 265735100,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640121360
    },
    {
        "content": "<p>will be in the next release</p>",
        "id": 265735145,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640121370
    },
    {
        "content": "<p>So if you add a %, it's a contain, if not it's an equals.  I like that!</p>",
        "id": 265735244,
        "sender_full_name": "David Pyke",
        "timestamp": 1640121459
    },
    {
        "content": "<p>'contains' is not safe - at least not when checking location-specific suppression against the 'message'.  Key thing is to ensure that if you suppress something location-specific, it can't ever match to a message that isn't from that location.  Will the new mechanism ensure that?</p>",
        "id": 265815786,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1640186269
    },
    {
        "content": "<p>no that's the point: maybe you want to suppress a class of messages. you don't have to use it that way</p>",
        "id": 265844244,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640202138
    },
    {
        "content": "<p>The issue with the current behavior is I was trying to suppress a message for a specific location.  Because of how the code worked, it suppressed the message in <em>all</em> locations.  The new mechanism must ensure that if a location is specified in the suppression file, that it <em>only</em> suppresses that location, even if it might happen to 'contain' the location-independent message.</p>",
        "id": 265851666,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1640206510
    }
]