[
    {
        "content": "<p>Is there a way to constrain the IG Publisher to build locally? I note that it keeps going to the build server. One may not always be able to be on line. I thought by creating a \"packages\": \"packages\" entry in the ig.json that the publisher would grab the tgz file in the \"packages\" directory but it does not. <br>\nOn the other hand it could be that the package has not been updated (though I have downloaded the latest) and the publisher goes to the build server because of that. (The publisher is reporting a version 1 but it needs version 2.)</p>\n<p>Updating hl7.fhir.core-3.6.0 package from source (too old - is 1, must be 2</p>",
        "id": 153996210,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1536755982
    },
    {
        "content": "<p>that should only happen once</p>",
        "id": 153996220,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536758005
    },
    {
        "content": "<p>I'll have a look at it tomorrow - that change was thrown together in a hurry because of git</p>",
        "id": 153996221,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536758030
    },
    {
        "content": "<blockquote>\n<p>I'll have a look at it tomorrow - that change was thrown together in a hurry because of git</p>\n</blockquote>\n<p>If I create a 'packages' directory and place the tgz file in that directory and then add<br>\n\"packages\":\"packages\" to the ig.json, will the publisher skip downloading the tgz file? That takes 40 to 50 seconds.</p>",
        "id": 153996360,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1536783465
    },
    {
        "content": "<p>no, it won't</p>",
        "id": 153996379,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536789878
    },
    {
        "content": "<p>what's the first 10 lines of your log say?</p>",
        "id": 153996380,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536789888
    },
    {
        "content": "<blockquote>\n<p>no, it won't</p>\n</blockquote>\n<p>Okay, I will remove it. I guess what happens is that the package gets downloaded and is only downloaded again if the previous one is out of date. Its just that it keeps downloading a package which is version 1 but the publisher wants version 2. So its re-downloaded every time.</p>",
        "id": 153996405,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1536793731
    }
]