[
    {
        "content": "<p>Next to our R4 IG's we are (still) building our STU3 IG's.<br>\nWe have some trouble separating the STU3 from R4. Sooner or later in our STU3 IG's we hit R4 references (references without version information). We have some problems with the \"baseDefinition\" element in our profiles if they reference base-profiles (<a href=\"http://hl7.org/fhir\" target=\"_blank\" title=\"http://hl7.org/fhir\">http://hl7.org/fhir</a>).<br>\nWe provide our derived profiles as differentials only. We notice in creation the snapshots the proper FHIR version is used (STU3) and also the \"fhirVersion\" element in the snapshot is adjusted to \"3.0.2\" (we specified 3.0.1), but the \"baseDefinition\" element stays untouched, which ends up in the IG's as a reference to R4 resources.</p>\n<p>Is there a way out or do I overlook something (I'm pretty new to this subject)</p>",
        "id": 180435936,
        "sender_full_name": "Cees de Jonge",
        "timestamp": 1573488547
    },
    {
        "content": "<p>well, this ends up being tricky. the baseDefinition is a reference to a canonical URL and if you say that this is a R3 resource, the space of resolution is magically understood to be the R3 space, and the baseDefinition still refers to the R3 base</p>",
        "id": 180452417,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573500501
    },
    {
        "content": "<p>Indeed the documentation pages we create for our resources indeed contains R3 content.<br>\nOnly our line \"This profile is based on ...\" brings us to R4 content. Not if this point to our own profile, because they have fhir-version information in the canonicalURL.<br>\nI can of course create a little post-processing script to replace '<a href=\"http://hl7.org/fhir\" target=\"_blank\" title=\"http://hl7.org/fhir\">http://hl7.org/fhir</a>' with '<a href=\"http://hl7.org/fhir/stu3\" target=\"_blank\" title=\"http://hl7.org/fhir/stu3\">http://hl7.org/fhir/stu3</a>'.<br>\nI wonder if there is a better way to do this. Should this be done in the template we use? <br>\nHad a look at the template but was not able to find a hook, but then again I do not know Jekyll well enough.</p>",
        "id": 180491632,
        "sender_full_name": "Cees de Jonge",
        "timestamp": 1573546317
    },
    {
        "content": "<p>no you don't need to do post-processing. If the references are to <a href=\"http://hl7.org/fhir\" target=\"_blank\" title=\"http://hl7.org/fhir\">hl7.org/fhir</a> there's something wrong. can I try building this IG?</p>",
        "id": 180493243,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573547601
    }
]