[
    {
        "content": "<p>I have a naive question about the Capabilities required in a Capability statement and how/whether they are inherited when profiling.   I think I've asked this before, but my search couldn't find the Q&amp;A.</p>\n<p>The <a href=\"https://www.hl7.org/fhir/us/core/StructureDefinition-us-core-organization.html\">USCore Organization</a> (for example) <a href=\"https://www.hl7.org/fhir/us/core/CapabilityStatement-us-core-server.html#organization\">requires</a> as a SHALL that the name and address search parameters be implemented.</p>\n<p>1) Do all use cases that incorporate the US Core Organization implicitly require that these search parameters be supported?   What if it is a use case where there are no search parameters (exchange of bundles that incorporate Organizations)?<br>\n2) If these search parameters do make sense in the use case for the profile, is the IG expected to state the requirement in its capability statement?  Or is the requirement implicit?</p>",
        "id": 266975867,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1641409220
    },
    {
        "content": "<p>in theory, theory and practice are the same... in practice they are not..... <br>\nNote that there are different kinds of CapabilityStatement. The one found in an IG is defining requirements of that IG, hence it is a 'requirements' kind. A specific product or instance would publish what they actually implement, which should be inclusive of the requirements, likely more than required, but might be different.</p>",
        "id": 266976464,
        "sender_full_name": "John Moehrke",
        "timestamp": 1641409450
    },
    {
        "content": "<p>USCore Organization (StructureDefinition) doesn't require <em>any</em> search parameters.  It's the CapabilityStatement that sets the requirement.  If a derived IG doesn't make use of the US Core CapabilityStatement, then none of the CapabilityStatement rules apply.</p>",
        "id": 266977274,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641409868
    },
    {
        "content": "<p>US Core documents this topics in the latest published version (4.0.0):  <a href=\"http://build.fhir.org/ig/HL7/US-Core/conformance-expectations.html\">http://build.fhir.org/ig/HL7/US-Core/conformance-expectations.html</a></p>",
        "id": 266986207,
        "sender_full_name": "Eric Haas",
        "timestamp": 1641414242
    }
]