[
    {
        "content": "<p>Dental IG defines a US-Core-based Dental Condition profile and a Dental Observation profile and received ballot comments suggesting that both have the concept of 'dental' be found on .category. Given that US Core Condition.category is extensibly bound to HL7 CodeSystems, is it preferable to define a CodeSystem containing a single concept 'dental' vs. binding .category to an umbrella <em>standard</em> concept (ie 116337000 Oral cavity finding (finding) or 118938008 “Disease of mouth” (disorder))? <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 234234249,
        "sender_full_name": "David deRoode",
        "timestamp": 1618262956
    },
    {
        "content": "<p>US-Core should not have bound all repetitions to a single code system - they should have broken out only one slice and bound only that.  However, so long as your codes are completely orthogonal to the bound set, you're free to define a slice that binds to something completely different.  Personally, I think \"dental\" is better than \"disease of the mouth\" because there are mouth things that aren't considered dental (and possibly some dental things that aren't strictly 'mouth' things, though that I'm less certain about.</p>",
        "id": 234437835,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618372811
    },
    {
        "content": "<p>us core binds to an extensible <em>value set</em> not <em>code system</em> ..... big difference.</p>",
        "id": 234442228,
        "sender_full_name": "Eric Haas",
        "timestamp": 1618377210
    },
    {
        "content": "<p>Neither value sets or code systems are extensible - what we do have is an extensible <strong>binding</strong> to a value set, which allows a concept that is not included in the value set to be sent if the meaning is not represented (at any level of granularity) by any of the concepts in the value set.  It's good to remind ourselves of that (even for vocabulary folks).</p>",
        "id": 234442851,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1618377831
    },
    {
        "content": "<p>My point is that US Core binds all repetitions to a single value set.  It should only bind <em>one</em> repetition to that value set.</p>",
        "id": 234863954,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618583784
    },
    {
        "content": "<p>Agree.</p>",
        "id": 234873081,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1618586634
    }
]