[
    {
        "content": "<p>In case anyone else runs into this, I had trouble with the IG Publisher hanging on the following line:<br>\nTerminology server: Check for supported code systems for urn:iso:std:iso:3166<br>\nThe solution for me was to delete the .fhir directory in my user directory. It still took a long time to run, but it eventually completed whereas previously I had to cancel the publisher after over an hour.</p>",
        "id": 203910224,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1594779210
    },
    {
        "content": "<p>that doesn't make any sense at all</p>",
        "id": 203911430,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594780791
    },
    {
        "content": "<p>sounds to me like you just used up some extra bandwidth</p>",
        "id": 203911478,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594780806
    },
    {
        "content": "<p>turn more logging on, and you'll find that you're loading up the terminology cache</p>",
        "id": 203911485,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594780822
    },
    {
        "content": "<p>Hi there I have been having the exact same issue but removing the .fhir directory and clearing the terminology cache did not resolve the problem for me. I also removed all instances of \"jurisdiction\" from the value sets located inside /input/resources but I then get a new error \"Terminology server: Check for supported code systems for <a href=\"http://unstats.un.org/unsd/methods/m49/m49.htm\">http://unstats.un.org/unsd/methods/m49/m49.htm</a> <br>\njava.lang.NullPointerException<br>\n    at org.hl7.fhir.utilities.Utilities.pathURL(Utilities.java:644)\" for jurisdiction located in other ValueSets.</p>",
        "id": 205601454,
        "sender_full_name": "Rich Boyce",
        "timestamp": 1596207926
    },
    {
        "content": "<p>It can take a <strong>very</strong> long time (it's been taking over 3 hours to rebuild the cache in our IPS IG).</p>",
        "id": 205601699,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1596208035
    },
    {
        "content": "<p>Time doesn't seem to be the issue at least for our situation, the process just fails</p>",
        "id": 205624613,
        "sender_full_name": "Rich Boyce",
        "timestamp": 1596220120
    },
    {
        "content": "<p>if your problem is that the publisher is unexpectedly taking a long time, clearing the terminology cache will definitely make that problem worse</p>",
        "id": 205636014,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596225942
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> -- we are <strong>not</strong> having an issue with how long the terminology cache is taking --- we are having an issue with the publisher not completing the term validation for our IG when all worked before. We have tried lots of things per the thread and tried to migrate to the templated approach.  We have even looked into the code to try and figure out what is going on. I fear we are going to miss the ballot deadline b/c we can't build this thing now when it worked fine before. Would you be willing to please check out of IG and see if you can spot something  obviouls we might have missed? So sorry to have to ask.</p>",
        "id": 205949058,
        "sender_full_name": "Rich Boyce",
        "timestamp": 1596569040
    },
    {
        "content": "<p>this is IPS? I built that yesterday based on what is in github</p>",
        "id": 205961153,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596575344
    },
    {
        "content": "<p>I don't think it's IPS.  I just mentioned that as I thought it might be an example of the issue Rick reported and that Rich might have been having.</p>",
        "id": 205961856,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1596575725
    }
]