[
    {
        "content": "<p>I'm trying to understand the role of the IG resource. Until recently, I thought it was necessary for building the package, but I see packages generated without an IG resource. I also see IG resources that only list the markdown or html content of the implementation guide, but omit listing the resources. I can use profiles on my server without an IG listing them, and have a valid IG that doesn't list profiles. I feel dumb asking for clarification, having been authoring them, but some recent counter examples have forced me to question the role.</p>",
        "id": 262733499,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1637865627
    },
    {
        "content": "<p>it's legal to produce packages without a IG resource, but the IG publisher doesn't know how to do that (there are other tools that do that)</p>\n<p>The IG resource serves as both input to a tool that produces IGs (the IG publisher mostly) - tells it what to do , and an output from it, tells tools about the package that's produced. In particular, it's how tools can turn a logical reference to a resource in the IG into a literal reference to the resource in the IG</p>\n<p>And there's conformance information in the resource as well</p>",
        "id": 262733722,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637865896
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179252-IG-creation/topic/Clarification.20on.20ImplementationGuide.20role/near/262733722\">said</a>:</p>\n<blockquote>\n<p>In particular, it's how tools can turn a logical reference to a resource in the IG into a literal reference to the resource in the IG</p>\n</blockquote>\n<p>Do you mean within an IG or package, or across IGs or packages?</p>\n<blockquote>\n<p>And there's conformance information in the resource as well</p>\n</blockquote>\n<p>Other than default profiles?</p>\n<p>If I have an implementation guide (set of resources and webpages) and the ability to create a package from them, and no default profiles, is there a reason I need to create an IG resource?</p>",
        "id": 262734040,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1637866283
    },
    {
        "content": "<p>you mean in general, or with the IG publisher?</p>",
        "id": 262734294,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637866585
    },
    {
        "content": "<p>in general, if you do that, the tools won't know how to transition from a logical reference to the resource in the package to a human navigable URL. I've put special arrangements in place for some external packages, but I'm not going to scale the special arrangements, which have a habit of breaking</p>",
        "id": 262734393,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637866700
    },
    {
        "content": "<p>I mean in general.</p>",
        "id": 262734409,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1637866729
    }
]