[
    {
        "content": "<p>I have added a new feature to the IG publisher.</p>",
        "id": 208950585,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1599131264
    },
    {
        "content": "<p>if you write a constraint on an element that follows this pattern:</p>\n<div class=\"codehilite\"><pre><span></span><code>(name | name | name).count = 1\n</code></pre></div>\n\n\n<p>(or &lt;= 1)<br>\nwhere all the names in the union are children of the element on which this invariant sits, then the IG publisher will understand that the named elements are a mutually exclusive group. That means that:</p>\n<ul>\n<li>They will be rendered as a mutually exclusive group in the table presentation form</li>\n<li>if you make one required in a profile, the others will automatically be set to max = 0 (that must be true, so it saves you from having to be explicit about it)</li>\n<li>the rendering as a group will collapse out if one of the elements is required </li>\n</ul>\n<p>I added this to reduce the comprehension impedence for CCDA guide readers</p>",
        "id": 208950949,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1599131490
    },
    {
        "content": "<p>Since we pretty much don't do this in the base spec, this is really only relevant for logical models. And honestly, it's probably only really relevant for RIM derived models like CDA, and there's a few other people working on similar v3 derived RMIMs as logical models</p>",
        "id": 208951082,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1599131553
    },
    {
        "content": "<p>where should we put a reference example for this: IG Guidance or Sample IG?</p>",
        "id": 208964755,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599139046
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> to document this via an example, where is it best?</p>",
        "id": 208987552,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599148020
    },
    {
        "content": "<p>Documentation in guidance, example in sampleIg</p>",
        "id": 209009464,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599157379
    }
]