[
    {
        "content": "<p>Hi,</p>\n<p>We have a UI client using the Communication resource as a basis for \"mailbox\" functionality. To that end they need some way of organising messages into logical \"threads\" (time based as eg. Outlook). Is there any recommended way of doing that? In principle the \"inResponseTo\" field can chain related messages, but digging up an entire thread would require a lot of roundtrips to the server. Any other recommended way of correlating messages?</p>\n<p>Thanks,<br>\nOle</p>",
        "id": 177708413,
        "sender_full_name": "Ole Hedegaard",
        "timestamp": 1570624315
    },
    {
        "content": "<p>That would be the primary mechanism.  You could also add a \"thread id\" extension and make it searchable (if the software involved has a sense of a thread being created).  As a poor-man's thread id, you could also define a \"smart\" search on subject that matches on subject, ignoring prefixes like fwd: and re: (or not being so smart if those prefixes aren't things that even need to be worried about)</p>",
        "id": 177723366,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570633963
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"199591\">@Ole Hedegaard</span>  FYI: inResponseTo is part of R4 (and probably onwards)</p>",
        "id": 178841250,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1571827074
    },
    {
        "content": "<p><code>inResponseTo</code> is multiple cardinality -- so it'd be possible to define a convention where every message in a thread includes the original message of the thread in its <code>inResponseTo</code> array. Not sure I like this, but it fits with the defined semantics and allows an easy search for \"all messages in thread\" (er, it would if we had a search parameter for <code>inResponseTo</code>).</p>",
        "id": 178866438,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1571845207
    }
]