[
    {
        "content": "<p>Is there a way to connect a FHIR IG with its related Project (PSS/Project Insight ID)? A cross-lookup between IG Package ID and Project Insight ID would be ideal.</p>",
        "id": 278338192,
        "sender_full_name": "Corey Spears",
        "timestamp": 1649439585
    },
    {
        "content": "<p>This is better in the IG creation channel.  Moving to there.</p>",
        "id": 278338376,
        "sender_full_name": "David Pyke",
        "timestamp": 1649439667
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"184932\" href=\"/#narrow/stream/184932-JIRA.2FConfluence/topic/Connecting.20IGs.20and.20HL7.20Projects\">#JIRA/Confluence &gt; Connecting IGs and HL7 Projects</a> by <span class=\"user-mention silent\" data-user-id=\"192587\">David Pyke</span>.</p>",
        "id": 278338398,
        "sender_full_name": "Notification Bot",
        "timestamp": 1649439684
    },
    {
        "content": "<p>still working on trying to fix the website to read Jira Project IDs (alphanumeric) alongside Project Insight IDs (numeric) - could the Jira-spec-artifacts config set up to link to the Jira project ID once I can render it?</p>",
        "id": 278338761,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1649439879
    },
    {
        "content": "<p>I had considered posting it here, but not all IGs have a PSS (non balloted), and this seemed like information that may be captured in Jira, Confluence, or project insight.</p>",
        "id": 278341041,
        "sender_full_name": "Corey Spears",
        "timestamp": 1649441005
    },
    {
        "content": "<p>The IG proposals have this information.  Once this stuff moves over to Jira, that'll be queriable.  (Note that the PSS associated with a given spec can change over time.)</p>",
        "id": 278341075,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649441029
    },
    {
        "content": "<p>Every IG <em>should</em> have a PSS if it's FHIR-created.  The PSS is the work group's \"authorization to do work\", and it's hard to manifest an IG without doing work :)</p>",
        "id": 278341188,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649441071
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193599\">@Lynn Laakso</span> We <em>could</em> add the PSS to the Specification file in JiraSpecArtifacts, and given that we'll eventually need it when we migrate all that information into Jira, it's not a horrible idea.  However, we'd need someone to go through and add PSS links to all of the existing data.  It's also not a super-visible data source.</p>",
        "id": 278341686,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649441318
    },
    {
        "content": "<p>Is there a definitional source someone could make available in an extract or something? <br>\nI have some 100 IG package IDs linked up with Project Insight IDs and PSSs (Jira PSS IDs and Confluence PSS page links in a spreadsheet. Not authoritative, and there some notable gaps. Just wondering if a list existed to complete mine or if my list may be of any use in starting an effort if such a list does not already exist.</p>",
        "id": 278449731,
        "sender_full_name": "Corey Spears",
        "timestamp": 1649569098
    },
    {
        "content": "<p>The linkage of PSS to specification is constantly changing.  The formal linkage exist right now only in the text of the project.  (The PSS used to approve an IG proposal isn't guaranteed to remain the active project forever and the IG proposals don't get updated if the project changes.)</p>",
        "id": 278473865,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649604457
    }
]