[
    {
        "content": "<p>I have a consent profile where we want to express the intended jurisdiction(s) where it is meant to apply. For example, this would a consent applicable in the US or this other consent would be applicable in California or any jurisdiction with reciprocity for a policy.  Where would we put such a concept?<br>\n<span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <span class=\"user-mention\" data-user-id=\"199026\">@k connor</span></p>",
        "id": 261038720,
        "sender_full_name": "Corey Spears",
        "timestamp": 1636571134
    },
    {
        "content": "<p>Include <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span></p>",
        "id": 261038910,
        "sender_full_name": "John Moehrke",
        "timestamp": 1636571231
    },
    {
        "content": "<p>I would say .policyRule</p>",
        "id": 261038923,
        "sender_full_name": "John Moehrke",
        "timestamp": 1636571235
    },
    {
        "content": "<p>what URL?</p>",
        "id": 261039581,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1636571549
    },
    {
        "content": "<p>Please note that it may be something translated from a paper form. Which means part or all of it might not be codified.</p>",
        "id": 261041632,
        "sender_full_name": "Corey Spears",
        "timestamp": 1636572453
    },
    {
        "content": "<p>Great question, Corey.  Think the agreed upon response should be reflected in the Consent guidance discussion.<br>\nGenerally, how you express the intended jurisdiction will be based on the use case.  You could use one or more Consent elements to capture this information directly/indirectly.<br>\nI agree with John that it could be .policyRule if you have/create a code representing the policy specifying a specific consent policy - see <a href=\"http://build.fhir.org/valueset-consent-policy.html\">http://build.fhir.org/valueset-consent-policy.html</a> for examples such as state (mdhhs-5515 ) or VA specific consent forms, or more general codes for types of consent permissible/required by a law but not a specific consent form e.g., hipaa-restrictions.  <br>\nYou could include the .policy.uri for a .policyRule consent form code.  Or simply .policy.uri where the consent policy is kept - e.g., an HIE's APPC XACML consent policy.  You could use .policy.authority in combination with .policyRule/.policy.uri to indicate the jurisdiction or organization authority in which either the  .policyRule/.policy.uri apply - which seems to be what you are looking for wrt to your specific use case.  Does this answer your question?</p>",
        "id": 261052746,
        "sender_full_name": "k connor",
        "timestamp": 1636577438
    }
]