[
    {
        "content": "<p>We are beginning work on supporting the <a href=\"http://hl7.org/fhir/2020Feb/references.html#CodeableReference\">CodeableReference</a> type in FHIR shorthand, and are running into questions about how constraints may be applied to a CodeableReference. As an example, let's say I wanted to constrain <code>CarePlan.activity.detail.reason</code> (a CodeableReference) to only be able to reference Condition. I can see that if I wanted to do this, I could change the <code>targetProfiles</code> array on <code>CarePlan.activity.detail.reason</code>. But would it be legal if instead I applied the constraint by changing <code>targetProfiles</code> on <code>CarePlan.activity.detail.reason.reference</code>? How do we handle cases where the CodeableReference and the Reference it contains both have constraints? It seems like a misuse of the CodeableReference type to do this, but I don't see anything saying I can't do this.</p>",
        "id": 224912022,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1612289538
    },
    {
        "content": "<p>Can you submit a change request for us to clarify that?</p>",
        "id": 224918268,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612291997
    },
    {
        "content": "<p>Sure thing, added a change request: <a href=\"https://jira.hl7.org/browse/FHIR-30877\">https://jira.hl7.org/browse/FHIR-30877</a>.</p>\n<p>If you already know how that guidance will be clarified, a sneak peek would be appreciated, so that we can support this correctly in FHIR Shorthand. But if some time will be needed to determine what should happen in this situation, no worries, we can wait.</p>",
        "id": 224922989,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1612294048
    },
    {
        "content": "<p>I suspect it'll be something like CodeableConcept and Coding - bindings can technically exist at either level, but should generally be applied at the top one.</p>",
        "id": 224923419,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612294259
    }
]