[
    {
        "content": "<p>Working with one of the IGs people have asked me to look at and an issue has come up that I'm not sure how to think about</p>",
        "id": 198141660,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589932663
    },
    {
        "content": "<p>if you have a resource with contained resources, the contained resources are never rendered - there's no <em>place</em> where the IG publisher can refer to them by</p>",
        "id": 198141714,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589932693
    },
    {
        "content": "<p>Is this about examples or about conformance resources (or both)?</p>",
        "id": 198141956,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589932975
    },
    {
        "content": "<p>particularly conformance resources. A good case is contained value sets</p>",
        "id": 198147471,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589940179
    },
    {
        "content": "<p>no feedback on this....</p>",
        "id": 199426644,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591047098
    },
    {
        "content": "<p>For examples, all we show now is narrative and the formal syntaxes.  The narrative should cover the relevant bits of the narratives too.  So the real issue is for the infrastructure resources where we don't show narrative and, perhaps, where a contained resource has a 'better' rendering available than the narrative.  I guess we <em>could</em> create separate page sets for each contained resource and include links to them from the containing resource.  We'd need to surface that in the table of contents (to handle section numbers properly - though that's going to be messy because right now the templates assume that resources can't have children...)  However, if we make that bit work, then the breadcrumbs should work ok.  It's not a bad idea.  It's not critically urgent for any IGs I'm doing right now, though SDC does have several examples with contained value sets, so it'd certainly be a \"nice-to-have\".</p>",
        "id": 199437217,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591055732
    },
    {
        "content": "<p>I do not think that it needs to be in the table of contents</p>",
        "id": 199447179,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591068465
    },
    {
        "content": "<p>Section numbering is driven by the table of contents</p>",
        "id": 199449493,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591072161
    },
    {
        "content": "<p>... well... as of the next commit, there will be pages (one or 2) for each contained resource</p>",
        "id": 199451662,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591075610
    },
    {
        "content": "<p>How will they be surfaced in the IG or data files?</p>",
        "id": 199452141,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591076460
    },
    {
        "content": "<p>(Templates can't link to what they don't know about...)</p>",
        "id": 199452152,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591076471
    },
    {
        "content": "<p>I don't know</p>",
        "id": 199458049,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591083116
    }
]