[
    {
        "content": "<p>Why does the QA.html file complain that:</p>\n<div class=\"codehilite\" data-code-language=\"code\"><pre><span></span><code>The copyrightYear parameter ('2021') in the IG resource can't be understood - expecting YYYY+\n</code></pre></div>\n<p>Why are we requiring the year be followed by a plus? Why don't we allow \"1930, 2020, 2022\" or \"2001-2050\" as  supported copyright year formats?</p>\n<p>This looks to be coming from the publisher (ValidationPresenter.java), but the check doesn't make sense to me.</p>",
        "id": 267015553,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1641432086
    },
    {
        "content": "<p>because people were putting crap in that, and all HL7 guides follow that format</p>",
        "id": 267016617,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1641433262
    },
    {
        "content": "<p>We're going to claim copyright forever and it's going to continue to be updated for some indeterminate period.  [startyear]+ is a clean, simple, consistent way to express that.  Is there a reason why you feel a specific IG <em>shouldn't</em> follow that pattern?</p>",
        "id": 267024062,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641442717
    },
    {
        "content": "<p>My, uneducated, understanding is that the copyright date is the first date of publication, or the date of publication of significant updates. It isn’t an assertion that copyright applies in each of the indicated years, but that the content was created (well, actually, published) in those years. (C) 2010-2016 makes sense if the content was updated in each of those six years. I suppose 2018+ could be read to convey that the content was updated in 2018 and every year since (including some time in the last 6 days), but I don’t think we really mean that. </p>\n<p>I sympathize with people putting crap in there, but surely there is a more flexible pattern that could be enforced. If this is an issue with HL7 IGs than perhaps the check belongs in the HL7 templates. It seems to me, that the publisher parameter should allow anything the element supports (e.g. any string value.).</p>",
        "id": 267036159,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1641457683
    },
    {
        "content": "<p>Actually, we sort of do mean that the content has continuously been updated since inception - because in most cases it will be updated, at least a tiny bit, every single year.</p>",
        "id": 267083943,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641487793
    },
    {
        "content": "<p>(If not, then it's questionable if the specification is being used at all and it's a candidate for retirement.)</p>",
        "id": 267084079,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641487832
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/Copyright.20year.20format/near/267083943\">said</a>:</p>\n<blockquote>\n<p>Actually, we sort of do mean that the content has continuously been updated since inception - because in most cases it will be updated, at least a tiny bit, every single year.</p>\n</blockquote>\n<p>For HL7 IGs, sure, up until it is normative, we expect the workgroup to be working on it, but once it is balloted, I don't think we do intend it to be continually tweaked. And even then, a balloted IG doesn't get modified; work is done on a new version (thus the balloted IG copyright would be up until its publication, the new version's copyright would cover the original dates plus the modification dates). I'd suggest the format for HL7 copyright dates should probably be coming from HL7 lawyers.</p>\n<p>For non-HL7 IGs, I suggest that it's up to the publishing organization to decide what they want--they may not be continually updating since inception, and may have other policies regarding retirement, and may have different opinions from their legal teams.</p>",
        "id": 267093047,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1641492126
    },
    {
        "content": "<p>you do recognize that point of stability will be well beyond retirement for all of us...</p>",
        "id": 267096941,
        "sender_full_name": "John Moehrke",
        "timestamp": 1641494058
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179252-IG-creation/topic/Copyright.20year.20format/near/267096941\">said</a>:</p>\n<blockquote>\n<p>you do recognize that point of stability will be well beyond retirement for all of us...</p>\n</blockquote>\n<p>IG stability or my stability?</p>",
        "id": 267097204,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1641494183
    },
    {
        "content": "<p>your stability expired years ago.</p>",
        "id": 267097298,
        "sender_full_name": "David Pyke",
        "timestamp": 1641494241
    },
    {
        "content": "<p>That's very generous of you to assume I ever had it.</p>",
        "id": 267097926,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1641494540
    },
    {
        "content": "<p>I haven't know you your entire life so I didn't want to assume</p>",
        "id": 267097954,
        "sender_full_name": "David Pyke",
        "timestamp": 1641494563
    }
]