[
    {
        "content": "<p>I was looking to confirm the canonical URL for a base resource, but was surprised that I couldn't easily locate it on the resource page. I was eventually able to find it at the bottom of the Resource content section:</p>\n<blockquote>\n<p>See the Profiles &amp; Extensions and the alternate definitions: Master Definition XML + JSON, XML Schema/Schematron + JSON Schema, ShEx (for Turtle) + see the extensions &amp; the dependency analysis</p>\n</blockquote>\n<p>The XML and JSON \"master definitions\" link to the resource StructureDefinitions, which include the url.</p>\n<p>Surely, there is a simpler way to get there, but I can't see it right now.</p>\n<p>On a similar vein, is there an easy way to see the IG instance for an IG? It doesn't appear in the standard list of artefacts, etc.</p>",
        "id": 254749375,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632507674
    },
    {
        "content": "<p>We don't have a great way to render the IG resource as its own thing.  Why do you want to see it?  Exposing the canonical URL for core resources will take a Git issue against the ig-publisher</p>",
        "id": 254759868,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632512028
    },
    {
        "content": "<p>It the IG resource doesn't need to be rendered, I'd just like to be able to look at it as xml/json, like I can do for everything that is in the guide. In this case, I wanted to see which resources were included in the IG, since the hand-crafted table of contents wasn't listing them all.</p>\n<p>Exposing the canonical for core resources is  a Git issue against the ig-publisher or against kindling?</p>",
        "id": 254768449,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632515682
    },
    {
        "content": "<p>kindling</p>",
        "id": 254769261,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632516073
    },
    {
        "content": "<p><a href=\"https://github.com/HL7/kindling/issues/37\">https://github.com/HL7/kindling/issues/37</a>.</p>",
        "id": 254770460,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632516635
    },
    {
        "content": "<p>It’s in the package</p>",
        "id": 254771553,
        "sender_full_name": "Eric Haas",
        "timestamp": 1632517176
    },
    {
        "content": "<p>All of the resources <em>should</em> be listed on the artifacts.html page.  What ones are you finding that are missing <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>?</p>",
        "id": 254771975,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632517327
    },
    {
        "content": "<p>The IG I was looking at didn't have an artifacts page.</p>",
        "id": 254772078,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632517367
    },
    {
        "content": "<p>Didn't have it, or just failed to reference it in the menu I wonder?  If it's using the base template, it's going to have one.  Should still be in the toc as IG authors don't have control over that (unless they completely override the template)</p>",
        "id": 254772284,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632517453
    },
    {
        "content": "<p>didn't reference it in the menu. They had a custom menu.</p>",
        "id": 254772348,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632517489
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  it <em>is</em> in the package, but so are all the profiles, valuesets, codesystems, etc., yet we still render those.</p>",
        "id": 254772419,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632517527
    },
    {
        "content": "<p>Those have information the implementer needs to see.  The IG is a package and metadata.  The packaged stuff is already there (in artifacts, toc and zip) and the metadata is also visible.  Having the IG as a separate page \"within\" the IG just seems redundant.  (Failure to point to the artifacts page in the menu is something we might at least want to spit out a QA warning about - feel free to submit a Git issue against the base template on that.)</p>",
        "id": 254774117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632518313
    },
    {
        "content": "<p>FWIW, I disagree about showing the canonical URL for the definition of the resource in the core spec. It's such a narrow interest - who cares, and why?</p>",
        "id": 254776631,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632519516
    },
    {
        "content": "<p>Wow, this is a tough crowd today. I wonder what I'm doing that's causing me to see these as issues that you aren't seeing.</p>",
        "id": 254777814,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632520145
    },
    {
        "content": "<p>OK, so if I'm filling in a StructureDefinition for a profile, what goes in baseDefinition?</p>",
        "id": 254777953,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632520204
    },
    {
        "content": "<p>Or in ElementDefinition.type.targetProfile?<br>\nDon't both of those need the core spec canonicals?</p>",
        "id": 254778088,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632520288
    },
    {
        "content": "<p>I thought all you wanted was the canonical?   can also get from qa.html which lists link to the page -</p>",
        "id": 254784294,
        "sender_full_name": "Eric Haas",
        "timestamp": 1632523927
    },
    {
        "content": "<p>The base canonicals are easily inferred and given the amount of learning needed, it's a super minor thing.</p>",
        "id": 254786741,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632525723
    },
    {
        "content": "<p>I'm with <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> on this one.  I've also wondered the same thing.  I don't really see a reason <em>not</em> to include the canonical URL for core resources.  After all, it is the only globally unique identifier for the resource.  It can be easily inferred, but inference doesn't copy it into my clipboard. ;-)</p>",
        "id": 254791195,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1632528967
    },
    {
        "content": "<p>Throwing the 'copy canonical' and 'copy versioned canonical' hover buttons beside the resource names wouldn't be visually overwhelming and would meet the need?  (It saves a bunch of typing and a possible source of transcription errors.)</p>",
        "id": 254797637,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632534724
    },
    {
        "content": "<p>I think so, although not just resources—data types too.</p>",
        "id": 254802080,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632538985
    },
    {
        "content": "<p>Folks…There is a 2year old resolved tracker for this .  I lodged the ticket and voiced my opposition  to the hover feature which defeats the purpose.  Since then I have dropped it and just find the urls directly.</p>",
        "id": 254854251,
        "sender_full_name": "Eric Haas",
        "timestamp": 1632589422
    },
    {
        "content": "<p>How does it defeat the purpose?</p>",
        "id": 254866283,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632600066
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> , are you talking about <a href=\"http://jira.hl7.org/browse/FHIR-20356\">J#20356</a>? <br>\nDropped it? As in giving up waiting for a fix to an issue filed 30 months ago that was \"resolved\" 18 months ago?</p>",
        "id": 254894244,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632627661
    },
    {
        "content": "<p>(And while I'm looking through old tickets, I see <a href=\"http://jira.hl7.org/browse/FHIR-28881\">J#28881</a>, which was resolved in January that agrees on the need for an IG resource page in the IG, including showing dependencies. <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  also raised a <a href=\"https://github.com/HL7/ig-template-base/issues/30\">similar issue</a> in the template github.)</p>",
        "id": 254895045,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632628531
    }
]