[
    {
        "content": "<p>Now that I have got a set of profile structure definitions rendering in a minimal guide basically using </p>\n<div class=\"codehilite\"><pre><span></span>{% include table-structuredefinitions.xhtml %}\n</pre></div>\n\n\n<p>I see the following issues:<br>\n1. The Device.property rendering has incorrect order: Have valueQuantity, type, valueCode : should be  type, valueQuantity, valueCode<br>\n2. Issues with rendering a derived profile (the base profile renders ok)<br>\n    -  Slices on CodeableConcept coding elements are not rendered in components. value[x] elements rendered ok<br>\n    -  Diff of derived resource does not contain diff of base resource. The reader has to look at both diff fields to see how the derived resource is constrained from the base FHIR resource. That requirement is hard on the reader. Its hard enough that the IG developer seriously considers not using Base resources so the reader can more easily understand what the profile is doing. The cost to the developer of the IG guide is the potential for misses when updating/making changes (forgetting to make the same change in all copies of what would have been the Base).</p>",
        "id": 153998031,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537349137
    },
    {
        "content": "<p>Solved one of the issues <br>\nSlices on CodeableConcept coding elements are not rendered in components. value[x] elements rendered ok</p>\n<p>Needed to place this extra element before the codings</p>\n<div class=\"codehilite\"><pre><span></span>    &lt;element id=&quot;Observation.component:[sliceName].code&quot;&gt;\n      &lt;path value=&quot;Observation.component.code&quot; /&gt;\n    &lt;/element&gt;\n</pre></div>",
        "id": 153998037,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537354453
    },
    {
        "content": "<p>I don't know what this means:</p>\n<blockquote>\n<p>Diff of derived resource does not contain diff of base resource</p>\n</blockquote>",
        "id": 153998877,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537498632
    },
    {
        "content": "<blockquote>\n<p>I don't know what this means:</p>\n<blockquote>\n<p>Diff of derived resource does not contain diff of base resource</p>\n</blockquote>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>   What that mean is that I have two profiles; a base profile common to N other profiles based on the Observation resource. The other N profiles are based upon the base profile. When I look at the 'diff' of one of the inherited profiles, the diff of the base profile is not included.  What an implementer is really interested in is how the inherited profile differs from the Observation which is the base spec.</p>\n<p>What I could do instead is not define a base profile at all but simply copy it N times into the inherited profiles. That would give a result much friendlier to the reader of the IG. But it would make maintenance a lot more error prone (forget to update a change in all N places).</p>",
        "id": 153998934,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537518885
    },
    {
        "content": "<p>well, I don't agree that it would be much more friendlier - it depends on what the reader wants</p>",
        "id": 153998953,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537527116
    },
    {
        "content": "<p>I'll add generating it to my wishlist</p>",
        "id": 153998954,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537527164
    },
    {
        "content": "<blockquote>\n<p>well, I don't agree that it would be much more friendlier - it depends on what the reader wants</p>\n</blockquote>\n<p>I was thinking just to see how the profile has restricted/modified the base FHIR resource. Actually I expected to see everything I entered in my differential field displayed in the diff rendering.</p>",
        "id": 153999211,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537574934
    },
    {
        "content": "<p>what is not displayed?</p>",
        "id": 153999222,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537577444
    },
    {
        "content": "<blockquote>\n<p>what is not displayed?</p>\n</blockquote>\n<p>definitions, comments, (short is displayed so I have made a lot of use of that). I guess that's about it, at least of that I used. I think I had to make a -dict rendering to see those. Also, on the FHIR pages, when one clicks on an element in the structure definition one comes to the 'dict' page. That does not happen in these renderings. Is that something in the plans? A diict page might be nice to have in addition to the diff and snapshor in the rendered Tables.</p>",
        "id": 153999251,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537610469
    },
    {
        "content": "<p>The IGPublisher does produce a dict page, however you need to define a template that exposes it.</p>",
        "id": 153999263,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537626619
    },
    {
        "content": "<p>I resolved all the conflicts.  some of them are build generated artifacts and I am banking on them being rebuilt with each new build.</p>",
        "id": 153999570,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537822270
    }
]