[
    {
        "content": "<p>Hi,<br>\nhow would I go about I want to customise a valueset, profile or extension in how it presents in the IG? Using template I can add menu-items and pages under that and change the CSS, but the actual text in a profile is derived from the structure-definition I suppose?</p>",
        "id": 263853616,
        "sender_full_name": "Arvid Thunholm",
        "timestamp": 1638799342
    },
    {
        "content": "<p>The presentation is determined by a combination of content in the artifact (profile, valueset, etc.), supplemental information that is provided as part of the IG that appears before and after the standard artifact information,  specific logic written in the publisher that renders the artifacts in different ways, and a set of publishing templates that combines those publisher-generated fragments, intro, notes and other information into an organized web-page.  So \"how\" is somewhat dependent on exactly what you want to customize :)</p>",
        "id": 263857198,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638800946
    },
    {
        "content": "<p>I´m trying to publish a table describing how a specific Valueset should be used mapped to other codesystems without creating a concept map</p>",
        "id": 263858377,
        "sender_full_name": "Arvid Thunholm",
        "timestamp": 1638801476
    },
    {
        "content": "<p>You could stick that in the 'notes' for the value set if you wanted.</p>",
        "id": 263866001,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638804371
    },
    {
        "content": "<p>why wouldn't you create a concept map?</p>",
        "id": 263898385,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638816844
    },
    {
        "content": "<p>I could create a concept map, thats true. A better example: For the Patient profile, I would like to describe how the combination of Address.use, Address.type and an extension we have created should be used to express different kinds of addresses.</p>",
        "id": 263969698,
        "sender_full_name": "Arvid Thunholm",
        "timestamp": 1638864955
    },
    {
        "content": "<p>e.g. in argonaut scheduling, appointment profile they start with a text describing a set of rules for the profile<br>\n<a href=\"https://fhir.org/guides/argonaut/scheduling/StructureDefinition-argo-appt.html\">https://fhir.org/guides/argonaut/scheduling/StructureDefinition-argo-appt.html</a><br>\nIs there a way to acheive that using shorthand and IG publisher?</p>",
        "id": 263972825,
        "sender_full_name": "Arvid Thunholm",
        "timestamp": 1638867315
    },
    {
        "content": "<p>well, that's done with the IG publisher, but I'm not sure how</p>",
        "id": 263978770,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638870962
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  with notes - did you mean this:</p>\n<p>{artifact-file-name}-intro.xml|md: If present, the contents of the file will be placed on the relevant page before the artifact’s definition.<br>\n{artifact-file-name}-notes.xml|md: If present, the contents of the file will be placed on the relevant page after the artifact’s definition.</p>\n<p>That will work fine</p>",
        "id": 264014766,
        "sender_full_name": "Arvid Thunholm",
        "timestamp": 1638890130
    },
    {
        "content": "<p>Yes</p>",
        "id": 264020662,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638892522
    }
]