[
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-30780\">J#30780</a> and others show the readers confusion when there are all bindings and invariants in all the view.  So I would like to propose a change to provide binding and invariant lists for the different views of differential, invariants and MS.  And would like to get folks feedback on the change before propose it to publishing.</p>",
        "id": 227141632,
        "sender_full_name": "Eric Haas",
        "timestamp": 1613883108
    },
    {
        "content": "<p>Agree that this should be done.  I.e. that the bindings and invariant lists should be part of the 'tabbed' content.  (Note that the MS view needs to evolve to not only show the MS elements, but also all of the mandatory and modifier elements - i.e. \"the stuff you absolutely must worry about as an implementer\")  The snapshot view is going to be big, but that's the joy of snapshot.  The other views should be much more reasonable, which will be helpful.</p>",
        "id": 227142359,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613884024
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>     Where are with this?  Does this need to be elevated to a github issue or tracker?</p>",
        "id": 241989270,
        "sender_full_name": "Eric Haas",
        "timestamp": 1623187839
    },
    {
        "content": "<p>There's already a Git issue for my proposed changes.  The concern around next/prev. has made me reluctant to proceed with changes that will impact everyone without better process in place for getting consensus around those changes.  I had hoped to move that further along by now, but dev days + getting ready for a family vacation next week  means I'm unlikely to get more done than sending out a solicitation for time-zones for participants before I leave.  My guess is first meeting will be in July.  Presuming there's consensus I'll try to get it done in mid-July.</p>",
        "id": 242010329,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623204287
    }
]