[
    {
        "content": "<p>I tried to add an R5 element  to an R4 element using this backport extension...</p>\n<div class=\"codehilite\" data-code-language=\"yml\"><pre><span></span><code># ...\n  element:\n    - id: DiagnosticReport\n      path: DiagnosticReport\n      short: US Core Diagnostic Report Profile for Report and Note exchange\n      definition: &gt;-\n        Clinical Testing and Imaging tests performed on a patient that results in structured or unstructured (narrative) findings specific to the patient.\n      alias:\n        - Imaging Report\n        - Radiology Report\n        - Clinical Test Report\n      mustSupport: false\n#=========== R5 extension for R5 media element ==============\n    - id: 'DiagnosticReport.extension:r5media'\n      path: DiagnosticReport.extension\n      sliceName: r5media\n      min: 0\n      max: '1'\n      type:\n        - code: Extension\n          profile:\n            - 'http://hl7.org/fhir/4.6.0/StructureDefinition/extension-DiagnosticReport.media'\n      mustSupport: true\n#===============================\n#etc\n</code></pre></div>\n<p>and not working getting this error. and ugly output</p>\n<blockquote>\n<p>StructureDefinition.snapshot.element[8].type[0].profile[0] error   Canonical URL '<a href=\"http://hl7.org/fhir/4.6.0/StructureDefinition/extension-DiagnosticReport.media\">http://hl7.org/fhir/4.6.0/StructureDefinition/extension-DiagnosticReport.media</a>' does not resolve</p>\n</blockquote>\n<p><a href=\"/user_uploads/10155/6Qjgm2CKyrmSkZo0l8QUir1F/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/6Qjgm2CKyrmSkZo0l8QUir1F/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/6Qjgm2CKyrmSkZo0l8QUir1F/image.png\"></a></div>",
        "id": 260930339,
        "sender_full_name": "Eric Haas",
        "timestamp": 1636513332
    },
    {
        "content": "<p>must be /5.0/ not /4.6.0/</p>",
        "id": 260941904,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1636515451
    },
    {
        "content": "<p>Using <code>http://hl7.org/fhir/5.0/StructureDefinition/extension-DiagnosticReport.media</code> I get this invalid extension error</p>\n<p>Stack Dump (for debugging):                                                      (01:20.0758)<br>\njava.lang.Exception: Error generating snapshot for /Users/ehaas/Documents/FHIR/Healthedata1-Sandbox/input/resources/StructureDefinition-uscdiv2-diagnosticreport(us-core-diagnosticreport-note): Unable to generate snapshot for <a href=\"http://hl7.org/fhir/us/core/StructureDefinition/us-core-diagnosticreport-note\">http://hl7.org/fhir/us/core/StructureDefinition/us-core-diagnosticreport-note</a> in /Users/ehaas/Documents/FHIR/Healthedata1-Sandbox/input/resources/StructureDefinition-uscdiv2-diagnosticreport<br>\n    at org.hl7.fhir.igtools.publisher.Publisher.generateSnapshots(Publisher.java:4692)<br>\n    at org.hl7.fhir.igtools.publisher.Publisher.loadConformance(Publisher.java:3976)<br>\n    at org.hl7.fhir.igtools.publisher.Publisher.createIg(Publisher.java:901)<br>\n    at org.hl7.fhir.igtools.publisher.Publisher.execute(Publisher.java:753)<br>\n    at org.hl7.fhir.igtools.publisher.Publisher.main(Publisher.java:8766)<br>\nCaused by: org.hl7.fhir.exceptions.FHIRException: Unable to generate snapshot for <a href=\"http://hl7.org/fhir/us/core/StructureDefinition/us-core-diagnosticreport-note\">http://hl7.org/fhir/us/core/StructureDefinition/us-core-diagnosticreport-note</a> in /Users/ehaas/Documents/FHIR/Healthedata1-Sandbox/input/resources/StructureDefinition-uscdiv2-diagnosticreport<br>\n    at org.hl7.fhir.igtools.publisher.Publisher.generateSnapshot(Publisher.java:4741)<br>\n    at org.hl7.fhir.igtools.publisher.Publisher.generateSnapshots(Publisher.java:4690)<br>\n    ... 4 more<br>\nCaused by: org.hl7.fhir.exceptions.FHIRException: Reference to invalid extension <a href=\"http://hl7.org/fhir/5.0/StructureDefinition/extension-DiagnosticReport.media\">http://hl7.org/fhir/5.0/StructureDefinition/extension-DiagnosticReport.media</a><br>\n    at org.hl7.fhir.r5.conformance.ProfileUtilities.processPaths(ProfileUtilities.java:1161)<br>\n    at org.hl7.fhir.r5.conformance.ProfileUtilities.processPaths(ProfileUtilities.java:1528)<br>\n    at org.hl7.fhir.r5.conformance.ProfileUtilities.generateSnapshot(ProfileUtilities.java:653)<br>\n    at org.hl7.fhir.igtools.publisher.Publisher.generateSnapshot(Publisher.java:4739)<br>\n    ... 5 more</p>",
        "id": 260949497,
        "sender_full_name": "Eric Haas",
        "timestamp": 1636524372
    },
    {
        "content": "<p>guess I'll have to debug - how can I do that?</p>",
        "id": 260950202,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1636525158
    },
    {
        "content": "<p>I'll create a test branch that works this time and let you know.</p>",
        "id": 261006165,
        "sender_full_name": "Eric Haas",
        "timestamp": 1636558262
    },
    {
        "content": "<p>Is there a story for complex element backports? Like a new complex element in R5... what do the (implicit?) backport extensions) look like?</p>",
        "id": 261287583,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1636739581
    },
    {
        "content": "<p>IIRC, it's basically a complex extension w/ sub-extensions defined inline w/ relative paths.  We had to implement something in SUSHI that basically synthesized these extensions when someone used them.  At the time, the doc lacked a lot of details, but I filed a Jira issue to fill out some of the gaps.  The resolution provides some of the guidance that will be added to the spec: <a href=\"https://jira.hl7.org/browse/FHIR-31721\">https://jira.hl7.org/browse/FHIR-31721</a></p>",
        "id": 261294704,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1636742796
    },
    {
        "content": "<p>BTW -- we've not yet integrated (into SUSHI) the newer information from the resolution.  So some of what SUSHI does may be out of alignment w/ this new guidance.  But I think that's outside the scope of this particular conversation anyway.</p>",
        "id": 261294795,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1636742863
    },
    {
        "content": "<p>General question on this - since R5 isn't published yet, what happens to extensions linked this way if the path/type/cardinality/etc. changes?</p>",
        "id": 261516769,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1636991664
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 261525481,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1636995265
    },
    {
        "content": "<p>then they have to change</p>",
        "id": 261544623,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637003568
    },
    {
        "content": "<p>How?  If someone publishes an IG with an extension today, it will have a definition.  If the extension is arbitrarily broken in an update to R5, does that mean the IG needs to be updated?  Does the old version stop working?  Does the IG automatically refer to the new version?  If the change is to type/cardinality, don't we now have two definitions on the same URL with different type info, or does the implicit definition include some versioning info I missed?</p>\n<p>Sorry if this is a lot, I'm just trying to understand how you can safely link to unpublished content.. so far, my understanding has been that you can't.  I'm trying to figure out if I'm missing something, since it appears that people are doing exactly that.</p>",
        "id": 261553249,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1637007530
    },
    {
        "content": "<p>It seems to me that using extensions that reference types from a future version of FHIR should be accompanied by a big fat \"use at your own risk\" warning.  I think it's a valid question to ask if stable versions of IGs should be allowed to reference unstable versions of FHIR.  In fact, since the backport extension URLs don't specify any minor version components, it's not even necessarily linked to a specific ballot version -- which makes it pretty difficult to reproduce the build.</p>",
        "id": 261554684,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1637008135
    },
    {
        "content": "<p>right. it's not entirely use at own risk. if you are publishing a guide that uses an R5 extension in advance of the publication of R5, you can at least let the committee know and expect that they'll keep this in mind doing reconciliation but if they don't... well, validation will start failing once a different extension definition is published (I update the R5 definitions each time I publish a R5 candidate).</p>",
        "id": 261558825,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637010316
    },
    {
        "content": "<p>Right.  Well, I'll say this hasn't changed my mind on the topic - I feel like it's handing users a loaded gun with an extra-heavy barrel and hoping they don't shoot themselves in the foot.</p>\n<p>I'd recommend a warning stronger than \"use at your own risk\".  Something more like \"only use this if you are absolutely sure you know what you are doing, and even then you should probably check twice\".</p>",
        "id": 261559983,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1637010831
    },
    {
        "content": "<p>my point isn't about the strength of the warning, but that it's not entirely user level risk. It's committee/editor risk as well</p>",
        "id": 261560362,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637010995
    },
    {
        "content": "<p>If you're arguing that we shouldn't have the ability to link to unpublished content, you're not going to get an argument from me  =).  In fact, I would happily put forward the argument that this should not be allowed.</p>\n<p>For me, the main reason is a whole set of undefined behavior areas that I don't think we can get around.  E.g., if a ballot/publication happens with links to content that isn't stable, which then changes, what's the state of a published IG?  The definition used when it was balloted/published is no longer available, and the extension it points to may or may not even exist.</p>\n<p>You will have things like R4 implementations that work one day and are incompatible with ones made the next day - against the same version of the same published document.</p>\n<p>I don't think there's a process that avoids that, other than locking down anything that gets referenced (but that invalidates the whole FMM process).</p>",
        "id": 261563259,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1637012412
    },
    {
        "content": "<p>Isn't that why we have the STU status for IGs? The backport extensions are only allowed in IGs, and IGs can't be normative with backport extensions that are not against a published version. If that is not a current rule, is should be <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span> </p>\n<p>This way the capability is useful, and still allows for the flexibility of STU.</p>",
        "id": 261565666,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1637013591
    },
    {
        "content": "<p>Sure, but they still break.  Making IG authors define the extension in the IG is an extra step, but ensures that none of these problems happen.</p>",
        "id": 261565888,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1637013658
    },
    {
        "content": "<p>STU shouldn't mean that validation will arbitrarily stop working for a published release.  That's a bit more precarious than typical STU.  It might not be a bad idea to highlight the risk in the IG text.  We had talked about the possibility of propagating a copy of the pre-adopted extension into the IG package which would have avoided the validator breaking problem, but Grahame nixed that.</p>",
        "id": 261568978,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637015181
    },
    {
        "content": "<p>I'm not particularly fussed about validation so much as actual usage - I don't know how to resolve some of the states.  For a concrete example: if a  IG-A uses an element in R5 that is a <code>0..1</code>, <code>string</code> when it ballots, then the element moves <code>0..*</code>, <code>Backbone</code> in R5 and IG-B ballots, what happens?</p>\n<p>First is <em>just</em> in IG-A: the name of the <code>value[x]</code> is wrong, and it is the wrong structure.</p>\n<p>But, say these were two related IGs that just happen to have been balloted in different cycles.  Now they have the same extension URL with different, incompatible, definitions.</p>\n<p>What is the expectation on using that value in IG-A?  Is it still the single value, even though the 'official' definition for that extension is an array now?  The two IGs were expecting to interoperate, but because of a publication timeline they don't.. does IG-A need to re-publish (noting that it may be months before the next publication window, at the very least missing the next connectathon)?</p>\n<p>I'm using that as an example, but at the end of the day I see linking to unpublished content as <em>extremely</em> fragile.  Given the opportunity for problems, wouldn't it be easier to limit it to published content and give guidance on how to define a similar extension, in your IG, for unpublished content?</p>",
        "id": 261571628,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1637016457
    },
    {
        "content": "<p>well, in the future, IG QA pages will call out any reference to R5 so that we're more aware of it. but there's no simple solution to this</p>",
        "id": 261581027,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637022103
    },
    {
        "content": "<p>Or, we could say that with implementer experience this feature was deemed unsafe and have it start throwing errors moving forward.</p>\n<p>edit: for clarification, I mean referring to unpublished content</p>",
        "id": 261654537,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1637075376
    }
]