[
    {
        "content": "<p>We are using Trifolia to create our IG. We have a page that provide a download link for our xlsx file. As Trifolia doesn't support importing xlsx file into the system, we have to convert the file into Base64 encoded content and put the whole content into the page. The build error below comes from the download link:<br>\nThe link 'data:application/vnd.openxmlformats-...........for \"SDOHCC Master and Temporary Code List v0.0.3.xlsx\" cannot be resolved<br>\nPlease help. Thank you. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 195199890,
        "sender_full_name": "Cheng Liu",
        "timestamp": 1587740217
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Are we comfortable having links where the content is actually embedded in the link?</p>",
        "id": 195219334,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587748847
    },
    {
        "content": "<p>data: is restricted to 16k. So that won't work. I think you'll have to talk to <span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span> for other options</p>",
        "id": 195247764,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1587764452
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  Gentlemen,  The CARIN BB IG uses this same approach.  If an alternative approach is not yet available, then I would ask that the error be allowed to be \"ignored\" until such time that a fix is provisioned.  Does that seem reasonable?</p>",
        "id": 195578214,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1588086629
    },
    {
        "content": "<p>As Grahame points out, this approach is not permitted for data over 16k - which would be pretty much any xlsx file.   Trifolia will have to figure out a way to store the file.  Whether we can ignore the issue with something going to ballot depends on whether there's a need for balloters to look at the Excel file.  If they do, we can't ignore.  We certainly can't ignore for publication.</p>",
        "id": 195583783,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588088901
    },
    {
        "content": "<p>In the worst case, you could export your content from Trifolia and maintain the files directly in Git.</p>",
        "id": 195583886,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588088942
    }
]