[
    {
        "content": "<p>I have an enhancement request so that an IG shows what other profiles use or derive from a profile. I have the logic to determine that list, and create html for it, but it's not obvious where that should go in the output. I've tried generating it into StructureDefinition-[id]-header.xhtml, but the templates are not currently using that (or at least, some don't seem to be)</p>",
        "id": 251286842,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630353934
    },
    {
        "content": "<p>so I'm interested in some discussion about where this output should go.</p>",
        "id": 251286897,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630353959
    },
    {
        "content": "<p>Another tab?  That way it's available to those that want to see it.</p>",
        "id": 251288506,
        "sender_full_name": "David Pyke",
        "timestamp": 1630354661
    },
    {
        "content": "<p>it's not really long - just two sentences, with a list of resources in each</p>",
        "id": 251289110,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630354905
    },
    {
        "content": "<p>Similar formatting to what we have in the spec \"this resource is referenced by..\"?</p>",
        "id": 251291152,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1630355851
    },
    {
        "content": "<p>and I presume this list includes only artifacts within the same IG, right?</p>",
        "id": 251291367,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1630355951
    },
    {
        "content": "<p>\"In this IG, the following structures are derived from this profile:\"</p>",
        "id": 251291426,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630355980
    },
    {
        "content": "<p>\"In this IG, the following structures refer to this profile:\"</p>",
        "id": 251291443,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630355986
    },
    {
        "content": "<p>yes. can only be in the same IG</p>",
        "id": 251291454,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630355991
    },
    {
        "content": "<p>My thought is a separate fragment.  We can stick a reference to it before the resource table set of tabs.  That'd be consistent with how we handle resources - which is one of my guideposts for how IGs should present things.</p>",
        "id": 251297515,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630358742
    }
]