[
    {
        "content": "<p>I get an error when I include an example for an ODH profile: <code>Internal error: Could not match discriminator ([code.coding.code]) for slice Observation.component:odh-IsCurrentJob in profile http://hl7.org/fhir/us/odh/StructureDefinition/odh-PastOrPresentJob - the discriminator [code.coding.code] does not have fixed value, binding or existence assertions</code></p>\n<p>This is an issue with the published ODH profile, they are aware of it, and are working on fixing it. Obviously it's not going to get fixed and published before we go to ballot.  What is the best course of action? Should I just remove the example so that I get rid of the error in the IG and then put it back in before publication?</p>",
        "id": 217845678,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1606281726
    },
    {
        "content": "<p>does the error have more impact other than just appearing in the QA?</p>",
        "id": 217847939,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1606284644
    },
    {
        "content": "<p>What do you mean \"more impact\"?</p>",
        "id": 217848307,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1606285272
    },
    {
        "content": "<p>Is it going to impact the ability of the balloter to understand what's going on?  Are all of the examples you're producing actually correct?</p>",
        "id": 217951284,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606347212
    },
    {
        "content": "<p>I don't think it will impact the ability of the balloter to understand what is going on. The only issue is that there are currently no examples in the ODH spec so our examples are all our implementers have to go from. Having said that, I don't think they are needed for ballot as this isn't new in this version of the IG. </p>\n<p>As far as I know the examples are correct - it's hard to tell when you get an \"internal error\" because the actual profile you are trying to validate against is not valid. That's the point of being able to validate against a profile - to make sure your examples are correct! <span aria-label=\"neutral\" class=\"emoji emoji-1f610\" role=\"img\" title=\"neutral\">:neutral:</span></p>\n<p>I would be fine removing the examples for ballot. The commenters aren't reviewing the ODH profiles, they are reviewing the eCR profiles (and luckily the ODH profiles are optional in eCR).</p>",
        "id": 217956686,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1606353025
    },
    {
        "content": "<p>the point of the QA is to improve the IG. It's not a goal in it's own right. if the IG is better because content is in there, and the QA is wrong about it, I'd rather have the content in there</p>",
        "id": 217959887,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1606357343
    },
    {
        "content": "<p>Well, the QA isn't wrong. The actual profile is wrong. </p>\n<p>But the IG is definitely better with the the example there.</p>",
        "id": 217961384,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1606359737
    },
    {
        "content": "<p>keep it in there then</p>",
        "id": 217961390,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1606359753
    },
    {
        "content": "<p>Shall do.</p>",
        "id": 217961497,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1606359906
    }
]