[
    {
        "content": "<p>I am trying to add an example bundle to my IG. I have started with a very simple collection bundle. But I get an error \"Unable to find exampleFor resource\".... WHAT?</p>",
        "id": 157821160,
        "sender_full_name": "John Moehrke",
        "timestamp": 1549580566
    },
    {
        "content": "<p>Do you have the correct URL for the profile as the exampleFor?  Is the profile listed in the IG before the example is?</p>",
        "id": 157822459,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549582020
    },
    {
        "content": "<p>I don't know? I don't have any idea what \"exampleFor\" is refering to. The example is listed as the last resource in the IG. it is checked in.</p>",
        "id": 157825004,
        "sender_full_name": "John Moehrke",
        "timestamp": 1549584713
    },
    {
        "content": "<p>It's produced in the JSON based on the exampleCanonical in the ImplementationGuide.  It points to the profile the example is an example \"of\".</p>",
        "id": 157829293,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549590491
    },
    {
        "content": "<p>so, in the example those resources that are examples of compliant with your IG profiles, need to have the &lt;meta&gt; saying so... and the Ig &lt;exampleCanonical&gt; would be that profile canonical (ish)... right?   This is now understandable as logical, but was not obvious.</p>",
        "id": 157869530,
        "sender_full_name": "John Moehrke",
        "timestamp": 1549641688
    },
    {
        "content": "<p>Right.  The meta saying so will make the validator look at them and the exampleCanonical will make them show up on the example tab for that profile</p>",
        "id": 157873635,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549644759
    },
    {
        "content": "<p>sure wish the \"Validating Resources\" would express the problem rather than just nullPointerException...</p>",
        "id": 157873848,
        "sender_full_name": "John Moehrke",
        "timestamp": 1549644950
    },
    {
        "content": "<p>If it throws an NPE, that's a bug in the validator, so feel free to submit a change request (and/or post the stack trace here)</p>",
        "id": 157873981,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549645061
    }
]