[
    {
        "content": "<p>How do I get titles and descriptions for my examples?  In the generated Artifact page, the Example table appears to be grabbing X.title and X.description if those exist in the example resource (Composition, Questionnaire), but the description field is empty if there is no description element and the title becomes \"Example {Resource Type} - {X.identifier}\".  Do I have to list these in the ImplementationGuide.json to get better titles and descriptions?</p>",
        "id": 196370697,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588714109
    },
    {
        "content": "<p>Yes</p>",
        "id": 196371322,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588714474
    },
    {
        "content": "<p>Unless you can think of where else I can get them from?</p>",
        "id": 196371356,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588714495
    },
    {
        "content": "<p>So if the IG Publisher can do some minimal parsing of FSH (or take a supplemental file provided by SUSHI), FSH allows authors to annotate all examples with ids, titles and definitions.  Then the title and description live much closer to the example source (as long as the author uses FSH).</p>",
        "id": 196375060,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588716730
    },
    {
        "content": "<p>Yes, here is an example where my source is living in a FSH file and I can provide a title and description.  So we need to figure out how to get that out of the FSH file and into some resource that the publisher can reference (without SUSHI creating an ImplementationGuide resource itself).</p>",
        "id": 196375160,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588716831
    },
    {
        "content": "<p>If that's part of the FSH files, I have no issue with that being populated into the SUSHI-generated IG file</p>",
        "id": 196375371,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588716958
    }
]