[
    {
        "content": "<p>I notice that the build now considers an references in examples must be resolvable. I am trying to do an example an an AuditEvent, it will thus point at many other things (devices, patient, observation, location, etc). The other things are not important for my use-case of showing an example of an AuditEvent.  I guess I could include a bunch of dummy resources just to make the build happy. I was just wondering if there is a pattern where I can avoid that? I had hoped that there was a http root that the build tools would know were examples and thus not throw the error. This is an error, so I can't just suppress it.</p>\n<blockquote>\n<p>error Unable to resolve resource \"Patient/example\"</p>\n</blockquote>",
        "id": 203538320,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594403770
    },
    {
        "content": "<p>all these errors are nicely grouped at the bottom of the QA as Reference_REF_CantResolve</p>",
        "id": 203545797,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594407778
    },
    {
        "content": "<p>I had to include them in my IG.  I'm not aware of a canonical URL for core examples</p>",
        "id": 203547943,
        "sender_full_name": "David Pyke",
        "timestamp": 1594408760
    },
    {
        "content": "<p>good thing sushi makes that easy. so now have a dummy fsh file to create all my dummy examples</p>",
        "id": 203552263,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594411430
    },
    {
        "content": "<p>is it possible to use dummy contained resources if that makes this easier?</p>",
        "id": 203554130,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1594412670
    },
    {
        "content": "<p>it is. but doesn't really make anything more easy</p>",
        "id": 203554191,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594412743
    },
    {
        "content": "<p>it's possible but it's a bad idea.</p>",
        "id": 203554487,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594412937
    },
    {
        "content": "<p>understand. I am not against doing the dummy examples. I just didn't want to do it and find out that there was an established pattern that I was ignorant of.</p>",
        "id": 203558227,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594415454
    }
]