[
    {
        "content": "<p>Definition resources provide constrains on the resources for which they are a definition, but no explicit way to define certain other requirements (e.g., optional/recommended/required as MAY/SHOULD/SHALL).  The capabilitystatement-expectation extension seems to be almost perfectly defined to address this, but will not validate (even if I try to define a profile that says it can be present).</p>",
        "id": 205501541,
        "sender_full_name": "Keith Boone",
        "timestamp": 1596126899
    },
    {
        "content": "<p>I have logged trackers to expand  this extension's context more broadly in Capabilitystatement and for SearchParameters.  What other contexts does it need?</p>",
        "id": 205503790,
        "sender_full_name": "Eric Haas",
        "timestamp": 1596128111
    },
    {
        "content": "<p>We use Must Support as way to define other definitional element how is this different?</p>",
        "id": 205503978,
        "sender_full_name": "Eric Haas",
        "timestamp": 1596128210
    },
    {
        "content": "<p>mustSupport is for profiles.  It does not appear in a Resource.  So, while Measure defines conformance requirements for MeasureReport resources which reference it, it does not have a way to say: SHOULD have this part, SHALL have that part.</p>",
        "id": 205510954,
        "sender_full_name": "Keith Boone",
        "timestamp": 1596132012
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> ?</p>",
        "id": 205514765,
        "sender_full_name": "Eric Haas",
        "timestamp": 1596133666
    },
    {
        "content": "<p>I lobbied for expectation-extension to be used everywhere like DAR but that was met with resistance.  I think your use case makes a lot of sense.</p>",
        "id": 205514964,
        "sender_full_name": "Eric Haas",
        "timestamp": 1596133759
    },
    {
        "content": "<p>Perhaps discuss it with the CDS folks - they're responsible for most of the definition resources</p>",
        "id": 205526464,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596139776
    },
    {
        "content": "<p>Yes, this use case makes sense, so a conformanceExpectation extension, we have run into other similar use cases, but haven't done anything with it so far. Submit a tracker?</p>",
        "id": 205618664,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1596216922
    }
]