[
    {
        "content": "<p>I use a bash script and  a python one liner to convert my ig.yml to ig.json and I make a lot of edits in YAML and convert to json in my text editor with a couple of keystrokes.   What is the feeling about having the publisher autoconverting YAML resources to JSON on the fly?</p>",
        "id": 204595591,
        "sender_full_name": "Eric Haas",
        "timestamp": 1595361378
    },
    {
        "content": "<p>I'm sure there must be some really great, easy-to-use Java libraries that could be leveraged...</p>",
        "id": 204597385,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1595362280
    },
    {
        "content": "<p>there's no ambiguity about the conversion?</p>",
        "id": 204602738,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595365481
    },
    {
        "content": "<p>I'm not a fan of divergence in authoring.  When you say ig.json, are you referring to the ImplementationGuide resource instance?  If so, I'm even more opposed.  We shouldn't have something in source control for a 'standard' resource that HL7 hasn't defined.  If you don't like authoring in JSON, why not use FSH?</p>",
        "id": 204630022,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595393097
    },
    {
        "content": "<p>It is just a convenience...YAML is good for quick and dirty hand edits. like adding an example into an ig resource, (and fsh  could probably easily generate in YAML as JSON since technically YAML is a superset of JSON. This means that, in theory at least, a YAML parser can understand JSON, but not necessarily the other way around).</p>",
        "id": 204689099,
        "sender_full_name": "Eric Haas",
        "timestamp": 1595435200
    },
    {
        "content": "<p>We don't want to introduce more syntaxes than we <em>need</em> to have.  Every syntax increases the learning curve.  And every variation in how different HL7 guides are maintained reduces the ability to maintain them and increases publishing complexity (and the chances of things going wrong)</p>",
        "id": 204689519,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595435409
    },
    {
        "content": "<p>Its not a learning curve thing , its a choice/preference thing but I am ok either way.</p>",
        "id": 204690794,
        "sender_full_name": "Eric Haas",
        "timestamp": 1595436049
    },
    {
        "content": "<p>If it's choice, then that's variability.  If it's not a choice, then it's learning curve.</p>",
        "id": 204691371,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595436328
    }
]