[
    {
        "content": "<p>So the deadline for this is tomorrow:<br>\nFHIR IGs substantively complete<br>\nWhen: Sunday, Nov 1, 2020<br>\nDescription: WGs expected to have their IGs successfully publishing on the continuous integration build by the NIB deadline</p>\n<p>Is there anything specific we have to do to meet this deadline (other than the obvious - making sure the IGs are actually successfully publishing on the CI build!), like notify someone? </p>\n<p>Or will someone just check the expected IGs are publishing?</p>",
        "id": 215226193,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1604204198
    },
    {
        "content": "<p>The main purpose is to identify any tooling issues with publisher and validator.  If you report issues after this date, the tool authors won't commit to fixing them prior to ballot opening.  (Which in some cases may mean missing the cycle.). You can still make substantive changes up to the QA deadline.</p>",
        "id": 215229259,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604209934
    },
    {
        "content": "<p>Ok, thanks! Fingers crossed I don't unearth any issues then! <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 215262713,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1604265537
    },
    {
        "content": "<p>And actually I think this is the first ballot cycle where I haven't found anything for them to fix, which is awesome...</p>",
        "id": 215262826,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1604265682
    },
    {
        "content": "<p>So I've been thinking about this - is there any way we could have a better title for this deadline on the HL7 Publishing Calendar? As it is, it's quite confusing. Like maybe \"IG Publisher/Validator code freeze\"? Or something...</p>",
        "id": 215383942,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1604353764
    },
    {
        "content": "<p>Yes I'd like that too. I've had questions several times about what exactly it means...</p>",
        "id": 215385931,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1604354831
    },
    {
        "content": "<p>How about \"IG Publisher/Validator issues reported\" as the name.  \"code freeze\" sounds like it's a deadline for the tool-smiths rather than the IG authors.  Description: \"Content of your IG should be sufficiently complete and representative that any problems with your content with respect to the publisher and/or validator will have surfaced and you have reported all such issues via the appropriate channels.  Any issues discovered and reported <em>after</em> this date will not be prioritized and may not be fixed before ballot opening.  If the FMG determines a publishing issue is sufficiently important to balloter experience, IGs that do not meet this deadline may be pushed to the next cycle.\"</p>",
        "id": 215390362,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604357644
    },
    {
        "content": "<p>(<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - you ok with that?)</p>",
        "id": 215390396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604357657
    },
    {
        "content": "<p>That is better. Not 100% on the last sentence, but I can't think of how to fix it so...</p>",
        "id": 215391422,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1604358424
    }
]