[
    {
        "content": "<p>Hi. I could not find statistics on FHIR usage, so heres' a thought: would it make sense to have the IG resource extended with a placeholder for some figures , so that we can then take the IG and get data for statistics? e.g. the adoption status (number of systems in PROD), the target population... I don't know how realistic those numbers would be, but it could bring some data in...</p>",
        "id": 169229441,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561732227
    },
    {
        "content": "<p>What sort of statistics are you looking for and what's the process by which you expect them to be reflected in the IG resource?</p>",
        "id": 169233365,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561735032
    },
    {
        "content": "<p>I'd as for ig maintainers to volunteer some figures if they want to. <br>\nMetrics - not sure, perhaps (expected) number of clients, number of institutions, number of patients, date go-live...</p>",
        "id": 169246649,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561744189
    },
    {
        "content": "<p>ig author seems to be the best chance to get something like this</p>",
        "id": 169246741,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561744235
    },
    {
        "content": "<p>of course some figures could also come from the server itself (# / frequency of transactions, etc) but i was not aiming at that</p>",
        "id": 169246806,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561744286
    },
    {
        "content": "<p>just throwing the idea because I was looking at statistics and i recalled that IHE was procuring some uptake statistics by checking the tools and asking the committees.</p>",
        "id": 169246954,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561744370
    },
    {
        "content": "<p>I think the quality of the statistics you'd get out of the IG authors reflecting \"anticipated\" adoption would be highly questionable - and they'd be unlikely to be updated to reflect reality.  Monitoring test systems would probably give better information.</p>",
        "id": 169259699,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561753852
    },
    {
        "content": "<p>agree, quality of information on planned adoption will be low especially in first iteration. <br>\nI'm thinking that IG authors would collect such info - possibly from test data - and would provide them in a second iteration of the IG. Any other way (and is it worth pursuing) to get structure information to see how FHIR is doing, what resources/extensions are used, etc?</p>",
        "id": 169270049,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561763283
    }
]