[
    {
        "content": "<p>As a result of a series of debriefs after the September 2021 Ballot Cycle, changes were made to process for developing FHIR IGs for ballot.  A webinar will be held on February 24th from 1pm to 2:30pm Eastern to review the upcoming key dates, requirements for FHIR IGs going to ballot and additional information on the CI build and Jira Spec File requirements.  It is required that all FHIR IG Developers attend this session as part of this ballot cycle.  If you are not able to attend, please let me know.  We will be recording this session and I can provide that recording to you.  If you do not attend the webinar or request the recording, your IG may not be approved for the May 2022 Ballot Cycle.</p>\n<p>You must register in advance for this meeting:<br>\n<a href=\"https://hl7-org.zoom.us/meeting/register/tJIkdOqoqDMsGdIxRJ75ja7O2ujBWX_ncKFS\">https://hl7-org.zoom.us/meeting/register/tJIkdOqoqDMsGdIxRJ75ja7O2ujBWX_ncKFS</a> </p>\n<p>NOTE:  This webinar is specific to FHIR Management Group (FMG) requirements for getting a FHIR IG approved for the upcoming ballot cycle and is NOT intended for individuals who are trying to learn how to develop a FHIR IG.</p>\n<p>Work Group Co-chairs – please make sure that the developers for FHIR IGs for your Work Group are aware of this requirement.</p>",
        "id": 272716278,
        "sender_full_name": "Marc Duteau",
        "timestamp": 1645464417
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"311999\">@Marc Duteau</span> would you mind defining what FHIR IG developers you are referring to? Are you referring to US IG devs?</p>",
        "id": 272726205,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1645471024
    },
    {
        "content": "<blockquote>\n<p>It is required that all FHIR IG Developers attend this session as part of this ballot cycle. </p>\n</blockquote>\n<p>Required by whom?</p>",
        "id": 272726244,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1645471063
    },
    {
        "content": "<p>My apologies. It was clearer in the email that was sent out to co-chairs.  Developers who have an ig going to ballot this cycle.</p>",
        "id": 272726342,
        "sender_full_name": "Marc Duteau",
        "timestamp": 1645471106
    },
    {
        "content": "<p>and I presume this is for HL7-issued IGs, is that correct?</p>",
        "id": 272727235,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645471712
    },
    {
        "content": "<p>IGs going to ballot through HL7 international.  (Not clear if it applies to affiliate IGs balloting through HL7 international - governance there is a bit unclear...)</p>",
        "id": 272727451,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645471861
    },
    {
        "content": "<p><a href=\"https://youtu.be/qHDSNs9wBpU\">https://youtu.be/qHDSNs9wBpU</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"qHDSNs9wBpU\" href=\"https://youtu.be/qHDSNs9wBpU\"><img src=\"https://uploads.zulipusercontent.net/3a7b0d1f946ea56e753385f74f8d57054da7edc5/68747470733a2f2f692e7974696d672e636f6d2f76692f714844534e7339774270552f64656661756c742e6a7067\"></a></div>",
        "id": 272729723,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1645473522
    }
]