[
    {
        "content": "<p>We are being asked to define a series of FHIR Workflows. This is relatively greenfield area as we haven't defined any national UK standards in any previous versions of HL7 (not exactly true but close)</p>\n<p>The  rough payload pattern we are seeing is</p>\n<p>1..1 focus Resource (for both request and event)<br>\n1..* PractitionerRole<br>\n1..1 Patient </p>\n<p>Each of these payloads will have a create, update and maybe delete. It's roughly CRUD focused around a single resource.</p>\n<p>So our options are </p>\n<ul>\n<li>transaction - we're probably not POSTing direct to a server, it's up to the recipient to decide wether the PractitionerRole or Patient is a POST or PUT. Don't think this is the answer</li>\n<li>use contained - not FHIR conformant and I think it makes handling the payload more difficult.</li>\n<li>FHIR Message - this fits but getting  lot of push back from technical staff who want a more RESTful approach.</li>\n</ul>",
        "id": 250580370,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1629867642
    },
    {
        "content": "<p>We've gone down a FHIR Message route but wondering if I can make this more restful. e.g. </p>\n<p>Move the POST /$process-message to POST {resource}/$process-message<br>\n(with a slim MessageHeader)</p>",
        "id": 250580532,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1629867849
    },
    {
        "content": "<p>So our current prescription-order message is now sent to </p>\n<p>POST /MedicationRequest/$process-message</p>\n<p>Wondering also if we should add in CRUD as a parameter. To get something like</p>\n<p>POST /MedicationRequest/$process-message?method=create</p>",
        "id": 250580778,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1629868245
    },
    {
        "content": "<p>Looking at <a href=\"https://build.fhir.org/ig/HL7/davinci-ehrx/exchanging.html\">https://build.fhir.org/ig/HL7/davinci-ehrx/exchanging.html</a></p>\n<p>We could swap to <strong>batch</strong> but we have a definition of the Bundled resources (MessageDefinition). Think we are in a half way house between message and batch?</p>",
        "id": 250582385,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1629870622
    },
    {
        "content": "<p>Can you explain how what you're trying to do is distinct from a simple RESTful <a href=\"https://build.fhir.org/http.html#upsert\">upsert</a>?</p>",
        "id": 250623915,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629899950
    },
    {
        "content": "<p>Sending several resources at once? The answer is FHIR Message but having a lot of push back against this.</p>",
        "id": 250732419,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1629961823
    },
    {
        "content": "<p>The use of Batch would likely make your RESTful zelots happy. You could profile the Batch so that the contents of the Bundle are well formed. Thus it is just a Bundle full of RESTful interactions. (IHE has a few of these).  Now include in that profile of the Batch that the first resource just happens to be a MessageHeader that explains from who the content is from, to who the content should go, and why... and you have everyone happy.</p>",
        "id": 250755540,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629976275
    },
    {
        "content": "<p>If you're trying to create or update multiple resources, you can use FHIR transaction</p>",
        "id": 250785271,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629989647
    },
    {
        "content": "<p>(or batch if they're independent)</p>",
        "id": 250785312,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629989661
    },
    {
        "content": "<p>I think this has to be message though, every collection has is for a defined event. <br>\nMaybe what I need to do is keep MessageHeader content as small as possible.</p>",
        "id": 250786707,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1629990147
    },
    {
        "content": "<p>I don't understand what you mean by \"for a defined event\".  If you're saying \"please create X\" or \"please update X\", that's the event and no need for messaging.  If you're saying \"Event X happened, here's some stuff, do what you feel is appropriate\", then either messaging or a custom operation is necessary.</p>",
        "id": 250787237,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629990357
    },
    {
        "content": "<p>FHIR workflow like referrals, prescription orders, send documents, etc.</p>",
        "id": 250787398,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1629990405
    },
    {
        "content": "<p>So it's mostly please do X</p>",
        "id": 250787426,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1629990423
    },
    {
        "content": "<p>You can manage that in a pure REST way using Task, but its dependent on being able to query information referenced by the Task.</p>",
        "id": 250787533,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629990472
    },
    {
        "content": "<p>Yes we do use Task but the input pattern to workflow manager and then onto recipient is </p>\n<p>ServiceRequest/MedicationRequest<br>\nPatient<br>\nPractitionerRole</p>",
        "id": 250787819,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1629990576
    },
    {
        "content": "<p>With pure REST, those would just be references and the workflow manager (and anyone else) would query for them if/when they needed them.</p>",
        "id": 250801053,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629995584
    },
    {
        "content": "<p>That does work and opens up several options. Thanks.</p>\n<p>Plenty to think about.</p>",
        "id": 250804841,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1629997049
    }
]