[
    {
        "content": "<p>I've been a user/consumer of HL7 and FHIR on several projects, yet most of the projects were to obtain a level of understanding in order to get the project completed ASAP. </p>\n<p>Now, I'm trying to broaden my understanding.</p>\n<p>I've been working my way though the Specs and put together a list of  of DEVDays Youtube Videos to watch and learn from.<br>\n(Great deal of technical information out there on youtube). </p>\n<p>The one thing I've <strong>not</strong> been able to find is the <strong>bigger picture</strong> perspective  on how it all ties together. <br>\nFrom the definition of an Implementation Guide (FSH and other tools)  to how the IG is used by delivery teams to deliver  workable solution(s). <br>\nHow is the IG used by teams?<br>\nHow/What tools are delivery teams using to transform the IG into solutions(s), validations, constrains and so on....</p>\n<p>Does anyone know  of a good set of docs/Video(s) that can provide a broader picture or multiples ? </p>\n<p>Thank you in advance ..</p>",
        "id": 278216658,
        "sender_full_name": "Al Pivonka",
        "timestamp": 1649360724
    },
    {
        "content": "<p>A few webinars here:<br>\n<a href=\"https://wiki.digitalsquare.io/index.php/Global_Goods_Community\">https://wiki.digitalsquare.io/index.php/Global_Goods_Community</a></p>",
        "id": 278297063,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1649421248
    },
    {
        "content": "<p>(some FHIR webinars from April 28th 2021 onwards)</p>",
        "id": 278297104,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1649421278
    },
    {
        "content": "<p>I think you are giving us a very good idea to do some webinar on \"Ok, so I have an IG. What now?\"</p>",
        "id": 278297365,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1649421412
    },
    {
        "content": "<p>You may also be interested in the upstream process - how do you actually prepare some awareness/engagement for companies to develop based on FHIR, and how can we encourage people to use those IGs as an actual reference , instead of inventing their own IG.</p>",
        "id": 278297466,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1649421464
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Thank you I will take a look. </p>\n<p>If you are needing someone who has limited exposure to review and ask \"stupid\" questions with limited context, I'm your guy.</p>",
        "id": 278308257,
        "sender_full_name": "Al Pivonka",
        "timestamp": 1649426467
    }
]