[
    {
        "content": "<p>Forge is now propagating the 'structuredefinition-normative-version' into derived profiles (which is triggering errors because of how the extension is defined).  I understand the errors will go away eventually when/if we push a technical correction to R4.  However, I want to focus on a different issue:<br>\nAre these extensions appropriate to propagate?  More specifically, what happens when we start taking profiles normative, but want to note that certain elements (even certain elements within particular slices) are <em>not</em> normative?  How will we do that?  Should we be asserting the model within which the normative assertion is being made?  That's the only convention I can think of given that there's no real mechanism to keep extensions from propagating through derived models</p>",
        "id": 193477541,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1586450943
    },
    {
        "content": "<p>well, isn't it a claim that the profile itself is normative?</p>",
        "id": 193504607,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586463900
    },
    {
        "content": "<p>They show up on elements, not on the overall profile.  And they get inherited in the derivation process</p>",
        "id": 193507645,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1586465491
    },
    {
        "content": "<p>so are they claiming the element itself is normative, or that this element definition profile is normative?</p>",
        "id": 193507838,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586465581
    },
    {
        "content": "<p>You certainly don't want the fact an element is normative in a resource to mark it as normative in profiles</p>",
        "id": 193507852,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1586465588
    },
    {
        "content": "<p>When a profile goes normative, it is statically bound to the used resources?!</p>",
        "id": 193541858,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1586500390
    },
    {
        "content": "<p>I'm not sure what you mean Frank.  A profile can't go normative until the underlying resource has gone normative.  A profile is always tied to exactly one resource.</p>",
        "id": 193572885,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1586527970
    },
    {
        "content": "<blockquote>\n<p>A profile is always tied to exactly one resource.</p>\n</blockquote>\n<p>not nessarily</p>",
        "id": 193646701,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586589353
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> we have a lot of profiling work, some of which is referencing outdated fhir stuff. But they are declared somehow normative. (Well, not in the HL7 sense, but in their minds.) So, I would say that you can make a profile normative although the underlying resource is not. <br>\nI also would say that it is bad practice, but on the other hand in order to make progress and to use fhir we cannot wait until all needed resources are normative. </p>\n<p>The problem here in Germany is that the ones who are heavily promoting that they use the newest standard fhir, are not too familiar with all associated details.</p>",
        "id": 194591210,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1587293390
    },
    {
        "content": "<p>There's nothing to stop a designer with authority from mandating whatever they like.  That's not the same as 'normative' though.  'Normative' promises that future versions will interoperate with past versions without breaking changes.  It doesn't matter who the designer is or what level of authority they have, they can't make that promise if HL7 hasn't made the same promise with respect to the underlying resource definitions.  'Normative' is absolutely not a prerequisite for widespread implementation though (as can be clearly seen with FHIR's rate of adoption pretty much everywhere).</p>\n<p>All implementers should certainly encourage designers/regulators to be familiar with the FHIR Maturity Model and adhere to its spirit - trying to lock things down without adequate implementation experience inevitably creates problems.  However, we can't force it on anyone.</p>",
        "id": 194599117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587304892
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179252-IG-creation/topic/Forge.20propagating.20normative.20flags/near/193646701\" title=\"#narrow/stream/179252-IG-creation/topic/Forge.20propagating.20normative.20flags/near/193646701\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>A profile is always tied to exactly one resource.</p>\n</blockquote>\n<p>not nessarily</p>\n</blockquote>\n<p>Okay, I'll bite.  How can a profile have multiple resources?</p>",
        "id": 194602263,
        "sender_full_name": "David Pyke",
        "timestamp": 1587309029
    },
    {
        "content": "<p>Profiles can navigate down into contained resources</p>",
        "id": 194602691,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587309569
    },
    {
        "content": "<p>Oh, okay, that one I knew.</p>",
        "id": 194603080,
        "sender_full_name": "David Pyke",
        "timestamp": 1587310145
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Should we have a way to indicate that some extensions should not be inherited?</p>\n<p>Most extensions should probably be inherited, except for some extensions on profiles. Like the extensions <a href=\"http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status\" title=\"http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status\">http://hl7.org/fhir/StructureDefinition/structuredefinition-standards-status</a> and <a href=\"http://hl7.org/fhir/StructureDefinition/structuredefinition-normative-version\" title=\"http://hl7.org/fhir/StructureDefinition/structuredefinition-normative-version\">http://hl7.org/fhir/StructureDefinition/structuredefinition-normative-version</a> of Element should probably not be inherited by every type of element. Thus <span class=\"user-mention\" data-user-id=\"221719\">@Abel Enthoven</span> suggested perhaps adding an extension with 'do not inherit' on those.</p>",
        "id": 196605126,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1588755508
    },
    {
        "content": "<p>That's the question I'm asking.  I don't know we've landed on an answer - <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 196649705,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588778232
    },
    {
        "content": "<p>well, maybe. I think 'do not inherit' is too simplistic a notion. It's kind of like is this data or metadata, and if it's metadata, what kind of metadata is it?</p>",
        "id": 196688394,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588794969
    },
    {
        "content": "<p>I see two alternatives - either we say that certain extensions don't propagate, or we need to require that extensions on structure definitions recognize that they <em>will</em> propagate.</p>",
        "id": 196693780,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588797485
    },
    {
        "content": "<p>(Which in this case, would mean the declaration of normative would also have to specify what canonical it was normative as part of.)</p>",
        "id": 196693889,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588797571
    },
    {
        "content": "<p>I like your solution of always propagating Lloyd, because it does not rely on tools to understand any extra meta info communicated in extensions. Would require changing the definition of the mentioned extensions' definitions (and every instance of them) then, right?</p>",
        "id": 196736581,
        "sender_full_name": "Abel Enthoven",
        "timestamp": 1588837569
    },
    {
        "content": "<p>Correct</p>",
        "id": 196782598,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588863487
    },
    {
        "content": "<p>Created <a href=\"http://jira.hl7.org/browse/FHIR-27535\">FHIR#27535</a> for this.</p>",
        "id": 198208253,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1589985712
    }
]