[
    {
        "content": "<p>I have an IG from which I want to refer to other IGs. mostly, the other IGs will actually depend on this one. It's suggesting places to go look to use features it defines properly.</p>",
        "id": 187150070,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580539029
    },
    {
        "content": "<p>at the moment, you have to reference an IG in your dependency list, or else the G publisher says that it's an error. Here's a case where I don't want to add the IG to my dependency list, but it's not an error to reference it either.</p>",
        "id": 187150080,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580539081
    },
    {
        "content": "<p>in fact, generally, it's not an error.... it's just that mostly people have needed to reference it as a dependency when the refer to it, and people have been forgetting</p>",
        "id": 187150126,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580539120
    },
    {
        "content": "<p>so I think I want to do something about this... but I don't want to simply allow references to <a href=\"http://hl7.org\" target=\"_blank\" title=\"http://hl7.org\">hl7.org</a> that can't be checked. I'm interested in opinions on this one</p>",
        "id": 187150141,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580539197
    },
    {
        "content": "<p>Could we add an element or extension that says \"refers to content from package\" or perhaps add a qualifier to dependency that indicates the nature of the dependency?</p>",
        "id": 187153058,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580544832
    },
    {
        "content": "<p>I think I’d really rather avoid circular dependencies and special cases like ‘don’t follow this dependency in the presence of that extension”</p>",
        "id": 187153647,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580546016
    },
    {
        "content": "<p>Though of course, UTG is going to give me problems around circular dependencies</p>",
        "id": 187153650,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580546033
    },
    {
        "content": "<p>But I’ll have to get the package whatever if it’s a package reference</p>",
        "id": 187153696,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580546077
    },
    {
        "content": "<p>If you want to validate, don't you have to have a package reference?</p>",
        "id": 187155158,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580549345
    },
    {
        "content": "<p>yes. but maybe I don't have to validate special cases</p>",
        "id": 187155492,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580550101
    }
]