[
    {
        "content": "<p>It has come to my notice that the output from the full-ig.zip file differs from the output in the local build. In particular, the 'Snapshot' view of some profiles does not show the full data-hierarchy. In a Patient profile for example, the Snapshot  data-hierarchy ends with the 'birthDate' element but as you know, there are several more elements in this Resource. <a href=\"/user_uploads/10155/nDpyLsmLxSSjApPt26eFzuii/paitientSnapshotCutShort.PNG\" target=\"_blank\" title=\"paitientSnapshotCutShort.PNG\">paitientSnapshotCutShort.PNG</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/nDpyLsmLxSSjApPt26eFzuii/paitientSnapshotCutShort.PNG\" target=\"_blank\" title=\"paitientSnapshotCutShort.PNG\"><img src=\"/user_uploads/10155/nDpyLsmLxSSjApPt26eFzuii/paitientSnapshotCutShort.PNG\"></a></div><p>Is this a known problem?</p>",
        "id": 160631058,
        "sender_full_name": "Rodney Collins",
        "timestamp": 1552446278
    },
    {
        "content": "<p>To confirm - you started with an empty output folder, you ran the local build and looked at the full-ig.zip file produced in the local build and it contains different content in the zip than are in the folder?</p>",
        "id": 160631490,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552447043
    },
    {
        "content": "<p>If so, that's not a known problem - and I have no idea how it's even possible given that the zip is generated by zipping the files in the output folder...</p>",
        "id": 160631534,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552447083
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Thank you Lloyd. I checked with the colleague who had created the build and there may have been some temp files hanging around. A fresh build has rectified the problem.</p>",
        "id": 160735637,
        "sender_full_name": "Rodney Collins",
        "timestamp": 1552518360
    },
    {
        "content": "<p>Great.  If you can reproduce a scenario where a full build is impacted by a previous build, please submit a change request because that shouldn't happen.</p>",
        "id": 160741548,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552524930
    }
]