[
    {
        "content": "<p>Hi All,<br>\nwhen I create the Extensions web page in the Implementation Guide, I am able to get the List of all the Extensions Web pages.<br>\nBut when I am trying to create  the web pages for particular profiles.<br>\n(e.x. MedicationStatement) suppose  for this I have two extensions 'lastgiven' and 'prescriber'.<br>\nso whenever I click on my profile like 'medicationstatement' then in the 'Extensions' pages I want to show only that two Extensions but I am able to get the list of all the Extensions.<br>\nif anybody knows about where I am getting wrong then ping me.</p>",
        "id": 153937309,
        "sender_full_name": "abhishek gupta",
        "timestamp": 1518590830
    },
    {
        "content": "<p>There's no automated way to get a page that only shows the extensions used in a particular resource except when publishing the core spec.  That's not supported for IGs.  You can submit a change request using the \"propose a change\" link in the spec, but I can't say how soon it'll happen.  In the meantime, you'll need to define your pages manually.  If I was doing it, I'd probably use some pre-processing XSLT to generate the page content.  However, there are other scripting approaches that could work too.  Or you could actually handcraft each page.</p>",
        "id": 153937377,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518619301
    },
    {
        "content": "<p>there is a list of all extensions generated by the tooling  <code>list-simple-extensions.xhtml</code>  which you can include in your page.  if you want just a few select extension then do it manually  ( which is probably faster) or maybe some fancy liquid syntax to sort through all the includes or do what Lloyd suggests.</p>",
        "id": 153937397,
        "sender_full_name": "Eric Haas",
        "timestamp": 1518623732
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nOk Thanks.</p>",
        "id": 153937680,
        "sender_full_name": "abhishek gupta",
        "timestamp": 1518697242
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nIs it possible to generate the Operations pages for separate-separate profiles in the implementation Guide</p>",
        "id": 153938128,
        "sender_full_name": "abhishek gupta",
        "timestamp": 1518763578
    },
    {
        "content": "<p>Profiles don't have operations.  IGs can certainly define operations, but there's nothing profile-specific about them.  Operations are invoked on resources or at the base, not on profiles.</p>",
        "id": 153938129,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518763907
    }
]