[
    {
        "content": "<p>I can see the FHIR IG Registry includes a category field. However, the ImplementationGuide Resource doesn't have a category element inside it.  What is the value set of possible IG Categories?  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> in a recording of you speaking about FHIR IG Development, you mentioned various purposes of IGs:  Base National IG, Domain of Knowledge, Community of Implementation. What is the relationship between these terms and \"categories\"?  Also the IG Registry include a long set of categories, but we can't tell where this list comes from: <a href=\"/user_uploads/10155/QF7O891Pl920CdaVs8-tpOBy/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/QF7O891Pl920CdaVs8-tpOBy/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/QF7O891Pl920CdaVs8-tpOBy/image.png\"></a></div>",
        "id": 200917599,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1592240699
    },
    {
        "content": "<p>category is used to help filter the  IGs when you view the registry. At the moment, IG categories are managed by me, by fiat. I choose the categories as it seems me to most useful for the users of the IG</p>",
        "id": 200921248,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592242491
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> What category do you have in mind for the SDOH-CC IG?  Are there definitions anywhere of the categories actually mean?  Any guidance on what IGs belong is which category?</p>",
        "id": 200962519,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1592268293
    },
    {
        "content": "<p>I don't think that SDOH fits into any of the existing categories, but I would discuss with SDOH owners before deciding on the category. The categories sole function is to help a user find IGs quickly, so I'm not interested in defining them more than their face interpretation - I'll just fix them if I get detailed criticism. And I have changed them in the past in response to feed back.</p>",
        "id": 200982712,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592293939
    }
]