[
    {
        "content": "<p>I would like to create a public project on the hL7 github for the IG which is to go into the next ballot round. I was easily able to make a repository on github (not sure why) but I cannot push anything to it. I have a git repo on my local system. I was hoping to push that to it. How do I go about doing this? Thanks!</p>",
        "id": 153997135,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537008233
    },
    {
        "content": "<p>You were able to make a repository on HL7's github?  What's the URL?  And what's your git userid? Also, what's the URL of the IG Proposal for the IG you're creating?</p>",
        "id": 153997181,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537019648
    },
    {
        "content": "<blockquote>\n<p>You were able to make a repository on HL7's github?  What's the URL?  And what's your git userid? Also, what's the URL of the IG Proposal for the IG you're creating?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I am not sure what I did. I went to an existing IG  (the PoCD IG). THen I just moved up a level where I saw the remaining HL7 projects in github. I selected the '+' icon in the upper right and selected the option to create a repository. I made one called PhdIG with a readMe. I don't think I was able to commit it. I tried to add files and had all kinds of difficulties trying to maintain my structure. Finally figured out the way to do it was drag and drop and DONT select upload files. So I did. But I mistakenly clicked on an exit button for my file explorer twice an the second click killed my browser. Now I cannot find the repo I made. I am guessing it did not happen.</p>\n<p>What surprises me is that I could do all that. I had no login (that I know of ... maybe my HL7 login?). But alas, I am left in a state of confusion.<br>\nI would like to commit now because I have a real genuine minimal IG. I think this is the absolute simplest IG one can make. I will build upon it. It will help others trying to make one for the first time and may save them a week or more of work.</p>",
        "id": 153997183,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537020061
    },
    {
        "content": "<p>From the looks of things, your IG wasn't actually created.  I'm not sure why Git let you get as far as it did.  If you want to create an IG and ballot it through HL7, you're going to need a work group project and an implementation guide proposal.  In terms of a template to help newcomers with the process, that's a great idea and very much appreciated.  However in the next 2-3 weeks we're going to be significantly changing how the IGPublisher works, which will probably render a fair bit of what you've done no longer relevant.  On the plus side, it should hopefully be much easier for newcomers to create IGs.  We'll certainly welcome you to review what's done and to assist with the documentation if that's of interest to you.</p>",
        "id": 153997185,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537020446
    },
    {
        "content": "<blockquote>\n<p>From the looks of things, your IG wasn't actually created.  I'm not sure why Git let you get as far as it did.  If you want to create an IG and ballot it through HL7, you're going to need a work group project and an implementation guide proposal.  In terms of a template to help newcomers with the process, that's a great idea and very much appreciated.  However in the next 2-3 weeks we're going to be significantly changing how the IGPublisher works, which will probably render a fair bit of what you've done no longer relevant.  On the plus side, it should hopefully be much easier for newcomers to create IGs.  We'll certainly welcome you to review what's done and to assist with the documentation if that's of interest to you.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I did not do all the official work but I had a PhdIG for the ballot cycle last January (I think that was the one). It was created in Forge/Simplifier. I am working with the same WG that the PoCD IG is under (Devices on Fhir / Health Care Devices). I am pretty much a noob at how all these things work. I have just been creating the content and Martin Rosner and other DOF people have helped with the rest. So as far as I know, I am under the same 'sponsorship' as the PoCD IG.</p>\n<p>As far as the documentation is concerned, my general comment on the existing Wiki is that it is way too complicated. Everything is thrown at you at once and a newbie is going to be overwhelmed. Whenever I write a software library (like for PHD PAN communications) I always make an example minimal implementation so a user has something to start with that works. Then the user can go from there, read through the additional complexities and make changes stepwise. If it doesn't work, the user can always revisit those changes made from something that does work.</p>\n<p>I would love to see something like that. The IG I have has one page, one structure definition, an ig.json and an ImplementationGuide structure definition. Because it has so little, the last two files are really small and much easier to digest. Admittedly, it doesnt do much, just displays a page with my structure definition rendered in diff, snapshot, and dict forms. What does 'dict' mean?</p>",
        "id": 153997187,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537021166
    },
    {
        "content": "<p>dict = data dictionary.  phd = personal healthcare devices?  If so, you're grandfathered.  I can create a PHD project for you in github if you like - will need your Git id.</p>",
        "id": 153997200,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537041215
    },
    {
        "content": "<p>I had started a \"vanilla flavour\" IG to guide through the publication process. how to get started, and how to make your own IG.<br>\nIt has a zip file with the IG and content (some pages, some resources) and a  zip file with the publishing framework. And the accompanying documentation.<br>\nI want this for IHE and for an ImplementationGuide editor, but from this discussion it may be useful to put it on HL7's repository?..</p>",
        "id": 153997224,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1537074950
    },
    {
        "content": "<blockquote>\n<p>dict = data dictionary.  phd = personal healthcare devices?  If so, you're grandfathered.  I can create a PHD project for you in github if you like - will need your Git id.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>   A git id? Is that something I just make up? PoCD and PHD (Personal Health Devices) are trying to harmonize as much as possible. PoCD IG was just recently added to the HL7 gitbub list. It was on gihub before but in a separate project done by Stefan Karl. Not sure how he set that one up. But yes, I would like to be able to have the PHD IG along with PoCD IG (not same project of course) under the same umbrella.</p>",
        "id": 153997234,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537098640
    },
    {
        "content": "<p>I need your Git userid</p>",
        "id": 153997239,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537113160
    },
    {
        "content": "<blockquote>\n<p>I need your Git userid</p>\n</blockquote>\n<p>I do not have one. Do I get one from github or from Health Care Devices?</p>",
        "id": 153997265,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537140535
    }
]