[
    {
        "content": "<p>What type of process should in place to prevent the release of templates of IG publisher versions that are dead on arrival?</p>",
        "id": 187311054,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1580768281
    },
    {
        "content": "<p>For IGs using the templates, I think it makes sense to use a Pull Request workflow, even for commits to IGs that don't require review.  That way if there is something broken in the framework/tools, it will kill the published branch of the IG, but the published master will remain.  If a reviewer verifies the autobuild succeeded on the branch the PR points to, they can merge it and as long as the PR build was very recent, then the master build <em>ought</em> to succeed.  This would help avoid situations like we have now where the FHIR Shorthand documentation is 404 because autobuilds are failing due to issues in the framework.</p>",
        "id": 187311564,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1580768658
    },
    {
        "content": "<p>(I realize I did not answer your original questions -- but I think it's good to also think about how we can minimize our chances of being unwitting victims to these issues).</p>",
        "id": 187311726,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1580768788
    },
    {
        "content": "<p>Won't the new version thing address that?</p>",
        "id": 187312003,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580769001
    },
    {
        "content": "<p>the version thing + the new testing framework will make it more solid, but I have no way to test this particular error - this one exists in the interplay between versions, templates, and the way the IG publisher is launched on the ci-build</p>",
        "id": 187312351,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580769179
    },
    {
        "content": "<p>\"this particular error\" - D.O.A.? If \"D.O.A\" is \"the new template does not work\", and assuming we will have a \"current\" and a \"dev\" version, then I'd assume that this should solve it.</p>",
        "id": 187312912,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580769527
    },
    {
        "content": "<p>this particular error is in the ci-build infrastructure itself, not any of the templates or content</p>",
        "id": 187313738,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580770139
    }
]