[
    {
        "content": "<p>Getting the following two errors related to <a href=\"http://nucc.org/provider-taxonomy\">nucc.org/provider-taxonomy</a>:<br>\nUnknown Code <a href=\"http://nucc.org/provider-taxonomy#207Q00000X\">http://nucc.org/provider-taxonomy#207Q00000X</a> in <a href=\"http://nucc.org/provider-taxonomy\">http://nucc.org/provider-taxonomy</a> for \"<a href=\"http://nucc.org/provider-taxonomy#207Q00000X\">http://nucc.org/provider-taxonomy#207Q00000X</a>\"<br>\nUnknown Code <a href=\"http://nucc.org/provider-taxonomy#122300000X\">http://nucc.org/provider-taxonomy#122300000X</a> in <a href=\"http://nucc.org/provider-taxonomy\">http://nucc.org/provider-taxonomy</a> for \"<a href=\"http://nucc.org/provider-taxonomy#122300000X\">http://nucc.org/provider-taxonomy#122300000X</a>\"</p>\n<p>I have confirmed these codes are included here: <a href=\"https://www.hl7.org/fhir/us/core/ValueSet-us-core-provider-role.html\">https://www.hl7.org/fhir/us/core/ValueSet-us-core-provider-role.html</a> and system value=\"<a href=\"http://nucc.org/provider-taxonomy\">http://nucc.org/provider-taxonomy</a>\"</p>",
        "id": 205272045,
        "sender_full_name": "David deRoode",
        "timestamp": 1595960674
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> this is a problem with UTG - the UTG definition of this code system does not have these codes which are valid. Nor does it have the definitions of the abstract groupers that we also need (btw <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> any progress with regard to the codes for the groupers?)</p>\n<p>In fact, UTG has 2 definitions for this code system - why? </p>\n<p>How to resolve? Should the IG publisher just ignore any definitions for this code system in UTG?</p>",
        "id": 205288827,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595969221
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I was instructed to remove these codes from the v3 import by HTA and was told having them in there is a violation of IP restriction/licensure.   What to do about this NUCC situation <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> ?</p>",
        "id": 205302162,
        "sender_full_name": "Ted Klein",
        "timestamp": 1595978280
    },
    {
        "content": "<p>which codes were you instructed to remove?</p>",
        "id": 205303999,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595979859
    },
    {
        "content": "<p>Regarding arriving at an approach with NUCC on codes for the abstract groupers: Working on it right now. My recommendation is that as a temporary solution we continue to keep the grouper concepts in the code system with the fake codes and mark the concepts as abstract. I understand that is likely different from what <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span>  was previously told to do by HTA (<span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span> ) for UTG. I will get official confirmation from NUCC as soon as possible. Any alternative solution is much less desirable. I'll also note it would technically help if we could somehow computably restrict those codes from showing up in any expansion. I understand this means expansions could not show the hierarchies but if that is what the NUCC requires of us after we finish our discussion, then I'd like to be able to offer this as s part of the solution - if it is possible. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - thoughts?</p>",
        "id": 205376295,
        "sender_full_name": "Robert McClure",
        "timestamp": 1596038361
    },
    {
        "content": "<p>Right ow I am grappling with a problem with the Publisher where we have a number of v3 Value Sets that include abstract grouper codes and in a few of these there are no concrete codes under them - hence the Expansion is not generated as it would be empty (no concepts).   This then triggers validation errors that the value set cannot be found for other value sets that include these.    Trying to find a workaround... <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Any ideas on how we can deal with this?</p>",
        "id": 205384026,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596042068
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  thanks. </p>\n<ul>\n<li>I agree that leaving the abstract codes in for now, marked as abstract, is the right thing to do. And they are marked as abstract now</li>\n</ul>\n<p>However:</p>\n<ul>\n<li>I still do not understand why some NUCC codes - not abstract ones - are not present in UTG, and these are causing validation for people now that UTG is working</li>\n<li>It's wrong to automatically restrict the codes from appearing in any expansion whatever because there are some expansions where you want them to appear in the expansions (routing logic / decision support etc). You can specify non-abstract codes if that's appropriate, when you are picking actual concrete codes</li>\n<li>value sets that have no content - how can I reproduce this?</li>\n</ul>",
        "id": 205405541,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596052544
    },
    {
        "content": "<p>OK working through these...the missing NUCC codes - they are in FHIR?   ie in (or not in) the v3 source from the December 2019 release?  (that is what was imported to UTG this Spring).   If they are/were not in the v3 source, then they are not in UTG as NO content from external (non-HL7) code systems was imported from FHIR to UTG.   <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> if you let me know what Is missing and needs to be in there, I can get it into UTG.  But please see to it that Julie does not have a fit about it.</p>",
        "id": 205417402,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596059095
    },
    {
        "content": "<p>the codes themselves have never been in FHIR. We have a code system that we maintain as a service to terminology servers, including <a href=\"http://tx.fhir.org\">tx.fhir.org</a>, at <a href=\"https://github.com/FHIR/packages/blob/master/packages/fhir.tx.support.r4/package/CodeSystem-nucc-provider-taxonomy.json\">https://github.com/FHIR/packages/blob/master/packages/fhir.tx.support.r4/package/CodeSystem-nucc-provider-taxonomy.json</a></p>",
        "id": 205417931,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596059461
    },
    {
        "content": "<p>I think I should ignore the UTG nucc entry - it is not useful for us, and we don't know what the provenance of it is</p>",
        "id": 205418035,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596059526
    },
    {
        "content": "<p>I think HTA and Rob M are trying to work out what to be done with NUCC.   We have a v3 value set - v3-Prosthodontics - that has the following:      &lt;compose&gt;<br>\n    &lt;include&gt;<br>\n      &lt;system value=\"http://nucc.org/provider-taxonomy\"/&gt;<br>\n      &lt;filter&gt;<br>\n        &lt;property value=\"concept\"/&gt;<br>\n        &lt;op value=\"is-a\"/&gt;<br>\n        &lt;value value=\"1223P0700Y\"/&gt;<br>\n      &lt;/filter&gt;<br>\n    &lt;/include&gt;<br>\n  &lt;/compose&gt;    and the code 1223P0700Y is not in the v3  code system stub for NUCC or anything - you did make the change in the Publisher so that expansions are generated if their definitions include enumerated codes even if the code system is unknown to the server or to the IG - but that is working for the internal UTG code systems but not for this one whose enumerated code is drawn from NUCC.  Methinks we do want to generate these expansions from enumerated &lt;compose&gt; statements even if we are clueless about the code system source; probably should trigger a warning, but generate the expansion anyway.   What do you think?</p>",
        "id": 205421478,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596061885
    },
    {
        "content": "<p>Actually methinks that if the IG has an entry for an external code system in the &lt;special-url&gt; parameter then we DO absolutely want to not generate errors and do what we can - because the existence of such a parameter indicates that the value set CLD is deliberate, but the IG and server does not have access to the code system content.</p>",
        "id": 205421627,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596061989
    },
    {
        "content": "<p>I will wait for <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> and HTA to let me know what needs to be done with this in UTG.  I also know that Paul Knapp and Mary Kay are working to get a bunch of X12 content so the implementers can use it.  Once they have gotten it, we can make code system resource stubs in UTG with this stuff (see the UTG ada-snodent for an example).</p>",
        "id": 205421838,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596062138
    },
    {
        "content": "<p>It looks like ALL of the value set errors in the UTG build are from enumerated CLDs in value sets (ValueSet.compose) from nucc.    If we fix this, then all those errors go away.</p>",
        "id": 205422081,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596062327
    },
    {
        "content": "<p>The dozen or more v3 value sets built on NUCC are ALL enumerated.   The v3 MIF publication never published the codes; the MIF definition of the code system is simply:      &lt;codeSystem name=\"nuccProviderCodes\" title=\"NUCC Health Care Provider Taxonomy\"<br>\n               codeSystemId=\"2.16.840.1.113883.6.101\"&gt;<br>\n      &lt;annotations&gt;<br>\n         &lt;documentation&gt;<br>\n            &lt;description&gt;<br>\n               &lt;text&gt;<br>\n                  &lt;p&gt;The Provider Taxonomy Code List is published (released) twice a year on July 1st and January 1st. The July publication is effective for use on October 1st and the January publication is effective for use on April 1st. The time between the publication release and the effective date is considered an implementation period to allow providers, payers and vendors an opportunity to incorporate any changes into their systems. This listing includes Active codes approved for use effective April 1st, 2003, version 3.0; and codes that are New and approved for use effective October 1st, 2003, version 3.1.&lt;/p&gt;<br>\n                  &lt;p&gt;It was identified that there is an IP licensure issue with the republishing of the content for this code system by HL7, so the content was removed as of the July 2016 Harmonization cycle release.  This external code system content may be accessed from the web page located at <a href=\"http://www.nucc.org/index.php/code-sets-mainmenu-41/provider-taxonomy-mainmenu-40\">http://www.nucc.org/index.php/code-sets-mainmenu-41/provider-taxonomy-mainmenu-40</a>. Multiple formats and means of accessing the content are available from this page.&lt;/p&gt;<br>\n               &lt;/text&gt;<br>\n            &lt;/description&gt;<br>\n         &lt;/documentation&gt;<br>\n      &lt;/annotations&gt;<br>\n      &lt;releasedVersion releaseDate=\"2019-12-15\" hl7MaintainedIndicator=\"false\"<br>\n                       completeCodesIndicator=\"false\"<br>\n                       hl7ApprovedIndicator=\"false\"&gt;<br>\n         &lt;supportedLanguage&gt;en&lt;/supportedLanguage&gt;<br>\n      &lt;/releasedVersion&gt;<br>\n   &lt;/codeSystem&gt;.  but the old Publishing tooling happily generated the value set expansions from the enumerated definitions.     I really think we need to have UTG work this way with the Publisher.</p>",
        "id": 205422352,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596062540
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> you're confused about this - it's confusing. There's 3 code system resources claiming to be for NUCC:</p>\n<ul>\n<li>\n<p><a href=\"https://terminology.hl7.org/CodeSystem-v3-nuccProviderCodes.html\">https://terminology.hl7.org/CodeSystem-v3-nuccProviderCodes.html</a> </p>\n<ul>\n<li>wrong copyright - no particular claim</li>\n<li>claims that the content was removed in the narrative</li>\n<li>content = not-present (which is correct)</li>\n<li>we should keep this and fix the copyright</li>\n</ul>\n</li>\n<li>\n<p><a href=\"https://terminology.hl7.org/CodeSystem-v3-HealthcareProviderTaxonomyHIPAA.html\">https://terminology.hl7.org/CodeSystem-v3-HealthcareProviderTaxonomyHIPAA.html</a></p>\n<ul>\n<li>copyright claims to be HL7 - so wrong</li>\n<li>contains an incorrect list of nucc codes</li>\n<li>we publish it as our content even after we said we couldn't publish it</li>\n<li>we should remove this and I should ignore it now</li>\n</ul>\n</li>\n<li>\n<p><a href=\"https://github.com/FHIR/packages/blob/master/packages/fhir.tx.support.r4/package/CodeSystem-nucc-provider-taxonomy.json\">https://github.com/FHIR/packages/blob/master/packages/fhir.tx.support.r4/package/CodeSystem-nucc-provider-taxonomy.json</a></p>\n<ul>\n<li>this has the correct copyright claim</li>\n<li>this is not part of UTG; it's just republished from nucc as a service to the community</li>\n<li>it is what is loaded on <a href=\"http://tx.fhir.org\">tx.fhir.org</a></li>\n<li>it has the correct codes, but the one in UTG that is wrong is hiding it, and producing the spurious errors</li>\n</ul>\n</li>\n</ul>",
        "id": 205423220,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596063238
    },
    {
        "content": "<p>so the code system is not unknown to the server, and the value sets would be expanded correctly if UTG  didn't have the erroneous definition of the code system.</p>",
        "id": 205423319,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596063306
    },
    {
        "content": "<p>I don't think we need to wait for HTA to decide to remove the offending code system from UTG: it shouldn't be there by HTA policy and by our previous decisions</p>",
        "id": 205423344,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596063332
    },
    {
        "content": "<p>we do not need to add the X12 stuff to UTG either. We can, but we don't need to; we just need to get the code systems loaded on <a href=\"http://tx.fhir.org\">tx.fhir.org</a> with the appropriate licensing</p>",
        "id": 205423404,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596063371
    },
    {
        "content": "<p>so, your analysis that followed is all based on the first of the 3 resources, and doesn't consider the second</p>",
        "id": 205423444,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596063430
    },
    {
        "content": "<p>Oh criminal thanks for researching this.   Duh.  So much dross from v3 that was imported.    I will remove that second one ASAP clearly it is bad.   I see the harmonization cycle where it was added years ago also.   Sigh.      The first one should be retired/removed as well - I will make sure all of the value sets have the correct canonical URL for NUCC so they do not erroneously reference the other two bad ones.      Technically, by the vocab policy, I should to just removed them, they should be retired with the comment that they were erroneous.   I should remove the OID identifier elements from the as well I think.   Will that mask it from your server and Publishing operation?</p>",
        "id": 205425170,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596064969
    },
    {
        "content": "<p>ok removing and fixing all this...but introduced many new errors.   I think your special handling of the URL <a href=\"http://nucc.org/provider-taxonomy\">http://nucc.org/provider-taxonomy</a> is causing some issues, especially since the manifest wants an entry for it in the tab of External code systems referred to in the IG.  Something I perhaps do not understand...there is an entry for       &lt;parameter&gt;<br>\n        &lt;code value=\"special-url\"/&gt;<br>\n        &lt;value value=\"http://nucc.org/provider-taxonomy\"/&gt;<br>\n      &lt;/parameter&gt; in the IG but still error \"List/external-Rendering: List.entry[16].item (l121/c11)   error   Unable to resolve resource \"<a href=\"http://nucc.org/provider-taxonomy\">http://nucc.org/provider-taxonomy</a>\".  \"    breaking for dinner I'll look at this later and see if I can get it wound up tonight.</p>",
        "id": 205431061,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596070133
    },
    {
        "content": "<p>Do you think that the code system resource that you have above in #3 (nucc-provider-taxonomy.json) should be imported to UTG?</p>",
        "id": 205436227,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596076574
    },
    {
        "content": "<p>ok I did a bunch of fixes and committed them - still 40 or so errors on value sets trying to enumerate codes in NUCC.  If you get a chance, let me know what else needs to be done?</p>",
        "id": 205439425,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596081208
    },
    {
        "content": "<p>I think that it shouldn't be imported to UTG. UTG is <em>governance</em> and publishing. So that anything that HL7 should publish, should be in UTG. If it's simply making content available to the ecosystem, then we shouldn't put it in UTG - we should put it in the terminology support package</p>",
        "id": 205439928,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596081918
    },
    {
        "content": "<p>you committed to UTG?</p>",
        "id": 205439936,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596081934
    },
    {
        "content": "<p>yes my changes all are pushed to ci 1.0.24</p>",
        "id": 205440060,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596082122
    },
    {
        "content": "<p>good night I am beat here</p>",
        "id": 205440064,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596082136
    },
    {
        "content": "<p>the issues with nucc relate to this:</p>\n<div class=\"codehilite\"><pre><span></span><code>  &lt;include&gt;\n      &lt;system value=&quot;http://nucc.org/provider-taxonomy&quot;/&gt;\n      &lt;filter&gt;\n        &lt;property value=&quot;concept&quot;/&gt;\n        &lt;op value=&quot;is-a&quot;/&gt;\n        &lt;value value=&quot;111N00000N&quot;/&gt;\n      &lt;/filter&gt;\n    &lt;/include&gt;\n</code></pre></div>",
        "id": 205444604,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596088878
    },
    {
        "content": "<p>what is this code?</p>",
        "id": 205444605,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596088883
    },
    {
        "content": "<p>This is what I found:</p>\n<p>PROVIDER TAXONOMY CODE<br>\n<code>111N00000N</code></p>\n<p>PROVIDER TAXONOMY DESCRIPTION TYPE AND CLASSIFICATION<br>\n<code>Chiropractors-Chiropractor</code></p>\n<p>PROVIDER TAXONOMY DESCRIPTION SPECIALIZATION<br>\n<code>N/A</code></p>",
        "id": 205467911,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1596109431
    },
    {
        "content": "<p>These codes were inserted into V3 by request of someone who claimed they were accurate; the old harmonization process took on faith that submitters knew what they were talking about.    If codes are wrong, they need to be fixed - but they have been used in v3 based systems for many years.</p>",
        "id": 205472767,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596112743
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> So this  code is, in fact, part of NUCC provider taxonomy as published by NUCC and should be valid?</p>",
        "id": 205473198,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596113011
    },
    {
        "content": "<p>Yes, that's how it appears to me.  I assume it's still present and the same in the latest version (but I'm not completely confident that I've verified it to that level).</p>",
        "id": 205473982,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1596113527
    },
    {
        "content": "<p>Well we need to do that; the errors might be because the server does not have the correct content or there might be some more subtle thing going on.   <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Can we run this to ground?</p>",
        "id": 205490147,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596121522
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Not sure why you would say that it is in NUCC. What are you basing that on? Neither of the two codes listed in the comments above are in the current version (20.0) of NUCC: </p>\n<blockquote>\n<ul>\n<li>\n<p>&lt;/compose&gt; and the code 1223P0700Y is not in the v3 code system stub for NUCC or anything <br>\n**      Code 1223P0700Y does not exist. 1223P0700X <em>does</em> exist with description \"Prosthodontics\"</p>\n</li>\n<li>\n<p>111N00000N - Chiropractors-Chiropractor<br>\n**      This code does not exist. 111N00000X <em>does</em> exist with the description \"Chiropractor\"</p>\n</li>\n</ul>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  So it seems the code system has changed from whatever you all are using. We need to be very cautious about making presumed statements on truthful content in externally defined code systems as this constantly gets us into trouble.  </p>\n<p>I'm working on getting some clarity for NUCC grouping codes and also clarity on how we can get ongoing access to it. We will have this problem frequently if we make \"needed\" content we do not have control over available in <a href=\"http://tx.fhir.org\">tx.fhir.org</a></p>",
        "id": 205495398,
        "sender_full_name": "Robert McClure",
        "timestamp": 1596123935
    },
    {
        "content": "<p>Sigh.  I the meantime until you get this all straightened out Rob M, I have 40 errors in the UTG build, all for the v3 codes added for the HIPAA message guide a number of years ago.   I really want to get a clean build for UTG...how are we going to proceed?  And on what timeline?</p>",
        "id": 205514477,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596133537
    },
    {
        "content": "<p>well, we appear to have 2 options:</p>\n<ul>\n<li>fix what we can to the right codes and otherwise go ahead with errors in UTG</li>\n<li>add the wrong codes that we can't fix to the terminology support version of the provider taxonomy while we wait</li>\n</ul>",
        "id": 205525192,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596139151
    },
    {
        "content": "<p>I favor the first option, and we try to contact the folks who can correct errors.   The big unknown to me right now is why Rob Hausam found the offending codes in NUCC, but you don't have then and Rob McClure thinks it is not right either.  WTF?    I think first we need to precisely describe and quantify the problem, ie what is missing from where, or wrong and needs correcting.   I am worried if we take your second option, the error will become buried and lost in the sands of time.</p>",
        "id": 205530524,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596142080
    },
    {
        "content": "<p>Doing a bit of research on the NUCC site, it appears that at some point in the past, the last character of the code values was changed from \"N\" to \"X\".   All of the v3 code values in the enumerated value set definitions end with \"N\".  Upon cursory examination of a handful of them, the rest of the code string looks identical.    This beast was added to the v3 coremif in 2009.   The content was from earlier than that...and the NUCC site makes the old content available only back to 2009.   If a change was made that would account for it.   It is very possible that back in 2009 the content was added from the UMLS copy of the provider taxonomy as much of that was being done back then - this predates my taking over the harmonization stuff.   So we have a Situation where all of our older codes have been changed.</p>",
        "id": 205532667,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596143183
    },
    {
        "content": "<p>well, can we just fix them in the UTG source?</p>",
        "id": 205532751,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596143242
    },
    {
        "content": "<p>Not a hard editorial fix - the issue is that what about any systems or data out there that has used these old codes?  They have been published this way in the v3 normative editions for over 10 years now.   I am a bit at a loss of the best way to deal with this.</p>",
        "id": 205535686,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596145172
    },
    {
        "content": "<p>It might be that common alternative source (UMLS maybe?) has these codes with the \"N\", perhaps that is what Hausam used to find it and state that it was accurate.</p>",
        "id": 205535769,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596145221
    },
    {
        "content": "<p>given that it's them that changed the codes, not us, then the way to handle this is put an entry in the UTG release notes saying that we've updated for changes, and implementers may need to review their implementations accordingly</p>",
        "id": 205535948,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596145361
    },
    {
        "content": "<p>I'm not sure they changed them, I am thinking more likely that whoever added them to v3 used a different source as NUCC was not making any machine readable data available back then.    All source I can find in the last 10 minutes of searching all use the \"X\".      I am liking your suggestion...the problem is smaller since HTA ordered us to remove the code system content so this is only three dozen or so value sets that have enumerated codes in them.   But there exists Vocabulary WG policy on such CLD changes...I need to make sure we are not running afoul of things in a way that will make the problem worse.</p>",
        "id": 205536352,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596145622
    },
    {
        "content": "<p>Right now I am trying to get agreement with the vocab chairs that we just make the change to the ValueSet.compose messes, and update the versions of the value sets, and document the issue in detail in the Provenance resources so it shows up in the History.</p>",
        "id": 205536751,
        "sender_full_name": "Ted Klein",
        "timestamp": 1596145865
    }
]