[
    {
        "content": "<p>I don't see a Suggest a Change link in there, nor do I see any JIRA items for \"ig-guidance,\" but a suggestion:</p>\n<p>I often have difficulty figuring out what an IG is for. Explicit description of the functionality, either with use cases or references to DAMs or other requirements assets, will help people not involved in the IG creation understand what it's for and how it fits in the landscape.</p>",
        "id": 240501121,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1622135828
    },
    {
        "content": "<p>good point on the lack of way to report an issue. Put issues in github <a href=\"https://github.com/FHIR/ig-guidance\">https://github.com/FHIR/ig-guidance</a></p>",
        "id": 240507172,
        "sender_full_name": "John Moehrke",
        "timestamp": 1622138474
    },
    {
        "content": "<blockquote>\n<p>I often have difficulty figuring out what an IG is for</p>\n</blockquote>\n<p>How is this not the proper first narrative for a guide home page? Is it that they're not trying, or they're not communicating to you?</p>",
        "id": 240587186,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1622198048
    },
    {
        "content": "<p>I think so. but I think the point is that IG authors are not thinking about the reader that comes at their spec cold</p>",
        "id": 240587358,
        "sender_full_name": "John Moehrke",
        "timestamp": 1622198175
    },
    {
        "content": "<p>well, surely they should be?</p>",
        "id": 240587598,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1622198339
    },
    {
        "content": "<ol>\n<li>Yes, the introduction should be clear. We could put that in the guidance, too. I think they are trying, but they have unrecognized assumptions.</li>\n<li>If there is actual documented business analysis, it should be easy to point to. If not, it's that much more important to get it out of the designer's head to where everyone can see it.</li>\n</ol>",
        "id": 240644200,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1622227010
    },
    {
        "content": "<p>We can provide some guidance but everyone will have their flavour</p>",
        "id": 240658017,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1622234376
    },
    {
        "content": "<p>We can enable features. But we cannot say how people shall organize their information</p>",
        "id": 240658110,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1622234426
    },
    {
        "content": "<p>I think the only thing being asked for is a reminder to authors to have a simple statement of purpose on the index.html</p>",
        "id": 240658209,
        "sender_full_name": "John Moehrke",
        "timestamp": 1622234510
    },
    {
        "content": "<p>HL7 could mandate that this simple statement of purpose was exactly the same as the IG description in the IG Registry</p>",
        "id": 240658302,
        "sender_full_name": "John Moehrke",
        "timestamp": 1622234546
    },
    {
        "content": "<p>That is size limited, and limited to text, so it should not be exactly the same. But it should be functionally equivalent, I agree</p>",
        "id": 240775380,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1622410698
    }
]