[
    {
        "content": "<p>Hi all, I was reflecting on the discussions from the last FHIR-I WGM Quarter about IG Templating... I feel like there's a lot of contention around the IG template because it's trying to be everything to everyone.  There were a lot of times that people spoke of \"how they want to consume data\" vs. \"how they want to present data\".  It made me think about how differently even a single person would consume IGs as their experience grows (e.g., from first IG they read to 'oh, another version', etc.).</p>\n<p>Is it realistic to try and make a single template that will be suitable for every use and every experience level across every discipline (e.g., expert clinical and novice tech, novice clinical and expert tech, etc.)?  Especially given constraints like 'browsers without JavaScript', I feel like we're chasing an impossible target.</p>\n<p>Is there any way we can change that?  For example, could we make a 'basic' template that serves as the source of truth, works universally, etc., but then have other views into the same data?  Can we build tools that have things like dynamic tables, filters, etc. that are useful across many IGs, regardless of who published them?</p>\n<p>To be clear, I don't have any proposals or answers right now, but I wanted to ask the question  =).</p>",
        "id": 254383619,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632323450
    },
    {
        "content": "<p>we have one publication, so one template. That doesn't mean we shouldn't have good views that are focused on particular users. There are some IGs that do that</p>",
        "id": 254385845,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632324305
    },
    {
        "content": "<p>Other organizations can have vastly different templates, but our intention is to have a consistent look &amp; feel for at least HL7 IGs.  (And many organizations find that having consistency with the way HL7 publishes is helpful for their own readers.</p>",
        "id": 254388016,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632325091
    },
    {
        "content": "<p>Yes, having one template for one publication makes sense.  But, the fact that we can't do something like add toggleable components makes a lot of UI stories hard.  On top of that, if we <em>do</em> add a lot of usability, etc., it will not apply to anything published earlier in time.</p>\n<p>So if Jan 1 we have a great new format, only IGs that are published after that be able to use it.  Given that publication is a <em>lot</em> of work, IGs published in December would just be out of luck, potentially for a long time.</p>\n<p>I'm wondering if we can separate the publication aspect from the view aspect to allow for more development.  I don't know if it's possible / realistic / desired / etc.</p>\n<p>Yes, other orgs have different templates now too.  I don't see any way of changing that, but it does work in direct opposition to the desire for consistency.  If I need to use 5 IGs, I likely don't care who developed or published them.  I need the same info from each and would like to be able to view them in a consistent way.  Obviously that only applies to something that uses the HL7 tooling, but I think that's a venn diagram with a lot of overlap.</p>",
        "id": 254389464,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632325641
    },
    {
        "content": "<p>If someone wants to put out a technical correction that just moves to the newest templates/publisher, that's a relatively low lift.  (Though you may run into new validation issues you might want to address, FMG probably wouldn't force you to.)</p>",
        "id": 254390569,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632326127
    },
    {
        "content": "<p>I'm expecting many of the Da Vinci IGs to do technical corrections to take advantage of the next set of IG enhancements once they're done and tested (unless they already have a new release coming up for other reasons).</p>",
        "id": 254390744,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632326193
    },
    {
        "content": "<p>specs are a standard, not a UI. That imposes some real - important - constraints</p>",
        "id": 254391478,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632326412
    },
    {
        "content": "<p>creative UI may feel satisfying to the author, but it is very frustrating to the reader.</p>",
        "id": 254392114,
        "sender_full_name": "John Moehrke",
        "timestamp": 1632326618
    },
    {
        "content": "<p>also. as a standard we need to meet readability criteria of the whole community.</p>",
        "id": 254392294,
        "sender_full_name": "John Moehrke",
        "timestamp": 1632326685
    },
    {
        "content": "<p>All fair points.  I see the specs / standard as data and want to think about how to separate concerns.</p>\n<p>For example (something random that popped into my head writing this), but have the templates gone though things like accessibility review?  I don't see a way to change the UI color / contrast / etc.  Those types of issues don't exist on a 'publication', since the output is a single 'printed' version (e.g., the PDFs that are generated from the specs).  But for people consuming data on the web, those are table stakes.</p>\n<p>I don't think we want a system that forces everyone to 'republish' each time we address something like that, but I don't think we should be ignoring those tasks either.</p>",
        "id": 254394425,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632327433
    },
    {
        "content": "<p>I would be afraid to see the output from a US section 508 review of a spec.  I think we'd have a lot of work  to do to make this accessible to screen readers and such</p>",
        "id": 254395320,
        "sender_full_name": "David Pyke",
        "timestamp": 1632327746
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179252-IG-creation/topic/IG.20Templating.20to.20Solve.20All.20Problems/near/254391478\">said</a>:</p>\n<blockquote>\n<p>specs are a standard, not a UI. That imposes some real - important - constraints</p>\n</blockquote>\n<p>A lot of requests I see for the IG template are because it <em>is</em> a UI (or rather, the output is).</p>",
        "id": 254395338,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632327754
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192587\">David Pyke</span> <a href=\"#narrow/stream/179252-IG-creation/topic/IG.20Templating.20to.20Solve.20All.20Problems/near/254395320\">said</a>:</p>\n<blockquote>\n<p>I would be afraid to see the output from a US section 508 review of a spec.  I think we'd have a lot of work  to do to make this accessible to screen readers and such</p>\n</blockquote>\n<p>Yep - I was starting with lower-hanging fruit as an example  =)</p>",
        "id": 254395484,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632327809
    },
    {
        "content": "<p>We're waiting for someone who needs US section 508 adherence to fund that initial pass-through.  We absolutely recognize it's needed, but it's a significant enough effort, it's very hard to do on a volunteer basis.  (Once the work is done, checking new changes to make sure they don't break our compliance would be added to the set of requirements.)</p>",
        "id": 254395667,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632327886
    },
    {
        "content": "<p>there is work around accessibility. but some of it's crazy... every page has to have a H1, for instance. Not going to happen under my watch</p>",
        "id": 254396150,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632328082
    },
    {
        "content": "<p>other things, totally reasonable</p>",
        "id": 254396325,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632328148
    },
    {
        "content": "<p>So, to bring it full circle - is it worthwhile to look at a process where someone who wants an H1 on every page can build that without re-inventing the entire publishing pipeline and running it all themselves?</p>",
        "id": 254396456,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632328202
    },
    {
        "content": "<p>They can create their own templates.  SHould be able to run off the same publisher.</p>",
        "id": 254399536,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632329389
    },
    {
        "content": "<p>Fair - so to get an accessible version of &lt;random IG I didn't author&gt;, even if there's an accessible template already, I need to: find the source for the IG, run IG publisher (which hopefully doesn't introduce errors moving between templates), and use that site.</p>\n<p>I'd like to explore if we could separate the data from presentation instead (e.g., use this app/site/SPA/etc. to view an IG).</p>",
        "id": 254404776,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632331280
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  did do a review using tools that evaluate accessibility. Unfortunately tools are not humans doing the evaluaton</p>",
        "id": 254405924,
        "sender_full_name": "John Moehrke",
        "timestamp": 1632331771
    },
    {
        "content": "<p>“Review” is a bit of an exaggeration. I ran a page from a couple of IGs though a couple of online tools to see what they would spit out.</p>",
        "id": 254406194,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632331875
    },
    {
        "content": "<p>I'm using accessibility as an example...  I think that there are things that can be done in the presentation layer that we don't do right now, in part, because we're using a combined data and presentation.</p>\n<p>As another example, I've heard a few times recently about using spreadsheets to consume IGs.  I don't think the people are [necessarily] using excel files in their own workflows, just that Excel provides a useful view into the data.  It'd be great if someone could build a tool that gives the desired view by navigating to the IGs.</p>",
        "id": 254407286,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632332286
    },
    {
        "content": "<p>The ability to render IG content differently is certainly more possible than it has been in the past with v2 or CDA, but it's certainly going to require some effort and isn't guaranteed to work, depending on what you're trying to do.</p>",
        "id": 254412568,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632334362
    },
    {
        "content": "<p>My understanding is that we have <br>\na) computable content that can be UI'ed. <br>\nb) one reference IG UI flavour. <br>\nWe are never get the infinite variety of flavours that would make everyone happy all the time (and user preferences do change with time and experience).</p>",
        "id": 254414795,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632335197
    },
    {
        "content": "<p>The things I like to give more attention to are in those lines.</p>",
        "id": 254415209,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632335346
    },
    {
        "content": "<p>It is possible to drastically change the look and feel of an IG (the content part will mostly remain the same though)</p>",
        "id": 254415606,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632335507
    },
    {
        "content": "<p>But we should not chase all those flavours.</p>",
        "id": 254416337,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632335771
    },
    {
        "content": "<p>Lloyd: yes, I'm wondering if it worth exploring or not.<br>\nJose: yes and no.. Today, people can build their own templates, but it requires using IG publisher from source.  If I wanted to create (for example) a fully accessible template, I would need to rebuild all of the IGs from source in order to use it.  Especially for IGs that are \"old\"*, this isn't feasible.</p>\n<p>*\"old\" meaning published under some prior version of IG publisher that includes breaking changes backwards from current.. could be 1 or 10.</p>",
        "id": 254416413,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632335803
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> </p>\n<blockquote>\n<p>It'd be great if someone could build a tool that gives the desired view by navigating to the IGs.</p>\n</blockquote>\n<p>What do you mean with this?</p>",
        "id": 254416622,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632335883
    },
    {
        "content": "<p>I specifically don't want to chase all those flavors (because it's not achievable).  I'm wondering if there's something IG publisher can output (state before Jekyll?) that could be 'published' and available for other presentation layers to consume.</p>",
        "id": 254416655,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632335894
    },
    {
        "content": "<p>All the pre-jekyll content is there</p>",
        "id": 254416744,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632335933
    },
    {
        "content": "<p>(I'm not saying we should not use other presentation layers - just that it will be an infinite and always changing set of features - some of which we may onboard, of course)</p>",
        "id": 254416936,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632336006
    },
    {
        "content": "<p>For example it seems reasonable that a PDF version could be produced not <em>from</em> Jekyll but <em>in parallel with</em> Jekyll</p>",
        "id": 254417270,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632336123
    },
    {
        "content": "<p>Is that similar to what you are thinking, Gino?</p>",
        "id": 254417340,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632336154
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"222054\">Gino Canessa</span> - that would also open up for having a bit more control over the process meaning applications not calling other applications - having that call embedded that is</p>",
        "id": 254417419,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1632336192
    },
    {
        "content": "<p>(I mean the publisher invoking jekyll and all)</p>",
        "id": 254417483,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1632336220
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179252-IG-creation/topic/IG.20Templating.20to.20Solve.20All.20Problems/near/254416622\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"222054\">Gino Canessa</span> </p>\n<blockquote>\n<p>It'd be great if someone could build a tool that gives the desired view by navigating to the IGs.</p>\n</blockquote>\n<p>What do you mean with this?</p>\n</blockquote>\n<p>I think this came up specifically in Q1 today - someone (might have been you? I can't remember) wanted a filterable table view of the elements that supports reordering of columns, sorting, etc.</p>\n<p>Right now, the answer is download spreadsheets.</p>\n<p>If I publish an IG and want that, the answer is build a template, which I cannot use if my IG is official.</p>\n<p>Or, I could build a UI* that offered that functionality.  Today, I could either download the spreadsheets myself (which do not contain all the content of an IG), or try to scrape the info off the published sites.  Those publications will have differences even with a single template over time, much more if you want to support 'non-HL7' templates, so scraping is ...frustrating? to get right and maintain.</p>\n<p>Is there a space that allows HL7 to meet their concerns, hopefully reduce burden / workload, and open things up for others?  <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>\n<p>*UI: perhaps doing too much work by saying 'UI' here, I'm thinking of presentation layer in general.</p>",
        "id": 254417762,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632336314
    },
    {
        "content": "<p>For clarification, if I were doing something like this my hope would be that I could build a tool that does not need to rebuild the IG to consume it.</p>",
        "id": 254418388,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632336522
    },
    {
        "content": "<p>you're advocating for a \"pipe-and-filter\" design?</p>",
        "id": 254418520,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1632336579
    },
    {
        "content": "<p>Well, I started this thread specifically without a proposal or answer in mind, so I'm not advocating anything beyond having the discussion  =).</p>\n<p>In reality, that's one approach of many possibilities.  Some number of people would need to look at this seriously and spend time weighing the pros and cons before I'd actually push for something.</p>\n<p>Right now I'm curious if something like this is desirable and achievable.</p>",
        "id": 254419114,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632336822
    },
    {
        "content": "<p>When the IG publisher runs it generates a bunch of jsons and xmls in the temp folder</p>",
        "id": 254419152,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632336836
    },
    {
        "content": "<p>So it is possible to do something with the template (template is not only presentation but pre- and post-processing) to reuse that content</p>",
        "id": 254419309,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632336889
    },
    {
        "content": "<p>I have gone through the steep-ish curve of learning some of those mechanisms, and if we want to have a workshop on that I'm in - for me to learn more or share what I can</p>",
        "id": 254419576,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632336983
    },
    {
        "content": "<p>For example, to talk about adding a JQuery datatable to Artifacts page</p>",
        "id": 254419902,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632337115
    },
    {
        "content": "<p>:)</p>",
        "id": 254419912,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632337119
    },
    {
        "content": "<p>Templates primarily drive outputs, but they also drive inputs.  It's easy for someone to swap templates if they expect the same inputs, but it doesn't work well if the inputs differ.  So what you really want is a set of templates that are intended to work together.  We've talked about having a template for PDF generation.  We've held off because we think PDFs suck and don't want to encourage their use, but at some point someone will probably force us to because of some regulatory requirement or other.  If someone wants to define their own template for their own specific rendering requirements and align it with our current inputs and re-run the publisher pointing to the new template, they can.  We don't need to do anything to enable that.  (But I also don't think we want to advertise it as desirable as we'd prefer that almost everyone look at specs from a consistent rendering and we also don't have a ton of bandwidth to support those who author custom templates, so we'd prefer if the volume of those was smaller rather than larger.)</p>",
        "id": 254420295,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632337261
    },
    {
        "content": "<p>Yes, that's why I want to discuss.  <em>If</em> something like this were to happen, it would need to be defined in such a way that it was generally stable.  I'm fairly confident it's possible since we have definitional resources that are normative, but there's a lot of content that falls outside of those.</p>\n<p>If the process starts by pulling files from a temp processing directory, the result will always be a fragile workflow that arbitrarily breaks.  There are times when that's the best option, but I don't <em>think</em> this is one, and I would be very hesitant to go that route.</p>\n<p>One option would be trying to split apart IG publisher (as mentioned earlier) into a part that does all of the required validation, assembly, etc. and a part that translates that into presentation.  Another would be to build a separate process that starts from the same source, skips all the validation, etc. (since that's done by IG publisher), and then outputs the desired files*.</p>\n<p>I don't know much about the internals of IG publisher and the publication pipeline, so I'm not in a position to suggest the best approach... I'm just the idea guy ;-).</p>\n<p>In all seriousness though, I don't see something like this working unless it's generally wanted and supported.  It's why I brought it up for discussion instead of just adding it to my 'fun projects to work on' list.</p>\n<p>*desired files: no idea what this looks like yet either, just spit-balling.</p>",
        "id": 254426133,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632339592
    },
    {
        "content": "<p>The IG templates and publisher interact at several points.  In the first pass, the templates update the IG to include parameters that affect IG publication, including where to look for input files.  In the second pass, all resources have been identified, but information about them can be supplemented, the IG can be tweaked to do things like insert additional pages, and some data files that subsequently drive generation are produced.  Then the publisher validates everything and generates whatever fragments were requested with the naming conventions requested.  Templates have a chance to do another bit of messing around (though I'm not sure anyone does anything at this step), then Jekyll is run, then the templates can do a bit more stuff (generally QA), then final QA and packaging is done.  It's going to be pretty hard to disentangle all of this, and I'm not sure we'd want to.  I think the best approach is to simply create 'aligned' templates and monitor the evolution of the 'base' template to maintain that alignment (in terms of expecting source files to exist in certain places, take advantage of publisher-generated fragments, etc.).</p>",
        "id": 254428946,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632340684
    },
    {
        "content": "<p>Sure.  Based on what you're saying (and in a non-binding way =), would it be better to create a separate template to run in a separate pass, or add functionality to it to export files (e.g., how it exports spreadsheets, zip files, etc.)?</p>\n<p>I hate the idea of two passes, but since there are other templates in production already I don't know that tacking on there would be better.</p>",
        "id": 254433961,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632342614
    },
    {
        "content": "<p>It is possible to add functionality to the template</p>",
        "id": 254447975,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632348972
    },
    {
        "content": "<p>So it would be one pass, I guess. But it's hard to say without a specific topic or feature</p>",
        "id": 254449210,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632349667
    },
    {
        "content": "<p>We’ve already had to generate some PDFs for regulatory purposes. We used a website -&gt; PDF tool. I investigated automatically producing PDFs but it was difficult tooling wise, super messy template wise, and not worth the iWork when there’s website to PDF tools</p>",
        "id": 254458270,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632354910
    },
    {
        "content": "<p>As for the wider issues Gino is dreaming about: Gino, the entire knowledge that the IG publisher has is embedded in processible form in the output, and the eco-system of published packages is entirely open. There’s nothing it could do that it hasn’t already done to make it possible to write your own IG viewer.  Also, the IG publisher can be fed completed html, and it just qa’s it. So if you think there’s mileage in writing a viewer, I don’t need to do anything to make it possible for you to do it</p>",
        "id": 254458478,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632355061
    },
    {
        "content": "<p>So knock yourself out.</p>",
        "id": 254459470,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632355667
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"222054\">Gino Canessa</span> <a href=\"#narrow/stream/179252-IG-creation/topic/IG.20Templating.20to.20Solve.20All.20Problems/near/254426133\">said</a>:</p>\n<blockquote>\n<p>One option would be trying to split apart IG publisher (as mentioned earlier) into a part that does all of the required validation, assembly, etc. and a part that translates that into presentation.  Another would be to build a separate process that starts from the same source, skips all the validation, etc. (since that's done by IG publisher), and then outputs the desired files*.</p>\n</blockquote>\n<p>I'm sure there are good reasons behind this but I've also felt that the IG Publisher is kind of doing too much. From my observations the IG Publisher is:</p>\n<ol>\n<li>Compiling FSH files using SUSHI.</li>\n<li>Validating resources</li>\n<li>Generating the ImplementationGuide resource.</li>\n<li>Generating examples ++ ?</li>\n<li>Generating snapshots and narratives?</li>\n<li>Creating FHIR Package (NPM)</li>\n<li>Generating HTML page using templating.</li>\n</ol>\n<p>There are times while developing locally or during a CI\\CD pipeline that I would like more control over what is done, primarily to speed things up.<br>\nSome use case examples: </p>\n<ol>\n<li>Generate the HTML while working locally without caring about the validation or FHIR package.</li>\n<li>Only validate the IG.</li>\n<li>Building the FHIR Package without the presentation.</li>\n<li>Skipping the html generating and instead use some other tool\\framework to create the presentation: hugo, next.js, readthedocs or whatever is in fashion.</li>\n</ol>",
        "id": 254462183,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1632357640
    },
    {
        "content": "<p>The publisher is not generating the IG resource or examples. And it's sushi that compiles the fsh</p>",
        "id": 254493021,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632382177
    },
    {
        "content": "<p>As for radical changes, they should be based on a need and consider the entire ecosystem.</p>",
        "id": 254494820,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632383169
    },
    {
        "content": "<p>(and I don't see a need for a big radical change, given what we can do. I may be biased based on my work with the templates)</p>",
        "id": 254495622,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632383571
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179252-IG-creation/topic/IG.20Templating.20to.20Solve.20All.20Problems/near/254507337\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>here are times while developing locally or during a CI\\CD pipeline that I would like more control over what is done, primarily to speed things up.<br>\nSome use case examples:</p>\n</blockquote>\n<blockquote>\n<p>Generate the HTML while working locally without caring about the validation or FHIR package.<br>\nOnly validate the IG.<br>\nBuilding the FHIR Package without the presentation.<br>\nSkipping the html generating and instead use some other tool\\framework to create the presentation: </p>\n</blockquote>\n<p>the functions are not that separated - the IG is only really validated when the HTML is generated, though 98% of the validation happens in the validation step. But lots of meta is lined up in the validation step that would make the generated html not quite perfectly correct if it didn't happen. But it might be useful to do one and not the other for editorial workflow convenience.</p>\n<p>Producing the package... a fraction of the time - seconds max. </p>\n<p>As for generating using some other tool... whatever you generate with, you'll need the fragments that the IG publisher generates for Jekyll. Actually, Jekyll is pluggable in the IG publisher - we expected people to want other things, but no one ever has. - it's kind of a swiss army knife thing, and people just keep asking for more gems to be plugged into it. But the IG publisher isn't tied to Jekyll. You just need the fragments</p>\n</blockquote>",
        "id": 254507804,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632390002
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179252-IG-creation/topic/IG.20Templating.20to.20Solve.20All.20Problems/near/254507804\">said</a>:</p>\n<blockquote>\n<p>Producing the package... a fraction of the time - seconds max. </p>\n</blockquote>\n<p>Would it be possible to instruct the IG Publisher to produce the package without the HTML?</p>\n<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179252-IG-creation/topic/IG.20Templating.20to.20Solve.20All.20Problems/near/254507804\">said</a>:</p>\n<blockquote>\n<p>Actually, Jekyll is pluggable in the IG publisher - we expected people to want other things, but no one ever has. - it's kind of a swiss army knife thing, and people just keep asking for more gems to be plugged into it. But the IG publisher isn't tied to Jekyll. You just need the fragments</p>\n</blockquote>\n<p>This is pretty cool. Is it possible to make the IG publisher only generate the fragments/artifacts and skip the Jekyll step? The artifacts can then be used as input in some other tool and the IG Publisher can be used without installing Ruby+Jekyll.</p>",
        "id": 254512907,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1632392906
    },
    {
        "content": "<p>delete</p>",
        "id": 254542691,
        "sender_full_name": "Eric Haas",
        "timestamp": 1632406769
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179252-IG-creation/topic/IG.20Templating.20to.20Solve.20All.20Problems/near/254459470\">said</a>:</p>\n<blockquote>\n<p>So knock yourself out.</p>\n</blockquote>\n<p>With an offer like that?  I'm good.</p>\n<p>I started this thread because from what I can see, IG authors and consumers want features that HL7 either can't (e.g., publication process/restrictions) or won't (e.g., not an area of interest/focus) provide - for example, functionality that needs JavaScript.  Are there ways around it?  Sure:</p>\n<ul>\n<li>new site that wraps published HTML</li>\n<li>build pipeline that uses published content to make a new site</li>\n<li>browser extension for advanced formatting / UI</li>\n<li>a separate application that handles advanced viewing</li>\n<li>etc.</li>\n</ul>\n<p>But packages don't include narrative content, and building a UI on top of presentation-formatted HTML with no contract isn't a good use of time (or at least my time, other people's mileage may vary).  Any change made in the template or lower could break it, and if people working in those layers aren't even aware of what <em>is</em> a breaking change  <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span> </p>\n<p>As of right now, my understanding is that narrative is only accessible via a single presentation layer that also needs to be PDF printable and cannot include any JavaScript.  Additionally, that presentation layer is fixed at the time of publication and only updated if a new version is published, which requires a decent (if not significant) effort from both authors and HL7.  So if someone did the work to update the template for accessibility (leaving aside if it's possible within the constraints), it would be available on 0% of all published specs when the work was done.</p>\n<p>What is the open space here?  Can we make a template that has JS and modern features, but falls back to a simpler rendering?  Can we add in 'advanced' features that only work if you do support JS?  Can we have alternative templates on official HL7 IGs?  Is it restricted to what we build on artifacts and have to exclude narrative?   I have no idea, hence this thread.</p>\n<p>To be clear, I don't think this is trivial, nor do I think it's something that can be addressed quickly or in isolation.  So my \"dream\", if that's what we're calling it, was to see if my I was correctly identifying the issue, and if so open discussion.  Apologies if I wasn't clear enough on that up front.  I don't know what are hard constraints (e.g., publication requirements) vs. what different parties would like to see.  I'm not even all that familiar with IG Publisher and the templates (maybe I'd be willing to label myself a novice on publisher, but not even that on the templates =).</p>\n<p>For example, and to catch up on the thread, it looks like it might be possible to have the publisher export some form of 'data' files that can be consumed by generic UIs.  Great! Is it something that could be agreed on?  Would HL7 consider adding those files and making them available alongside the current pages? <em>Could</em> HL7 even do that?  If so, could we start including them so that they're available when the other layers exist?  If not, what kind of options are open that don't violate the rules (e.g., copyright)?  What if the UI was under HL7 purview?  What if it wasn't? (I'm not interested in building a site that will just be taken down)</p>\n<p>I have no idea how much work is needed here, other than my gut saying: a lot*.  However, I'm also not asking you (HL7 in general, Grahame in particular) to do any right now.  But to have any hope of success, there would need to be agreement on what's allowed, what things are stable and what can change, etc.  If there's no interest in exploring that, then (to me) question answered and move on.</p>\n<p>*really, my gut is saying \"a decent but not insurmountable amount of up front work, plus a long-term maintenance commitment\", but that doesn't flow inline with the text =)</p>",
        "id": 254567058,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632415795
    },
    {
        "content": "<p>so you have a number of false assumptions here. The pages do include JS, though I do use it very carefully, to ensure that that presented pages meet ANSI rules, which have a lot to say about not hiding things from people. So we can use JS to build things, but they have to somehow different so that they don't create problems for ANSI. A non-normative rendering would be fine, for instance, but you're right, I'm not doing it. </p>\n<p>The packages do include narrative content. Not all the narrative that goes into an IG, but that is residually available in the temp folder if someone wanted to build something new with it. </p>\n<p>If we fix the template for accessibility, then that will become de facto in all newly published IGs</p>",
        "id": 254568282,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632416283
    },
    {
        "content": "<p>re: false assumptions: Fair. I <em>assumed</em> those as a moderately informed participant, so thank you for clarifying  =).</p>\n<p>re: JS: Good to know where the rules are coming from (again, I assumed as much, but didn't know which organization was imposing them).  I don't know what is possible here, since I many of the usability requests I've heard are specifically around hiding things, but it's discoverable.</p>\n<p>Re: narrative: Sure, but I prefer not to build software based on files I find leftover in a temp folder.  If that has the necessary content (I haven't looked), I would prefer it gets documented and labeled so that it wouldn't arbitrarily break.  Also, while I'll grant that 'narrative' includes content inside resources (e.g., definitions), I was trying to refer to narrative that lives outside of resource definitions (e.g., page content).</p>\n<p>re: publication time: Yes - which means that sometime between that day and never, a version of an IG would be available with the new template.  For a personal example, once the Subscription R4 Backport is published I hope to never publish another version of it.  Any new work will be done on R5, which already includes (or will when I merge it) that same content, and stability of the implementation is one of the top concerns.  At the same time, I expect R4 will be around for many years and would prefer to have the view 'look' current.  Maybe that's just a penalty/tax I need to pay as an IG author, but it does assume that every IG has a long-term custodian (which is another topic anyway).</p>",
        "id": 254587650,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632423926
    },
    {
        "content": "<p>well, it's a balloted standard. I <em>can't</em> change it later. Even just changing the look and feel</p>",
        "id": 254592573,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632425929
    },
    {
        "content": "<p>Blah.  This is quite useful, but blah.  So it sounds like most of the 'interesting' requests would have to be contained in a non-normative view into the content.</p>\n<ul>\n<li>Is that something that would be interesting / possible for HL7 (again, not a request - just feeling out the space)?</li>\n<li>If not, is there conceivably a space that wouldn't go against HL7 policy / desires (e.g., I don't think HL7 wants the main way people consume their content to be something external)?</li>\n</ul>",
        "id": 254597551,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632428099
    },
    {
        "content": "<p>There's nothing to stop anyone from taking any FHIR specification and re-publishing it using whatever views they like.  The base standard could even be updated with a technical correction to point to those alternative views.</p>",
        "id": 254621333,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632439594
    },
    {
        "content": "<p>well, the next release of the IG publisher will support two new parameters for editorial convenience: </p>\n<ul>\n<li>-validation-off - don't do any validation</li>\n<li>-generation-off - don't generate the HTML output</li>\n</ul>\n<p>in both cases, the file qa.html is still produced but some kind of errors will be omitted from it because resources aren't being validated (obviously) or html isn't being generated, which causes other errors to be picked up. but they may be useful for editors.</p>\n<p>Note, though: the package output is unreliable in these cases as an input to some other tool chain. If you're going to do something more with the output, you really need the full generation. I know in theory the HTML shouldn't matter, but, well, I only generate some things I need during the HTML generation. Sure, I could spend some time chasing all of them down, but that would slow down the run if you're not generating HTML... so it seems like something not worth doing to me<br>\n-</p>",
        "id": 255159348,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632802900
    },
    {
        "content": "<p>Does the QA contain a warning indicating that those parameters have been used - so it's clear that the output might be suspect and so FMG can ensure that the build has been run properly?</p>",
        "id": 255224915,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632839014
    }
]