[
    {
        "content": "<p><a href=\"http://fhir.org\" target=\"_blank\" title=\"http://fhir.org\">fhir.org</a> has a registry here: <a href=\"http://www.fhir.org/guides/registry\" target=\"_blank\" title=\"http://www.fhir.org/guides/registry\">http://www.fhir.org/guides/registry</a></p>\n<p>This has been hard to maintain, so we're moving to a new system. If you want to register a published IG, make a pull request to here: <a href=\"https://github.com/FHIR/ig-registry\" target=\"_blank\" title=\"https://github.com/FHIR/ig-registry\">https://github.com/FHIR/ig-registry</a> (well, specifically, on this file: <a href=\"https://github.com/FHIR/ig-registry/blob/master/fhir-ig-list.json\" target=\"_blank\" title=\"https://github.com/FHIR/ig-registry/blob/master/fhir-ig-list.json\">https://github.com/FHIR/ig-registry/blob/master/fhir-ig-list.json</a>). I will change <a href=\"http://www.fhir.org/guides/registry\" target=\"_blank\" title=\"http://www.fhir.org/guides/registry\">http://www.fhir.org/guides/registry</a> to load off this IG registry soon</p>",
        "id": 153950400,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522803971
    },
    {
        "content": "<p>So is this for published IGs, not balloted ones?  Or both?</p>",
        "id": 153950598,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1522850003
    },
    {
        "content": "<p>I see our US Breast Cancer IG in the registry and this is our very first ballot ever -- so it looks like it's intended to contain balloted IGs as well.</p>",
        "id": 153950602,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1522850614
    },
    {
        "content": "<p>Yes, our International Patient Summary IG is <strong>supposed</strong> to be there as it's also listed (unfortunately, the links are broken at the moment), so I guess that does answer the question.</p>",
        "id": 153950606,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1522851139
    },
    {
        "content": "<p>yes balloted as well. and also for anyone else - not just HL7 balloted IGs</p>",
        "id": 153950721,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522872057
    },
    {
        "content": "<p>IHE is adding their IGs (IHE Profiles) to the Registry as they produce conformance resources. This is about 50% at this time. Mostly the ITI domain.</p>",
        "id": 153950750,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522878030
    },
    {
        "content": "<p>note that there's 2 different registries<br>\n- <a href=\"http://registry.fhir.org\" target=\"_blank\" title=\"http://registry.fhir.org\">registry.fhir.org</a> - contains the conformance resources<br>\n- <a href=\"http://fhir.org/guides/registry\" target=\"_blank\" title=\"http://fhir.org/guides/registry\">fhir.org/guides/registry</a> - a list of all published IGs - where they are found</p>",
        "id": 153950754,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522878227
    },
    {
        "content": "<p>there's no IHE IGs on the second, and they should be there - all of them</p>",
        "id": 153950755,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522878243
    },
    {
        "content": "<p>I want to change the links for the IG CI Build to GitHub Pages instead of the autobuilder output.  is that going to be an issue?    Also who is the reviewer and merger just GG?</p>",
        "id": 153951527,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523300405
    },
    {
        "content": "<p>also can we list non-published ( draft ) IG's as well, like argonaut questionnaire and clin notes?</p>",
        "id": 153951528,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523300804
    },
    {
        "content": "<p>yes you can list draft IGs. The reviewer mergers are me, Josh, Lloyd, and I invited you too....</p>",
        "id": 153951533,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523301165
    },
    {
        "content": "<p>you'll have to explain the idea of linking to github pages instead of the autobuilder - why?</p>",
        "id": 153951534,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523301185
    },
    {
        "content": "<p>I) Its easier for me to run all igs off a standard local static framework  ( common set of includes and templates) and  than to have to maintain multiple copies of these files for each ig.   Therefore, my repository need only contain only the source files  ( profiles, pages, examples) and a docs folder for the output and use GitHub to publish.  Autobuild needs all the files.</p>\n<p>2) Separates the draft IG from latest IG-pub generated issues or changes.   ( especially if the IG is couple of generations behind like US-Core or Argonaut.</p>",
        "id": 153951536,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523303573
    },
    {
        "content": "<p>3) other may prefer be comfortable working in their own sandbox for development than using autobuild too.</p>",
        "id": 153951537,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523303641
    },
    {
        "content": "<p>My concern with not using the autobuild is how we'd be able to tell that the committed source was sufficiently complete to publish the IG.  We don't want a situation where some essential piece is sitting on someone's hard-drive.  Everything necessary to produce the publication needs to be in source control and available for inspection.</p>",
        "id": 153951540,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523307391
    },
    {
        "content": "<p>why?   The CI is not there primarily to publish the ig locally or to inspect the build architecture its for inspection of the use case content.</p>",
        "id": 153951546,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523308041
    },
    {
        "content": "<p>Those are separate things in my mind.</p>",
        "id": 153951547,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523308109
    },
    {
        "content": "<p>The CI is a pretty sure-fire way to ensure that all the source is present.  If it builds, then everything needed must be there.  I'm not sure what automated mechanism we could put in place that would determine the same thing if we just committed the generated IG.</p>",
        "id": 153951549,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523308633
    },
    {
        "content": "<p>I'm not suggesting that the published content not use the autobuilder.  But I think it should be up to the editor how they want to publish the developmental content.   Eventually to publish they will have to supply everything, but is it needed out of the gate?</p>",
        "id": 153951556,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523312030
    },
    {
        "content": "<p>I understand the challenge with #1, but I'd rather come up with a way to share the framework across multiple IGs - perhaps by having the build synch with a common source than to simply not check the CI build source in.  I don't really understand #2 - are you maintaining multiple forks?  As for #3, it's up to the maintainer when they choose to commit.  If they're committing the published content, I don't see a downside to committing the source too.</p>",
        "id": 153951564,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523313098
    },
    {
        "content": "<p>Re #1 using <a href=\"https://git-scm.com/book/en/v2/Git-Tools-Submodules\" target=\"_blank\" title=\"https://git-scm.com/book/en/v2/Git-Tools-Submodules\">submodules</a> in GitHUb is one way but it is a pain and the autopublisher doesn't work with them.</p>",
        "id": 153951573,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523315390
    },
    {
        "content": "<p>re #3  if you are sharing your work why not have frequent commits?  Git pages make that pretty painless as long as your local build works.  And there is no dependency on the latest version of ig-pub</p>",
        "id": 153951574,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523315467
    },
    {
        "content": "<p>#2 for things like US-Core and Argonuat.  They may not work with the latest IG-pub but you can share updates to content with an earlier ig-pub with your community while delaying the pain of updating to the lated version til you are ready to publish.</p>",
        "id": 153951575,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523315644
    },
    {
        "content": "<p>For #1, I was thinking about the build automatically grabbing the infrastructure from somewhere else.  I can do that with Ant, though I'm not sure the autobuild supports that yet.<br>\nFor #2 &amp; 3, so the issue is that you don't want to be forced to upgrade to the most recent IG Publisher.  I agree that can be a pain on occasion, though (hopefully?), the periods of pain will end soon?  I'm not sure that that's worthgiving up the CI builds.  I know Grahame has had considerable issues with publishing IGs that didn't use the CI Build process.</p>",
        "id": 153951576,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523317885
    },
    {
        "content": "<p>I support using the autopublisher as a prerequisite to publishing.</p>",
        "id": 153951586,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523325369
    },
    {
        "content": "<p>what I don't understand is how git hub pages do anything other than narrative.</p>",
        "id": 153951595,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523345115
    },
    {
        "content": "<p>if the auto-builder starts supporting submodules, would that stop them being a pain?</p>",
        "id": 153951596,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523345147
    },
    {
        "content": "<p>github submodules are a pain without the autobuild too (for me anyway) they require a lot more care and feeding.</p>",
        "id": 153951611,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523357248
    },
    {
        "content": "<p>Git hub pages show the entire published IG as a static site and is updated everytime I commit.  That is what I want to share most of the time.  I don't think most of the collaborators are interested in the build logs and errors.  This may not work for very large IGs.  But I've found it handy.</p>",
        "id": 153951612,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523357441
    },
    {
        "content": "<p>I'm not understanding this. the markdown, sure. But what about all the generated content?</p>",
        "id": 153951613,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523357505
    },
    {
        "content": "<p>Here is the <a href=\"https://argonautproject.github.io/scheduling/downloads.html\" target=\"_blank\" title=\"https://argonautproject.github.io/scheduling/downloads.html\">Scheduling IG on GitHub pages</a> and I can download the validation files as look at the qa content and all the other stuff I normally want to.  I'm not sure what is missing.</p>",
        "id": 153951614,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523357791
    },
    {
        "content": "<p>I didn't say anything was missing. I'm just trying to understand what you're doing and why it's offering you some advantages. RIght now, I'm not understanding what you're doing, let alone why it's better</p>",
        "id": 153951615,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523357909
    },
    {
        "content": "<p>you're commiting the source of your implementation guide to github, and somehow it's building it?</p>",
        "id": 153951616,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523357949
    },
    {
        "content": "<p>no is completely static - I commit the entire output to the docs folder in master.    Its easier not to have to worry  autobuilder generated errors or depend on them (e/g/ when the  term server is down) or because I'm behind on the latest Ig-pub or working on an IG months or years lated or doing some custom hack that will break the autobuilder.   I'm not suggested bypassing the autobuilder for published the final releases but essentially delaying the pitfalls associated with that.</p>",
        "id": 153951665,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523377213
    },
    {
        "content": "<p>So you want to build with an old version of the IG publisher.  I don't think that protects you from terminology issues.  In fact, it probably creates some unless you're building with terminology disabled, as the old IG publisher versions won't run with the new terminology server.</p>",
        "id": 153951667,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523379836
    },
    {
        "content": "<p>you commit the output... wooah.  well, you can do that, I guess. It sounds like a bad workflow to me though we could take about what kind of things you do that result in the IG not even succeeding. Not sure why \"working on an IG months or years late\" is something that calls for this or what \"doing some custom hack that will break the autobuilder\" means</p>",
        "id": 153951692,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523397380
    },
    {
        "content": "<p>I run the ig-pub with the term off a lot.  (It speeds thing up and  isolates problems )  Commiting output works well when the igs are small.    When you pick op an IG months later it typically won't build out of the box.   I'm also refactoring a lot of old igs to make them simpler and easier to manage.    Things that break the build include using a separate path for the framework <br>\n filwa and committing only the source files like <a href=\"https://github.com/argonautproject/questionnaire\" target=\"_blank\" title=\"https://github.com/argonautproject/questionnaire\">here</a> .</p>",
        "id": 153951714,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523409606
    },
    {
        "content": "<p>but if you all think its a bad idea I won't protest - but I won't be updating the CI build frequently either.</p>",
        "id": 153951715,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523409706
    },
    {
        "content": "<p>so thinking about this... you'd have to have the framework in another github repository, yes? Would we want to the auto-publish to fire for all the guides that depend on it if it's changed?</p>",
        "id": 153951734,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523421011
    },
    {
        "content": "<p>That would be nice</p>",
        "id": 153951742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523425754
    },
    {
        "content": "<p>but it seems inherently hard....</p>",
        "id": 153951743,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523425823
    },
    {
        "content": "<p>anyway, the primary issue with this relates to what is the big unsolved issue for IG publication for me: managing dependency resolution</p>",
        "id": 153951744,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523425867
    },
    {
        "content": "<p>Regenning dependent repositories isn't critical - especially with that nice UI that lets you force the regen of a bunch just by clicking on some buttons</p>",
        "id": 153951834,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523455349
    },
    {
        "content": "<p>thinking about this... I want to move where we are on this. I want to introduce the idea of a template. and move all the jekyll structural templating stuff to a seperate repository. This way, your Ig would only contain the resources and the narratives (markdown or xhtml) and the structure would come from a separate repository that could be shared between IGs. And we would define one or a few standard templates for HL7 workgroups to use (feedback from consumers is that they want more structural consistency).</p>",
        "id": 153952075,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523546554
    },
    {
        "content": "<p>I nominate <a href=\"https://github.com/Healthedata1/IG-Template2\" target=\"_blank\" title=\"https://github.com/Healthedata1/IG-Template2\">IG-Template2</a> and its file tree as a starting point.  I think I could combine the mapping, and definitions template into the sd template too.</p>",
        "id": 153952079,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523548064
    },
    {
        "content": "<p>And need a tool to create the ig.json and ig.xml files which I guess will soon be combined -  because that is a source of a lot of the pain.</p>",
        "id": 153952082,
        "sender_full_name": "Eric Haas",
        "timestamp": 1523548290
    },
    {
        "content": "<p>I think we should work to integate that with what I've done for the SDC projects, genomics, etc.  I definitely want to preserve the ability to author with XHTML and be able to validate the source files.</p>",
        "id": 153952088,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523551810
    },
    {
        "content": "<p>you can hash out the choice of template question with Eric etc. And the ability to author with xhtml is unrelated to this</p>",
        "id": 153952219,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523617832
    },
    {
        "content": "<p>I started from the SDC and i find that we do need editing tools/frontends for most of the input files. <br>\nMy current dream state is a sort of \"IG editing Desktop\" - an IDE for non-nerds.</p>",
        "id": 153952233,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1523624763
    }
]