[
    {
        "content": "<p>Can we use an IG to create a content grouping for several IGs? A single page that would then link to other IGs? Or that's a job for HTML?<br>\nExample: This is the IG that contains the Ministry's recommendations on everything primary care / everything imaging / everything Quality of Care.</p>",
        "id": 161446048,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553260290
    },
    {
        "content": "<p>Is this an IG importing another IG? Or is it an IG importing the Actors (CapabilityStatements) and profiles (StructureDefinitions)? I ask because I think it is the technical solution from the first IG that you need in the second IG; but the second IG has their own use-cases and flows... right? This distinction is not easy to see with very simple IG that we tend to have today, but likely will be more clear with complex IG.</p>",
        "id": 161448198,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553262049
    },
    {
        "content": "<p>For example, I was involved in the creation of the eLTSS IG, that wanted to start with US-Core and add a CarePlan workflow for Long Term conditions...  The solution is still not fully clear to me either</p>",
        "id": 161448302,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553262124
    },
    {
        "content": "<p>Not importing, more like a landing and index page. More familiar example -  the top IG could be the IHE Pharmacy Technical Framework - a group of IGs, each of the IGs could be a profile.</p>",
        "id": 161457751,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553268597
    },
    {
        "content": "<p>So a better structured page than <a href=\"http://www.fhir.org/guides/registry\" target=\"_blank\" title=\"http://www.fhir.org/guides/registry\">http://www.fhir.org/guides/registry</a>?</p>",
        "id": 161458053,
        "sender_full_name": "David Pyke",
        "timestamp": 1553268808
    },
    {
        "content": "<p>Different purpose. That is a broad repository. I want a curated collection. for example the IHE Pharmacy Technical Framework 2019 (which does not include all the Pharmacy profiles, nor all the IHE profiles, and includes only the \"active\" profiles.</p>",
        "id": 161460582,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553270536
    },
    {
        "content": "<p>But even if that kind of page, is there a resource for that? an IG of IGs? if an IG can contain (not inherit, contain) IGs, that would be a solution. Otherwise we just generate an HTML page.</p>",
        "id": 161460781,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553270674
    },
    {
        "content": "<p>Confluence pages would be a good place for that kind of thing</p>",
        "id": 161461619,
        "sender_full_name": "David Pyke",
        "timestamp": 1553271225
    },
    {
        "content": "<p>Is it something you could declare conformance with or validate with?  If so, you'll need to import them.  If you just want to say \"For your information, this thing exists\", then just include a hyperlink on a page.</p>",
        "id": 161462978,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553272126
    },
    {
        "content": "<p>Yes, need to declare conformance since the \"Technical Framework\" is actually nothing but a composition of the different profiles. I will see how Importing looks esp when passing it through publisher.  I assume wiki is collaborative, always editable, etc, not what I would look for - i was looking at static, generated pages.</p>",
        "id": 161473595,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553280667
    },
    {
        "content": "<p>perhaps i just generate a static page for first experiment</p>",
        "id": 161473719,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553280783
    },
    {
        "content": "<p>The IG is more than just what gets rendered.  If you want the profiles of the referenced IGs to be available when validating, you'll have to import them.  (And the referenced IGs will need to be version-specific references.)</p>",
        "id": 161474055,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553281065
    },
    {
        "content": "<p>Ok, in different words: can/should we use an IG (including Imported IGs) to produce a \"Release\" (in the sense of Release Management) ? the referenced IGs are versioned, so is the container.</p>",
        "id": 161478954,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553284876
    },
    {
        "content": "<p>but the container itself has a version, but has no specific constraints.</p>",
        "id": 161479070,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553284955
    },
    {
        "content": "<p>It's ok for it to not have its own constraints if it's \"packaging\" a specific set of versions of other things.</p>",
        "id": 161479104,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553284993
    },
    {
        "content": "<p>ok, so we _could_ use an IG to just contain other IGs. (right?)</p>",
        "id": 161479145,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553285033
    },
    {
        "content": "<p>I was wondering if that was the right resource (or rather a composition, or an XML that has nothing to do with FHIR)</p>",
        "id": 161479229,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553285082
    },
    {
        "content": "<p>So, an IG with no definition, just dependsOn sections?  Is that valid?</p>",
        "id": 161479364,
        "sender_full_name": "David Pyke",
        "timestamp": 1553285209
    },
    {
        "content": "<p>still not sure what this achieves over simply a page built from a json object</p>",
        "id": 161480371,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553286044
    },
    {
        "content": "<p>It means that you can point the validator at the IG and an instance and it'll automatically have access to all of the profiles from the imported IGs.  A simple webpage doesn't mean anything to the validator</p>",
        "id": 161480837,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553286424
    },
    {
        "content": "<p>and that would be useful to the validator because?</p>",
        "id": 161481840,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553287229
    },
    {
        "content": "<p>I guess if this is for IHE Technical Frameworks, the validation would happen on the lower IGs (Profiles), not the container (TF) as a whole. Right <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ? <br>\n<span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> yes, (altough the term \"depends on\" seems strange in this context, but I guess it is ok)</p>",
        "id": 161482821,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553287948
    },
    {
        "content": "<p>i thought my choices to produce this \"collection of IGs\" were: <br>\na) a uber-IG? (my original question)<br>\nb) composition<br>\nc) whatever-other-format-xml/json<br>\nd) manually created html.. common but not my goal</p>",
        "id": 161483008,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553288112
    },
    {
        "content": "<p>so yes, i could generate it from a json.</p>\n<p>e) a package.json if sensible</p>",
        "id": 161483029,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553288135
    },
    {
        "content": "<p>I have a good example, but we (IHE) failed to address this at the ImplementationGuide, StructureDefinition, and CapabilityStatement. The example is the mXDE profile, which is a profile that simply orchistrates QEDm and MHD. The mXDE profile simply turns on an option that is defined in QEDm, and adds functionality that does not present as Interop requirements.   We didn't need to address the level of detail that Jose is thinking of, but it could certainly leverage it if we came up with the situation.</p>",
        "id": 161484715,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553289361
    },
    {
        "content": "<p>so that's just an IG with dependencies</p>",
        "id": 161485144,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553289674
    },
    {
        "content": "<p>yes, I think that is what Jose is expressing in ( a )</p>",
        "id": 161485177,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553289713
    },
    {
        "content": "<blockquote>\n<p>So, an IG with no definition, just dependsOn sections?  Is that valid?</p>\n</blockquote>\n<p>is this what that  kind of uber-IG is?</p>",
        "id": 161485259,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553289769
    },
    {
        "content": "<blockquote>\n<p>and that would be useful to the validator because?</p>\n</blockquote>\n<p>So that I can pass one IG into the validator and it can go find the rest instead of my needing to list all 6 of them when I want to validate an instance.</p>",
        "id": 161490285,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553294366
    },
    {
        "content": "<p>I'm not sure I understand that. when would you want to do that?</p>",
        "id": 161493143,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553296916
    },
    {
        "content": "<p>When I'm validating an instance against the comprehensive IG?</p>",
        "id": 161493435,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553297128
    },
    {
        "content": "<p>I don't know what that means. you validate against profiles</p>",
        "id": 161494077,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553297614
    },
    {
        "content": "<p>You validate against profiles, but you get the validator to load profiles by pointing to an IG.</p>",
        "id": 161494189,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553297694
    }
]