[
    {
        "content": "<p>since some of my  examples don't contain a code system, the validate-code operation fails,  since the binding is required, I don't really need a code system.  nor is it required in the profile.</p>\n<div class=\"codehilite\"><pre><span></span>AllergyIntolerance/example: AllergyIntolerance.clinicalStatus   error   None of the codes provided are in the value set http://hl7.org/fhir/ValueSet/allergyintolerance-clinical (http://hl7.org/fhir/ValueSet/allergyintolerance-clinical, and a code from this value set is required) (codes = null#active) (see Tx log)\nAllergyIntolerance/example: AllergyIntolerance.verificationStatus   error   None of the codes provided are in the value set http://hl7.org/fhir/ValueSet/allergyintolerance-verification (http://hl7.org/fhir/ValueSet/allergyintolerance-verification, and a code from this value set is required) (codes = null#confirmed) (see Tx log)\n</pre></div>\n\n\n<p>I think the validator should be using the required binding when the a) binding is required and b) no code system is provided in the coding.<br>\nI also think that PC did something making these elements codeable but that is a separate issue.</p>",
        "id": 162785241,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554691969
    },
    {
        "content": "<p>System can't be safely inferred.  It should always be present in examples.  It does not default, regardless of the binding.  The only time it should be absent is if it's legacy data where the sender has no clue what the system is.</p>",
        "id": 162786704,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554694505
    },
    {
        "content": "<p>it made no sense, what PC did to those elements, and I very much dislike it. I missed it until too late in R4 cycle to do anything about it. I will be focused on getting it fixed for R5.</p>",
        "id": 162886825,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554793927
    },
    {
        "content": "<p>in the mean time.... you must use the system</p>",
        "id": 162886829,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554793939
    }
]