[
    {
        "content": "<p>I'm getting the following error from the IG Publisher:<br>\njava.lang.Error: org.hl7.fhir.exceptions.FHIRException: fetching org.hl7.fhir.dstu3.model.StructureDefinition not done yet for URI '<a href=\"https://XXXXXXX\" target=\"_blank\" title=\"https://XXXXXXX\">https://XXXXXXX</a>'<br>\nAn implementation guide I am using in the IG Publisher has some externally defined extensions... However, I've added the domain of the extension to \"extension-domains\" in the ig.json control file... I figured that would solve the problem, but it hasn't. Any idea why not?</p>",
        "id": 153994407,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1536353251
    },
    {
        "content": "<p>extension-domains only stops the validator reporting issues in examples. you still need to define extensions if you refer to them in the definitions</p>",
        "id": 153994409,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536353401
    },
    {
        "content": "<p>ok. so, if it's an extension that has a different domain than the ig, where do I put it? I suspect that it wouldn't find it if I drop it in the resources/extension folder...</p>",
        "id": 153994414,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1536353897
    },
    {
        "content": "<p>actually... confirmed, it doesn't find it even though I dropped the extensions in the resources/extension folder</p>",
        "id": 153994415,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1536353916
    },
    {
        "content": "<p>Yah.. can't seem to get the ig publisher to recognize this extension no matter where I put it, or how I reference the domain. Further guidance is appreciated..</p>",
        "id": 153994448,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1536355196
    },
    {
        "content": "<p>I'll get to it. for now, I have to figure out how to keep the igpublisher going at all. turns out it was deeply tied to svn</p>",
        "id": 153994570,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536358644
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> do you have any idea about this? I know grahame's busy with other stuff... but this is blocking me a bit.<br>\nI'm just trying to build an IG with externally defined extensions. even though I include the extension definition in the resources/structuredefinition folder, it still isn't finding the extension...</p>",
        "id": 153995392,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1536601806
    },
    {
        "content": "<p>We see that error a lot but it doesn't actually interfere with the process. Is it not outputting correctly, or is it just reporting the error in the qa?</p>",
        "id": 153995402,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1536604691
    },
    {
        "content": "<p>Where are the extensions defined?  If they're not present in the version of FHIR you're building on, they need to be defined in an IG you have a dependency on.  If not, validation isn't going to work for them.  (It's possible the validator will try to resolve the canonical URL, but the version would have to be right.)</p>",
        "id": 153995492,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536608265
    },
    {
        "content": "<p>can I reproduce this <span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span> ?</p>",
        "id": 153995648,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536631270
    },
    {
        "content": "<p>not anymore... seems that in the last week of changes to the ig publisher, this error is not present anymore. attempting to run on latest ig publisher now, and getting completely different errors. I'll let you know if it comes back once I figure out the errors I'm running into now</p>",
        "id": 153995879,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1536694667
    }
]