[
    {
        "content": "<p>For those of you struggling to write an implementation guide using the 'Frameworks' Lloyd has set up this may help. I have a relatively simple guide containing only xml resources and markdown pages containing only text. Here are some instructions</p>\n<div class=\"codehilite\"><pre><span></span>&lt;!-- How to use Lloyd&#39;s Framework IG\nThe Frameworks directory is not touched (except for a single hardcoded error that may be fixed in the future).\nYou may want to rename the *.bat files appropriate for your IG, this example has &#39;Phd&#39; all over the place.\nThe source-generated directory is built by the _PhdUpdatePublisher.bat file. It must be generated before being used in the continuous integration build\nOne can safely delete the source-generated directory and run _PhdUpdatePublisher.bat to rebuild it.\nYou will need to modify the ig.json file to point to your ImplementationGuide.xml file which is in the src directory\nIn this example the name of the ImplementationGuide is &#39;PhdImplementationGuide.xml&#39;.\nSo in the end all your work is in the src directory.\nThe resources are placed in the src/resources directory\nThe Value Sets can be placed in src/vocabulary directory (have not tried this) but putting them in the resources directory is also okay\nThe pages are placed in the src/pagecontent directory\nThe menu items that occur across the header in the published guide is in the src/includes directory in the menu.xml file.\nThese directory names are fixed. (There might be a special directory name for Code Systems but I do not know.)\nYou need a &#39;jurisdiction&#39; element or it will not build. Not sure how it is used or why it is required. It is not required by FHIR.\nResources:\nThe names of the files must follow a certain structure. There are certain options. Here is one that works\n    1. For structure definitions *.structuredefinition.xml where &#39;*&#39; is your choice (no spaces). Make sure the &#39;id&#39; and &#39;name&#39; values are the same as &#39;*&#39;\n       For example I have PhdNumericObservation.structuredefinition.xml with &lt;id value=&quot;PhdNumericObservation&quot; /&gt; and &lt;name value=&quot;PhdNumericObservation&quot; /&gt;\n    2. For value sets *.valueset.xml where &#39;*&#39; is your choice (no spaces). Make sure the &#39;id&#39; and &#39;name&#39; values are the same as &#39;*&#39;\n    3. For code systems *.codesystem.xml where &#39;*&#39; is your choice (no spaces). Make sure the &#39;id&#39; and &#39;name&#39; values are the same as &#39;*&#39;\n    4. These resources will not be listed by the Artifacts page unless one specifies a &#39;package&#39; under the &#39;definition&#39; element and then references\n       it in each resource.\nFor md (markdown) pages (the only pages I know how to do)\n    1. No spaces in the name\n    2. No YAML headers to cause the publisher to convert them to html\n    3. No Jekyll liquid syntax to link to other pages.\n    4. All references to your pages are &#39;pageName.html&#39; even though they are written in md.\n    5. Don&#39;t put a title in your md file as it is taken from the &#39;title&#39; tag in the &lt;page&gt; entry of this file, for example\n        &lt;title value=&quot;Technical Implementation Guidance&quot;/&gt;. If you do you will have two titles.\nIn your structure definition the first page SHALL be toc.html. This page is auto generated, you do not need to create it\n    Under this page every page you want included in the table of contents will appear as a sub page.\nThe next primary page is &#39;artifacts.html&#39;. This is auto-generated. You need no sub-pages. This topic will cause a list of all your resources to appear\nwhen you click on the &#39;Artifacts Index&#39; header in the published guide. Be sure to include that name in the &#39;menu.xml&#39; file in the includes directory\nalong with the &#39;Table of Contents&#39; entry.\nThe other entries are up to you BUT there is a catch. When putting in your pages in the ImplementationGuide the &lt;nameUrl value=&quot;pageName.html&quot;/&gt;\neven though the file names are &#39;pageName.md&#39;. But the &lt;generation value=&quot;markdown&quot; /&gt;.\n\nFound more requirements\nNeed to have a src/examples directory (empty or not)\nNeed to have a src/images directory (empty or not)\n!! If you get the warning that the tools.jar can&#39;t be found in said location copy the tools.jar file  to the said location. It is located in the JDK_8.0_181\\lib directory !! I don&#39;t understand this error. Same set up on two Windows 10 computers and one wants the tools.jar in the jre1_* directory.\n\nIn this example there are only xml structure definitions, value sets, code systems, and markdown pages that are all text. --&gt;\n</pre></div>\n\n\n<p>As soon as I get a home for this guide on the HL7 github I will upload the example. I still have one unresolved error when building (still builds a viewable guide) and that has to do with certain elements not making a snapshot. Working on it.</p>",
        "id": 154006648,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1538997123
    }
]