[
    {
        "content": "<p>The latest version of the IG publisher offers this not so helpful bit of advice. \"Note that this IG is good for your local use but is not suitable for use as a final publication (consult Confluence for publishing advice if you are actually building with intent to publish)\". Can someone point me SPECIFICALLY where on Confluence I can find such publishing advice? I have looked here but can't figure out what my build is missing: <a href=\"https://confluence.hl7.org/display/FHIR/IG+Publisher+Documentation\">https://confluence.hl7.org/display/FHIR/IG+Publisher+Documentation</a>.</p>",
        "id": 214587763,
        "sender_full_name": "Becky Angeles",
        "timestamp": 1603725776
    },
    {
        "content": "<p>The point of this unfortunate \"advice\" is that if you wanted to take your output and put it on a website that it might be broken if there are dependencies to other guides you have built on your local system.</p>",
        "id": 214588236,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1603725995
    },
    {
        "content": "<p>There is nothing that you need to do if this is an IGuide that will be published on the HL7 build site by the HL7 CI build system</p>",
        "id": 214588343,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1603726041
    },
    {
        "content": "<p>See this thread:  <a href=\"#narrow/stream/179252-IG-creation/topic/Local.20use.20vs.2E.20final.20publication\">https://chat.fhir.org/#narrow/stream/179252-IG-creation/topic/Local.20use.20vs.2E.20final.20publication</a></p>",
        "id": 214588609,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1603726154
    },
    {
        "content": "<p>And the final steps for publication are at <a href=\"https://confluence.hl7.org/display/FHIR/Process+for+Publishing+a+FHIR+IG\">https://confluence.hl7.org/display/FHIR/Process+for+Publishing+a+FHIR+IG</a>.</p>",
        "id": 214588818,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1603726234
    },
    {
        "content": "<p>We <em>really</em> need to fix this message to be clearer - and to provide an explicit link.</p>",
        "id": 214589530,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603726542
    },
    {
        "content": "<p>How about \"This IG has been built with references between resources using local file paths. Online publication should use http urls instead, see...\"?</p>",
        "id": 214592067,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1603727417
    },
    {
        "content": "<p>can't we just remove this message?  it's confusing and, from what i understand, it's trying to warn about a very edge case.  Even Elliot's statement is different from what Grahame told me.  The problem occurs if you are building multiple IGs on your local machine and those IGs have dependencies between them.  If you blindly take the output of all your locally built IGs and publish those on the web, the dependencies will be broken.</p>",
        "id": 214594050,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1603728175
    },
    {
        "content": "<p>\"This IG has been built using the 'normal' process for local use.  If building to host on an an external website, use the process documented here: ...\"</p>",
        "id": 214595938,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603728967
    },
    {
        "content": "<p>We can't remove it because people need to know there's an extra step if they want to host on a website.  (When they don't know that, they host and it blows up and they then bug Grahame.)</p>",
        "id": 214596034,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603729012
    }
]