[
    {
        "content": "<p>I am getting a number of issues identified in the HTA report (<a href=\"https://build.fhir.org/ig/HL7/carin-bb/branches/v1.0.9/qa-hta.html\">https://build.fhir.org/ig/HL7/carin-bb/branches/v1.0.9/qa-hta.html</a>). It is complaining about the copyright. These ValueSets largely include multiple code systems and we have rolled up the copyright notice into the Valueset copyright.<br>\nIs this going to be an issue for publishing? We are trying to open a peer review for an STU Update this Friday.</p>",
        "id": 235396084,
        "sender_full_name": "Corey Spears",
        "timestamp": 1618944930
    },
    {
        "content": "<p>You must include specific verbiage for each code system in the copyright for the value set.  There's pre-approved verbiage for LOINC, SNOMED, CPT, etc.  You must include that text with no deviations.</p>",
        "id": 235401710,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618947139
    },
    {
        "content": "<p>FMG won't let you publish until addressed</p>",
        "id": 235402164,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618947319
    },
    {
        "content": "<p>OK, but these are valueSets that include multiple codeSystems with their own copyrights.  None of the individual codeSystem copyrights are showing an error.  How can I express more than one copyright for a valueset?</p>",
        "id": 235406099,
        "sender_full_name": "Corey Spears",
        "timestamp": 1618948968
    },
    {
        "content": "<p>you put the exact text for each code system that is included in the value set in the ValueSet.copyright.  Here's an example of one of my value sets with CPT and X12 codes:</p>\n<ul>\n<li>^copyright = \"Current Procedural Terminology (CPT) is copyright 2020 American Medical Association. All rights reserved.<br>\nX12 codes are listed within an X12 implementation guide (TR3) and maintained by X12. All X12 work products are copyrighted. See their website for licensing terms and conditions.\"</li>\n</ul>",
        "id": 235406541,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1618949162
    },
    {
        "content": "<p>OK. Perhaps there is a behind the scenes markdown issue (e.g. html link vs markdown link). <br>\nFor verification, what is the right source for these copyrights? I was told to use the IP Information and Licensing Information from pages like this: <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=97453705\">https://confluence.hl7.org/pages/viewpage.action?pageId=97453705</a><br>\nYour example on CPT is significantly different than mine and that is found on this page.</p>",
        "id": 235411898,
        "sender_full_name": "Corey Spears",
        "timestamp": 1618951466
    },
    {
        "content": "<p>probably ask this on <a class=\"stream\" data-stream-id=\"179202\" href=\"/#narrow/stream/179202-terminology\">#terminology</a>. but FMG won't quibble about the fine details - the HTA check is still a work in progress. As long as you have some copyright statement that covers the base, that will be acceptable. It's aimed at catching IGs that haven't tried</p>",
        "id": 235416159,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618952801
    },
    {
        "content": "<p>the QA will tell you the exact license text you need</p>",
        "id": 235419928,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1618954214
    },
    {
        "content": "<p>in your QA errors, the only copyright you need to add are the value sets that include CPT and it needs the text in the \"Expected Copyright\" box (which matches what I have)</p>",
        "id": 235420047,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1618954285
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> You have it correct as defined on the HTA page for that code system. This is definitely a work in progress to get all the gears turning at the same speed. <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> If possible, per our agreements curated by HTA, can you conform to the text found at <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=97453705\">Current Procedural Terminology (CPT)</a> that says \"CPT © Copyright 2019 American Medical Association. All rights reserved. AMA and CPT are registered trademarks of the American Medical Association.\"</p>",
        "id": 235431848,
        "sender_full_name": "Robert McClure",
        "timestamp": 1618961452
    },
    {
        "content": "<p>No.  That is from an already published guide.  If you want those changed, you’ll need to get the build validation changed because all ig developers are following what the Qa spits out.</p>",
        "id": 235443391,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1618970613
    },
    {
        "content": "<p>After further review I understand the HTA external terminology pages a little more. I thought all of the information contained in the IP and licensing info was meant to be put in the copyright information, but it turns out those are the terms of use which does include copyright language.  It would be nice if there was a row only for what is required to be in the copyright so it would clearly pointed out. I was able to resolve all of those issues where a copyright was included on the page. That being said, what should appear for ICD9 and ICD10? It is not clear on the HTA confluence page and I am getting an hta qa issue stating that <em>(copyright expectations unknown)</em>.</p>\n<p>US Core uses \"ICD-9 and ICD-10 are copyrighted by the World Health Organization (WHO) which owns and publishes the classification. See <a href=\"https://www.who.int/classifications/icd/en\">https://www.who.int/classifications/icd/en</a>. WHO has authorized the development of an adaptation of ICD-9 and ICD-10 to ICD-9-CM to ICD-10-CM for use in the United States for U.S. government purposes.\"<br>\nShould I just use that?</p>",
        "id": 235535120,
        "sender_full_name": "Corey Spears",
        "timestamp": 1619020271
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 235535882,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619020577
    },
    {
        "content": "<p>at this point, nothing is expected.  You can put whatever because the publisher is not requiring anything.</p>",
        "id": 235541798,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1619022861
    },
    {
        "content": "<p>Clearly this is all not set and clear. <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span>  Note the value of a slot in the template that is <em>just the text to be included</em>  when using the code system. <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>  - no expectation of changing published material that I am aware of. <span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> Sure, use what US Core has for now. I assume they found that someplace or just made it up. Something is better than nothing.</p>",
        "id": 235560797,
        "sender_full_name": "Robert McClure",
        "timestamp": 1619030541
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span>  and <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  That copyright statement from US Core does not appear correct to me as (I assume) US Core is using ICD9CM and ICD10CM, the US based clinical modifications of the WHO ICD9 and ICD10. Thus the copyright statements you have in that HTA error message are consistent with what HTA has recommended as it describes NCHS's (who authors and publishes ICD9CM and ICD10CM into the public domain) policy.</p>",
        "id": 235562209,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1619031182
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> , Can you point me to the exact wording I should use for the copyright as the HTA qa report seems unclear?</p>",
        "id": 235565108,
        "sender_full_name": "Corey Spears",
        "timestamp": 1619032272
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> to get past the IG Publisher's QA Report, you don't need anything for ICD.  It's not enforcing any language because it doesn't know what language to enforce at this time.  Your 3 errors are solely to do with the CPT-4 language it is expecting.</p>",
        "id": 235565438,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1619032423
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> , I solved the issues locally and will update soon, but I just wanted to make sure I get all issues addressed. Would it be better to remove all copyright statements then instead of adopting the US Core language? The HTA QA Report does not indicate any issues, just that the expectations for ICD9/10 are unknown. Sorry to be a pain, just want the i's dotted.</p>",
        "id": 235566966,
        "sender_full_name": "Corey Spears",
        "timestamp": 1619033055
    },
    {
        "content": "<p>Ah, now I understand what you're asking.  I haven't included any copyright statements for ICD9/10 because I was waiting for what it should be.  When I read what is on the HTA site, it doesn't really give me concrete guidance of what to put.  The statement that US-Core has seems in line with what the HTA pages say, so if you wanted to put something, that would seem appropriate, except that <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> said it wasn't.</p>",
        "id": 235571021,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1619034833
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> note this language at the top of the HTA page:</p>\n<blockquote>\n<p>The content of this page is being developed with the HTA committee, and is subject to further change. Editors are welcome to use this page to pick up errors in their definitions, but should not regard the analysis as final.</p>\n</blockquote>",
        "id": 235577007,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1619037430
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  can you point me to the page with that verbiage. I have a feeling that it is either in reference to the format changes we are making in anticipation of migrating the information to THO...or it warrants an update.</p>",
        "id": 235590570,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1619043121
    },
    {
        "content": "<p>it's hard coded in the IG publisher at the moment - a note to editors that the page is still under development</p>",
        "id": 235591542,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1619043727
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , This is fine, but it is hard to parse what will and what won't be a problem when all is otherwise done and one thinks they are ready to publish. There is still some tribal knowledge in the whole process, particularly around an STU Update.</p>",
        "id": 235673240,
        "sender_full_name": "Corey Spears",
        "timestamp": 1619096874
    },
    {
        "content": "<p>that's certainly true. We're working on it</p>",
        "id": 235727993,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1619116899
    }
]