[
    {
        "content": "<p>The IG publisher creates some fantastic renderings of StructureDefinition today... I would like if an additional rendering of the ShortHand could be added. I am finding that 'some' people can grasp shorthand easier than the graphical rendering (some prefer the graphical, especially those that like the additional features that form includes). Yes there will be loss of fidelity, but the graphic rendering we have today somewhat looses fidelity.</p>",
        "id": 188645252,
        "sender_full_name": "John Moehrke",
        "timestamp": 1582211018
    },
    {
        "content": "<p>I think there are two possible approaches to this.  One is that IGs produced using Shorthand could publish the source Shorthand in a separate tab.  There's <em>some</em> work to make that happen, but it's certainly doable.</p>\n<p>The second approach would take any conformance resource (SD, VS, CS) and translate it to a Shorthand representation.  This would allow the Shorthand view for IGs not developed using Shorthand.  But it's more complex because it requires what we've been calling \"Hatchery\" -- a tool for translating arbitrary conformance resources to Shorthand.  <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> did a quick proof-of-concept for this translation at the Connectathon, but I expect a fully working solution will take some time.</p>",
        "id": 188646360,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582211757
    },
    {
        "content": "<p>I absolutely expect this is something we'll have - the question is \"when does it make sense to invest the effort?\"  Shorthand is super new and thus (I presume) at least somewhat unstable.  Once we've got something that's balloted (which will also give us a stable version of documentation we can point to), I'd be very much in favor of the publisher both being able to consume shorthand and being able to generate a rendered view of shorthand as one of the views of most (and perhaps all) resources.</p>",
        "id": 188651994,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582215046
    },
    {
        "content": "<p>Maturity is indeed a consideration, but I would be more worried about maturity if the IG publisher it-self was already stable. Since the graphic rendering keeps changing, then there should be no reason not to include shorthand...  But I am willing to wait for more stability.. I simply wanted to get the idea flowing.</p>",
        "id": 188654324,
        "sender_full_name": "John Moehrke",
        "timestamp": 1582216760
    },
    {
        "content": "<p>Including the source shorthand is nice as it can include comments that an automatic translation can't invent... but the source shorthand will have stylistic differences that might be undesirable. -- might want to include in the NPM package the source, but might want the rendering to be consistently done by the IG publisher</p>",
        "id": 188654489,
        "sender_full_name": "John Moehrke",
        "timestamp": 1582216884
    },
    {
        "content": "<p>Note for those new to the terms... ShortHand is otherwise know as SUSHI, FSH, etc... <a href=\"https://github.com/FHIR/sushi\" target=\"_blank\" title=\"https://github.com/FHIR/sushi\">https://github.com/FHIR/sushi</a></p>",
        "id": 188657407,
        "sender_full_name": "John Moehrke",
        "timestamp": 1582218958
    },
    {
        "content": "<p>Shorthand itself (the language) is still being designed for a few important aspects, I expect it to evolve a bit too. The graphic rendering of the IG is handled  in great part by the templates, which are not static - they will evolve. So that is not the same thing - maturity vs \"stability\"</p>",
        "id": 188665145,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1582224084
    },
    {
        "content": "<p>I think an important milestone is when we can convert from a FHIR resource to FSH.</p>",
        "id": 188665248,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1582224144
    },
    {
        "content": "<p>so some comments:</p>\n<ul>\n<li>there's not a 1:1 relationship between shorthand source and resource. So I can't just 'add another tab'</li>\n<li>I can generate shorthand, but there is challenges there, since really good shorthand is insightful about meaning in a way code can't be</li>\n<li>I'm intending to extend the IG publisher so it natively imports short hand, rather than needing a pre-processing tool, though I'm not sure I'll do that</li>\n</ul>",
        "id": 188673558,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582229774
    },
    {
        "content": "<p>having said all that, I would like to add a short hand representation to the IG publisher</p>",
        "id": 188673636,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582229843
    },
    {
        "content": "<p>I agree that shorthand offers authoring capabilities in terms of ordering, whitespace, etc. that you can't replicate through generation.  But for artifacts not authored in shorthand, it's better than nothing.  The fact that one shorthand file can define numerous artifacts would be handled by splitting up the shorthand file to define the relevant bits - though things like defined URLs would presumably need to get copied into each file.</p>",
        "id": 188679349,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582233666
    },
    {
        "content": "<p>FYI, ended up calling it fshfood vs. hatchery, but here is my first cut:<br>\n<a href=\"https://github.com/lantanagroup/fshfood\" target=\"_blank\" title=\"https://github.com/lantanagroup/fshfood\">https://github.com/lantanagroup/fshfood</a></p>",
        "id": 189255905,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1582836949
    },
    {
        "content": "<p>Currently only works with StructureDefinition resources that have a snapshot</p>",
        "id": 189256042,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1582837031
    },
    {
        "content": "<p>But Shorthand is going to address that issue by allowing one-sided cardinality when the differential only has a max or a min (e.g.,  ..1 or 1..). One our hot fix list right now.</p>",
        "id": 189266462,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1582844162
    }
]