[
    {
        "content": "<p>As <span class=\"user-mention\" data-user-id=\"191991\">@Gay Dolin</span>  <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> and I triage US Core requirements we are seeing some pushback to the search requirements defined in the Guide.   I think of most IGs as a bunch of documentation to use a bunch of FHIR Artifacts ( structures ) and a set of interactions to meet a particular use case like patient/provider access.  However when reusing arrtifacts from another guide, I think that they are separable . In other words, you don't have to state conformance to the whole IG in the CapabilityStatement ( and dragging along the set of interaction declared in it )  but can pick or choose a structure or two.  For example I use SDC Questionnaire in the Argonaut patient list extension as target to an extension, but I don't have any expectation that the SDC guide be supported.</p>\n<p>We have formulated these three level of reuse to help frame our discussions and would like some feedback here:</p>\n<ol>\n<li>\n<p>Conform/reuse  profile</p>\n<ul>\n<li>Only asserting to requirements in the StructuredDefinition</li>\n</ul>\n</li>\n<li>\n<p>Conform to guide</p>\n<ul>\n<li>asserting to requirements in the StructuredDefinition</li>\n<li>following the interactions noted in the CapabilityStatement </li>\n</ul>\n</li>\n<li>\n<p>Certification (ONC Reg)</p>\n<ul>\n<li>Conform to the guide</li>\n<li>Whatever else ONC requires.</li>\n</ul>\n</li>\n</ol>",
        "id": 224822416,
        "sender_full_name": "Eric Haas",
        "timestamp": 1612234086
    },
    {
        "content": "<p>also this interesting chat:  <a href=\"#narrow/stream/179250-bulk-data/topic/.24export.20with.20launch.2FPatient\">https://chat.fhir.org/#narrow/stream/179250-bulk-data/topic/.24export.20with.20launch.2FPatient</a></p>",
        "id": 224822553,
        "sender_full_name": "Eric Haas",
        "timestamp": 1612234293
    },
    {
        "content": "<p>That separability isn't clear in the way US Core documents things.  Putting the search parameters on the profile makes it seem that they're tied, when in practice they're not.</p>",
        "id": 224889044,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612280782
    }
]