[
    {
        "content": "<p>I'm starting to work on wrapping up the ExampleScenario editor and IG editor (is any of these more urgent?).  I would appreciate input on functionality:</p>",
        "id": 154490149,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1546728081
    },
    {
        "content": "<p>(sorry if this is wrong thread, not sure I should put it here or tooling)<br>\nFor the IG editor, I have a \"template\" that separates the \"content\" folder from the \"publisher\" folder - this allows me to work on 5 IGs  without having 5 times the IG Publisher. That works well, and now I want to see how an editor would get the entire content of my IG - the pages, the images, the resources,... everything they need to get working.</p>\n<p>What would be the best .?<br>\n1- get a package that contains the entire \"content\" folder and work from there?<br>\n2- pull the folder from git/svn/...<br>\n3- anything else like just downloading a zip?...</p>\n<p>I started with option 3 just to get it working, then I learned that we will need git anyway, and now that I am trying to make it consistent for the user, I am thinking perhaps 1 + 2 are better...</p>",
        "id": 154490323,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1546728439
    },
    {
        "content": "<p>I currently already do this with one project.  Your ImplementationGuide  points to the specific resources and pages it wants.  It's perfectly possible for IGs to share content, though in general that's a bad idea for resources - those should generally only exist in a single IG.</p>",
        "id": 154492103,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546732144
    },
    {
        "content": "<p>Where we currently have a challenge is that the integration with the CI build environment requires there to be only one IG for a given IG project.  We might be able to find a work-around for that though.</p>",
        "id": 154492163,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546732317
    }
]