[
    {
        "content": "<p>There must be a better way to present a profile than this:  <a href=\"https://lightmyfhir.org/2019/09/09/fhir-implementation-guide-presentation/\" target=\"_blank\" title=\"https://lightmyfhir.org/2019/09/09/fhir-implementation-guide-presentation/\">https://lightmyfhir.org/2019/09/09/fhir-implementation-guide-presentation/</a><br>\nSome food for thought going into our IG discussions later this week.</p>",
        "id": 175281340,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1568061851
    },
    {
        "content": "<p>that does look sensationally awful. My first question was, what does the differential look like, and I think that you did yourself a disservice by asking \"Can you summarize the purpose of this profile\" without showing the differential</p>",
        "id": 175284645,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568064401
    },
    {
        "content": "<p>and you didn't even provide a link....</p>",
        "id": 175284744,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568064475
    },
    {
        "content": "<p>Differential looks like <a href=\"/user_uploads/10155/fV2MEZqYMiYhpX_EurwGGTI8/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">this</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/fV2MEZqYMiYhpX_EurwGGTI8/pasted_image.png\" target=\"_blank\" title=\"this\"><img src=\"/user_uploads/10155/fV2MEZqYMiYhpX_EurwGGTI8/pasted_image.png\"></a></div><p>From <a href=\"http://hl7.org/fhir/us/breast-radiology/2019Sep/StructureDefinition-breastrad-BreastAbnormality.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/breast-radiology/2019Sep/StructureDefinition-breastrad-BreastAbnormality.html\">http://hl7.org/fhir/us/breast-radiology/2019Sep/StructureDefinition-breastrad-BreastAbnormality.html</a></p>",
        "id": 175285192,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568064766
    },
    {
        "content": "<p>well... it's better. Not great. We can certainly search for ideas to improve that</p>",
        "id": 175294726,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568074030
    },
    {
        "content": "<p>I added the link to the post, thanks for catching that.</p>",
        "id": 175300164,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1568081128
    },
    {
        "content": "<p>Well, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , this issue got me a bit inspired, and together with <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>, we put together a proposal on something that might be useful in this context. We would like to get your feedback on this idea. <a href=\"/user_uploads/10155/8izaFtFckohCQBV9d-ZdK29i/FHIR-Profiling-Language-draft-v1.docx\" target=\"_blank\" title=\"FHIR-Profiling-Language-draft-v1.docx\">FHIR-Profiling-Language-draft-v1.docx</a></p>",
        "id": 175363591,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1568139193
    },
    {
        "content": "<p>starting by criticising excel will get me on board ;-)</p>",
        "id": 175371725,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568144682
    },
    {
        "content": "<p>we've kind of toyed with this idea on and off. I could certainly build support for something like this straight into the IG publisher - for me, it would be a text format like the one we defined for structure map (and I would argue it should be similar and consistent where they overlap).</p>",
        "id": 175371787,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568144748
    },
    {
        "content": "<p>but.... there's a problem, which is that if you look at real world profiles, taken from actual IGs, the documentation details make a mess of the simplicity of the format. It turns ugly. And I firmly believe that documentation is important. So I think it would be good to extend this with some real world documentation</p>",
        "id": 175371911,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568144840
    },
    {
        "content": "<blockquote>\n<p>\"5.   Many years of experience has proven that creating and maintaining complex software projects is best approached with textual languages. As a DSL designed for the job of profiling, FPL is concise, understandable, and aligned to user intentions.\"</p>\n</blockquote>\n<p>That I certainly agree with</p>",
        "id": 175372010,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568144911
    },
    {
        "content": "<p>but, let's take value sets.... the value set text format is going to collapse to some YAML variant of a value set. Nicola has long argued that we should use YAML for this. And why doesn't the same apply for StructureDefinitions? what higher level language could be defined that doesn't break down in the presence of messy documentation and real world mixed constraints from actual cases?</p>",
        "id": 175372194,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568145100
    },
    {
        "content": "<p>maybe there's some, so I'm interested...</p>",
        "id": 175372200,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568145108
    },
    {
        "content": "<p>btw, with regard to the original, I had some specific questions I haven't had time to pursue yet. </p>\n<ul>\n<li>why are these component observations, not independent observations - is that a right design (or just  hack)</li>\n<li>if they are not really components, then this comes back to: how to visualise graphs of observations (already an open issue for me)</li>\n<li>if they aren't.... is it time to get to breaking up the reprsentation of a large profile into chunks to make it more manageable for consumers of the documentation?</li>\n</ul>",
        "id": 175372366,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568145238
    },
    {
        "content": "<p>one more comment. One proposed benefit:</p>\n<blockquote>\n<p>• Provides meaningful differentials</p>\n</blockquote>\n<p>But my experience here looking at the IGs that we have: the more pre-processing before the differential, the less meaningful your differential (the IGs you guys produce through thins like CIMPL tend to jam all sorts of non-essential things into the differential), where as shallow design processes are more sparing. I don't see why introducing a new text representation would change that (though it depends how much this is about <em>language</em> as opposed to syntax)</p>",
        "id": 175372648,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568145395
    },
    {
        "content": "<p>is the proposal to use this natively and drive the publisher or it just a language to create these artifacts that will drive the publisher, and why  couldn't it be YAML ?  ( I'm on the YML bandwagon too since Python is all about indents :-) )</p>",
        "id": 175377053,
        "sender_full_name": "Eric Haas",
        "timestamp": 1568148567
    },
    {
        "content": "<p>i would take it as a possible input to the publisher. certainly we have a running thread for a text format like this. The suggested format has some value add over a straight YAML format, but it's not clear to me that what will survive the iteration process will be a big deal difference</p>",
        "id": 175383334,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568153613
    },
    {
        "content": "<p>Agreed, Excel is a catastrophe  ;-)<br>\nNow that we've agreed that, we can discuss the best form for FPL. One keenly important aspect, as the leader of multiple profiling projects, is that it must be readable and understandable for everyone across the FHIR community, not just the most technically skilled folks. The second thing is that is should be fast to build and revise. We went through literally 100's of revisions on the way to mCODE, and I'm convinced we never would have made it without very agile profiling tools.  <br>\nAnother place we agree is that we should use existing piece-parts. There's no sense inventing new things if existing things are meet the design criteria.<br>\nOn the \"provides meaningful diffs\" comment, what I was trying to say is that two versions of the FPL could be compared to each other,.meaningfully. Comparing FPL across versions reveals exactly what was changed in the profiles. I wasn't saying diff the resulting SDs. <br>\nAs far as the example profile that drove this conversation, I can't answer for it. It isn't mine. This discussion came about because I got frustrated trying to review it for the ballot, and couldn't make heads or tails of it.<br>\nI'll defer comments on YAML or Structure Map for a later date.</p>",
        "id": 175386658,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1568156675
    },
    {
        "content": "<p>sure I'll wait on that. Slicing matters too....</p>",
        "id": 175386870,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568156938
    },
    {
        "content": "<p>Excel for IG authoring (and publication) is useful in several ways:<br>\n- there are times when a columnar view of what you're editing (including the ability to quickly and arbitrarily filter the rows) is extremely helpful in the authoring process.<br>\n- The excel column headings give you prompts for what needs to exist and a visual overview of what's going on that a text format doesn't<br>\n- from a publication perspective, most people know how to use Excel and can easily use it to create filtered views, add notes, document mappings, etc.</p>",
        "id": 175389448,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568159762
    },
    {
        "content": "<p>I don't think we have agreed to anything  yet .  I think excel is an excellent UI and easier to manipulate than text file and familar and accessible by 90% of the population, but also agree is not good for collaboration and repos.     My biggest concern is that a  new text based language  that you have to learn will be a barrier to adoption.</p>",
        "id": 175389490,
        "sender_full_name": "Eric Haas",
        "timestamp": 1568159805
    },
    {
        "content": "<p>Lloyd beat me to it  :-)</p>",
        "id": 175389510,
        "sender_full_name": "Eric Haas",
        "timestamp": 1568159839
    },
    {
        "content": "<p>I'm not arguing that Excel is a desirable <em>persistence</em> format - it's horrible for that.  Nor am I arguing that Excel should be the only or even preferred tool for authoring profiles, just that it should be available.  My personal desire is to have an ability to easily do a save-as/load from Excel such that the persistence layer can be regular XML/JSON (the same as all of our other editing tools)</p>",
        "id": 175389577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568159887
    },
    {
        "content": "<p>feel free to write an import macro....</p>",
        "id": 175400847,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568176990
    },
    {
        "content": "<p>but the workflow around saving is horrible. Excel should die</p>",
        "id": 175400848,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568177003
    },
    {
        "content": "<p>It can die when we have other tools that offer equivalent functionality (and also run the latest &amp; greatest version of FHIR and are responsive enough to add new support for new StructureDefinition extensions in a timely manner)</p>",
        "id": 175426683,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568205616
    },
    {
        "content": "<p>The import  thingy is on my wish list - but pretty far down  there</p>",
        "id": 175435610,
        "sender_full_name": "Eric Haas",
        "timestamp": 1568211022
    },
    {
        "content": "<p>It's high on my wish list.  But it's a long ways down my priority list :)</p>",
        "id": 175435801,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568211152
    },
    {
        "content": "<p>The discussion isn't whether Excel should die. It will continue to live on because it has some usefulness to some users. The idea of FPL is to provide something very concise and readable that scales over large projects. I believe that FPL will be easy to learn, and turn out to be _one_ of the preferred ways to approach profiling. <br>\nOur experience with CIMPL has been that we often run the CIMPL complier without running the IG publisher, because it checks all sorts of things about the syntactic and logical consistency of the specification, in a few seconds. Once the model is sound, we may run the IG publisher if we want to see how the final output will look. But often, we just keep going and building profiles without running the IG publisher.  I suggest these steps should be separate.</p>",
        "id": 175443221,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1568215439
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> I agree these two steps should be separate - i.e., but regression testing is important, so I think most times I want to see the output for a particular FHIR profile (or set of profiles) and related extensions and value set,  without having to generate the entire IG. I think the fact that we have to drag the entire IG to see the output for a single profile is the reason why we don't run the IG publisher everytime; it's just too cumbersome. But I guess that's a different requirement entirely :)</p>",
        "id": 175475222,
        "sender_full_name": "Rute Martins",
        "timestamp": 1568235344
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  I would like to offer a PSS to the FMG on this topic. Would you be agreeable to that discussion?</p>",
        "id": 175541179,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1568302695
    },
    {
        "content": "<p>it seems premature to jump to that step right now</p>",
        "id": 175541437,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568302880
    },
    {
        "content": "<p>What kind of collateral would be needed to make case that FPL is ready to become a project?</p>",
        "id": 175541626,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1568302996
    },
    {
        "content": "<p>I think FHIR-I would need to own it, so you'd need to get some sense that FHIR-I would have consensus that this was worth while. I certainly haven't seen any sense of that.</p>",
        "id": 175541780,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568303098
    },
    {
        "content": "<p>Perfect, thanks. FHIR-I....</p>",
        "id": 175541853,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1568303155
    },
    {
        "content": "<p>You'll have support from me :)</p>",
        "id": 175543957,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568304561
    },
    {
        "content": "<p>well, I'm yet to be convinced that this is anything better than a YAML format for the resources we have</p>",
        "id": 175544067,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568304642
    },
    {
        "content": "<p>You mean, like hand authoring StructureDefinitions in YAML?</p>",
        "id": 175545816,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568305812
    },
    {
        "content": "<p>That'd be approximately no different than hand authoring them in JSON.</p>",
        "id": 175545874,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568305844
    },
    {
        "content": "<p>yes. What would \"FPL\" offer as an advantage over that?</p>",
        "id": 175545875,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568305844
    },
    {
        "content": "<p>well, json is tricky stupid with commas but you could go to loose json, yes</p>",
        "id": 175545902,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568305864
    },
    {
        "content": "<p>If it didn't offer an advantage, it'd be a pretty poor DSL.</p>",
        "id": 175545907,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568305865
    },
    {
        "content": "<p>which is how I do my authoring</p>",
        "id": 175545923,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568305873
    },
    {
        "content": "<p>well, what advantage can it offer? So far, I see 3 apparent advantages</p>\n<ul>\n<li>it's simpler - because it omits actual real requirements (oops)</li>\n<li>it allows you to define common canonicals (nice, but not the only way)</li>\n<li>it groups a set of related things into a single file (nice, but that big a deal?)</li>\n</ul>",
        "id": 175546049,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568305946
    },
    {
        "content": "<p>I'm open to learning that I'm wrong....</p>",
        "id": 175546065,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568305961
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191782\">@Brian Kaney</span></p>",
        "id": 175547525,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1568306943
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  I do agree with your statements about YAML and I have fairly extensive experience with YAML (I can generate the entire V3 Vocabulary into YAML files). I don't think writing in YAML provides large advantages over writing in JSON. And likely if you could hand code the YAML, you are adept enough to write a YAML-&gt;JSON converter (if not contact me and we can come to an arrangement)</p>",
        "id": 175548986,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1568307903
    },
    {
        "content": "<p>can FPL be imported to and exported from spreadsheet format too  :-)</p>",
        "id": 175550465,
        "sender_full_name": "Eric Haas",
        "timestamp": 1568308843
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> -- sure!  It's just a matter of writing some code. ;-)  But seriously, we talked about translating SD to FPL, so I suspect it could also go for Excel.  The question is how to prioritize all this stuff.  (And determining what is the subset of SD that is supported; it might be difficult to translate every possible amalgamation of SD into FPL -- but if Excel spreadsheets are a little more constrained, that might actually be <em>easier</em>).</p>",
        "id": 175551034,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1568309236
    },
    {
        "content": "<p>please no can spreadsheet tails not wag the dog</p>",
        "id": 175551084,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568309272
    },
    {
        "content": "<p>Spreadsheets can (in principle) be converted to and from any format.  The question is why we need to introduce <em>another</em> format.</p>",
        "id": 175555837,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568312283
    },
    {
        "content": "<p>Because a DSL could be very useful. Right now, spreadsheets are the only format outside of editing the SD itself (Forge and Trifolia are essentially SD editors). A DSL is 10x more productive.</p>",
        "id": 175577932,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1568328071
    },
    {
        "content": "<p>You can edit in JSON</p>",
        "id": 175578249,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568328461
    },
    {
        "content": "<p>So the question is whether a version of DSL that supports everything that's legal in StructureDefinition would be significantly easier to edit than JSON.</p>",
        "id": 175578302,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568328494
    },
    {
        "content": "<p>Does the spreadsheet support \"everything that's legal in StructureDefinition,\" btw?</p>",
        "id": 175581435,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568331853
    },
    {
        "content": "<blockquote>\n<p>So the question is whether a version of DSL that supports everything that's legal in StructureDefinition would be significantly easier to edit than JSON.</p>\n</blockquote>\n<p>or YML</p>\n<p>But what is the downside of yet another way to create SDs  (YAWTCS) <br>\nif we all agree the official exchange layer is the fhir artifact.   Realistically we will use what works best for each of us since changing ones personal workflow is hard.</p>",
        "id": 175581914,
        "sender_full_name": "Eric Haas",
        "timestamp": 1568332535
    },
    {
        "content": "<p>One important issue for me is: what's the official format checked into our revision control systems including the FHIR core spec. Excel spreadsheets are <em>very</em> hard to read diffs on; are prone to merge conflicts; and require a fair degree of sophistication to parse. (Though I'll note that <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> still often edits these in a text editor when making tweaks, rather than in the Excel GUI, which to me shows just how valuable an actual editor-friendly format would be.)</p>",
        "id": 175582054,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568332695
    },
    {
        "content": "<p>For those that use spreadsheets, spreadsheet XML is what's checked in.  We've talked w/ Grahame about running the same normalization mechanism on IG Excels as he does on the 'core' ones, but it's not high up his priority list.  (I may do it at some point, though it's not at the top of my list either).  We agreed that, in principle, a better solution is to use Excel as an editor but save XML or JSON structure definitions, but that's a lot more work.</p>",
        "id": 175583528,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568334553
    },
    {
        "content": "<blockquote>\n<p>So the question is whether a version of DSL that supports everything that's legal in StructureDefinition would be significantly easier to edit than JSON.</p>\n</blockquote>\n<p>SD provides multiple ways to do the same thing (as evidenced in the recent thread about the best way to fix a code).  Ideally FPL will provide a single way to do each thing an author might need to do. So that's easier. I'd also like to see FPL simplify common patterns to make them easier (particularly common approaches to slicing).</p>\n<p>I'd also question whether FPL really needs to support every possible thing SD can support.  I'd suggest we go through the top 10 or so IGs and take inventory of the SD features they use.  It will be a subset for sure.  That's what we optimize for.  And then, <em>if necessary</em>, we provide a way to drop into a mode that's nearly like editing SD itself -- because someone will probably say it's a no-go if we can't do <em>everything</em> SD does.  But 98% of people will never use that part.  After all, we're about interoperability -- so we should probably be <em>discouraging</em> people from doing the really wacky one-off stuff anyway.</p>",
        "id": 175584156,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1568335407
    },
    {
        "content": "<p>In answer to your question Josh about \"do spreadsheets support everything?\" the answer is \"mostly, but probably not entirely\".  That's not so much from intention as that the spreadsheet tends to catch up to new features when people complain/need them.  If we're going to look at a new syntax, it should certainly at least support all of the weird stuff that people use now.</p>",
        "id": 175587467,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568339893
    },
    {
        "content": "<p>Everything that appears in an IG is because the use-case requires it.  No-one does \"wacky\" things for fun and entertainment.  They only figured out how to do (and often badgered tool-makers to support doing it) because business requirements demanded it.  \"Discouraging\" isn't necessary or appropriate.  The fact that it's hard/esoteric is discouragement enough.</p>",
        "id": 175587554,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568340019
    },
    {
        "content": "<p>Anyone who's going to express profiles in a custom language is, pretty much by definition, going to be a power user.  We're unlikely to get non-technical users to author in free-hand text using a custom language when there's no tools that support guiding or validating.  So that makes the user of \"power features\" of profiles even more likely.</p>",
        "id": 175587624,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568340127
    },
    {
        "content": "<p>I think we're in agreement on some of these things, Lloyd.</p>\n<blockquote>\n<p>\"Discouraging\" isn't necessary or appropriate. The fact that it's hard/esoteric is discouragement enough.</p>\n</blockquote>\n<p>Right, that's actually the kind of discouragement I meant. Every weird edge case that an author struggles to make work in their IG is a weird edge case that every single implementing system will also have to struggle with to be conformant.  So  keep it hard to do one-off stuff so that people are darned sure they really <em>need</em> whatever it is before putting it into their spec.  </p>\n<blockquote>\n<p>We're unlikely to get non-technical users to author in free-hand text using a custom language when there's no tools that support guiding or validating. </p>\n</blockquote>\n<p>I'm not trying to suggest that non-technical authors will be writing IGs, but I would like for the bar to be lower than it is today -- and we will 100% want tools to support guiding and validating.  The good news is that products like VS Code, Atom, and JetBrains have great infrastructure for developing tools to support DSLs.</p>",
        "id": 175589739,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1568343536
    },
    {
        "content": "<p>What I'm suggesting is that FPL is more likely to be used by techie folks.  The non-technically sophisticated users will migrate to Forge, Trifolia and other tools with more limited capabilities but nicer UIs that hand-hold and prevent users from doing anything that's not allowed.  So if we're introducing something like FPL, it should be aimed at the stuff the more sophisticated users will want to do.</p>",
        "id": 175590192,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568344402
    },
    {
        "content": "<p>I don't disagree that novice users will prefer the visual tools, and \"techie folks\" will prefer the FPL. It's productivity, maintainability, and transparency that drives FPL.</p>",
        "id": 175629041,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1568384929
    },
    {
        "content": "<p>Thanks for the clarification, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>.  I get it now.  :-)</p>",
        "id": 175632672,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1568387064
    },
    {
        "content": "<p>As one who represents someone between \"non-technically sophisticated\" and a \"techie folk\" (I use Lloyd's spreadsheets to create my IGs), I'd like a nice GUI to get started, and then be able to import those artifacts into a more powerful tool (but possibly less user  friendly ) for possibly tricky things. I'm not shy about hand-editing JSON or what ever FPL might become.</p>",
        "id": 175635001,
        "sender_full_name": " Bob Milius",
        "timestamp": 1568388464
    },
    {
        "content": "<p>Developer tools in atom for this would nice.  Do they exist today? So I’ve never done profiling using either FPL or YML and it would be nice try each approach if we are committed to a change.</p>",
        "id": 175643799,
        "sender_full_name": "Eric Haas",
        "timestamp": 1568394304
    },
    {
        "content": "<p>Just to clarify -- FPL doesn't yet exist :) But we are exploring what the DSL might look like. Inputs are very welcome. Any interest in a Birds of a Feather meeting on FHIR Profiling Language this week at HL7?</p>",
        "id": 175644785,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1568394908
    }
]