[
    {
        "content": "<p>I just submitted <a href=\"http://jira.hl7.org/browse/FHIR-36702\">FHIR#36702</a> which proposes to make explicit that inter-version extensions can be used not only when an element doesn't exist in the release you're profiling and does exist in another release, but also when there are data type, target resource, or cardinality differences that allow the target release to be more expressive than the current release is.</p>\n<p>The Gravity SDOH IG has already done this (and been published this way), but a recent change to the publisher means it no longer works.  Grahame pointed out that the spec never promised it would work.  So I'd like the spec to be updated to reflect what reality used to be :)  Starting this thread to allow for discussion.</p>",
        "id": 277823594,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649129415
    },
    {
        "content": "<blockquote>\n<p>So I'd like the spec to be updated to reflect what reality used to be :)</p>\n</blockquote>\n<p>technically, what <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thought it would be. It only worked by accident</p>",
        "id": 277827523,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1649134477
    },
    {
        "content": "<p>I'm a little bothered by this - it's still the same element, even though the cardinality has changed to allow repeats</p>",
        "id": 277827546,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1649134507
    },
    {
        "content": "<p>Is this for something in R4 where it's single cardinality and in R5 it's multiple, and want to do the backport style extension for the repititions in an R4 IG?</p>",
        "id": 277828117,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1649135201
    },
    {
        "content": "<p>yes</p>",
        "id": 277830129,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1649137606
    },
    {
        "content": "<p>Would best practice for 2 instances be to put one in the R4 element and one in the extension drawn from R5? Ugly. But everything else is worse.</p>",
        "id": 277831879,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1649138816
    },
    {
        "content": "<p>The requirement is based in reality.  The alternative is everyone who needs multiple repetitions invents a custom extension, which hurts interoperability and provides no help for automatic inter-version conversion.</p>",
        "id": 277877412,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649164980
    },
    {
        "content": "<p>Or, a generic extension that means ‘additional values for the current element’?</p>\n<p>Which means we avoid ‘cross version’ stuff in those scenarios and open things up for when the 20% includes multiple values.</p>",
        "id": 277880539,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1649166317
    },
    {
        "content": "<p>That's workable, but only if it's available for use in R4</p>",
        "id": 277882157,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649166985
    },
    {
        "content": "<p>It would also be inconsistent with how we're handling changes to type or targetProfile</p>",
        "id": 277890595,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649170351
    },
    {
        "content": "<p>Is it legal to use a backport extension within a single version? In order to get an extra copy of an element that has a limited cardinality?</p>",
        "id": 277892814,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1649171181
    },
    {
        "content": "<p>No</p>",
        "id": 277896108,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649172411
    },
    {
        "content": "<p>IMO, inter-version extensions are pretty complicated -- and allowing them to be used for elements that already exist in the current version adds confusion to complication.  I am not an implementer, but I imagine that <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>'s idea of a <em>simple</em> extension that means \"more of this element\" would be easier to implement in a generic way than inter-version extensions.  It would also allow for this capability on elements that were never 0..* in any version (for better or worse).  Doing it on BackboneElement would be trickier since that would require a complex extension, but I think most backbone elements are already 0..* anyway -- so I think simple extensions would do the trick (except maybe for the few elements that are <code>Resource</code>, but no extension is going to help with that).</p>",
        "id": 277930333,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1649186058
    },
    {
        "content": "<p>One other consideration is that we already have an official release of an IG out that relies on the inter-version extension mechanism - and is now broken for anyone using the official validator.</p>",
        "id": 277938615,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649190313
    }
]