[
    {
        "content": "<p>Anybody else encounter this error before?</p>\n<p>The URL is not valid because '(URL contains Invalid Characters ([\\]))' : <br>\nfile://C:\\Users\\me\\Downloads\\myig\\output/StructureDefinition-myprofile.html</p>\n<p>(I changed some directory names above to protect the innocent)</p>\n<p>The IG in question is a non-HL7 IG that has a dependency on another non-HL7 IG. Both are on my local file system. The dependency resolved, but I get a bunch of these bad links in the HTML. I am running this on Windows 10, and I guess that's why the backslashes appear in the file path.</p>",
        "id": 259126730,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1635267159
    },
    {
        "content": "<p>i think this is one of those things that Grahame talked about that the publisher doesn't handle when you run it locally.</p>",
        "id": 259128214,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1635267818
    },
    {
        "content": "<p>yep you'll get that working locally, but they'll resolve when you publish</p>",
        "id": 259141115,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635273259
    },
    {
        "content": "<p>The issue here is that these are \"private\" IGs that will never be published through HL7. My workaround for now is to manually search/replace the hard coded file absolute file path in all HTML files with a relative path (i.e. change \"file://C:\\Users\\me\\Downloads\\myig\\output\" to \"../../myig/output\".</p>",
        "id": 259257546,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1635348545
    },
    {
        "content": "<p>But that still leaves hundreds of those errors in the qa.html file.</p>",
        "id": 259257701,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1635348606
    },
    {
        "content": "<blockquote>\n<p>The issue here is that these are \"private\" IGs that will never be published through HL7</p>\n</blockquote>\n<p>I don't see how that's related. you still have to do the publish step</p>",
        "id": 259282059,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635358312
    }
]