[
    {
        "content": "<p>Hi again all  =)  Hoping for some guidance before I add something incorrect.  In this <a href=\"https://github.com/HL7/JIRA-Spec-Artifacts/compare/master...GinoCanessa:master\">repo</a>, I'm wondering if I have the version info correct.</p>\n<p>It appears I need to add the matching version from <a href=\"https://github.com/HL7/fhir-subscription-backport-ig/blob/master/package-list.json\">package-list.json</a>, but I'm not sure how the URL conventions work.  E.g., do I need to create a GH tag <code>STU1</code> before I push this so that it shows up?  Or, is the path wrong and I should create a tag <code>2021Jan</code> and update the URLs.</p>\n<p>Any help/advice appreciated!</p>",
        "id": 219253987,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1607457391
    },
    {
        "content": "<p>Creation of tags should be handled automatically as part of the publication process.  You shouldn't have to do anything there.</p>",
        "id": 219256462,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607458535
    },
    {
        "content": "<p>You will have to specify what you expect the URL to be.  For you, it'll be \"2020Jan\" because it's a ballot release.  (The STU1 URL won't exist until you do final publishing.)</p>",
        "id": 219256597,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607458580
    },
    {
        "content": "<p>Thanks Lloyd, I <em>think</em> (read: hope) that everything's right in the version I just PR'ed then.  Cheers!</p>",
        "id": 219258283,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1607459349
    },
    {
        "content": "<p>We are having problems getting rid of this warning before ballot:</p>\n<div class=\"codehilite\"><pre><span></span><code>The jira specification file appears to be out of date with the versions, artifacts and pages currently defined in the IG. A proposed revised file to be reviewed and, if appropriate, submitted as a pull request against the XML folder in https://github.com/HL7/JIRA-Spec-Artifacts. To see the differences, perform a file compare on &#39;template/jiraspec.tmp.xml&#39; (currently in Github) and &#39;jira.xml&#39; (reflects current IG content)\n</code></pre></div>\n<p>This is in all 3 of our IGs (eCR, BFDR, and VR Common Library). Two of the IGs have never been published before.</p>\n<p>The artifacts list and pages and versions appear to be correct (when doing a compare as instructed).</p>\n<p>Where does this file live: \"'template/jiraspec.tmp.xml' (currently in Github)\". Which Github? - we can't find this file. (There is a file created locally (if one builds locally, which I don't) that might be this file?).</p>\n<p>We are having problems comparing files and lists because the lists are very long and in different orders etc. </p>\n<p>Is there something we are missing as this seems to be a very manual, time consuming, error-prone process. (Especially with large IGs with many profiles, etc.). The process also gets longer/harder based on how many releases the IG has been through.</p>\n<p>Any help would be much appreciated as this is the last warning on these 3 IGs we need to get rid of before going to ballot.</p>",
        "id": 219399637,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607548832
    },
    {
        "content": "<p>You have to take your template/jira.xml and go and make a fork of the JIRA-Spec-Artifacts project, update it with that file (renaming it appropriately for the different projects), and then make a pull request so Lloyd can merge it in.</p>",
        "id": 219400193,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1607549079
    },
    {
        "content": "<p>I'm pretty sure that you will need to build it locally as those files aren't in the output directory so they wouldn't be moved to the build site.</p>",
        "id": 219400334,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1607549143
    },
    {
        "content": "<p>It's not that complex of a thing to do if you are building locally.</p>",
        "id": 219400428,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1607549166
    },
    {
        "content": "<p>So the file in the warning message that says \"template/jiraspec.tmp.xml' (currently in Github)\" - really is NOT in Github and is only local?</p>",
        "id": 219401147,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607549504
    },
    {
        "content": "<p>it will be in local when the template for your guide is downloaded and expanded</p>",
        "id": 219401336,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1607549564
    },
    {
        "content": "<p>Ok thanks. </p>\n<p>Maybe that warning message should be updated because it's confusing?</p>",
        "id": 219403650,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607550595
    },
    {
        "content": "<p>vr-common-library (<a href=\"https://github.com/HL7/vr-common-library/tree/master\">https://github.com/HL7/vr-common-library/tree/master</a>) is still getting that warning, yet comparing what is on HL7's Jira spec (<a href=\"https://github.com/HL7/JIRA-Spec-Artifacts/blob/master/xml/FHIR-us-vr-common-library.xml\">https://github.com/HL7/JIRA-Spec-Artifacts/blob/master/xml/FHIR-us-vr-common-library.xml</a>) with what is being built shows zero differences. Might it be some issue with the versioning in package-list.json?</p>",
        "id": 219421981,
        "sender_full_name": "David deRoode",
        "timestamp": 1607562675
    },
    {
        "content": "<p>The template/jiraspec.tmp.xml is actually a transformed version of the file from Git that is canonicalized for simpler comparison.</p>",
        "id": 219427404,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607569532
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197608\">@David deRoode</span> can you send me both files?</p>",
        "id": 219427457,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607569586
    },
    {
        "content": "<p>I just compared my local file and the file in JIRA-Spec-Artifacts and they are indeed identical. I'll send you both files and package-list.json.</p>",
        "id": 219429943,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607573108
    },
    {
        "content": "<p>Well, it probably didn't help that the message tells you to look at the wrong files... :(</p>\n<p>I've fixed the template and it will now tell you to look at the two correct files - the normalized ones it is actually comparing.  That should make the differences much more clear.  (I've also changed the names of those files so it's more obvious what they contain.)  Re-build using the current template.  If the issues still aren't clear, send me <em>those</em> files and I'll help further.  (Apologies for the confusion thus far.)</p>",
        "id": 219433152,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607577416
    },
    {
        "content": "<p>Ok, maybe that's where we've been going wrong. I'll let <span class=\"user-mention\" data-user-id=\"197608\">@David deRoode</span> take a look in the morning. Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 219437190,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607583235
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> going to send you the new files in email. Some funky stuff going on that we don't understand.</p>",
        "id": 219553566,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607647189
    },
    {
        "content": "<p>as a matter of routine I add the jira warning to the ignorewarnings file.  even then it has shown up and I have had to refresh the warnings file</p>",
        "id": 219554709,
        "sender_full_name": "Eric Haas",
        "timestamp": 1607648110
    },
    {
        "content": "<p>Are you adding warnings from the HTML or from the qa.txt?  (You should always populate the ignore file from the latter.)</p>",
        "id": 219554774,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607648175
    },
    {
        "content": "<p>qa.txt</p>",
        "id": 219560667,
        "sender_full_name": "Eric Haas",
        "timestamp": 1607655494
    },
    {
        "content": "<p>Wait - I thought it was mandatory to get rid of the jira spec file warning (i.e. we shouldn't suppress it)...</p>",
        "id": 219561004,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607655843
    },
    {
        "content": "<p>it needs to be handled at some point.  if you suppress just to have no warnings, you'll need to remember that you need to action it before you ballot/publish.</p>",
        "id": 219562171,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1607657310
    },
    {
        "content": "<p>it's so easy to get rid of it or ignore it that I don't see the point in suppressing it</p>",
        "id": 219562184,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1607657333
    },
    {
        "content": "<p>\"so easy\" - <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> I'm thinking that's you volunteering to sort out the jira spec issues we are having with our 3 IGs going to ballot this cycle?</p>",
        "id": 219562893,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607658223
    },
    {
        "content": "<p>Sure.  Which ones?</p>",
        "id": 219562944,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1607658258
    },
    {
        "content": "<p>BFDR, Vital Records Common Profile Library, and eCR. (I was joking, but I'll take the help!)</p>",
        "id": 219562970,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607658323
    },
    {
        "content": "<p>You can only 'suppress' it if you've made the determination that the alignment is correct and that what's being proposed by the build process is inappropriate.  (Not just because you don't know how to get rid of the warning.)  If you suppress it without having done that analysis, the FMG won't let you go to ballot because the drop-downs won't be right for the voters.</p>",
        "id": 219562972,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607658325
    },
    {
        "content": "<p>I looked at the BFDR IG.  I found the following</p>\n<ul>\n<li>the logic wasn't handling determining the default version in cases where there was no official publication.  It was choosing the first release (current) instead of the first ballot release.  Now fixed.</li>\n<li>the Baby Quinn issue is caused by the fact you have round brackets in your name the text before that is the same as the name of another artifact.  The Jira process presumes that if you've got round brackets, you're specifying the 'former' name of the resource.  If you replace the round brackets with a dash or something (or better yet, add the word 'example' to the name), that problem should go away.  (And no, there's no reasonable way you could have been expected to know that - it was one of those weird edge cases people always manage to find :&gt;)</li>\n</ul>",
        "id": 219564078,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607659637
    },
    {
        "content": "<p>You mean <strong>I</strong> always manage to find....</p>",
        "id": 219564262,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607659892
    },
    {
        "content": "<p>So I have 3 FHIR IGs. That I thought were finished. They ALL use that same format with the round brackets for examples. I can't fix it right now. I'm still working on one last CDA IG to get to Lynn today. I guess I'll try and sort it all out tomorrow.</p>",
        "id": 219564350,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607659975
    },
    {
        "content": "<p>Some people just have a special talent</p>",
        "id": 219564595,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607660367
    },
    {
        "content": "<p>No need to fix it.</p>",
        "id": 219564600,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607660373
    },
    {
        "content": "<p>At least not right away.  It'll save you grief long term if you do.</p>",
        "id": 219564604,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607660389
    },
    {
        "content": "<p>I'm testing a new validation warning that will let you know what the issue is next time - instead of just doing weird things in your proposed file.</p>",
        "id": 219564650,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607660421
    },
    {
        "content": "<p>I have to fix it - I'm too obsessive to leave it. Sigh.</p>",
        "id": 219564659,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607660444
    },
    {
        "content": "<p>And some people are just plain special :D</p>",
        "id": 219564664,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607660463
    },
    {
        "content": "<p>Yes, better message would be good.</p>",
        "id": 219564667,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607660473
    },
    {
        "content": "<p>she's so obsessive she turned down my help to fix the errors. (well that and I don't use Trifolia)</p>",
        "id": 219564712,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1607660533
    },
    {
        "content": "<p>I won't fix in Trifolia. I'll fix in Oxygen.</p>",
        "id": 219564721,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607660584
    },
    {
        "content": "<p>I'm also a control freak!</p>",
        "id": 219564732,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607660616
    },
    {
        "content": "<p>If you take over writing the templates, you could have even more control...</p>",
        "id": 219564778,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607660649
    },
    {
        "content": "<p>And I need to think up a new example naming scheme as clearly my old one is crap.</p>",
        "id": 219564781,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607660652
    },
    {
        "content": "<p>(I figure it's worth a shot <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span>)</p>",
        "id": 219564787,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607660671
    },
    {
        "content": "<p>HA! Couldn't do that to you, you love it.</p>",
        "id": 219564789,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607660674
    },
    {
        "content": "<p>use {} or [], I'm sure those special characters won't ruin Lloyd's day</p>",
        "id": 219564791,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1607660683
    },
    {
        "content": "<p>Confirm please Lloyd? Can I use []???</p>",
        "id": 219564798,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607660705
    },
    {
        "content": "<p>They won't.  Though having the word 'example' is still a good thing.</p>",
        "id": 219564801,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607660713
    },
    {
        "content": "<p>Ok, here' sthe thing about \"example\". At some point I DID have that in there. But then on the artifacts page it was coming out with double \"example\". I think the template was putting it in. That seems to have gone away now though.</p>",
        "id": 219564851,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607660778
    },
    {
        "content": "<p>i.e. I changed them all to NOT have \"example\".</p>",
        "id": 219564923,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607660921
    },
    {
        "content": "<p>Ok, I did both for BFDR - changed to square brackets AND added \"example\" to them all.</p>",
        "id": 219565658,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607662083
    },
    {
        "content": "<p>Ok, build process should capture duplicate names and spit out an obvious warning in the log.  (No easy way to get it into the QA though.)</p>",
        "id": 219565667,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607662102
    },
    {
        "content": "<p>I did the Jira thing for both my specs and pushed successfully but still get the warnings,  The juice is not worth the squeeze to figure out the warnings, so I suppress.</p>",
        "id": 219656769,
        "sender_full_name": "Eric Haas",
        "timestamp": 1607717948
    },
    {
        "content": "<p>except that you aren't allowed to suppress the warnings unless there is something explicitly wrong in the tooling that deals with the artifacts file (like there was for Sarah's guides) since that file allows commenters to point their JIRA issue to the proper artifact.</p>",
        "id": 219658892,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1607719043
    },
    {
        "content": "<p>Well, up until a day or so ago that warning was meaningless. The files it mentioned didn't even exist. It's changed now, but it's like 2 days before ballot deadline so I'm thinking that might be a valid reason for suppression.</p>",
        "id": 219661962,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607720629
    },
    {
        "content": "<p>I'm suppressing it now anyway, because even after fixing the round bracket issue and adding \"example\" plus the changes that Lloyd made there still seems to be issues.</p>",
        "id": 219662118,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607720723
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191918\">@Sarah Gaunt</span> I've tweaked the normalization process to make the comparison slightly easier.  The outstanding issues are all things that need to be fixed:</p>\n<ul>\n<li>The ballot URLs are different (different case)</li>\n<li>The ci-build URLs are different (not sure if the one in your json file is wrong or if the one currently in Jira is wrong, but one of the two needs to be fixed</li>\n<li>You're missing a couple of version declarations</li>\n<li>The name of one of your artifacts doesn't jive with what it is in the IG.  (I expect you'll want to fix what's in the IG.)</li>\n<li>You're missing the (NA), (many), Artifacts Summary and ToC pages</li>\n</ul>\n<p>If you fix those things, then your warning should go away.</p>",
        "id": 219674689,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607729402
    },
    {
        "content": "<p>I haven't been working on the jira stuff and I think <span class=\"user-mention\" data-user-id=\"197608\">@David deRoode</span> is likely finished for the weekend. Does this need to be fixed before Sunday or can it wait until next week?</p>",
        "id": 219675036,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607729696
    },
    {
        "content": "<p>And thanks for the list <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 219675120,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607729765
    },
    {
        "content": "<p>Getting the missing artifacts in is pretty important.  Voters are going to need to be able to say (NA) and (may) in particular.  Fixing the URLs is also important because if your ci build is wrong, then the versions page is going to have the wrong link.</p>",
        "id": 219675525,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607730155
    },
    {
        "content": "<p>FMG hat on, I'd say you need to fix at least those.  (And if you're going to do that, then hopefully your OCD will take care of the rest... :&gt;)</p>",
        "id": 219675579,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607730204
    },
    {
        "content": "<p>Of course it will. <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span></p>",
        "id": 219676560,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607731090
    },
    {
        "content": "<p>Ok, I forked, update, pushed, pulled etc. No idea if I've done this correctly or not, let me know if I totally screwed it up <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 219680368,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607734726
    },
    {
        "content": "<p>One down, two to go...</p>",
        "id": 219680379,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607734753
    },
    {
        "content": "<p>Merged</p>",
        "id": 219684355,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607740464
    },
    {
        "content": "<p>Thanks! There's one more. Just finishing off eCR...</p>",
        "id": 219684368,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607740493
    },
    {
        "content": "<p>Ok fixed them all yesterday. Thanks for all your help <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>\n<p>So.... Is there any way this could be made so it's automated based on the jira-current file? I mean, you've already created it - why can't that file just be pushed into the JIRA-spec git each time the IG is built and then it will always be up to date and there won't be this need for manual comparison and updates? (Sean has written code to create the file in ToF but I don't think it takes into account the deprecated stuff.)</p>",
        "id": 219782977,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607895775
    },
    {
        "content": "<p>Hi Sarah,</p>\n<p>What's generated is a suggested starting point.  The generation process isn't smart enough to figure out duplicates. And some artifacts we don't necessarily want to list.  Some pages we categorize as a single item in Jira even though they have multiple pages.  So humans need to be in the loop</p>",
        "id": 219790159,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607906093
    },
    {
        "content": "<p>Darn it!</p>",
        "id": 219790435,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1607906626
    },
    {
        "content": "<p>Since this question is somewhat related, I'll ask it here.  Is it suggested to commit the input-cache/jiraspec.xml file, or not?</p>",
        "id": 219794215,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1607913115
    },
    {
        "content": "<p>It's not critical</p>",
        "id": 219794440,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607913392
    }
]