[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Dental-data-exchange has an incorrect Jira spec file key and name (dentalreferral). Could you recommend this should be addressed? In the future, could the addition of all new Jira specs be required/enforced to be the IG code (approved by FMG in the IG proposal) to avoid this?</p>",
        "id": 206284960,
        "sender_full_name": "David deRoode",
        "timestamp": 1596821048
    },
    {
        "content": "<p>Keys can be anything, but once established, can't be changed - ever.  You'll need to go back to whatever the key was.</p>",
        "id": 206289918,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596823231
    },
    {
        "content": "<p>The key is internal and won't be seen by users</p>",
        "id": 206289961,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596823251
    },
    {
        "content": "<p>Does it matter that it does not match the packageID?</p>",
        "id": 206292861,
        "sender_full_name": "David deRoode",
        "timestamp": 1596824807
    },
    {
        "content": "<p>Nope</p>",
        "id": 206293159,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596824956
    },
    {
        "content": "<p>It's the key that's used inside Jira</p>",
        "id": 206293180,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596824971
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Dental is getting this build error: \"There is no jira specification file defined with the expected name of FHIR-us-dental-data-exchange in the xml folder of the <a href=\"https://github.com/HL7/Jira-Spec-Artifacts\">https://github.com/HL7/Jira-Spec-Artifacts</a> project. This must exist before ballot or publication.\" This is because the key within Jira was set to Dentalreferral (not dental-data-exchange). This Jira key seems to be expected by the IG publisher as well. If there is no requirement that the package-id match the Jira specification key, could this build error be presented as an Informational message? If it is a requirement, might this be caught upstream (ie during Github setup, IG proposal, etc.)?</p>",
        "id": 206478827,
        "sender_full_name": "David deRoode",
        "timestamp": 1597075569
    },
    {
        "content": "<p>Add a parameter in your IG called 'jira-code' that indicates what the code for your IG is in Jira.</p>",
        "id": 207792427,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598218394
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Is there documentation for 'jira-code' somewhere?  I haven't looked for it yet, but I don't recall seeing it before.</p>",
        "id": 207796290,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1598225079
    },
    {
        "content": "<p>Nope.  It was added a day before my vacation started.  I'll get around to documenting it at some point.  If someone wants to submit a pull request against ig-guidance sooner, feel free :)</p>",
        "id": 207798653,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598228996
    }
]