[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nI followed the instructions in the warning, created a PR, and it was merged.  <br>\nHowever, during that process, I noted some things were in the jira-current that weren't in the jira-new file (like versions and specification attributes) and manually added those before the merge (I actually had to add the versions in order to merge).  But now the publisher continues to generate the jira-new without those things so there's a mismatch with jira-current and the Warning remains in qa.html</p>\n<p>I can't figure out how to get the publisher to generate those additional items (ciUrl, defaultVersion, defaultWorkgroup, and the versions):<br>\n<a href=\"/user_uploads/10155/0-K43pjn2F7OsEwJqzs9fs0T/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/0-K43pjn2F7OsEwJqzs9fs0T/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/0-K43pjn2F7OsEwJqzs9fs0T/image.png\"></a></div><p>gitUrl and url stick around somehow so I thought I might find their settings in some config file and then add values for the others, but I can't find their values anywhere (I think they must be getting generated).</p>\n<p>Everything else in the two files is synchronized... how do I get these last few items to sync?</p>",
        "id": 233419370,
        "sender_full_name": "Rob Reynolds",
        "timestamp": 1617761100
    },
    {
        "content": "<p>Also, the deprecated versions stick around somehow (but only the deprecated versions).  No idea how.</p>",
        "id": 233420020,
        "sender_full_name": "Rob Reynolds",
        "timestamp": 1617761607
    },
    {
        "content": "<p>The versions come from your package-list.json.  If you have versions in your Jira file that aren't in the generated Jira, that means they're missing from your package-list.json (and should be added).  Deprecated versions are carried forward and aren't expected to be in the package-list.json (though they can be).</p>",
        "id": 233421879,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617763043
    },
    {
        "content": "<p>(and should be if they've ever actually been published)</p>",
        "id": 233421894,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617763058
    },
    {
        "content": "<p>I originally thought the versions should be coming from the package-list.json, but they're in package-list.json and not in the generated Jira so I thought that must not be the case: <a href=\"/user_uploads/10155/yQQ9nOOGsQ2w229L3bXiGvhl/package-list.json\">package-list.json</a>.  (guess I should have stuck with that original thought  <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span>  thanks for clarifying! )</p>",
        "id": 233423442,
        "sender_full_name": "Rob Reynolds",
        "timestamp": 1617764309
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Given the package-list.json I posted above (which includes the versions) any thoughts on why versions are in my Jira file but missing in the generated Jira?  (or really, why they're in my package-list.json [which matches my Jira file] but missing in the generated Jira)</p>",
        "id": 233466609,
        "sender_full_name": "Rob Reynolds",
        "timestamp": 1617792467
    },
    {
        "content": "<p>Also, thoughts on the missing attributes in the specification element and how to resolve those?</p>",
        "id": 233466766,
        "sender_full_name": "Rob Reynolds",
        "timestamp": 1617792552
    },
    {
        "content": "<p>(trying to get this resolved before the CQI WG meeting on Friday)</p>",
        "id": 233466813,
        "sender_full_name": "Rob Reynolds",
        "timestamp": 1617792587
    }
]