[
    {
        "content": "<p>I'm trying to represent the IPS EN 17269 data set as FHIR logical models. <br>\nThis dataset doesn't specify the cardinality for the defined concepts. I  tried  to compile using the same \"configuration\" we use for the IPS FHIR profiles, but i noticed that the build finally fails if the cardinality are not specified, where instead all is (more or less) good if cardinality are given.<br>\nI can suppose that the failure is due to the fact that with the used page template there is the attempt  to create a table with the cardinalities ….<br>\n have you any suggestion on how to overcome this problem ? is there any page template that i can use instead for this kind of logical Models ?</p>",
        "id": 157853425,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1549626251
    },
    {
        "content": "<p>cardinality is 0..* then</p>",
        "id": 157854357,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1549627339
    },
    {
        "content": "<p>Telling the truth the model would allow to determine the min cardinality;  <br>\nbut (0 or 1) …* is different from saying that the max cardinality is not specified. <br>\nIf for an element of a data set the cardinality is set to 0...* , someone could always complain saying that for that element the cardinality should be 0..1 and not 0...*....</p>",
        "id": 157858389,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1549631977
    },
    {
        "content": "<p>but if you say 0..1, someone could always complain.... and 0..* is the outer limit...</p>",
        "id": 157866821,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1549639605
    },
    {
        "content": "<p>sure :-) ... But my intention is to represent as FHIR logical model the current IPS data set as documented in the EN 17269 standard .</p>",
        "id": 157875730,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1549646453
    },
    {
        "content": "<p>So , since in this standard the max cardinality is not defined, I don't want to add in the model details that are not part of the original model as the max cardinality..</p>",
        "id": 157875783,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1549646517
    },
    {
        "content": "<p>and if i put tin the model max = * is not the same of omitting it</p>",
        "id": 157875850,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1549646559
    },
    {
        "content": "<p>.. however my question was how to handle the absence of (max) cardinality with the IG builder :-)</p>",
        "id": 157875894,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1549646618
    },
    {
        "content": "<blockquote>\n<p>and if i put tin the model max = * is not the same of omitting it</p>\n</blockquote>\n<p>I don't agree... sees to me * is explicitly saying it is undefined.</p>",
        "id": 157877171,
        "sender_full_name": "John Moehrke",
        "timestamp": 1549647667
    },
    {
        "content": "<p>It's not allowed by the methodology.  The only reason the cardinality on 'min' and 'max' is allowed to be 0 is for differentials that aren't wanting to tighten the cardinality.</p>",
        "id": 157877200,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549647696
    },
    {
        "content": "<p>If you want to have an element with unspecified cardinality, the only thing you can do is 0..* for everything.</p>",
        "id": 157877215,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549647717
    }
]