[
    {
        "content": "<p>Has anyone tried to create nested unordered lists in the IG?  I've looked at the kramdown documentation and ideally it should be * for the top level and the next level is 4 spaces followed by * to create sub-bullets.  The output from the IG publisher however seems to ignore it.  Thoughts on what to try?  cc: <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span></p>",
        "id": 171102549,
        "sender_full_name": "May Terry",
        "timestamp": 1563386686
    },
    {
        "content": "<p>I have, but using HTML, not markdown, so I'm afraid I can't help.</p>",
        "id": 171102796,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563386857
    },
    {
        "content": "<p>(Though in the worst case, you can embed XHTML inside your markdown - that's always my fallback)</p>",
        "id": 171104317,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563387829
    },
    {
        "content": "<p>yep, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - I think that's where I'm now headed. :-)</p>",
        "id": 171105990,
        "sender_full_name": "May Terry",
        "timestamp": 1563388942
    },
    {
        "content": "<p>easy peasy in ig's </p>\n<div class=\"codehilite\"><pre><span></span>### header3\n\n- list\n   - sublist   ( make sure is aligned to the first letter of the list above)\n</pre></div>",
        "id": 171108831,
        "sender_full_name": "Eric Haas",
        "timestamp": 1563390756
    },
    {
        "content": "<p>here is an example from US Core:</p>\n<div class=\"codehilite\"><pre><span></span>### How to read this Guide\n\nThis Guide is divided into several pages which are listed at the top of each page in the menu bar.\n\n- [Home]\\: The home page provides the introduction and background for {{site.title}}.\n- [Guidance]\\: These pages provides overall guidance in using the profiles and transactions defined in this guide.\n  - [General Guidance] provides guidance, definitions and requirements common to all {{site.title}} actors used in this guide..\n  -  [Clinical Notes Guidance] gives guidance on the interactions between Consumers and Producers of clinical notes.\n  -  [Future of {{site.title}}] outlines the approach to adding new content to {{site.title}}.\n- [Profiles and Extensions]\\: This page lists the set of Profile and Extension that are defined in this guide to exchange quality data. Each Profile page includes a narrative introduction, formal definition and a &quot;Quick Start&quot; guide to the supported search transaction for each {{site.title}} Profile.\n- [Search Parameters and Operations]\\: This page lists the{{site.title}} defined Operations and Search Parameters that are used in US Core transactions.\n- [Terminology]\\: This page lists the value sets and code system defined for {{site.title}} profiles.\n- [Capability Statements]\\: This set of pages describes the expected FHIR capabilities of the various {{site.title}} actors.\n- [Security]\\: General security requirements and recommendations for {{site.title}} actors.\n- [Examples]\\: List of links to all the examples used in this guide.\n- [Downloads]\\: This page provides links to downloadable artifacts.\n</pre></div>",
        "id": 171109276,
        "sender_full_name": "Eric Haas",
        "timestamp": 1563391089
    }
]