[
    {
        "content": "<p>Can the Must Support (MS) tag be applied to the data elements of a complex data type? <br>\nI have some thoughts about it. But I do need your gurus’ guidance.<br>\nThe ElementDefinition presents MS as an attribute of the BackBone element.<br>\nThe data elements of a complex data type are not the BackBone type.<br>\nTherefore, they shall not be eligible for the MS tag.</p>",
        "id": 278087999,
        "sender_full_name": "Thomas Zhou",
        "timestamp": 1649280201
    },
    {
        "content": "<p>We document this in US Core <a href=\"http://hl7.org/fhir/us/core/conformance-expectations.html#must-support---complex-elements\">here</a></p>",
        "id": 278089242,
        "sender_full_name": "Eric Haas",
        "timestamp": 1649280803
    },
    {
        "content": "<p>MustSupport is a characteristic of ElementDefinition, which applies to <em>all</em> elements.  It's certainly possible to mark elements within a backbone element as 'must support'.</p>",
        "id": 278089707,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649281069
    },
    {
        "content": "<p>Should  MustSupport also be applied to the elements of an independent complex data type that does not connect to any FHIR resources?</p>",
        "id": 278206010,
        "sender_full_name": "Thomas Zhou",
        "timestamp": 1649355823
    },
    {
        "content": "<p>Should  MustSupport also be applied to the elements of an independent complex data type that does not connect to any FHIR resources?</p>",
        "id": 278206193,
        "sender_full_name": "Thomas Zhou",
        "timestamp": 1649355898
    },
    {
        "content": "<p>mustSupport should be declared on any elements that you expect implementers to support if they comply with your IG.  (Though if you reference a profile that has its own mustSupport declarations, you don't need to drill into the descendants to declare those unless you want to add some additional context-specific descendent elements as mustSupport.</p>",
        "id": 278207011,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649356289
    },
    {
        "content": "<p>Thank you for such a quick reply and valuable information.</p>\n<p>Which one or perhaps both are following best practices in FHIR IG implementation?</p>\n<ol>\n<li>To declare the MustSupport tag to the subelements of an independent data type, then assign the data type to the data elements in FHIR Resources. </li>\n<li>To declare the MS tag to the required subelements displayed in the resources.</li>\n</ol>",
        "id": 278224586,
        "sender_full_name": "Thomas Zhou",
        "timestamp": 1649364753
    },
    {
        "content": "<p>If the mustSupport requirements are consistent across multiple uses of a given type, creating a shared profile for the type makes IG maintenance easier and makes clear to implementers that the expectations are consistently shared across all places that reference the profile.</p>\n<p>If the requirements aren't consistent, then you'll need to express them inline in the referencing profile.</p>",
        "id": 278232246,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649368936
    },
    {
        "content": "<p>Thank you very much for such crystal clear answer!</p>",
        "id": 278250021,
        "sender_full_name": "Thomas Zhou",
        "timestamp": 1649384434
    }
]