[
    {
        "content": "<p>Wanted to see if <a href=\"http://jira.hl7.org/browse/FHIR-32021\">FHIR-32021</a> holds interest for IG authors. Premise is just: Allow for IG-specific flags instead of a single \"Must Support\" flag with unspecified semantics that every IG overrides differently. For example, an IG might define and use three distinct flags, marking some elements as <code>Must-Produce</code>, some overlapping set as <code>Must-Display</code> and a special few as <code>Good-With-Mustard</code>.</p>",
        "id": 236770218,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619744309
    },
    {
        "content": "<p>Actually, I've been noodling on the notion of moving 'mustSupport' out of profiles and into CapabilityStatements - a CapabilityStatement could have a list of elements and the associated 'functional' behavior that was expected for a system with respect to those elements.  To a certain extent, that would be closer to what's actually needed.  CapabilityStatement is about defining system behavior.  Multiple CapabilityStatements might reference the same profile (and in some cases, reference the same profile in different contexts).  It could however make for long lists of elements.  Thoughts?</p>",
        "id": 236772822,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619746397
    },
    {
        "content": "<p>I think that's not something that should be in CapabilityStatement. What I've been meaning to do is to support the idea of a profile that defines structure - and not expectations, and then vice versa, and build summary views that show sets of expectation profiles in tabular form</p>",
        "id": 236786905,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1619759625
    },
    {
        "content": "<p>Can't see this working at the CapabilityStatement layer either - what if a server supports multiple profiles and IGs with differing 'must support' settings for the same element. Much depends on whether the setting is used for conformance or best practice purposes. The IPS IG interpretation of 'must support if available' certainly resonates with implementers here in NZ as a best practice. Testing against structures is far easier than defining and assessing conformance against expectations (with or without mustard :) )</p>",
        "id": 236787456,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1619760187
    },
    {
        "content": "<p>three's another discussion (or a few actually) about bringing a) more flexibility and b) better determined behaviour for MustSupport.</p>",
        "id": 236789183,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1619762038
    },
    {
        "content": "<p>I think I recall suggesting a codeableconcept with an extensible binding to an HL7-defined valueset.</p>",
        "id": 236789298,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1619762142
    },
    {
        "content": "<p>(if I'm recalling wrong and didn't suggest it there, I'm bringing it up now)</p>",
        "id": 236789414,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1619762251
    },
    {
        "content": "<p>I don't know <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> if when you say a few flags you are actually also referring to a 0..* codeableconcept</p>",
        "id": 236789528,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1619762349
    },
    {
        "content": "<p>Well, there is a discussion about it: <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=91991374\">https://confluence.hl7.org/pages/viewpage.action?pageId=91991374</a><br>\nplease see the presentation</p>",
        "id": 236803461,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1619771977
    },
    {
        "content": "<p>In principle, there are different perspectives that can be described by different extensions...</p>",
        "id": 236803538,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1619772013
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> If there were different mustSupport expectations for the same element, the system would need to support all of them (and would declare that).</p>",
        "id": 236832449,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619788772
    },
    {
        "content": "<blockquote>\n<p>I don't know <span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> if when you say a few flags you are actually also referring to a 0..* codeableconcept</p>\n</blockquote>\n<p>I don't know either, but something like that. Or a 0..* Coding.</p>",
        "id": 236833525,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619789220
    },
    {
        "content": "<p>could (some of) those codes originate some invariants? To let the computers do (some of) the verification.</p>",
        "id": 236838456,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1619791239
    },
    {
        "content": "<p>I prefer Coding over CodeableConcept in this specific location. Or even a URL instead of a coding</p>",
        "id": 237247036,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620084988
    },
    {
        "content": "<p>Yes, URL is a great idea</p>",
        "id": 237250739,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620087784
    }
]