[
    {
        "content": "<p>I have just updated my implementation guides with SNOMED CT codes from the latest release of SNOMED CT (2021-07-31). However <a href=\"http://tx.fhir.org\">tx.fhir.org</a> does not recognize the codes. I expect that is because the new release is not yet on the terminology server.... It is not critical, so don't rush, but can you say something about when the update is expected?</p>",
        "id": 249714221,
        "sender_full_name": "Kirstine Rosenbeck Gøeg",
        "timestamp": 1629205115
    },
    {
        "content": "<p>which edition?</p>",
        "id": 249714440,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629205216
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194347\">@Kirstine Rosenbeck Gøeg</span>  I'm going to get the International Edition updated soon - I'm hoping to do that today.</p>",
        "id": 249714619,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1629205308
    },
    {
        "content": "<p>That is great <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  - <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  I am using the international edition so far - I am guessing Denmark is too small, for the Danish edition to be supported - it would be great though. Thanks again and best regards :-)</p>",
        "id": 249721520,
        "sender_full_name": "Kirstine Rosenbeck Gøeg",
        "timestamp": 1629208332
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194347\">@Kirstine Rosenbeck Gøeg</span> If you can let me know where and how to get the Danish Edition distribution (legally, of course), we should be able to include it.</p>",
        "id": 249728155,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1629211047
    },
    {
        "content": "<p>FYI - the SNOMED CT International Edition has been updated to release 20210731 on <a href=\"http://tx.fhir.org\">tx.fhir.org</a>.</p>",
        "id": 249782759,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1629236511
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  I am asking SNOMED International and my NRC about the specifics. What are you doing with the other editions? using nlm-distribution files or going through SNOMED International MLDS?</p>",
        "id": 249836441,
        "sender_full_name": "Kirstine Rosenbeck Gøeg",
        "timestamp": 1629286784
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194347\">@Kirstine Rosenbeck Gøeg</span> That sounds good.  So far I've signed up and download the releases from each national service - except Sweden where I've worked with Daniel Karlsson and he has provided the files (which hopefully I will be finally able to process and load soon).  I'm happy to work with whatever arrangement works best on your end.</p>",
        "id": 249842846,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1629290618
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>. I still get errors for new concepts in my implementation guide.  For example for this concept: <a href=\"https://browser.ihtsdotools.org/?perspective=full&amp;conceptId1=1144798005&amp;edition=MAIN/2021-07-31&amp;release=&amp;languages=en\">https://browser.ihtsdotools.org/?perspective=full&amp;conceptId1=1144798005&amp;edition=MAIN/2021-07-31&amp;release=&amp;languages=en</a> </p>\n<p>Which gives the following error:<br>\nUnable to find code 1144798005 in <a href=\"http://snomed.info/sct\">http://snomed.info/sct</a> (version <a href=\"http://snomed.info/sct/731000124108/version/20210301\">http://snomed.info/sct/731000124108/version/20210301</a>); The code \"1144798005\" is not valid in the system <a href=\"http://snomed.info/sct\">http://snomed.info/sct</a>; The code provided (<a href=\"http://snomed.info/sct#1144798005\">http://snomed.info/sct#1144798005</a>) is not valid in the value set 'All codes known to the system' (from <a href=\"http://tx.fhir.org/r4\">http://tx.fhir.org/r4</a>) for '<a href=\"http://snomed.info/sct#1144798005\">http://snomed.info/sct#1144798005</a>'<br>\n(Example from this profile: <a href=\"http://build.fhir.org/ig/hl7dk/KL-dk-tools/branches/main/StructureDefinition-KLToolsCarePainVRS.html\">http://build.fhir.org/ig/hl7dk/KL-dk-tools/branches/main/StructureDefinition-KLToolsCarePainVRS.html</a>)</p>\n<p>It seems that  <a href=\"http://tx.fhir.org\">tx.fhir.org</a> does not choose the latest release, even though my system is set to a version-less uri: <a href=\"http://snomed.info/sct\">http://snomed.info/sct</a></p>\n<p>BTW: The Danish NRC is processing my request for having the Danish release on <a href=\"http://tx.fhri.org\">tx.fhri.org</a>.</p>",
        "id": 250471352,
        "sender_full_name": "Kirstine Rosenbeck Gøeg",
        "timestamp": 1629804772
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194347\">@Kirstine Rosenbeck Gøeg</span> Give it a try again now and see if it is working better for you.  I reconfigured the default setting, and now when SNOMED CT is queried without specifying an edition/version, the server should (hopefully) choose the 20210731 International Edition as the default.</p>",
        "id": 250473129,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1629805977
    },
    {
        "content": "<p>And thanks for working on getting approval for us to host the Danish Edition - appreciate it!</p>",
        "id": 250473315,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1629806064
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> It is working now with the 20210731 International Edition. Thanks!</p>",
        "id": 250478099,
        "sender_full_name": "Kirstine Rosenbeck Gøeg",
        "timestamp": 1629808788
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> . I have now discussed licensing etc. with the Danish NRC and SNOMED International. The Danish NRC is satisfied with the wording of the international license agreement, and therefore HL7 international may use the Danish extension without further agreements being made. Practically, the HL7 international representative that holds the international license (that would be you Rob?) should log into MLDS (<a href=\"https://mlds.ihtsdotools.org/\">https://mlds.ihtsdotools.org/</a>), and request the Danish extension through the website. The Danish NRC knows that the request is under way, so I expect a swift approval. Will this procedure work for you? <br>\nYou should note that the Danish SNOMED CT extension have Danish descriptions for most concepts, but that the current politic is to only translate new concepts if they are being used in Denmark.</p>",
        "id": 251344918,
        "sender_full_name": "Kirstine Rosenbeck Gøeg",
        "timestamp": 1630395755
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"194347\">@Kirstine Rosenbeck Gøeg</span>  I think this should be able to work, but I have some things to work out with SNOMED International regarding my MLDS account first.  Currently my account isn't in a usable state, as my primary license for SNOMED CT personally is directly through the US NLM, and SNOMED International hasn't approved other access for me through MLDS.  I've just sent an email to SNOMED International to see if they can give me the needed permissions to make this work for the Danish extension, and I'll let you know when and what I hear back from them on that.</p>",
        "id": 251368639,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1630409128
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194347\">@Kirstine Rosenbeck Gøeg</span>  My MLDS account is now fully activated and I've submitted the request for access to the Danish extension content.  We will need to combine the extension with the appropriate version of the full International Edition snapshot (based on the module dependencies) to form a \"Danish edition\" for loading the content on <a href=\"http://tx.fhir.org\">tx.fhir.org</a>.  Sometimes there can be a few issues with that (e.g. if the extension alters some of the International edition content?), but hopefully the process of combining the content will go smoothly.</p>",
        "id": 251471629,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1630449527
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194347\">@Kirstine Rosenbeck Gøeg</span> <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span>   I did get the approval of my MLDS request for the Danish extension a while ago.  But there were some issues with the importing, and as you know the previous attempt at loading the Danish extension content on <a href=\"http://tx.fhir.org\">tx.fhir.org</a> unfortunately for some reason missed including most or all of the Danish content.  But after working out some further issues with the import code, I've now loaded a new version of the SNOMED CT Danish extension - and this one should have all of the Danish descriptions (at least they seem to be there on my spot check).  Please check it out and let me know if you see any further issues.  I did end up finding that it was necessary to exclude the der2_ciRefset_QuantityRefsetSnapshot_DK1000005_20210930.txt file from the import, because presently the import code doesn't recognize the concrete domain 'number' value in that Quantity refset.  I expect that's not really an issue right now, though, as there is only 1 row in that file (I assume it's mostly experimental at this point?).  Eventually we will need to address this, though, as concrete domains become more widely used (beyond only some of the drug extensions).</p>",
        "id": 260615763,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1636347994
    },
    {
        "content": "<p>well - warnings are gone now ;)</p>",
        "id": 260726474,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1636409566
    }
]