[
    {
        "content": "<p>My understanding is that recently, there was a decision to replace the NUCC Taxonomy Code System URL: the published URL is <a href=\"http://nucc.org/provider-taxonomy\">http://nucc.org/provider-taxonomy</a> while the new one is <a href=\"http://www.nucc.org/taxonomy\">http://www.nucc.org/taxonomy</a> and that this change has already been incorporated in the Da Vinci Plan-Net IG. <br>\nHowever, for the new URL, IG Publisher returns an error \"Unable to provide support for code system <a href=\"http://www.nucc.org/taxonomy\">http://www.nucc.org/taxonomy</a>\". I'm wondering whether this is a known issue and whether it's expected to be resolved in a future version of the IG Publisher.</p>",
        "id": 201903426,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1593032591
    },
    {
        "content": "<p>I didn't know about this decision. Who made it?</p>",
        "id": 201912675,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593038615
    },
    {
        "content": "<p>I now that this was implemented in the Da Vinci Plan-Net IG, but I'm not sure who made the decision. <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span>, could you please help with this question?</p>",
        "id": 201913318,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1593039104
    },
    {
        "content": "<p>I also see that this new URL appears on the <a href=\"https://confluence.hl7.org/display/TA/National+Uniform+Claim+Committee+%28NUCC%29+Health+Care+Provider+Taxonomy\">National Uniform Claim Committee (NUCC) Health Care Provider Taxonomy Confluence page</a>. This page was added under the Terminology Authority/External Terminologies page tree on June 12th, so I assume this was approved by the Terminology Authority.</p>",
        "id": 201916673,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1593041747
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span> can you comment about this? HTA just changed something in operation without even telling anyone let alone consulting?</p>",
        "id": 201917871,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593042689
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span>  should be able to shed some light. I can state that this was discussed in the HTA</p>",
        "id": 201918018,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1593042829
    },
    {
        "content": "<p>A request was made for HTA to engage the owners of NUCC for an authoratative URL. <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> worked with them to identify not only an authoratative URL, but the additional guidance provided on the HTA confluence page.</p>",
        "id": 201994829,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1593103873
    },
    {
        "content": "<p>But if there's already an authoritative URL listed in the FHIR spec, HTA shouldn't be soliciting the creation of a new one...</p>",
        "id": 201996977,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593104973
    },
    {
        "content": "<p>how can HTA even consider not engaging with the community on this? I'm going to escalate this</p>",
        "id": 202017041,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593115064
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> what authority has HTA to override a balloted specification? I don't think you do</p>",
        "id": 202017518,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593115292
    },
    {
        "content": "<p>i have no skin in the game here, but if the NUCC decided that they wanted a different URL than what FHIR had created, doesn't that override the specification?</p>",
        "id": 202018439,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593115769
    },
    {
        "content": "<p>maybe it does, but a process where a community working on a balloted specification is neither consulted or informed?</p>",
        "id": 202021700,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593117498
    },
    {
        "content": "<p>HTA is not intending to \"override the balloted specification\". We are engaging external code system owners, as requested by an HL7 community member, for authoritative information, including their officially sanctioned URL. It was our understanding that the IG process is supported by UTG's ability to support the existence of multiple identifiers within namingsystem resources, to support the reality that URLs may need to be updated over time, similar to the change that was made for ICD10PCS. The JIRA request to have this change offically made in UTG, and passed through the commnity notifcation process in UTG, is in the works. However, it is HTAs designated role to be \"responsible for the creation, implementation, and management of HL7 processes involving external terminology management\"</p>",
        "id": 202028945,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1593121359
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> none of this is to my point. You didn't check the existing spec, you didn't consult the community, you didn't inform the community. Are we unreasonable to have a problem with that?</p>",
        "id": 202029700,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593121811
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Are you saying that the owners of the code system (NUCC) don't have the right to publish what they consider the proper URL for their code system because the community has already decided on their own URL?</p>",
        "id": 202029967,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593122002
    },
    {
        "content": "<p>no. Read what I wrote. Please. I'm saying that a decision like that can't be made by an HL7 committee without working with the affected community. Are you saying I'm wrong?</p>",
        "id": 202030117,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593122080
    },
    {
        "content": "<p>I want to confirm Carol's response. HTA has an HL7 board charge to do the work of determining use of external terminologies in HL7 artifacts, specifically to work with the code system authority to determine the canonical url. Given the known situation where HL7 artifacts would have to define \"a canonical url\" before the authority decided to weigh in, we created a situation where a canonical url could, and has, changed. UTG has a process (that still needs a bit of work) to notify the community of these changes and we have chosen to keep track of these changes via NamingSystem and the provenance of the CodeSystem. To our understanding the community does not get to disregard the desires of an external IP owner. What they do need is clear notification and a tooling system that helps them deal with this change.</p>",
        "id": 202030160,
        "sender_full_name": "Robert McClure",
        "timestamp": 1593122109
    },
    {
        "content": "<blockquote>\n<p>you didn't consult the community, you didn't inform the community</p>\n<p>The JIRA request to have this change offically made in UTG, and passed through the commnity notifcation process in UTG, is in the works.</p>\n</blockquote>\n<p>It seems that they are in the process of \"consulting\" and \"informing\" the community.</p>",
        "id": 202030174,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593122121
    },
    {
        "content": "<p>because it's in the works? What?</p>",
        "id": 202030211,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593122146
    },
    {
        "content": "<p>This <em>is not acceptable</em>, and I don't think this is good faith at all</p>",
        "id": 202030278,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593122177
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179252-IG-creation/topic/New.20NUCC.20Taxonomy.20Code.20System.20URL/near/202030117\">said</a>:</p>\n<blockquote>\n<p>no. Read what I wrote. Please. I'm saying that a decision like that can't be made by an HL7 committee without working with the affected community. Are you saying I'm wrong?</p>\n</blockquote>\n<p>Yes,  I am.  Someone followed HL7 process to have the HTA determine if the existing URL was an appropriate URL (given that it resolves to a 404) and the code system owner said \"ooh, no, we want this URL\" and the HTA is following its process to inform the community and affect the change.</p>",
        "id": 202030496,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593122288
    },
    {
        "content": "<p>If the board remit does not include consulting properly with the community, I'll take it up with the board</p>",
        "id": 202030504,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593122292
    },
    {
        "content": "<p>so let me understand - you're upset that they have been given this role or you are upset that their community consultation isn't as fast you you want it to be?</p>",
        "id": 202030607,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593122354
    },
    {
        "content": "<p>I'm not happy that there was no community consultation at all, and that somehow indicating that a process is in the works in the future makes this one ok, when we already had defined a URL, and we were not consulted or informed. And I'm not at all happy that neither you, Carol or Rob even understand why I'm not happy about that</p>",
        "id": 202030753,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593122429
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/New.20NUCC.20Taxonomy.20Code.20System.20URL/near/201996977\">said</a>:</p>\n<blockquote>\n<p>But if there's already an authoritative URL listed in the FHIR spec, HTA shouldn't be soliciting the creation of a new one...</p>\n</blockquote>\n<p>Are you arguing that once a URL is created and listed in the FHIR spec, no matter how wrong it is, the code owners are not allowed to change it if they weren't consulted in the first place?</p>",
        "id": 202030842,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593122476
    },
    {
        "content": "<p>Where did the original NUCC Health Care Provider Taxonomy URL come from?  (the <a href=\"http://www.nucc.org/provider-taxonomy\">http://www.nucc.org/provider-taxonomy</a> one)?  If it came from NUCC originally, then I agree with you and Lloyd.  But it doesn't sound like that is the case.</p>",
        "id": 202031056,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593122587
    },
    {
        "content": "<p>I think I made it up in consultation with the US realm steering committee, I think I recall. So it might well be that it's right to fix it, and at least it is not referenced in US Core.</p>",
        "id": 202032060,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593123159
    },
    {
        "content": "<p>Thanks, that was my first question way earlier today. :)<br>\nSo it appears that we have a case of a Code System URL that HL7/FHIR defined that has ended up not being the official URL that the code system owner desires.  What should be the process for the code system owner in this case?</p>",
        "id": 202032171,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593123243
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> That is my memory of this too - You and <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> did it to get things to run. As we do, as expected, in many places. It just highlights that such things might change in the future. I'll note that Eric also added fake codes to the code system that the NUCC folks are not to pleased about.</p>",
        "id": 202032252,
        "sender_full_name": "Robert McClure",
        "timestamp": 1593123304
    },
    {
        "content": "<p>They should ask HTA to change it. And then HTA should ask the community using it what the impact would be. At least, I think that. But it seems HTA doesn't think so.</p>",
        "id": 202032281,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593123327
    },
    {
        "content": "<p>From my understanding of HTA's purview, they consult the code system owner, find out their desires, and then put this through the UTG Community Change Process.  Is that not happening here?</p>",
        "id": 202032291,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593123338
    },
    {
        "content": "<p>I don't remember fake codes and would not have approved that</p>",
        "id": 202032298,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593123342
    },
    {
        "content": "<p>There is no UTG change process.</p>",
        "id": 202032308,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593123352
    },
    {
        "content": "<p>so either wait for it to be, or consult before making the change</p>",
        "id": 202032365,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593123370
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> is there a special UTG process for breaking changes?</p>",
        "id": 202032404,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593123402
    },
    {
        "content": "<p>Fakes codes are things like base-1  Behavioral Health &amp; Social Service Providers<br>\nAnd again, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> you keep saying things that seem to indicate HL7 can control the canonical identifier of external IP where the owner wants something different.</p>",
        "id": 202032434,
        "sender_full_name": "Robert McClure",
        "timestamp": 1593123430
    },
    {
        "content": "<p>Okay, we have a HTA External Terminology Confluence page that documents the official position of NUCC (the code system owner) and on that confluence page, there is a note that the JIRA UTG process should begin.  Has it actually been changed in UTG?</p>",
        "id": 202032476,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593123466
    },
    {
        "content": "<p>Hence I think we need to improve notification</p>",
        "id": 202032477,
        "sender_full_name": "Robert McClure",
        "timestamp": 1593123466
    },
    {
        "content": "<p><a href=\"https://confluence.hl7.org/display/TA/National+Uniform+Claim+Committee+%28NUCC%29+Health+Care+Provider+Taxonomy\">https://confluence.hl7.org/display/TA/National+Uniform+Claim+Committee+%28NUCC%29+Health+Care+Provider+Taxonomy</a></p>",
        "id": 202032613,
        "sender_full_name": "Robert McClure",
        "timestamp": 1593123533
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179252-IG-creation/topic/New.20NUCC.20Taxonomy.20Code.20System.20URL/near/202032476\">said</a>:</p>\n<blockquote>\n<p>Okay, we have a HTA External Terminology Confluence page that documents the official position of NUCC (the code system owner) and on that confluence page, there is a note that the JIRA UTG process should begin.  Has it actually been changed in UTG?</p>\n</blockquote>\n<p>It doesn't appear to have changed in UTG yet:<br>\n<a href=\"https://terminology.hl7.org/CodeSystem-v3-nuccProviderCodes.html\">https://terminology.hl7.org/CodeSystem-v3-nuccProviderCodes.html</a></p>\n<p>So I'm still unsure what the problem is...HTA has recognized the need for a change and appears to be following their process to make it happen.</p>",
        "id": 202032646,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593123556
    },
    {
        "content": "<p>the problem is that this is a breaking change that they 'decided' on (not in the process of deciding) without once consulting the community that was being broken. Is there any other committee at HL7 that you think can do that?</p>",
        "id": 202032742,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593123625
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179252-IG-creation/topic/New.20NUCC.20Taxonomy.20Code.20System.20URL/near/202032742\">said</a>:</p>\n<blockquote>\n<p>the problem is that this is a breaking change that they 'decided' on (not in the process of deciding) without once consulting the community that was being broken. Is there any other committee at HL7 that you think can do that?</p>\n</blockquote>\n<p>Who is \"they\" in your statement?  NUCC?  HTA?  I'm not seeing the HTA \"deciding\" on anything, but merely reflecting the wishes of NUCC.</p>",
        "id": 202032813,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593123698
    },
    {
        "content": "<p>UTG has <em>not</em> been updated yet because Ted wants it to flow through UTG. The notification from NUCC <em>just</em> happened</p>",
        "id": 202032816,
        "sender_full_name": "Robert McClure",
        "timestamp": 1593123701
    },
    {
        "content": "<p>the right process should be:</p>\n<ul>\n<li>oh, we are discussing changing a URL that is in use already </li>\n<li>let's start by telling everyone who might be using it that we're considering changing it, and finding out what the cost is  (as best as we can communicate with them)</li>\n<li>once we have an estimate of the cost of change, that can discussed with the owner</li>\n<li>then we can tell the community that we did agree to the change, and discuss what the change over process looks like</li>\n</ul>",
        "id": 202032890,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593123750
    },
    {
        "content": "<p>it's not enough to say 'the external authority wanted it to change'. Sorry.</p>",
        "id": 202032915,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593123771
    },
    {
        "content": "<p>I did think that this was in US core and referenced by US legislation. Which should very much have weighed on the discussion, although that appears not the be case (this time)</p>",
        "id": 202032960,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593123813
    },
    {
        "content": "<p>I don't understand why this is not obvious to a terminology authority</p>",
        "id": 202033040,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593123855
    },
    {
        "content": "<p>okay, it appears to me that their process was:<br>\n0) HL7/FHIR makes up a URL for a code system without consulting the external authority<br>\n1) HTA gets asked to verify the URL<br>\n2) HTA consults with the external authority<br>\n3) External Authority indicates that the made-up URL is incorrect and provides a proper URL<br>\n4) HTA documents the proposed change and submits it through the HL7-terminology-change-process</p>",
        "id": 202033103,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593123914
    },
    {
        "content": "<p>Graham, that is like deciding you don't want to tell the owner of the car you stole and use every day to go to work,  that you have it because it would cost you too much to buy a car of your own. I agree we need to fix the process, but we don't get to ignore the wishes of an IP owner</p>",
        "id": 202033112,
        "sender_full_name": "Robert McClure",
        "timestamp": 1593123921
    },
    {
        "content": "<p>I would totally understand the frustration and concern if the existing code system URL had come from NUCC or had been decided in consultation with them.  But since that isn't the case, we have really put the HTA in a \"rock and a hard place\" scenario here.</p>",
        "id": 202033226,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593123990
    },
    {
        "content": "<p>really? It's a rock and a hard place to actually consult? wtf?</p>",
        "id": 202033253,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593124015
    },
    {
        "content": "<p>they are consulting?!??</p>",
        "id": 202033263,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593124023
    },
    {
        "content": "<p>They are following the UTG consultation process.</p>",
        "id": 202033279,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593124036
    },
    {
        "content": "<p>how? they make a decision and we find out by accident and that's \"consulting\"?</p>",
        "id": 202033304,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593124051
    },
    {
        "content": "<p>you do know that it hasn't actually changed yet right??</p>",
        "id": 202033327,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593124070
    },
    {
        "content": "<p>and it's entirely unsatisfactory to say that they are consulting by following a process that doesn't yet exist</p>",
        "id": 202033330,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593124074
    },
    {
        "content": "<p>UTG still has the code system listed with the old made-up URL</p>",
        "id": 202033383,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593124087
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179252-IG-creation/topic/New.20NUCC.20Taxonomy.20Code.20System.20URL/near/202033330\">said</a>:</p>\n<blockquote>\n<p>and it's entirely unsatisfactory to say that they are consulting by following a process that doesn't yet exist</p>\n</blockquote>\n<p>Oh, this is news to me.  I was under the impression that there was a UTG change process that involved community feedback and such.</p>",
        "id": 202033450,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593124133
    },
    {
        "content": "<p>there's going to be. Have you ever seen it at work?</p>",
        "id": 202033468,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593124147
    },
    {
        "content": "<blockquote>\n<p>it hasn't actually changed yet right</p>\n</blockquote>\n<p>That's not what anyone from HTA has said</p>",
        "id": 202033493,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593124170
    },
    {
        "content": "<p>Yes it is.</p>",
        "id": 202033519,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593124186
    },
    {
        "content": "<p>where? WHat they said is 'we changed it, it's final, we announced it our page, you have no grounds for being unhappy'</p>",
        "id": 202033606,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593124219
    },
    {
        "content": "<p>wow, that's ascribing a lot of malice to Carol's original response.</p>",
        "id": 202033646,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593124247
    },
    {
        "content": "<p>what they ACTUALLY said was \"we consulted with the external authority and Rob McClure has documented their desires\"</p>\n<blockquote>\n<p>A request was made for HTA to engage the owners of NUCC for an authoratative URL. @Robert McClure worked with them to identify not only an authoratative URL, but the additional guidance provided on the HTA confluence page.</p>\n</blockquote>\n<p>She also said that they are engaging the UTG change process that involved community feedback.</p>\n<blockquote>\n<p>The JIRA request to have this change offically made in UTG, and passed through the commnity notifcation process in UTG, is in the works. </p>\n</blockquote>",
        "id": 202033792,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593124349
    },
    {
        "content": "<p>so it appears to me, that there is still time to discuss the ramifications of this request from NUCC and to determine the best way forward.</p>",
        "id": 202033850,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593124418
    },
    {
        "content": "<p>HL7 isn't bound to use the URI that the code system authority would like.  It's absolutely a consideration, but it's not the only consideration.  Making the code system authority happy, but costing our developer community hundreds of thousands of dollars (or more) isn't necessarily the best outcome.  HTA assigning a URL where there isn't already one defined is fine.  HTA assigning a URL where one is defined and published by FHIR - irrespective of whether the responsible terminology owner was involved - should <em>only</em> happen with consultation with the HL7 implementer community.</p>",
        "id": 202034126,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593124638
    },
    {
        "content": "<p>If we go <em>way back</em> to Igor's original question, I think it is obviously premature for the Da Vinci Plan Net IGuide to incorporate the new code system URL into their value set definition.  Although NUCC has made that request of HL7, the correct URL is <em>still</em> <a href=\"http://www.nucc.org/provider-taxonomy\">http://www.nucc.org/provider-taxonomy</a> so that would be incorrect on the part of the authors of that Implementation Guide.</p>",
        "id": 202034142,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593124662
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/New.20NUCC.20Taxonomy.20Code.20System.20URL/near/202034126\">said</a>:</p>\n<blockquote>\n<p>HL7 isn't bound to use the URI that the code system authority would like.  It's absolutely a consideration, but it's not the only consideration.  Making the code system authority happy, but costing our developer community hundreds of thousands of dollars (or more) isn't necessarily the best outcome.  HTA assigning a URL where there isn't already one defined is fine.  HTA assigning a URL where one is defined and published by FHIR - irrespective of whether the responsible terminology owner was involved - should <em>only</em> happen with consultation with the HL7 implementer community.</p>\n</blockquote>\n<p>Totally agree with you here!  My argument is that the HTA has not \"assigned a URL\" yet.  It has simply consulted with the code system authority to find out their wishes.</p>",
        "id": 202034212,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593124708
    },
    {
        "content": "<p>That consultation should have been preceded with a consultation with the community though.  It's not a great process to say \"Hey, what URL would you like\" and then to come back and say \"Umm, that URL you'd like is going to cost the community tons of money to change, so we want you to use this one instead\"</p>",
        "id": 202034299,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593124788
    },
    {
        "content": "<p>If there's one that pre-exists, the HTA should: a) find that out before starting the discussion and; b) try to get a sense of how widely used that URI is within existing systems; c) start their conversation with the terminology owner on that basis - generally with a desired outcome of keeping the one that exists, though perhaps setting up a redirect to the location where the data actually exists or updating our documentation for the code system to refer to that URL.</p>",
        "id": 202034428,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593124897
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/New.20NUCC.20Taxonomy.20Code.20System.20URL/near/202034299\">said</a>:</p>\n<blockquote>\n<p>That consultation should have been preceded with a consultation with the community though.  It's not a great process to say \"Hey, what URL would you like\" and then to come back and say \"Umm, that URL you'd like is going to cost the community tons of money to change, so we want you to use this one instead\"</p>\n</blockquote>\n<p>Okay, then we should provide feedback to the HTA accordingly. (I suspect this thread is doing that)</p>\n<p>My problem with what you are saying is that we made up the URL without talking to them in the first place which was why I was asking the question</p>",
        "id": 202034431,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593124899
    },
    {
        "content": "<p>I believe that we tried, but no one at NUCC cared back then.</p>",
        "id": 202034482,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593124928
    },
    {
        "content": "<p>isn't this a similar problem to the ICD-XX code system URL changes?</p>",
        "id": 202034503,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593124957
    },
    {
        "content": "<p>The fact they care now doesn't mean were're in a position where change is possible.</p>",
        "id": 202034506,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593124966
    },
    {
        "content": "<blockquote>\n<p>that's ascribing a lot of malice to Carol's original response</p>\n</blockquote>\n<p>This was pretty upsetting</p>",
        "id": 202034512,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593124976
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> - Do my proposed additional process steps make sense to incorporate into the process going forward?</p>",
        "id": 202034556,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593125027
    },
    {
        "content": "<p>As a side note, resolution isn't a requirement.  SNOMED's URI <em>still</em> doesn't resolve...</p>",
        "id": 202034609,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593125050
    },
    {
        "content": "<p>Your contention is that this is not a decision, it's simply documenting the wishes of the code system owner, and not binding. but I think you're not right. The reference <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> provided above is the HTA formal write up of what they decided. And also they advised the IG author to use. It's evident that it's a binding HTA decision from their pov</p>",
        "id": 202034618,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593125059
    },
    {
        "content": "<p>I see no \"evident\".  I'm again just going by what Carol wrote earlier that implies it was a writeup of what NUCC had conveyed to HL7.</p>\n<p>If they did indeed advise the IG Author to use this new URL, then that is out-of-line.</p>",
        "id": 202034763,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593125227
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> Since the NUCC Health Care Provider Taxonomy is still undergoing the UTG Change process, can the HTA place a disclaimer on that confluence page stating something to the effect that this is what NUCC has proposed and that there is an existing Code System URL and that the UTG process is still being followed?</p>\n<p>That would distinguish this page from the other pages which were documenting valid URLs and such.</p>",
        "id": 202034893,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593125342
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> It seems to me, reviewing the existing HTA External Code System Engagement Process, that steps #4/5 and #9 need some changing.<br>\n#4/5 appear to be about reviewing and confirm the use of the external code system in existing artifacts.  I believe that Lloyd's proposal of adding a community engagement step at this point should be inserted.  You may very well be doing that but being explicit would be good here.<br>\n#9a has the creation of an informational page.  As I just posted, I think that this informational page should have a DRAFT notice/disclaimer that is not made final until after the UTG project completes its change process.</p>",
        "id": 202035176,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593125621
    },
    {
        "content": "<p>Since I just found it, I thought I'd drop this link to the UTG Change Proposal process along with the Consensus Review and Voting piece:<br>\n<a href=\"https://confluence.hl7.org/display/VOC/UTG+Tooling+and+Proposal+Documentation\">https://confluence.hl7.org/display/VOC/UTG+Tooling+and+Proposal+Documentation</a><br>\n<a href=\"https://confluence.hl7.org/display/VOC/Consensus+Review+and+Voting\">https://confluence.hl7.org/display/VOC/Consensus+Review+and+Voting</a></p>",
        "id": 202035422,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1593125776
    },
    {
        "content": "<p>I'll just say here that it news to me, and I suspect to others, that HL7 never intended to support external code system owner requests to use a requested canonical url when that request comes after HL7 has made up their own id. If there is some documentation of valid effort to obtain the desired url from the authority, I suspect that would be important for HTA to see and I would have expected, given the widely announced role of HTA, that they - HTA - would have been notified of such actions \"by the community.\" This street goes both ways methinks. </p>\n<p>As for the Plan-Net folks using the official NUCC url - that is on me. NUCC is pretty concerned about HL7's appropriation of their IP (of additional note, it seems they would like to see the use of NUCC changed within US Core.) But the plan-net change was due to my understanding, that I still think is correct, that the IP owner sets the url. I just assumed you all knew such changes would occur and had planned to support it because this has been discussed <strong>many times</strong> wrt the consequences of making up urls to get things published. Seems we've not completed that discussion.</p>",
        "id": 202036743,
        "sender_full_name": "Robert McClure",
        "timestamp": 1593126960
    },
    {
        "content": "<ul>\n<li>of course we intend to support external owner requests. that has not once been the question here. </li>\n<li>that such changes occur in principle doesn't mean that instances of those changes happen without discussion. </li>\n<li>US core does not use NUCC at this time, I believe. at least, I don't see any reference in it</li>\n<li>how did we appropriate their IP? I'm still concerned about that</li>\n<li>we started using the NUCC URL in 2016. HTA was not paying attention to code system requests then. The process would be very different now</li>\n</ul>",
        "id": 202037819,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593127977
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Careful. If you are justifying your arguments on use of NUCC you better check before yet another pronouncement.</p>",
        "id": 202037983,
        "sender_full_name": "Robert McClure",
        "timestamp": 1593128150
    },
    {
        "content": "<p>well, you're right. I'm wrong about US core, and this increases my concern. I don't know what was wrong with my search. US Core uses NUCC extensively and I rather think it's too late to change it, since it's referenced in regulation.</p>",
        "id": 202038044,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593128199
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> FYI this is a US realm steering committee issue</p>",
        "id": 202038061,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593128225
    },
    {
        "content": "<p>also, I see this:</p>",
        "id": 202038070,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593128230
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/valueset-provider-taxonomy.html\">http://hl7.org/fhir/valueset-provider-taxonomy.html</a></p>",
        "id": 202038081,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593128244
    },
    {
        "content": "<p>what do we need to do about that?</p>",
        "id": 202038088,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593128261
    },
    {
        "content": "<p>If a terminology owner's licensing terms dictate the specific URL that must be used, we're bound to use it - unless we can negotiate other licensing terms.  However, few if any terminology owner's license terms ever assert such a thing.  (Must terminology owners would have no notion that a URI would even be relevant.)  As such, so long as we use the terminology within the bounds of the license terms, HL7 is free to dictate whatever URI it wishes.  It is certainly good practice to seek a URI from the terminology owner, but in cases where one has already been assigned, we need to be careful.  Existing implementations matter - and in at least some cases, they're going to matter more than the preference of the terminology owner.  We have a better process now than we did before, but that doesn't mean that the new process can ignore prior art when doing so negatively impacts the implementer community.  Implementers could care less what process we used to get the URL.  That's not their problem.  But if we change the URL, it is we (HL7) who are creating a tremendous problem.  We shouldn't do that without really good cause - and terminology owner preference doesn't necessarily constitute such.</p>",
        "id": 202041375,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593131209
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179252-IG-creation/topic/New.20NUCC.20Taxonomy.20Code.20System.20URL/near/202034503\">said</a>:</p>\n<blockquote>\n<p>isn't this a similar problem to the ICD-XX code system URL changes?</p>\n</blockquote>\n<p>I think that this discussion will seem like a storm in a teacup in comparison to what might eventuate with ICD-XX  URL changes unless we can agree on a process and some fundamental principles here.</p>",
        "id": 202042216,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1593132076
    },
    {
        "content": "<p>This is a great example of where a conference call or in person discussion would benefit us all -- call me an optimist but I would hope a discussion with an external terminology provider about what the FHIR community is currently using and their future URL would result in a solid compromise.</p>",
        "id": 202047507,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1593139681
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  Did you ask NUCC if they had concerns with us using the current URL?</p>",
        "id": 202047546,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1593139704
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> Not that this will resolve the process issue we've discovered, but yes, I'm asking the NUCC (and AMA) folks if they will allow <a href=\"http://nucc.org/provider-taxonomy\">http://nucc.org/provider-taxonomy</a> to be the canonical url. I'll note they had already expressed they did <em>not</em> want that url, but I've pointed them to this thread and if that doesn't scare them, nothing will.</p>",
        "id": 202125942,
        "sender_full_name": "Robert McClure",
        "timestamp": 1593196508
    },
    {
        "content": "<p>I am not sure the nuance in my question came through -- Did you ask them up front about using the URL and then transitioning to their request in the future?</p>",
        "id": 202127131,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1593197165
    },
    {
        "content": "<p>Let it be known, let it be written...<br>\nNUCC has agreed to <strong>not change the canonical url</strong> and is accepting the canonical url that was crafted by HL7 and is included in <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a> and in the base FHIR servers. That url is <a href=\"http://nucc.org/provider-taxonomy\">http://nucc.org/provider-taxonomy</a>. They note that this \"dashed\" url will not resolve and may never resolve. I have updated the <a href=\"https://confluence.hl7.org/display/TA/National+Uniform+Claim+Committee+%28NUCC%29+Health+Care+Provider+Taxonomy\">HTA NUCC page</a> to indicate this decision. <span class=\"user-mention\" data-user-id=\"231038\">@Gail Kocher</span> was responsible for this approval and will contact <span class=\"user-mention\" data-user-id=\"191393\">@Igor Sirkovich</span> so that he can update the Plan-Net build to use the new-old official url. </p>\n<p>I want to mention that this was done in the spirt of responsiveness that I'd like to assume <em>all</em> FHIR participants will exhibit as we address important issues wrt FHIR terminology. The process that allows IP owners the ability to define the canonical url for content they own does exist and we clearly need to improve how that is conducted. </p>\n<p>I also want to point out that there remain some serious problems with the representation of the NUCC provider taxonomy within the FHIR core that continues to concern NUCC, specifically the addition of made-up codes. NUCC expects those codes to be removed - please see <a href=\"https://jira.hl7.org/browse/FHIR-27023?jql=project%3D%22FHIR%22%20AND%20text~%22provider%20taxonomy%22\">FHIR-27023</a>. We need to resolve this tracker and I'm hopeful this bright shinning light will help that happen.</p>",
        "id": 202147099,
        "sender_full_name": "Robert McClure",
        "timestamp": 1593208521
    },
    {
        "content": "<p>I tend to agree with Brett that this is an issue that needs a meeting to resolve.  While the HTA was created by the BoD, it was not with the intent that the HTA would implement changes that break existing specs and implementations.  I can't believe HTA would knowingly do so either. In the future, there needs to be an impact assessment before such changes are rolled out, and there should have been more dialogue with the affected community.  But it may not be clear to the HTA how best to do that.  So we need more clarity about how to make HTA work more effectively with the FHIR community and WGs in the future.  I don't know who actually talked to whom, but I'd also question whether NUCC would have required this change if they knew it would break existing FHIR specs.   So clearly we need to improve the communication process as well as bring this issue to resolution.   And I just saw Rob's response which at least alleviates the urgency.  But we need to improve the process before it happens again.</p>",
        "id": 202147213,
        "sender_full_name": "Wayne Kubick",
        "timestamp": 1593208578
    },
    {
        "content": "<p>Thanks for the HTA's responsiveness here - and pass on thanks to the NUCC for their understanding as we work through this new process.</p>",
        "id": 202147605,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593208816
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>. I hope that this underlines the need for forward thinking around community engagement.</p>",
        "id": 202152344,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593211790
    },
    {
        "content": "<p>BTW <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> GET on <a href=\"http://snomed.info/sct\">http://snomed.info/sct</a> resolves with a 303 and has done for some time I believe.<br>\nOf course it <em>is</em> a URI and thus should not need to resolve for any tooling to work.</p>",
        "id": 202160647,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1593220884
    },
    {
        "content": "<p>I stand corrected.  Yay!  Agree that it doesn't <em>need</em> to, but it's very nice that it does.</p>",
        "id": 202160966,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593221398
    }
]