[
    {
        "content": "<p>After recent IG Publisher updates (not sure exactly which one) I'm now getting this error in my build:</p>\n<div class=\"codehilite\"><pre><span></span>Initialization complete                                                          (00:01:58.0413sec)\nLoad Content                                                                     (00:01:58.0415sec)\nPublishing Content Failed: Unable to determine type for  E:\\git-repo\\fhir-ips\\examples\\IPS-bundle-01: com.google.gson.JsonPrimitive cannot be cast to com.google.gson.JsonObject (00:02:00.0551sec)\n                                                                                 (00:02:00.0554sec)\nUse -? to get command line help                                                  (00:02:00.0555sec)\n                                                                                 (00:02:00.0556sec)\nStack Dump (for debugging):                                                      (00:02:00.0556sec)\njava.lang.Exception: Unable to determine type for  E:\\git-repo\\fhir-ips\\examples\\IPS-bundle-01: com.google.gson.JsonPrimitive cannot be cast to com.google.gson.JsonObject\n        at org.hl7.fhir.igtools.publisher.Publisher.loadAsElementModel(Publisher.java:2182)\n        at org.hl7.fhir.igtools.publisher.Publisher.load(Publisher.java:1595)\n        at org.hl7.fhir.igtools.publisher.Publisher.createIg(Publisher.java:498)\n        at org.hl7.fhir.igtools.publisher.Publisher.execute(Publisher.java:464)\n        at org.hl7.fhir.igtools.publisher.Publisher.main(Publisher.java:4593)\nCaused by: java.lang.ClassCastException: com.google.gson.JsonPrimitive cannot be cast to com.google.gson.JsonObject\n        at com.google.gson.JsonObject.getAsJsonObject(JsonObject.java:182)\n        at org.hl7.fhir.r4.formats.JsonParser.parseConditionProperties(JsonParser.java:7023)\n        at org.hl7.fhir.r4.formats.JsonParser.parseCondition(JsonParser.java:7010)\n        at org.hl7.fhir.r4.formats.JsonParser.parseResource(JsonParser.java:25035)\n        at org.hl7.fhir.r4.formats.JsonParser.parseBundleBundleEntryComponentProperties(JsonParser.java:3296)\n        at org.hl7.fhir.r4.formats.JsonParser.parseBundleBundleEntryComponent(JsonParser.java:3279)\n        at org.hl7.fhir.r4.formats.JsonParser.parseBundleProperties(JsonParser.java:3252)\n        at org.hl7.fhir.r4.formats.JsonParser.parseBundle(JsonParser.java:3223)\n        at org.hl7.fhir.r4.formats.JsonParser.parseResource(JsonParser.java:25005)\n        at org.hl7.fhir.r4.formats.JsonParserBase.parse(JsonParserBase.java:92)\n        at org.hl7.fhir.r4.formats.ParserBase.parse(ParserBase.java:58)\n        at org.hl7.fhir.r4.elementmodel.ObjectConverter.convert(ObjectConverter.java:90)\n        at org.hl7.fhir.igtools.publisher.Publisher.loadAsElementModel(Publisher.java:2175)\n        ... 4 more\nException in thread &quot;main&quot; java.lang.NullPointerException\n        at org.hl7.fhir.igtools.publisher.Publisher.main(Publisher.java:4603)\n</pre></div>\n\n\n<p>The example file is xml (IPS-bundle-01.xml), not json.  It hasn't been changed, and it was building OK (with some errors) before.  Has anyone seen this or have ideas how to fix it?</p>",
        "id": 153978345,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1532612704
    },
    {
        "content": "<p>I recall another issue in the past where an xml file was attempting to be parsed erroneously as json, but I'll have to look up the details - maybe this is similar.</p>",
        "id": 153978348,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1532613425
    },
    {
        "content": "<p>this is what I get for what's checked in:</p>",
        "id": 153978349,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532613676
    },
    {
        "content": "<p>Exception loading <a href=\"http://hl7.org/fhir/uv/ips/StructureDefinition/deviceusestatement-uv-ips\" target=\"_blank\" title=\"http://hl7.org/fhir/uv/ips/StructureDefinition/deviceusestatement-uv-ips\">http://hl7.org/fhir/uv/ips/StructureDefinition/deviceusestatement-uv-ips</a>: DeviceUseStatement has children for type  in profile deviceusestatement-uv-ips, but can't find type</p>",
        "id": 153978350,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532613677
    },
    {
        "content": "<p>I don't know what that means - will look at it when I wake up</p>",
        "id": 153978351,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532613692
    },
    {
        "content": "<p>thanks - I'll look more in the meantime, too</p>",
        "id": 153978353,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1532613839
    },
    {
        "content": "<p>In the IPS IG build I have multiple (&gt;100) instances of a new error:</p>\n<div class=\"codehilite\"><pre><span></span>Internal error in location for message: &#39;Error in ?? at 1, 1: Found / expecting a token name&#39;, loc = &#39;/Users/rhausam/git-repo/fhir-ips/output/StructureDefinition-Composition-uv-ips.html#/html/head/body/&#39;, err = &#39;The image source &#39;icon_fixed.gif&#39; cannot be resolved&#39;\n</pre></div>\n\n\n<p>I'm not seeing those errors in the LIVD IG, so it doesn't appear to be a universal issue.  In trying to track this down, I'm not finding any mention of icon_fixed (with or without the .gif) anywhere in the source for either the ig or IG Publisher, so I'm not sure where this is coming from or at this point what to do about it.</p>",
        "id": 172318226,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564759856
    },
    {
        "content": "<p>Bryn and I are thinking alike. :)</p>",
        "id": 172318246,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564759871
    },
    {
        "content": "<p>To fix that, for now, I've just added the icon as an image file to propagate.  (check out davinci-pas or pcde)</p>",
        "id": 172318530,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564760052
    },
    {
        "content": "<p>I guess the icon isn't fixed. Chasing these errors is driving me crazy. \"Clean build\" doesn't happen if you use a code from outside an extensible value set. \"Clean build\" doesn't happen if you use a code system that is unsupported. \"Clean build\" doesn't happen because publisher and FHIR bugs (we've got a strange one involving documentreference URI that isn't in our code).</p>",
        "id": 172318533,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1564760055
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 172318612,
        "sender_full_name": "David Pyke",
        "timestamp": 1564760134
    },
    {
        "content": "<p>Thanks, Lloyd.  It would still be good to know where this is coming from (and hopefully fix it there).</p>",
        "id": 172318764,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564760225
    },
    {
        "content": "<p>code systems not supported <em>should</em> be warnings (which you can then suppress).  Agree that the tooling issues are frustrating.  We're continuously working to up the bar and as the tools change, we need to adjust.  The biggest challenge is that it can be hard for most folks to differentiate between \"that's a Grahame problem, I can ignore\" vs. \"that's something I have to fix\".</p>",
        "id": 172318774,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564760237
    },
    {
        "content": "<p>the icon thing is Grahame's new change to improve pattern rendering.  It's the little 'lock' icon he showed before.  (The one I don't like :))</p>",
        "id": 172318806,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564760268
    },
    {
        "content": "<p>And it is also the 23:59:59 hour, and Cinderella's coach is about to become a pumpkin. This is not fair to IG authors.</p>",
        "id": 172318887,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1564760324
    },
    {
        "content": "<p>The URL/id errors are because Grahame is now enforcing a convention for ImplementationGuide ids an canonical URLs that breaks my framework (and in at least one way is itself broken).</p>",
        "id": 172318891,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564760326
    },
    {
        "content": "<p>It has nothing to do with \"fair\".  It has to do with capacity.  Changes get made when there is time to make them.  Sometimes the change is incremental and things are broken in the mean-time.  They'll get fixed.  No one is going to yell at you because of the missing gif.  It's annoying noise right now, but it's not an actual \"problem\" you're responsible for fixing.</p>",
        "id": 172319080,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564760455
    },
    {
        "content": "<p>The id and url stuff is a policy that's been in place for a few months, but it's only now being enforced by the tools (in part because everyone was ignoring the policy).  It's unfortunate that it's manifesting now, but Grahame (and I and others) will work with the relevant authors to help them comply.</p>",
        "id": 172319199,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564760533
    },
    {
        "content": "<p>Well, it sounds as if we might need to relax the deadline? I doubt that all of this will be fixed or approved (or that we will understand if it should be approved or not) for all of us and all of our IGs by Sunday?</p>",
        "id": 172319279,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564760614
    },
    {
        "content": "<p>It is too late. I'm signing off for the weekend and whatever errors are there -- which by the way are NOT affecting the quality  of our IGs -- are just going to have to stay there. Nothing is perfect, but we are close enough to not go through these ridiculous fire drills.</p>",
        "id": 172319288,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1564760635
    },
    {
        "content": "<p>Technically, the errors <em>are</em> affecting the quality of your IGs, albeit in a minor way.  The missing GIF means that all of the snapshot and differential diagrams you have for profiles that include patterns will not render quite right.   The issues about implementation guide id and canonical URL issues mean that your IG won't load properly into the FHIR registry.  However, it's ok for you to sign off.  We'll get it figured out and manually patch if need-be.</p>",
        "id": 172319520,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564760789
    },
    {
        "content": "<p>Thank you, Lloyd. I understand you and Grahame and others are working extremely hard to improve the IG process, and I appreciate it. Excuse my grumpiness. The endless spin cycle of thinking we're done, but then we're not done, and done again, but then  <span class=\"user-mention\" data-user-id=\"193599\">@Lynn Laakso</span> communicates new requirements, so we aren't done, etc... That's the way it feels on this end.</p>",
        "id": 172319956,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1564761125
    },
    {
        "content": "<p>yep, that's how it feels to me too. I am apparently working off a different set of checklists than you. How do I get my checklists incorporated into yours?</p>",
        "id": 172320512,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1564761645
    },
    {
        "content": "<p>I'm on the receiving end too, so I certainly understand.  (I just now how things work from the otherside too).</p>",
        "id": 172326308,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564766581
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193599\">@Lynn Laakso</span> - not quite sure what you mean about different checklists?</p>",
        "id": 172326326,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564766594
    },
    {
        "content": "<p>I'm following the criteria given to me at <a href=\"https://wiki.hl7.org/Process_for_Publishing_a_FHIR_IG\" target=\"_blank\" title=\"https://wiki.hl7.org/Process_for_Publishing_a_FHIR_IG\">https://wiki.hl7.org/Process_for_Publishing_a_FHIR_IG</a> and apparently folks don't know about the correct package id or path  in the package-list.json and where ever else it's meant to go. THe header and footer stuff isn't always right either.</p>",
        "id": 172326578,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1564766814
    },
    {
        "content": "<p>is this something on the agenda for some training material somewhere?</p>",
        "id": 172326608,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1564766848
    },
    {
        "content": "<p>It's all documented in the wiki on how to create IGs, but a lot of IG Authors don't necessarily read (or at least pay much attention) to that stuff.  They only care once the tooling yells at them - which it's now doing.  A bunch of those things are driven by templates.  Unfortunately we haven't (quite) migrated to a place where everyone uses a consistent template, which means that when one IG makes fixes that address the rules, that doesn't necessarily propagate to everyone.  (And a lot of IG authors just copy and paste from other IGs to start.)  I'm one of the main template authors and my IGs are currently broken due to what Grahame began enforcing last night.  I have to make some significant changes to make my stuff work again.  (And some of the rules he's enforcing can only be enforced in the context of HL7 ballot - not everywhere,  and one of them will need to be tweaked.)</p>",
        "id": 172327137,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564767201
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span>  my apologies for the changes turning up so late. You may not believe it but I didn't set out to change the rules; an author preparing an IG for ballot reported an issue which I fixed, which (unexpectedly) fixed an issue somewhere else where rules were not being enforced</p>",
        "id": 172341926,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564779573
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  Apologies accepted. I know you are working hard and in good faith. But I have to say, regarding the ballot process for IGs, it  is a horrendous shit-show of committees, dates, rules, and requirements that is virtually impossible to navigate. Add to that the last-minute changes, and it is just too much. We have excellent resources at MITRE, but HL7  is killing us. Something has to be done to simplify the process.</p>",
        "id": 172343139,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1564780634
    },
    {
        "content": "<p>I agree about the process. We are working on that (have you looked at Wayne's proposal to simplify the approval process?)</p>\n<p>As for the technical process... we are constantly working to improve it. This round of publishing we moved a lot of the publishing quality work that I had just done in the background to the editors, so that I don't have to do the publishing, and we can scale the process. That hasn't been liked. </p>\n<p>We were supposed to have moved to the new HL7 template, which would also have simplified the process a lot, but that missed the boat. Hopefully that'll be sorted out by next time. Otherwise, the IG publisher requires that you dot your i's and cross your ts. I don't apologise for the policy, though I'm constantly trying to make the error messages better</p>",
        "id": 172345021,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564782475
    },
    {
        "content": "<p>having said all that,  I think it would be a worthwhile investment for Mitre to commit your issues to a document and send it to Austin (TSC chair) and Wayne (CTO)</p>",
        "id": 172345480,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564782913
    },
    {
        "content": "<p>Where does one find <span class=\"user-mention\" data-user-id=\"191808\">@Wayne Kubick</span> 's proposal?  I have a proposal of my own, namely, that this become a project-centered process, not a committee-centered process. Each project should present to HL7 with all required authorities present three times: 1) at the outset of the project, 2) intermediate point, 3) when the project is ready to go to ballot. Let the committees come to the project, not the other way around.</p>",
        "id": 172414429,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1564853358
    },
    {
        "content": "<p>I do not know where it is documented. It was presented to co-chairs several times but I don't know where things are now. But we desperately need to do something about it</p>",
        "id": 172421295,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564866269
    },
    {
        "content": "<p>The proposed process that's closest to being rolled out relates primarily to the PSS <a href=\"https://confluence.hl7.org/display/PSS/Business+Model+of+TSC+Project+Task+Force+%28TPTF%29+for+PSS%27s\" target=\"_blank\" title=\"https://confluence.hl7.org/display/PSS/Business+Model+of+TSC+Project+Task+Force+%28TPTF%29+for+PSS%27s\">https://confluence.hl7.org/display/PSS/Business+Model+of+TSC+Project+Task+Force+%28TPTF%29+for+PSS%27s</a> .  Much more needs to be done. I see value in what @Mark Kramer proposes with more of a project0centered focus, but we haven't gotten very far yet.  I'm looking at ways to accelerate getting started on other process improvements before Atlanta.</p>",
        "id": 172703734,
        "sender_full_name": "Wayne Kubick",
        "timestamp": 1565203289
    }
]