[
    {
        "content": "<p>We're looking at supporting more advanced IG configuration in SUSHI -- and part of that may involve using <code>ImplementationGuide</code> as a config rather than <code>package.json</code>.  In <code>package.json</code>, we have something like:</p>\n<div class=\"codehilite\"><pre><span></span>&quot;canonical&quot; : &quot;http://somewhere.org/fhir/uv/myig&quot;,\n</pre></div>\n\n\n<p>This is the canonical <em>root</em> of the IG.</p>\n<p>In the <a href=\"https://github.com/FHIR/sample-ig/blob/master/input/myig.xml\" target=\"_blank\" title=\"https://github.com/FHIR/sample-ig/blob/master/input/myig.xml\">sample-ig ImplementationGuide instance</a>, however, we have:</p>\n<div class=\"codehilite\"><pre><span></span>&lt;url value=&quot;http://somewhere.org/fhir/uv/myig/ImplementationGuide/example.fhir.uv.myig&quot;/&gt;\n</pre></div>\n\n\n<p>This is the canonical URL of the ImplementationGuide instance itself (<em>not</em> the canonical <em>root</em> of the IG).  Is this right?  In the <a href=\"http://build.fhir.org/implementationguide-example.xml.html\" target=\"_blank\" title=\"http://build.fhir.org/implementationguide-example.xml.html\">core FHIR spec example for Implementation Guide</a>, the <code>url</code> is the canonical <em>root</em> (like the one in package.json).  I can't tell if the difference in the sample-ig is intentional or a mistake. </p>\n<p>Either way, we may need to determine the canonical root of the IG from the ImplementationGuide instance in SUSHI, and I'm just trying to figure out if I need to parse it out of the ImplementationGuide url (essentially slicing off the tail end of the path) or if I can rely on the ImplementationGuide url already being the root.  (Maybe to be safe I ought to support both).</p>",
        "id": 188664375,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582223557
    },
    {
        "content": "<p>I agree that we need to have clarity on this.</p>",
        "id": 188666957,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1582225196
    },
    {
        "content": "<p>so the Implementation Guide itself has a canonical URL, and also the ImplementationGuide resource for the iG has a canonical URL. </p>\n<p>The difference between the two is subtle, and painful for the tools, and also important.. </p>\n<p>The IG publisher enforces that the IG resource canonical URL is [canonical]/ImplementationGuide/[package-id]</p>",
        "id": 188673821,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582229999
    }
]