[
    {
        "content": "<p>I see during an IG build a \"onGenerate.plantUml\"... does that mean that the IG build can now convert uml code into diagrams?</p>",
        "id": 203315826,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594238694
    },
    {
        "content": "<p>not in the general case, no. It produces graphical output for example scenarios</p>",
        "id": 203315951,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594238741
    },
    {
        "content": "<p>drat. I have UML in many places.</p>",
        "id": 203316084,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594238800
    },
    {
        "content": "<p>fortunately UML diagrams don't actually change much, so I save the UML source code and manually export svg.  will like that to be included in the build</p>",
        "id": 203316297,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594238894
    },
    {
        "content": "<p>has anyone considered UML diagrams of resource profiles? I realise that some things like slices are hard, but many basic things could be shown well.</p>",
        "id": 203317304,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594239429
    },
    {
        "content": "<p>I have considered converting a profile to excel and running it through a local build to generate a modified UML version of the resource. But there must be a direct way.</p>",
        "id": 203317569,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594239601
    },
    {
        "content": "<p>I haven't done so because of slicing.</p>",
        "id": 203320120,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594240837
    },
    {
        "content": "<p>profiles are not class diagrams, in spite of some people wishing to think about them that way. UML offers either class diagrams or instance diagrams. A profile is a specification for a set of instances of a class model, and UML has never specified anything like that. I did speak to the OMG people about this, but they didn't find it a compelling use case</p>",
        "id": 203320318,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594240934
    },
    {
        "content": "<p>and you'll find that the fhir spec build won't generate what you want either</p>",
        "id": 203320370,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594240965
    },
    {
        "content": "<p>I think if I edited the excel to change the cardinalities, perhaps removing the ones that were 0..0 (and backbone elements I don't need), and added some dummy elements e.g. prefixed with \"Extension-\" clients would like it, and won't care if its not proper UML or not properly inherited.</p>",
        "id": 203322474,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594242030
    },
    {
        "content": "<p>I don't think it matters, but I don't see why it isn't a class diagram. Isn't any class a specification for a set of instances?</p>",
        "id": 203322792,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594242177
    },
    {
        "content": "<p>I would think that there are two things and both can be represented by UML class diagrams.<br>\nWhat you can't do perhaps is show that one is a constraint of the other (by our profile methodology).<br>\nThat is a shame and not totally pure, but maybe it doesn't matter if you get a nice clickable diagram.</p>",
        "id": 203324257,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594242920
    },
    {
        "content": "<blockquote>\n<p>Isn't any class a specification for a set of instances?</p>\n</blockquote>\n<p>perhaps in your intent, but it says additional things that are not true and that will confuse users greatly if they actually understand UML properly</p>",
        "id": 203324857,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594243191
    },
    {
        "content": "<p>Help me understand what is misleading. If I take a resource (a class) and remove (hide) one element, it is a profile. And I could draw that as a UML class diagram pretty easily. How is it wrong? Could it be fixed? It's no longer a DomainResource technically I suppose, and it needs the name changing.<br>\nIf I just sketched the tree view of a profile with some more boxes instead of lines and a more compact notation per element, it would be a UML-like diagram and would fit on one page better sometimes.</p>",
        "id": 203325609,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594243569
    },
    {
        "content": "<p>a UML class diagram is a MOF statement that describes a set of classes with attributes and associations. Instances of the class diagram conform to the class - that is, the instance is of type \"class\". It has only those properties defined by the MOF definition. </p>\n<p>Profiles are not like this. A profile doesn't assign a class to the instance. e.g. xsi:type or whatever. It's a just a set of rules that applies, and it doesn't say anything about things it doesn't mention.</p>",
        "id": 203325886,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594243695
    },
    {
        "content": "<p>it's the assigning a class thing that bites deeply when you are implementing, and mapping from what you see to what you are doing. You mightn't care about that, but misusing UML's MOF declarations will bite other implementers very deeply</p>",
        "id": 203325972,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594243748
    },
    {
        "content": "<p>ok fair enough, but you can still draw a diagram of a profile? After all the tree view is a sort of diagram. We could still generate a set of linked boxes with a compact element notation, that describes the profile. It's just not UML, I don't mind. We can change the shape of the boxes and lines.</p>",
        "id": 203326196,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594243872
    },
    {
        "content": "<p>There is a relationship between the tree of the resource and the tree of the profile. And all the rules of not saying anything about things it doesn't mention do apply. But people don't say, oh I get it it's OO inheritance (rather than design by constraint or whatever). Because it doesn't look like UML so there is no baggage.<br>\nBut if the resource and profile are show looking like UML then people assume the wrong methodology and might go off in the wrong direction. I suppose that is the concern.</p>",
        "id": 203329322,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594245742
    },
    {
        "content": "<p>The intention is that the build process will automatically render plantUML files and allow referencing the resulting SVG files as includes, but it's not working yet.  Hopefully by next week.</p>",
        "id": 203329567,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594245901
    },
    {
        "content": "<p>well, I could consider putting generating diagrams based on the code in the main build on my todo list.</p>",
        "id": 203333550,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594248774
    },
    {
        "content": "<p>my todo list is simple and short ;-)</p>",
        "id": 203333556,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594248780
    },
    {
        "content": "<p>do you mean for profiles?</p>",
        "id": 203333775,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594248951
    },
    {
        "content": "<p>yes</p>",
        "id": 203335174,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594250004
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179252-IG-creation/topic/plantUML/near/203333556\">said</a>:</p>\n<blockquote>\n<p>my todo list is simple and short ;-)</p>\n</blockquote>\n<p>Your todo list - THAT would be an interesting challenge to render as a graph <span aria-label=\"dizzy\" class=\"emoji emoji-1f635\" role=\"img\" title=\"dizzy\">:dizzy:</span></p>",
        "id": 203354544,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594276543
    },
    {
        "content": "<p>How do you graph an infinite value usefully?</p>",
        "id": 203462281,
        "sender_full_name": "David Pyke",
        "timestamp": 1594346517
    },
    {
        "content": "<p>I don't know? google says:  <a href=\"https://www.youtube.com/watch?v=Mkaq3B-TCmg\">https://www.youtube.com/watch?v=Mkaq3B-TCmg</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"Mkaq3B-TCmg\" href=\"https://www.youtube.com/watch?v=Mkaq3B-TCmg\"><img src=\"https://i.ytimg.com/vi/Mkaq3B-TCmg/default.jpg\"></a></div>",
        "id": 203465698,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594351028
    }
]