[
    {
        "content": "<p><a href=\"http://build.fhir.org/documents.html#presentation\" target=\"_blank\" title=\"http://build.fhir.org/documents.html#presentation\">http://build.fhir.org/documents.html#presentation</a> says that documents should be presented as <br>\n    The subject resource Narrative<br>\n    The Composition resource Narrative<br>\n    The section.text Narratives<br>\nIt also says<br>\nThe Composition resource narrative should summarize the important parts of the document header that are required to establish clinical context for the document (other than the subject, which is displayed in its own right). To actually build the combined narrative, simply append all the narrative &lt;div&gt; fragments together. </p>\n<p>The HTML pages generated by the ig publisher do not display example documents this way.<br>\nI want to display example documents in an IG correctly<br>\nCan I edit the Composition.text to include narrative from the subject and the sections?<br>\nShould I leave the Composition.text as described above and edit the HTML for the example page to display the document correctly?</p>",
        "id": 153970916,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1529566674
    },
    {
        "content": "<p>The IGPublisher doesn't have a \"document\" setting when it renders Bundles.  At present, it treats them the same as any other Bundle.  That doesn't have to be the case though.  Can you submit a change request for us to follow the document-rendering rules when producing the \"narrative\" view of a Bundle that declares itself to be a FHIR document?</p>",
        "id": 153970917,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529570379
    },
    {
        "content": "<p>In terms of what to do between now and then, manually editing the generated HTML would be the most correct.  (Understand that it's also the most painful...)</p>",
        "id": 153970918,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529570438
    },
    {
        "content": "<p>Thanks for confirming my fear that the correct method was the most effortful one.</p>\n<p>Issue <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17401\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17401\">#17401</a> created.</p>",
        "id": 153971031,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1529622848
    },
    {
        "content": "<p>On further thought the correct solution would not be to edit the example of Composition, but to generate a new page to show the example document involving the bundle, composition, and other resources.</p>",
        "id": 153971370,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1529840573
    }
]