[
    {
        "content": "<p>To help prioritize the changes to the IG Publisher template, should we have votes? It might help somewhat..<br>\n(For example, <a href=\"https://github.com/HL7/ig-template-base/issues\">https://github.com/HL7/ig-template-base/issues</a> and vote up/down).</p>",
        "id": 232500250,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617139310
    },
    {
        "content": "<p>Only if we expect the people who do the work will be driven by votes...  My near-term drivers will be enhancements/fixes that have been agreed to in ballot dispositions (starting first with IGs I'm on the hook for), stuff that's super easy to do once I'm in there, and things that others who are working to enhance the templates/publisher badger me about because they can't proceed without assistance.  Once that's out of the way, I might be influenced by votes somewhat - but at my current rate, it'll be a while before I get there.</p>",
        "id": 232502105,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617140285
    },
    {
        "content": "<p>Forgot to mention: like all prioritization, the upvotes can help give a sense of what people want, but it's a function of cost/benefit, so easy stuff could go first, then the ones that could unblock other work...</p>",
        "id": 232504939,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617141817
    },
    {
        "content": "<p>(Agile prioritization is not a democratic process <span aria-label=\"smiling devil\" class=\"emoji emoji-1f608\" role=\"img\" title=\"smiling devil\">:smiling_devil:</span> )</p>",
        "id": 232505095,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617141892
    },
    {
        "content": "<p>I have no problem with having people vote - public opinion would certainly have at least some influence over what gets done :)</p>",
        "id": 232512177,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617145999
    }
]