[
    {
        "content": "<p>Is there guidance on how long a Profile name should be?  I vaguely remember guidance about the use of names in code so that it shouldn't be really long, but I couldn't find anything.</p>",
        "id": 224369638,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611857954
    },
    {
        "content": "<p>I typically use Pascal case of id - but they can get pretty long especially if prepend project to them.</p>",
        "id": 224370418,
        "sender_full_name": "Eric Haas",
        "timestamp": 1611858290
    },
    {
        "content": "<p>yeah, I do the same - my names and ids are basically the same.  I've been trying to be semi-descriptive in my names and that is causing some of my Bundle profiles to be pretty long</p>",
        "id": 224370598,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611858375
    },
    {
        "content": "<p>The <a href=\"http://hl7.org/fhir/R4/structuredefinition-definitions.html#StructureDefinition.name\">StructureDefinition.name</a> field says they SHOULD be at most 255 characters, starting with a capital letter, and only containing alphanumeric characters plus underscore.</p>",
        "id": 224370601,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611858376
    },
    {
        "content": "<p>well, that is semi-reasonable.  I've love to see someone name them with 250 characters :)</p>",
        "id": 224370661,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611858406
    },
    {
        "content": "<p>The currently released SUSHI is actually overly zealous about this recommendation and emits an error if you violate that rule.  But the next version of SUSHI demotes it to a warning since it is only a SHOULD.</p>",
        "id": 224370770,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611858467
    },
    {
        "content": "<p>And in SUSHI, if you don't specify an <code>Id</code>, it will use the name but modify it slightly to fit the requirements for <code>id</code> (namely, replace <code>_</code> with <code>-</code>).  Technically, <code>id</code> is supposed to top out at 64 characters though.  I don't remember if SUSHI enforces that or not.</p>",
        "id": 224371119,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611858603
    },
    {
        "content": "<p>WellThatIsSemiReasonableIVeLoveToSeeSomeoneNameThemWith_250Characters  ... yeah its hard to get 255</p>",
        "id": 224371314,
        "sender_full_name": "Eric Haas",
        "timestamp": 1611858676
    },
    {
        "content": "<p>Sushi doesn't enforce the 64 char limit (but it should)</p>",
        "id": 224371393,
        "sender_full_name": "David Pyke",
        "timestamp": 1611858712
    },
    {
        "content": "<p>There are profiles based on the names of lab tests that had to be truncated</p>",
        "id": 224371550,
        "sender_full_name": "David Pyke",
        "timestamp": 1611858771
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> - if SUSHI doesn't enforce it, it's probably because it's not clear how SUSHI should handle it.  Blind truncation seems problematic, especially if there are multiple long names for which the first 64 characters are the same; we don't want to create duplicate ids.  And we also don't want to create ids that misrepresent the idea (imagine a name for which the tail end is \"Negation\"; truncating that off could produce an id with the exact opposite meaning of what is intended!).</p>",
        "id": 224372284,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611859075
    },
    {
        "content": "<p>But SUSHI should probably at least emit a <em>warning</em> if an id is &gt; 64 chars.</p>",
        "id": 224372406,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611859129
    },
    {
        "content": "<p>IT's going to error out in the IG, you should probably just error out and let the dev fix it</p>",
        "id": 224372711,
        "sender_full_name": "David Pyke",
        "timestamp": 1611859257
    },
    {
        "content": "<p>Actually, it looks like SUSHI _does_ truncate it, but also produces a warning about the truncation:</p>\n<div class=\"codehilite\"><pre><span></span><code>Profile: ThisIsAReallyReallyReallyReallyReallyReallyReallyReallyReallyReallyReallyReallyLongName\nParent: Observation\n* code MS\n</code></pre></div>\n<blockquote>\n<p>warn  The string \"ThisIsAReallyReallyReallyReallyReallyReallyReallyReallyReallyReallyReallyReallyLongName\" represents a valid FHIR name but not a valid FHIR id. FHIR ids cannot contain \"_\" and can be at most 64 characters. The id will be exported as \"ThisIsAReallyReallyReallyReallyReallyReallyReallyReallyReallyRea\". Avoid this warning by specifying a valid id directly using the \"Id\" keyword.</p>\n</blockquote>\n<p><a href=\"https://fshschool.org/FSHOnline/#/share/3or4GhH\">https://fshschool.org/FSHOnline/#/share/3or4GhH</a></p>",
        "id": 224373064,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611859436
    },
    {
        "content": "<p>One of these days, I really do have to start using the latest version of sushi</p>",
        "id": 224373192,
        "sender_full_name": "David Pyke",
        "timestamp": 1611859483
    },
    {
        "content": "<p>You normally don't want sushi unless it's fresh sushi.</p>",
        "id": 224379984,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611862174
    }
]