[
    {
        "content": "<p>I'm not sure whether to put this here or the shorthand stream.  I recently migrated my IG to FSH.  I have many <em>xxxprofile-intro.md</em> pages.  With the older format these would be generated into html pages that included anything I had in the .md along with the formal views of the profile.  Now, using FSH, I get two pages generated, one with the intro information without the profile formal views and another with the profiles views without the intro.md info.  My repo is at <a href=\"https://github.com/HL7/cimi-vital-signs\">https://github.com/HL7/cimi-vital-signs</a></p>",
        "id": 268910547,
        "sender_full_name": "Nathan Davis",
        "timestamp": 1642803390
    },
    {
        "content": "<p>this isn't a FSH thing.  This is a new template thing and your intro pages are named incorrectly.  It has to be in the form of:<br>\nStructureDefinition-&lt;ProfileID&gt;-intro.md</p>",
        "id": 268911260,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1642803710
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> I've changed all the intro file names to the format you said and still not seeing the intro combined with the formal profile views.  I know I'm doing something wrong I just can't tell what.</p>",
        "id": 269118067,
        "sender_full_name": "Nathan Davis",
        "timestamp": 1643036670
    },
    {
        "content": "<p>Make sure the file name is the same as the final html name that the IG generates, even to matching the case (it's sensitive that way).</p>",
        "id": 269118706,
        "sender_full_name": "David Pyke",
        "timestamp": 1643036889
    },
    {
        "content": "<p>So if you get StructureDefinition-MyPRofile.html  it has to be StructureDefinition-MyPRofile-intro.md</p>",
        "id": 269118824,
        "sender_full_name": "David Pyke",
        "timestamp": 1643036943
    },
    {
        "content": "<p>I was coming to say exactly what Dave said.  As an example, the ID of your AverageBloodPressure profile is: average-blood-pressure.  Your file is named 'StructureDefinition-AverageBloodPressure-intro.md'.  It needs to use the ProfileID as I listed above and not the Profile name.  So it would be 'StructureDefinition-average-blood-pressure-intro.md'.</p>",
        "id": 269119979,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1643037371
    },
    {
        "content": "<p>Thank you both.  So many things to change when migrating to FSH.  it's now working.</p>",
        "id": 269124787,
        "sender_full_name": "Nathan Davis",
        "timestamp": 1643039290
    },
    {
        "content": "<p>You also explicitly listed all of the intro pages in your sushi-config for some reason.  I removed those changed the name of your intro files and it all worked as desired.  Finally, I found the following things: <br>\nignore-warnings.txt - you have a spelling mistake in the first line so it doesn't think it is the latest format.  Change 'Supressed' to 'Suppressed'.<br>\nsushi-config.yaml - you need to list all of your pages that you want here.  At the minimum, list terminology.md, but all of your other main pages (searchparameters, security, etc.) should be listed here.  Basically either list all of your pages or list none.</p>",
        "id": 269125425,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1643039579
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> Thank you for the help!</p>",
        "id": 269147206,
        "sender_full_name": "Nathan Davis",
        "timestamp": 1643048402
    }
]