[
    {
        "content": "<p>I would like to push out a new release of the HL7 template.  This won't change the base template at all, but will add logic to the HL7 template that will help generate a file for each IG that will drive the Jira drop-downs for that IG - so that each guide will show the artifacts and pages that are relevant for that IG.  I would like this to be committed so it's available for demoing at our Tuesday lunch session.  This will impact all IGs using the HL7 template directly (which should only be UTG I think?) as well as those using the HL7 FHIR, CDA or Da Vinci templates which I would also increment the version on.</p>\n<p>When this upgrade occurs, it's possible that some IGs will cease to build correctly.  The new process relies on certain information being captured correctly in the IG file and in the package-list.json - some of which has not been checked/enforced before.  The specific additional rules are:</p>\n<ul>\n<li>IGs using one of the HL7 templates must have an id of the form hl7.[family].[realm].[id].  This general syntax has been enforced previously, but the new process will enforce that the first part is \"hl7\", the family is \"fhir\" or \"cda\" and the realm is \"us\" or \"uv\".</li>\n<li>The IG must have a contact of type 'url' that starts with \"<a href=\"http://hl7.org/Special/committees/\" target=\"_blank\" title=\"http://hl7.org/Special/committees/\">http://hl7.org/Special/committees/</a>\" followed by the appropriate web code for your work group (whatever is used by the HL7 website).  This is used to identify the responsible work group when generating needed Jira file - which will eventually help in the issue triage process.</li>\n<li>the package-list.json file needs to exist in the root folder and needs to have exactly one package defined with a status of \"ci-build\".  All other packages must have a status that matches one of the values listed on this page: <a href=\"https://confluence.hl7.org/display/FHIR/FHIR+IG+PackageList+doco\" target=\"_blank\" title=\"https://confluence.hl7.org/display/FHIR/FHIR+IG+PackageList+doco\">https://confluence.hl7.org/display/FHIR/FHIR+IG+PackageList+doco</a> (nothing was checking these previously)</li>\n</ul>\n<p>I've tested this update with SDC and it seems to work well.  Please let me know if you have any concerns with this resource being pushed sometime on Monday (auzzie time) or at the latest, first thing on Tuesday so things are ready to demo on Tuesday lunch (and anyone who has issues has a chance to ask about them on Tuesday lunch).<br>\n<span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span></p>",
        "id": 187190195,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580619125
    },
    {
        "content": "<p>(<span class=\"user-mention\" data-user-id=\"191918\">@Sarah Gaunt</span> <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span>)</p>",
        "id": 187190205,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580619147
    },
    {
        "content": "<p>this is not true for a number of IGs:</p>\n<blockquote>\n<p>IGs using one of the HL7 templates must have an id of the form hl7.[family].[realm].[id]</p>\n</blockquote>",
        "id": 187190810,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580620518
    },
    {
        "content": "<p>some are <a href=\"http://hl7.family.id\" target=\"_blank\" title=\"http://hl7.family.id\">hl7.family.id</a></p>",
        "id": 187190816,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580620550
    },
    {
        "content": "<p>*Aussie</p>",
        "id": 187191113,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1580621081
    },
    {
        "content": "<p>I'm fine with it. I just won't re-build BSeR until I've tested/fixed the build locally, or until after TSC approves publication on the current CI Build version.</p>",
        "id": 187191238,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1580621305
    },
    {
        "content": "<p>I'll see if I can get template versioning in place by then</p>",
        "id": 187191520,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580621768
    },
    {
        "content": "<p>Is no realm equivalent to UV?  If so, I can adjust the code to take that into account.  (Though less variability would be nice...). Is there an IG I can test against?</p>",
        "id": 187191753,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580622263
    },
    {
        "content": "<p>no realm pretty much implies UV yes</p>",
        "id": 187192407,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580623608
    },
    {
        "content": "<p>Is there a reason to have two id conventions that convey the same thing?</p>",
        "id": 187199302,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580638175
    },
    {
        "content": "<p>the guides that don't have uv. in the name have those names because they are infrastructural things for which the concept of realm is not applicable - e.g. smart app launch</p>",
        "id": 187200747,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580641024
    },
    {
        "content": "<p>and some testing and internal infrastructure</p>",
        "id": 187200750,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580641036
    },
    {
        "content": "<p>and fhirpath</p>",
        "id": 187200754,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580641040
    },
    {
        "content": "<p>I'd like <span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span> to chime in. I have pinged him on our internal Zulip, but for the moment the new template support is in our Dev environment and I think only Sarah is using it in production. We do plan to move the new template stuff to our production environment on Feb 7 though.</p>",
        "id": 187232617,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1580702044
    },
    {
        "content": "<p>Can you release it as a beta first? Can you create a formal release with a release number and  release notes? Can you allow a time for transition and testing where both the old and new versions are available?</p>",
        "id": 187232819,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1580702422
    },
    {
        "content": "<p>Grahame has added the ability for IGs to point to a specific version if they need to.  I think the general expectation will be for everyone to use the 'current' template, but you can roll back to an earlier one if the new one gives you grief - at least for a little while.</p>",
        "id": 187232878,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580702548
    },
    {
        "content": "<p>if you want to use the existing stable version, append #0.0.2 to the template in your IG. Anything Lloyd commits won't affect you</p>",
        "id": 187233103,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580702972
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> I've modified the UI for editing IGs in ToF to indicate to the user that the packageId is required, to validate the format of the packageId, and to allow the user to enter a working group when the packageId starts with \"hl7\".</p>",
        "id": 187395729,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1580847157
    }
]