[
    {
        "content": "<p>We're planning on building support for required FHIR IG publisher files  (ie Jira Spec, ig.ini, package-list.json, ignore-warning, etc.) into Trifolia on FHIR and storing them as DocumentReferences. We are not aware of any CodeSystem or ValueSet that uniquely define the document types related to the HL7 publishing process for these document types. So, first want to ask if anyone knows if codes do exist. If codes don't exist, thoughts on if these codes would be used/useful to others? Mainly, who should own the provisioning and maintenance of these codes (HL7 or Lantana)? <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 210565908,
        "sender_full_name": "David deRoode",
        "timestamp": 1600457790
    },
    {
        "content": "<p>DocumentReference rather than Binary because you need filename/path information?</p>",
        "id": 210566123,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600457910
    },
    {
        "content": "<p>I don't know of anyone else who would use them right now, but it's not inconceivable that others might want to store all the source as resources, so I guess we could look at defining an internal code system...</p>",
        "id": 210566197,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600457972
    },
    {
        "content": "<p>Makes sense, and agreed. Recommend an agenda for this topic as a next step?</p>",
        "id": 210566895,
        "sender_full_name": "David deRoode",
        "timestamp": 1600458353
    },
    {
        "content": "<p>Sounds good - and perhaps a tracker item.</p>",
        "id": 210569106,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600459466
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> might have a suggestion.</p>",
        "id": 210579221,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1600465804
    },
    {
        "content": "<p>btw, to harp on a common issue... Trifolia <em>should not</em> try to manage package-list.json</p>",
        "id": 210579275,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600465843
    },
    {
        "content": "<p>The DocumentReference.content.format would be an indication of the profile used to constrain the content. There is a vocabulary managed by IHE for the content types defined by IHE. There is a vocabulary managed by HL7 for the content defined by HL7, although this has not yet published. <br>\nThis said, when the document is a FHIR Document; I recommend that the profile of that FHIR Document be used in the DocumentReference.content.format. This is perfectly aligned with the original concept of the IHE FormatCode. So, your IG self defines the code you are looking for, it is the canonical URI of the higest StructureDefinition profile.</p>",
        "id": 210619992,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600528518
    },
    {
        "content": "<p>It is true that this value might also be quickly discovered by looking inside the binary, by exposing it in the metadata (i.e. DocumentReference) it is more readily available for filtering and prioritizing prior to pulling the bits that are the document (Binary) or the bundle.</p>",
        "id": 210620053,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600528619
    },
    {
        "content": "<p>Thanks all. <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>. Agree with your rationale for use of these codes on DocumentReference.content.format. Sounds like a vocabulary might already have been defined (though never published); could you share it so we can check if it covers our ToF scope?</p>",
        "id": 211509539,
        "sender_full_name": "David deRoode",
        "timestamp": 1601307636
    },
    {
        "content": "<p>The managed vocabulary is the one that is pointed to in the FHIR Core DocumentReference for .content.format. This is a joint work of IHE and HL7</p>",
        "id": 211515936,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601310711
    },
    {
        "content": "<p>Wrong thread</p>",
        "id": 211607383,
        "sender_full_name": "Etienne Cantineau",
        "timestamp": 1601378386
    }
]