[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  trying to understand an issue seen with hl7.fhir.au.base build - the Australian Digital Health Agency has a fork of AU Base where they work on changes to be later merged <a href=\"https://github.com/ci-collaborative/au-fhir-base-r4\">https://github.com/ci-collaborative/au-fhir-base-r4</a>  whenever they commit to this repo any dependent IGs referencing current build of hl7.fhir.au.base will fetch package from <a href=\"http://build.fhir.org/ig/ci-collaborative/au-fhir-base-r4/\">http://build.fhir.org/ig/ci-collaborative/au-fhir-base-r4/</a> rather than /ig/hl7au/au-fhir-base - if I build hl7au again then the fetch will be from the right place.  <br>\nDoes the CI build end up using the location of the build to register package; I thought this was controlled by package-list.json ?<br>\nI guess if I get them to change the package id in there fork this could be avoided for now?</p>",
        "id": 211205486,
        "sender_full_name": "Brett Esler",
        "timestamp": 1600992951
    },
    {
        "content": "<p>#current takes the latest version of the master of the latest repo to be built. If you have 2 repos with the same package id / canonical URL, it will take which ever is built latest</p>",
        "id": 211212175,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601000907
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> and <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - mmmm, I'll look at the package id idea</p>",
        "id": 211221779,
        "sender_full_name": "Rob Eastwood",
        "timestamp": 1601014365
    },
    {
        "content": "<p>Following this up earlier today with <span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> to explore this further.</p>\n<p>So, anytime that a repository fork has an update on master, the #current package is updated with the content from the fork rather than that of the \"main\" repository. In our case, we have a good relationship with HL7 AU in order to contribute agreed content via our fork and have strict internal processes in place to never commit our content to master. However, it would would seem possible for me to fork any IG repo, set up the autobuilder and then commit <em>anything</em> to my fork's master; and in so doing, the main repo's package is effectively overwritten by my update. If I have understood this correctly, that is worrying.</p>\n<p>I wonder then, if this is a query for the autobuilder process and how packages are generated; none of which I understand. I will add a ticket on that repo to progress.</p>\n<p><span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> or <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - any thoughts?</p>",
        "id": 211452757,
        "sender_full_name": "Rob Eastwood",
        "timestamp": 1601270268
    },
    {
        "content": "<p>no this only happens on the master of the repo - it's when you have 2 different repos with the same package id</p>",
        "id": 211471992,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601286881
    }
]