[
    {
        "content": "<p>Hello, </p>\n<p>I have a question about the FHIR Structure of ServiceRequest Obect (I hope I'm on the right stream)<br>\nThe requester can actually be <br>\nPractitioner | PractitionerRole | Organization | Patient | RelatedPerson | Device</p>\n<p>My question is Since RelatedPerson is possible, why is not Person possible ?<br>\nI mean what about the Assistant of a Doctor ?<br>\nWe could have as requester the Practitioner or PractitionerRole, and also a Person this person will<br>\ninclude the name of the Dr Assistant that filled the request ?</p>\n<p>I first thought about using related Person, but in Related Person you have to add a link to the patient (It is Mandatory)</p>\n<p>The same remark is valid for <a href=\"http://Composition.author\">Composition.author</a></p>\n<p>Any Idea ?<br>\nBest regards,<br>\nDavid</p>",
        "id": 222840035,
        "sender_full_name": "David Gutknecht",
        "timestamp": 1610705915
    },
    {
        "content": "<p>This stream is more about designing IGs.  This question is about the base standard so <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a> might be a better location.  However, I'll provide an answer here.  Person is <em>never</em> allowed to be referenced as an actor in FHIR.  It's sole purpose is to allow linking identities and maintaining shared demographics for multiple Patient/Practitioner and/or RelatedPerson instances.  Whenever other resources need to point to an individual, they must always point to them as Patient, RelatedPerson or Practitioner.  Assistant of a doctor is a Practitioner.  So is a cab driver or admin clerk.  Practitioner covers anyone who's working in their professional capacity.  RelatedPerson, on the other hand, is someone who is acting in the capacity of their <em>personal</em> relationship with the Patient - relative, friend, neighbor, etc.</p>",
        "id": 222884328,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610728481
    },
    {
        "content": "<p>Thanks a lot for your clear answer !</p>",
        "id": 223129211,
        "sender_full_name": "David Gutknecht",
        "timestamp": 1610981685
    }
]