[
    {
        "content": "<p>The Davinci guides that we just published were full of hard coded references to <a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">build.fhir.org</a>. I don't think we fixed them all. It's illegal to reference <a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">build.fhir.org</a> in a published IG since it has no stable content. Yet authors keep doing it - why? </p>\n<p>I haven't figured out what I can do in the tooling to stop this from happening.</p>",
        "id": 168762718,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561232448
    },
    {
        "content": "<p>some technical background: as long as your dependency version is <code>current</code> you are referencing the current build. When you submit your guide for publishing, you cannot be referencing the current version, you have to reference a specific version.</p>",
        "id": 168762781,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561232536
    },
    {
        "content": "<p>that's problematic for submitting a set of guides where one references another. I don't know what to do about that</p>",
        "id": 168762794,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561232566
    },
    {
        "content": "<p>since this implies that the references will change, there's a way to reference a spec without hardcoding the path. - a jekyll variable {{ xx }} that you use instead of hardcoding the path to an IG. the IG Publisher will process the path to a right reference</p>",
        "id": 168762857,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561232671
    },
    {
        "content": "<p>but because it's processed by jekyll, I don't know whether the output reference to <a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">build.fhir.org</a> was hardcoded or a variable  - so I can't check.</p>",
        "id": 168762862,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561232701
    },
    {
        "content": "<p>the variable is <code>site.data.fhir.[code]</code> where code is the value you assigned to the ig in the ig.json file</p>",
        "id": 168762974,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561232944
    },
    {
        "content": "<p>there are situations where it is valid to reference <a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">build.fhir.org</a>.. namely: 'see xx for the current build' which is seen occasionally in IGs</p>",
        "id": 168763032,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561233013
    }
]