[
    {
        "content": "<p>I've been thinking about a request I received from a ballot comment issue (<a href=\"https://jira.hl7.org/browse/FHIR-29347\">FHIR-29347</a>) - and I wonder if the IG template could automatically build sections for References and External Links in the same way that <a href=\"https://en.wikipedia.org/wiki/Fast_Healthcare_Interoperability_Resources#References\">wikipedia</a> <a href=\"https://en.wikipedia.org/wiki/Fast_Healthcare_Interoperability_Resources#External_links\">does</a>.</p>\n<p>I guess that's assuming wikipedia does this <em>automatically</em> for their pages.</p>\n<p>Perhaps the IG builder could issue warnings if a References section is present and a link is missing from it.  Same for External links.</p>",
        "id": 226152304,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1613144144
    },
    {
        "content": "<p>How would the template recognize something as being a reference - including how would it be detected when content is authored in markdown and when it's authored in HTML?</p>",
        "id": 226153740,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613144748
    },
    {
        "content": "<p>I'm not sure, but I imagine that the url domain could be used to distinguish between internal &amp; external links - and maybe that's good enough to distinguish the two.  I'm honestly not sure if that's how it works in wikipedia, but it seems reasonable at first glance.</p>\n<p>As far as how this would work in the current process - I have no idea.  Just thought I would float this out there for consideration.  I think it could be useful and encourage some good / helpful practices.</p>",
        "id": 226155563,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1613145525
    },
    {
        "content": "<p>So just a summary of every external link (presumably outside of the underlying core spec or dependent IGs)?  What would be the value of having such a table that would just be a list of hyperlinks?</p>",
        "id": 226162667,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613148512
    }
]