[
    {
        "content": "<p>I don't have much experience looking at \"deeply profiled\" content (i.e. profiles that stack on other profiles that stack on other profiles). I'm reviewing <a href=\"https://covid-19-ig.logicahealth.org/StructureDefinition-SARSCoV2wholegenomeSeqPtIsolateNomSequencing.html\">this draft IG from Logica</a> and wondering if the following have been discussed:</p>\n<h3>How to provide the best possible \"Text Summary\"</h3>\n<p>... or else defaulting to something other than \"Text Summary\"</p>\n<p><a href=\"/user_uploads/10155/GHjz3dya71aD4wYTcUBMLkdO/image.png\">Text Summary Example -- Empty</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/GHjz3dya71aD4wYTcUBMLkdO/image.png\" title=\"Text Summary Example -- Empty\"><img src=\"/user_uploads/10155/GHjz3dya71aD4wYTcUBMLkdO/image.png\"></a></div><h3>How to render differentials against a user-specified base</h3>\n<p>... for example here I can see the very tiny differential against \"CodedLaboratoryObservationBase\", but I really want to know what this looks like against the core Observation profile. Following the links up the chain I can piece things together, but I never get  panoptic view...</p>\n<p><a href=\"/user_uploads/10155/W84FWOeuS8tAP8oXuO2221Pl/image.png\">Differential Example -- From Proximal Base</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/W84FWOeuS8tAP8oXuO2221Pl/image.png\" title=\"Differential Example -- From Proximal Base\"><img src=\"/user_uploads/10155/W84FWOeuS8tAP8oXuO2221Pl/image.png\"></a></div>",
        "id": 208115526,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1598459628
    },
    {
        "content": "<p>re the first the default summary view is not that useful IMO and we are planning to poll folks on reordering the views.  I do a lot of custom templating to create a narrative like summary for US core but it does not handle everything I will be making future pr to allow for custom summaries in the templates.  </p>\n<p>re the second I think the must-support view is close to what you are looking for since that aggregates all the profiles constraints vs base</p>",
        "id": 208118661,
        "sender_full_name": "Eric Haas",
        "timestamp": 1598461140
    },
    {
        "content": "<p>I'm not a fan of custom summaries - I think the summary approach needs to be consistent across all IGs.  But I'm very much in favor of changing what the current automated summary produces and also in favor of it not being the default view.</p>",
        "id": 208120171,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598461849
    },
    {
        "content": "<p>+1 for not being the default view</p>",
        "id": 208120219,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598461872
    }
]