[
    {
        "content": "<p>If create profile 'Foo' based on a US-Core Profile would it be possible to create fragments to show the combined differential tree view of <em>Foo + USCore</em> in addition to the Foo differential and Snapshot?  Here is an example wher e that would be helpful... <a href=\"https://argonautproject.github.io/clinicalnotes/StructureDefinition-example-dr.html#sd-1-1formal-views-of-profile-content\" target=\"_blank\" title=\"https://argonautproject.github.io/clinicalnotes/StructureDefinition-example-dr.html#sd-1-1formal-views-of-profile-content\">https://argonautproject.github.io/clinicalnotes/StructureDefinition-example-dr.html#sd-1-1formal-views-of-profile-content</a></p>",
        "id": 153953204,
        "sender_full_name": "Eric Haas",
        "timestamp": 1524154027
    },
    {
        "content": "<p>by possible I really mean would it be really challenging and painful to do this.</p>",
        "id": 153953206,
        "sender_full_name": "Eric Haas",
        "timestamp": 1524154158
    },
    {
        "content": "<p>If I understand correctly, you would like to merge the differential constraints from separate layered profiles, e.g. combine diff constraints from base profile with diff constraints from derived profile?<br>\nMaybe you can use a trick. Suppose profile C constrains profile B, and profile B constraints profile A.<br>\n1) Generate snapshot component for the profile C, derived from profile B<br>\n2) Replace the original differential component with the generated snapshot<br>\n3) Hack the StructureDefinition.base, change from B url to A url<br>\n4) Re-open the hacked profile in Forge<br>\n5) Forge will now recalculate the diff with respect to the new base (A)<br>\n6) In effect, the re-generated diff now contains all merged constraints from profile B &amp; C with respect to profile A.<br>\nNot sure this works, but I think Simone Heckman has also discovered (and used) this hack a while ago.</p>",
        "id": 153953207,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1524154991
    },
    {
        "content": "<p>Yes that is an option  (essentially manually constructing the intermediate diff) .  Its an extra step in publishing two two profiles to show a step wise transition in a single view.    thanks for the tip</p>",
        "id": 153953214,
        "sender_full_name": "Eric Haas",
        "timestamp": 1524155719
    },
    {
        "content": "<p>I'm not sure the IGPublisher has the cyode to calculate the diff - which would be a pre-requisite to doing something like this.  Agree it would be a nice feature, but given how huge a pain calculating snapshots is, not likely something I see happening without sponsorship by a project that wants to pay for it (and even then we'd think twice given the maintenance effort - though hopefully that'll be less once StructureDefinition is normative.</p>",
        "id": 153953227,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524159565
    },
    {
        "content": "<p>I updated the sd.html template for an optional second differential to display.  like Michel described above you have to have to create the fragment with a second profile and manually add the fragment into an autogenerated include file.  Its a total  hack and don't know if its worth it. <a href=\"/user_uploads/10155/5I2f7u18IqjVNo-63qhKA9iK/Screen-Shot-2018-04-19-at-1.41.53-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-04-19-at-1.41.53-PM.png\">Screen-Shot-2018-04-19-at-1.41.53-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/5I2f7u18IqjVNo-63qhKA9iK/Screen-Shot-2018-04-19-at-1.41.53-PM.png\" target=\"_blank\" title=\"Screen-Shot-2018-04-19-at-1.41.53-PM.png\"><img src=\"/user_uploads/10155/5I2f7u18IqjVNo-63qhKA9iK/Screen-Shot-2018-04-19-at-1.41.53-PM.png\"></a></div>",
        "id": 153953300,
        "sender_full_name": "Eric Haas",
        "timestamp": 1524183134
    }
]