[
    {
        "content": "<p>What is the process for requesting new coding systems to be added to the IG publisher referenced terminology server?  We have some standard coding systems, namely WHO's ICD-O-3, that would greatly benefit HL7 Cancer Interoperability CIC-sponsored Breast Cancer Modeling project.  Thanks!</p>",
        "id": 153974916,
        "sender_full_name": "May Terry",
        "timestamp": 1531402400
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 153974931,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531405270
    },
    {
        "content": "<p>I assume that <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> can best answer that, as at least potentially it's somewhat independent of the core FHIR build.  Regarding ICD-O I think it probably makes sense to handle it separately from ICD-9 and ICD-10 which are in the build and documented in the <a href=\"http://build.fhir.org/icd.html\" target=\"_blank\" title=\"http://build.fhir.org/icd.html\">Using ICD-[X] Codes with FHIR   </a> page.  I don't see an existing tracker for ICD-O, so if you want to submit one to add it to the external code systems and add documentation for it, that would be great.</p>",
        "id": 153974932,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1531405328
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> .  I'll review the link and see about filing a tracker for this.  ICD-O breaks down to topography and morphology codes.  The topography codes do have an overlap in codes with ICD-10 for many cancer types but I suppose it could still be considered separate given its specific use for oncology and additional pairing with the morphology codes to make cancer diagnosis meaningful.</p>",
        "id": 153974976,
        "sender_full_name": "May Terry",
        "timestamp": 1531415985
    },
    {
        "content": "<p>where could I get ICD-O from? can you make a CodeSystem resource for it? <span class=\"user-mention\" data-user-id=\"196282\">@May Terry</span></p>",
        "id": 153975316,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531700484
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - I haven't created one before, but I'll figure it out and update it here when I have it.</p>",
        "id": 153975433,
        "sender_full_name": "May Terry",
        "timestamp": 1531745005
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196282\">@May Terry</span> If you have questions or need anything, just ask.</p>",
        "id": 153975574,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1531773882
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  - I was hoping to get just a bit more guidance on Grahame's request for \"making a CodeSystem resource\" for it and taking into account your suggestion to have this separate from ICD-[X].  What would the artifact be?  Would it to be to create an example of the FHIR request and response which includes the URL and/or OID for the ICD-O codes and other supporting metadata, or something else in the form of a template?   Also happy to take this offline on a side private thread or a call.  Thanks!</p>",
        "id": 153975722,
        "sender_full_name": "May Terry",
        "timestamp": 1531828937
    },
    {
        "content": "<p>Sorry for the delayed reply, May.  I was offline for a bit yesterday.  We can have some further offline chat and/or discussion on the Terminology stream to further sort this out and figure out the best approach.</p>",
        "id": 153976074,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1531925831
    }
]