[
    {
        "content": "<p>I just ran into this invariant when publishing logical models:</p>\n<blockquote>\n<p>sdf-1: Element paths must be unique unless the structure is a constraint</p>\n</blockquote>\n<p>The implication here seems to be that logical models (defined as specializations) cannot use slicing (or that they are at least very limited in how they use slicing).  Am I reading that right?</p>",
        "id": 153948216,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1522096190
    },
    {
        "content": "<p>If so, does that mean it's not possible in a logical model to describe something as a list and then put requirements on individual items in that list?  For example, indicating that in a list of codes, the first one must be from a specific code system?</p>",
        "id": 153948218,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1522097019
    },
    {
        "content": "<p>yes. there was a long thread about this about a month back. we decided not to act for now</p>",
        "id": 153948221,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522097948
    },
    {
        "content": "<p>OK.  Thank you for the confirmation.  I'll see if I can find that thread.</p>",
        "id": 153948228,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1522099487
    },
    {
        "content": "<p>FYI for anyone else following... Found it: <a href=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Logical.20Model.20and.20slicing.20for.20terminology\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Logical.20Model.20and.20slicing.20for.20terminology\">https://chat.fhir.org/#narrow/stream/implementers/topic/Logical.20Model.20and.20slicing.20for.20terminology</a></p>",
        "id": 153948229,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1522099680
    },
    {
        "content": "<p>In my case, there is an array (<code>0..*</code>) of <code>Coding</code> and I want to fix the first one to a code.  Since I can't do that with slicing, I was thinking of using a fhirpath <code>constraint</code> (i.e. invariant).  Does that seem a reasonable approach?</p>",
        "id": 153948510,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1522179264
    },
    {
        "content": "<p>yes. though why not simply define what you have in the logical model?</p>",
        "id": 153948511,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522179425
    },
    {
        "content": "<p>I'm not sure how I go about defining what I have in the logical model without duplicate paths (slicing).  For example, if I have:</p>\n<div class=\"codehilite\"><pre><span></span>category    0..*    Coding\n</pre></div>\n\n\n<p>How do I say the first coding should be SNOMED#12345 _without_ creating a slice and duplicate path?  I'd need to make up a new path to contain the fixed Coding (e.g. <code>categoryFixed1</code>) -- but then it's not in the list of categories anymore, so the semantics of category get spread over multiple elements.  Or am I missing something?</p>",
        "id": 153948512,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1522180162
    },
    {
        "content": "<p>This is why a <code>constraint</code> seems the best approach given the limitations.  It allows me to keep a single list of categories while still specifying that the first one must be SNOMED#12345.</p>",
        "id": 153948513,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1522180229
    },
    {
        "content": "<p>no you're not missing anything. that's your present set of choices.</p>",
        "id": 153948514,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522180237
    },
    {
        "content": "<p>OK.  Thanks for the confirmation and talking it through with me.</p>",
        "id": 153948515,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1522180278
    }
]