[
    {
        "content": "<p>Hi there. I've been looking at guidance for FHIR IG balloting, and I'm unclear on what the FHIR QA deadlines mean. Specifically:</p>\n<ul>\n<li>July 21 is the FHIR QA deadline (default without WG/FMG agreement)</li>\n<li>July 28 is the Last FHIR QA deadline (no substantive changes after this point).</li>\n</ul>\n<p>What does actually need to be accomplished by these deadlines?</p>",
        "id": 169506604,
        "sender_full_name": "Rute Martins",
        "timestamp": 1562092156
    },
    {
        "content": "<p>By default, as of the 21, the IG must be totally complete.  It then goes for review by the relevant work group(s) who may identify quality issues with it that can then be fixed.  It might also be reviewed by the FMG who will check that it is \"sufficiently complete to be ready for ballot\" - which for STU means that it looks fully implementable and that there aren't missing pieces.  It's <em>not</em> kosher to have the IG 'mostly' complete and expect to fix outstanding issues during the QA period.</p>\n<p>If the IG author wishes, they can approach the relevant work group(s) and see if they're willing to accept a shorter review period.  The shortest possible review period permitted would be a July 28th start.  If all relevant work groups accept a later date, the QA deadline becomes the earliest of the deadlines the work group(s) accept or July 28th.</p>",
        "id": 169508325,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562093260
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . That helps. We're shooting to have the IG ready for WG review by next week, so we should be well within these parameters. It would be helpful to have some of this explanation along with the date in the HL7 calendar. Something for <span class=\"user-mention\" data-user-id=\"193599\">@Lynn Laakso</span> to consider?</p>",
        "id": 169511119,
        "sender_full_name": "Rute Martins",
        "timestamp": 1562095288
    }
]