[
    {
        "content": "<p>I was doing some more thinking last night about how Simplifier might support \"exporting\" to IG Publisher, and also the ramifications of not doing so.</p>\n<p>Grahame indicated that the markdown flavor use by Simplifier differs from that used by the IGPublisher and that converting would be hard.  However, we don't actually need to convert between markdown flavors.  Converting from markdown to XHTML would be sufficient to publish using the IG Publisher.  So long as the intention is that the source will continue to be maintained within Simplifier, spitting out the more technical XHTML just for publishing should theoretically be ok.</p>\n<p>Also, even if I'm wrong about predicting ongoing significant change to HL7's rendering approach, each of the \"accelerator\" projects is going to want their own template.  IHE will certainly have their own.  Other organizations will also likely have their own.  And it would be nice if all of them could use Simplifier for authoring.  I don't think it's going to be super-feasible for Simplifier to keep up with the rendering preferences of all of those groups though.</p>",
        "id": 176191681,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568985638
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span></p>",
        "id": 176191708,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568985661
    },
    {
        "content": "<blockquote>\n<p>Converting from markdown to XHTML would be sufficient to publish using the IG Publisher. </p>\n</blockquote>\n<p>That's the process we're working on, yes. But it means that you can't switch tool chains. I think that's ok. It does mean that the different tool chains need to meet the requirements, and the requirements need to be documented and governed. that's what we're moving towards</p>",
        "id": 176193552,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568986916
    },
    {
        "content": "<p>Then it would be useful to maintain a clear separation between IG Markdown representation (for authoring) and HTML representation (for publication).</p>",
        "id": 176193812,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1568987076
    },
    {
        "content": "<p>indeed. we are doing that. Markdown+some tool process is just a way to get to publication, and that's where we'll exercise governance</p>",
        "id": 176193868,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568987130
    },
    {
        "content": "<p>Are you planning to perform QA on the (HTML based) publication version?</p>",
        "id": 176193996,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1568987230
    },
    {
        "content": "<p>yes QA will run on the html version propose for publishing</p>",
        "id": 176194307,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568987434
    },
    {
        "content": "<p>OK, clear. Is there any (planned) QA on the narratives? Could be tricky to report back detailed issues detected in the HTML which actually need to be fixed in the markdown, e.g. line numbers. Not a showstopper, more about usability.</p>",
        "id": 176195583,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1568988385
    },
    {
        "content": "<p>qa.html reports html line number, and has a link to the actual element in the page. But yes, it can be very obscure working back from an error in generated html to the source of the problem. but that's the nature of the beast</p>",
        "id": 176195763,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568988534
    },
    {
        "content": "<p>Maybe Simplifier could verify output after rendering markdown to HTML, immediately report back issues to the user. This would allow user to fix basic formatting w/o having to round trip via IG Publisher QA.</p>",
        "id": 176196650,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1568989119
    },
    {
        "content": "<p>well, you could certainly do that for sure. or you could integrate the IG publisher in some kind of batch mode to do that inside simplifier. But the rules fall into 3 categories:</p>\n<ul>\n<li>no broken links</li>\n<li>resource validation </li>\n<li>some specific rules about page structure and content (e.g. publish-box)</li>\n</ul>",
        "id": 176196804,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568989237
    },
    {
        "content": "<p>(and no references to <a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">build.fhir.org</a> unless you are explicitly referencing the current build)</p>",
        "id": 176196871,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568989291
    },
    {
        "content": "<p>the third sort of stuff feels like stuff to leave to the IG publisher, and just do the first 2 in simplifier</p>",
        "id": 176197002,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568989394
    },
    {
        "content": "<p>Sure, that seems feasible.</p>",
        "id": 176197849,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1568989961
    },
    {
        "content": "<p>btw, I was going to review the snapshot stuff last night, but we didn't have the energy - I will work on it this week (I have to)</p>",
        "id": 176197896,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568989994
    },
    {
        "content": "<p>No problem, I understand. WGM's can be exhausting, especially if your name is Grahame. <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span> We can look into SnapGen next week, whenever you are ready.<br>\nTake it easy and safe travels back home!</p>",
        "id": 176198230,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1568990207
    },
    {
        "content": "<p>I'm not sure that markdown conversion limits means that you <em>can't</em> switch tool chains, just that there's a cost.  It means you're either now maintaining XHTML instead of markdown (or need to create/find an engine that can convert XHTML into your particular markdown flavor and perhaps manually tweak the places where conversion was sub-optimal.  Not something you'd want to do daily, but certainly easier than, say, going from JSON profiles to spreasheets.</p>",
        "id": 176198405,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568990304
    },
    {
        "content": "<p>yes a less cost, but still significant</p>",
        "id": 176200043,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568991470
    },
    {
        "content": "<p>What are the different flavors used ?</p>",
        "id": 176248009,
        "sender_full_name": "Eric Haas",
        "timestamp": 1569039267
    },
    {
        "content": "<p>Ig-pub or rather Jekyll is using kramdown.</p>",
        "id": 176248041,
        "sender_full_name": "Eric Haas",
        "timestamp": 1569039354
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Users are no longer tied to the Simplifier team to style changes - they can modify the header/footer/page html and the css in the Enterprise plan. So it wouldn't be much stress on the Simplifier team to maintain that</p>",
        "id": 176449517,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1569319923
    },
    {
        "content": "<p>Simplifier is CommonMark compliant (and extensible, if needed).</p>",
        "id": 176451978,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1569322337
    },
    {
        "content": "<p>It’s not the markdown, it’s the liquid templating</p>",
        "id": 176457790,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1569327697
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> so the issue is that in Simplifier you wouldn't embed things like {{site.data.fhir.path}} in your hyperlinks to the core spec?</p>",
        "id": 176470677,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569336427
    },
    {
        "content": "<p>Simplifier renders (autocompleted and live) tags in the IG like <code>{{tree:project-name/resource-name, snapshot}}</code>:<br>\n<a href=\"/user_uploads/10155/_MS58YGGQC3vsenHBf-ZinO2/Simplifier-IG.png\" target=\"_blank\" title=\"Simplifier-IG.png\">Simplifier-IG.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/_MS58YGGQC3vsenHBf-ZinO2/Simplifier-IG.png\" target=\"_blank\" title=\"Simplifier-IG.png\"><img src=\"/user_uploads/10155/_MS58YGGQC3vsenHBf-ZinO2/Simplifier-IG.png\"></a></div><p>The full list is available via the HELP in the bottom right when editing an IG in your project. (Which is actually an IG itself: <a href=\"https://simplifier.net/guide/simplifierighelp\" target=\"_blank\" title=\"https://simplifier.net/guide/simplifierighelp\">https://simplifier.net/guide/simplifierighelp</a> Inception! ;))</p>",
        "id": 176479574,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1569341562
    },
    {
        "content": "<p>We could of course replace those with corresponding  IG Publisher snippets when clicking the hypothetical <code>Export to HL7 IG Publisher tool</code> button, where available in both.</p>",
        "id": 176479829,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1569341721
    },
    {
        "content": "<p>Yep. Different tags and we can’t use tags like that since Jekyll doesn’t work that way</p>",
        "id": 176495445,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1569351991
    },
    {
        "content": "<p>In Simplifier, links to external documentation is generated based on a definition in the project where the resource comes from.<br>\n<a href=\"/user_uploads/10155/h1aS1-PJtnMKhMDqG3B21fAI/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/h1aS1-PJtnMKhMDqG3B21fAI/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/h1aS1-PJtnMKhMDqG3B21fAI/pasted_image.png\"></a></div>",
        "id": 176560939,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1569416126
    },
    {
        "content": "<p>like this.</p>",
        "id": 176560953,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1569416141
    },
    {
        "content": "<p>My concern is still markdown...</p>\n<p>I use a lot of kramdown extensions and you can mix n match html where needed seemlessly (well almost seemlessly)</p>",
        "id": 176580823,
        "sender_full_name": "Eric Haas",
        "timestamp": 1569428118
    },
    {
        "content": "<p>From what I understand there is a list of requirements of what a ballotable FHIR IG (html output) should look like. For those requirements, the markdown flavour should not matter.</p>\n<p>If there is a separate list of requirements of what the input to the IG-build-tool should look like, then that is a concern for other tools that want to work (chain) with that tool.</p>",
        "id": 176728913,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1569574321
    },
    {
        "content": "<p>for working with the IG publisher, there's a list of requirements for working with the IG publisher. The tool chains won't be interoperable (finding out the gap has been the focus of this thread). None of that relates to publishing requirements</p>",
        "id": 176742287,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1569588536
    },
    {
        "content": "<p>There's the baseline requirements and then there's the question of a consistent look and feel.  I think the latter is going to be important and is going to be hard to manage independently.</p>",
        "id": 176754184,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569596568
    },
    {
        "content": "<p>I understand there are (will be) three types of IGs:</p>\n<ol>\n<li>Balloted IGs, published on <a href=\"http://hl7.org\" target=\"_blank\" title=\"http://hl7.org\">hl7.org</a> or <a href=\"http://fhir.org\" target=\"_blank\" title=\"http://fhir.org\">fhir.org</a>, adhering to all three sections <a href=\"https://wiki.hl7.org/FHIR_Implementation_Guide_Publishing_Requirements\" target=\"_blank\" title=\"https://wiki.hl7.org/FHIR_Implementation_Guide_Publishing_Requirements\">https://wiki.hl7.org/FHIR_Implementation_Guide_Publishing_Requirements</a>.</li>\n<li>FHIR Community Process IGs, adhering to the Basic (I assume) requirements on <a href=\"https://wiki.hl7.org/FHIR_Implementation_Guide_Publishing_Requirements\" target=\"_blank\" title=\"https://wiki.hl7.org/FHIR_Implementation_Guide_Publishing_Requirements\">https://wiki.hl7.org/FHIR_Implementation_Guide_Publishing_Requirements</a> and the Project Output requirements on <a href=\"https://wiki.hl7.org/FHIR_Community_Process\" target=\"_blank\" title=\"https://wiki.hl7.org/FHIR_Community_Process\">https://wiki.hl7.org/FHIR_Community_Process</a></li>\n<li>Other IGs, which document their data model without desire to adhere to the above regulations.</li>\n</ol>\n<p>The third already works well on Simplifier. Regarding the other formulated requirements, I think we could implement each of those to give users a choice in what tools to use, as long as:</p>\n<ul>\n<li>They are no longer a moving target, i.e. the requirements are managed by FHIR-I and have a controlled change process, in which we can be included</li>\n<li>IG Publisher specific wordings are brought back to their underlying functional needs ('the IG must build on the CI build')</li>\n<li>The Product parts of an HL7 IG are either functionally defined or shared as small includable components. We already have support for custom CSS and other formatting options.</li>\n<li>And there are of course requirements in there that the user should check, not the tool (e.g. 'Have a FHIR implementation guide proposal in place')</li>\n</ul>\n<p>Of course it can be that not all requirements HL7 has in mind are currently documented (eg. look and feel requirements like: numbering of headings, required pages, required components on certain pages?). If so these could be considered if they really are essential and if so proposed to be added.</p>",
        "id": 176822602,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1569670179
    },
    {
        "content": "<p>There's the base requirements, but there's also an expectation by users for a consistent look and feel.  Anyone looking at an Argonaut or Da Vinci IG is going to expect the navigation, rendering, etc. to look and behave the same.  That's going to be challenging to keep in sync, particularly given that the look and feel of the HL7 IGs will be updating a fair bit based on feedback now that we have the ability to drive a consistent look &amp; feel.  It's not an issue to run the decisions about changes to look &amp; feel through a review process, but I'd still expect it to iterate fairly rapidly, at least for the next year or so.</p>",
        "id": 176830426,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569684870
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I understand and support your desire for consistent look and feel, it would be great if users using multiple IGs intuitively know where to find something after having used a few. Many of those requirements we should be able to define, separate from the tool used and preferably separate from the specific HTML used, like my examples above:</p>\n<blockquote>\n<p>look and feel requirements like: numbering of headings, required pages, required components on certain pages?<br>\nOn top of the current requirements like what to include in the header and footer.</p>\n</blockquote>\n<p>And if we add more via a controlled change process, with involvement of and time to implement for the tool providers we should be able to keep that in sync, right?</p>",
        "id": 176915607,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1569835389
    },
    {
        "content": "<p>It's certainly theoretically possible to do that, but it's going to be a fair bit of work, at least when we're in a \"frequent iteration\" phase.</p>",
        "id": 176942350,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569856879
    },
    {
        "content": "<p>I'm happy to work with you on that, eg. when the first iteration of the template is brought under change management in a few weeks, to see what consistency requirements we can abstract from that and which parts of the template are not strictly needed for Ballotable and FCP IGs.</p>",
        "id": 176944524,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1569858087
    }
]