[
    {
        "content": "<p>All of our example Questionnaire Responses have a Slicing Information message (in both the Trifolia and the github build):</p>\n<p>This element does not match any known slice defined in the profile <a href=\"http://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-questionnaireresponse\">http://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-questionnaireresponse</a></p>\n<p>For each, the path is:  QuestionnaireResponse.extension[0] (l13/c4)</p>\n<p>For each, the QuestionnaireResponse.extension[0]  is the  workflow-researchStudy extension.<br>\n<a href=\"http://hl7.org/fhir/StructureDefinition/workflow-researchStudy\">http://hl7.org/fhir/StructureDefinition/workflow-researchStudy</a></p>\n<p>Is this an indication of a problem?  If yes, how do we resolve it?</p>",
        "id": 275045278,
        "sender_full_name": "Diane",
        "timestamp": 1647039145
    },
    {
        "content": "<p>There should be an information message that shows you how slicing validation is being evaluated - that usually gives a good hint about why things aren't matching.</p>",
        "id": 275062383,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647041657
    },
    {
        "content": "<p>Good to see that there are more details.</p>\n<p>However, the hints are even more confusing to me:</p>\n<p>This element does not match any known slicedefined_in_the_profilehttp://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-questionnaireresponse<br>\nQuestionnaireResponse.extension[0]: discriminator = true and ('<a href=\"http://hl7.org/fhir/StructureDefinition/questionnaireresponse-signature\">http://hl7.org/fhir/StructureDefinition/questionnaireresponse-signature</a>' in url)<br>\n,<br>\nQuestionnaireResponse.extension[0]: discriminator = true and ('<a href=\"http://hl7.org/fhir/StructureDefinition/questionnaireresponse-completionMode\">http://hl7.org/fhir/StructureDefinition/questionnaireresponse-completionMode</a>' in url)</p>\n<p>Why is the validator checking the <a href=\"http://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-questionnaireresponse\">http://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-questionnaireresponse</a>  profile  for the  workflow-researchStudy   extension?   The workflow-researchStudy is not an SDC extenstion.   It is a Workflow Pattern Extension.      How do I tell the validator to look at   Workflow Pattern Extension  and not limit to SDC?     </p>\n<p>Also,  this error message lists 2 extensions that are not used in any of our IG files:<br>\nquestionnaireresponse-signature<br>\nquestionnaireresponse-completionMode</p>\n<p>I wish these hints were more helpful.</p>",
        "id": 275064649,
        "sender_full_name": "Diane",
        "timestamp": 1647043541
    },
    {
        "content": "<p>What profile are you validating the Questionnaire against?  (It sounds like the validator is checking it against the SDC Questionnaire profile.)</p>",
        "id": 275064966,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647043805
    },
    {
        "content": "<p>The profile listed in the IG for dependencies is SDC.   All of our Questionnaire Responses automatically have a profile element put into the meta element by LHC forms.  The profile that LHC forms adds to the QRs  is the SDC profile.  </p>\n<p>So, I just removed the SDC profile from the QR files and republished, but still the same slicing error.  </p>\n<p>How do I stop the validator from using the SDC profile for the Questionnaire Responses?   Should I add a profile element back to the meta?   What profile to list?</p>",
        "id": 275066924,
        "sender_full_name": "Diane",
        "timestamp": 1647045498
    },
    {
        "content": "<p>You don't have your own profile for Questionnaire?  If you have an expectation that your Questionnaires will include the researchStudy extension, you presumably ought to have a profile that enforces that...</p>",
        "id": 275072568,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647053567
    },
    {
        "content": "<p>As balloted in our IG, usage of the ResearchStudy resource itself is optional. Therefore, we wouldn't want the workflow extension for the workflow-researchStudy to be mandatory.</p>\n<p>We hope some of the larger institutions will want to use the ResearchStudy, Practitioner or other resources, but we don't mandate it. Our Questionnaires/QuestionnaireResponses can be the whole solution.</p>\n<p>I was looking at our balloted version of the IG and it looks like none of them have the workflow-researchStudy extension.</p>\n<p>Since the workflow-researchStudy extension is optional, is it best to remove it from the example QRs?  Our website code adds it to the QRs, but I can remove it from the files.  Since the workflow-researchStudy extension makes this Slicing Information message, maybe that is the solution.</p>\n<p>We don't have a custom sIRB profile.  We only validate against the SDC profile.</p>\n<p>Is the workflow-researchStudy something that must be added to a profile before it can be used?</p>",
        "id": 275079111,
        "sender_full_name": "Diane",
        "timestamp": 1647063767
    },
    {
        "content": "<p>It's not a question of whether it's mandatory - you can make the cardinality what you like.  However, if you want to set an expectation that the extension will be supported (i.e. mustSupport=true), then you need a profile that declares that.  If the extension isn't something that implementers need to support, I'd just strip it from your examples.</p>\n<p>Your profiles should include every single data element you expect the systems involved to support.  If you build on top of the SDC profiles, then anything it says is mustSupport in the profiles you leverage, you also impose on your implementers.  (That might be a good thing or a bad thing, depending on how the SDC profile(s) align with your use-case's requirements.)</p>",
        "id": 275082092,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647068968
    },
    {
        "content": "<p>We will probably just take the workflow-ResearchStudy extension out of the examples. </p>\n<p>Is it possible tell an IG to validate against a union of 2 profiles?    We would want SDC (even though some of the features are not utilized)  plus  the Workflow Pattern  profile  listed at  Profiles defined as part of FHIR:  <a href=\"https://www.hl7.org/fhir/profilelist.html\">https://www.hl7.org/fhir/profilelist.html</a> .</p>",
        "id": 275118678,
        "sender_full_name": "Diane",
        "timestamp": 1647121521
    },
    {
        "content": "<p>The workflow pattern isn't a profile, it's a logical model.  Each example can declare as many profiles as you like, though we generally encourage examples to declare <em>no</em> profiles, as that's the usual expectation for instances in the wild.  (i.e. instances generally shouldn't be expected to declare any profiles).  Within the IG, you can currently assert exactly one profile per example that <em>isn't</em> declared in the example.</p>\n<p>What is your IG enforcing?  What do you demand that implementations must support?</p>",
        "id": 275119906,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647123644
    },
    {
        "content": "<p>Yes. I see now that it is not a true profile.</p>\n<p>It is a little confusing that the page \"Profiles defined as part of FHIR\" at <a href=\"http://hl7.org/fhir/R4/profilelist.html\">http://hl7.org/fhir/R4/profilelist.html</a>  lists \"Workflow Pattern HL7 Extensions\"  and then begins with \"This profile defines extensions that can be used...\".  It makes it appear like all you need to do is declare the Workflow Pattern HL7 Extensions profile.  But, the 3rd column shows that it is type of extensions, so I see that it is not a true profile  vs. EHRS FM Record Lifecycle Event - Provenance  which is labeled in the 3rd column as a profile.</p>",
        "id": 275124493,
        "sender_full_name": "Diane",
        "timestamp": 1647131744
    },
    {
        "content": "<p>We use many of the SDC extensions:</p>\n<p>Enable when expression<br>\nAnswer Expression<br>\nInitial Expression<br>\nCalculated Expression<br>\nLabel for 'open' items<br>\nLaunch Context</p>\n<p>We also use:<br>\nQuestionnaire Launch Context CodeSystem</p>\n<p>We do need to validate against SDC at this point. It would probably have been better to have made a custom profile with only the SDC extensions needed.</p>\n<p>However, if an implementer did not use the LHC-Forms software and wanted to build their own, then an implementer would need to use more of the SDC Capabilities like SDC Form Response Manager, SDC Form Filler and the Populate Questionnaire Operation, I would think.</p>\n<p>If I remove the SDC profile from both the dependencies and from the Questionnaire Response files, then the Slicing Information message goes away.</p>\n<p>BUT...Then I get errors against the Questionnaires about the extensions being invalid.</p>\n<p>AND if I add the SDC profile into the Questionnaires but not in the dependencies, I get a warning message that <br>\nProfile reference '<a href=\"http://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-questionnaireresponse\">http://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-questionnaireresponse</a>' has not been checked because it is unknown, and the validator is set to not fetch unknown profiles</p>\n<p>I am sure you already know all of this, but it is a bunch of trial and error for me.</p>\n<p>Since it appears that a profile for the workflow-ResearchStudy extension that I can add to either the dependencies or the QuestionnaireResponse profile element does not exist, my choices seems to be to create a custom profile or remove the workflow-ResearchStudy extension from the examples QRs.</p>",
        "id": 275124538,
        "sender_full_name": "Diane",
        "timestamp": 1647131766
    },
    {
        "content": "<p>You shouldn't get errors about the extensions being invalid so long as you list SDC as a dependency.  You might get warnings about using extensions that aren't in your IG-specific profile.</p>\n<p>Your IG should have a profile that lists the extensions that <em>you</em> need implementers to support - whether that's a subset or superset of what's in SDC.  If you use <em>any</em> SDC extensions, you need to import SDC.</p>",
        "id": 275125748,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647133768
    }
]