[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <br>\nI have a real problem I wish I did not have to solve, FHIR has a requirement that a vital signs observation must use one of the LOINC magic codes. The problem comes when I have a compound measurement like a blood pressure. The systolic, diastolic values are in Observation.components. However, there are other types of components, such as accuracy, supplemental types, measurementConfidenceLevels, etc. To deal with this I slice on the component using a value  and path pointing to the Observation.component.code. Each slice then binds to a value set, one of them for the compound components. It works.</p>\n<p>However, in the compound case I have Observation.component.code.coding - and if it is a vital signs, I need to have a coding element for the MDC code and a LOINC code. So I tried slicing on the coding. This is effectively a slice on a slice. I was told I can't slice a slice.</p>\n<p>The easy solution is to drop the LOINC requirement. I would like that, but FHIR says no. How can I solve this in the few days left before ballot freeze? w?</p>",
        "id": 154021717,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1543507584
    },
    {
        "content": "<p>sounds like it should be possible. I'll look shortly</p>",
        "id": 154021828,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543525206
    },
    {
        "content": "<blockquote>\n<p>sounds like it should be possible. I'll look shortly</p>\n</blockquote>\n<p>It seems to work but is it legal?</p>",
        "id": 154021884,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1543529317
    },
    {
        "content": "<p>where do i look in the IG to see this?</p>",
        "id": 154021922,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543534225
    },
    {
        "content": "<p>PHD IG: PhdCompoundNumericObservation.xml   (on the component). THe primary slicing is in PhdBaseObservation.xml</p>",
        "id": 154021933,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1543536106
    },
    {
        "content": "<p>Can I slice a slice in the following way? (Applying to Device.property)</p>\n<p>Define a slice discriminated by property.type.coding.system<br>\nThere are two 'base' slices, one using code system A and the other using code system B</p>\n<p>The slice on code system B is further sliced based upon property.valueCode or property.valueQuantity<br>\na set of N codes in system B use property.valueCode and<br>\na set of M codes in system B use property.valueQuantity.</p>\n<p>Alternatively one could write out N+M cases in B sliced on property.type.coding.system</p>\n<p>Not exactly sure how to express this syntactically!</p>",
        "id": 159228097,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1550925959
    }
]