[
    {
        "content": "<p>I have a situation where PHDs send extra information that further describe the measurements. These are placed in components. The code for these cases has a value between  lower&lt;= code &lt;=upper. I call these 'facet' values since they mirror V2 PCD-01 facets of an OBX segment.  However, the PHD may also send what are known as 'compound' measurement such as an acceleration where the compound elements are the x, y, and z values. When this happens, the compound values are also mapped to a component. However, the codes for these components can be anything BUT  a value between lower and upper. However, in both cases the codes come from the same code system.</p>\n<p>I suppose one way to do it is to define a value set containing the just those codes from the MDC system that are used in 'facet' values and then make another value set that have all the other codes in the MDC system and have the 'system' point to the value set. The downside is that I do not think 'system' can reference a value set but just a code system.</p>\n<p>Any other approaches?</p>",
        "id": 153997238,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537101801
    },
    {
        "content": "<p>You can slice by value and declare a value set rather than a fixed value - so long as the valuesets listed don't overlap.</p>",
        "id": 153997241,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537113381
    },
    {
        "content": "<blockquote>\n<p>You can slice by value and declare a value set rather than a fixed value - so long as the valuesets listed don't overlap.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Sounds like a good option, but I do not know how to do that. Would this be using a pattern[x] or am I able to reference a value set in the coding.system element?<br>\nPerhaps slice by value and require a value set binding with the values that are okay?</p>",
        "id": 153997266,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537141103
    },
    {
        "content": "<p>Slice by value on the CodableConcept and specify a different valueset for it for each slice.</p>",
        "id": 153997268,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537142483
    },
    {
        "content": "<p>No need to worry about 'pattern'</p>",
        "id": 153997269,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537142494
    },
    {
        "content": "<blockquote>\n<p>Slice by value on the CodableConcept and \"specify a different valueset for it for each slice\".</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I guess what I am asking on the \"specify a different valueset for it for each slice\", can I do that by fixing the coding.system URL to the value set or do I do it by specifying the binding? They system the values actually come from are a subset of a coding system. I think that what I need to do is still fix the coding .system to the urn for the MDC code system and then set the Binding to the unique value set. The coding.system will be the same fixed value in all slices (in my case) but the binding will be different for each slice. That would be 'slicing by binding' but my criteria are slicing by value. In some sense if I was allowed to set the coding.system=<em>url for value set</em> it would be easier for a reader to determine which 'slice' the entry is. The value set would have the code system being used.</p>",
        "id": 153997297,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537173707
    },
    {
        "content": "<p>Coding.system cannot ever be set to a value set.  It must always point to a system.  To declare a value set, you must use the \"binding\" mechanism.  There's no need to fix the Coding.system if you declare a binding.</p>",
        "id": 153997370,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537195214
    },
    {
        "content": "<blockquote>\n<p>Coding.system cannot ever be set to a value set.  It must always point to a system.  To declare a value set, you must use the \"binding\" mechanism.  There's no need to fix the Coding.system if you declare a binding.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I didnt think that would be okay. In any case, its about what I thought, slicing on binding. In my case the code system will be fixed but the codes are a limited set of that system.</p>",
        "id": 153997387,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537196564
    },
    {
        "content": "<p>Understood.  Generally we don't bother fixing the code system if we have a binding because that makes things easier if the binding subsequently needs to draw from multiple code systems.</p>",
        "id": 153997396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537197947
    }
]