[
    {
        "content": "<p>I think I (and others) have asked this question before, but it's been a while.  Has anyone done this successfully?  And, if so, is there somewhere to point to or share to show the way (best or only) that it can be done?  I've tried on a number of occasions before but haven't gotten quite far enough to be successful.  I keep coming back occasionally thinking that new versions of the validator and IG Publisher may help, but I'm not discovering it so far.  Ideally, I would like to be able to slice Composition.section.entry across the resource boundary, either discriminating on profile or alternatively a fixed value of meta.profile on the entry resource, but any actually working and verifiable example of slicing using resolve() would be great to have a look at.</p>",
        "id": 171915882,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564370952
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>, the validator in the .NET FHIR library does not yet support slicing by profile. However our team is about to start working on this right now.</p>",
        "id": 171928430,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1564390116
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>.  That will be great to have when it's ready.  I assume that it's correct that the use of resolve() shouldn't only be limited to slicing on profile?  I've also tried to make it work with slicing by value on meta.profile of the referenced resource, but so far I haven't been able to get that to work, either.</p>",
        "id": 171948678,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564409497
    },
    {
        "content": "<p>this should work next release</p>",
        "id": 172009546,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564468374
    },
    {
        "content": "<p>and if you want to see an example, look in the validation tests at </p>\n<ul>\n<li>validation-examples\\profile-slicing-profile-open.xml</li>\n<li>validation-examples\\profile-slicing-bad-1.xml</li>\n<li>validation-examples\\profile-slicing-ok-1.xml</li>\n</ul>",
        "id": 172010439,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564469495
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>, <code>resolve()</code> should be supported in all contexts, but in practice I guess it depends on the actual FHIRPath engine implementation. Slicing on the value of <code>meta.profile</code> should be broadly supported by most implementations. However this requires all instances to be tagged correctly, so validation results are only reliable if you can guarantee this.</p>",
        "id": 172016458,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1564475190
    },
    {
        "content": "<p>That's what I thought, <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>.  But I haven't been able to get it to work for properly tagged resources that are referenced in Composition.section.entry.</p>",
        "id": 172037383,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564493245
    },
    {
        "content": "<p>Hmm, the alternative approach should be supported... probably implementation bugs/limitations?</p>",
        "id": 172038825,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1564494427
    },
    {
        "content": "<p>Yes, I'm assuming so (if it's not all user error!).  But I'm not finding it too easy to get a clear idea of what actually is implemented and working.</p>",
        "id": 172039763,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564495120
    },
    {
        "content": "<p>The .NET library/tools should support slicing on the value of <code>meta.profile</code>. Not sure about the Java stack.</p>",
        "id": 172041250,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1564496019
    },
    {
        "content": "<p>Yeah, I'm wondering if the Java stack is behind here.  But that's what we have with IG Publisher.</p>",
        "id": 172042312,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1564496611
    }
]