[
    {
        "content": "<p>Is the assumption correct that only the elements with the flag mustSupport = true are shown in the Snapshot Table (Must Support) and required elements (min = 1) with mustSupport = false are not shown? Has this always been the case or has something changed?</p>",
        "id": 259234099,
        "sender_full_name": "Michaela Ziegler",
        "timestamp": 1635339557
    },
    {
        "content": "<p>That is correct and has always been the case.  There's a proposal to replace the mustSupport page with something different - that includes mandatory elements, modifier elements, elements with invariants not defined in the core resource and other elements of key interest to implementers, however that hasn't happened yet.</p>",
        "id": 259236165,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635340496
    },
    {
        "content": "<p>Thank you very much for the clarification and the comment <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 259239532,
        "sender_full_name": "Michaela Ziegler",
        "timestamp": 1635341875
    },
    {
        "content": "<p>What is the current content of the \"Snapshot Table (Must Support)\" tab? I'm looking at it, and I don't see any elements flagged as MS. Is the view documented anywhere like diff, snapshot, xml, and json are?</p>\n<p>(It also isn't what I expect when I see the phrase \"snapshot table\" -- it needs a better title to convey that it is filtered, key elements from the profile or parents.)</p>",
        "id": 262732737,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1637864818
    },
    {
        "content": "<p>The only elements that show up there (right now) are those that are MS, so the MS flag isn't displayed as it would be redundant.  There's a proposal to shift the view to include other key elements (mandatory elements, modifier elements, etc.).  If we do that, the MS elements would be flagged again.</p>",
        "id": 262761953,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637905463
    },
    {
        "content": "<p>Filtering on flags?</p>",
        "id": 263561149,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1638528213
    }
]