[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  or  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  can I use FHIRPath + liquid directly in the template to generate a pretty summary?  Is FHIRPath enabled in the ig-pub for something like this</p>\n<div class=\"codehilite\"><pre><span></span>{% assign r = [ my current SD] %}\n\n{%  for e in r.differential.element %}\n{% if e.min == 1 %}\nOne {{e.type}} in `{{e.path}}` {% if e.binding %} with a {{e.binding.strength}} binding to [{{e.valuesetReference.display}}]({{e.valuesetReference.reference}}){% end if %}\n{% end if %}\n{% end for %}\n</pre></div>",
        "id": 162067387,
        "sender_full_name": "Eric Haas",
        "timestamp": 1553881041
    },
    {
        "content": "<p>Not to my knowledge...</p>",
        "id": 162067627,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553881195
    },
    {
        "content": "<p>no that's jekyll directly</p>",
        "id": 162075722,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553886676
    },
    {
        "content": "<p>in my plan for this year, we are working on the IG + template changes between now and montreal...</p>",
        "id": 162075747,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553886707
    },
    {
        "content": "<p>what are our plans?</p>",
        "id": 162075752,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553886717
    },
    {
        "content": "<p>My proposal:<br>\n1. You change the IGPublisher to support hitting an Ant build script with the target names we'd agreed on and be able to point at a \"template\" IGPackage - including the ability to merge the properties in the 'template' IG with those from the local IG files<br>\n2. I adapt my framework which is already Ant-driven and is sort of organized based on those steps already to work with the IGPublisher and we iterate until it actually runs<br>\n3. We adapt the template to accomodate capabilities that Eric's framework already has<br>\n4. We open up the template for more general feedback around appearance and capabilities (likely around the WGM)</p>",
        "id": 162076857,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553887650
    },
    {
        "content": "<p>5. We create a sample IG that explains gown to create an IG using the template<br>\n6. We work to get Trifolia and Simplified to be able to publish using the template.<br>\n7. We get John or someone to adapt the template for use with IHE.  (And decide if we should have a more generic template that we and others can adapt from.)<br>\n8. We get everyone to adjust their IGs to use the template prior to ballot.<br>\nIn #3 we should be checking that Forge profiling will work..( <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> I presume there's no interest from Firely in support for pure Forge- authored IGS in step 6?)</p>\n<p>At some point in there (probably 3 or 4) we also need to rejig the IG publisher and template to support multi- version IGs.</p>",
        "id": 162126615,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553961455
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>?</p>",
        "id": 162128147,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553963555
    },
    {
        "content": "<p>I'd like to talk about the authoring experience. </p>\n<ul>\n<li>examples in \\examples</li>\n<li>other resources in \\resources</li>\n<li>pages in \\pages</li>\n</ul>",
        "id": 162169362,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554030308
    },
    {
        "content": "<p>no need to register them anywhere.... that just happens through the template logic and/or the IG publsher logic</p>",
        "id": 162169410,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554030367
    },
    {
        "content": "<p>pages as .md or .html (how are html pages templated?)</p>",
        "id": 162169414,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554030396
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> is the logical person to work in the IHE template. Question is whether IHE wants extra facilities around actors, or whether that should also be part of the HL7 template</p>",
        "id": 162169428,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554030442
    },
    {
        "content": "<p>Firely are certainly interested in Simplifier managed IGs, but I don't know whether they'll be interested in the template. OTOH, <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> I will probably up the requirements for HL7 published guides to look indistinguishable from the template (not sure how I'd express that)</p>",
        "id": 162169481,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554030528
    },
    {
        "content": "<p>I think storing and managing glossaries and actors definitions are two needs from IHE that would benefit other adopters. The lifecycle for those may be more evolved in IHE - we may end up with requirements for reusing /refining actors and transactions across domains, and maintaining those over time, so that in 2025 people can still be compatible with the 2019 version...</p>",
        "id": 162174804,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554039082
    },
    {
        "content": "<p>for the folders, some ideas:<br>\n<a href=\"/user_uploads/10155/K7tME-SAFovGHio9ahUjF99o/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/K7tME-SAFovGHio9ahUjF99o/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/K7tME-SAFovGHio9ahUjF99o/pasted_image.png\"></a></div>",
        "id": 162175392,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554039921
    },
    {
        "content": "<ul>\n<li>distinguish \"test data\" (which can be used to automate testing) from \"examples\" (that we just put there to help in documentation)?</li>\n</ul>",
        "id": 162175473,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554039993
    },
    {
        "content": "<ul>\n<li>publisher stuff separated from the content source and output. E.g. the src-generated folder may be in all profiles I am authoring, but I don't need to have several igpublisher jars.</li>\n</ul>",
        "id": 162175543,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554040085
    },
    {
        "content": "<ul>\n<li>can output be also a bit more structured? besides some folders for images and the likes, we could also have our css, js, etc in another folder so that we only have them once in an IHE site</li>\n</ul>",
        "id": 162175624,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554040243
    },
    {
        "content": "<p>Assuming this is up to date  <a href=\"http://wiki.hl7.org/index.php?title=FHIR_IG_publisher_templates\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_IG_publisher_templates\">http://wiki.hl7.org/index.php?title=FHIR_IG_publisher_templates</a> , we can play a bit with some aspects of the template:<br>\nlook and feel (e.g using jekyll themes) is to be done by IHE. What pages an editor can / must author, that may also be dictated (in part).</p>",
        "id": 162175858,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554040589
    },
    {
        "content": "<p>Content wise, WYSIWYG editing is essential for non-techies. An experience like Windows Live Writer makes sense - you can edit the content itself within these lines, how it looks depends on other factors.</p>",
        "id": 162175968,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554040747
    },
    {
        "content": "<p>Anyway I don't know if .md or .xhtml makes a big difference. <br>\nFrom any of those we can do what we need (e.g. diff'ing and showing difference in text between 2 versions) ( theres's a tool that shows that but i forgot the name).</p>",
        "id": 162176116,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554041031
    },
    {
        "content": "<p>Tech editing will also bring some challenges - e.g. in a given edition of a profile we may include a new constraint, or 2 new supported use cases... we should find a way to track that. But I don't yet have insight on that - Not sure if this is in the realm of managing \"what's new\" or \"requirements\".</p>",
        "id": 162176264,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554041219
    },
    {
        "content": "<p>If you dump everything in resources, that should work.  But you should also be able to split stuff between resources, structures and vocabulary (there's good reasons to want those files separately).  And if you're driving multiple IGs from one project or you've got source files you don't necessarily want in your IG yet, you'll need to register the files in the IG.  You'll also need to register the files in the IG if you want control over what packages exist and what's in each package.  However, the names and descriptions should come across automatically.</p>",
        "id": 162177378,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554042728
    },
    {
        "content": "<p>You'll have to register your pages as that's the only way to determine titles and hierarchy.</p>",
        "id": 162177395,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554042770
    },
    {
        "content": "<p>Pages will have to support md and html (because either Eric or I will throw a screaming fit if our favorite isn't permitted and there are people who will want both kinds)</p>",
        "id": 162177407,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554042811
    },
    {
        "content": "<p>I would hope that Simplifier would be capable of exporting to allow the use of templates - if not, they'll find themselves not useable for HL7 balloted content, IHE balloted content or that of anyone else who wants tight look-and-feel of their IGs.  After a while, that's going to take a good chunk out of their market...  (The look &amp; feel of evey type of template will evolve over time and I'm pretty sure HL7 is going to mandate consistent look &amp; feel across all our IGs - which means they're all going to have to publish using the same template.)</p>",
        "id": 162177541,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554042992
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> We could have a 'testing' folder.  Disagree about not needing several igpublisher.jars.  You may well find that you want to publish some IGs with one version of the publisher and others with a different one for some reason.  The template itself could be shared (via the NPM cache), but not sure about the publisher</p>",
        "id": 162177617,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554043153
    },
    {
        "content": "<p>I'd really like 'output' to be renamed 'website' because it's logical to have the stuff produced at the end of the directory structure, not in the middle.</p>",
        "id": 162177630,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554043200
    },
    {
        "content": "<p>output being structured is a pia because you then have to worry about relative folders for everything which dramatically complicates your folders.</p>",
        "id": 162177680,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554043232
    },
    {
        "content": "<p>WYSIWYG is an authoring tool problem, not a publisher problem.</p>",
        "id": 162177688,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554043263
    },
    {
        "content": "<p>As a side note - every time I've had to use markdown, I've had to embed a bunch of funky markdown escapes and commands to make it work right, which to me means that it's not significantly less complicated to learn than XHTML, with the downside that there's no schema or built-in validation when authoring,  and worse, the markdown we author the pages in is different the markdown we author the attribute descriptions in, so it doesn't work exactly the same.</p>",
        "id": 162177770,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554043387
    },
    {
        "content": "<blockquote>\n<p>You'll have to register your pages as that's the only way to determine titles and hierarchy.</p>\n</blockquote>\n<p>That would be for the authoring toolset (to create an IG including page structure) (unless i miss the topic)</p>",
        "id": 162178582,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554044751
    },
    {
        "content": "<blockquote>\n<p>Pages will have to support md and html (because either Eric or I will throw a screaming fit if our favorite isn't permitted and there are people who will want both kinds)</p>\n</blockquote>\n<p>agree with both formats (just because they should be convertible)</p>",
        "id": 162178647,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554044823
    },
    {
        "content": "<blockquote>\n<p>Disagree about not needing several igpublisher.jars.  You may well find that you want to publish some IGs with one version of the publisher and others with a different one for some reason.  The template itself could be shared (via the NPM cache), but not sure about the publisher</p>\n</blockquote>\n<p>You may need to have several igpublishers, but IMO you don't want to be forced to. I think when building we should be able to point to the IG Publisher, instead of letting it \"whatever you find under this folder\"</p>",
        "id": 162178714,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554044938
    },
    {
        "content": "<p>There might or might not be an authoring toolset.  Assuming no tool, the user will have to hand-author their ImplementationGuide instance, which will need to include references to the pages (and describe their titles and hierarchies).  If authoring tools take on this function, great.</p>",
        "id": 162178817,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554045101
    },
    {
        "content": "<p>md and XHTML will <em>not</em> be convertable.  (At least I can't begin to imagine trying to turn XHTML into markdown).  Jekyll handles turning the markdown into XHTML.</p>",
        "id": 162178870,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554045140
    },
    {
        "content": "<blockquote>\n<p>output being structured is a pia because you then have to worry about relative folders for everything which dramatically complicates your folders.</p>\n</blockquote>\n<p>what structure? The authored .pngs, htmls...? or the .css and .js that come with the framework? For the latter, would still be nice to configure where they are found (e.g. i could say  ../../styles) and then all my profiles can reuse those.</p>",
        "id": 162178872,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554045155
    },
    {
        "content": "<p>I don't see a huge problem in multiple igpublishers, other than the download time if you don't have the current one.</p>",
        "id": 162178887,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554045185
    },
    {
        "content": "<p>The styles from the template will be inside the template.  IG authors won't see those - or generally be able to fiddle with them.</p>",
        "id": 162178895,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554045232
    },
    {
        "content": "<p>In the output folder, their location won't be configurable and content will generally be pretty flat.</p>",
        "id": 162178942,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554045251
    },
    {
        "content": "<p>Multiple IGs are not a huge problem, but I don't see big advantages. I'd separate the machine, the input and the output. Makes it more manageable. It's minor (but I did some scripting to fix that on my end, so it was inconvenient).</p>",
        "id": 162179085,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554045504
    },
    {
        "content": "<p>My concern is that the folder that defines an IG should be self-contained.  It shouldn't touch anything outside its folder other than the NPM cache.  Doing that causes too much risk of accidentally messing things up</p>",
        "id": 162179174,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554045620
    },
    {
        "content": "<p>I guess for md and html I guess my preference is: as long as a user can do something that somehow ends in either or both, we are good.<br>\nPandoc supports both outputs, but I haven'd played with it enough to see how good it looks.</p>",
        "id": 162179175,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554045620
    },
    {
        "content": "<p>It won't <em>end</em> in md ever.  The publication will have to be html.</p>",
        "id": 162179190,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554045661
    },
    {
        "content": "<p>ok, so it is just about if we want to have the publisher accepting md as well? I don't have a preference.<br>\nAt this moment I have Word editing and Pandoc converting to xhtml, so anything should be manageable.</p>",
        "id": 162179287,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554045799
    },
    {
        "content": "<p>Yes.  Question is what can serve as input.  And realistically, we'll need both.</p>",
        "id": 162179337,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554045861
    },
    {
        "content": "<p>makes sense.</p>",
        "id": 162179441,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554046076
    },
    {
        "content": "<p>Oh, and one more requirement that IHE and similars may have: National extensions. Things like translations - of glossaries, of actor names, etc. <br>\nHere's a hypothetical: When IHE Belgium wants to publish some stuff, this may require up to 4 languages (EN+NL+FR+DE).</p>",
        "id": 162179567,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554046259
    },
    {
        "content": "<p>I suspect support for multi-language IGs will not be a \"before next ballot\" sort of change.  That's going to require some significant thought and infrastructure.</p>",
        "id": 162179880,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554046775
    },
    {
        "content": "<p>yes. It is a requirement, definitely not a priority.</p>",
        "id": 162180088,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554047062
    },
    {
        "content": "<p>there is some structure for multi-language IGs but it won't be in this round, that's certainly correct</p>",
        "id": 162191341,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554065203
    },
    {
        "content": "<p>md and html will both be supported.</p>",
        "id": 162191342,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554065210
    },
    {
        "content": "<p>we will continue with the arrangement as is: one IG per github repository.</p>",
        "id": 162191356,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554065275
    },
    {
        "content": "<p>I don't want to rename output to website. Lloyd's desire to have a particular order in the folders does not justify the changes to tooling, documentation and bookmarks that this would cause</p>",
        "id": 162191410,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554065331
    },
    {
        "content": "<p>All the css etc should be in the template; the IG should contain only content - resources and pages</p>",
        "id": 162191420,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554065362
    },
    {
        "content": "<blockquote>\n<p>you should also be able to split stuff between resources, structures and vocabulary (there's good reasons to want those files separately)</p>\n</blockquote>\n<p>What are those?</p>",
        "id": 162191492,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554065468
    },
    {
        "content": "<blockquote>\n<p>if you're driving multiple IGs from one project or you've got source files you don't necessarily want in your IG yet, you'll need to register the files in the IG</p>\n</blockquote>\n<p>Neither seem like a good to force people to register all their resources</p>",
        "id": 162191543,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554065529
    },
    {
        "content": "<p>The people responsible for vocabulary, resources and other stuff are often different people.  Forge likes having all the resources in one place but isn't going to recognize the other stuff.  When you start getting large numbers of artifacts (into the hundreds), it's a lot easier if everything isn't all stuck in one folder.  (And yes, I have IGs that have that volume of artifacts).</p>",
        "id": 162194200,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554069909
    },
    {
        "content": "<p>I'm not suggesting the people will have to register their resources - if they want all of them, they'll get all by default.  But if they <em>don't</em> want all of them, they'll have the option of registering them to choose what they want and/or to choose what packages they'll appear in.</p>",
        "id": 162194252,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554069974
    },
    {
        "content": "<p>I.e. if your IG doesn't list any resources, the build will look to find all the candidates and group them in packages based on criteria we decide and will publish all of them.  If your IG does list resources, we'll use the packages you define and include the resources you reference and nothing else.</p>",
        "id": 162194279,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554070057
    },
    {
        "content": "<p>If you dump all of your resources in \"resources\", that'll work.  If you split them between \"resources\", \"structures\" and \"vocabulary\", that'll still work.</p>",
        "id": 162194329,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554070101
    },
    {
        "content": "<p>ok where are we documenting this stuff ?</p>",
        "id": 162194344,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554070145
    },
    {
        "content": "<p>Where do you want it?</p>",
        "id": 162194402,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554070227
    },
    {
        "content": "<p>Eric and I had a Google doc we took a stab at a good while back?</p>",
        "id": 162194408,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554070244
    },
    {
        "content": "<p>I'm happy to work it up there as long as it migrates to the HL7 wiki once it's mature</p>",
        "id": 162194476,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554070361
    },
    {
        "content": "<p>My desire is that the final documentation actually be in a FHIR IG that uses the template to document itself.</p>",
        "id": 162194557,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554070546
    },
    {
        "content": "<p>hah well ok. if you want to do it that way...</p>",
        "id": 162194608,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554070592
    },
    {
        "content": "<p>That sort of forces it to be kept up-to-date as the publisher evolves and provides a concrete example of everything that's being done.</p>",
        "id": 162194609,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554070594
    },
    {
        "content": "<p>In terms of output, I don't understand there being any changes to bookmarks - unless you bookmark your local output?  All the documentation is changing anyhow, so don't much care about that.  In the tooling, it <em>should</em> just be a change of a constant in the publisher and in the CI build process.  I think it's at least worth evaluating the level of effort before rejecting it out-of-hand.</p>",
        "id": 162195002,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554071186
    },
    {
        "content": "<p>lots of people have booked marked their local outputs</p>",
        "id": 162195098,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554071378
    },
    {
        "content": "<p>the IG publisher has nothing hard coded about output. The CI build does. And lots of my batch files for publishing does</p>",
        "id": 162195154,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554071416
    },
    {
        "content": "<p>On glossary definitions, I prefer that any profile author can create (propose) new terms or changes to terms.</p>",
        "id": 162208729,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554093828
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Not sure what this is referring to or what it has to do w/ IG publication</p>",
        "id": 162208798,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554093916
    },
    {
        "content": "<p>I agree that people responsible for those and other resources may be different but an editor needs to define actors, glossary terms, etc - all of them. I see no interest if we aim at e.g. separate ig for glossary</p>",
        "id": 162208876,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554094051
    },
    {
        "content": "<p>Artifacts can only live in one place.  If you're maintaining a glossary (as a web page or something), that glossary can only exist in one IG.  You can link to it from any IG you like (if you declare the owning IG as a dependency), but you can't edit a definition defined in one IG within another IG.</p>",
        "id": 162209333,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554094724
    },
    {
        "content": "<p>It was an interpretation of your above statement \"people responsible for vocabulary.. are different people\" - possibly confusion from my side.</p>",
        "id": 162209337,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554094741
    },
    {
        "content": "<blockquote>\n<p>Artifacts can only live in one place.  If you're maintaining a glossary (as a web page or something), that glossary can only exist in one IG.  You can link to it from any IG you like (if you declare the owning IG as a dependency), but you can't edit a definition defined in one IG within another IG.</p>\n</blockquote>\n<p>Hmmm. I will draw up the glossary management workflow. Key point is - say there is an IHE glossary, which is the set of \"approved\" entries that people from many domains have proposed</p>",
        "id": 162209410,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554094849
    },
    {
        "content": "<p>So anyone can propose such a thing, it then has to go for approvals. But this will be common requirement - imo an IG will not only be approved as a whole, but the artefacts within will be reviewed and approved</p>",
        "id": 162209470,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554094927
    },
    {
        "content": "<p>This question is not about how to use the IG for editing. This is more about making sure that any editing can then be used in a process with more or less collaboration, more or less gateways...</p>",
        "id": 162209489,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554095014
    },
    {
        "content": "<p>We just need to enable that (with simple things like status and keeping glossary terms and actors as resources)</p>",
        "id": 162209562,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554095113
    },
    {
        "content": "<p>terminology = code system, value set , concept map</p>",
        "id": 162209704,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554095299
    },
    {
        "content": "<p>Yes, and we need a glossary (where things like \"dispense\" have a clear definition. Should be a valueset</p>",
        "id": 162209938,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554095730
    },
    {
        "content": "<p>The feedback process is separate from the development/publication process.  People won't make proposals by submitting edits to the source (unless they're making Git pull requests - and in HL7 those still need to be accompanied by a tracker item).</p>",
        "id": 162209943,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554095741
    },
    {
        "content": "<p>ValueSet is for formally defined codes intended for computation.  Seems like overkill to use such an artifact just to maintain a list of defined terms for human use.  Why not just a page of markdown?</p>",
        "id": 162210009,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554095779
    },
    {
        "content": "<p>(or better yet, HTML :))</p>",
        "id": 162210011,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554095786
    },
    {
        "content": "<p>Use case: as an IHE profile editor, I want to reuse the term \"patient\" in my profile, but I want to define \"dispense\" which is not defined in the IHE common glossary. So I add a resources for that, status =draft. If all goes well, after a few gates, the profile is published and the term \"dispense\" becomes part of the approved glossary for IHE so that others can use it.</p>",
        "id": 162210037,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554095878
    },
    {
        "content": "<p>Why not just submit a change request to the main glossary and define the term as you need in your own in a supplemental glossary page for as long as needed.  Why bother creating an artifact?</p>",
        "id": 162210300,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554096282
    },
    {
        "content": "<p>(Sorry for rabbit hole, back to topic). A few weeks ago we(IHE) discussed working on IHE specific requirements. will put them somewhere.</p>",
        "id": 162210323,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554096315
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> &amp; <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> can we discuss the proposed improvements of the IG template during a WGM session? We like to update the Simplifier template to comply to the new, updated guidelines. I don't think this will affect Forge. (<span class=\"user-mention\" data-user-id=\"191335\">@Martijn Harthoorn</span>)</p>",
        "id": 162229108,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1554117747
    },
    {
        "content": "<p>sure we can do that</p>",
        "id": 162230981,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554119693
    },
    {
        "content": "<p>but most of the big decisions will be made by then</p>",
        "id": 162230995,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554119705
    },
    {
        "content": "<blockquote>\n<p>I would hope that Simplifier would be capable of exporting to allow the use of templates - if not, they'll find themselves not useable for HL7 balloted content, IHE balloted content or that of anyone else who wants tight look-and-feel of their IGs.  After a while, that's going to take a good chunk out of their market...  (The look &amp; feel of evey type of template will evolve over time and I'm pretty sure HL7 is going to mandate consistent look &amp; feel across all our IGs - which means they're all going to have to publish using the same template.)</p>\n</blockquote>",
        "id": 162233874,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1554121989
    },
    {
        "content": "<p>I am not so much worried about our chunk in the market. But I am concerned about general usability.</p>",
        "id": 162233900,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1554122029
    },
    {
        "content": "<p>It is unclear to me which part of this proces is part of the FHIR standard.</p>",
        "id": 162233953,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1554122046
    },
    {
        "content": "<p>And how much is part of a request of HL7 to have other tools produce imput compatible with their tools</p>",
        "id": 162233972,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1554122073
    },
    {
        "content": "<p>I would love to advice our users and customers create ballotable IG's. But currently I wouldn't know how to provide them with a clear and predictable strategic advice.</p>",
        "id": 162234140,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1554122221
    },
    {
        "content": "<p>that's an ongoing discussion we should continue at Montreal. The template is 2 things - a publishing convenience and a fixed look and feel for the IGs. The first part is not important for Simplifier. The second part will be required for anything published through HL7, but meeting that look and feel won't necessarily require actually using the template</p>",
        "id": 162235825,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554123405
    },
    {
        "content": "<p>Just inserting myself into the conversation to note that we publish IGs at MITRE using our CIMPL tooling -- and I'm all for simplification of publishing via easier to use templates.  We already make it as simple as possible for our users, but that just makes our own code a bit more complicated -- and speaking from experience, it did take me a while to get that all working correctly.  So if we can lower the barrier for others, I think that would be a good thing.  And I'll gladly replace my code with a better and easier template. ;-)</p>",
        "id": 162236628,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1554124018
    },
    {
        "content": "<p>My suspicion is that meeting the look and feel without using the template - especially as the look and feel evolves over the next few years - will be challenging.</p>",
        "id": 162242018,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554127696
    },
    {
        "content": "<p>Note that <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> has the lead on use of the HL7 IG publisher for IHE. I am just the co-pilot.</p>",
        "id": 162244856,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554129668
    },
    {
        "content": "<p>I have to digest what Lloyd outlined above before I can chime in here.    I  think that the fixed look and feel that GG mentions is important but equally important  is on making it easier publish without being an expert in html, jekyll, liquid , json or xml, or (your  programming language here).  Still too may knobs and switches and we need start limiting the options.</p>",
        "id": 162284585,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554157265
    },
    {
        "content": "<p>So long as the default options are easy, I'm not sure we need to limit things too much.  We can't stop people from authoring instances in the syntax they're most comfortable with, so XML or JSON will always be there - though I'm hoping we can find a way to let them embed references to examples in their text so that they don't have to mess around with escaping unvalidatable JSON or XML inline.  Similarly, we can't avoid the need for some level of liquid tags to get the directories right.  But hopefully we can limit the need to know too much more.</p>",
        "id": 162298701,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554173621
    },
    {
        "content": "<p>OK so I finally tried your ig pub framework and I struggled to convert my test ig over to it.  It requires the manual  creation of an Implementation guide resource.  I don't think that is an author friendly approach.    I think the Implementation guide resource input needs to be  a UI form or excel driven. ( I  generated the ig.json and ig.xml from a csv and slurp up the fhir artifacts from the folders)</p>\n<p>We are in agreement the file tree needs to be fixed and prescribed, I think it should evolve so it drives the ig menu and page structure.  (Which I think will make GG unhappy)    I.e it should align with Jekyll. ( but need watch out for messing up the includes)<br>\nI think the layouts ( layouts ~= templates ) are the easiest thing about this.  Pretty straight forward obviously is a matter of taste and Obvously I like mine better  :-) ...but once we decide on layouts they hopefully can be ordered up like a menu item.   As far as authoring in md or html that should be slurped up from the folder/ file name so its in the background. ( same with the xml,json, xls for fhir artifacts), I wonder if Chris has done all of this already? </p>\n<p>I'm pretty neutral on the ant thing.   I'm not clear why it needs to be part of the ig-pub.</p>",
        "id": 162300886,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554176921
    },
    {
        "content": "<p>On layouts: I would like to experiment with themes, so that people can have different look and feel or just print-friendly templates.</p>",
        "id": 162301927,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554178384
    },
    {
        "content": "<p>Going forward, the ImplementationGuide resource is the bit that will <em>have</em> to be created.  There won't be any JSON files anymore.  Everything will be done through the ImplementationGuide (though much of the 'hard' stuff will be imported from an ImplementationGuide in the template).</p>",
        "id": 162343084,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554217214
    },
    {
        "content": "<p>I think the menu and the table of contents should be independent.  They're different navigational frameworks and there's good reasons for them to work differently.  The menu often needs to have links to external specs.  The TOC won't.</p>",
        "id": 162343168,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554217267
    },
    {
        "content": "<p>The UI for IG authoring is out of scope.  If you use a tool like Trifolia, it should take care of it for you.  If we want to come up with a way to author IGs using a spreadsheet, we can, though not sure how enthused Grahame will be about that.  (We do need to add the spreadsheet re-writing thing into the IGPublisher for structure definitions at least so they work better with Git).</p>",
        "id": 162343400,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554217395
    },
    {
        "content": "<p>Personally, I don't think hand-authoring IGs is so bad.  We already expect hand-authoring of examples, so familiarity with XML or JSON is essentially mandatory if you're creating IGs anyhow.</p>",
        "id": 162343478,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554217441
    },
    {
        "content": "<p>I'm fine with some experimentation with layouts, so long as we land on a standard layout that's used by all the HL7 IGs.  Certainly additional templates will be needed for those that want PDFs or something.  I don't think HL7-published IGs should cater to that.</p>",
        "id": 162343844,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554217627
    },
    {
        "content": "<p>Ant is a pretty natural mechanism for dependency-based file processing that can happen in stages which is what we agreed the IGPublisher templates needed to allow - to perform file processing at different stages of the publishing process.</p>",
        "id": 162343962,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554217684
    },
    {
        "content": "<p>I think that authoring the ImplementationGuide, CapabilityStatement and Structuredefs are off putting for ig authors and hard without tooling.  External tooling already exists for SDs, and is needed for Capstatements, but I think ImplementationGuide tooling needs to be part and parcel to the ig pub process an a ui form/( or excel)  for ease of Authoring.   I do it before calling the ig-pub using bash.      I'm not sure why the ant script needs to be part of the the ig-pub.   I can see calling it multiple times in a single script but I don't really care either way.</p>\n<p>To be precise the ImpGuide template is different template from the Jekyll layouts/templates. </p>\n<p>I don't know why the file tree can't mimic the menu and TOC  and I don't  think external links should be menu items .   This is an example of limiting the options to make it simpler and more uniform.</p>",
        "id": 162351322,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554222800
    },
    {
        "content": "<p>Tooling would be great, but it's a separate thing from the template process.</p>",
        "id": 162356743,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554226697
    },
    {
        "content": "<p>I don't want simpler/more uniform that's less useful to the target audience.  The external links in CRD are quite important and having an easy way to get to them all the time is needed.  Menu and TOC are both navigation tools.  Having them say exactly the same thing means that you're not really getting the benefit you should.</p>",
        "id": 162356823,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554226795
    },
    {
        "content": "<p>infrastructure and template are far more important than tooling for the editors. That tooling should be encouraged an happen, but should not be mandate.</p>",
        "id": 162356948,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554226868
    },
    {
        "content": "<p>The reality is that creating implementation guides is always going to require a degree of technical chops for at least one of the people involved in the process.  You're going to be creating instance examples.  You're going to be dealing with commandline tools that sometimes spit out cryptic errors.  You're going to be dealing with Git.</p>",
        "id": 162356975,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554226894
    },
    {
        "content": "<p>I agree with Lloyd that the editors today can handle simple xhtml, xml, and json. We should not be afraid of those.</p>",
        "id": 162356988,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554226903
    },
    {
        "content": "<p>You're going to have to understand code systems vs. value sets and how to do thos properly.</p>",
        "id": 162356997,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554226919
    },
    {
        "content": "<p>If they can't hand-author an ImplementationGuide that says \"here are my pages and their hierarchy\", how are they supposed to hand-edit a prescription or diagnostic report?</p>",
        "id": 162357088,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554226967
    },
    {
        "content": "<p>external tooling exists for editing capability statement in R3 and R4</p>",
        "id": 162364591,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554232001
    },
    {
        "content": "<p>the template should start from IG and assume that tooling will grow around that. Forge already includes an IG editor, so we should assume that <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> will update to the current version</p>",
        "id": 162364712,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554232086
    },
    {
        "content": "<p>Firely has indicated they don't plan to do much investment in the IG capabilities of Forge - they see that as more of a Simplifier function</p>",
        "id": 162364866,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554232218
    },
    {
        "content": "<p>well, perhaps someone else will then. Or perhaps we'll sort things out with simplifier...</p>",
        "id": 162364898,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554232260
    },
    {
        "content": "<p>I mean, we will, I expect. The issue with simplifier is basically about templating</p>",
        "id": 162364936,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554232288
    },
    {
        "content": "<p>Well  after doing this for a while,  I still think HL7 Ig publishing is too hard and the first step is making the onboarding with ImplementationGuide easy peasy.    I don't think hand authoring examples should be a prereq.</p>",
        "id": 162366652,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554233593
    },
    {
        "content": "<p>it's purely a format issue, right? there's nothing you have to say in an IG that you don't have to say anyway...</p>",
        "id": 162366772,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554233662
    },
    {
        "content": "<p>Using the spreadsheets and manual creation/updating of the other IG files didn't seem to be difficult. There is definitely room to move to tooling from spreadsheets but at this point, it seemed to be fairly straightforward but time consuming</p>",
        "id": 162366808,
        "sender_full_name": "David Pyke",
        "timestamp": 1554233703
    },
    {
        "content": "<p>If we think the authors need to be experts in hand authoring resources in all the formats,  creating markdown and xhtml ( and I would add here YAML files)  then all we need to do is  decide on the templates and we are good to go.</p>",
        "id": 162367852,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554234525
    },
    {
        "content": "<p>why all formats? they can just pick one.</p>",
        "id": 162367968,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554234602
    },
    {
        "content": "<p>and we can assume tooling will come. Of course, editors can choose not to use the tooling that already exists</p>",
        "id": 162368067,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554234640
    },
    {
        "content": "<p>like, for instance, there is already an IG editor</p>",
        "id": 162368226,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554234767
    },
    {
        "content": "<p>for R4</p>",
        "id": 162368227,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554234769
    },
    {
        "content": "<p>No need for them to know anything about YAML.  They can pick one of markdown or XHTML (though knowing a bit of XHTML is useful even for the markdown folks as sometimes markdown won't do what you need).  For the resources you need to know XML or JSON but don't need the other.  Perhaps someday we'll have a tool suite that will protect authors from all that, though to be honest, I'm not sure how much I'd trust an IG that was written by someone who can't hand-edit an XML or JSON instance.  How can you write something targeting developers if you don't have some basic technical chops?</p>",
        "id": 162368268,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554234797
    },
    {
        "content": "<p>depends on what kind of guide you are writing. the type we are doing now, you're right. purely domain content things later.... not so much</p>",
        "id": 162368400,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554234872
    },
    {
        "content": "<p>If the purely domain content has technical impact on real code, then there should be at least someone in the mix who understands the ramifications of that impact.  At least if the implementation guide is going to be appropriate to actual \"implementation\" :)</p>",
        "id": 162368636,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554235018
    },
    {
        "content": "<p>If we expect authors to be capabable of  providing IG artifacts  in completed form then why do we need 1,2,3?</p>\n<p>I think we just hash how the look and feel of the templates?<br>\n\"<br>\nLloyd McKenzie: My proposal:<br>\n1. You change the IGPublisher to support hitting an Ant build script with the target names we'd agreed on and be able to point at a \"template\" IGPackage - including the ability to merge the properties in the 'template' IG with those from the local IG files<br>\n2. I adapt my framework which is already Ant-driven and is sort of organized based on those steps already to work with the IGPublisher and we iterate until it actually runs<br>\n3. We adapt the template to accomodate capabilities that Eric's framework already has<br>\n4. We open up the template for more general feedback around appearance and capabilities (likely around the WGM)<br>\nLloyd McKenzie: 5. We create a sample IG that explains gown to create an IG using the template<br>\n6. We work to get Trifolia and Simplified to be able to publish using the template.<br>\n7. We get John or someone to adapt the template for use with IHE. (And decide if we should have a more generic template that we and others can adapt from.)<br>\n8. We get everyone to adjust their IGs to use the template prior to ballot.<br>\nIn #3 we should be checking that Forge profiling will work..( @Michel Rutten I presume there's no interest from Firely in support for pure Forge- authored IGS in step 6?)</p>\n<p>At some point in there (probably 3 or 4) we also need to rejig the IG publisher and template to support multi- version IGs.<br>\n\"</p>",
        "id": 162368981,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554235255
    },
    {
        "content": "<p>We want there to be a single template that everyone in HL7 uses that's maintained in a separate Git project from the actual IG content.  (Similarly IHE will have a single template, NICTIZ will have a single template, etc.)</p>",
        "id": 162369272,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554235471
    },
    {
        "content": "<p>feedback form the authors is really strong: we do resources. the ins and outs of stitching html and managing path destinations is a pig.</p>",
        "id": 162369355,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554235528
    },
    {
        "content": "<p>and maintaining a consistent look and feel is too hard.</p>",
        "id": 162369382,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554235554
    },
    {
        "content": "<p>Plus the variations in appearance and approach are a problem for the reviewers and implementers.</p>",
        "id": 162369388,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554235559
    },
    {
        "content": "<p>so that's the main focus of the template work</p>",
        "id": 162369393,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554235560
    },
    {
        "content": "<p>so why 1,2  that has nothing to do with template and everything to do with ImplementationGuide building?</p>",
        "id": 162369454,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554235583
    },
    {
        "content": "<p>That's what allows an IG to point to a template defined somewhere else.</p>",
        "id": 162369484,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554235619
    },
    {
        "content": "<p>y</p>",
        "id": 162369501,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554235629
    },
    {
        "content": "<p>I've done that locally for the last two years split the source from the framework, but the autobuilder requires the framework and the source to be in the same repo so I'm stuck having to merge them back to get published<br>\n.   It is pain in Git to have remote modules too so I only push the source and the output (for git pages)  is that what you are talking about?  splitting the source repro from the framework?</p>",
        "id": 162369906,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554235900
    },
    {
        "content": "<p>sort of but not exactly like that.</p>",
        "id": 162370089,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554236014
    },
    {
        "content": "<p>there'll be a git repository that has the template - simliar to the framework. we'll do releases from the repo using NPM packages. and then you just nominate the npm package in your ig, and create the content you want</p>",
        "id": 162370232,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554236090
    },
    {
        "content": "<p>OK  so the magic happens and <br>\ntemplates  take care of \"the ins and outs of stitching html\" <br>\n\"maintaining a consistent look and feel is too hard.\"  means limited options in the standard template - you can't have both imo<br>\n\"and managing path destinations is a pig.\"   I don't see how this will fix that.</p>",
        "id": 162371438,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554236980
    },
    {
        "content": "<p>Ok so where are we on source file tree structure, I don't see a way to  to indicate file's paths source in the IG resource.   that is all in ig.json right now.   I want to use it to drive building my ImplementationGuide.  I assume it will need to be fixed.</p>",
        "id": 162373968,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554238906
    },
    {
        "content": "<p>The IG resource won't indicate file paths.  The template will indicate what folders to check for which kinds of things and the files will need to adhere to a naming standard.</p>",
        "id": 162374198,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554239094
    },
    {
        "content": "<p>If you identify the artifacts in the IG, it'll be by canonical URL - and it'll be an error if the IGPublisher doesn't find exactly 1 file for the specified canonical URL.</p>",
        "id": 162374256,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554239139
    },
    {
        "content": "<p>I'm not sure about that bit.</p>",
        "id": 162374566,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554239388
    },
    {
        "content": "<p>but the easiest way to maintain the IG for me is to tell the IGPublisher what files to look for resources in, and let it load and register them</p>",
        "id": 162374641,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554239412
    },
    {
        "content": "<p>The template will indicate what folders to check for which kinds of things and the files will need to adhere to a naming standard.  ???</p>\n<p>Why not make the part of the ig resource - its there for pages?</p>",
        "id": 162374837,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554239573
    },
    {
        "content": "<p>Actually, it's not fully there for pages either - you specify a name but not a full path.</p>",
        "id": 162375038,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554239718
    },
    {
        "content": "<p>In the end, the IG resource needs the canonical URLs.  Given that we can make it work without the filenames, not sure why we'd add the extra overhead.</p>",
        "id": 162375126,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554239780
    },
    {
        "content": "<p>Also, it removes the temptation to name the source files in non-standard ways, which makes maintenance easier for Grahame and others who might have to come in and tweak someone else's IG</p>",
        "id": 162375184,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554239832
    },
    {
        "content": "<p>&lt;nameUrl value=\"index.html\"/&gt; looks like a relative path to me</p>\n<p>it sounds like we are moving ig.json to the template bundle.</p>",
        "id": 162375197,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554239841
    },
    {
        "content": "<p>index.html doesn't exist in the root of the IG folder.  It lives in one of the folders where the template says to look for page files</p>",
        "id": 162375282,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554239887
    },
    {
        "content": "<p>not all resources have canonical urls</p>",
        "id": 162375342,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554239952
    },
    {
        "content": "<p>yes i get that part.   but is could be  &lt;nameUrl value=\"my_path/index.html\"/&gt;</p>",
        "id": 162375352,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554239969
    },
    {
        "content": "<p>that's what the point of name[x] is</p>",
        "id": 162375457,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554240033
    },
    {
        "content": "<p>@GG  </p>\n<blockquote>\n<p>that's what the point of name[x] is</p>\n</blockquote>\n<p>is that in response to my comment or Lloyds?</p>\n<p>we have in ig.json plus a path list where to find things . This doesn't seem hard to find the source file  no matter how you name it.      </p>\n<div class=\"codehilite\"><pre><span></span>...\n  &quot;paths&quot;: {\n...\n    &quot;resources&quot;: [\n      &quot;source/resources&quot;,\n      &quot;source/examples&quot;\n    ]\n...\n    &quot;Patient/example2&quot;: {\n      &quot;source&quot;: &quot;foo.xml&quot;,\n      &quot;base&quot;: &quot;Patient-example2.html&quot;\n</pre></div>\n\n\n<p>How is it going to be represented in the template package ?</p>",
        "id": 162375937,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554240477
    },
    {
        "content": "<p>and when Lloyd says template I think of this  below  and I'm not certain that is what you are talking about because I'm not seeing a way to have paths and file names here....</p>\n<div class=\"codehilite\"><pre><span></span>---\n# jekyll header\nlevel: 2\ntemplate: base\nactive: format\nlayout: fhir-artifact\ntype: {{[type]}}\nid: {{[id]}}\ntopofpage: True\n---\n\n&lt;!-- ig template for many conformance resource html pages  (&#39;base&#39; in definitions file)  can not be used for conformance resources that have more that a single base template. e.g.,  sd since there are mapping and definitions templates for it as well  they need to be split out into 3 separate templates --&gt;\n\n&lt;!-- ============ CONTENT CONTENT=============== --&gt;\n\n{% case &#39;{{[type]}}&#39; %} &lt;!-- content depends on type --&gt;\n{% when &#39;ValueSet&#39; %}\n&lt;!-- ============VAlUESET CONTENT CONTENT=============== --&gt;\n\n  {% include {{[type]}}-{{[id]}}-summary.xhtml %}\n  {% include {{[type]}}-{{[id]}}-xref.xhtml %}\n  {% include {{[type]}}-{{[id]}}-cld.xhtml %}\n\n  &lt;h3&gt;Expansion&lt;/h3&gt;\n\n  {% include {{[type]}}-{{[id]}}-expansion.xhtml %}\n&lt;!-- ============VAlUESET CONTENT CONTENT=============== --&gt;\n\n{% when &#39;CodeSystem&#39; %}\n&lt;!-- ============CODESYSTEM CONTENT CONTENT=============== --&gt;\n.....\n</pre></div>",
        "id": 162376222,
        "sender_full_name": "Eric Haas",
        "timestamp": 1554240700
    },
    {
        "content": "<p>I mentioned the location of the source files in the extra session we had during the last WGM - my problem was: how do we keep an ig.xml attached to the other source files. Or how do we pack all those files (which are the only thing that we need to send over between editors, for review).</p>",
        "id": 162396781,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554264495
    },
    {
        "content": "<p>a) ig.xml is also in the source/resources folder like the others<br>\nb) ig.xml is on the folder that contains the source</p>",
        "id": 162396786,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554264505
    },
    {
        "content": "<p>you should always use version control to share between editors</p>",
        "id": 162396887,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554264682
    },
    {
        "content": "<p>ok, meanwhile i got that covered. but i used option b above.</p>",
        "id": 162397115,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554264985
    },
    {
        "content": "<p>You should use version control even if you're the only editor :)</p>",
        "id": 162397117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554264992
    },
    {
        "content": "<p>yes. i could only live with that after providing a decent way for non technical users to do it. if i send an email to a pharmacist to review an IG, i have to use words like \"please\", not words like \"install git\" :)</p>",
        "id": 162397199,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554265130
    },
    {
        "content": "<p>should be using continuous build -that's how we handle that - commit and say 'look here on the web'</p>",
        "id": 162397265,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554265207
    },
    {
        "content": "<p>yeah, you shouldn't be sending the source files to people who can't run the publisher themselves.  you want them to review the actual IG not the source - which would be a combination of markdown, XML, JSON, etc.</p>",
        "id": 162397291,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1554265288
    },
    {
        "content": "<p>review = revise</p>",
        "id": 162397714,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554266003
    },
    {
        "content": "<p>it seems i can safely move with option b then.</p>",
        "id": 162397802,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554266157
    },
    {
        "content": "<p><a href=\"user_uploads/10155/ef5LVPolyeeUJi28XfWobF9p/pasted_image.png\" target=\"_blank\" title=\"user_uploads/10155/ef5LVPolyeeUJi28XfWobF9p/pasted_image.png\">pasted image</a> <br>\noption b is this.</p>\n<div class=\"message_inline_image\"><a href=\"user_uploads/10155/ef5LVPolyeeUJi28XfWobF9p/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"user_uploads/10155/ef5LVPolyeeUJi28XfWobF9p/pasted_image.png\"></a></div>",
        "id": 162397877,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554266261
    },
    {
        "content": "<blockquote>\n<p>I would hope that Simplifier would be capable of exporting to allow the use of templates - if not, they'll find themselves not useable for HL7 balloted content, IHE balloted content or that of anyone else who wants tight look-and-feel of their IGs.  After a while, that's going to take a good chunk out of their market...  (The look &amp; feel of evey type of template will evolve over time and I'm pretty sure HL7 is going to mandate consistent look &amp; feel across all our IGs - which means they're all going to have to publish using the same template.)</p>\n</blockquote>\n<p>This is not so much about marketshare, but about keeping the FHIR tooling ecosystem aligned. Please keep in mind:<br>\n- That we already have a WYSIWYG IG editor built in in Simplifier<br>\n- That we have an agreement in place with HL7 that allows all users and authors of HL7 ballotable content to use the Enterprise account of HL7 on Simplifier. This includes numerous advanced features. Always happy to do a demo if you're interested<br>\n- That we recognize the need for IG alignment and that we have a master template for HL7 ballotable content available on Simplifier<br>\n- That we have regular meetings with <span class=\"user-mention\" data-user-id=\"191808\">@Wayne Kubick</span>  and <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  around the HL7 and Firely tooling for the purpose of alignment.</p>\n<p>We recommend a clear separation between the spec and the IG guidelines on the one hand, and the tooling on the other hand.</p>",
        "id": 162811083,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1554725618
    },
    {
        "content": "<p>e.g. this is still work in progress. Simplifier need not support the actual same template, but does need to meet HL7 publishing requirements.</p>",
        "id": 162886548,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554793582
    }
]