[
    {
        "content": "<p>What is the best way to make it clear to an implementer in the profiled Observation structure definition the following conditions:<br>\nA Personal Health Device may send a measurement status along with a measurement. The measurement may contain a  special value.</p>\n<p>If the measurement status indicates a certain set of conditions, a dataAbsentReason with reason 'error' shall be populated and value[x] will not exist.<br>\nif the measurement contains a special value, a dataAbsentReason with reason 'NAN', \"PINF', or 'NINF' shall be populated and value[x] will not exist<br>\nIf the measurement status indicates another set of conditions, a meta.security.code shall be populated with 'HTEST' and the value[x] will exist.<br>\nIf the measurement status indicates another set of conditions, one or more interpretation.coding.code elements will be populated and the value[x] will exist</p>\n<p>If multiple conditions are sent, the value[x] is not present 'wins'.</p>\n<p>There are likely many ways to do this and end up with the correct result. In the text part of the IG the details are spelled out but it would be nice to see it in the struct def diff</p>",
        "id": 153997236,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537099978
    },
    {
        "content": "<p>Most of those sound like they're best expressed with the <code>constraint</code> element.  Not sure what's meant by  \"the value[x] is not present 'wins'.\"</p>",
        "id": 153997240,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537113294
    },
    {
        "content": "<blockquote>\n<p>Most of those sound like they're best expressed with the <code>constraint</code> element.  Not sure what's meant by  \"the value[x] is not present 'wins'.\"</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  What  i mean by that is if the measurement status reports multiple events, one (if by itself) would still have a value[x] element and another that would not, the would not case would take precedence and there would be no value[x]</p>",
        "id": 153997264,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537140476
    },
    {
        "content": "<p>That you can't easily do except by hand-wavy description.  Because the instances might be passed around all by themselves.  The notion of what \"counts\" is harder to communicate than \"here are the rules around what data can exist\".</p>",
        "id": 153997267,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537142450
    }
]