[
    {
        "content": "<p>The publisher misses a file ending with -summary-table. I do not know why it is missing, and where what should be placed to fix that!?<br>\nUsing the sample IG resulted in the same error. Thx</p>",
        "id": 225590436,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1612810442
    },
    {
        "content": "<p>Sounds like a template issue</p>",
        "id": 225617067,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1612822478
    },
    {
        "content": "<p>can you provide more details about what's missing, and what thinks it's missing?</p>",
        "id": 225620538,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612824221
    },
    {
        "content": "<p>When I use the latest publisher with the sample IG it runs into errors: the first is a reference to Medizininformatikinitiative. When removing this reference it tells me that a summary-text.xhtml file is missing. This is caused by Jekyll asking for such a file. This has been added by one of the latest changes. I have no clue what must be done to solve it? It is referencing StructureDefinitions, allowing editors to provide summary information. But where and how? On the other hand, what to do if you do not want to add that. To me the latest change seems to be incomplete. Or I am missing something...</p>",
        "id": 225623598,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1612825975
    },
    {
        "content": "<p>so you're just building the sample-ig as it is in github?</p>",
        "id": 225624001,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612826252
    },
    {
        "content": "<p>I started with my own one. But encountering this problem I tried the sample with the same result.<br>\nThere is a change in XSLT that tries to include such a file for some artefacts. It seems to be a good idea to add such a fragment if available. But when, where and how to provide it? And how to make it really optional?</p>",
        "id": 225654802,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1612857579
    },
    {
        "content": "<p>is your IG available somewhere for me to check?</p>",
        "id": 225656398,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1612858796
    },
    {
        "content": "<p>Currently not. But if you use the sample IG and remove the Medizininformatikinitiative reference it shows the same error.</p>",
        "id": 225671588,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1612868077
    },
    {
        "content": "<p>I will look at this in a few hours (sorry can't do it before)</p>",
        "id": 225675651,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1612870649
    },
    {
        "content": "<p>I can't reproduce this. The sample-ig builds ok for me...</p>",
        "id": 225756110,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612904256
    },
    {
        "content": "<p>Restarted from scratch again. Works now. No idea about the differences..</p>",
        "id": 226051413,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1613074596
    },
    {
        "content": "<p>Need to experiment further...</p>",
        "id": 226051497,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1613074636
    }
]