[
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-30783\">J#30783</a> is from an implementer complaining about the summary tab in the profile view.   I propose we either:</p>\n<ol>\n<li>Remove it all-together</li>\n<li>Allow option for custom summaries that can be injected into the IG to provide useful information</li>\n</ol>",
        "id": 227063992,
        "sender_full_name": "Eric Haas",
        "timestamp": 1613794058
    },
    {
        "content": "<p>I prefer:</p>\n<ol start=\"3\">\n<li>Replace it with something that's more useful and (perhaps) move it from being the default tab.  </li>\n</ol>\n<p>We don't want different IGs having different content in the summary and we don't want to push a bunch of manual work on IG authors.  I know you've done some 'better' summaries for your IGs in the past.  Can we just set up the template to spit that out or do we need some help from the publisher to spit out an appropriate fragment?</p>",
        "id": 227064405,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613794461
    },
    {
        "content": "<p>They are optimized for US Core and they are also using a template that leverage python methods so would be need to be turned into liquid.   I think 80% of the definitions summary would turn out to be pretty straightforward, but I am concerned the last 20% (slicing) and maintenance will turned to be a lot of work.</p>",
        "id": 227141266,
        "sender_full_name": "Eric Haas",
        "timestamp": 1613882535
    },
    {
        "content": "<p>Agree that whatever we come up with needs to be maintainable - but if the alternative is pushing that maintenance work onto every IG publisher, that's much worse.  I think we should mock up the algorithm for what we think it <em>should</em> look like that works generically and will be useful for various types and sizes of IGs.  If we can do that using Liquid, great.  If we need to write some Java code (or more likely, change the existing Java code) to spit out what we want, that's completely viable.</p>",
        "id": 227142235,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613883897
    },
    {
        "content": "<p>I'll take a stab a liquid with what I got.    </p>\n<p>As far as default tab,  I prefer differential - but I am primarily an editor so that is my bias,  I have heard some prefer full/snapshot and other MS view. </p>\n<p>Need a poll</p>",
        "id": 227300953,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614013554
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191401\">Eric Haas</span> <a href=\"#narrow/stream/179252-IG-creation/topic/summary.20tab.20is.20confusing.20to.20readers/near/227300953\">said</a>:</p>\n<blockquote>\n<p>Need a poll</p>\n</blockquote>\n<p>And / or a way for template editors to override the default tab?</p>",
        "id": 227302984,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1614014259
    },
    {
        "content": "<p>You can revamp the templates to change order of tabs or remove tabs entirely, but there's no \"flag\" that can do that (and I can't imagine an easy way to make that happen)</p>",
        "id": 227304278,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614014684
    },
    {
        "content": "<p>actually there is a way to define the default view with an integer value.   so it could be defined by authors with a parameter ...  i prefer a standard default view however</p>",
        "id": 227306809,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614015635
    },
    {
        "content": "<p>Correct. We can have a JS variable that tells which tab to open first. <br>\nChanging the order = more work.</p>",
        "id": 227313959,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1614018427
    },
    {
        "content": "<p>Ah, right.  I was thinking of re-ordering, not just selecting the default tab.  Agree that we want the order (and default) consistent for all HL7 IGs.  However, it might be reasonable to make it easy to configure for non-HL7-published IGs</p>",
        "id": 227316414,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614019459
    },
    {
        "content": "<blockquote>\n<p>it might be reasonable to make it easy to configure for non-HL7-published IGs</p>\n</blockquote>\n<p>I've done this pre templates ... so not hard</p>",
        "id": 227321088,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614021229
    }
]