[
    {
        "content": "<p>I'm going out on a limb here and this will show my ignorance so please try to be nice.</p>\n<p>While looking into sushi command line I did not see an option that would generate a context specific <a href=\"https://build.fhir.org/downloads.html#7.1\">FHIR schema</a> for the context of the IG.</p>\n<p>Could see the generation of the <a href=\"https://build.fhir.org/downloads.html#7.1\">FHIR schema</a> as part of the handoff to the delivery team which would enable them to use it for constraints at the service level. </p>\n<p>I could be missing something. Please correct me if I am.</p>",
        "id": 278614133,
        "sender_full_name": "Al Pivonka",
        "timestamp": 1649709912
    },
    {
        "content": "<p>We don't have tooling that creates profile-specific schemas.  XML schema is very poor at expressing the types of things we do in profiles.  You can't enforce most vocabulary bindings, you can't handle slicing (which means you can't deal with any extensions).  Given the limited value they'd have, we just don't bother.  (This isn't Sushi-specific it's true for all profiles.)</p>",
        "id": 278616036,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649710816
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> (Thank you for your reply) . </p>\n<p>Then, I'm going to make a base assumption that it is up the the delivery team to make changes to their service level validation(schemas) to conform to the context specific IG.</p>\n<p>then the next question begs to be asked, how to validate the IG agains the implementation ? Manual?</p>",
        "id": 278619155,
        "sender_full_name": "Al Pivonka",
        "timestamp": 1649712268
    },
    {
        "content": "<p>what kind of validation do you want?</p>",
        "id": 278620951,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1649713284
    },
    {
        "content": "<p>Have you looked through this page? <a href=\"https://build.fhir.org/validation\">https://build.fhir.org/validation</a></p>",
        "id": 278623889,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649715083
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  (Thanks) Reading.....</p>",
        "id": 278691949,
        "sender_full_name": "Al Pivonka",
        "timestamp": 1649769949
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  (thank you for your question) <br>\nI've added (FHIR JSON schema) to my original question (Hoping this may help clarify my statements) </p>\n<p>My base assumption: the IG is used to guide the delivery team on how to implement the specific context changes of the IG (Extensions, Profile changes, etc. ) . </p>\n<p>Use of the FHIR JSON Schema to validate service call message payloads for schema correctness.  (Like: OPEN API/Swagger schemas)</p>\n<p>If the IG outlines context specific changes to profiles and extensions (etc), the delivery team would have to make corresponding changes the FHIR JSON schema  to enable validation of the new structure(s) caused by the specific context of the IG changes. </p>\n<p>I realize I have a great deal to learn . I appreciate your time.</p>",
        "id": 278698254,
        "sender_full_name": "Al Pivonka",
        "timestamp": 1649772741
    },
    {
        "content": "<p>Right.  Short answer is that FHIR interfaces tend to be more complex than what can reasonably be represented by JSON schema.  If you were defining a stand-alone interface, you wouldn't have a repeating 'extension' element with different constraints on different repetitions, and similar behavior for identifiers, codings, etc.  Instead, you'd have separate named properties for each extension, relevant identifier type and you could have a nice tight JSON schema that fully documented your custom REST API.  FHIR doesn't work like that.  FHIR has a common schema that's the same across all systems' APIs.  As a result, the JSON doesn't always lend itself to defining a schema for the interface for a single system (or set of expectations defined by a single IG).</p>",
        "id": 278714982,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649779699
    },
    {
        "content": "<p>On a related note, some of us have been working on code generation from IGs to handle parts of this.  We found that generally, people like to use an SDK to do most of the heavy-lifting, and having tooling that integrates with that is desired.</p>\n<p>Outputs are like <a href=\"https://github.com/GinoCanessa/FHIR-CS-Profiling-Basic/tree/main/profiles\">C# example</a>.  Notes:</p>\n<ul>\n<li>The tooling to generate this is WIP, but getting closer.</li>\n<li>The goal is to be able to output code that integrates with the different SDKs in different languages (e.g., Firely/C#, HAPI/Java, Apple/Swift, etc.)</li>\n<li>Validation is limited to 'things that do not require a terminology service'<ul>\n<li><em>looking</em> at what integration with a tx server is on the list, but explicitly not part of MVP</li>\n</ul>\n</li>\n</ul>",
        "id": 278717230,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1649780805
    },
    {
        "content": "<p>I think I'm getting it.</p>\n<p>Unless the IG specifies  a custom profile; which isn't recommended and many have told me; one is working with extensions. Looking at the JSON schema for an extension:  an extension is an extension. </p>\n<p>Code Systems are enumerations and value sets are references to the enums within the Code System. I'm not a JSON schema guy yet I'm not sure how that would be enforced on an extension...</p>\n<p>Are my assumptions correct?</p>\n<p>BTW thanks for the explanations.</p>\n<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  Where can I find code gen you speak of?</p>",
        "id": 278731539,
        "sender_full_name": "Al Pivonka",
        "timestamp": 1649787208
    },
    {
        "content": "<p>The repo is on GitHub: <a href=\"https://github.com/microsoft/fhir-codegen\">fhir-codegen</a>; you will want to look at the <code>dev</code> branch for any of the work with IGs.</p>\n<p>The FHIR-core related features are all there and stable, but for v1 of 'IG' support:</p>\n<ul>\n<li>Reading/parsing of IGs (mostly done - current pass works but I am not sure if everything required is there yet)</li>\n<li>UI (decent, but needs work for a full v1)</li>\n<li>A simplified export module for extensions (mostly just sketched out right now - previously I had just been using the same 'Language' export modules, but there is a lot of 'extra' that can be trimmed out to simplify)</li>\n</ul>\n<p>Unfortunately I have a pretty full plate right now, so while work is regular it is not as fast as I would like.  Once everything is good for a v1, we'll push through a release and <em>maybe</em> sort out a hosted story too.</p>",
        "id": 278735778,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1649789129
    }
]