[
    {
        "content": "<p>I see that sushi has replaced my ig.ini.  That is really blocking for me.<br>\nHow should this work together? Sushi is facilitating the straightforward use but I don't think it should not take over more advanced use.</p>",
        "id": 196270528,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588658642
    },
    {
        "content": "<p>I don't want sushi to replace my entire ig framework - the ig.ini, the ig.xml/json... I just want sushi to create the content from my shorthand definitions, and create the other files ONLY if they do not exist</p>",
        "id": 196270604,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588658761
    },
    {
        "content": "<p>instead of looking into the ig-data, why doesn't sushi take the existing files? I don't want to have an IG template when using sushi and another when not using sushi.</p>",
        "id": 196270749,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588658946
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> but probably a question for <a class=\"stream\" data-stream-id=\"215610\" href=\"/#narrow/stream/215610-shorthand\">#shorthand</a></p>",
        "id": 196270915,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588659145
    },
    {
        "content": "<p>(anywhere is fine, but this is impacting /impacted by the work on the ig template and sample ig).</p>",
        "id": 196271779,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588660040
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179252-IG-creation/topic/Sushi.20Support/near/191934913\" title=\"#narrow/stream/179252-IG-creation/topic/Sushi.20Support/near/191934913\">said</a>:</p>\n<blockquote>\n<p><a href=\"user_uploads/10155/bB9cjOrTtwTKmXizxrOovrZS/image.png\" title=\"user_uploads/10155/bB9cjOrTtwTKmXizxrOovrZS/image.png\">image.png</a> </p>\n</blockquote>\n<p>This was a quick draft but should still apply - if sushi is being called by the publisher, it just needs to look at different folders.</p>",
        "id": 196272673,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588661111
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> -- the main trouble is telling if a file exists because the author put it there or if it exists because SUSHI was already run previously.  If I understand your diagram correctly, then if we were to implement that, we would run into this potential scenario:</p>\n<ul>\n<li>First run: <code>../ig.ini</code> does not exist, so SUSHI uses <code>ig-data</code> and outputs to <code>..</code></li>\n<li>Author finds issues and makes changes in <code>ig-data</code> that affect generated ig.ini or other config files</li>\n<li>Second run: <code>../ig.ini</code> now exists (thanks to previous run) so SUSHI ignores <code>ig-data</code> and no changes get incorporated</li>\n</ul>\n<p>This is the tricky problem of trying to support generation of files and user-management of files when the user wants to manage the file in the same name and location as the app wants to generate it.  We may have to come up w/ creative solutions.  Those might include one (or multiple) of the following:</p>\n<ul>\n<li>only overwrite the destination file if it contains a special SUSHI header (or other indicator) indicating it is generated (in which case, authors should remove it if they want to make manual modifications)</li>\n<li>specify in config which files are user-provided (that SUSHI might normally generate) -- and SUSHI won't touch them</li>\n<li>specify in config to run artifact-only mode which only does profiles, extensions, etc and never does any IG-related config (or pages or menus, etc)</li>\n<li>... other ideas...</li>\n</ul>\n<p>Specific to your current issue with <code>ig.ini</code>, is there a reason you don't just put an <code>ig.ini</code> in <code>ig-data</code>?  If you do that, SUSHI will merge its inputs with yours and copy over the merged file to <code>../ig.ini</code>.</p>",
        "id": 196304626,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588684042
    },
    {
        "content": "<p>right. does this presume that sushi will always output the ig.ini file?</p>",
        "id": 196306830,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588685126
    },
    {
        "content": "<p>ig.ini only has 2 parameters..<br>\nsushi could generate an ig.ini only if one does not exist (and never  touch it again)</p>",
        "id": 196307373,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588685376
    },
    {
        "content": "<p>I think that if someone is wanting to use pure sushi to produce IG output, the current solution is great. So the  problem is when someone wants to use sushi AND also hand edit some stuff... First, we need to identify the reasons one needs to hand edit, all likely good reasons but knowing them would inform how we avoid stomping on that.  We need a compromise between the pure sushi to IG output, with the hybrid editing.</p>",
        "id": 196309148,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588686254
    },
    {
        "content": "<p>I think this pertains to other files as well -- not just ig.ini -- so we want a more general solution that can handle them all.  The current thinking on SUSHI is that having config data spread across multiple files (ig.ini, package.json, package-list.json, menu.xml (arguably config), ImplementationGuide.json) is generally confusing -- and consolidating to a single configuration file can streamline that and reduce redundant and/or possibly conflicting data between those files.  So, the config (not yet released) would contain the data that would go in the ig.ini (e.g., \"template\").  If SUSHI generates ig.ini only once, then if the author changes the template value in the config, that change will not get reflected in the ig.ini.  We would, at the least, want to trigger a warning if we found that data in the config didn't match data in the ig.ini.</p>",
        "id": 196309250,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588686305
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> -- agreed, and I think we'll be in a better place to explore that once the new config is released.</p>",
        "id": 196309288,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588686327
    },
    {
        "content": "<p>well this is difficult.</p>",
        "id": 196313577,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588688265
    },
    {
        "content": "<p>I can expect an author to either know how to change the ini (or get that ini provided to them - for example IHE editors), so sushi should not interefere</p>",
        "id": 196313760,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588688329
    },
    {
        "content": "<p>I don't understand what menu.xml has to do with this - i agree a better way should happen, but that is content. ig.ini is config</p>",
        "id": 196313888,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588688382
    },
    {
        "content": "<p>so I don't understand - one config file for all those things?</p>",
        "id": 196313981,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588688412
    },
    {
        "content": "<p>I don't understand why the simplest solution would not work - sushi sees an ig.ini, leaves it alone.</p>",
        "id": 196314075,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588688457
    },
    {
        "content": "<p>I fear this could make sushi collide with the advance uses that IHE will need - <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> I know some people in IHE are experimenting with sushi but we must be careful (again). At this moment, I experimented with it, and I am learning to be cautious.</p>",
        "id": 196314650,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588688695
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191469\">Chris Moesel</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196309250\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196309250\">said</a>:</p>\n<blockquote>\n<p>I think this pertains to other files as well -- not just ig.ini -- so we want a more general solution that can handle them all.  </p>\n</blockquote>\n<p>Perhaps but we should clean up a bit - ig.ini is input for sushi, not output of a complex decision. Sushi can create a default one if needed - but it's 2 parameters...</p>",
        "id": 196315408,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588689002
    },
    {
        "content": "<p>What's the rationale for Sushi re-writing the ig.ini?  The only circumstance I can think of is if the IG's \"id\" has changed and thus the filename has changed.  If that happens, perhaps Sushi could read the existing file and then re-write the file using the new IG id and leave everything else the same (basically just the template declaration and any commented content)</p>",
        "id": 196325111,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588692998
    },
    {
        "content": "<blockquote>\n<p>I don't understand why the simplest solution would not work - sushi sees an ig.ini, leaves it alone.</p>\n</blockquote>\n<p>I think my main concern is that there are still multiple sources of truth.  If the <code>ig-data/ig.ini</code> (or <code>config.yaml</code> in the future) contains a <code>template</code> value <em>and</em> the destination path <code>ig.ini</code> contains a <code>template</code> value -- what do we do when those values disagree?  Which is the \"truer\" value -- the SUSHI source value or the destination path <code>ig.ini</code> value?  So I think there are a few potential solutions to choose from:</p>\n<ul>\n<li>If SUSHI config/input value conflicts w/ destination ig.ini value, log warning and prefer destination ig.ini.</li>\n<li>If SUSHI config/input value conflicts w/ destination ig.ini value, log warning and prefer SUSHI generated ig.ini.</li>\n<li>If SUSHI config/input value conflicts w/ destination ig.ini value, log error and require author to deconflict values.</li>\n<li>Don't allow <code>ig-data/ig.ini</code> (or <code>template</code> property in <code>config.yaml</code>) anymore -- reduce single source of truth to <code>./ig.ini</code> (meaning SUSHI now requires two configs: <code>ig.ini</code> and <code>config.yaml</code>).</li>\n<li>Still allow <code>ig-data/ig.ini</code> (or <code>template</code> property in <code>config.yaml</code>), but make it optional.  If it's specified, always create or overwrite <code>ig.ini</code>.  If it's not specified, then (a) if <code>ig.ini</code> already exists, leave it alone, or (b) if <code>ig.ini</code> doesn't exist, generate a default one.</li>\n</ul>\n<p>After enumerating all those options, I'm guessing that one of the last two is closest to what you're suggesting.  Is that right?</p>",
        "id": 196325703,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588693241
    },
    {
        "content": "<p>I understand sushi as a short way of defining resources.  I'm not sure why it's trying to define an alternate way of defining build processes (which are already defined pretty simply)  I don't think our objective is a second way of saying <em>everything</em>?</p>",
        "id": 196326019,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588693391
    },
    {
        "content": "<p>Many of us (but not Jose?) are using FSH and SUSHI to handle creating everything that the IGPublisher needs.  Not just as a means of defining profiles, extensions, etc., but also the ImplementationGuide-xxx.json, the menus, the web pages, etc.</p>",
        "id": 196326243,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588693482
    },
    {
        "content": "<p>Hmm.  That seems to be scope creep beyond what the project was originally supposed to do.</p>",
        "id": 196326619,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588693647
    },
    {
        "content": "<p>The format for menus is likely to change.  And I'm not sure how SUSHI can simplify pages beyond markdown?</p>",
        "id": 196326832,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588693749
    },
    {
        "content": "<p>What's the driver for creating additional formats for those other things?</p>",
        "id": 196326863,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588693774
    },
    {
        "content": "<blockquote>\n<p>What's the rationale for Sushi re-writing the ig.ini?</p>\n</blockquote>\n<p>So... TBH, the current state is not a fully intended design with an explicit rationale.  The original design was that SUSHI had a dedicated source/input folder and was always writing into a dedicated output folder (i.e., not a folder with user-managed content).  In this intended design, the only things that could be overwritten were generated files -- so there was no issue.  It's the new IG Publisher integration and use cases where people are generating SUSHI output into existing folders with user-managed files that causes some of these issues to pop up.  And we recognize that this requires us to rethink how that all works.</p>\n<p>In a perfect world there would be a clean line between source files and output files (ideally in separate folder hierarchies -- like <code>src</code> and <code>build</code> in many software systems).  And this is what we tried to support via a source <code>fsh</code> folder that can contain an <code>ig-data</code> subfolder for holding all the IG files -- that ultimately get processed/copied to the destination.  But if people don't want to store their ig config in <code>ig-data</code>, and instead want to store it in the destination folder directly, we leave the world of clean separation and get into a world of gold source input files and generated output files all being mixed together.  That's where the headaches are.  It would be avoided if <code>fsh/ig-data</code> were used, but I guess there are use cases where that approach is not ideal (although I will admit I don't fully understand them yet)...</p>",
        "id": 196327486,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588694046
    },
    {
        "content": "<blockquote>\n<p>Hmm. That seems to be scope creep beyond what the project was originally supposed to do.</p>\n</blockquote>\n<p>So... just to be sure we're all on the same page.  FHIR Shorthand (the spec) is focused on generating definitional resources, examples, etc.  All of the stuff around IGs and IG config is implementation details of SUSHI -- and outside of the FSH specification.  It's not normative; it's just a feature of our SUSHI tool -- which we built based on feedback from users who wanted an easier way to get from FSH files to an IG they can view in a browser (because viewing JSON profiles directly is a little tedious).</p>",
        "id": 196328081,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588694334
    },
    {
        "content": "<p>agile -- great approach, painful at times.</p>",
        "id": 196328557,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588694531
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> 's comments.  It seems quite clear to me that SUSHI was built with the assumption that you gave it a set of source files and it generated a set of output files that you then processed with the IGPublisher.  In that world, you could migrate exactly what you wanted and leave behind what you didn't want.  It seems to me that Grahame surprised the team by adding hooks to SUSHI in the IGPublisher.  That plus users wanting to use FSH and the integration but not wanting all of the integration are causing growing pains for the SUSHI team.  I have opinions on what I want the SUSHI team to focus on, but I'll leave it to them to solve all of the world's FHIR IG problems. :)</p>",
        "id": 196329172,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588694822
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196326243\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196326243\">said</a>:</p>\n<blockquote>\n<p>Many of us (but not Jose?) are using FSH and SUSHI to handle creating everything that the IGPublisher needs.  Not just as a means of defining profiles, extensions, etc., but also the ImplementationGuide-xxx.json, the menus, the web pages, etc.</p>\n</blockquote>\n<p>I use Sushi for FSH-FHIR. It really saves me a lot of time. But not for everything - there are a few things I cannot do with FSH yet, and my suggestion would be that Sushi focuses on those, not the publication features.</p>",
        "id": 196329207,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588694843
    },
    {
        "content": "<p>I launched the topic not to say sushi is no sufficient - my questions are only about the integration.<br>\nOne hard(ish) requirement from my side is that I want to keep my Continuous Delivery - if I change something in a FHIR resource or a FSH file, the build should pick up.</p>",
        "id": 196329868,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588695187
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191469\">Chris Moesel</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196328081\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196328081\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Hmm. That seems to be scope creep beyond what the project was originally supposed to do.</p>\n</blockquote>\n<p>So... just to be sure we're all on the same page.  FHIR Shorthand (the spec) is focused on generating definitional resources, examples, etc.  All of the stuff around IGs and IG config is implementation details of SUSHI -- and outside of the FSH specification.  It's not normative; it's just a feature of our SUSHI tool -- which we built based on feedback from users who wanted an easier way to get from FSH files to an IG they can view in a browser (because viewing JSON profiles directly is a little tedious).</p>\n</blockquote>\n<p>And I think feature that is a good thing, but should not impede integration or advanced uses, right?</p>",
        "id": 196330058,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588695271
    },
    {
        "content": "<p>I vote for sushi team to focus on more simplifying authoriing of defining resources (e.g. OperationDefinition,  MessageDefinition,  ActivityDefinition, PlanDefinition,   then some of the other *Definition.</p>",
        "id": 196330068,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588695279
    },
    {
        "content": "<p>it seems to me that your problems would be solved by not using the IGPublisher integration.  Have SUSHI take your FSH input files and generate them into a SUSHI output directory and then copy over the FHIR definition stuff (profiles, extensions, terminology) into your IG directories.  That would give you exactly what you want.</p>",
        "id": 196330277,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588695395
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196330068\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196330068\">said</a>:</p>\n<blockquote>\n<p>I vote for sushi team to focus on more simplifying authoriing of defining resources (e.g. OperationDefinition,  MessageDefinition,  ActivityDefinition, PlanDefinition,   then some of the other *Definition.</p>\n</blockquote>\n<p>And Logical Models and ExampleScenarios.. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 196330408,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588695479
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196330277\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196330277\">said</a>:</p>\n<blockquote>\n<p>it seems to me that your problems would be solved by not using the IGPublisher integration. </p>\n</blockquote>\n<p>whose problems? Mine (and the teams that I hope are working in a consistent way?) Or you mean John's?</p>",
        "id": 196330698,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588695622
    },
    {
        "content": "<p>yours</p>",
        "id": 196330762,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588695660
    },
    {
        "content": "<p>I can give up on the integration  until sushi fixes the issues pointed by chris - the input and output files. I understand the issue, so I just suggested one simple change for now to unblock this - if there is an ini file, leave it alone.</p>",
        "id": 196331055,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588695800
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196330277\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196330277\">said</a>:</p>\n<blockquote>\n<p>it seems to me that your problems would be solved by not using the IGPublisher integration.  Have SUSHI take your FSH input files and generate them into a SUSHI output directory and then copy over the FHIR definition stuff (profiles, extensions, terminology) into your IG directories.  That would give you exactly what you want.</p>\n</blockquote>\n<p>An alternative would be for SUSHI to have some flags that govern exactly what gets created:<br>\na) just the outputs from the FSH files<br>\nb) (a) plus IG web content<br>\nc) the whole kit and kaboodle (what is currently done)</p>\n<p>edit: (which of course Chris already suggested above)</p>",
        "id": 196331083,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588695821
    },
    {
        "content": "<p>otherwise I cannot have sushi as part of the continuous delivery</p>",
        "id": 196331088,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588695824
    },
    {
        "content": "<p>I think this thread itself is a scope creep - they grow so fast, i know... my suggestion seems compatible with the use of such flag.</p>",
        "id": 196331356,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588695951
    },
    {
        "content": "<p>I think Chris will get it right.</p>",
        "id": 196331418,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588695969
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196331055\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196331055\">said</a>:</p>\n<blockquote>\n<p>I can give up on the integration  until sushi fixes the issues pointed by chris - the input and output files. I understand the issue, so I just suggested one simple change for now to unblock this - if there is an ini file, leave it alone.</p>\n</blockquote>\n<p>But that is in direct opposition to my requirement - overwrite any sushi-generated file as a result of the changes I've made in my FSH folder.  I feel for Chris and team as he has to balance these two competing requirements.</p>",
        "id": 196331521,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588696021
    },
    {
        "content": "<p>It seems like we should talk about what the actual file structure should be for an integrated environment where input folders are clearly defined and <em>never</em> written to by tools that aren't authoring those input files, where temporary/intermediate files are always generated into the 'temp' folder (where they get wiped every time there's a build) and output is reserved solely for the final published output.</p>",
        "id": 196331719,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588696095
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196331521\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196331521\">said</a>:</p>\n<blockquote>\n<p>But that is in direct opposition to my requirement - overwrite any sushi-generated file as a result of the changes I've made in my FSH folder.  I feel for Chris and team as he has to balance these two competing requirements.</p>\n</blockquote>\n<p>if \"sushi-generated files\" includes control files like the ig.ini, which is an input file, then yes, there is a problem derived from current implementation.</p>",
        "id": 196331986,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588696202
    },
    {
        "content": "<p>I think the 'fsh' files should be able to live in the input folder - ideally alongside .xml and .json files for those resources that the author chooses not to (or can't) maintain appropriately using FSH.  The scan process in the IGPublisher should automatically find all relevant files (XML, JSON, spreadsheet or .fsh) and perform whatever processing is needed to convert them into proper resource instances in memory.</p>",
        "id": 196332025,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588696218
    },
    {
        "content": "<p>If SUSHI needs control files, we should differentiate between control files that are SUSHI-specific and those that aren't.  Ideally, SUSHI would <em>read</em> ig.ini, not write to it?</p>",
        "id": 196332121,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588696277
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196331719\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196331719\">said</a>:</p>\n<blockquote>\n<p>It seems like we should talk about what the actual file structure should be for an integrated environment where input folders are clearly defined and <em>never</em> written to by tools that aren't authoring those input files, where temporary/intermediate files are always generated into the 'temp' folder (where they get wiped every time there's a build) and output is reserved solely for the final published output.</p>\n</blockquote>\n<p>I think a main problem is that SUSHI's design was as Chris stated above:<br>\nFSH input folders --&gt; SUSHI --&gt; FSH output folders --&gt; user copied over --&gt; IG Publisher input folders --&gt; IGPublisher --&gt; IG Publisher output folders</p>\n<p>When Grahame added in SUSHI integration to the IGPublisher tool, suddenly the FSH output folders became meshed into the IGPublisher input folders and that has caused a lot of the pains that Jose and others are experiencing.  If your environment is like mine where I'm willing to let everything in the FSH output be the IGPublisher input, then you are fine.  But if you are doing esoteric things and can't work with that, then we get into trouble.</p>",
        "id": 196332129,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588696286
    },
    {
        "content": "<p>I think there's good reasons to want the publication process to work without any intermediate steps</p>",
        "id": 196332287,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588696361
    },
    {
        "content": "<p>We can create an 'output' folder for SUSHI in the temp folder that can be used as an input folder for the IG-Publisher - no moving stuff around.  But it would mean that SUSHI should never be writing ig.ini (or certainly never overwriting it)</p>",
        "id": 196332391,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588696421
    },
    {
        "content": "<p>Given that ig.ini has to be there for the CI-build, my leaning would be that SUSHI should be using it as an input.</p>",
        "id": 196332492,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588696467
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196332391\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196332391\">said</a>:</p>\n<blockquote>\n<p>We can create an 'output' folder for SUSHI in the temp folder that can be used as an input folder for the IG-Publisher - no moving stuff around.  But it would mean that SUSHI should never be writing ig.ini (or certainly never overwriting it)</p>\n</blockquote>\n<p>What if I want it to?  I actually like the fact that SUSHI produces everything I need to generate a proper IG.  I now have three projects where my only directory checked into source control is the FSH directory.  Everything else is generated by SUSHI and everything just works.</p>",
        "id": 196332541,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588696495
    },
    {
        "content": "<p><strong>NOTE: It looks like there are at least half-a-dozen new messages since I started writing this message, so this is in the context of previous conversation... I haven't read the new messages yet!</strong></p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> -- FSH doesn't redefine markdown or page content.  You write your pages the same way.  The difference, in regard to pages, is that SUSHI will read your folder of page files and automatically generate all the page config content in ImplementationGuide.</p>\n<p>As for menu, SUSHI currently will create a very standard boilerplate menu if the author doesn't provide one.  Otherwise it copies over the author's menu.xml directly.  So we haven't invented anything new there (yet) -- but the new config.yaml will provide a simplified structure for defining a menu (e.g., simple name/url pairs) for those who don't want to mess with xhtml.</p>\n<p>It will also generate a starter package-list.json file for you if you don't have one.  The new config, however, will allow history to be specified there.</p>\n<p>SUSHI also uses all the data from generated resources and examples to populate the resources in the ImplementationGuide.  And copies over redundant data from package.json into ImplementationGuide.  Now that package.json isn't really required anymore, maybe that's less necessary.</p>\n<p>So, as it is now, SUSHI doesn't really redefine any formats -- it just generates as much as it can generate (reliably) to lower the barrier of entry for getting to an IG.  The proposed new configuration <em>does</em> admittedly redefine some things, but that is mainly in the interest of allowing more control over those generated files and consolidating config to a single file rather than spread across multiple files.  We may find that this is a bad idea or that improvements to the IG process in general render this unnecessary or overkill.  If so, great!</p>\n<p>We'll be releasing the new config approach as beta before the Connectathon and use the Connectathon to test it out.  We expect to learn a lot from that process -- and will try to react based on what we learn.  As some of you have noted, it's an agile approach, which can be painful at times, and there are certainly growing pains.  We also have a diverse set of users with diverse levels of experience (w/ IGs) and varying expectations regarding what SUSHI should provide.  And sometimes those expectations are seemingly in conflict with each other.  So... we're doing our best to navigate all of this!  And, for now, we're trying to focus on what will provide the greatest value to the majority of users -- but we don't want to do it at the expense of users on a narrower path; so the feedback is good!</p>",
        "id": 196332679,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588696562
    },
    {
        "content": "<p>Because it the CI build will blow up if that's all you check in?  Creating an ig.ini manually isn't an unreasonable ask for consistency across the whole publication process I think?</p>",
        "id": 196332772,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588696610
    },
    {
        "content": "<p>How does FSH determine the names of pages or the hierarchy of pages when it sucks them into the IG?</p>",
        "id": 196332825,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588696649
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196332772\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196332772\">said</a>:</p>\n<blockquote>\n<p>Because it the CI build will blow up if that's all you check in?  Creating an ig.ini manually isn't an unreasonable ask for consistency across the whole publication process I think?</p>\n</blockquote>\n<p>No it doesn't.  That's all I have checked in for the med-list-guidance project and CI works just fine.</p>",
        "id": 196332861,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588696673
    },
    {
        "content": "<p>There's a desire to simplify the menu function for everyone - so I'd rather this wasn't something that was FSH-specific</p>",
        "id": 196332945,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588696703
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191469\">Chris Moesel</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196332679\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196332679\">said</a>:</p>\n<blockquote>\n<p>...SUSHI will read your folder of page files and automatically generate all the page config content in ImplementationGuide.</p>\n<p>...SUSHI also uses all the data from generated resources and examples to populate the resources in the ImplementationGuide.  </p>\n<p>...So, as it is now, SUSHI doesn't really redefine any formats -- it just generates as much as it can generate (reliably) to lower the barrier of entry for getting to an IG.  </p>\n</blockquote>\n<p>The above is why I <em>LOVE</em> SUSHI.  As I've said above, I now have one source directory for my FHIR IGuides and all of the other configuration that was tedious to manage is managed by SUSHI.  I can now create a new FSH file, put in a profile definition, some extensions, some terminology, and some examples, and SUSHI figures it all out, creates the appropriate json input files, and updates the ImplementationGuide appropriately.  Similarly, I can add a new web page and boom, it all just works.  This simplicity makes it easier for so many people to create FHIR IGuides without needing to know the esoterics.</p>",
        "id": 196333571,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588697013
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> Do you think an endpoint where FSH files are maintained in the standard input folders alongside other resources is achievable?</p>",
        "id": 196333649,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588697048
    },
    {
        "content": "<p>How does SUSHI know the page name or position in the hierarchy?</p>",
        "id": 196333687,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588697065
    },
    {
        "content": "<p>Sorry... in a meeting right now, so can't comment in much detail just yet... But will do so soon...</p>",
        "id": 196333759,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588697106
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196333687\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196333687\">said</a>:</p>\n<blockquote>\n<p>How does SUSHI know the page name or position in the hierarchy?</p>\n</blockquote>\n<p>From the SUSHI Reference Page:<br>\nN_pagename.xml|md: If present, these files will be generated as individual pages in the IG. The leading integer (N) determines the order of the pages in the table of contents. These numbers are stripped and do not appear in the actual page URLs.</p>",
        "id": 196333779,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588697122
    },
    {
        "content": "<p>Right -- and we also use the file name to try to smartly generate a title.  E.g., <code>ImplementationDetailsForClients.md</code> will result in the title \"Implementation Details for Clients\".</p>",
        "id": 196333971,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588697217
    },
    {
        "content": "<p>The numbered prefixes work for top-level.  Admittedly, it doesn't address full page hierarchies.  The new <code>config.yaml</code> addresses that better for those who need it.</p>",
        "id": 196334059,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588697276
    },
    {
        "content": "<p>n gives you a sequence, but not a hierarchy</p>",
        "id": 196334239,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588697361
    },
    {
        "content": "<p>Though I guess we could do an n.m.o approach that would</p>",
        "id": 196334268,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588697390
    },
    {
        "content": "<p>I'm not thrilled with the notion of page names -&gt; titles.  Typically you want the page names to be short and sweet - because that makes short/sweet hyperlinks.  Titles, on the other hand, need to be descriptive and sometimes include special characters.  I'd much rather impose more work on authors and retain those characteristics than make things easier for authors but have URLs that suck for implementers.</p>",
        "id": 196334519,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588697504
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196334519\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196334519\">said</a>:</p>\n<blockquote>\n<p>I'm not thrilled with the notion of page names -&gt; titles.  Typically you want the page names to be short and sweet - because that makes short/sweet hyperlinks.  Titles, on the other hand, need to be descriptive and sometimes include special characters.  I'd much rather impose more work on authors and retain those characteristics than make things easier for authors but have URLs that suck for implementers.</p>\n</blockquote>\n<p>Why would the URL matter for implementers?   When are you going to directly reference a specific page in an IGuide? (and not do that by copying the URL in the first place?)</p>",
        "id": 196334743,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588697598
    },
    {
        "content": "<p>I type URLs all the time for IGs I'm familiar with - and the core spec.  Also, they are maintained as links in other specs (and you ideally don't want them to change, even if you change the descriptive label for clarification) - thus <a href=\"http://hl7.org/fhir/http.html\" title=\"http://hl7.org/fhir/http.html\">http://hl7.org/fhir/http.html</a> still having the same name even though a better label might be REST.</p>",
        "id": 196335400,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588697898
    },
    {
        "content": "<p>The auto-page-detection approach is a convenience for those who want to use it.  Part of the reason we're working on a new config is to <em>also</em> support those users who want more control or for whom the convenience is not desired.  I like having a convention that makes simple use cases drop-dead simple while also supporting more complex features where they are needed.  I don't think we should force simple use cases into more complex solutions.</p>",
        "id": 196335646,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588698006
    },
    {
        "content": "<p>I'm opposed to not forcing authors to define both a page link name (for the URL) and a descriptive name.  But I'm fine with the process for that being as simple as possible</p>",
        "id": 196336004,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588698143
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196336004\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196336004\">said</a>:</p>\n<blockquote>\n<p>I'm opposed to not forcing authors to define both a page link name (for the URL) and a descriptive name.  But I'm fine with the process for that being as simple as possible</p>\n</blockquote>\n<p>I'm getting to be a broken record, but +1 for what SUSHI currently does.  My page names are simple and work just fine as the URL, so I want SUSHI to do the heavy lifting for me.</p>",
        "id": 196336278,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588698259
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> said:</p>\n<blockquote>\n<p>I'm opposed to not forcing authors to define both a page link name (for the URL) and a descriptive name. But I'm fine with the process for that being as simple as possible</p>\n</blockquote>\n<p>My main concern there is that it can be pretty boilerplate in many situations and it imposes a maintenance burden.  If you add a new page but forget to put it into ImplementatonGuide, then it doesn't get rendered.  If you remove a page and forget to remove it from ImplementationGuide, it causes issues.  If you rename a page and forget to edit the ImplementationGuide, it causes issues.  <em>If</em> all the necessary info can be intuited by data that already exists, I prefer to use the data that already exists rather than requiring redundant specification of it.</p>\n<p>But I think we just need to agree to disagree there. ;-)</p>",
        "id": 196336690,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588698442
    },
    {
        "content": "<p>I'm fine with SUSHI doing the heavy lifting.  I'm not ok with things being simplified in a way that impacts what the output is in a negative way - and a page named ImplementationDetailsForClients.html is, to me, a significantly negative thing.</p>",
        "id": 196336738,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588698469
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196336738\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196336738\">said</a>:</p>\n<blockquote>\n<p>I'm fine with SUSHI doing the heavy lifting.  I'm not ok with things being simplified in a way that impacts what the output is in a negative way - and a page named ImplementationDetailsForClients.html is, to me, a significantly negative thing.</p>\n</blockquote>\n<p>why?  You'd rather have a page named 'http.html' that is actually all about RESTful interfaces?  Are you going to make this a quality check - your IG page URLs can't be more than X characters?  There is nothing stopping me from creating that page with that filename now.</p>",
        "id": 196336856,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588698516
    },
    {
        "content": "<blockquote>\n<p>a page named ImplementationDetailsForClients.html is, to me, a significantly negative thing.</p>\n</blockquote>\n<p>Would you prefer <code>implementation-details-for-clients.html</code>?  That's supported too. ;-)</p>",
        "id": 196336920,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588698547
    },
    {
        "content": "<p>I'd prefer clients.html.  And if I negative balloted that the URL was too long, finding it non-persuasive because \"SUSHI doesn't support that\" wouldn't cut it.</p>",
        "id": 196337010,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588698596
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196337010\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196337010\">said</a>:</p>\n<blockquote>\n<p>I'd prefer clients.html.  And if I negative balloted that the URL was too long, finding it non-persuasive because \"SUSHI doesn't support that\" wouldn't cut it.</p>\n</blockquote>\n<p>I'd non-persuasive it because \"the URL is too long\" is not a valid negative.  Stop manually typing the URLs and you'll be fine.</p>",
        "id": 196337122,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588698635
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196333649\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196333649\">said</a>:</p>\n<blockquote>\n<p>Do you think an endpoint where FSH files are maintained in the standard input folders alongside other resources is achievable?</p>\n</blockquote>\n<p>Yes, I think that's definitely something we should explore!  And your idea about generating into a temp folder that the IG Publisher reads as input makes sense too.  I think something like that starts to solve some of these problems (although, admittedly, not all of them).</p>",
        "id": 196337234,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588698694
    },
    {
        "content": "<p>It's a legitimate issue.  URLs <em>matter</em>.  If they didn't, we'd make them all GUIDs.</p>",
        "id": 196337235,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588698695
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196337235\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196337235\">said</a>:</p>\n<blockquote>\n<p>It's a legitimate issue.  URLs <em>matter</em>.  If they didn't, we'd make them all GUIDs.</p>\n</blockquote>\n<p>I was going to write something long, but I've decided to go with \"we'll have to agree to disagree\". :)</p>",
        "id": 196337822,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588698931
    },
    {
        "content": "<p>OIDS rule</p>",
        "id": 196337952,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588698977
    },
    {
        "content": "<p>One thing we can consider is that using the new config approach (again, soon to be released in beta), we could support flags like the following:</p>\n<ul>\n<li>generate-ig-ini</li>\n<li>generate-package-json</li>\n<li>generate-package-list-json</li>\n<li>generate-menu-xml</li>\n<li>generate-implementation-guide-resource</li>\n</ul>\n<p>then the user can decide what files they do and don't want generated.</p>",
        "id": 196339123,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588699499
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191469\">Chris Moesel</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196339123\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196339123\">said</a>:</p>\n<blockquote>\n<p>One thing we can consider is that using the new config approach (again, soon to be released in beta), we could support flags like the following:</p>\n<ul>\n<li>generate-ig-ini</li>\n<li>generate-package-json</li>\n<li>generate-package-list-json</li>\n<li>generate-menu-xml</li>\n<li>generate-implementation-guide-resource</li>\n</ul>\n<p>then the user can decide what files they do and don't want generated.</p>\n</blockquote>\n<p>Yes, I think we've seen that is probably needed and useful.  The default could be to generate everything and then advanced users can turn off things that they didn't want generated.  I think that solves Jose's needs.</p>",
        "id": 196339311,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588699586
    },
    {
        "content": "<p>One of the base premises on which FSH was allowed to proceed was that there would always be an 'escape' mechanism to allow you to express the full complexity of a resource, even if the base/simple syntax didn't.  I would expect that to hold true for page URLs vs. titles as for any other ImplementationGuide element</p>",
        "id": 196340044,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588699953
    },
    {
        "content": "<p>I.e. If I wanted to express the SDC IG in FSH (which has distinct URL and title names for pages, that needs to be possible.</p>",
        "id": 196340134,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588700015
    },
    {
        "content": "<p>So, again, we're not talking about FSH proper now.  We're talking about the SUSHI FSH compiler.  That's not spec -- it's an implementation.  But I think we agree that you should be able to control the page title and URL distinctly if you want.  The beta release next week will support that.</p>",
        "id": 196340404,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588700154
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196340044\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196340044\">said</a>:</p>\n<blockquote>\n<p>One of the base premises on which FSH was allowed to proceed was that there would always be an 'escape' mechanism to allow you to express the full complexity of a resource, even if the base/simple syntax didn't.  I would expect that to hold true for page URLs vs. titles as for any other ImplementationGuide element</p>\n</blockquote>\n<p>FSH doesn't know anything about page URLs or stuff like that.  You are now talking about the SUSHI compiler which is different.</p>",
        "id": 196340581,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588700262
    },
    {
        "content": "<p>I think part of the issue is that there's an unclear division of responsibility between SUSHI and the IGPublisher.  The IGPublisher already loads resources from the input folders and automatically populates them into the list of IG artifacts (regardless of format authored in).  It also adds pages for each of those artifacts into the IG for generation of the table of contents.  Therefore, that's <em>not</em> something SUSHI should be doing - because that then gives two sets of code doing the same functionality, but possibly differently and also creates duplication of effort.  If we're going to have a convention by which the same sort of thing can happen with pages, I would again prefer that that be handled via the publisher as it's not something that's FSH-specific.</p>",
        "id": 196341423,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588700699
    },
    {
        "content": "<p>I think there is an unclear division between </p>\n<ul>\n<li>\n<p>sushi as FSH parser, <br>\nand</p>\n</li>\n<li>\n<p>publishing:<br>\n** sushi as a publisher <br>\n** the IG Publisher</p>\n</li>\n</ul>",
        "id": 196342855,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588701432
    },
    {
        "content": "<p>I hope that tools remain interoperable.</p>",
        "id": 196343115,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588701568
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196341423\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196341423\">said</a>:</p>\n<blockquote>\n<p>I think part of the issue is that there's an unclear division of responsibility between SUSHI and the IGPublisher.  The IGPublisher already loads resources from the input folders and automatically populates them into the list of IG artifacts (regardless of format authored in).  It also adds pages for each of those artifacts into the IG for generation of the table of contents.  Therefore, that's <em>not</em> something SUSHI should be doing - because that then gives two sets of code doing the same functionality, but possibly differently and also creates duplication of effort.  If we're going to have a convention by which the same sort of thing can happen with pages, I would again prefer that that be handled via the publisher as it's not something that's FSH-specific.</p>\n</blockquote>\n<p>You need to go back to before SUSHI was integrated with the IGPublisher to see how it was intended to work:</p>\n<p>1) I have a FSH source folder where I create all of my IG source artifacts - profiles, extensions, terminology, examples, page content, etc.<br>\n2) SUSHI takes that source folder and auto-magically figures out how what and how to turn that into an input directory that the IGPublisher can then take and run with.</p>\n<p>To fulfill that use case, what it does now is very good.  It generates the ImplementationGuide.json, the ig.ini, the &lt;insert your IGPublisher source file of choice here&gt; and keeps them all in sync based on what I have in my FSH source folder.  As long as I'm willing to live with the constraints that SUSHI places on me, everything works just fine.  And I would argue that there is definitely no unclear division of responsibility.  SUSHI is a pre-processor that creates an input directory that can be used by the IG Publisher to generate a FHIR IGuide.</p>\n<p>I suspect the confusion comes because you want to treat the FSH files as input files to IGPublisher like any other input file when they weren't intended to be that - they were intended to be generated into input files.</p>",
        "id": 196343930,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588701925
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196341423\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196341423\">said</a>:</p>\n<blockquote>\n<p>The IGPublisher already loads resources from the input folders and automatically populates them into the list of IG artifacts (regardless of format authored in).  It also adds pages for each of those artifacts into the IG for generation of the table of contents. </p>\n</blockquote>\n<p>Is this true?  Because it has definitely not been my experience.  I have spent countless hours pre-FSH/SUSHI adding in my list of extensions <em>by hand</em> into the ImplementationGuide.</p>",
        "id": 196344191,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588702071
    },
    {
        "content": "<p>It's been true for 3-4 months now - one of the features of the IG templates.  The only place where you <em>must</em> mention your resources in the IG is for examples, and that's because the IG pubisher is the only place you can give them a title and a description.  (For the other resources, we grab that from the resources themselves.)  Other than that, the publisher finds them all, groups them into appropriate package based on type and within each package sorts them alphabetically by title.</p>",
        "id": 196344629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588702295
    },
    {
        "content": "<p>I'm totally fine with SUSHI being used as a pre-processor that converts FSH syntax into non-FSH syntax.  To a certain extent, the spreadsheet parser works the same way.  What I'm less comfortable with is having tools write to the 'input' folder.  I think it makes sense for all input (regardless of syntax) to live in one place and the pre-processing steps that happen to be invoked automatically by the IG-publisher.  When we're looking at enhancements that aren't FSH-specific, it would be best if those were in the publisher rather than SUSHI so that IGs that aren't using FSH can still take advantage.</p>",
        "id": 196344951,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588702465
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196344951\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196344951\">said</a>:</p>\n<blockquote>\n<p>I'm totally fine with SUSHI being used as a pre-processor that converts FSH syntax into non-FSH syntax.  To a certain extent, the spreadsheet parser works the same way.  What I'm less comfortable with is having tools write to the 'input' folder.  I think it makes sense for all input (regardless of syntax) to live in one place and the pre-processing steps that happen to be invoked automatically by the IG-publisher.  When we're looking at enhancements that aren't FSH-specific, it would be best if those were in the publisher rather than SUSHI so that IGs that aren't using FSH can still take advantage.</p>\n</blockquote>\n<p>SUSHI isn't writing into the 'input folder.  The only reason that SUSHI currently has its output go in the 'input' folder is because Grahame configured SUSHI to do that in his integration.  There are a multitude of ways that it could have been done that wouldn't have the trouble that we currently have.  Think about the pre-integration steps:<br>\n1) Create FSH files in FSH input folder<br>\n2) Run SUSHI on FSH input folder, creating SUSHI output folder<br>\n3) Copy/Merge SUSHI output folder into IG Publisher input folder<br>\n4) Run IGPublisher</p>\n<p>Right now, in the integrated world, #3 is happening like a blunt tool - we are telling SUSHI to overwrite everything into the IG input directory with its generated files.  Your earlier suggestion of having SUSHI generate into a temp directory and then having a publisher \"merge\" step that copied over the appropriate files from that temp directory into the IG input directory would probably have been safer.  All of this configuration that Chris is suggesting for SUSHI would then be configuration for the IGPublisher to know what to merge and what not to.</p>",
        "id": 196345777,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588702876
    },
    {
        "content": "<p>I'm not totally clear on the notion of 'merging'.  My expectation is that a resource (IG, profile, whatever) will either exist as a .FSH file or it won't.  If there are FSH files, SUSHI will be invoked to produce the relevant artifacts in the temp folder.  The IG publisher will then suck all artifacts - whether in the temp folder or in the input folders and process normally.</p>",
        "id": 196346265,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588703129
    },
    {
        "content": "<p>your expectation is incorrect.  SUSHI does more than that because its users asked the team to have it do more than that.</p>",
        "id": 196346421,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588703204
    },
    {
        "content": "<p>Go to a look at the fhir-medication-list-guidance source in Github to see what I have as my input that produces a fully fleshed out IG</p>",
        "id": 196346740,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588703368
    },
    {
        "content": "<p>perhaps it's my impression but this isn't getting any simpler. <br>\nSushi does write onto the \"input\" folder, because that is the folder where the ig publisher picks up things.</p>",
        "id": 196346899,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588703433
    },
    {
        "content": "<p>The merge option is not really needed, I think - we could add a \"sushi-generated-resources\" in the ig template if that were needed, the IG Publisher would do the rest</p>",
        "id": 196346978,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588703480
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196346899\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196346899\">said</a>:</p>\n<blockquote>\n<p>perhaps it's my impression but this isn't getting any simpler. <br>\nSushi does write onto the \"input\" folder, because that is the folder where the ig publisher picks up things.</p>\n</blockquote>\n<p>No, Sushi writes into its output folder.  That output folder - in the auto-integration world - is also the IG Publisher input folder but it didn't need to be.</p>",
        "id": 196347004,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588703494
    },
    {
        "content": "<p>that was a choice sushi made when using the publisher framework</p>",
        "id": 196347046,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588703520
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196347046\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196347046\">said</a>:</p>\n<blockquote>\n<p>that was a choice sushi made when using the publisher framework</p>\n</blockquote>\n<p>No, that was a choice that Grahame made when using the SUSHI framework.</p>",
        "id": 196347112,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588703539
    },
    {
        "content": "<p>IIRC, sushi did just dump everything into input/resources folder</p>",
        "id": 196347661,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588703830
    },
    {
        "content": "<p>If the sushi conversion was more integrated into the IG build, then it could be used only to convert FSH --&gt;JSON.</p>",
        "id": 196348214,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588704115
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196347661\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196347661\">said</a>:</p>\n<blockquote>\n<p>IIRC, sushi did just dump everything into input/resources folder</p>\n</blockquote>\n<p>Well, it output things into a build directory that had an input directory inside of it.  But it was up to you on how you integrated that into the IG-Publisher.  You could have grabbed it all (which is what effectively the IGPublisher is now doing) or you could have just grabbed the 'examples', 'profiles', 'vocabulary',  and 'extensions' directories, or whatever you wanted.  The way that integration is currently set up, you get it all.</p>",
        "id": 196348271,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588704126
    },
    {
        "content": "<p>I was also uncomfortable with the additional ig-data things that sushi does... but it does them today, so I use them today.</p>",
        "id": 196348297,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588704143
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196348214\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196348214\">said</a>:</p>\n<blockquote>\n<p>If the sushi conversion was more integrated into the IG build, then it could be used only to convert FSH --&gt;JSON.</p>\n</blockquote>\n<p>that is what we started with - sticking to that, ideally without overwriting configuration content.</p>",
        "id": 196348348,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588704180
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196348297\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196348297\">said</a>:</p>\n<blockquote>\n<p>I was also uncomfortable with the additional ig-data things that sushi does... but it does them today, so I use them today.</p>\n</blockquote>\n<p>When I first started using it, I was like you.  But then I saw how it simplified the rest of my work so I bought into it.</p>",
        "id": 196348491,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588704248
    },
    {
        "content": "<p>it did simplify... but as Jose is noting, eventually it gets in the way.</p>",
        "id": 196348557,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588704296
    },
    {
        "content": "<p>so, for some people the current sushi and how it is automated by the ig builder... works Great.</p>",
        "id": 196348631,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588704336
    },
    {
        "content": "<p>for some it doesn't</p>",
        "id": 196348643,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588704342
    },
    {
        "content": "<p>Sure.  but my argument is that the integration with the publisher is causing it to get in the way and not an inherent quality of SUSHI itself</p>",
        "id": 196348655,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588704351
    },
    {
        "content": "<p>careful wording... the sushi tool is causing these issues... not shorthand (FSH) itself</p>",
        "id": 196348796,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588704399
    },
    {
        "content": "<p>sushi as a fsh parser is great - the greatest fsh parser.</p>",
        "id": 196348921,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588704455
    },
    {
        "content": "<p>sushi as an  IG editor may be sufficient for some. for me it isn't</p>",
        "id": 196349048,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588704505
    },
    {
        "content": "<p>I understand that SUSHI <em>is</em> doing more than I've described.  I'm saying it <em>shouldn't</em> be - it should be focused on converting FSH files.  The publisher should be focused on doing the publishing functions.  Having two different tools doing publishing functions isn't a good idea.  I understand that the publishing functions SUSHI is performing are desired.  I also understand that Chris may have been able to move faster at incorporating new functions into his tool than those maintaining the publisher tool have been able to update the IGPublisher.  What I would like to see is that functionality moved from SUSHI into the publisher</p>",
        "id": 196349702,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588704826
    },
    {
        "content": "<p>BTW, I'm assuming that everyone already knows that SUSHI doesn't automatically create all of those files.  Here is the note in the SUSHI User Guide:<br>\n<strong> Note:</strong> If no IG is desired, and you only want to export the FHIR artifacts (e.g., profiles, extensions, etc.), ensure that no ig-data folder is present.</p>",
        "id": 196349781,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588704850
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196349702\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196349702\">said</a>:</p>\n<blockquote>\n<p>Having two different tools doing publishing functions isn't a good idea.  </p>\n</blockquote>\n<p>SUSHI isn't doing \"publishing\" functions.  It is generating content that can be used as input into the IG Publisher toolchain.</p>",
        "id": 196349915,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588704936
    },
    {
        "content": "<p>I think the ig.ini discussion is done. The rest of the substance - menus, config files.. I think should be done in the IG framework.</p>",
        "id": 196350728,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588705224
    },
    {
        "content": "<p>If it's going through the list of files available and supplementing that information into the IG, that has nothing to do with FSH - and <em>is</em> a publishing function</p>",
        "id": 196350895,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588705278
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196350895\" title=\"#narrow/stream/179252-IG-creation/topic/sushi.20-.20ig.20publisher.20integration/near/196350895\">said</a>:</p>\n<blockquote>\n<p>If it's going through the list of files available and supplementing that information into the IG, that has nothing to do with FSH - and <em>is</em> a publishing function</p>\n</blockquote>\n<p>I for one am glad that SUSHI is more than just a FSH compiler.  I'm hopeful that there are other users that agree with me.</p>",
        "id": 196351004,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588705322
    },
    {
        "content": "<p>I'd be more glad if sushi did things that no other tool does - parsing logical models, etc. I really don't mind editing the ig for page structure if that is the price to keep things flexible and in a way that I can industrialize the roll-out of several IGs.</p>",
        "id": 196352086,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588705720
    },
    {
        "content": "<p>I don't have a lot to add, except I've been using FSH/Sushi for learning about IG creation and have been using it to create a couple of local IGs. Typically, I run sushi, and then the igpublisher separately. I've learned (and am still learning) a lot about structure definitions and IG publishing. I do appreciate it's ability for creating a simple IG.</p>",
        "id": 196352207,
        "sender_full_name": " Bob Milius",
        "timestamp": 1588705783
    },
    {
        "content": "<p>I'm going to be very interested to try out the configuration options myself - hopefully over connectathon!. Like Bob &amp; Jean I've found it great for generating simple IGs and hope that the issues for the more advanced users can be resolved with options to turn off features that more advanced users don't want...</p>",
        "id": 196353718,
        "sender_full_name": "David Hay",
        "timestamp": 1588706406
    },
    {
        "content": "<p>I'm not arguing against the features SUSHI has, I'm just arguing about where they ought to be.  We don't want two tools doing the same thing when both of them must be used together to get to a published spec.</p>",
        "id": 196354016,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588706547
    },
    {
        "content": "<p>When an <code>ig-data</code> folder is specified, SUSHI automatically generates an ImplementationGuide resource based off of the resources defined using FSH, and the configuration information given as input to SUSHI. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> would this be something that you would argue SUSHI should not do? As this is somewhat outside the scope of strictly FSH -&gt; JSON.</p>",
        "id": 196354802,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1588706944
    },
    {
        "content": "<p>I would presume there is an IG defined using FSH that specifies stuff like the id, title, description, realm and all of the other essential metadata.  I'd expect SUSHI to turn that IG FHS file into a proper IG.  Populating it with the list of artifacts (and I guess pages if we want to support that) is <em>not</em> something I'd expect SUSHI to do as it has nothing to do with FSH.  That should be a general capability of the IGPublisher</p>",
        "id": 196355408,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588707193
    },
    {
        "content": "<p>so you want the IGPublisher to be able to auto-generate an ImplementationGuide.json?</p>",
        "id": 196356522,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588707638
    },
    {
        "content": "<p>FSH will produce the ImplementationGuide.json (with no listed artifacts and perhaps no listed pages).  The IGPublisher will use the template to figure out what folders to check and find the relevant files and produce an updated ImplementationGuide.json containing the artifacts, pages, etc. complete with descriptions and groupings which it then uses for subsequent processing.  It already does all of that except for the pages bit.</p>",
        "id": 196356792,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588707754
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Would parameters (e.g., special-url) be populated by the IGPublisher? or by Sushi? or by hand?</p>",
        "id": 196357710,
        "sender_full_name": " Bob Milius",
        "timestamp": 1588708172
    },
    {
        "content": "<p>ok, several comments on this thread:</p>\n<ul>\n<li>\n<p>I'm mystified why you would generate a package.json file since that's not input to the IG publisher</p>\n</li>\n<li>\n<p>You should not try generating a package-list.json file, since that is edited only once by editor when submitting, and changes to previous entries are not allowed. Several authors have tried to rewrite history this way. In fact, I'm planning to take package-list.json away from the IG authors altogether</p>\n</li>\n<li>\n<p>The problem driving this discussion is the conflation of two functions - processing FSH files, and preprocessing an IG. It's a guaranteed outcome of pre-processing an IG that you'll hold yourself to the minimum function being everything people want. I think you shouldn't force yourself to do that, and you'll end up with all the same complexity anyway. So don't do that - let people process just the fsh files, and do the rest themselves, and let people who want the easier and more limited pre-processing thing  - it'll be better for them too</p>\n</li>\n</ul>",
        "id": 196359246,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588708811
    },
    {
        "content": "<p>I just created an IGuide from scratch and did <em>not</em> specify a ig-data directory in my fsh directory.  I needed to provide an ig.ini and an input/ImplementationGuide-xxx.json file, and some pagecontent.  The only things that SUSHI created were the extensions, examples, profiles, and terminology artifacts.  My ImplementationGuide only had the meta-data information (id, url, version, etc.), dependsOn, definition with only pages and parameter listed.  And I got basically the same IGuide as i got when I was having SUSHI create a full IG resource.</p>",
        "id": 196361091,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588709666
    },
    {
        "content": "<p>so I think I might need to backtrack some of my more strident comments from earlier. :)  It was my belief that the IGPublisher needed much more of a fleshed-out IG resource than it does.</p>",
        "id": 196361304,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588709793
    },
    {
        "content": "<p>actually, that's never been the case; it's not a recent change. What's recent was actually documenting how to make it work like that</p>",
        "id": 196366214,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588712091
    },
    {
        "content": "<p>Well that and the templates set up to take advantage of it automatically so you didn't have to put a bunch of parameters in place to make it work</p>",
        "id": 196367595,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588712708
    },
    {
        "content": "<p>I took a 2-hour break from Zulip.  45 new messages while I was gone, but good discussion. ;-)  I think we'll have some fun ironing some of this out in the Connectathon!  I'm all for clearer separation between resource generation and publishing.  At the same time, I'm also all for lowering the bar for people to get from <em>nothing</em> to a working IG.  SUSHI made some good early steps toward this goal, but the IG Publisher and template framework have also made some great steps toward that goal.  I think we're mainly on the same page regarding where we want to go (minimizing the barrier to entry while also supporting complex use cases).  Now we just need to figure out how best to get there.</p>",
        "id": 196374861,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588716628
    },
    {
        "content": "<p>Amen!</p>",
        "id": 196374936,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1588716672
    },
    {
        "content": "<p>I'm not looking to revive this thread too much ( <span aria-label=\"grimacing\" class=\"emoji emoji-1f62c\" role=\"img\" title=\"grimacing\">:grimacing:</span> ), but just wanted to address a few loose ends (mostly questions/clarifications for <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and/or <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>)...</p>\n<blockquote>\n<p>If it's going through the list of files available and supplementing that information into the IG, that has nothing to do with FSH - and is a publishing function</p>\n</blockquote>\n<p>I don't think this existed (or apparently may have existed but was not documented) when we first implemented this in SUSHI.  But this is definitely a welcome feature.  Is this the <code>autoload-resources</code> parameter in the IG?  Do authors just set that to <code>true</code> to use it?</p>\n<blockquote>\n<p>I'm mystified why you would generate a package.json file since that's not input to the IG publisher</p>\n</blockquote>\n<p>We don't currently generate <code>package.json</code> in SUSHI; it's actually an <em>input</em> to SUSHI at the moment. That being said, it won't be an input anymore with the new configuration -- so we were actually wondering if there <em>is</em> any need to generate it.  It sounds like maybe there is not?  What about for FHIR packages that are not IGs (or is that just a theoretical concept at this point)?</p>\n<blockquote>\n<p>You should not try generating a package-list.json file, since that is edited only once by editor when submitting, and changes to previous entries are not allowed.</p>\n</blockquote>\n<p>With the new config, the contents of the package-list are managed by the author in the config -- so we're not generating the file out of thin air; we're just providing a more consolidated location for the author to manage its content.  <em>Now</em>, I realize (after this thread) that this approach is still very controversial -- so I'm not suggesting this is the way it <em>should</em> be -- but I just wanted to clarify what it might be (at least temporarily) in the next beta.</p>\n<blockquote>\n<p>In fact, I'm planning to take package-list.json away from the IG authors altogether</p>\n</blockquote>\n<p>I saw some of your proposals regarding Provenance.  Sounds good to me!</p>",
        "id": 196632142,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588770877
    },
    {
        "content": "<p>Ideally, the template should handle the autoload-resource parameter.  My leaning would be to not have SUSHI generate package.json and to use it as ain input instead.  I'm not sure we have any notion of a FHIR package that isn't an IG - do you see a use-case?</p>",
        "id": 196649204,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588778051
    },
    {
        "content": "<blockquote>\n<p>I'm not sure we have any notion of a FHIR package that isn't an IG - do you see a use-case?</p>\n</blockquote>\n<p>I think I just recall some conversations where people were very explicit that it is possible to have a package that is not an IG.  </p>\n<p>As for use cases, I'm not sure -- but I suppose that if a set of profiles is intended to be used only as a dependency of other IGs, then maybe it technically doesn't need all of the things that are typically in an IG (pages, etc); it really just needs the resource definitions themselves and that's it.  Still, as someone _using_ that package as a dependency, I'd probably _want_ some user-facing documentation about the resource definitions, so... that still sounds like an IG to me.</p>\n<p>I'm fine with every package being an IG.  I just thought I remembered people saying it didn't have to be that way.</p>",
        "id": 196652361,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588779276
    },
    {
        "content": "<p>I think part of what we have been going off is the package documentation here <a href=\"https://confluence.hl7.org/display/FHIR/NPM+Package+Specification\" title=\"https://confluence.hl7.org/display/FHIR/NPM+Package+Specification\">https://confluence.hl7.org/display/FHIR/NPM+Package+Specification</a>, which seems to indicate that there definitely  is at least a notion of a FHIR package that isn't an IG. Not saying I know of any use cases necessarily.</p>",
        "id": 196653531,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1588779759
    }
]