[
    {
        "content": "<p>Is this yellow empty box:</p>\n<p><a href=\"/user_uploads/10155/DI8RU-SgmhEyhylMWKgz5WFP/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/DI8RU-SgmhEyhylMWKgz5WFP/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/DI8RU-SgmhEyhylMWKgz5WFP/pasted_image.png\"></a></div><p>a known issue with the new template? I think it happens when you don't have any subheadings on the page...</p>",
        "id": 185877762,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1579221969
    },
    {
        "content": "<p>I've seen that in the past (in either the LIVD or SNOMED IG, I think?) - so I'm pretty sure it isn't new.  I didn't figure out a way to get rid of it so just ended up ignoring it.  I can check and see if it's still showing up.</p>",
        "id": 185879643,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1579224369
    },
    {
        "content": "<p>I just noticed it shows up in <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>'s sample IG, so I'm ignoring it too!</p>",
        "id": 185879936,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1579224756
    },
    {
        "content": "<p>Known issue.  Not currently high on the priority list.  If following good practice, you want fewer longer pages, meaning most pages should have headings.  I can make it disappear for XHTML, but  not markdown - and I <em>don't</em> want authors inserting codes to manually turn the page ToC on and off.</p>",
        "id": 185882546,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579228658
    },
    {
        "content": "<p>Not following - you say best practice is for fewer longer pages which means more short pages? Or am I getting that backwards. Wouln't that mean you'd have fewer sub-headings if the pages are shorter?</p>",
        "id": 185882631,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1579228779
    },
    {
        "content": "<p>Best practice is fewer pages (which generally means longer pages, which means headings).  You don't want readers to have to go through 5 clicks to find what they need - or to continuously click as they're trying to understand the spec.</p>",
        "id": 185927544,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579276213
    }
]