[
    {
        "content": "<p>Elements that have been constrained out of a profile (max cardinality of 0) show up in the list of terminology bindings for the profile. This seems wrong to me. Is there a reason that they should be listed that I'm missing? (e.g. everything under Observation.referenceRange in <a href=\"http://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-Observation-pregnancy-outcome-uv-ips.html\">IPS Observation (Pregnancy: outcome)</a>)</p>\n<p>(I feel like this has been discussed recently, but I can't find the thread.)</p>",
        "id": 240726295,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1622329213
    },
    {
        "content": "<p>Also, when a CodeableConcept has a fixed system and code (e.g., Observation.code in <a href=\"http://hl7.org/fhir/uv/ips/STU1/StructureDefinition-Observation-pregnancy-status-uv-ips.html\">ObservationPregnancyStatusUvIps</a>), should it really show in the bindings list as example? (I assume it does because there wasn't an actual change to the valueset binding, but the use of fixed values basically makes the value set irrelevant.)</p>",
        "id": 240726650,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1622329729
    },
    {
        "content": "<p>That's one of the things I listed in my proposal to split the 'terminology' list into distinct 'snapshot' and 'mustSupport/implementer' views.  The snapshot view would list bindings for everything, even the 0..0 because you might care what it 'could have been', but they'd be filtered out of the other two views, which would be the ones most folks would look at most of the time.  Fixed values are a bit trickier and especially 'patterns'.  While fixed SHOULD make a binding irrelevant, in practice the validator needs to check against both, so not sure whether suppressing it is a good idea s it may confuse.  However, probably sufficient to only show it in the data dictionary view, not the terminology view.  With patterns, both could come into play.</p>",
        "id": 240731845,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622338919
    },
    {
        "content": "<p>OK, I won't bother filing issues; sounds like you're tracking this.</p>",
        "id": 240733175,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1622341114
    },
    {
        "content": "<p>well, i don't think a 0..0 should be shown in either view</p>",
        "id": 240775403,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1622410760
    },
    {
        "content": "<p>We're talking about 3 views (differential, implementation &amp; snapshot), and 3 different 'widgets' (tree view, terminology table and data dictionary) per view.  At minimum, 0..0 binding should show up in the snapshot data dictionary.  It shouldn't appear at all in the differential and implementation views.  I can live either way with whether it shows up in the snapshot tree view and terminology table.</p>",
        "id": 240775904,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622411581
    },
    {
        "content": "<p>I'm presume this is the same issue as above, I am getting, in the Terminology Bindings section, places where it states that the bindings are \"example\" when they are required (or patterns) in the actual profile. </p>\n<p>We got a couple of ballot comment about this - is it something that will change/be fixed? </p>\n<p>Basically - what should our disposition for those comments be? I originally put them as Persuasive and was going to ask for a fix, but maybe that was premature and we need to re-open them?</p>",
        "id": 243075623,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1623959995
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191918\">@Sarah Gaunt</span> It might fix it sometimes.  If there's an example or preferred binding, that should be suppressed from the list if there's a pattern or a fixed value, but if there's a required or extensible binding, those will still need to show up unless the pattern or the fixed value is drawn from the binding, in which case it could also be suppressed.   I've added this as a requirement to <a href=\"https://github.com/HL7/fhir-ig-publisher/issues/272\">https://github.com/HL7/fhir-ig-publisher/issues/272</a></p>",
        "id": 243873812,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624594266
    }
]