[
    {
        "content": "<p>I generated the DTR Questionnaire – R4 StructureDefinition using FHIR Shorthand and noticed that the “Text Summary” tab indicates only 4 mandatory elements. Looking at the “Snapshot Table” tab, I can see there are 5 required fields; so “Text Summary” should indicate 5 mandatory elements.<br>\nI posted this issue to FHIR Shorthand developers on a Slack channel and got back a confirmation that FSH does not generate any of the content that goes into the \"Text Summary\" tab. So this is potentially a problem with the IG Publisher. I am using IG Publisher 1.1.64.</p>",
        "id": 233576041,
        "sender_full_name": "Caleb Wan",
        "timestamp": 1617836256
    },
    {
        "content": "<p>Any chance you can provide hyperlinks to the profile in question?</p>",
        "id": 233590772,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617847216
    },
    {
        "content": "<p>I generated the profile in my local environment; so I cannot provide external hyperlinks at this time.<br>\nIt seems that the count of the mandatory elements showed on Text Summary does not include the required elements from the base profile-hence the discrepancy. <br>\nYou can look at the CQF-Questionnaire <a href=\"http://hl7.org/fhir/R4/cqf-questionnaire.html\">http://hl7.org/fhir/R4/cqf-questionnaire.html</a> as an example.<br>\nThe Snapshot Table tab shows that the “status” field is required, but the Text Summary tab does not indicate any mandatory element.<br>\nMy question: Is the mandatory element count showed on Text Summary supposed to include all required elements from both the derived profile and the base profile?</p>",
        "id": 233686645,
        "sender_full_name": "Caleb Wan",
        "timestamp": 1617900322
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Hope to get an answer to my question I stated on APR 08. Thanks.</p>",
        "id": 234583243,
        "sender_full_name": "Caleb Wan",
        "timestamp": 1618437506
    },
    {
        "content": "<p>I <em>think</em> summary refers to the differential, not the snapshot.  (I've always found the summary view useless, so I totally ignore it.  It's on our list to come up with a better summary as part of IG template updates, but we're not there yet.</p>",
        "id": 234750874,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618520083
    },
    {
        "content": "<p>So I think this is a related issue. (Though not an issue - more like a question/request).</p>\n<p>When you have a profile that is based on another profile - for argument's sake - \"New Patient\" based on  the US Core Patient where we are requiring that patient to have a race (so we've just changed min from 0 to 1 on the race extension).</p>\n<p>Currently it appears that the differential tab for \"New Patient\" would ONLY show that one extra constraint. Which makes sense - presumably it's the differential from the next resource down in the hierarchy (i.e. US Core Patient).</p>\n<p>The only issue is that, in a hierarchical case, this is kind of useless to get a proper view of what the profile really looks like... </p>\n<p>You could go and look at the \"Must support snapshot\" table to get a fuller view of the profile, but even that is a little iffy (means you have to must support every single element).</p>\n<p>You could also look at the \"Snapshot\" table but there is so much information in there that it's overwhelming.</p>\n<p>Would it be possible to have a super useful \"Differential from base FHIR Resource\" tab - this would give an accurate view of exactly what the profile looks like i.e. all changes from the base resource?</p>\n<p>Thoughts?</p>",
        "id": 237416807,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1620171160
    },
    {
        "content": "<p>I have your exact case - Profile A based on US-Core Profile and I agree that a view with a differential from the base would be a great addition.  I have also been creating some abstract base profiles and then creating the implementable ones from that and that makes it even tricker to see what the real differential is.</p>",
        "id": 237421930,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1620174439
    },
    {
        "content": "<p>Yes, we have the same issue with some abstract profiles.</p>",
        "id": 237428706,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1620179107
    },
    {
        "content": "<p>My proposed changes to the \"mustSupport\" view would identify elements whose cardinality or constraints are changed from the base - at least if they're in-scope from a cardinality/mustSupport perspective.  (If you change the cardinality of a child element where the parent is unchanged, not mustSupport and not a modifier, the change from the base wouldn't show up - at least not as I currently envision the algorithm.)</p>",
        "id": 237434875,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620184687
    },
    {
        "content": "<blockquote>\n<p>Differential from base FHIR Resource</p>\n</blockquote>\n<p>It would be nice, but it's not an easy thing for me to generate. I'll add it to my long term todo list</p>",
        "id": 237435012,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620184817
    }
]