[
    {
        "content": "<p>is there a feature planned to connect github with trifolia-on-fhir? Currently we have our IG on github, if we would use Trifolio, could we also have the outcome of the tool pushed to github? Would be nice for triggering CI pipelines.<br>\n<span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span></p>",
        "id": 158896430,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1550594720
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> It's already there. Look under the Import menu. Note, right now only supports importing resources, not other stuff like ad-hock markdown pages that are not defined in the ImplementationGuide resource as Binary contained resources. </p>\n<p>Are you working on a Da Vinci IG by the way?</p>",
        "id": 158993212,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1550682277
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> no i'm working on the CG IG and on internal IGs of our Institute, recently started to try trifolia.<br>\nOur use-case would be the other way round than the import - a export of all StructureDefinitions, VS, CS, etc to a GIT repo. We normally keep our profiles in GIT repos due to merging, versioning and mainly CI stuff like uploading StructureDefinitions to a Server to keep profiles up to date.</p>",
        "id": 158993999,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1550683009
    },
    {
        "content": "<p>The current export renders the IG, if there was a: export all resources in a zip function we could take this zip and put it in our GIT</p>",
        "id": 158994069,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1550683073
    },
    {
        "content": "<p>Yes you can do that. On the export page select your IG, then </p>\n<ul>\n<li>Export format: HTML (IG Publisher)</li>\n<li>Run the IG Publisher: No</li>\n<li>Output Format: either JSON or XML depending on what you work with. </li>\n</ul>\n<p>You will then get a zip with everything</p>",
        "id": 158994536,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1550683436
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>  Under Export Format there is also a GitHub option, but same as with import only supports committing/pushing FHIR resources to github, and then only if you had previously imported them from a github repo  (it remembers the location).</p>",
        "id": 158994622,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1550683486
    },
    {
        "content": "<p>wow. Now i'm impressed, thanks for the explanation. Any Chance to get this also working with a self hosted gitlab?</p>",
        "id": 158995254,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1550683934
    },
    {
        "content": "<p>Well, the IG publisher zip method I described above should work now, but if you mean export directly from the tool to gitlab, not sure as I believe <span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span> used the GitHub API for the integration. Sean, any insight there?</p>",
        "id": 158997110,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1550685258
    },
    {
        "content": "<p>Yes, we are using the GitHub API for the GitHub integration in Trifolia-on-FHIR</p>",
        "id": 158999078,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1550686575
    },
    {
        "content": "<p>Don't think we could adapt it to work with a solf-hosted Git repository, though.</p>",
        "id": 158999152,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1550686645
    }
]