[
    {
        "content": "<p>If you take a look at the differential here: <a href=\"https://build.fhir.org/ig/HL7/fhir-sdoh-clinicalcare/StructureDefinition-SDOHCC-Observation-ScreeningResponseBase-1.html\">https://build.fhir.org/ig/HL7/fhir-sdoh-clinicalcare/StructureDefinition-SDOHCC-Observation-ScreeningResponseBase-1.html</a> and look at effective[x], you'll see that the effectivePeriod slice is listed twice - once because it's one of the allowed types in the base and once because there's a specific slice declared in the differential.  Also, the slices are rendered differently.  The slices should only appear once and should be consistent in rendering whether constrained or not.</p>",
        "id": 216890609,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605542304
    },
    {
        "content": "<p>the slice isn't listed twice. The first time, it shows the possible types for the base, and then it displays the slices</p>",
        "id": 216944921,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1605567619
    },
    {
        "content": "<p>effective[x] is labeled as \"Slice Definition\".  Listing effectiveDate as an allowed element as well as a slice is redundant and confusing.  Intrinsically, if you've got a polymorphic type, your list of supported types is a list of slices.  If some are further constrained and others aren't, that shouldn't affect how you're rendering them</p>",
        "id": 216945648,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605568039
    },
    {
        "content": "<p>perhaps. I'm just explaining why it is how it is. Making the change you propose isn't quick and easy</p>",
        "id": 216945863,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1605568181
    },
    {
        "content": "<p>I recognize that.  It's not a critical/urgent fix, but I think it should be added to the list of things to address at some point.  The way it is now is confusing.</p>",
        "id": 216946020,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605568281
    }
]