[
    {
        "content": "<p>After running the IG Publisher, the qa.html is reporting this error for one of our value set definitions:</p>\n<blockquote>\n<p><strong>Path:</strong> ValueSet/obf-ComorbidConditionVS: ValueSet.compose.include[26].system<br>\n<strong>Severity:</strong> error<br>\n<strong>Message:</strong> URL value '<a href=\"http://hl7.org/fhir/sid/icd-10-cm\" target=\"_blank\" title=\"http://hl7.org/fhir/sid/icd-10-cm\">http://hl7.org/fhir/sid/icd-10-cm</a>' does not resolve</p>\n</blockquote>\n<p>According to <a href=\"http://hl7.org/fhir/R4/icd.html#variants\" target=\"_blank\" title=\"http://hl7.org/fhir/R4/icd.html#variants\">Using ICD-[X] Codes with FHIR</a>, <code>http://hl7.org/fhir/sid/icd-10-cm</code> is the correct URL for the United States ICD-10 code system.</p>\n<p>For this ValueSet, we have several include rules, and this one comes after the include rules to include some SNOMED-CT codes.  I don't know if that's making a difference...</p>",
        "id": 170551613,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1562772800
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> Yes, <a href=\"http://hl7.org/fhir/sid/icd-10-cm\" target=\"_blank\" title=\"http://hl7.org/fhir/sid/icd-10-cm\">http://hl7.org/fhir/sid/icd-10-cm</a> is the correct url, and (at least in a browser) it does actually resolve (but currently only to the R4 Code Systems page), but IG Publisher isn't recognizing that.  Lloyd and I have discussed that and it is a bug that we should fix.  Technically, the system url doesn't even need to resolve (although it's highly recommended), so it shouldn't be generating an error message (a warning would be reasonable).</p>\n<p>Also, it's probably worth noting here that currently the <a href=\"http://tx.fhir.org\" target=\"_blank\" title=\"http://tx.fhir.org\">tx.fhir.org</a> terminology server only supports a limited (hand-picked) set of ICD-10-CM codes.  The reason for that is that there is no obvious reasonably accessible (i.e. free) source of the full ICD-10-CM content in a format that can be transformed to the text file format that the fhirserver uses for importing.  If I can find time to write a transform for that from the XML format from NCHS, that may help some.  But the biggest issue is that even the XML format from NCHS doesn't actually have a listing for all of the available codes - many of the most important (i.e. \"leaf level\" billable) codes are constructed from rules for adding the higher level digits.  Those rules are only described in the PDF or XML files, but the codes themselves are not enumerated.  As far as I've seen, to get the complete list of codes you have to pay for it from one of the commercial vendors who have already done all of the work required to construct the complete list.  So that's a bit of a pain.  And if anyone has a solution to suggest or offer, that would be great.</p>",
        "id": 170562014,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1562780139
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> -- this is really helpful!  Tagging <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> just so he's aware of these nuances as well...</p>",
        "id": 170565833,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1562782704
    }
]