[
    {
        "content": "<p>Next release of the Publisher, UTG will automatically become in scope; any terminology references to content in UTG will automatically start using the latest version of UTG unless you specifically add UTG as a dependency, and specify an alternative version</p>",
        "id": 204533058,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595328323
    },
    {
        "content": "<p>The only reason I can think that this would be a reasonable thing to do is if you need to depend on the current build rather than the most recent release</p>",
        "id": 204533149,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595328375
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> The releases of the Publisher post version 0.0.100 have gotten incrementally worse for the generation of UTG, and I figured it is time I brought this to your attention in case you are not aware.   The change Grahame made scores of releases ago so that value sets with CLDs with enumerated content giving a warning but not a hard error when the underlying code system is not available but still generating the value set in the output appears to have been undone.   There are other gremlins...I am still using 0.0.100 locally as it gives a much cleaner build and I can hunt down the real errors.    How do we want to go about addressing this?</p>",
        "id": 204728569,
        "sender_full_name": "Ted Klein",
        "timestamp": 1595455866
    },
    {
        "content": "<p>it wasn't knowingly undone. Where's an example?</p>",
        "id": 204733514,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595459370
    },
    {
        "content": "<p>In my local build using IGP 0.0.100, the value set \"v3-AudiologistHIPAA\" gives no error.    In the ci build version 1.1.2, we get the error:  /scratch/ig-build-temp-EAUEMD/repo/input/sourceOfTruth/v3/valueSets/v3-AudiologistHIPAA.xml<br>\nPath    Severity    Message<br>\nValueSet/v3-AudiologistHIPAA: ValueSet (l3/c39) Process Info    Validate resource against profile <a href=\"http://hl7.org/fhir/StructureDefinition/ValueSet\">http://hl7.org/fhir/StructureDefinition/ValueSet</a><br>\nValueSet.where(id = 'v3-AudiologistHIPAA')  error   Error from server: Unable to locate code 231H00000N (see Tx log).    There are now MANY like this.</p>",
        "id": 204752126,
        "sender_full_name": "Ted Klein",
        "timestamp": 1595467310
    },
    {
        "content": "<p>and consequential errors from all the ones that include the other ones in their &lt;compose&gt;, so these cascade.   True for the HIPAA ones, the MSH codes, other enumerated stuff - dozens.</p>",
        "id": 204752188,
        "sender_full_name": "Ted Klein",
        "timestamp": 1595467382
    },
    {
        "content": "<p>a raft of build errors as well where is cannot find a bunch of files (xml, json, ttl, html etc) for several that are not building - works just fine in 0.0.100;   so dunno exactly what is going on.</p>",
        "id": 204752290,
        "sender_full_name": "Ted Klein",
        "timestamp": 1595467559
    },
    {
        "content": "<p>ah so this is the result of additional validation checking in the IG Publisher</p>",
        "id": 204758188,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595476368
    },
    {
        "content": "<p>I wasn't checking that valueset.compose.include.concept.code is actually valid, and now I am checking</p>",
        "id": 204758197,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595476390
    },
    {
        "content": "<p>Guessing that might explain this error:</p>\n<p>Stack Dump (for debugging):                                                      (00:26.0101)<br>\njava.lang.NullPointerException<br>\nat org.hl7.fhir.igtools.publisher.Publisher.dependsOnUTG(Publisher.java:1867)<br>\n    at org.hl7.fhir.igtools.publisher.Publisher.initializeFromIg(Publisher.java:1751)<br>\n    at org.hl7.fhir.igtools.publisher.Publisher.initialize(Publisher.java:1363)<br>\n    at org.hl7.fhir.igtools.publisher.Publisher.execute(Publisher.java:700)<br>\n    at org.hl7.fhir.igtools.publisher.Publisher.main(Publisher.java:7811)</p>\n<p>BTW, it seems to be intermittent, so maybe a UTG connectivity issue?</p>",
        "id": 204793799,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1595509496
    },
    {
        "content": "<p>so if the ValueSet.compose.include.concept is from a code system that is not in the IG and not in the server, IMHO that should be a warning not a hard error, and you should generated the value set in the IG output anyway.  Same if the include is for a system that is external or outside the IG.   To do a better job, it would be best if we had an IG parameter that declared a system as being outside the IG and maybe unknown to the server and thus should NOT trigger an error on validate as it is explicitly to be included by the IG author.</p>",
        "id": 204813032,
        "sender_full_name": "Ted Klein",
        "timestamp": 1595518231
    },
    {
        "content": "<p>perhaps the IG parameter 'special-url' which we already have and use can serve this purpose?</p>",
        "id": 204813115,
        "sender_full_name": "Ted Klein",
        "timestamp": 1595518285
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> you should not be getting that error because that code is not released at this point in time. You should take up with <span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span> why trifolia is using the dev branch of the publisher. I do not - and will not - support it's use in production.</p>\n<p>Having said that, I can't see how you get that error. but I can't track it down because it's not the right line</p>",
        "id": 204838539,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595530273
    },
    {
        "content": "<p>We talked about this when you were getting ready to start using GitHub releases... I explained that ToF uses SonaType to get the list of IG Publisher versions (and to ultimately download the selected IG Publisher version). I asked whether or not that would break after you started using GitHub releases, and was told that it would not, and we would have time to adopt the new approach. So, I have backlogged updating ToF to use GitHub releases until a time that it is a priority.</p>",
        "id": 204841721,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1595531717
    },
    {
        "content": "<p>what you didn't say was that this would mean you would stop using the current release and start using the current dev snapshot</p>",
        "id": 204842354,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595532027
    },
    {
        "content": "<p>because that would've changed my answer</p>",
        "id": 204842371,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595532041
    },
    {
        "content": "<p>no I see that this should have been obvious but it wasn't apparent to me</p>",
        "id": 204843084,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595532414
    },
    {
        "content": "<p>I'll try to take some time tomorrow to update ToF to use GitHub releases instead of SonaType</p>",
        "id": 204852062,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1595537454
    },
    {
        "content": "<p>really depends on how my day goes</p>",
        "id": 204852075,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1595537460
    },
    {
        "content": "<p>And Trifolia supports multiple versions of the publisher, so for the moment we are just instructing people to select 1.1.3 vs. the default (which is incorrectly selecting 1.1.4 as you have pointed out). So easy workaround until Sean makes his fix.</p>",
        "id": 204931687,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1595605306
    }
]