[
    {
        "content": "<p>In attempting to get the build of the branch for UTG proposal UP-68 <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> yours - it does not seem to be building the branch in git/UTG.  May have something to do with having the folder 'bugfix' in your branch instead of directly under the UTG master, but I am not skilled enough in git intricacy or build interaction with git to know really.   But the branch was committed and pushed to the UTG git.  Until we get a successful build (builds locally just fine) I cannot push it to Consensus Review.   Anyone have any idea what the issue may be?   <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> maybe some issue around the automation where the extra folder inn the path silently kills it?</p>",
        "id": 200843561,
        "sender_full_name": "Ted Klein",
        "timestamp": 1592186742
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> how would we investigate this?</p>",
        "id": 200843607,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592186781
    },
    {
        "content": "<p>Are there build logs being produced? Can you share a link to the branch in question? (One thought, from previous experience: this IG has needed several times more memory than other IGs, and if that has grown, the build may be running out of RAM.)</p>",
        "id": 200845060,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592189380
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> , no build logs or anything I can see or find.   The Git branch is at <a href=\"https://github.com/HL7/UTG/tree/bugfix/UP-68-clarify-inclusion-nature-of-population-criteria-in-measure-and-measurereport\">https://github.com/HL7/UTG/tree/bugfix/UP-68-clarify-inclusion-nature-of-population-criteria-in-measure-and-measurereport</a>.    Maxxing out the RAM in the java argument to a full 16Gb (all that my laptop has) the build still coredumps locally if I have graphics-heavy apps (like zoom call) running; works ok if I kill them.   (I run on a MacBookPro 2018 model max memory).    The build does not show up with any error or anything on <a href=\"#narrow/stream/179297-committers.2Fnotification/topic/ig-build\">https://chat.fhir.org/#narrow/stream/179297-committers.2Fnotification/topic/ig-build</a>    So I am pretty well at a loss.   the other branches build just fine btw (there are 3 others there for the UP submissions)</p>",
        "id": 200906874,
        "sender_full_name": "Ted Klein",
        "timestamp": 1592235552
    },
    {
        "content": "<p>OK, so you're saying this IG requires 16Gb of RAM to for you to build it locally?</p>",
        "id": 200907307,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592235742
    },
    {
        "content": "<p>We don't have that much allocated. Is there a known issue that's causing this IG to require multiple times more RAM than others?</p>",
        "id": 200907495,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592235839
    },
    {
        "content": "<p>It's a massive IG - 100s of code systems and value sets, some of which are huge.</p>",
        "id": 200909019,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592236499
    },
    {
        "content": "<p>It's really a stress test in terms of size, though not so bad in terms of complexity</p>",
        "id": 200909115,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592236538
    },
    {
        "content": "<p>Yeah what Lloyd said.   5000+ value sets, 700+ code systems.   2.7 million html links.   When I uploaded the initial release (and we are a wee bigger now) it generated 87000+ files.   So it is just a massive huge beast.</p>",
        "id": 200910058,
        "sender_full_name": "Ted Klein",
        "timestamp": 1592236966
    },
    {
        "content": "<p>but interestingly, no real content difference between the cited branch and the others and the current build - the cited branch tweaked several of the concept &lt;definition&gt; strings in ONE code system resource.    The only other difference I could see is that Bryn created a tree node 'bugfix' and the content below that.   Maybe some pathname length issue?   But I am just randomly blabbering here.</p>",
        "id": 200910357,
        "sender_full_name": "Ted Klein",
        "timestamp": 1592237122
    },
    {
        "content": "<p>Ahh, I think I have another about what is going on. I think we don't support Branch names with flashes in them, and this branch name has a slash.</p>",
        "id": 200915930,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592239948
    },
    {
        "content": "<p>The underlying issue is that we map Branch names directly to URL paths, without any kind of conversion or escaping.</p>",
        "id": 200916024,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592239990
    },
    {
        "content": "<p>I added <a href=\"https://github.com/FHIR/auto-ig-builder/issues/14\">https://github.com/FHIR/auto-ig-builder/issues/14</a> to capture this limitation; of course, if anyone is interested in figuring out a way to overcome this limitation and contributing back to the build system, that would be most welcome.</p>",
        "id": 200916270,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592240090
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> I thought that was likely what it was - ok thanks for verifying it.  I'll contact <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> to see how the easiest way will be for use to rectify it without a lot of thrashing.   Thanks!</p>",
        "id": 200934719,
        "sender_full_name": "Ted Klein",
        "timestamp": 1592249709
    },
    {
        "content": "<p>Okay, so I think that happened because when I drafted the proposal I said bug fix (seemed like the most fitting category) instead of custom, so the branch name prefixed that bugfix/</p>",
        "id": 200940730,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1592252663
    },
    {
        "content": "<p>So should I just abandon that branch and draft a new proposal?</p>",
        "id": 200940761,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1592252682
    },
    {
        "content": "<p>That'd be good -- shouldn't involve any new writing, right? Just push a new branch for the same head commit?</p>",
        "id": 200942968,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592253735
    },
    {
        "content": "<p>Yep what Josh said.   Same content but just name the branch like the ticket ID generated by Jira (see UP-64, UP-65, and UP-67 for examples.  We use simple string scripts to for the URL, the branch, the history bundle names, all kinds of stuff.    Many of these might get broken with strange characters like slashes...IMHO no need for 'categories' of types of change proposals; we may see how best to deal with that if a need arises in the future.</p>",
        "id": 200951669,
        "sender_full_name": "Ted Klein",
        "timestamp": 1592258625
    },
    {
        "content": "<p>I created the branch from the JIRA ticket integration though, is there any linkage there that I'd be orphaning by doing that?</p>",
        "id": 200968279,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1592275917
    }
]