[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> has pointed out that the current rendering of value sets is somewhat wonky.  The issue is the fragment for the Content Logical Definition.  As an example, take a look at this: <a href=\"http://build.fhir.org/ig/HL7/sdc/ValueSet-species.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/sdc/ValueSet-species.html\">http://build.fhir.org/ig/HL7/sdc/ValueSet-species.html</a><br>\nRight under the level 3 heading for \"Content Logical Definition\", we have a level 2 heading that (unnecessarily) repeats the name of the value set.  Then we have the description of the value set and the copyright - but that's already covered earlier on in the summary - and has nothing to do with the \"content logical definition\".</p>\n<p>I'd like to strip out that heading, the definition and the copyright declaration from the CLD fragment.  Does anyone have any concerns with this?</p>",
        "id": 187144384,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580527342
    },
    {
        "content": "<p>I'm ok with that change (though it's not a simple fix because the underlying rendering code has multiple uses)</p>",
        "id": 187144765,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580528168
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Where are we with this?  It doesn't appear that anything has happened with it yet.  The default rendering (unless you override the generated text) is rather ugly and problematic, particularly for some of the value sets that we are using now in IPS that are based on the GPS - the formatted copyright information shows up nicely in the table, but the redundant text (including the repeated copyright details) below it is not only unnecessary and distracting but it also doesn't process the markdown  - see the allergy reaction example <a href=\"https://build.fhir.org/ig/HL7/fhir-ips/ValueSet-allergy-reaction-gps-uv-ips.html\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/fhir-ips/ValueSet-allergy-reaction-gps-uv-ips.html\">here</a>.</p>",
        "id": 189797924,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1583419334
    },
    {
        "content": "<p>And another issue with the rendering is that if (as in the above example) a compose.include.version is set, that is not displayed anywhere, and the text for \"Expansion based on ...\" may be incorrect.  In this instance the SNOMED version has been set to the 20190731 version of the International Release (as that is what the current GPS is based on), but the text for the expansion says \"Expansion based on SNOMED CT International edition 31-Jan 2020\".</p>",
        "id": 189798396,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1583419642
    },
    {
        "content": "<p>I guess the first step is a change request.  Created here: <a href=\"http://jira.hl7.org/browse/FHIR-26458\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-26458\">FHIR#26458</a></p>",
        "id": 189813444,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583427927
    },
    {
        "content": "<p>I'd suggest creating a different issue for the release issue as I think that would be a different issue to fix.</p>",
        "id": 189813493,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583427953
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Should <a href=\"http://jira.hl7.org/browse/FHIR-26458\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-26458\">FHIR#26458</a> be FHIR-I or Vocab?  Probably we want both to weigh in.</p>",
        "id": 189828799,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1583437374
    },
    {
        "content": "<p>Here's the tracker for the fixed version issue: <a href=\"http://jira.hl7.org/browse/FHIR-26462\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-26462\">FHIR#26462</a></p>",
        "id": 189830948,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1583438801
    },
    {
        "content": "<blockquote>\n<p>the text for \"Expansion based on ...\" may be incorrect</p>\n</blockquote>\n<p>On what grounds do you think it's incorrect?</p>",
        "id": 189832153,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583439660
    },
    {
        "content": "<blockquote>\n<p>Should <a href=\"http://jira.hl7.org/browse/FHIR-26458\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-26458\">FHIR#26458</a> be FHIR-I or Vocab?</p>\n</blockquote>\n<p>Neither. It belongs to a group we haven't yet created that approves functional changes to the IG publisher</p>",
        "id": 189832356,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583439801
    },
    {
        "content": "<p>but this particular one should not a jira issue anyway, since it's actually a bug.</p>",
        "id": 189832672,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583440018
    },
    {
        "content": "<p>well, it's a matter of perspective</p>",
        "id": 189832684,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583440024
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> The reason I think it's incorrect is because (for example) in the value set definition compose.include.version is being set to <code>http://snomed.info/sct/900000000000207008/version/20190731</code>, but when the value set is expanded the message says:</p>\n<blockquote>\n<p>Expansion based on SNOMED CT International edition 31-Jan 2020</p>\n</blockquote>\n<p>So either the message is wrong, or the tx server isn't paying attention to the version specified in the definition (I'll verify which it is).</p>",
        "id": 189832899,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1583440185
    },
    {
        "content": "<blockquote>\n<p>I'll verify which it is</p>\n</blockquote>\n<p>yes please</p>",
        "id": 189832968,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583440205
    },
    {
        "content": "<p>I think <a href=\"http://jira.hl7.org/browse/FHIR-26458\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-26458\">FHIR#26458</a> is purely a rendering issue.  We're not changing what information is presented, just ensuring it's all in one place and the heading hierarchy isn't broken.  That's not really a content discussion.  However, if vocab wants to discuss, they can I guess...</p>",
        "id": 189837347,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583442986
    },
    {
        "content": "<p>Yes, I think that's correct.  I can probably live with that answer (and let FHIR-I do the work). :)  Vocab can still take a look and comment if that seems useful.</p>",
        "id": 189837574,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1583443161
    },
    {
        "content": "<p>Do we have any kind of ETA on the updates for <a href=\"http://jira.hl7.org/browse/FHIR-26458\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-26458\">FHIR#26458</a>?  Assuming that won't be immediate, I think for the IPS publication we will manually create the ValueSet.text for all of our ValueSet resource instances in the IG so that the rendering will be cleaner.</p>",
        "id": 190124277,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1583792531
    },
    {
        "content": "<p>I could try to have a go at it (it will be useful for my work) but I can't see this in the template.<br>\nI think this extra content (which seems indeed strange to be duplicate) comes from {{[type]}}-{{[id]}}-cld.xhtml - where is this created in the template? <br>\n<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ?</p>",
        "id": 190125136,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583793181
    },
    {
        "content": "<p>It's hardcoded in the Java.  And as Grahame mentioned, that code is used in multiple places, so it's not a simple change.</p>",
        "id": 190126411,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583794237
    },
    {
        "content": "<p>Is there a reason that we couldn't branch and execute different code for rendering the value sets?</p>",
        "id": 190126973,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1583794738
    },
    {
        "content": "<p>You can branch to test, but we <em>don't</em> want people using forks of the publisher</p>",
        "id": 190127628,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583795278
    },
    {
        "content": "<p>I think those fixes are deployed now</p>",
        "id": 190131975,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583799804
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 190134749,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1583803180
    },
    {
        "content": "<p>Something seems to have changed and this is again a significant issue.  As I mentioned on March 9, in IPS we manually added ValueSet.text which considerably cleaned up the rendering, particularly for the large extensionally defined value sets (e.g. from SNOMED GPS).  But for some reason that is no longer working and the generated text from the publisher is being displayed, including the full extensional definitions (which are essentially redundant content with the expansions but also are <strong>not</strong> truncated to display \"only\" 1000 concepts!).  For the full GPS value set this means that the entire set of 21789 concepts in the definition are being shown (I certainly didn't count them on the page, but it looks like they're probably all there), in addition to the subset of 1000 that is also shown for the expansion.  I thought that I would try changing the text.status to \"additional\", rather than \"generated\" to see if that would affect the rendering, but it didn't change anything.  We do need some kind of a solution now for this, so we can publish IPS with this content included.</p>",
        "id": 191791283,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585161011
    },
    {
        "content": "<p>which value set is this?</p>",
        "id": 191802687,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585166099
    },
    {
        "content": "<p>It's not just one.  We have a few GPS value sets (and will have more when we are done), and I think some other larger extensionally defined ones, and it applies to all of them.  But the largest one is snomed-intl-gps (it's in the latest CI build).</p>",
        "id": 191815185,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585172863
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Have you had a chance to look at this?  The change occurred in 1.0.71.  The PR that I submitted restores the rendering of ValueSet.text (as it was prior to 1.0.71) and that takes care of our issue.  Without that, as it is now, the ValueSet pages can be incredibly large and also incredibly slow to build.  With IG Publisher 1.0.73, generating the output for ValueSet/snomed-intl-gps takes about 28 minutes (on my machine), but it only takes 2 seconds using the patched 1.0.73 with the ValueSet.text rendering restored.</p>",
        "id": 191958490,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585262674
    },
    {
        "content": "<p>ok I've figured out the context now. There was a reason why this change was made</p>",
        "id": 191972510,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585278233
    },
    {
        "content": "<p>I figured there was.  What is it?</p>",
        "id": 191972559,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585278261
    },
    {
        "content": "<p>The problem is that the narrative of the resource is a representation of <strong>resource</strong> not just the cld. SO people were complaining about the representation of value sets because the cld contained extra duplicate information. The proposed solution was to remove that from the resource, but the context belongs in the resource. </p>\n<p>Inb the IG context, the cld is a rendering of the cld, but the resource. And the code you are looking there is the code to generate the cld.</p>",
        "id": 191972604,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585278347
    },
    {
        "content": "<p>Yes, I am aware of the issue and completely agree with what you are saying.  Except that I'm not sure what you mean by \"but the context belongs in the resource\".  But what we have now does not work for the larger extensionally defined value sets.  We need something else.  Being able to use Valueset.text to explicitly specify the cld text was a compromise that at least allowed a somewhat reasonable rendering and a workable build time, when you needed it (even if technically not correct).</p>",
        "id": 191972783,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585278673
    },
    {
        "content": "<p>I would be even (much) happier to figure out a better way to do it.</p>",
        "id": 191972930,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585278892
    },
    {
        "content": "<p>What I think we need is a way to either turn off the automatic generation of the enumerated cld (and possibly replace it with descriptive text).  That could be done automatically if the number of concepts in an extensional definition exceeds a particular threshold (maybe 200?), or maybe a \"flag\" to do that could be manually set (that would presumably be set outside of the ValueSet resource itself - probably in the IG resource entry for the ValueSet resource instance?).</p>",
        "id": 191973484,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585279686
    },
    {
        "content": "<p>so I think it needs to be some flag somewhere, yes. I'm trying to think what the most appropriate and simplest option is</p>",
        "id": 191973679,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585280005
    },
    {
        "content": "<p>Actually, maybe this could be even a lot simpler than anything that I just said.  For almost all extensionally defined value sets there is little or no value in listing the concepts in the cld, as they will be immediately repeated in the expansion.  So maybe the default should be to never display the contents of compose.include.concept.  The <strong>only</strong> time that it could make sense, maybe, is in the much less common case where compose.inactive = false and the cld and the expansion might be different  - maybe the rule should be to only enumerate the compose.include.concept contents in that specific case?</p>",
        "id": 191973949,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585280453
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 191974594,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585281366
    },
    {
        "content": "<p>well, kind of depends whether you think a supplied expansion is reliable. I think... not</p>",
        "id": 191999658,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585305442
    },
    {
        "content": "<p>ok so here's what I'll do: I'll look in the narrative and if I see a root level div with an id which is \"cld\", then I'll treat that as the set rendering for the cld. </p>\n<div class=\"codehilite\"><pre><span></span><span class=\"nt\">&lt;div</span> <span class=\"na\">xmlns=</span><span class=\"s\">&quot;[xhtml]&quot;</span><span class=\"nt\">&gt;</span>\n  <span class=\"nt\">&lt;div</span> <span class=\"na\">id=</span><span class=\"s\">&quot;cld&quot;</span><span class=\"nt\">&gt;</span>cld rendering goes here<span class=\"nt\">&lt;/div&gt;</span>\n<span class=\"nt\">&lt;/div&gt;</span>\n</pre></div>",
        "id": 192005665,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585309255
    },
    {
        "content": "<p>No, I wasn't talking about a supplied expansion - only supplied text.  The generated expansion is what we want - just don't also repeat it in the cld rendering.</p>",
        "id": 192014100,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585314736
    },
    {
        "content": "<p>Your proposal sounds like a simple and good solution, though.</p>",
        "id": 192014242,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585314790
    },
    {
        "content": "<p>We still will have the issue, though, that DomainResource.text is intended to be the text for the <strong>entire</strong> resource instance.  But what we want is to have the generated text for all of the resource <strong>except</strong> for the cld, and to be able to supply the text to be rendered only for that.  Your proposal, though, probably still is a reasonable compromise to be able to get the result that we need.</p>",
        "id": 192016150,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585315671
    },
    {
        "content": "<p>Also, I'll circle back again and say that if the narrative generation for the value set cld was set so that it would not enumerate the concepts in the cld for extensionally defined value sets (those using compose.include.concept) where the number of included concepts exceeds a threshold of maybe 200, then I think that would work, without any need to do anything special (or technically incorrect) using ValueSet.text.  I'll take a look at the code.</p>",
        "id": 192062547,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585334634
    },
    {
        "content": "<p>yes but I won't do that since the expansion doesn't necessarily include all the concepts in the enumeration</p>",
        "id": 192063255,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585334890
    },
    {
        "content": "<p>Yes, the expansion doesn't necessarily include all of the concepts in the enumeration.  But in what circumstances does that occur and when would it be a significant concern?  For extensional (enumerated) value set definitions <strong>usually</strong> the enumeration of the cld and the expansion are going to be the same.  The cases where they are not (or might not be) are: (1) ValueSet.compose.inactive = false (or if the particular server default behavior is equivalent to that); (2) $expand activeOnly = true; and (3) the expansion is truncated because it contains too many (i.e. &gt; 1000 concepts).  Have I missed anything?  For #1, I think we can say that because the cld <strong>might</strong> be different from the expansion in that case we'll always enumerate it.  I think that setting compose.inactive = false is done infrequently enough that I don't have any concern about making that the rule.  For #2, passing activeOnly = true to $expand isn't something that we have a way to do or control in the context of IG publishing (as far as I can recall).  But if it is possible that activeOnly may be set to true in some cases for IG publishing, then we can treat it the same as #1.</p>\n<p>So #3 is where the issue is.  For enumerated value sets with &gt; 1000 (or even &gt; 200) concepts, is it practically useful to display all of those concepts in the definition section of the value set page in the IG?  Can anyone read that content and make any meaningful use or comparisons from it?  My argument is that they can't - and if they can't, and if having that content on the page actually makes reading the page more difficult, they why should we have it there?  Also, as I mentioned before, the IG Publisher has terrible performance when generating the pages for value sets that have that much (or considerably more) enumerated content, so there needs to be some means of suppressing that output.  Can't the default for those cases be that the enumerated cld contents are not displayed on the page at all (which at least isn't inconsistent, and is what the ValueSet.text workaround does) and that the expectation in those cases is that if you need to have the actual contents of the value set definition you get that from the value set resource instance itself?</p>",
        "id": 192069584,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585337774
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Thanks for the commit on looking for the &lt;div id=\"cld\"&gt;.  That allows us to deal with the current issue.  But I think the above is still something to consider.</p>",
        "id": 192072652,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585339442
    },
    {
        "content": "<p>hi<br>\ni have a question about valueset rendering in the CLD part. we have in two different implementation guides two different renderings.<br>\none <a href=\"http://build.fhir.org/ig/ehealthsuisse/ch-emed/ValueSet-ActivePharmaceuticalIngredient.html\">http://build.fhir.org/ig/ehealthsuisse/ch-emed/ValueSet-ActivePharmaceuticalIngredient.html</a> where we have first the table with code/display and then the translation table. in the second example <a href=\"http://build.fhir.org/ig/ehealthsuisse/ch-vacd/ValueSet-ch-vacd-laboratory-serology-vs.html\">http://build.fhir.org/ig/ehealthsuisse/ch-vacd/ValueSet-ch-vacd-laboratory-serology-vs.html</a> we have directly the translation table.<br>\ncan this be changed by a flag or definition somewhere in the IG? both pages are builded with the same version.</p>",
        "id": 239707969,
        "sender_full_name": "Roeland Luykx",
        "timestamp": 1621582152
    },
    {
        "content": "<p>sorry, the problem seems disappeared.. has there something changed on the build server?</p>",
        "id": 239721541,
        "sender_full_name": "Roeland Luykx",
        "timestamp": 1621589217
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 239740207,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621599364
    },
    {
        "content": "<p>nothing changed in this space in the last month, at least</p>",
        "id": 240125893,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1621898702
    },
    {
        "content": "<p>I have an IG with a ValueSet in it that is rendering oddly.</p>\n<p>On the Narrative tab of the ValueSet, the summary shows version 0.1.0, which is the version of my IG. However, my ValueSet resource is version \"20160311\", which is the value I would have expected to show up here.</p>\n<p>Also, the logical definition says \"All codes from <a href=\"http://terminology.hl7.org/2.1.0/CodeSystem-v3-AcknowledgementCondition\">http://terminology.hl7.org/2.1.0/CodeSystem-v3-AcknowledgementCondition</a>\" however there is no ValueSet.compose element (the ValueSet is defined entirely by the expansion), so I don't see how it knows that the valueset is \"all codes\". Further, it isn't actually all codes -- the current definition of the code system includes one concept that isn't present in my value set.</p>",
        "id": 250707022,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1629941139
    },
    {
        "content": "<p>have you tried clearing your txCache?</p>",
        "id": 250707648,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629941743
    },
    {
        "content": "<p>I have now. Still getting the same problems.</p>",
        "id": 250708330,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1629942338
    },
    {
        "content": "<p>how do I reproduce?</p>",
        "id": 250708556,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629942537
    },
    {
        "content": "<p>Just pushed to the tx project on <a href=\"https://github.com/ElliotSilver/infoway-tx\">https://github.com/ElliotSilver/infoway-tx</a></p>",
        "id": 250708942,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1629942875
    },
    {
        "content": "<p>what do I run?</p>",
        "id": 250709187,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1629943159
    }
]