[
    {
        "content": "<p>When the publisher expands a value set it cuts off a 1000 codes. If the valueset only contains one expansion, it give a warning that there are more than 1000 elements. However, it looks like it silently cuts off the expansion when there is more than one source for the content. For example: <a href=\"http://hl7.org/fhir/R4/valueset-condition-stage-type.html\">http://hl7.org/fhir/R4/valueset-condition-stage-type.html</a>. I can't imaging that \"codes from <a href=\"http://snomed.info/sct\">http://snomed.info/sct</a>  where concept is-a 254291000 (Staging and scales)\" has exactly 1000 values (actually, it looks to have 1595), and the two values explictly added make the expansion add up to 1002 values. I'd suggest that the display always get cut off at 1000 item, and if any component (or the union of all components) is more than 1000 values, that the warning gets shown.</p>",
        "id": 239969440,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1621794540
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - is this publisher or tx server, and for the latter, where best to log?</p>",
        "id": 239972120,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621797344
    },
    {
        "content": "<p>I saw it in FHIR core, so I'm not sure it's an IG publisher issue.</p>",
        "id": 239972597,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1621797873
    },
    {
        "content": "<p>This came up and was reported along time ago (don't recall if there was a GH issue?), and I actually thought it had probably been addressed (but obviously hadn't verified).</p>",
        "id": 239978493,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1621804359
    },
    {
        "content": "<p>yes I think this issue is addressed now. If you can find something being built now with this issue, I'll look at it</p>",
        "id": 240125772,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1621898597
    },
    {
        "content": "<p>OK, I'll keep an eye out.</p>",
        "id": 240137514,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1621911630
    }
]