[
    {
        "content": "<p>what does  CapabilityStatement.implementationGuide mean exactly?  My assumption is the IG capabilitystatement  iand other conformance language is inherited.  However that falls apart when the IG you are referencing does not have capabilitystatements like DaVinci HREX.  then I have no idea what it means and I have to make my own capabilitystatements for the expectations of the inherited artifacts.</p>",
        "id": 225227604,
        "sender_full_name": "Eric Haas",
        "timestamp": 1612475025
    },
    {
        "content": "<p>So Two things to unpack 1) what doe s the element mean when there is a CapabilityStatement and when there is not?<br>\n2) Why does HREX push this burden  onto a dependent IG  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ?</p>",
        "id": 225227860,
        "sender_full_name": "Eric Haas",
        "timestamp": 1612475112
    },
    {
        "content": "<p>I really don't know.  It would make more sense to point to specific CapabilityStatements within the IG that you conform to.  Don't understand your second question - what burden is HRex pushing?</p>",
        "id": 225228693,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612475494
    },
    {
        "content": "<p>I think it if the IG doesn't have a capabibility statement, it can still have meaning but it won't be so directly computable</p>",
        "id": 225239031,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612480736
    },
    {
        "content": "<p>Since HReX has no expectations q dependent if need a to go through and generate its own.  That is done multiple times instead of a single inheritance</p>",
        "id": 225241384,
        "sender_full_name": "Eric Haas",
        "timestamp": 1612482166
    },
    {
        "content": "<p>A dependent ig</p>",
        "id": 225241677,
        "sender_full_name": "Eric Haas",
        "timestamp": 1612482340
    },
    {
        "content": "<p>Not q</p>",
        "id": 225241698,
        "sender_full_name": "Eric Haas",
        "timestamp": 1612482354
    },
    {
        "content": "<p>I don't understand what you're saying Eric</p>",
        "id": 225256173,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612494729
    },
    {
        "content": "<p>If CDEX's expectation is for the server to support HREX in its entirety ( using CapabilityStatement.ImplementationGuide ).   It is not clear what the means because HREX lacks a CS that lays out its expectations.   I think it is important for HREX to provide the conformance expectations in a CS even if they are SHOULDS or MAY so it is clear what expectations are inherited by the CDEX.   If this is not the case then how is CapabilityStatement.ImplementationGuide to be used.  Are there additional constraints on this use of this element ? The alternative is for the CDEX guide to have to decide what the HREX expectations are in its expectations.</p>",
        "id": 225382790,
        "sender_full_name": "Eric Haas",
        "timestamp": 1612580632
    }
]