[
    {
        "content": "<p>For some reason Forge populated all my display elements of a codeableConcept with this</p>\n<div class=\"codehilite\"><pre><span></span>  &lt;extension url=&quot;http://hl7.org/fhir/StructureDefinition/elementdefinition-translatable&quot;&gt;\n    &lt;valueBoolean value=&quot;true&quot; /&gt;\n  &lt;/extension&gt;\n</pre></div>\n\n\n<p>What is the implication of that entrant (I think I know) but why only on the display (maybe I don't know the implication)? What would be the consequences of removing it? My feeling is that it is Forge-specific and I can safely strip it out.</p>",
        "id": 153997029,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1536938392
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span>, this extension is inherited from the core datatype definition (profiles-types.xml). NB same extension is also introduced by the CodeableConcept.text element. Base constraints, incl. extensions, are included in the diff when you constrain an element.<br>\nIIRC, there is a GForge ticket that suggests to introduce a way for extensions to define the desired inheritance behavior. This would allow us to say that e.g. the translatable extensions shouldn't be inherited by derived profiles. I've hardcoded info about some known core extensions into Forge, to prevent these from being inherited (which confused users), however apparently Forge does not (yet) recognize the translateable extension.</p>",
        "id": 153997298,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1537175230
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  Okay, I think I partially understand. I just was not sure why it was there and only present in a few select elements. In particular the display element of a codeable concept but no others. Since I didn't know why it was there, if I were writing the SD from scratch, I would not have included it or thought to include it. So I wondered what the consequence of removing it would be.</p>\n<p>At this time I have removed it and as far as I can tell , it makes no difference (so far) on the rendering done by the IG Publisher. But my guide is in a very youthful stage since I really have not yet grasped how all these details work. In Forge and Simplifer, all these details were hidden so you didn't have to pay attention to all the gory details. Now I have to code structure definitions using xml (the only tool I have is Notepad++)!</p>",
        "id": 153997300,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537175680
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span>, these extensions are inherited implicitly anyway, so I think you can safely delete them from the diff. If necessary, you could always re-expand the snapshot the include all inherited constraints.</p>",
        "id": 153997305,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1537176105
    },
    {
        "content": "<blockquote>\n<p>Hi <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span>, these extensions are inherited implicitly anyway, so I think you can safely delete them from the diff. If necessary, you could always re-expand the snapshot the include all inherited constraints.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  I have. They were only present in a few elements. Always in display elements. Can't remember what else.</p>",
        "id": 153999408,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537784791
    }
]