[
    {
        "content": "<p>I understand that we're in the process of specifying how IPS documents can be queried ($docref, $summary). Has the group discussed how IPS documents should be pushed?</p>",
        "id": 271340929,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644437716
    },
    {
        "content": "<p>It seems like a simple <code>POST /Bundle</code>would work, right? </p>\n<ul>\n<li><a href=\"http://www.hl7.org/fhir/documents.html#bundle\">http://www.hl7.org/fhir/documents.html#bundle</a></li>\n</ul>",
        "id": 271340935,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644437720
    },
    {
        "content": "<p>Note that <code>POST /Bundle</code> implies that the Bundle is persisted as is, and available to subsequent read and search interactions. I am not sure that there are many servers ready or willing to do that.</p>",
        "id": 271343362,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1644438864
    },
    {
        "content": "<p>If the Bundle is persisted intact as a document bundle, I think that HAPI and many other servers shouldn't have any problem with that.  What we <strong>may</strong> need for IPS though, is some kind of \"hybrid\" behavior on a server, possibly where the document bundle could be persisted (or re-assembled without loss), <strong>plus</strong> the ability to also break down the bundle into its components that are available for secondary uses (e.g., generating a vaccine certificate or incorporating into the expected locations in an EHR?).  That would be custom behavior for IPS, but I don't see in principle why something like that couldn't be done.</p>",
        "id": 271346218,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1644440255
    },
    {
        "content": "<p>Yeah, we've certainly been wondering about the receiving end of IPS. Lots of work going on with generating them and getting them into a patient's hands, but little discussion about what to do to get it back into a clinician's system. Do we expect the documents to be persisted as received, or document patient resources replaced with system patient resources, etc. We don't have an answer for any of this yet.</p>",
        "id": 271355575,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1644444926
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/207835-IPS/topic/.22push.22.20IPS.3F/near/271343362\">said</a>:</p>\n<blockquote>\n<p>Note that <code>POST /Bundle</code> implies that the Bundle is persisted as is, and available to subsequent read and search interactions. I am not sure that there are many servers ready or willing to do that.</p>\n</blockquote>\n<p>You can do that on my Server (Terminz) subject to the following...<br>\nBundle.Type == Bundle.BundleType.Document<br>\nComposition.Type.coding.system=\"<a href=\"http://loinc.org\">http://loinc.org</a>\" and code=\"60591-5\" <br>\nContains one Composition and one Patient Resource<br>\nContains at least one of each of these resources - AllergyIntolerance, Condition and MedicationStatement (or MedicationRequest).<br>\nIncludes at least one Patient.Identifier with populated system and value elements (these are used for persistence and $summary request purposes)<br>\nRequests are via the patient/$summary operation <a href=\"https://jira.hl7.org/browse/FHIR-32014\">deferred to R6 by PA yesterday</a>.<br>\nI don't support requests for the individual resources within the Composition.</p>",
        "id": 271365505,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1644450696
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  Yes, a work in progress (just beginning).  Likely to have at least a few possible answers.  And definitely time to be thinking about it.</p>",
        "id": 271365660,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1644450788
    }
]