[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"311963\">@Nancy Lush</span> , <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> , I understand that you demoed your patient summary solution at today's GDHP session. I wasn't able to attend, and only heard about it second hand, but it raised some questions for me (and it ties in with something I was <a href=\"#narrow/stream/179166-implementers/topic/Search.20by.20document.20patient.20id/near/269320654\">asking</a> about recently).</p>\n<p>If someone asks for a summary, you're allowed to return an existing one, but how do you determine that there is an existing one? In your system, can you have a document for someone other than a locally known patient, and if so what would happen if I tried to ask for that document to be returned in a summary? (I know you can't actually ask for a document to be returned, but I mean invoke the operation in such a way that that existing document would otherwise be returned).</p>",
        "id": 269460901,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1643222622
    },
    {
        "content": "<p>It's worth reading <a href=\"http://build.fhir.org/ig/HL7/fhir-ips/ipsGeneration.html\">this</a> new page in the IPS IG. Whether there is a pre-existing summary on a server, or it will attempt to create one 'on-the-fly' will depend on individual system requirements. Suffice to say that healthcare data is event-driven and pre-build summaries can quickly go stale.</p>",
        "id": 269475121,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1643228249
    },
    {
        "content": "<blockquote>\n<p>Using a $summary operation on the Patient resource. ... This operation is similar to how the $everything operation works on the Patient resource. </p>\n</blockquote>\n<p>So, by my read, there must be a Patient resource (at /Patient) that this is being invoked on; and having a patient that exists only in an existing document bundle isn't sufficient.</p>",
        "id": 269476100,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1643228544
    },
    {
        "content": "<p>That's not quite how I read it. AFAIA,  a server can hold an IPS instance without 'having' (i.e. persisting) all of the individual resources in the Bundle (i.e. the resource references can point to another server) - e.g. if it is an aggregator that takes information from other servers. In that case, it may 'have' a patient resource for the purposes of creating  the Bundle, but might not persist it thereafter. The aim here would be to reduce the number of copies of data in a particular eco-system.</p>",
        "id": 269477828,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1643229294
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  Here's two workflows for consideration: <br>\n1) If a server has stored an IPS Bundle, then a DocumentReference could be created to point to that Bundle. Using search on DocumentReference or a $docref operation, you may be able to find the IPS reference even if all data haven't been persisted as discrete resources. </p>\n<p>2) If the Patient resource exists, then using $summary would allow you to create an IPS from information in that system using the rules that system has for creating a patient summary (so long as it meet minimum IPS requirements). </p>\n<p>I do agree with <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> that summaries can go stale quickly. In the US, C-CDAs run into this concern quite readily. While the answer isn't always to make things \"on-demand\" that often is regarded as the safest option. On demand C-CDA generation with FHIR is something supported in the US through $docref operation: <a href=\"https://www.hl7.org/fhir/us/core/OperationDefinition-docref.html\">https://www.hl7.org/fhir/us/core/OperationDefinition-docref.html</a></p>\n<p>Welcome feedback on this topic and the new page (<a href=\"http://build.fhir.org/ig/HL7/fhir-ips/ipsGeneration.html\">http://build.fhir.org/ig/HL7/fhir-ips/ipsGeneration.html</a>) referenced by Peter. </p>\n<p>Finally, the demo yesterday was similar to the presentation during the HL7 FHIR Connectathon IPS Track. The zoom recording for that is in the IPS Stream, but posting again for convenience (Nancy presents a bit after 34 mins): <a href=\"https://zoom.us/rec/play/COgOinHsFTePi5cwL-8I4gwysO8iCAQiCLPRPveR3V1eu4x0QvJghnbZHDYE0K_GGM5r5YPtwRPw4ba2.sCVWtbtbKD7AzQ06?continueMode=true&amp;_x_zm_rtaid=QT1rZ3qDT2yr12svo4eqdw.1641999887848.2ca39a670173d95032306e44eb01720a&amp;_x_zm_rhtaid=759\">https://zoom.us/rec/play/COgOinHsFTePi5cwL-8I4gwysO8iCAQiCLPRPveR3V1eu4x0QvJghnbZHDYE0K_GGM5r5YPtwRPw4ba2.sCVWtbtbKD7AzQ06?continueMode=true&amp;_x_zm_rtaid=QT1rZ3qDT2yr12svo4eqdw.1641999887848.2ca39a670173d95032306e44eb01720a&amp;_x_zm_rhtaid=759</a></p>",
        "id": 269607338,
        "sender_full_name": "John D'Amore",
        "timestamp": 1643304538
    }
]