[
    {
        "content": "<p>Are there any FHIR servers available for testing IPS that currently support searches against Bundle using the following parameter chain: bundle.composition.patient.identifier? </p>\n<p>We're trying to test the boundaries of searching within Bundle contents &amp; performing additional operations when the server is only loaded with the Bundle (and not the individual resources) <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  <span class=\"user-mention\" data-user-id=\"311963\">@Nancy Lush</span> <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span></p>",
        "id": 272173647,
        "sender_full_name": "Sheridan Cook",
        "timestamp": 1645043219
    },
    {
        "content": "<p>Thanks for posting this, Sheridan.  This is our question as well.  We tried the bundle search on Rob's server, but it did not support bundle search. (Patient Search works fine.) If we do find another endpoint that works we will update on this thread.</p>",
        "id": 272187763,
        "sender_full_name": "Nancy Lush",
        "timestamp": 1645050152
    },
    {
        "content": "<p>A probably more feasible approach is to expect that an IPS document is pointed to by a DocumentReference. That would make common searches easier to perform.</p>",
        "id": 272189855,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1645051338
    },
    {
        "content": "<p>That's something to consider.  But also an additional requirement to (maybe) impose.</p>",
        "id": 272192867,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1645053046
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191405\">Rob Hausam</span> <a href=\"#narrow/stream/207835-IPS/topic/Chained.20Param.20Search.20-.20FHIR.20Document/near/272192867\">said</a>:</p>\n<blockquote>\n<p>That's something to consider.  But also an additional requirement to (maybe) impose.</p>\n</blockquote>\n<p>Creating a DocumentReference is an additional requirement or supporting Bundle chained searches? Seems to me work is required either way. (Unless you plan on decomposing the received document and integrating the individual resources into your system, which is, also, additional work.)</p>",
        "id": 272193276,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1645053343
    },
    {
        "content": "<p>Agree.  It's a matter of deciding which way(s) to do it.</p>",
        "id": 272213913,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1645073137
    },
    {
        "content": "<p>Generic search features should be testable on the public HAPI and Firely Server test servers, <a href=\"http://server.fire.ly/R4/Bundle?composition.patient.identifier=574687583\">http://server.fire.ly/R4/Bundle?composition.patient.identifier=574687583</a> certainly works.</p>",
        "id": 272223112,
        "sender_full_name": "René Spronk",
        "timestamp": 1645083646
    },
    {
        "content": "<p>Seems this should not be in IPS, but rather in IPA or other specifications. I prefer if IPS focuses on the document content</p>",
        "id": 272250549,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645100205
    },
    {
        "content": "<blockquote>\n<p>Creating a DocumentReference is an additional requirement or supporting Bundle chained searches? </p>\n</blockquote>\n<p>No, using DocumentReference would avoid the need to support Bundle chained searches.</p>",
        "id": 272263685,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1645106818
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/207835-IPS/topic/Chained.20Param.20Search.20-.20FHIR.20Document/near/272263685\">said</a>:</p>\n<blockquote>\n<p>No, using DocumentReference would avoid the need to support Bundle chained searches.</p>\n</blockquote>\n<p>Agree. Alternatively, implementing Bundle chained searches would avoid the need to support DocumentReference (if your architecture doesn't otherwise need DocumentReference). My point is that there is effort here one way or the other.</p>",
        "id": 272274357,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1645111094
    },
    {
        "content": "<blockquote>\n<p>My point is that there is effort here one way or the other.</p>\n</blockquote>\n<p>This sounds as if the effort is interchangeable. I have a hard time envisioning an architecture that has to deal with documents of any kind, and not  needing to support DocumentReference.</p>",
        "id": 272275669,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1645111679
    },
    {
        "content": "<p>Hey folks, we hear you on the DocumentReference front. As Elliot pointed out, both will require some amount of effort for implementers (and that effort will be contextual based on your existing architecture) so we are evaluating the pros/cons of all options right now. By testing the boundaries of chained search on Bundle for a FHIR Document loaded in isolation, we are hoping to better understand the limitations of this approach on a variety of user behaviors. <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> <span class=\"user-mention\" data-user-id=\"311963\">@Nancy Lush</span>  - the Firely server will work for the initial chained parameter search but we may hit a barrier doing later tests with it since it doesn't support $summary operation which we were hoping to test in later stages.</p>",
        "id": 272276699,
        "sender_full_name": "Sheridan Cook",
        "timestamp": 1645112132
    },
    {
        "content": "<p>It might be insightful to see full, working examples of requesting a specific IPS instance - without prior knowledge of ANY resource id -  using either a Bundle chained search or a DocumentReference search: noting that even a LOINC-coded document type is insufficient and a Patient Identifier is required.  I'd be happy to implement either approach, even though Patient$summary looks to be the best fit.</p>",
        "id": 272340759,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1645141603
    },
    {
        "content": "<p>One could kindly ask the teams behind the public HAPI and Fire Servers to support the $summary operation - they may, or may not, wish to extend the public servers with such an operation.</p>",
        "id": 272370795,
        "sender_full_name": "René Spronk",
        "timestamp": 1645170884
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> Doing that is (or at least should be) part of the ultimate plan.  Jens Villadsen has created a $summary operation definition that he is using with HAPI (I'm intending to implement it on my HAPI server, too).  That is now included in the CI build of the IPS IG (<a href=\"http://build.fhir.org/ig/HL7/fhir-ips/OperationDefinition-summary.html\">here</a>) - although it's somewhat buried and not too obvious to navigate to right now, which we should fix.</p>",
        "id": 272399394,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1645189856
    }
]