[
    {
        "content": "<p>Is there a reason why the subject is 0..1? Why would a patient summary not have a subject?</p>",
        "id": 254264828,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1632252924
    },
    {
        "content": "<p>IMHO there are no reasons for this : jira item ?</p>",
        "id": 254267665,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1632253924
    },
    {
        "content": "<p>I assume you are having trouble with the min cardinality? Are there cases where the subject would be removed for confidentiality reasons? Or where a draft would be saved without yet identify in the patient?</p>",
        "id": 254268413,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632254245
    },
    {
        "content": "<p>the subject would not be removed, it would be replaced with a pseudonym Patient that carried the attributes of the pseudo patient for continunity of the data. (fuzzed age of the patient)</p>",
        "id": 254269460,
        "sender_full_name": "John Moehrke",
        "timestamp": 1632254675
    },
    {
        "content": "<p>I too would prefer it be 1..1</p>",
        "id": 254269544,
        "sender_full_name": "John Moehrke",
        "timestamp": 1632254716
    },
    {
        "content": "<p>I do know of some cases where a clear patient was obvious, but the model was left at 0..1 so as to enable workflows that would template the first instance without a selected patient, and it would get filled in over itterations. To me this is a non-IPS to begin with.</p>",
        "id": 254269735,
        "sender_full_name": "John Moehrke",
        "timestamp": 1632254788
    },
    {
        "content": "<p>For the \"patient not yet filled in\" cases, a \"null flavor\" could be used e.g. data absent reason extension saying \"not yet\" or similar. But realistically, who saves a draft patient summary to a (presumably external) server before the patient is ready to be filled in? Perhaps if you are constructing out of other data, that process may have some time extent, and intermediate drafts along the way. But mandating that the patient is there originally doesn't seem to be hard to support.</p>",
        "id": 254349394,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1632308821
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-33984\">https://jira.hl7.org/browse/FHIR-33984</a></p>",
        "id": 254418745,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1632336670
    }
]