[
    {
        "content": "<p>Why does the IPS Profile on the Condition Resource use an alternative ValueSet for the category - i.e. one that contains a single LOINC Code (75326-9 ), rather than 'problem-list-item' from <a href=\"http://hl7.org/fhir/ValueSet/condition-category\">http://hl7.org/fhir/ValueSet/condition-category</a>? Is the later not considered to be a 'suitable code'? <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 211074827,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1600904225
    },
    {
        "content": "<p>That's actually a quite interesting question, <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> - in a few respects.  The basic idea for that decision I think was twofold.  First, wherever and whenever possible we were attempting to specify recognized standard terminology, and at the time that we made the decision the base resource binding to the condition-category value set was only an example, with those codes appearing to be rather ad hoc and with no particular requirement or expectation for their use.  And second, the reason that we chose to use a single LOINC code for \"Problem\" in the value set, but with an extensible binding to also allow other options if needed, was that this was for use in the IPS Problems Section and we felt there was not a good reason generally for items that were not considered to be a clinical <strong>problem</strong> to be included in the Problems section of a patient summary (restating that the IPS is not intended to be and will not necessarily represent the entire EHR).</p>\n<p>But now comes the interesting wrinkle in this.  As I said, the binding of Condition.category to the condition-category value set was example, and that was the case for the first 4 publications of R4 through 3.5a.0.  But then in the final R4 release the binding was changed to <strong>extensible</strong> - and, even though I attend the Patient Care WG calls nearly every week, I don't recall having heard any discussion about that and somehow I completely missed that change until right now.  And the upshot that I see of  it is that with the binding now being <strong>extensible</strong>, the published IPS specification is technically non-conformant in this with the FHIR R4 release.  That might mean that we need to add this to the IPS technical correction that we are working toward.  But I also wonder if the change from an example to an extensible binding for a <strong>category</strong> element in the base standard was either intended by PCWG or is even technically correct? <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>?  <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> may have some further thoughts on all of this. And  I guess we'll have to see how it further plays out.</p>",
        "id": 213737192,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1603073365
    },
    {
        "content": "<p>Thanks for that comprehensive reply, <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> . At present, placing that LOINC <code>Condition.category</code> code in the IPS results in the following warning from the FHIR Validator (and Inferno)...</p>\n<blockquote>\n<p>Invalid Code None of the codes provided are in the value set <a href=\"http://hl7.org/fhir/ValueSet/condition-category\">http://hl7.org/fhir/ValueSet/condition-category</a> (<a href=\"http://hl7.org/fhir/ValueSet/condition-category\">http://hl7.org/fhir/ValueSet/condition-category</a>), and a code should come from this value set unless it has no suitable code)</p>\n</blockquote>\n<p>BTW: there is a similar issue with the <code>Codition.severity</code> code, although the severity level is 'information'.</p>",
        "id": 213739930,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1603077721
    },
    {
        "content": "<p>Yes.  Interestingly, I don't recall seeing that particular warning on Condition.category while we were working to get IPS published - but the Validator and IG Publisher have been evolving rapidly! :)  We certainly have to sort this issue out.</p>",
        "id": 213744303,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1603084746
    },
    {
        "content": "<p>Most of these differences come from the facts that the IPS has a CDA and FHIR representation and that the CDA has been the first guide developed. In most existing CDA IGs LOINC or SNOMED codes are used/recommended and this is the choice  followed also in our IPS CDA guide. We tried then not to have different value sets for the two guides.</p>",
        "id": 213753003,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1603094214
    },
    {
        "content": "<p>Thanks for adding that clarification, <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span>.  I wasn't recalling that aspect when I replied, but that's absolutely correct.  We were following the principles that I described initially when we developed the CDA IG and then carried that into FHIR (because when we did that the <strong>example</strong> binding allowed us to do that without a problem).</p>",
        "id": 213784107,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1603113875
    },
    {
        "content": "<p>Here is the JIRA that approved a change in the Condition.category binding strength:  <a href=\"http://jira.hl7.org/browse/FHIR-18833\">J#18833</a>.  More details in the JIRA, but it seems to boil down to the category binding strength was changed to extensible because the invariant (to require clinicalStatus) was only applicable to problems only.  In order to know when the condition was a problem (for invariant), it needed an extensible binding strength.  <br>\n(FYI:  <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  it was voted on during the Oct 2018 WGM)</p>",
        "id": 213805181,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1603122215
    },
    {
        "content": "<p>I figured you would find that quickly (quicker than I would), <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>.  I'm still not recalling this discussion and decision, so I assume that I probably wasn't there (at least during the WGM session when it was decided).  Do you have a link to the WGM minutes that you can post?  This decision turns out to be problematic for IPS (which is sponsored by PCWG - although I think it may still have been sponsored by SDWG at that time), and I wonder if it doesn't also cause other issues?  I also note some weirdness in the issue description, as it's about Condition.clinicalStatus but then it says that \"It would mean that this <strong>allergyIntolerance</strong> cannot be communicated if the current status is unknown\".</p>",
        "id": 213808054,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1603123457
    },
    {
        "content": "<p>Discussion notes are captured within the JIRA itself, <a href=\"http://jira.hl7.org/browse/FHIR-18833\">J#18833</a>.  The submitter was present during the discussion since the submitter made the motion, so I think the condition/allergy confusion was likely a typo since the JIRA comment outlining options were all focused on conditions.</p>",
        "id": 213856675,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1603148120
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>.  The discussion in the Jira issue goes into considerable detail about the pros and cons of the sever options, but then (at least in my reading) seems to say apparently nothing about the rationale for narrowing those options to the decision that was actually made and then applied.  Can we add it to a PC FHIR call agenda for further discussion, and figuring out how to deal with the issue that it raises for IPS?</p>",
        "id": 213871824,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1603164309
    },
    {
        "content": "<p>Following the Patient Care discussion today:</p>\n<ul>\n<li>We recommend in R4 that IPS use both the CDA LOINC code + FHIR problem-list-item code (since category is a CodeableConcept)</li>\n<li>Going forward in R5, we are considering whether to edit the invariant to always require clinicalStatus (when not entered in error) regardless of category – since it is only a guideline, we don't need the category = problem-list-item part of the invariant</li>\n<li>Pros/cons of other options documented in the meeting minutes: <a href=\"https://confluence.hl7.org/display/PC/2020-10-22+Patient+Care+FHIR+Conference+Call\">https://confluence.hl7.org/display/PC/2020-10-22+Patient+Care+FHIR+Conference+Call</a></li>\n</ul>",
        "id": 214256209,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1603406071
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  &amp; <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> . Presumably,  IPS implementers can take the same, dual coding, approach for condition.severity (LOINC &amp; FHIR in that case)? In both cases, the Validator is now happy!</p>",
        "id": 214267625,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1603419383
    },
    {
        "content": "<p>Yes, at least for now, the dual coding approach will work in both cases.  It isn't strictly necessary to do it for Condition.severity, as using the LOINC code alone is still conformant and the validation output for that is an Information message (not a Warning).  For Condition.category the message is a Warning, and technically the instance is non-conformant without the additional condition-category <code>problem-list-item</code> code.  So we need to add the <code>problem-list-item</code> code to our Condition profile and examples in the upcoming IPS technical correction (for the current R4-based IG).  I'm not sure if we will want to add the SNOMED CT severity codes in the technical correction, as we intentionally did not use the SNOMED CT codes and instead chose LOINC (as it is universally available) - but we could discuss that.  And yes, adding the additional codes in both cases does make the Validator happy and removes the warning and information messages.</p>",
        "id": 214276481,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1603432425
    },
    {
        "content": "<p>Tracker <a href=\"http://jira.hl7.org/browse/FHIR-29409\">J#29409</a> created.</p>",
        "id": 214278485,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1603434931
    }
]