[
    {
        "content": "<p>What clinicalStatus value should I use in a Condition, when the Condition.code is no-known-problems? ClinicalStatus has a min cardinality of 1, and Condition is required to be included in an IPS.  Is the lack of problems \"active\" or \"inactive\"?</p>",
        "id": 246812715,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1626934702
    },
    {
        "content": "<p>Also, the analogous question for AllergyIntolerance: what clinicalStatus goes with a code of no-known-allergies?</p>",
        "id": 246813198,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1626935356
    },
    {
        "content": "<p>I guessed \"inactive\" but none of the 3 available values are satisfactory in those contexts as their descriptions all refer to an \"identified substance\".</p>",
        "id": 246815611,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1626938198
    },
    {
        "content": "<p>\"active\" means the \"The subject is currently experiencing the condition or situation\". no-known-problems is a \"situation\" that patient is current has/experiences. So my vote goes for \"active\"</p>",
        "id": 246846022,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1626960395
    },
    {
        "content": "<p>I think that 'active' is the <strong>best</strong> of those choices - but it's not a good one.  This is something that we need to figure out.  We may need to bring this up with PCWG and change the cardinality to min=0 with an appropriate invariant.  That's actually already the case in the CI build for R5 with AllergyInterolerance, but not with Condition.</p>",
        "id": 246848407,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1626961517
    },
    {
        "content": "<p>Do you want a ticket filed for this?</p>",
        "id": 246861173,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1626966800
    },
    {
        "content": "<p>Might also want to ask this on <a class=\"stream\" data-stream-id=\"294552\" href=\"/#narrow/stream/294552-Patient-Care-WG\">#Patient Care WG</a></p>",
        "id": 246862344,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626967372
    }
]