[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Is there any track session planed for Monday (other than general welcome session)?</p>",
        "id": 238806705,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1621015562
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> So far we haven't planned anything else for Monday.  The assumption is that for the particpants from Europe who are closer to UTC time, that later on Monday probably would not work and that it is best to begin early on Tuesday.  But we could add a session on Monday, though, if there is enough availability in interest in that.  I'll suggest that everyone who would or might be interested in that should please respond here to let us know, and if there is a reasonable response in favor of it we can get that scheduled.</p>",
        "id": 238808193,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1621016198
    },
    {
        "content": "<p>OK. Then I will join on Tuesday morning.</p>",
        "id": 238813991,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1621018924
    },
    {
        "content": "<p>We've decided to go ahead and have an initial (informal) IPS session now, following the Welcome and Kick Off session.  Giorgio or I will have the Zoom meeting open from Whova shortly, so please join if you are able.  We'll see who we have and do some inital planning!</p>",
        "id": 239118897,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1621268491
    },
    {
        "content": "<p>if you want to join you can use the whova link for the tomorrow slot</p>",
        "id": 239123115,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1621270134
    },
    {
        "content": "<p><a href=\"https://whova.com/portal/webapp/hlsfh_202105/Agenda/1680379\">https://whova.com/portal/webapp/hlsfh_202105/Agenda/1680379</a></p>",
        "id": 239123182,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1621270170
    },
    {
        "content": "<p>Yes.  You can now launch the IPS Zoom session at any time.  There may not always be someone there, but if there is we can connect as needed.  We're also adding an \"IPS Open Time\" session in Whova for today, to make that much more obvious.</p>",
        "id": 239123363,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1621270231
    },
    {
        "content": "<p>Let's collect any (and all) available servers and clients here.  We will also want to list the servers and clients in ConMan (so please go ahead and do that, or let someone know and we'll make sure that it gets done).</p>",
        "id": 239125299,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1621270999
    },
    {
        "content": "<p>and remember that you can indicate that a particular server is associated with a track - then the server will appear in the track description, making it easier to find...</p>",
        "id": 239226193,
        "sender_full_name": "David Hay",
        "timestamp": 1621331370
    },
    {
        "content": "<p>From <a href=\"#narrow/stream/284830-smart.2Fhealth-cards/topic/HL7.20May.20Connectathon!/near/239232519\">https://chat.fhir.org/#narrow/stream/284830-smart.2Fhealth-cards/topic/HL7.20May.20Connectathon!/near/239232519</a><br>\n<a href=\"https://inferno-dev.healthit.gov/\">https://inferno-dev.healthit.gov/</a>  has a Test Set for IPS</p>",
        "id": 239239019,
        "sender_full_name": "Paul Denning",
        "timestamp": 1621338523
    },
    {
        "content": "<p>it's odd that conman doesn't let us specify clients for a specific track</p>",
        "id": 239243139,
        "sender_full_name": "Stephen MacVicar",
        "timestamp": 1621340554
    },
    {
        "content": "<p>^I had this same thought earlier too</p>",
        "id": 239243171,
        "sender_full_name": "Michael O'Keefe",
        "timestamp": 1621340568
    },
    {
        "content": "<p>Thanks for the feedback guys - I'll add that as an option for next time (and allow associating a client with a result as well). BTW - is there any interest in using conman between events? And if there were,  then what changes would be needed?</p>",
        "id": 239342411,
        "sender_full_name": "David Hay",
        "timestamp": 1621381130
    },
    {
        "content": "<p>I think the general ethos should be \"it's always time to test, and we always know which servers and clients are up and running\"</p>",
        "id": 239344829,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621382798
    },
    {
        "content": "<p>Yeah - that's what I was kinda thinking, and wondering if conman could help out with that...</p>",
        "id": 239349754,
        "sender_full_name": "David Hay",
        "timestamp": 1621386850
    },
    {
        "content": "<p>when is the kickoff for IPS today? The HL7 site seems to tell me two different things.</p>",
        "id": 253104123,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631545189
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> 3pm EST, I believe (hope!).</p>",
        "id": 253141267,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1631559424
    },
    {
        "content": "<p>I'll be participating in the WHO digital certificate aspects of IPS. But, I signed up too late I believe to be in the sign-on sheet and I don't have zoom links for the next sessions if someone can share.</p>",
        "id": 253151717,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1631563631
    },
    {
        "content": "<p>everything starts with whova</p>",
        "id": 253151812,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631563676
    },
    {
        "content": "<p>In whova I only see today's session, nothing for tomorrow and wednesday.</p>",
        "id": 253151936,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1631563715
    },
    {
        "content": "<p>Most of the time is intended to be open for discussion/testing/data exchange.  So I haven't actually (so far) scheduled that as a \"session\".  But it seems that maybe that will actually be the better thing to do, and certainly will help make the IPS activities more visible.  So I will go ahead and do that (and we can flex it as much as we need to as we go) - I think that it should be there by the time we get going tomorrow (at least for the \"official\" US Eastern time), or it will be there soon thereafter.</p>",
        "id": 253153287,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1631564199
    },
    {
        "content": "<p>Hi, everyone.  I'm just getting started today in my morning, and I'm catching up now on everything that I've missed overnight.  We have a session on \"IPS &amp; Digital Documentation of Covid Certificates (DDCC)\" scheduled at 1:30 PM Eastern today, but it hasn't made it into Whova yet.  We're waiting until a little later to do that so that Peter Jordan in NZ will be able to join us.  I'll get with the Connectathon organizers and get that session (and some others) on our track in Whova.  In the meantime I'll also make a separate Zulip post for the DDCC session, with the additional details.</p>",
        "id": 253232485,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1631617999
    }
]