[
    {
        "content": "<p>Hello, <br>\nwe are currently looking into the Diagnostic Report resource from the IPS R4 set and are wondering about its status. Specifically, is the Profile ready to use, and why are certain references pointing to FHIR R4 resources rather than the IPS profiles, e.g. Patient reference and Specimen reference? Thanks for your Support!</p>",
        "id": 191860966,
        "sender_full_name": "Marcel Klötgen",
        "timestamp": 1585216598
    },
    {
        "content": "<p>Dear <span class=\"user-mention\" data-user-id=\"239153\">@Marcel Klötgen</span> , the guide is substantially ready to be published as STU, but if you would like to suggest last minutes fixes please add a jira item.<br>\nAbout the other question we should see case by case. For not all the referred resources we have defined and we need IPS specific constrains. I agree however with you that the DiagnosticReport should use as Patient subject the Patient ips profile and the specimen ips profile in the specimen element (pls add a jira change request :-)).</p>",
        "id": 191863888,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1585218261
    },
    {
        "content": "<p>Good pickup, <span class=\"user-mention\" data-user-id=\"239153\">@Marcel Klötgen</span>.  The DiagnosticReport was a fairly recent addition, and apparently we overlooked those items.  As Giorgio said, if you can add a Jira tracker for this that would be great, and we'll plan to have it updated for the publication.</p>",
        "id": 191893585,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585233527
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239153\">@Marcel Klötgen</span> added as tracker <a href=\"https://jira.hl7.org/browse/FHIR-26665\" title=\"https://jira.hl7.org/browse/FHIR-26665\">FHIR-26665</a></p>",
        "id": 192307695,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1585597481
    },
    {
        "content": "<p>Hello, we want to exchange structured laboratory results but not as part of a patient summary. Can we use the profiles (e.g. diagnostics report) in other application contexts (e.g. simple exchange of Information from patient records). Thank you!</p>",
        "id": 193902449,
        "sender_full_name": "Salima Houta",
        "timestamp": 1586873365
    },
    {
        "content": "<p>You can if they fits for your purposes :-)</p>",
        "id": 193909688,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1586876149
    },
    {
        "content": "<p>For example in the Trillium II project we have reused some of the IPS profiles (the version available at that time) to design other kinds of documents</p>",
        "id": 193910222,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1586876321
    }
]