[
    {
        "content": "<p>On the IPS call today we started to look at the resolution for <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23805\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23805\">GF#23805</a> on incorporating the SNOMED CT GPS and IPS free sets as value sets in the IPS IG profiles.  We didn't have sufficient time on the call today to address the details, but want to continue the discussion here in preparation for further discussion and hopefully agreeing on a proposed resolution on the IPS call next week.  Some of the considerations might be: (1) whether the GPS (Global Patient Set) is represented and hosted in FHIR and the IPS IG as a value set from the full International Edition (for use in SNOMED member countries) or as a code system fragment and corresponding value set (for use in SNOMED non-member countries), or both; (2) whether to use and identify content in IPS from the full GPS wherever it may appear in any of the IPS value set bindings (most likely with separate slices?) or to restrict the use to only the content from the IPS free set (and its individual contributing IPS value sets); and (3) how to handle and describe the use of SNOMED CT (from the GPS and otherwise) in IPS in both SNOMED member and non-member countries, so that the use is understood and maintained within the respective license restrictions.</p>",
        "id": 177743784,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1570646650
    },
    {
        "content": "<p>Are there situations where the potential valueset bindings to SNOMED Full Ed are different from the SNOMED GPS/IPS? If the intention was for SNOMED IPS Free Set to support non-member countries, it seems like there would be a gap if there is a difference.</p>",
        "id": 177753939,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1570653575
    },
    {
        "content": "<p>I don't understand why the choice for question 1 is a binary choice</p>",
        "id": 177781212,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570686351
    },
    {
        "content": "<p>I feel as though I don't understand the considerations behind question (2)</p>",
        "id": 177781258,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570686385
    },
    {
        "content": "<p>I think the interesting question is (2): When the first new value set will be constructed that builds (exclusively) on the GPS pool of SNOMED concepts, we will start having two classes of GPS-using value sets: Those that were \"constitutional\" for the selection of concepts, and those that are just using concepts from that pool. (And possibly from other pools, which adds another two classes:  GPS mixed with other non-GPS SNOMED concepts, and \"pure GPS\" but with other  non-SNOMED concepts added)</p>",
        "id": 178418449,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1571344010
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  The choice for #1 is being presented as an and/or.  Looking at it again, #2 probably isn't a real or relevant choice, as presumably any current IPS value sets that are subsets of the GPS content can remain as they are, and anywhere that the GPS intersects the content of a current IPS value set then there wouldn't be any reason to further limit what is being made available from the GPS.   Hopefully that made some sense - but I think it means that we can remove #2 from any further consideration.</p>",
        "id": 178433761,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1571358140
    },
    {
        "content": "<p>I need to think through a little further the questions that <span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> is raising - but I think that we're not going to have to deal explicitly (and separately) with all of the potential permutations.</p>",
        "id": 178433994,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1571358511
    },
    {
        "content": "<p>For those not aware yey, the GPS is visible in the IHTSDO browser as a simple refset. You can use it to build an expression constraint in the ECL tab of the browser.</p>",
        "id": 183170998,
        "sender_full_name": "François Macary",
        "timestamp": 1576079907
    }
]