[
    {
        "content": "<p>I was looking at the IPS medication profiles which has a binding to the WHO ATC - IPS value set in one slice on <code>code</code>. The value set is defined as containing all codes in the system <code>http://www.whocc.no/atc</code>, but the expansion in the IG (<a href=\"http://www.hl7.org/fhir/uv/ips/STU1/ValueSet-whoatc-uv-ips.html\">http://www.hl7.org/fhir/uv/ips/STU1/ValueSet-whoatc-uv-ips.html</a>) is listed as containing only 275 codes, all but 5 of which start with 'A'. Was there a problem with the expansion? (I would have expected the first 1000 codes + and indication that not all codes are shown)</p>",
        "id": 228946467,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1614948258
    },
    {
        "content": "<p>Not sure if the terminology server actually includes the complete ATC code systems, but <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> can give you a more aware answer  than me :-)</p>",
        "id": 228966014,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1614956048
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> The issue is that we don't have (at least yet) a source for the complete set of ATC codes.  What we currently support in the terminology server (<a href=\"http://tx.fhir.org\">tx.fhir.org</a>) is a small subset with a semi-random selection of codes from examples and by request.  If you or anyone is aware of a source of the ATC codes that is complete and readily accessible (i.e. ideally free of charge, or maybe very minimal cost), then we would definitely want to expand the support in <a href=\"http://tx.fhir.org\">tx.fhir.org</a> to include that.  Let me know if you have any suggestions.</p>",
        "id": 228974185,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1614959013
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  Ah, interesting. I wish I did have all of ATC somewhere, but I'm afraid I don't (I naively assumed that the public availability of a searchable index meant it was easily available).  I see you can buy the whole set as Excel or XML for $200 <a href=\"https://www.whocc.no/atc_ddd_index_and_guidelines/order/\">here</a>, which seems relatively minimal overall. Are there license issue with converting this into a CodeSystem and using it on  <a href=\"http://tx.fhir.org\">tx.fhir.org</a>? If it's just about the Excel --&gt; CodeSystem conversion, I could probably do that <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> .</p>",
        "id": 228975843,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1614959661
    },
    {
        "content": "<p>(I cannot quite tell from the <a href=\"https://www.who.int/about/who-we-are/publishing-policies/copyright\">WHO page on Copyright, Licensing and Permissions</a> whether one needs to get a license - unlike e.g. ICD, ATC is not explicitly listed a requiring a license, but the application form has \"other\" as an option when specifying the system for which a license is requested.)</p>",
        "id": 228976498,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1614959949
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> I'm sure that some kind of license undoubtedly would be required (even if that's not obvious at the moment).  But hopefully they would be willing to have the content made available (to licensed users) via the FHIR API (as needed, not the entire code system contents) .  We would need to explore all of that with them through HTA.  I expect that is doable, but we don't have a budget for purchasing code systems and regular updates for them.  Even at a relatively minimal cost (as in this case), with multiple code systems and regular update schedules that begins to add up.  I'm not sure what solution(s) we might be able to work out for that, as it is an issue that we run into pretty frequently. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>?</p>",
        "id": 228981991,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1614961783
    },
    {
        "content": "<p>And if we need to discuss more we might want to move this to the terminology stream.</p>",
        "id": 228982278,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1614961865
    },
    {
        "content": "<p>nice. I just wrote this as a part of a requirement a few hours ago: Shared codes like ATC should be available</p>",
        "id": 229200412,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1615135170
    },
    {
        "content": "<p>I think there is interest in that</p>",
        "id": 229200424,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1615135183
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"247046\">@Christine Haas</span></p>",
        "id": 229273904,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1615197840
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Thanks for the background, there is always more than meets the naive eye <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> BTW, the inclusion of an ATC-fragment in <a href=\"http://tx.fhir.org\">tx.fhir.org</a>  seems to causes the standard validator to throw spurious errors. I presume it happens because it assumes it knows all ATC codes &amp; then fails when trying to validate (most of)  them, cf. this:</p>\n<div class=\"codehilite\"><pre><span></span><code>*FAILURE*: 3 errors, 4 warnings, 7 notes\n  Error @ Medication.code.coding[2] (line 18, col14) : The code &quot;V06DC01&quot; is not valid in the system http://www.whocc.no/atc; The code provided (http://www.whocc.no/atc#V06DC01) is not valid in the value set &#39;All codes known to the system&#39; (from http://tx.fhir.org/r4) for &#39;http://www.whocc.no/atc#V06DC01&#39;\n</code></pre></div>\n<p><del>Do you know if the underlying CodeSystem not have <code>content</code> = \"fragment\" or does the validator/term server not use this info?</del><br>\nI see the underlying CodeSystem has <code>content</code> = \"fragment\", do you know if the validator uses this info?</p>",
        "id": 229448526,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1615282878
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> Yes, the current ATC CodeSystem resource in the package used by <a href=\"http://tx.fhir.org\">tx.fhir.org</a> is specified as <code>content</code> = 'fragment'.  Technically, according to our current guidance for CodeSystem that is not a correct usage of 'fragment', as this particular \"fragment\" is not obtained from the code system publisher - so we may need to add a new content type like 'partial' (or similar), but that's a different discussion to have in Vocabulary (and the terminology stream).  And it appears that the validator at least isn't making full use of this information (I haven't looked into the specific code for it) - I expect that <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> can clarify the current state, and we can decide what it should be.</p>",
        "id": 229475932,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1615296586
    },
    {
        "content": "<p>I don't remember the current state</p>",
        "id": 235285087,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618892230
    }
]