[
    {
        "content": "<p>Hey everybody.</p>\n<p>I would like to do a transformation from an International Patient Summary (IPS) FHIR document / set of ressources to a IPS CDA. Both implementation guides are available:</p>\n<ul>\n<li>\n<p>IPS CDA: <br>\n<a href=\"http://international-patient-summary.net/mediawiki/index.php?title=IPS_implementationguide_1\">http://international-patient-summary.net/mediawiki/index.php?title=IPS_implementationguide_1</a><br>\n<a href=\"https://art-decor.org/art-decor/decor-project--hl7ips-\">https://art-decor.org/art-decor/decor-project--hl7ips-</a></p>\n</li>\n<li>\n<p>IPS FHIR:<br>\n<a href=\"https://build.fhir.org/ig/HL7/fhir-ips/index.html\">https://build.fhir.org/ig/HL7/fhir-ips/index.html</a><br>\n<a href=\"http://hl7.org/fhir/uv/ips/2018Sep/index.html\">http://hl7.org/fhir/uv/ips/2018Sep/index.html</a></p>\n</li>\n</ul>\n<p>Is there any existing script which can do such a transformation (in one direction, or in both directions)? If there is not any, it would be really great if someone could give me some hints how this can be done (guides, etc.). Would it be an option to work with the FHIR Mapping Language to do such a transformation?</p>\n<p>Thanks in advance!</p>",
        "id": 218219502,
        "sender_full_name": "Alexander Dimitrov",
        "timestamp": 1606667686
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"367809\">@Alexander Dimitrov</span>  Hi.  As far as I am aware, there isn't anything specific to IPS that we have to offer for transforming a FHIR IPS instance to CDA IPS.  There is the more general work on <a href=\"http://www.hl7.org/fhir/us/ccda/\">C-CDA on FHIR</a> - but that (as far as I am aware) is only about transforming in the other direction.  In the IPS specifications, we have stated the intention to provide and to maintain substantial alignment between the two specifications to the degree that is possible, but we explicitly did not promise that a means would be provided to directly transform between instances of the CDA and FHIR specifications (in either direction) -  although that clearly could be very useful if resources are available and someone develops it.</p>",
        "id": 218242781,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1606703254
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Thanks for the reply! Such a transformation might end being part of my master thesis, this is why I was curious. Since I'm still pretty new to FHIR and CDA, what do you think would be the most easy/elegant way to do such a transformation (IPS FHIR to IPS FHIR and vice versa)? Could this be done with the FHIR Mapping Language (write mapping instructions, which then can be run onto the FHIR Server), or would I run into some expected troubles? Any suggestions are very welcome :)</p>",
        "id": 218309745,
        "sender_full_name": "Alexander Dimitrov",
        "timestamp": 1606753601
    },
    {
        "content": "<p>Hi Alexander - I wrote a <a href=\"https://fhirblog.com/?s=mapping\">couple of blog posts</a> on using the mapping language that may be of use to you. I don't think that the app works properly ATM (the back end operations got moved around) but could be fixed if needed. In particular, note that the mapping engine is a specific bit of functionality and not generally implemented by FHIR servers...</p>",
        "id": 218319209,
        "sender_full_name": "David Hay",
        "timestamp": 1606757827
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306151\">@Frank Olthuijsen</span></p>",
        "id": 218328846,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1606762363
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"367809\">@Alexander Dimitrov</span> we worked on maps transforming IHE Pharmacy Content Profiles to FHIR and back with the FHIR mapping language, see here if interested: <a href=\"https://github.com/hl7ch/cda-fhir-maps\">https://github.com/hl7ch/cda-fhir-maps</a> .</p>",
        "id": 218329767,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1606762754
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"367809\">@Alexander Dimitrov</span>  It looks like the suggestions from <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> and <span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span> would be good to investigate.  As I said before, if you (or anyone) does produce something like this for IPS, I think that would be very useful.  And even if it's only an initial (partial) attempt, it would be good to test at a Connectathon.</p>",
        "id": 218338307,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1606766716
    },
    {
        "content": "<p>Thanks for the responses! <br>\n<span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> Ah I understand, thank you. So the mapping engine is responsible to create the StructureMap resource, which then has to be uploaded onto the FHIR server.</p>",
        "id": 218433515,
        "sender_full_name": "Alexander Dimitrov",
        "timestamp": 1606835181
    },
    {
        "content": "<p>Not quite - the mapping engine needs the StructureMap/s as part of the input (as well as other resources like structure definitions). Have you seen <a href=\"http://hl7.org/fhir/mapping-language.html\">this page</a> in the spec?</p>",
        "id": 218457126,
        "sender_full_name": "David Hay",
        "timestamp": 1606844836
    },
    {
        "content": "<p>Over the last few Connectathons we also tried to come up with a short explanation on how the mapping language works. It can be found here: <a href=\"https://confluence.hl7.org/display/FHIR/Using+the+FHIR+Mapping+Language\">https://confluence.hl7.org/display/FHIR/Using+the+FHIR+Mapping+Language</a></p>",
        "id": 218457941,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1606845261
    },
    {
        "content": "<p>Also - the <a href=\"https://fhir.fire.ly/products/fhir-mapper/\">firely implementation</a> has lots of info, and I'm sure that <span class=\"user-mention\" data-user-id=\"191363\">@Vadim Peretokin</span> would be happy to help out...</p>",
        "id": 218457972,
        "sender_full_name": "David Hay",
        "timestamp": 1606845277
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span>  - I guess I better go fix my tool as there's a link there!</p>",
        "id": 218458166,
        "sender_full_name": "David Hay",
        "timestamp": 1606845373
    },
    {
        "content": "<p>Also : in that page, the transformation of the instructions into the StructureMap is shown as being done by the mapping engine - could that be confusing? Would it be better labelled as 'transformer' or some such?</p>",
        "id": 218458592,
        "sender_full_name": "David Hay",
        "timestamp": 1606845595
    },
    {
        "content": "<p>The word \"mapping engine\" is now used everywhere, that's why we chose to leave it.</p>",
        "id": 218459851,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1606846179
    }
]