[
    {
        "content": "<p>(Coming in from <a href=\"#narrow/stream/179166-implementers/topic/European.20Health.20Record.20exchange.20format.20on.20FHIR.3F\" title=\"#narrow/stream/179166-implementers/topic/European.20Health.20Record.20exchange.20format.20on.20FHIR.3F\">a thread in the Implementers stream</a>  that may be more t home here).</p>\n<p>I'm trying to understand the relation between IPS and the European Health Record exchange format (cf. the Annex document on <a href=\"https://ec.europa.eu/digital-single-market/en/news/recommendation-european-electronic-health-record-exchange-format\" target=\"_blank\" title=\"https://ec.europa.eu/digital-single-market/en/news/recommendation-european-electronic-health-record-exchange-format\">this page</a>). The latter is CDA-based but mentions FHIR as a future direction, and I understand that those working on it may also have been involved in work on the IPS. Does anyone know how the roadmaps of these projects align, and, more specifically, whether the IPS (or something derived from it) is targeted to become the FHIRized version of the European exchange format?</p>",
        "id": 177525645,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1570459411
    },
    {
        "content": "<p>I'll start by saying that IPS is truly intended to be a patient <strong>summary</strong> and not the entire health record, so it seems like that would be some degree of distinction by definition.  But I'm not personally familiar with the details of the European Health Record exchange format (other than its name) so at this point I can't really meaningfully comment on it further.  I think that <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> probably is in the best position to be able to give a more complete and correct answer on this.</p>",
        "id": 177526744,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1570460050
    },
    {
        "content": "<p>Maybe <span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> can provide some clarification?</p>",
        "id": 177540869,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1570469078
    },
    {
        "content": "<p>This discussion connects many topics, maybe too many. We have the functional requirements for cross-border exchange of PS in Europe: Traditionally a \"Guideline\" that was accepted by the eHN, i. e. representatives from EU member states. The IPS standard recently delivered by CEN/TC 251 provides a more formalized version of those guidelines, it is technology-neutral and offers some optional content beyond the original eHN guidelines (EN 17269). The current eHDSI CDA IG for that PS is a fairly complete implementation of the required content, although it does not cover the additional content (yet). See <a href=\"https://ec.europa.eu/cefdigital/wiki/display/EHSEMANTIC/Clinical+Documents%3A+CDA+Implementation+Guides\" target=\"_blank\" title=\"https://ec.europa.eu/cefdigital/wiki/display/EHSEMANTIC/Clinical+Documents%3A+CDA+Implementation+Guides\">https://ec.europa.eu/cefdigital/wiki/display/EHSEMANTIC/Clinical+Documents%3A+CDA+Implementation+Guides</a>, or <a href=\"https://ec.europa.eu/cefdigital/wiki/display/EHOPERATIONS/Specifications\" target=\"_blank\" title=\"https://ec.europa.eu/cefdigital/wiki/display/EHOPERATIONS/Specifications\">https://ec.europa.eu/cefdigital/wiki/display/EHOPERATIONS/Specifications</a> .</p>\n<p>CEN/TC 251 worked in close cooperation with the HL7 IPS project, which delivered two independent implementation guides for CEN-IPS: One is a CDA-based IG, the other one uses FHIR resources. Both of them offer future directions for the development of national and international exchange formats that are \"functionally compatible\" with the epSOS/eHDSI PS.</p>\n<p>A separate document from CEN/TC 251 was just circulated for another ballot: CEN/TS 17288 \"The International Patient Summary: Guidance for European Implementation Technical Specification\" provides guidance background information on the situation, it is also basically technology-neutral, but uses the HL7 CDA and FHIR IGs as examples for implemenation of IPS in Europe. Ballot deadline is December 2019.</p>\n<p>The \"Recommendation on a European Electronic Health Record exchange format\" was published by the EU commission in 2019, aiming at extending the functionality and acceptance of cross-border exchange of EHR content: <a href=\"https://ec.europa.eu/digital-single-market/en/news/recommendation-european-electronic-health-record-exchange-format\" target=\"_blank\" title=\"https://ec.europa.eu/digital-single-market/en/news/recommendation-european-electronic-health-record-exchange-format\">https://ec.europa.eu/digital-single-market/en/news/recommendation-european-electronic-health-record-exchange-format</a>. In my view the document primarily encourages international collaboration on establishing agreement on how to exchange essential content of EHRs within and between institutions, enabling patients to access such content and healthcare providers to make use of it, in the context of patients moving internationally and providers using more than one language. The annex of that recommendation quotes standards that are established and in use, in order to connect to presumably existing and established exchange frameworks. I understand that this does not preclude the proposal of alternative and complementary standards for the given functionalities, as long as a coordinated and open process is employed that enables the participation of all EU member states, and that does not jeopardize the ongoing efforts of establishing well-defined services of an emerging eHealth Digital Service infrastructure (eHDSI) for cross-border exchange of health data.</p>",
        "id": 177556345,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1570479618
    },
    {
        "content": "<p>Dear  <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span>  sorry for the late reply .. I've not too many things to add to the Christof's response, exhaustive and politically correct :-).</p>",
        "id": 177591989,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1570522020
    },
    {
        "content": "<p>However, if you allow me to be a  little provocative, I'd say:</p>",
        "id": 177592009,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1570522074
    },
    {
        "content": "<p>- do not look at the recommendation as a \"technical\" document, it seems to me more a \"political\" document trying to take together different viewpoints;</p>",
        "id": 177592063,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1570522099
    },
    {
        "content": "<p>- due to that, if you speak with 10 different people about what it is recommended I think you will receive 10 different responses depending on what each person is trying to sell you: EHRxf it is only eHDSI CDA; EHRxF will be FHIR; or even I heard someone saying that it allows the exchange of PDFs.</p>",
        "id": 177592132,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1570522202
    },
    {
        "content": "<p>I believe the answer of Christof is the most correct.</p>",
        "id": 177592165,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1570522232
    },
    {
        "content": "<p>-  unfortunately the recommendation jumps directly from objectives (totally shareable) to specific implementation considerations, without however describing how to move form the objectives to the implementable specs.  In my opinion the first objective of this kind of recommendation should have been that of  consolidating a set of implementation independent models (preferably based on EN 17269).</p>",
        "id": 177592646,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1570522800
    },
    {
        "content": "<p>only after this you could describe how to implement, likely allowing for different representations (CDA, FHIR ) depending on the context of use.</p>",
        "id": 177592820,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1570522940
    },
    {
        "content": "<p>my 5 cents..</p>",
        "id": 177592825,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1570522951
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> Thank you for you input and perspectives, that brought me a big step forward! I was surprised to see how detailed the 17288 document - I assume it's <a href=\"https://ec.europa.eu/health/sites/health/files/ehealth/docs/ev_20190611_co122_en.pdf\" target=\"_blank\" title=\"https://ec.europa.eu/health/sites/health/files/ehealth/docs/ev_20190611_co122_en.pdf\">this one</a> - gets (though that detail may have to be taken with a grain of salt, cf. previous comment) . Will be interesting to see how it develops.</p>",
        "id": 177606172,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1570536063
    }
]