[
    {
        "content": "<p>Is IPS intending to define anything about how the IPS content gets exchanged (REST API, messaging, files, email, fax, etc.) ?  I didn't see anything in the actual IG, but I see some history in this stream about $document and $summary operations.</p>",
        "id": 256132742,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1633381628
    },
    {
        "content": "<p>At the moment, IPS separates the content from the exchange model intentionally. Many people want to be able to claim to be able to issue or consume IPS documents, independently of any particular mechanism of exchange.</p>",
        "id": 256133995,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1633382104
    },
    {
        "content": "<p>So the IPS IG by itself isn't implementable.  It would be one of those \"abstract\" IGs?</p>",
        "id": 256135694,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1633382812
    },
    {
        "content": "<p>No, it is 100% implementable. If I receive a document, I can absolutely determine if it conforms to IPS. It’s just that IPS doesn’t tell you how you have to receive it.</p>",
        "id": 256136742,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1633383279
    },
    {
        "content": "<p>Requesting the IPS - see the proposed $summary operation on the Patient Resource <a href=\"https://jira.hl7.org/browse/FHIR-32014\">https://jira.hl7.org/browse/FHIR-32014</a><br>\nReceiving the IPS - Bundle conforming to the IG<br>\nWe'll be testing both at this week's GDHP Connectathon.</p>",
        "id": 256154531,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1633392897
    },
    {
        "content": "<p>Yes.  That's where we are right now.  We will need to do some things to address \"exchange\" questions (whether we add that to the current IG, or not) - but we wanted to leave it open until we began to get some real implementation experience, which is beginning to happen now.</p>",
        "id": 256180982,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1633412380
    },
    {
        "content": "<p>I believe that separating content and transport is an added value in the design of the solution. What we could do, perhaps, is to include a page describing some of the possible exchange mechanisms (including the difference between sending a document to the server end point Vs sending it to the 'Bundle end point '. ) in order readers can have an overview of the different options.</p>",
        "id": 256181763,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1633413036
    },
    {
        "content": "<p>This would allow us to include the definition of the $summary operation without  giving the impression that this is the only mean for exchanging IPSs</p>",
        "id": 256181825,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1633413104
    },
    {
        "content": "<p>IPS could make mention of various transport IGs that are available, including the IHE-MHD and the other IHE transports for documents -- <a href=\"https://profiles.ihe.net/ITI/HIE-Whitepaper/index.html\">https://profiles.ihe.net/ITI/HIE-Whitepaper/index.html</a><br>\nThese mentions should be informative, as the actual binding between IPS and any specific transport (including $summary) should be yet-another-higher-IG</p>",
        "id": 257061295,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633957464
    },
    {
        "content": "<p>i would be interested in looking in particular at MHDS for IPS - modulo that open question on submitting a document bundle which <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  you said was already documented, but I am not sure where the reference is.   i think we will be able to bring some resources to this for the january connectathon, particularly in connection with retrieval of an IPS for generation of the WHO DDCC (flagging for <span class=\"user-mention\" data-user-id=\"193299\">@Luke Duncan</span>  <span class=\"user-mention\" data-user-id=\"197651\">@Reece Adamson</span> )</p>",
        "id": 257774098,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1634336511
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191604\">@Carl Leitner</span> publishing a document as a FHIR document Bundle, not a Binary, is identified as an open-issue. We discussed it, but it has many issues around it. These issues might not be a problem in many settings, but not all.</p>",
        "id": 258018965,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634559421
    },
    {
        "content": "<p>We should talk about this and decide where we want to and need to go with it - including for the the January Connectathon.</p>",
        "id": 258019243,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1634559592
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  -yep, i was just having difficulty finding where it is documented as an open-issue (was hoping to provide it as a reference)</p>",
        "id": 258087709,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1634586165
    },
    {
        "content": "<p><a href=\"https://profiles.ihe.net/ITI/MHD/a_issues.html\">https://profiles.ihe.net/ITI/MHD/a_issues.html</a> -- Open Issue MHD_058</p>",
        "id": 258091938,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634587809
    },
    {
        "content": "<p>In my quick reading of this it seems to make sense to allow the document Bundle:</p>\n<blockquote>\n<ul>\n<li>MHD_058: The profile requires that the document submitted is encoded in a FHIR Binary. Is there interest in also allowing a Bundle of type Document? This would be useful when publishing FHIR-Documents. The FHIR-Document would still need to be seralized into a Bundle of type Document, but that Bundle would not need to be further encoded into a Binary (e.g. base64 encoding). Note that the mime-type in this case would be forced to be the same mime-type as the ITI-65 Bundle, where a Document Source wants to encode ITI-65 in a mime-type that is different than the document, the Binary methodology would need to be used.<ul>\n<li>note that retrieve (ITI-68) does allow the Document Client to ask for the document content in various mime types, thus allowing support for preferred mime type encoding if the Document Responder has the ability to return the content in a encoding other than the DocumentReference indicates.</li>\n</ul>\n</li>\n</ul>\n</blockquote>\n<p>Is there more that we need to consider and/or weigh in on in this regard?  I'm not up on the IHE internal considerations and discussions.<br>\n<span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 258092983,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1634588213
    },
    {
        "content": "<p>I think it needs only experimentation to uncover if there are issues. Hence why it is an open issue. We had no one engaged trying it out. I wanted to encourage that, so made it an open-issue./</p>",
        "id": 258093254,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634588340
    }
]