[
    {
        "content": "<p>Hi <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span>  I've been looking at the IPS MedicationStatement profile and was surprised to see that <code>dosage.doseAndRate</code> (or sub-elements thereof) is not must-support, although <code>dosage.timing</code> and <code>dosage.route</code> are.  I would have expected the \"when\" (<code>timing</code>) and the \"how much\" (<code>doseAndRate</code>) to have the same status. Indeed,  the MedicationStatement example that comes with IPS  has both filled. What was the reasoning behind this choice and what is the recommended way of specifying the intake amount (in a way that only uses \"safe\" must-support fields)  if <code>dosage.timing</code> is filled?</p>",
        "id": 211886982,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1601544879
    },
    {
        "content": "<p>Well, from a Patient Summary perspective this might make sense: The information that you were on a specific medication at a particular point in time is relevant. The precise dosage of that medication seems less relevant.</p>",
        "id": 211887595,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1601545331
    },
    {
        "content": "<p>I agree with Christof that the basic rationale is that the IPS is truly a \"summary\" to provide the most essential data to support clinical care, not necessarily all of the specific details (but you are still free to include and send those if you desire).</p>",
        "id": 211906628,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1601557802
    },
    {
        "content": "<p>Thanks for the input! - that hierarchy of importance/focus definitely makes sense. What I still do not quite understand is the \"relative question\": why is <code>dosage.doseAndRate</code> on a lower level in this hierarchy than <code>dosage.timing</code>/<code>dosage.route</code>?</p>\n<ol>\n<li>If the specific use case supported is capturing the time period during which the patient was taking the medication, one could also (if I read it right) use <code>MedicationStatement.effective[x]</code>(required in IPS anyway). Then the question becomes  why <code>dosage.timing</code> needs to be must-support.  </li>\n<li>Conversely, <code>dosage.timing</code> is also for recording the <em>intervals</em> at which you are taking individual portions of the medication (e.g. once in the morning). If such interval information is essential, why is the <em>amount</em> of meds the patient took (at this specific interval) not?</li>\n</ol>\n<p>To concretely illustrate my confusion using the official IPS example of a MedicationStatement: Suppose we strip it down to only the must-support fields, as conformant systems handling the data would be allowed to. Then <code>dosage.doseAndRate</code> is lost and, as far as structured information goes, we are left with the statement that the patient took some unknown amount of the medication exactly once a day. That feels odd to me - is my \"layman's clinical intuition\" simply off?</p>",
        "id": 211927590,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1601565897
    },
    {
        "content": "<p>I agree, in the end it is a matter of discussion. So during and before a ballot we asking as many experts and users as possible, and then come to a conclusion. BTW some of the decisions were derived from the functional requirements in the CEN IPS standard. Did you check there?</p>\n<p>Relevance for timing could also  be that in a summary you also want to know, if a medication was administered regularly, or on demand. Wouldn't that be expressed in .timing?</p>",
        "id": 211938787,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1601570701
    },
    {
        "content": "<p>.route informs, if something was administered oral or i.v., for example. Apparently more relevant in a summary than the amount.</p>",
        "id": 211939867,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1601571152
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> Good point about CEN IPS - I will have a look there.</p>",
        "id": 212030924,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1601621296
    }
]