[
    {
        "content": "<p>We have new sessions scheduled - and I believe they should all be in Whova now.  The first Touchpoint session is coming up soon (in 15 min!) at the top of this next hour at 11:00 AM ET, and then more at 3:00 PM ET today and at 10:00 AM ET tomorrow.  The Track Highlights is scheduled at 1:30-1:40 ET tomorrow.  Then there is the second \"IPS &amp; Digital Documentation of Covid Certificates (DDCC)\" session at 2:00 PM ET and finally the Track Wrap Up at 4:00 PM ET tomorrow.</p>",
        "id": 253263573,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1631630772
    },
    {
        "content": "<p>Here is the current session we're just opening on IPS (from Whova) <a href=\"https://whova.com/portal/webapp/hlsfh_202109/Agenda/1941342\">https://whova.com/portal/webapp/hlsfh_202109/Agenda/1941342</a></p>",
        "id": 253266681,
        "sender_full_name": "John D'Amore",
        "timestamp": 1631631742
    },
    {
        "content": "<p><a href=\"https://whova.com/portal/webapp/hlsfh_202109/Agenda/1941484\">https://whova.com/portal/webapp/hlsfh_202109/Agenda/1941484</a><br>\nA session has been added 2:30pm ET to 3pm ET (immediately after the WHO DDCC session) to discuss SMART Health Card generation from IPS</p>",
        "id": 253275246,
        "sender_full_name": "Paul Denning",
        "timestamp": 1631635009
    },
    {
        "content": "<p>IPS - DDCC session for today at 1:30pm US ET is here <a href=\"https://whova.com/portal/webapp/hlsfh_202109/Agenda/1940889\">https://whova.com/portal/webapp/hlsfh_202109/Agenda/1940889</a></p>",
        "id": 253281650,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1631637435
    },
    {
        "content": "<p>We discovered this afternoon that doing a \"Filter by tracks\" search on the IPS track in Whova (and I think also doing a text search for \"ips\") for some of us wasn't returning many of the scheduled IPS sessions.  Mary Ann did an update that added one session that truly was missing, and now all of the sessions seem to be showing up correctly in the searches (at least for both me and her).  But if you aren't seeing sessions (or very many of them) when you are searching for IPS in Whova, <strong>make sure that you also check this Zulip topic, too!</strong>  We have 4 IPS sessions that are currently scheduled for tomorrow (potentially that could change and more could be added, if needed).</p>",
        "id": 253329785,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1631656377
    },
    {
        "content": "<p>Also, for anyone who is interested (if you are in the IPS Connectathon track or otherwise), we have our regular weekly HL7 IPS call scheduled tomorrow at 11:00 AM Eastern.  Here are the call <a href=\"http://www.hl7.org/concalls/CallDetails.cfm?concall=56180\">details</a> and this is the Zoom meeting <a href=\"https://us02web.zoom.us/j/5328571160\">link</a>.  Some of the topics that we've raised and discussed in the Connectathon today will also be good to bring up with the broader group tomorrow.</p>",
        "id": 253331419,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1631657265
    },
    {
        "content": "<p>Here is one more scheduling item for tomorrow.  It turns out that I have a personal activity tomorrow at 4:00 PM ET that I can't miss, and that is conflicting with our Track Wrap Up session as it's been scheduled.  So I am going to reschedule the Wrap Up session for 3:00 PM, instead.  That may be an issue for <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span>, as the Gravitate Track is wrapping up at the same time - but hopefully that won't be too big of a problem, for Giorgio or anyone.</p>",
        "id": 253337082,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1631660506
    }
]