[
    {
        "content": "<p>Hello,<br>\nthe IPS Implementation Guide standardizes the structure of the Patient Summary using FHIR resources. The Patient Summary is represented with an instance of Composition referring to all other FHIR resources needed to describe other specific aspects of PS. For this reason, the whole PS (Composition + related resources) in FHIR is contained within an instance of Bundle whose first entry is a Composition. <br>\nSo, my question is: what is the right query to retrieve an instance of IPS,? At the moment I have only these two options:</p>\n<ol>\n<li>query Composition resource in this way: <em>Composition?type=http://loinc.org|60591-5&amp;subject=&lt;ID&gt;&amp;_include=</em>&amp;_count=1*</li>\n<li>query Bundle resource in this way: <em>Bundle?type=document&amp;composition=&lt;ref to Composition representing IPS&gt;</em></li>\n</ol>\n<p>With the first option, the bundle is automatically created by the responding server (and this bundle will be the standard FHIR one not compliant to IPS specs), while with the second option the Bundle must have been previously saved to the server (respecting IPS specs) as a Bundle of type Document. <br>\nI suppose that option number 2 is the right way to ask for a PS, but I'm a little worried about the fact that the search parameter \"composition\" is tagged as TU (Trial Use) so it' far away from being a standard search attribute.</p>\n<p>Cheers and thanks<br>\nAlessio</p>",
        "id": 189493334,
        "sender_full_name": "Alessio Graziani",
        "timestamp": 1583157876
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"217554\">@Alessio Graziani</span>  if you want that an IPS document is generated by the FHIR server you should use the $document operation (<a href=\"https://www.hl7.org/fhir/composition-operation-document.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/composition-operation-document.html\">https://www.hl7.org/fhir/composition-operation-document.html</a>)</p>",
        "id": 189494790,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583158930
    },
    {
        "content": "<p>in this case you need to be able to identify the composition and the server needs to know where to get the referred resources...</p>",
        "id": 189494947,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583159049
    },
    {
        "content": "<p>If you want to query directly the bundle in principle you could use \"Chained parameters\" (<a href=\"https://www.hl7.org/fhir/search.html#chaining\" target=\"_blank\" title=\"https://www.hl7.org/fhir/search.html#chaining\">https://www.hl7.org/fhir/search.html#chaining</a>)</p>",
        "id": 189495253,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583159247
    },
    {
        "content": "<p>another option that you could consider is that of having the IPS referred by a DocumentReference and query the DocumentReference</p>",
        "id": 189495576,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583159412
    },
    {
        "content": "<p>each of these options depends on the architecture you have designed and by the capabilities of the involved servers</p>",
        "id": 189495631,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583159454
    },
    {
        "content": "<p>e.g. a server may not support the $document operation or the needed chained parameters to allow a reasonable query of the IPS bundle.<br>\nIt may also depend on the behavior of the server when it receives an IPS bundle: e.g most systems I saw when they received an IPS bundle store that bundle as it is; so the composition/$document solution cannot be applied  ...</p>",
        "id": 189495839,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583159604
    },
    {
        "content": "<p><em>(quite sure that others could suggest other solutions)</em></p>",
        "id": 189496009,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583159702
    },
    {
        "content": "<p>Currently the HL7 IPS standard doesn't prescribe any specific solution for sharing and retrieving IPSs</p>",
        "id": 189496668,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583160124
    },
    {
        "content": "<p>OK, so you confirm that for the moment there is no standard way to retrieve the IPS. </p>\n<p>I will investigate chaining parameters while querying the Bundle resource (option 2 of my hypothesis). At the moment we're querying the Composition resource performing a search of Composition (of a patient) with type=\"http://loinc.org|60591-5\" , \"_count\" set to 1 and _include set to \"*\". As a result, we get a Bundle of type \"searchset\", containing the Composition as the first entry and all related resources as additional entries in the bundle.</p>\n<p>But I think that we must create the right Bundle compliant to IPS specs, save it to the server and then retrieving the PS by searching over Bundle resource and not over Composition resource.</p>\n<p>Many many thanks<br>\nAlessio</p>",
        "id": 189497543,
        "sender_full_name": "Alessio Graziani",
        "timestamp": 1583160692
    },
    {
        "content": "<p>This function, querying for IPS and other, is the functionality that the IHE IPS profile is addressing.</p>",
        "id": 189499319,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583161702
    },
    {
        "content": "<p>I'd hope one would query for DocumentReference .. akin to how MHD/XDS would approach this style of querying. This would be preferred (IMHO) over querying document bundles, or invoking $document directly. Note that a DocumentReference may use a document URL based on $document, so it supports on-demand documents as well.</p>",
        "id": 189499374,
        "sender_full_name": "René Spronk",
        "timestamp": 1583161739
    },
    {
        "content": "<p>To retrieve an IPS you'd typically query Bundle and chain through to filter on characteristics of the Composition - specifically subject, document type and time-range</p>",
        "id": 189499383,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583161743
    },
    {
        "content": "<p>DocumentReference might exist, but there's no guarantee of that - it depends on the architecture of the repository</p>",
        "id": 189499416,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583161765
    },
    {
        "content": "<p>The IPS project is a joint project between HL7 and IHE...</p>",
        "id": 189499506,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583161816
    },
    {
        "content": "<p>E.g. Bundle?composition.subject.identifier=1234&amp;composition.type=[code for IPS]</p>",
        "id": 189499571,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583161866
    },
    {
        "content": "<p>Does IHE mandate that MHD be used for IPS?</p>",
        "id": 189499585,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583161879
    },
    {
        "content": "<p>IHE will define for those that chose ANY of the IHE defined Document Sharing profiles, how the data would be published, discovered, and retrieved. This includes MHD, but also includes XDS, XCA, XDM, etc...<br>\nAs with any IG, it can't state what one does outside of claim of compliance with that IG... so, yes it is fine to have other access methods defined. I simply wanted to have the bulk of the discussion recognized in the appropriate group, and mostly keep everyone aware of the joint project between IHE and HL7</p>",
        "id": 189500057,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583162150
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"217554\">Alessio Graziani</span> <a href=\"#narrow/stream/207835-IPS/topic/Query.20for.20IPS.20retrieval/near/189497543\" title=\"#narrow/stream/207835-IPS/topic/Query.20for.20IPS.20retrieval/near/189497543\">said</a>:</p>\n<blockquote>\n<p>OK, so you confirm that for the moment there is no standard way to retrieve the IPS. </p>\n</blockquote>\n<p>I would rephrase your sentence in  <em>there are several standard ways to retrieve the IPS.</em><br>\nand this depends on the context of use.</p>\n<p>For example if you have the IPS stored into an XD*-like infrastructure MHD is the most reasonable way to access it; <br>\n..but you can use an MHD-like approach even if you have not an XD* behind... </p>\n<p>I see use cases in which a combined IPS/IPA (International Patient Access) approach is the most useful: e.g the server receives an IPS and it is queried to known if that patient has allergies (or the contrary it receives atomic data and an index of the relevant information (the composition) and it produces the  summary, i.e. the IPS bundle, on demand.</p>",
        "id": 189501374,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583162896
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191415\">Giorgio Cangioli</span> <a href=\"#narrow/stream/207835-IPS/topic/Query.20for.20IPS.20retrieval/near/189501374\" title=\"#narrow/stream/207835-IPS/topic/Query.20for.20IPS.20retrieval/near/189501374\">said</a>:</p>\n<blockquote>\n<p>I would rephrase your sentence in  <em>there are several standard ways to retrieve the IPS.</em><br>\nand this depends on the context of use.</p>\n</blockquote>\n<p>Ok. Our context is that the PS must be retrieved from a server adopting FHIR API (the PS has been previously stored in the server by a doctor using an ad-hoc editing application). </p>\n<p>Thanks<br>\nAlessio</p>",
        "id": 189507247,
        "sender_full_name": "Alessio Graziani",
        "timestamp": 1583166069
    },
    {
        "content": "<p>I think, as Giorgio mentioned, that \"IPS on <a href=\"https://build.fhir.org/ig/grahamegrieve/ipa-candidate/\" target=\"_blank\" title=\"https://build.fhir.org/ig/grahamegrieve/ipa-candidate/\">IPA</a>\" is likely to become a common (and probably recommended) approach to generating/retrieving IPS documents/data from EHR systems.  But this is still mostly an idea at present, and we would welcome participation in the discussions and further specification development (IPA, particularly, is still very early) and in planning for and participating in Connectathon testing.</p>",
        "id": 189514397,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1583170189
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span>, <br>\nI wonder if the answer to the question of <span class=\"user-mention\" data-user-id=\"217554\">@Alessio Graziani</span> depends also from the legal context, other than from the tecnical details of the server.<br>\nFor example, what is the legal status of an IPS generated automatically in Italy? I know that in Italy the Patient Summary must be created by the GP of the patient. Of course a GP could ask to automatically generate an IPS, review, sign and store it. I understand that only the IPS stored by the GP would be the official Patient Summary. In other term, is it correct to say that on an Italian FHIR server, at least with the current legislation, the automatic generation of the IPS would not return the  official Patient Summary, also if the server tecnically supports it?</p>",
        "id": 189579738,
        "sender_full_name": "Francesco Torelli",
        "timestamp": 1583231301
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"194459\">@Francesco Torelli</span> yes the technical solution depends on the business scenario (including legal constraints) ... but this is true not only for the IPS :-)</p>",
        "id": 189581900,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583233089
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"194459\">Francesco Torelli</span> <a href=\"#narrow/stream/207835-IPS/topic/Query.20for.20IPS.20retrieval/near/189579738\" title=\"#narrow/stream/207835-IPS/topic/Query.20for.20IPS.20retrieval/near/189579738\">said</a>:</p>\n<blockquote>\n<p>I understand that only the IPS stored by the GP would be the official Patient Summary. In other term, is it correct to say that on an Italian FHIR server, at least with the current legislation, the automatic generation of the IPS would not return the  official Patient Summary, also if the server tecnically supports it?</p>\n</blockquote>\n<p>There are several countries - not only Italy - in which the Patient Summary is the result of a summarization act that has to be realized by a clinician.<br>\nIn principle nothing prevents to imagine that this act will have as outcome the composition, so that the $document approach could be still valid....  (but as mentioned before it is not the only possible approach)</p>",
        "id": 189582466,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583233457
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191415\">Giorgio Cangioli</span> <a href=\"#narrow/stream/207835-IPS/topic/Query.20for.20IPS.20retrieval/near/189582466\" title=\"#narrow/stream/207835-IPS/topic/Query.20for.20IPS.20retrieval/near/189582466\">said</a>:</p>\n<blockquote>\n<p>There are several countries - not only Italy - in which the Patient Summary is the result of a summarization act that has to be realized by a clinician.<br>\nIn principle nothing prevents to imagine that this act will have as outcome the composition, so that the $document approach could be still valid....  (but as mentioned before it is not the only possible approach)</p>\n</blockquote>\n<p>Right, but that composition would not be considered as the entire Patient Summary but just part of it. I mean: if the act of the clinician must produce also a digital signature we should assume that in that country the Composition exists only as part of a signed Bundle containing it. Only the signed Bundle would be considered as the complete and official Patient Summary, because the composition does not contain the signature. </p>\n<p>The business scenario that I have in mind is a future version of the eHDSI National Contact Point (NCP) that offers a FHIR  based API for retrieving, from a country A, a complete and structured Patient Summary of a patient living in a different country B. I think that, for this business scenario, a standard way to retrieve the complete and official Patient Summary should be agreed and this should be independent from how the Patient Summary is created in each country.  </p>\n<p>The standard way to retrieve a complete patient summary, in such a cross border scenario, should be a FHIR query that returns an IPS Bundle, because only a Bundle may include also a digital signature, that is part of the Patient Summary in some country. It should be not the client, but the country that exposes the NCP, to decide if the Bundle is generated automatically from a composition or is created and stored manually by a clinician.  </p>\n<p>The standard API could allow to retrieve also single parts of the Patient Summary, including the entire composition, but it should be agreed that the composition is not (always) the complete official Patient Summary. The standard API  could allow to retrieve also a DocumentReference, but only for those situations where, for some reason, a structured content based on FHIR cannot be produced.</p>\n<p>Do you agree?</p>",
        "id": 189589388,
        "sender_full_name": "Francesco Torelli",
        "timestamp": 1583239705
    },
    {
        "content": "<p>Francesco, your question goes beyond the IPS itself and it might be applied also to other types of information that may be exchanged cross-border in Europe.</p>\n<p>The first question to answer is what is the business architecture: i.e. what is your vision, what are your objectives, which are your usage scenarios, what are the external constraints (policy, legal, technical,...), and so on.... </p>\n<p>I personally see a (very) little advantage of \"just\" replicating in FHIR the current European CDA based eHDSI technical solution;  but this discussion goes beyond the scope of this stream :-)</p>\n<p><span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> any suggestion on where this kind of discussion may happen ? maybe a \"Europe\" stream ?</p>",
        "id": 189592800,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583242631
    },
    {
        "content": "<p>I will repeat... The IHE MHD implementation guide provides a constrained methodology of using the FHIR DocumentReference for the purpose of Document Sharing... This API can be to a FHIR server acting as the persistence, other service acting as the persistence (or generator), XCA, or XDS.<br>\nThere are EC cross boarder requirements to use AS4, which there is an option in IHE XCA that is designed around this cross boarder requirement. Not sure how to handle this AS4 requirement with http/REST, that is for EC participants to argue about. <br>\nThe IHE portion of IPS is to show binding between the IPS content specification defined in HL7, with the Document Sharing transports (metadata, etc).</p>",
        "id": 189598256,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583246473
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194459\">@Francesco Torelli</span> <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span>  As <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> indicates: The functionality of a FHIR interface on the national side of the NCPeH would be very much like MHD. That is because the NCPeH is using XCA on the international side, to connect to the other NCPs. And it may be possibly moving towards  AS4 in the future, maybe using Message Queues as an intermediate layer between XCA and AS4. To my knowledge, this is not a requirement, but part of a \"feasability analysis\" of reusing infrastructure components from European eGov solutions.</p>\n<p>I guess that the next steps in EU cross-border exchange are already envisaged. The EHRxF recommendation specifies Exchange formats for EHR content, all document-oriented. So I see little room for FHIR APIs within the current service infrastructure, that connects the NCPeHs between member states.</p>",
        "id": 189687537,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1583326542
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> regarding a \"Europe\" stream: My preferred location would be a page on the eHDSI wiki, e.g. here <a href=\"https://ec.europa.eu/cefdigital/wiki/display/EHMSEG/eHDSI+MS+Expert+Community+Home\" target=\"_blank\" title=\"https://ec.europa.eu/cefdigital/wiki/display/EHMSEG/eHDSI+MS+Expert+Community+Home\">https://ec.europa.eu/cefdigital/wiki/display/EHMSEG/eHDSI+MS+Expert+Community+Home</a> or here <a href=\"https://ec.europa.eu/cefdigital/wiki/display/EHSEMANTIC/\" target=\"_blank\" title=\"https://ec.europa.eu/cefdigital/wiki/display/EHSEMANTIC/\">https://ec.europa.eu/cefdigital/wiki/display/EHSEMANTIC/</a></p>",
        "id": 189688830,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1583327715
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span>,<br>\nlet's remember that the <a href=\"https://ec.europa.eu/newsroom/dae/document.cfm?doc_id=57254\" target=\"_blank\" title=\"https://ec.europa.eu/newsroom/dae/document.cfm?doc_id=57254\">EHRxF recommendation 2019</a> also says: \"The refinement of the exchange format should consider the possibility offered by resource driven information models (such as Health Level Seven Fast Healthcare Interoperability Resources (HL7 FHIR©))\". If it makes sense or not is topic for another stream. </p>\n<p>As you know, within the <a href=\"https://www.interopehrate.eu/\" target=\"_blank\" title=\"https://www.interopehrate.eu/\">InteropEHRate project</a>, we are trying to envision  how the eHDSI infrastructure, that is intended for exchange of health data among healthcare providers, will coexist and interoperate with FHIR based mobile protocols for exchange of health data among Patients and healthcare providers and researchers. That is also topic for another stream, more related to MHD, Argonaut Data Query IG, IPA.</p>",
        "id": 189695207,
        "sender_full_name": "Francesco Torelli",
        "timestamp": 1583331864
    },
    {
        "content": "<p>Yes, <span class=\"user-mention\" data-user-id=\"194459\">@Francesco Torelli</span>. And I believe, there could be a move towards FHIR-based documents in the future (not soon, though). I just wanted to point out that the architecture of the currently operational cross-border exchange is based on the IHE Cross-Community Access profiles. This is the normative interface between NCPeH instances, agreed between the member states. So whatever interfaces the NCPeH exposes on the national side, this defines the functionality that you can get across borders, for the time being.</p>",
        "id": 189715815,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1583343849
    },
    {
        "content": "<p>Hi all -- this is a fascinating discussion; and very informative, thank you. Notwithstanding the INTERNATIONAL part of the IPS moniker, there are important use cases that are <strong>not </strong>focused solely on the exchange of patient summaries across international borders. The IPS -- as a summary -- could satisfy use cases similar to those of the C-CDA; it is a <em>very</em> useful way to support care continuity workflows. For such use cases, a functionality similar to the <strong>XDS.b On-demand Document</strong> capability is helpful. <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> , it appears the the $document operation is the way to support such an <strong>on-demand IPS</strong> kind of use case. Am I right about that? <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  -- is this scenario OK within the context of <strong>MHDS</strong> (although maybe <em>not</em> within the context of MHD)?</p>",
        "id": 198133277,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1589926078
    },
    {
        "content": "<p>The XDS/XCA/MHD system defines a mechanism for \"On-Demand\" and \"Deferred-Creation\" document creation/retrieval. These are content agnostic. Thus they will work equally well for CDA documents as they would for FHIR documents; they would even work fine for FHIR resources that don't measure up to the definition of a healthcare document. This because XDS/XCA/MHD use the more liberal internet (http) definition of a 'document', not the more involved (in a good way) definition of a 'document' defined in HL7 (from which we get CDA and FHIR Document)<br>\nThe FHIR $document operation  is specific to FHIR Documents. A good functionality, but very single purpose. It also lacks functionality discovery that is a core part of XDS/XCA/MHD On-Demand system.  That said, one could have the instance of a On-Demand document created by way of the $document operation on the backend. Meaning one would publish a \"On-Demand\" document entry that described a potential use of a $document operation, when a Document Consumer requests it be created and retrieved that is fulfilled on the backend by way of the FHIR $document operation.<br>\nSo, the infrastructure you have XDS/XCA/MHD already supports On-Demand in a way that can support FHIR Documents. All that is necessary is for custodians to publish FHIR Documents or On-Demand entries indicating support for FHIR Documents; and for Document Consumers to choose to retrieve that kind of content. The infrastructure (XDS/XCA/MHD) is agnostic to this change in content.</p>",
        "id": 198188154,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589976436
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> . I asked specifically about MHDS because of my interest in end-to-end FHIR solutions that may be implementable in contexts where there is not a legacy CDA infrastructure already in place. I'm working in such context, now, and am looking for a functionally-equivalent XDS.b On-demand Document... but using FHIR-only.</p>",
        "id": 198205182,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1589984409
    },
    {
        "content": "<p>About \"IPS on IPA\" - how is the IPA progressing? There was a mention in this thread that it is still in early stages. There seems to be no change in regard to GitHub in a couple of months. </p>\n<p>No mention of IHE QEDm in this thread (XDS/XCA/MHD all are mentioned), is it of any relevance in regard to IPS contents? In QEDm I see only options for specific resource types - not for \"IPS-ish\" patient summary document --&gt; I see that maybe it would be the domain of IHE MHD then?</p>",
        "id": 206123961,
        "sender_full_name": "Marko Jalonen",
        "timestamp": 1596709324
    },
    {
        "content": "<p>IPA is going slowly. It's important but not urgent</p>",
        "id": 206128120,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596712754
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <a href=\"https://build.fhir.org/ig/grahamegrieve/ipa-candidate/branches/master/ipa-server.html\">https://build.fhir.org/ig/grahamegrieve/ipa-candidate/branches/master/ipa-server.html</a> seems immensly empty. Is this because IPA is not doing progress?</p>",
        "id": 208501045,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1598816679
    },
    {
        "content": "<p>and does \"anyone\" keep the IPA and IPS profiles in sync/adds dependencies between the IG's? - ie. the patient profiles are not entirely allignd: <a href=\"https://build.fhir.org/ig/grahamegrieve/ipa-candidate/branches/master/StructureDefinition-ipa-patient.html\">https://build.fhir.org/ig/grahamegrieve/ipa-candidate/branches/master/StructureDefinition-ipa-patient.html</a> vs <a href=\"https://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-Patient-uv-ips.html\">https://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-Patient-uv-ips.html</a></p>",
        "id": 208501228,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1598816995
    },
    {
        "content": "<p>IPA hasn't been going anywhere, but it is about to. I'm glad to hear you are interested in it.</p>",
        "id": 208504156,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598821424
    },
    {
        "content": "<p>They are different, to reflect their different focus, and I would propose changes to both to get them a little more aligned, but they are not misaligned - that would be that they are incompatible</p>",
        "id": 208504211,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598821490
    },
    {
        "content": "<p>k - its going to have pretty much focus from my side once we get to october (<span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> im looking into pushing the use of IPA in combination with IPS in a #european project which is going to be announced next month I presume )</p>",
        "id": 208673352,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1598959512
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> are you planning to participate the IPS track in the next connect-a-thon ? The European project you mentioned is Gravitate Health or it is a different one ? In both cases let's see if we can reach a wider Eu community and maybe link it to the X-eHealth project started today</p>",
        "id": 208679478,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1598963046
    },
    {
        "content": "<p>Its gravitate, yes. <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> do you also have a part in that?</p>",
        "id": 208703613,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1598973945
    },
    {
        "content": "<p>Yes  and I see a possible synergy among UNICOM, X-health and gravitate health</p>",
        "id": 208704210,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1598974164
    },
    {
        "content": "<p>Awesome - i guess we'll meet later then</p>",
        "id": 208722568,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1598982412
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> I've been hoping that we would start exploring \"IPS on IPA\" in earnest very soon, so I'm really glad to hear that you are planning to start working on that.  And, as <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> mentioned, if you have any opportunity to participate in the <a href=\"https://confluence.hl7.org/display/FHIR/2020-09+International+Patient+Summary+Track\">IPS track</a> in the Connectathon next week, that would be great.</p>",
        "id": 208893122,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1599083743
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> im afraid I cant find the time to attend</p>",
        "id": 209546069,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599674224
    },
    {
        "content": "<p>I'm sorry to hear that, <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span>, but we definitely appreciate your interest and any activities.  If you have any update on thoughts or progress, please let us know.</p>",
        "id": 209559349,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1599681165
    },
    {
        "content": "<p>Any advance on the format offered by <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> above as a query to request an IPS for a patient with an id of ABC2345?  <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> , <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> ?</p>\n<p>GET [base]/Bundle?composition.patient=ABC2345&amp;composition.type=http://loinc.org|60591-5</p>\n<p>Although NZ Patient NHIs will be used as IDs by NZ FHIR Servers, many will also use it as an identifier...</p>\n<p>GET [base]/Bundle?composition.patient.identifier=https://standards.digital.health.nz/ns/nhi-id|ABC2345&amp;composition.type=http://loinc.org|60591-5</p>",
        "id": 219797275,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1607917279
    },
    {
        "content": "<p>The first one is going to be <code>GET [base]/Bundle?composition.patient.identifier=ABC2345&amp;composition.type=http://loinc.org|60591-5</code>, isn't it?  We need to start doing more testing on this - obviously a good topic to explore in the coming Connectathon.</p>",
        "id": 219797900,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1607918261
    },
    {
        "content": "<p>is this just searching for past summaries? we should use an operation to get the current summary</p>",
        "id": 219797971,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1607918344
    },
    {
        "content": "<p>That makes sense.</p>",
        "id": 219797996,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1607918393
    },
    {
        "content": "<blockquote>\n<p>Although NZ Patient NHIs will be used as IDs by NZ FHIR Servers, many will also use it as an identifiers</p>\n</blockquote>\n<p>Is it expected that FHIR servers will be required to assign a particular value to a <a href=\"http://Patient.id\">Patient.id</a>?</p>",
        "id": 219799209,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1607919983
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191405\">Rob Hausam</span> <a href=\"#narrow/stream/207835-IPS/topic/Query.20for.20IPS.20retrieval/near/219797900\">said</a>:</p>\n<blockquote>\n<p>The first one is going to be <code>GET [base]/Bundle?composition.patient.identifier=ABC2345&amp;composition.type=http://loinc.org|60591-5</code>, isn't it?  We need to start doing more testing on this - obviously a good topic to explore in the coming Connectathon.</p>\n</blockquote>\n<p>We did some quick trials at the last connectathon by using some of the available test servers <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=91988343#id-202009IPSTrackFindings-PostingandQueryingIPS\">these are some of the results</a> .. let's try to repeat them increasing the number of examples and specifying more in detail what we'd like to test.</p>",
        "id": 219808490,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1607931986
    },
    {
        "content": "<p>As you can see one server considered GET [base]/Bundle?composition.patient.identifier=XYZ ambiguous (<em>The chained search parameter 'composition.patient.identifier' is ambiguous</em>)  and expected that the GET [base]/   <br>\nBundle?composition.patient:Patient.identifier=XYZ would be used instead</p>",
        "id": 219808862,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1607932369
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191405\">Rob Hausam</span> <a href=\"#narrow/stream/207835-IPS/topic/Query.20for.20IPS.20retrieval/near/219797900\">said</a>:</p>\n<blockquote>\n<p>The first one is going to be <code>GET [base]/Bundle?composition.patient.identifier=ABC2345&amp;composition.type=http://loinc.org|60591-5</code>, isn't it?  We need to start doing more testing on this - obviously a good topic to explore in the coming Connectathon.</p>\n</blockquote>\n<p>As patient.identifier has a cardinality 0...*, surely it needs to be a token (system|value) when used as a search parameter.   OTOH when the <a href=\"http://patient.id\">patient.id</a> is used  as a search parameter, my understanding is that patient=id is sufficient. I would expect that a server that holds a patient resource to have assigned an id to it. I'd only expect to see a patient resource without an id when it's being POSTed by a client for the first time.</p>\n<p>Agree with Grahame that an operation would be a more elegant way to request the current summary.</p>",
        "id": 219811144,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1607934343
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/207835-IPS/topic/Query.20for.20IPS.20retrieval/near/219797971\">said</a>:</p>\n<blockquote>\n<p>is this just searching for past summaries? we should use an operation to get the current summary</p>\n</blockquote>\n<p>Are you thinking to an operation for document bundles ?  That would make for sure the life easier for retrieving IPS or other document bundles, beside generating them with the $document operation..</p>",
        "id": 219830325,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1607946755
    },
    {
        "content": "<p>possible search parameters might be </p>\n<ul>\n<li>patient business identifier</li>\n<li>document code/class code</li>\n<li>period (if not set = most recent)</li>\n</ul>",
        "id": 219830626,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1607946947
    },
    {
        "content": "<p>you can search for existing ones, or explicitly generate them, but I think that the use case is that the requester doesn't know which is which, and shouldn't have to care. They just want a summary if it's available</p>",
        "id": 219832298,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1607947964
    },
    {
        "content": "<p>whether that means it is generated or not</p>",
        "id": 219832309,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1607947973
    },
    {
        "content": "<p>Outcome of connectathon discussion about dynamically retrieving an IPS:</p>\n<div class=\"codehilite\"><pre><span></span><code>GET Patient[/id]/$summary[?graph=xxx&amp;profile=xxx]\n\nGET Patient/$summary?profile=http://hl7.org/fhir/uv/ips/StructureDefinition/Bundle-uv-ips&amp;identifier=\n</code></pre></div>\n<p>The summary operation asks the server to return the latest appropriate summary for the patient. The patient is either </p>\n<ul>\n<li>explicitly identified by the id of the patient resource</li>\n<li>implicitly identified as the only patient in scope due to security/context</li>\n<li>specified by other additional (unspecified here) parameters (or do we specify the identifier parameter?)</li>\n</ul>\n<p>This operation returns a bundle (type = document) for single patient.</p>",
        "id": 222929823,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610747209
    },
    {
        "content": "<p>IPS would recommend that smart-app-launch is used to acquire the security tokens for the operation, but that's not part of the definition of the operation</p>",
        "id": 222930009,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610747284
    },
    {
        "content": "<p>The operation asks for the latest appropriate summary, whether that already exists, or must be newly generated. Unless otherwise specified, the server has discretion to choose how to fulfill the request. We anticipate that there will be a profusion of business practices around currency/attestation, and therefore variance in parameters around that. If some consistency emerges, HL7 would consider adding additional parameters to the base definition</p>",
        "id": 222930123,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610747361
    },
    {
        "content": "<p>IPS will define a profile on Bundle with the URL in the example above, so that an IPS can be reqested. In the absence of a profile parameter, server has discretion to construct/return a summary of it's choice</p>",
        "id": 222930251,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610747426
    }
]