[
    {
        "content": "<p>The IPS states for Problem List: \"The IPS problem section lists and describes clinical problems or conditions currently being monitored for the patient.\" Sounds like excluded diagnoses aren't part of this -once a diagnosis is refuted, one wouldn't monitor it anymore.<br>\nCondition.verificationStatus can have 'refuted' - but the IPS does not limit the verificationStatus to include only non-refuted conditions.<br>\nSo what is the intent of the IPS? Should/may excluded diagnoses be part of the IPS?</p>",
        "id": 244910767,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1625475669
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192440\">@Marc de Graauw</span>, that's a good question.  I don't think we've decided, and probably haven't ever really discussed this.  My take at the moment is that the expectation for the IPS document bundle would be to <strong>not</strong> include the excluded/refuted diagnoses - but, as you pointed out, the current specification does not attempt to enforce this.  The expectation could potentially be broader for some of the non-document \"IPS library\" use cases for the IPS profiles - but I don't have a specific case where that is required that comes to mind at the moment.  We can discuss this further here and probably should put it on the agenda for an IPS call (this week or a subsequent one).  <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span>, what do you think?</p>",
        "id": 244935366,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1625491451
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> , clear enough for now.</p>",
        "id": 244936399,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1625492025
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192440\">@Marc de Graauw</span> and <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> . <br>\nA diagnosis may be part of the IPS document problem list if used to highlight a problem  that patient can have.</p>",
        "id": 244940585,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1625494266
    },
    {
        "content": "<p>as Rob wrote we have not considered the excluded diagnosis case initially so relevant , but I've been told that it might be of interest in the scope of the IPS for Rare Diseases</p>",
        "id": 244940893,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1625494430
    },
    {
        "content": "<p>the description you mentioned comes from the active problem CDA section. In this case I believe is still valid to have an active concern act including supposed active problems and excluded diagnosis observations in. We need to recheck if it still applies in the case of FHIR</p>",
        "id": 244941726,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1625494827
    },
    {
        "content": "<p>I'm not able to get in to the Patient Care Zoom meeting today, so we will use this as an alternate: <a href=\"https://us02web.zoom.us/j/8488242144?pwd=ZDNjeWhkenYxb09adlZiRXoxL1N3dz09\">https://us02web.zoom.us/j/8488242144?pwd=ZDNjeWhkenYxb09adlZiRXoxL1N3dz09</a></p>",
        "id": 245190581,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1625668775
    }
]