[
    {
        "content": "<p>We did not cancel the IPS call for today (9:00 AM ET/14:00 UTC), and I'm planning to go ahead and hold the call as scheduled.  That may be particularly useful for those in the group who are not participating in the Connectathon, and we can report on our discussions and progress so far over the past 2 days.  Here is the <a href=\"https://www.hl7.org/concalls/CallDetails.cfm?concall=57666\">meeting</a> and the Zoom <a href=\"https://us02web.zoom.us/j/5328571160\">link</a>.  Whether you are participating in the Connectathon or not, please join if you can.</p>",
        "id": 267723265,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1641993967
    },
    {
        "content": "<p>As we did last week during the Connectathon, the WGM is going on this week but I'm planning to hold the IPS call today (8:00 AM CST/9:00 AM EST/14:00 UTC) as scheduled.  For those of us who are attending the WGM, this time is 30 min. before the General Session begins at 8 :30 CST, and if we go for a full hour will end just as Q1 begins at 9:00 CST.  We might decide to have a shorter than usual call today, but we can see.  I should have some follow up and further IPS spec updates from our decisions last week to show and go over with everyone.  Again, this is the Zoom <a href=\"https://us02web.zoom.us/j/5328571160\">link</a>.</p>",
        "id": 268531275,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1642595348
    },
    {
        "content": "<p>Again, please join the call today if you can (whether you're at the WGM or not).</p>",
        "id": 268531818,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1642595673
    },
    {
        "content": "<p>note that the IPS call details are no longer in the regular HL7 calendar.</p>",
        "id": 268535283,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642597380
    },
    {
        "content": "<p>Oh, thanks, John.  I did forget to check that!  Normally the call schedule does end and gets renewed at the WGM - and that is the case this time, too.  We do have the IPS/IPA session scheduled in Patient Care Q4 tomorrow (which is a rather terrible time for Europe).  Since, as John pointed out, the meeting <strong>isn't</strong> actually on the calendar for today, what is everyone's preference?  Maybe we should we take a break today and plan to start again with the regular calls next week?</p>",
        "id": 268535990,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1642597709
    },
    {
        "content": "<p>I'm willing to hop on the call at 9:00 Eastern for at least a little while and see if anyone didn't notice the calendar and joins (unless there seems to be a clear response here first).</p>",
        "id": 268536542,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1642598022
    }
]