[
    {
        "content": "<p>Looking at the Condition profile in IPS, I was somewhat surprised that although nine fields are declared must-support, <code>recordedDate</code> is not one of them. From my (admittedly quite basic) understanding, it is quite difficult to interpret the code in <code>clinicalStatus</code> (which IPS requires) without some sort of indication of when this status was asserted. and <code>recordedDate</code> seems to capture this most closely (albeit not exactly). Even if there is an onset date, it might not always help clarify whether the captured clinical status applies if it is not from the recent past (status may have been asserted long after onset). Also, if I read the IPS CDA IG correctly, <a href=\"https://international-patient-summary.net/index.php?title=IPS_implementationguide_1#IPS_Problem_Concern_Entry\">the Problem Concern Entry there</a>  includes an <code>effectiveInterval</code>, for which the low value has this comment: \"This element asserts when the concern became active. This equates to the time the concern was authored in the patient's chart and the author started tracking this concern.\"  To me, that sounds like it would roughly correspond to the <code>recordedDate</code> element in FHIR (\"when this particular Condition record was created in the system\").</p>\n<p>All in all, I would  have expected <code>recordedDate</code>  to be must-support in IPS (the, more targeted, IG from the German Medical Informatics Initiative even make it required). What was the reasoning behind not doing so?</p>",
        "id": 237120403,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1620024823
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span>  : MustSupport. The initially adopted rule for MS was the reference to the IPS data set (EN 17269/ISO 27269). That data set include the \"Onset date\" as Required if Known, and not the recording date. <br>\nHaving said that, <br>\n(1) during the IPS calls we are now cleaning up the mustSupport flags (just ended with the IPS composition profile) so we will recheck also the Condition ones.<br>\n(2) it should be better understood the real capability of systems to correctly capture these data. In most real implementations of the CDA Patient Summary in Europe I noticed that the act.effectiveTime is filled either with exactly the same data of the observation or just nullflavored.</p>",
        "id": 237124258,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1620027474
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> Thanks for the update, sounds good.</p>\n<blockquote>\n<p>act.effectiveTime is filled either with exactly the same data of the observation</p>\n</blockquote>\n<p>I'm afraid I'm a little out of my depth w.r.t. CDA here, where does date (data?) of the observation map to in FHIR? Is it <code>onset[x]</code>?</p>",
        "id": 237138462,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1620036156
    },
    {
        "content": "<p>The mapping of the CDA act/observation structure it is not always so straightforward even if you consider the simple case 1 act with 1 observation ..<br>\n<a href=\"/user_uploads/10155/xk-kVhd-r_6GFlb6JEkfqHFv/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/xk-kVhd-r_6GFlb6JEkfqHFv/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/xk-kVhd-r_6GFlb6JEkfqHFv/image.png\"></a></div>",
        "id": 237139546,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1620036809
    },
    {
        "content": "<p>Ah, I see. Do the <span aria-label=\"warning\" class=\"emoji emoji-26a0\" role=\"img\" title=\"warning\">:warning:</span> -symbols for the status code and effective time for the Act mean that these cannot be/have not been mapped to FHIR?</p>",
        "id": 237142680,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1620038646
    },
    {
        "content": "<p>it just highlight the fact that the mapping doesn't seem to be so straightforward..but others may have different thoughts  :-)</p>",
        "id": 237143281,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1620039010
    },
    {
        "content": "<p>OK, thanks! I'm getting to appreciate the non-straightforwardness of this <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>  (as evidenced by <a href=\"#narrow/stream/179166-implementers/topic/Interpreting.20Observation.2EclinicalStatus.20without.20any.20dates\">this other thread I opened</a>).</p>",
        "id": 237450637,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1620198716
    }
]