[
    {
        "content": "<p>Hi,<br>\none question regarding slicing of Medication.code. In the  textual explanation there are described five levels of IDMP-codes, but these are not reflected in the build-profile for Medication. In the build profile there are only slices for atc and snomed. Is there are reason for this?</p>",
        "id": 202662201,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1593678674
    },
    {
        "content": "<p>As IDMP is still developing, the five levels are anticipating the future logical structure of IDMP identifiers. But no practical use as of today.</p>",
        "id": 202664317,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1593680285
    },
    {
        "content": "<p>Thank you Christof, so the plan might be to add slices as identifiers/ codes for the 5 IDMP levels are developed? Is there expected to be any guidance on what levels  of IDMP SNOMED CT-codes could be used?</p>",
        "id": 202668149,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1593683306
    },
    {
        "content": "<p>I think it is SNOMED CT <em>instead</em> of IDMP identifiers, for the time being. In that sense, this is a valid question: should we use value sets of SNOMED codes to \"simulate\" the IDMP levels? And how would the slicing work in that case?</p>",
        "id": 202677834,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1593691056
    },
    {
        "content": "<p>OK, we can ponder that a little bit up here as well. In the first round we will be  slicing IDMP-levels on basis of Norwegian identifiers.</p>",
        "id": 202678713,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1593691637
    },
    {
        "content": "<p>The slice is open so you can use whatever you want as product code.</p>",
        "id": 202697019,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1593700671
    },
    {
        "content": "<p>These slices gives the idea that ATC and SNOMED are for the time being the most reasonable solutions for cross-jurisdictions product identification, waiting for more widely usable product identifiers (IDMP)</p>",
        "id": 202697478,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1593700899
    },
    {
        "content": "<p>based on the latest discussions the basic idea is that the IDMP identifiers will go in the medication.code, but since the cardinality is 1..1 they need to be represented into different codings. The question here is if they are actually representing the same concept... I hope this might be part also of the discussion in the UNICOM project (<a href=\"https://unicom-project.eu/\">https://unicom-project.eu/</a>)</p>",
        "id": 202698600,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1593701390
    },
    {
        "content": "<p>current guidance in FHIR is:<br>\n\"The concept may be coded multiple times in different code systems (or even multiple times in the same code systems, where multiple forms are possible, such as with SNOMED CT). Each coding (also referred to as a 'translation') is a representation of the concept as described above and may have slightly different granularity due to the differences in the definitions of the underlying codes. \"</p>",
        "id": 202700035,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593702048
    },
    {
        "content": "<p>In my opinion, this (or several other cases),  are NOT slightly different granularity - these are completely different concepts - a PhPID and a PCID are really not a translation.</p>",
        "id": 202700140,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593702103
    },
    {
        "content": "<p>(we had a similar discussion with the vaccine code (MMR) and a GTIN)</p>",
        "id": 202700233,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593702142
    },
    {
        "content": "<p>so perhaps we need to ask for a change FHIR that CodeableConcept.coding should support slightly different or wildly different granularity of related concepts</p>",
        "id": 202700356,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593702210
    },
    {
        "content": "<p>(or find some other way, I am not sure what is best). For me it is absolutely different to have a GTIN and to ahve a PhPID. I think UNICOM will feel that pain indeed</p>",
        "id": 202700500,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593702263
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> isn't this the old well-known TERMINFO problem? i. e. choose between creating complex data structures to capture those different granularities vs. \"hiding\" the complexity in the code system? FHIR slicing based on CodeSystem (or on \"granularity\") might deliver the best of both worlds?</p>",
        "id": 202727154,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1593714497
    },
    {
        "content": "<p>not really, i think. I would not want to create a data structure for each level if that is what you are pointing at.</p>",
        "id": 202727280,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593714568
    },
    {
        "content": "<p>Slicing is a good choice. The thing that I am concerned is that the slicing is done on a data element that is (by its definition) meant to support translations, i.e. same granularity or slightly different</p>",
        "id": 202727596,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593714695
    },
    {
        "content": "<p>data element or data type? add more metadata to slicing, for use cases that want to know more details?</p>",
        "id": 202727858,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1593714797
    },
    {
        "content": "<p>like a \"structure behind the structure\"? adding more layers between codesystem and data elements, beyond value sets?</p>",
        "id": 202728087,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1593714897
    },
    {
        "content": "<p>The slicing on Medication.code is on the element, and therefore at the CodeableConcept level.  So in an given instance, whichever slice (or no slice) is matched, multiple Codings can be included which can deal with the differences in granularity (even potentially \"extreme\" differences) as long as the overall meaning is the same (i.e. all of the Codings are representing the same \"medication\" [e.g. \"penicillin\"] at whatever \"level\" each code represents).</p>",
        "id": 202752026,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1593729443
    },
    {
        "content": "<p>Maybe I was looking at a different place. this is about slicing on the coding element, right?</p>",
        "id": 202753476,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593730708
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/datatypes.html#codeableconcept\">http://build.fhir.org/datatypes.html#codeableconcept</a> mentions slightly different granularities</p>",
        "id": 202753768,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593730964
    },
    {
        "content": "<p>What we are doing is slicing on the 'code' element (a 1..1 non-repeating element, by the way), at the CodeableConcept data type level.  The slicing is <strong>not</strong> at the Coding level.  Multiple Codings, according to the usual rules, are allowed for any instance.</p>",
        "id": 202764266,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1593744633
    },
    {
        "content": "<p>Ok, I was not thinking that. <br>\nI thought this was about supporting several codes at once (i.e. \"I took Ben-U-Ron which in my country is the common brand for Paracetamol\")</p>",
        "id": 202768440,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593751539
    },
    {
        "content": "<p>Yes the slice is at the code level, I don't see however how this change the initial question of <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>   if it is meaningful to convey different IDMP identifiers in the medication.code.<br>\nSince the cardinality of the code is 1..1  the only way is to use different codings for the same code, that in principle should represent the same \"concept\" ...</p>",
        "id": 202779962,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1593765325
    },
    {
        "content": "<p>if I need to share only one code (and it could be also any of the IDMP identifer) the medication.code is fine</p>",
        "id": 202780105,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1593765431
    },
    {
        "content": "<p>I believe there is still an open issue when multiple codes should be provided. <br>\nThis is relevant for cross-jurisdictions sharing:<br>\nI send all what I know (national product code, ATC code, (future) IDMP identifiers) and the receiver pick up those is able to understand</p>",
        "id": 202780358,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1593765632
    },
    {
        "content": "<p>This is what I had in mind writing \"more layers between codesystem and data elements\". Let's say I have one data element 1..1 and I am using certain codes (ATC, or national etc.) to describe my concept, I am looking for a way to say \"I am using this code from that codesystem with the following intention or implied meaning in relation to the given data element : <code>{ exact | broader | narrower | example | attribute | instance-of | similar-to | part-of | has-part | ... }</code>\". Probably I am thinking of something like qualifiers or annotations, as it can be done within SNOMED per post-coordination. But how can it be done for ATC? Or for a national medication code? If such logic is implemented as an attribute of the slicing or of the value set binding, it is not visible to the receiver. <code>Coding.userSelected</code> is possibly just one specific example of such a \"qualifier\".</p>",
        "id": 202785368,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1593769349
    },
    {
        "content": "<p>and config.userSelected is not something we can really rely on. (it may not be populated, but we  can force one)</p>",
        "id": 202806737,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593784963
    },
    {
        "content": "<p>The situation being as is, I do not know if:</p>\n<ol>\n<li>\n<p>we can expect that all systems will understand from that PhPID L1 <strong>is broader than</strong> PhPID L4, or that PZN <strong>has really nothing to do with</strong> MPID...<br>\nor</p>\n</li>\n<li>\n<p>it would be good or bad to add some extension to coding element, for Medicinal Product codes and similar purposes (is this your qualifier, <span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> ?) I do not know how that would look like.</p>\n</li>\n<li>Add a \"codeType\" to the Coding datatype which will contain a code for concept type: mpid, phpid1, phpid2, pcid, gtin, pzn... (doesn't sound pretty but i throw it out there anyway)</li>\n</ol>",
        "id": 202807867,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593785702
    },
    {
        "content": "<p>at this moment we can create slices for a non-repeating element (I thought that was not kosher). <br>\nI don't know what value we add by slicing .</p>",
        "id": 202808373,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593786025
    },
    {
        "content": "<p>I think the primary added value of this is visibility of the explicitly modeled choices.  It makes it easier to see that you can use a SNOMED code, or an ATC code, for example.  Or it could include one or more of the levels of the IDMP codes, if we want to make that explicit (we did pretty much have that in IPS at one point - but, as noted, IDMP isn't really \"there\" yet, so we removed that for now).  When there are separately modeled slices the choices seem much easier to see than if instead you simply create and bind to a value set including the content from all of the possible code systems (and in IDMP the multiple \"levels\" of the codes).  One aspect to consider is that If multiple Codings (with different terminologies and/or levels of granularity) are used in an element instance, as we've described, there is a risk (and likelihood) of having a particular instance match multiple slices.  That generally has been frowned upon, if not prohibited - but I think that actually the same considerations apply when the element is repeating, so I don't think this is (or it shouldn't be) necessarily a show stopper.</p>",
        "id": 202821021,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1593794133
    },
    {
        "content": "<p>I am no sure I get why there is a likelihood of instances matching multiple slices. Lets say if you divide according to the 5 IDMP-levels, the granularity of the code will depend on the level that is expressed and all codes on that level will contain the details required by that level. An an instance will be categorized in the slice according to the level of detail. Or the instance might use a different code system like SNOMED or a national code system. How would an instance match multiple slices (unless one count that they are all more detailed descriptions of a pharmaceutical product)?</p>",
        "id": 202889323,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1593893241
    },
    {
        "content": "<p>The instance could have multiple Codings on the code.</p>",
        "id": 202894748,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593903187
    },
    {
        "content": "<p>OK, my understanding is then that it would not be possible to have an instance satisfying multiple IDMP-level based slices. Unless you populate several levels on purpose because you dont know what the receiver can read? The same level of coding could also be represented in SNOMED CT, but there are maybe not so many instances that would populate both SNOMED CT and IDMP? On the other hand I expect a need for ATC to be used as a parallelle coding scheme in Norway, as this is basis for some reporting requirements.</p>",
        "id": 202913080,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1593940500
    },
    {
        "content": "<p>It would be common to populate with multiple codings expressing different levels - not just because you might not know the recipient but because the same instance might be sent multiple places.  As a rule, you want to send the same information to everyone, not to have custom interfaces for each recipient.</p>",
        "id": 202922592,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593957185
    },
    {
        "content": "<p>So you send all code systems and all granularity levels you're capable of expressing that you expect to be needed by someone, somewhere.</p>",
        "id": 202922609,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593957233
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span>  Note that ATC code is technically not a code for the drug. It's a classification where some drugs may have 2 ATC categories, some have none</p>",
        "id": 202923196,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593958193
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  sending all the granularities as code translations? Does that play well with the definition of \"additional codes\" which reads something like \"same granularity or slightly different\".</p>",
        "id": 202923252,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593958290
    },
    {
        "content": "<p>one thing is to send RXNorm and NDC, the other thing is to send all the IDMP level stack.</p>",
        "id": 202923306,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593958340
    },
    {
        "content": "<p>(As a side note, IMO sending the IDMP identifiers is not the single viable solution for cross-border identification of products - I'm just looking at this from the FHIR definitions and the discussions we had recently)</p>",
        "id": 202923354,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593958442
    },
    {
        "content": "<p>So long as the code is a proper coding for the drug, the granularity can be very different - one code that says \"Penicillin\" and another that says \"APO Amoxicillin 100mg caplets\" and any concept between those granularities is completely fine to appear as alternate codings.  What you <em>can't</em> do is send a code that says \"blue\" and another code that says \"oral\" - because those aren't codings for the drug.</p>",
        "id": 202924312,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593960124
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/207835-IPS/topic/Slicing.20of.20Medication.2Ecode/near/202924312\">said</a>:</p>\n<blockquote>\n<p>the granularity can be very different - one code that says \"Penicillin\" and another that says \"APO Amoxicillin 100mg caplets\" </p>\n</blockquote>\n<p>that is what I understand from our discussion last week - you can send largely variant codes - my comment is that the spec says this:<br>\nEach coding (also referred to as a 'translation') is a representation of the concept as described above and may have slightly different granularity due to the differences in the definitions of the underlying codes. <br>\nThose examples are not slightly different granularities. Am I misreading the spec?</p>",
        "id": 202925293,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593961758
    },
    {
        "content": "<p>anyway, ATC is not a drug code so something should be done for that.</p>",
        "id": 202925363,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593961843
    },
    {
        "content": "<p>Regarding ATC - some here have mentioned an alternative where ATC could be represented as an attribute on Medication rather than coding.</p>",
        "id": 202926199,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1593963251
    },
    {
        "content": "<p>Is that a feasible option?</p>",
        "id": 202926219,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1593963354
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span></p>",
        "id": 202930101,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593969639
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> 's idea, but not the example as it is - \"Penicillin\" and \"APO Amoxicillin 100mg caplets\" are not different granularities, but are different drugs and therefore different concepts, so codes for both of them would <strong>not</strong> be legitimate in a single instance.  But if you change the first one from \"Penicillin\" to \"Amoxicillin\", then having both levels of granularity should be fine.</p>",
        "id": 202930707,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1593970701
    },
    {
        "content": "<p>My understanding was that Penicillin was a broad category that covered a number of similar drugs - including Amoxicillin.  A quick web-search says that Amoxicillin is a Penicillin-type drug?</p>",
        "id": 202930779,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593970869
    },
    {
        "content": "<p>I guess one of the challenges here is that Penicillin is both the name of a specific drug and of a family of drugs.  My intention had been to convey the code for the 'family' - in which case I think the example still holds.</p>",
        "id": 202930847,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593970986
    },
    {
        "content": "<p>An equivalent would be a code for \"Ace inhibitor\" down to the code for a specific manufactured formulation of a specific drug as packaged in a particular way in a specific country.</p>",
        "id": 202930856,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593971039
    },
    {
        "content": "<p>Yes, that's right.  It can be confusing. \"Penicillins\" (or maybe \"Penicillin-type drug\") is a drug class, which does include Amoxicillin, but \"Penicillin\" is a specific drug in that class which is different from Amoxicillin.</p>",
        "id": 202930906,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1593971087
    },
    {
        "content": "<p>I think that including a Coding for both the drug class and the specific drug in the same data type instance is really stretching the idea of the CodeableConcept to (and maybe beyond) the limits.  But various \"levels\" of description of a particular drug would generally be fine (in my opinion).  So you could have Codings for \"Lisinopril\" and \"Lisinopril 10 mg tablet\" and \"Zestril 10 mg tablet bottle of 100\" (or the equivalents), but if I want to also convey that they are in the drug class of \"ACE inhibitors\", I would do that separately.  That's my take.  I'm not entirely certain what Pharmacy is recommending on this, so I would be happy to hear from Melva or anyone else about that.</p>",
        "id": 202931314,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1593971836
    },
    {
        "content": "<p>I should also add that when prescribing Penicillin as a drug (not the class), it's going to be specified as \"Penicillin V\" (typically Penicillin V potassium) or \"Penicillin G\" (as sodium, potassium, benzathine or procaine), so just stating \"Penicillin\" (singular) alone probably isn't sufficient and it normally wouldn't be used.</p>",
        "id": 202931633,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1593972381
    },
    {
        "content": "<p>The exclusion of \"blue pill\", \"red pill\", \"oral medication\" etc. from the list, as proposed by <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , is based on the a-priori assumption that the concept granularity may vary only along the one axis that points from \"generic medication class\" to \"specifiied packaged medicinal product with specific ingredients in specific strenghts\". What determines the direction and range of that axis in CodeableConcept or Coding? The indicated slicing options, maybe?</p>",
        "id": 202934940,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1593977766
    },
    {
        "content": "<p>The range and axis of the concept is driven by the attribute - and also by the availability of other attributes to capture other characteristics like form &amp; route.</p>",
        "id": 202938774,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593984008
    },
    {
        "content": "<p>Sorry to come in to this late.  I was trying to understand the use case for including multiple levels of code in a single instance of medication.  As far as including ATC in a different attribute, there isn't another attribute in medication, but there is in medicationKnowledge.  Medication is used for prescribing, dispensing, administering, etc but MedicationKnowledge is intended to be used for formularies, drug knowledge bases.  You can use the MedicationKnowledge.medicineClassification attribute.</p>",
        "id": 203038326,
        "sender_full_name": "Melva Peters",
        "timestamp": 1594068110
    },
    {
        "content": "<p>Since medicationKnowledge has the attribute Classification, I would use that</p>",
        "id": 203039196,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594068632
    },
    {
        "content": "<p>this could even work for cross-border prescription: an extension containing a link from Medication to MedicationKnowledge.<br>\nMeaning \"this is the medication, and in that box over there you will find a few more attributes of the medication\"</p>",
        "id": 203039273,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594068689
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> - the discussion In Norway was related to whether ATC is a good fit for coding in Medication for use-cases like prescribing, dispensing that we are about to implement (like IPS), or if it would better be defined as an attribute (like form). To what extent do you support the argument that ATC could better be defined as an attribute in Medication? What would be the reason this is handled differently in Medication and MedicationKnowledge?</p>",
        "id": 203079737,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594111795
    },
    {
        "content": "<p>ATC is a classification, it is not a product code</p>",
        "id": 203088552,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594119319
    },
    {
        "content": "<p>Yep, and the question is then, maybe somewhat philosophical - should classification in the Medication resourcce be coded in the same manner as product code (as it is done now), or would it be as good to put it in a separate attribute  (ex called classification) in the same way as is done for  MedicationKnowledge.  Any thoughts?</p>",
        "id": 203091305,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594121746
    },
    {
        "content": "<p>I do not see a reason why they should be in the same attribute.</p>",
        "id": 203092893,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594122968
    },
    {
        "content": "<p>I see reasons for them to be in different attributes : </p>\n<ol>\n<li>they mean different things</li>\n<li>the existence or absence of one does not allow conclusions about the other</li>\n</ol>",
        "id": 203093725,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594123625
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> I don't believe that ATC is a good fit for coding for medication for prescribing and dispensing.  My understanding is that ATC is a classification system.  According to the WHO website \"The purpose of the ATC/DDD system is to serve as a tool for drug utilization monitoring and research in order to improve quality of drug use.\"   There are 5 levels to the ATC hieararchy and the most granular level is \"metformin\" or \"amoxicillin\".  While this might be suitable for prescribing in some cases, it definitely isn't appropriate for dispensing.  Since this is a classification system, that's why I support it being an attribute in medication - it would need to be an extension as the medication resource has been stripped down to include only those attributes that we believed are necessary for prescribing, dispensing, administering medications.  The classification of the drug isn't one of those attributes.  It was included in MedicationKnowledge as it is information about a drug.  You can use the medication code to look up the medicationKnowledge to get the classification.</p>",
        "id": 203105558,
        "sender_full_name": "Melva Peters",
        "timestamp": 1594130210
    },
    {
        "content": "<p>Thank you Melva, would you consider that to be important enough to be considered as a possible change request for the IPS Medication Profile - where it is sliced under Medication.code?  I guess IPS can be an inspiration for many other Medication-profiles.</p>",
        "id": 203106401,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594130630
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> That means you support a change in the IPS-specification?</p>",
        "id": 203108028,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594131436
    },
    {
        "content": "<p>The degree of coding of a Medication isn't binary where you've got classifications and product codes.  Rather, it's a continuum from high level classifications down to very fine-grained codes.  It might be possible to get agreement on dividing those potential codes at the extremes, but it would be rather hard to do as you get into the middle.  It's not clear why there's a problem simply sending alternate codings.  If we split it in two, then people will argue that they need a high-level classification and a low-level classification or a general product code and a detail product code - essentially wanting a separate attribute for each level of categorization or coding they care about - and there's no way we're going there.</p>",
        "id": 203108528,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594131680
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/207835-IPS/topic/Slicing.20of.20Medication.2Ecode/near/203108528\">said</a>:</p>\n<blockquote>\n<p>The degree of coding of a Medication isn't binary where you've got classifications and product codes.  Rather, it's a continuum from high level classifications down to very fine-grained codes. </p>\n</blockquote>\n<p>Right, and I don't think that the fact that levels are different is the main driver for separating. The main driver I'd consider is what has happened in recent projects - I think EPSOS, openMedicine (UNICOM is just starting) - that people will use that continuum to imply equivalence, or use only that for interoperability. Given that history (and the fact that people ATC and later we found out that ATC was not adequate as a drug identifier), I do support that classification (ATC, schedule etc) is not in the same place as product code(s) - at least for prescription and dispense. Product code uniquely identifies a concept, independently of how broad that concept is. ATC doesn't serve that purpose.</p>",
        "id": 203109496,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594132116
    },
    {
        "content": "<p>for Patient Summary, the need is less evident but with the information I have now, I still support that difference - and I think my argument is what you wrote <span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> : \"IPS can be an inspiration...\" as we've seen in EPSOS and then we realize we have to spend a few more euros to revise that.</p>",
        "id": 203109715,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594132206
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192654\">Øyvind Aassve</span> <a href=\"#narrow/stream/207835-IPS/topic/Slicing.20of.20Medication.2Ecode/near/203108028\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> That means you support a change in the IPS-specification?</p>\n</blockquote>\n<p>Yes. For medication prescriptions and dispense I would support something else - adding a link from a Medication to a MedicationKnowledge.</p>",
        "id": 203109893,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594132292
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/207835-IPS/topic/Slicing.20of.20Medication.2Ecode/near/203108528\">said</a>:</p>\n<blockquote>\n<p>essentially wanting a separate attribute for each level of categorization or coding they care about - and there's no way we're going there.</p>\n</blockquote>\n<p>Happily agree that that we should NOT try to do that - that is a very common temptation though.</p>",
        "id": 203110036,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594132343
    },
    {
        "content": "<p>If people presume multiple codings are equivalent, they're in trouble all over FHIR.  In general, very few codes are <em>ever</em> equivalent.  They may be close, but identical meaning is uncommon.  I don't consider that a good reason to split out multiple attributes</p>",
        "id": 203114448,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594134349
    },
    {
        "content": "<p>I agree that it is fully ok with multiple codings - given that the codings actually are adequate for identifying the relevant concept (here Medication) in a useful manner. I think this is the main question here - whether ATC at all is useful as an identifier for Medication, and should be considered a code-element? Any input <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span></p>",
        "id": 203115975,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594134972
    },
    {
        "content": "<p>\"Useful\" is dependent on use-case.  Generally when it comes to medications you want a reasonably fine level of detail, but some use-cases just want high-level categorizations.  E.g. \"Is the patient on an ace inhibitor? (Y/N)\".  Because the objective with FHIR interfaces is to spit out the data that any consuming system might want, good practice is to share whatever codings you know at whatever level of granularity they exist.  Consuming clients will pay attention to those they find useful.</p>",
        "id": 203116560,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594135192
    },
    {
        "content": "<p>OK <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , do I understand you correctly as in theory we can have some use-cases where ATC might be useful as concept identifier, in other use-cases not. The next question then is if the profiles should reflect this, they should place ATC  accordingly - in either an extension or as a coded element - depending on the use-case? If so - in the context of this stream another follow-up question could be what would be the right approach for IPS?  Or would it be better to desribe this in the same way in all FHIR-profiles, so that ATC is always put in code - even if in the applicable use-case it would have been better to put it as an extension - in order to drive more large-scale consistency across Medication-profiles.</p>",
        "id": 203119180,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594136229
    },
    {
        "content": "<p>Using an extension is not appropriate if there's an appropriate place to send the code in FHIR - and there is.  I can't think of any reason why it would ever be 'better' to have ATC in an extension...</p>\n<p>Profiles only need to talk about ATC if there's a specific need to discuss it - a need to indicate where to send it or where to find it.</p>",
        "id": 203121664,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594137368
    },
    {
        "content": "<p>In following and thinking though this later part of the discussion, I think we should go back to how the element itself is defined.  In this case, Medication.code is defined as \"A code (or set of codes) that specify this medication ...\".  So, if the ATC code is being used in the system to specify (i.e. select, identify, etc.) the medication (for prescribing, dispensing, etc. ), then it should be appropriate to include as one of the Codings, as Lloyd has said.  If it's being used in another way, then possibly it shouldn't be included there (would want to see actually how it's being used in that case).</p>",
        "id": 203122886,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1594137925
    },
    {
        "content": "<p>An ATC code does not specify a medication IMO, especially for dispensing or prescribing.</p>",
        "id": 203127762,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594139948
    },
    {
        "content": "<p>in a PS, it specifies the group of medications - so that may or not work depending on how the requirements for the IPS.</p>",
        "id": 203127853,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594139998
    },
    {
        "content": "<p>May or may not.  It seems that it works for a subset of drugs and a subset of ATC: \"Of the 11,422 single-ingredient clinical drugs from the prescribable subset of RxNorm, 7748 (68%) had an ingredient mapping to ATC, and 7260 (64%) had both an ingredient and an administration route mapping. In other words, a mapping between a clinical drug in RxNorm and a drug in ATC (at the 5th level) for a particular administration route was found for 64% of the clinical drugs in RxNorm.\" <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4419961/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4419961/</a></p>",
        "id": 203129175,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1594140656
    },
    {
        "content": "<p>From an outsiders perspective on IPS - I am thinking patient summary is possibly not the most problematic use-case with regards to the use of ATC. It is a summary of historic medications given a patient, and I dont see a big problem if an ATC-code tags along. It gives the clinican an idea of the medication the patient has used. However, in Norway, IPS is now being used as a template for Medication-profiles that are more directly targeted towards prescrption and dispensing, and for those use-cases ATC is not ideal for identifying medications.</p>",
        "id": 203141462,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594146809
    },
    {
        "content": "<p>Sure - and they'd be free to require an additional code be sent.  But that doesn't mean that moving ATC into an extension would make sense.</p>",
        "id": 203141629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594146895
    },
    {
        "content": "<p>I guess it probably would be good to say that the reason that there currently is an explicit slice for atcClass on Medication.code in the IPS Medication profile is that it has been felt that there <strong>are</strong> ATC codes available at a sufficient level of granularity to be useful to represent the medications that a patient is taking (i.e. prescribed/dispensed), in the context of a patient summary.  That is consistent with the statistics that Christof provided on the ability of ATC to represent the \"clinical drug\".  Another factor for explicitly including it in IPS is that ATC happens to be one of the few reasonably comprehensive medication terminologies that is currently available and is (at least potentially) usable globally.</p>",
        "id": 203143886,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1594147953
    },
    {
        "content": "<p>And you can get a sample of the codes that are available for this in ATC in the value set <a href=\"https://build.fhir.org/ig/HL7/fhir-ips/ValueSet-whoatc-uv-ips.html\">here</a>.</p>",
        "id": 203144176,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1594148066
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192654\">Øyvind Aassve</span> <a href=\"#narrow/stream/207835-IPS/topic/Slicing.20of.20Medication.2Ecode/near/203141462\">said</a>:</p>\n<blockquote>\n<p>I am thinking patient summary is possibly not the most problematic use-case with regards to the use of ATC.</p>\n</blockquote>\n<p>Yes!</p>",
        "id": 203147471,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594149443
    },
    {
        "content": "<blockquote>\n<p>and for those use-cases ATC is not ideal for identifying medications.</p>\n</blockquote>\n<p>indeed, because it was not meant to identify medications</p>",
        "id": 203147579,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594149494
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191405\">Rob Hausam</span> <a href=\"#narrow/stream/207835-IPS/topic/Slicing.20of.20Medication.2Ecode/near/203143886\">said</a>:</p>\n<blockquote>\n<p>t it has been felt that there <strong>are</strong> ATC codes available at a sufficient level of granularity to be useful to represent the medications that a patient is taking (i.e. prescribed/dispensed), in the context of a patient summary.  That is consistent with the statistics that Christof provided on the ability of ATC to represent the \"clinical drug\".  Another factor for explicitly including it in IPS is that ATC happens to be one of the few reasonably comprehensive medication terminologies that is currently available and is (at least potentially) usable globally.</p>\n</blockquote>\n<p>I'd think, based on what I saw in previous projects: ATC was used because there was nothing else before IDMP. Depending on the use cases, adding ATC cn be useful of absolutely useless. So we just provided whatever information we had, hoping it would be useful (that is what I understand from the use of ATC which AFAIK was designed for monitoring purposes, not for clinical purposes).</p>",
        "id": 203148107,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594149792
    },
    {
        "content": "<p>Not sure this is agreeable: <br>\nATC does not intend to have granularity to identify medications - it does identify the part of the body that is targeted and the therapeutic mechanism. that is it - it is just additional information. The fact that it is coded information does not mean it is a product code.</p>",
        "id": 203148457,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594149947
    },
    {
        "content": "<p>Here are a couple of sentences from <a href=\"https://www.whocc.no/atc_ddd_methodology/purpose_of_the_atc_ddd_system/\">Purpose of the ATC/DDD system</a>:</p>\n<blockquote>\n<p>The purpose of the ATC/DDD system is to serve as a tool for drug utilization monitoring and research in order to improve quality of drug use.</p>\n<p>It is essential that a tool for drug utilization monitoring and research is able to cover most medicines available on the market.</p>\n</blockquote>\n<p>So <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> you are quite correct that ATC was designed for monitoring and research, but I guess I would say that does not entirely mean that it \"was not meant to identify medications\" - as to be able to monitor their usage it must be able to identify them (at some level).  And, I do agree, that in large part in IPS (and elsewhere) you are exactly right that ATC was used \"because there was nothing else before IDMP\" - and I might add that there still isn't, because IDMP isn't actually \"real\" yet.  And the other potential alternative of using SNOMED CT is not feasible globally (at least not yet) due to the licensing issues, as the number of drugs needed to sufficiently represent clinical practice is far too large for the full set or any reasonable subset to ever be included in the GPS.</p>",
        "id": 203149581,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1594150471
    },
    {
        "content": "<p>it identifies what drugs do, not the drugs themselves.</p>",
        "id": 203150797,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594151127
    },
    {
        "content": "<p>I don't think that's quite complete or correct, but we can disagree. :)</p>",
        "id": 203196527,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1594152514
    },
    {
        "content": "<p>I don't mind this minor disagreement (and it's my spider sense that is causing me to amplify this), but for correction if appropriate: <br>\nI'm not a pharmacist but I learned that ATC classifies where the drugs work in the body and the mechanism of action. <br>\nThere are drugs without ATC classification, drugs with several ATC classifications, or drugs whose ATC classifications change (<a href=\"https://www.whocc.no/atc/application_for_atc_alterations/\">https://www.whocc.no/atc/application_for_atc_alterations/</a>)</p>",
        "id": 203197737,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594153174
    },
    {
        "content": "<p>and for summaries, I think I'm just splitting hairs. The concern I have is what Oyvind and myself pointed at: it may encourage people to prescribe by ATC. or to put the ATC code in the box barcode, instead of the GTIN.</p>",
        "id": 203198069,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594153334
    },
    {
        "content": "<p>I think you have to be careful about the multiple codings so that they imply the same thing.  I don't think you want a set of codes included where one code is Penicillin (using ATC) and one code is Amoxicillin 250mg (using SNOMED-CT) and one code is Amoxil 250mg capsule by GlaxoSmithKline - while they are related, they clearly are not the same.    I'm with <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> on this one - I don't think ATC is a good fit for identification of medication for the purposes of prescribing and dispensing - that isn't the intent  of it from what I understand.  Its the same argument about why ICD isn't a good fit for diagnosis - it is a classification system.  If you need to include the classification, it should be in a different attribute - so in Medication it would be an extension or you use the medication.code to look up the MedicationKnowledge.</p>",
        "id": 203201181,
        "sender_full_name": "Melva Peters",
        "timestamp": 1594155078
    },
    {
        "content": "<p>They don't have to be the same.  They just have to be appropriate codings of the medication in their respective code system.  It's no different than allowing ICD9, ICD10 and SNOMED codes for diagnoses in the same element.  The granularity might be quite different, but they are all coding \"what is the condition\" within their respective code systems.  There is <em>zero</em> expectation that multiple codings within a CodeableConcept will reflect the same granularity.</p>",
        "id": 203202126,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594155540
    },
    {
        "content": "<p>Agree that same granularity is not an expectation. But the specification does say \"slightly different\" - which is not the case. For the rest I agree with Melva not only because of the \"code vs classification\", but because of the impact on other things like prescription.</p>",
        "id": 203203325,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594156155
    },
    {
        "content": "<p>If I prescribe a med, I see no issue sending a code identifying a specific drug and also saying it's an ace inhibitor in the same element.  What's the issue with that?</p>",
        "id": 203203761,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594156386
    },
    {
        "content": "<p>One thing that this discussion is making me think we really should consider is, let's say using MedicationRequest.medication did I order an \"ACE inhibitor\" or a \"Lisinopril 10 mg tablet\" (for example)?  I guess you could try to infer that based on assuming that the most granular (detailed) code is what was actually ordered, but that doesn't seem very satisfying or necessarily reliable or even possible.  You could also look for userSelected on one of the Codings, but that might not be populated at all (I'm not getting the sense that it's been very popular so far), or if it is populated it might not be reliable (if it's populated on the wrong Coding or more than one Coding then it would be of no actual value).</p>",
        "id": 203211196,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1594160893
    },
    {
        "content": "<p>What the user actually saw would generally be conveyed by the text.</p>",
        "id": 203211563,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594161203
    },
    {
        "content": "<p>Yes, I anticipated that - but I'm not sure that I would trust it (including in a court of law).  The consequence of that that seems to me to be that if the <strong>optional</strong> CodeableConcept.text is <strong>not</strong> populated, then we can't reliably know the intended meaning of the coded data (at least in some instances)?  Whatever your thought on that is, I don't think that we can afford to go there.</p>",
        "id": 203211957,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1594161583
    },
    {
        "content": "<p>That's an issue with translations of any sort.</p>",
        "id": 203212701,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594162094
    },
    {
        "content": "<p>You're not necessarily going to know what the user selected if it's not marked and there's no text - and the translations won't mean exactly the same thing.</p>",
        "id": 203212717,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594162127
    },
    {
        "content": "<p>E.g. SNOMED vs. ICD10</p>",
        "id": 203212727,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594162136
    },
    {
        "content": "<p>And putting them into different attributes isn't going to tell you which was inferred from which.</p>",
        "id": 203212766,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594162171
    },
    {
        "content": "<p>Right.  I think that illustrates, though, that we need to consider how far is reasonable to go with the notion of \"translation\".  As <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> already quoted, the CodeableConcept spec says (emphasis mine) \"Each coding (also referred to as a 'translation') is a representation of the concept as described above and may have <strong>slightly</strong> different granularity due to the differences in the definitions of the underlying codes\".  \"Slightly\" may actually be stating it somewhat too narrowly, but I don't think we should go so far as to interpret that to mean \"any degree of\".  Each individual Coding should be a reasonably faithful representation of the intended meaning of the concept, as expressed in its particular terminology (normally choosing the most specific matching code available).  So if I'm prescribing Lisinopril 10 mg tablet and I am going to include an ATC code in addition to whatever other code(s) I may have, then I think the expected choice would be 'C09AA03' for \"lisinopril\", rather than 'C09AA' for \"ACE inhibitors, plain\" (or anything at a higher level than that).</p>",
        "id": 203226137,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1594177162
    },
    {
        "content": "<p>I'm looking at another project and I'm forming the opinion that it's dangerous to rely on a medication code (whatever level) and especially a classification. This creates some noise (at least I consider it noise) like \"what is the right balance\" or \"what is the use case we are covering\".</p>",
        "id": 203554734,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594413091
    },
    {
        "content": "<p>Practical impact (will probably need to document rationale): I think we should have an extension or even core link from Medication to MedicationKnowledge</p>",
        "id": 203554839,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594413149
    },
    {
        "content": "<p>we should be able to say \"I dispensed GTIN 01232323\" which is MedicationKnowledge1, which is a package for MedicationKnowledge2</p>",
        "id": 203554885,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594413197
    },
    {
        "content": "<p>I'd be opposed to such a reference as anything other than an extension because I'm quite confident that nowhere near 80% of existing systems would have a capability like that.  Most systems just have a code or a set of codes and send whatever they've got.</p>",
        "id": 203559127,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594416066
    },
    {
        "content": "<p>This is for cross-border prescription so I don't think it is expected to be in 80% of the systems, nor 80% of the cases.</p>",
        "id": 203560400,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594417054
    },
    {
        "content": "<p>but the same concept is already in our prescription systems:  We send some product code and we send adjuvant information.</p>",
        "id": 203560489,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594417101
    },
    {
        "content": "<p>IHE templates have this, which if i'm not mistaken means EPSOS has this.</p>",
        "id": 203560531,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594417133
    },
    {
        "content": "<p>and we are talking about international - meaning that the code in which the prescription was issued is mostly useless when you cross the border.</p>",
        "id": 203560613,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594417199
    },
    {
        "content": "<p>so - IMO the concept of sending a code AND some additional key information would actually a good candidate for core, because it is used. But our resources don't have it, I have no idea if implementers need that, and in any case, we will never finish the debate for \"which additional information to send along\".</p>",
        "id": 203560890,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594417363
    },
    {
        "content": "<p>so an extension would be the thing for International profiles. I don't think most implementations would do that.</p>",
        "id": 203560969,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594417413
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> - just curious on your take on \"international\". To what extent is your opinion that in IPS FHIR IG will be limited to international use? And to the use case of \"patient summary\"?</p>",
        "id": 203588965,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594459816
    },
    {
        "content": "<p>perhaps I am out of context and projecting the unicom discussions, but answering your questions:<br>\nI believe the expectation is for the International Patient Summary to be used inside a country and across borders.<br>\nAlso IMO, the patient summary would be used in many use cases - but it still represents a summary view. It does not capture all the details of  a patient's medication record</p>",
        "id": 203589171,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594460299
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span></p>",
        "id": 203589173,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594460304
    },
    {
        "content": "<p>OK, good, as we also discussed earlier - to me there seems to be a need to make profiles domain specific . What is appropriate in a summary might not be appropirate for other use cases that might require more detail. This is what we are doing in Norway differing between base profiles - national profiling that applies to all use of a resource on national level - and domain profiles - national profiling that applies to a certain context - ex summary, prescription, exchange between EHR and charting systems etc. But it is interesting to ponder the cross-dependencis - what effects, if any, will a choice done for a summary use-case influence a lets say prescripton use-case.</p>",
        "id": 203589412,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594460802
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192654\">Øyvind Aassve</span> <a href=\"#narrow/stream/207835-IPS/topic/Slicing.20of.20Medication.2Ecode/near/203589412\">said</a>:</p>\n<blockquote>\n<p>What is appropriate in a summary might not be appropirate for other use cases that might require more detail.</p>\n</blockquote>\n<p>My starting point on this is: By default, nothing about the medication in a summary is  appropriate for other uses. because summary removes details by design. <br>\nIn other words, inappropriate until proven OK.  Which is why I'm not surprised if summary stays with ATC - having ATC can alert the physician that there is something.</p>",
        "id": 203589969,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594462053
    },
    {
        "content": "<p>(I'm not downplaying the summary, I'm alerting for reuse)</p>",
        "id": 203590021,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594462104
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> . I agree. In some other areas it might be easier to resuse summary-IGs, Medication is not the best case.</p>",
        "id": 203590431,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594463031
    },
    {
        "content": "<p>Maybe this was covered to some degree earlier in the topic, but regarding \"re-use\" of patient summary data, what types and cases for re-use are being considered (likely other than medication)?</p>",
        "id": 203603622,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1594484995
    },
    {
        "content": "<p>If I understand correctly, the statements are about the reuse of specifications, not data.</p>",
        "id": 203608686,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1594493429
    },
    {
        "content": "<p>Yes, that's a good point.  They're of course related, and I think the question is also relevant in the context of the specifications.</p>",
        "id": 203609016,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1594494000
    },
    {
        "content": "<p>I'm finding other questions about using ATC and similar high-level enough concepts:</p>\n<ul>\n<li>At some point, too high-level concepts don't serve much of a purpose any more - For example if there is an ATC code J07BX02 for Covid-19 vaccine, that only says \"this person took something against covid\" - you really cannot follow whether it was RNA, or virus vaccine. </li>\n<li>Conversely, to me there's a difference between saying \"this person did not take any vaccine for covid\" and \"this person did not take this RNA vaccine for covid\" - and expressing those as code translations is not giving me that distinction.</li>\n</ul>",
        "id": 204345075,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595158060
    },
    {
        "content": "<p>High level codes are useful for some things and not for others.  We allow them to be sent with the detail codes because of the things they <em>are</em> useful for - such as searches on systems that don't support subsumption (which is quite a lot of systems...)</p>",
        "id": 204352519,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595168108
    },
    {
        "content": "<p>That is valid (at least for hierarchies, which ATC kind of is), and it's useful. I'm using that. <br>\nBut I think we need a way to differentiate \"what was meant\" (and similar codings e.g ICD-9 to ICD-10) and all the other \"groups/classifications\".<br>\nI have these questions while doing vaccines work and trying to rely on coding translations.</p>",
        "id": 204355672,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595172040
    },
    {
        "content": "<p>I guess this is not an issue for IPS (anyway, I expect this will get more interesting /real with IDMP and unicom).</p>",
        "id": 204355727,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595172127
    },
    {
        "content": "<p>\"What was meant\" is what's in the text.  It's also coded in a variety of ways.  If all you've got is an ATC and no text, then that's what you've got.  It may or may not be useful.  If you need a particular granularity of coding for your use-case, you're free to mandate that in your IG.</p>",
        "id": 204358995,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595176577
    },
    {
        "content": "<p>All of this is for particular ImplementationGuides (namely IPS and other places where we need to identify medication). This discussion is for debating a consistent way to do this (that is my purpose).</p>",
        "id": 204363008,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595181616
    },
    {
        "content": "<p>I think we can require userSelected for identifying what was meant. I don't see how text would fit that purpose across borders.</p>",
        "id": 204363053,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595181658
    },
    {
        "content": "<p>I will develop my use cases for vaccines and cross-border use.<br>\nAnd we will use ATC. The gap is not on ATC, is whether to use it to identify a medication to continue a treatment- apparently doesn't suffice.</p>",
        "id": 204363374,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595181961
    },
    {
        "content": "<p>Back to the other slice for Medication.code - SNOMED CT. Does the specification (or planned use in Europe) include that SNOMED CT is thought used for covering identifiying medication brands and packages (not onlye generic drugs)? The concern is that this is is a huge set of instances, and many of these will be specific for each nation. What is the expected time frame for IDMP support for identifiers at this level?</p>",
        "id": 205769412,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1596442496
    },
    {
        "content": "<p>Normally the MPIDs (identifiers for standardized product concepts at brand name level) are expected to be assigned by each country. I'm not sure it's the goal from SNOMED to catch up on all those and produce a master value set.</p>",
        "id": 205778076,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596449369
    },
    {
        "content": "<p>I did ask a confirmation, will ping when I have some feedback</p>",
        "id": 205778166,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596449409
    },
    {
        "content": "<p>Update: I think this will be handled by national SCT extensions</p>",
        "id": 205779759,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596450768
    },
    {
        "content": "<p>I agree this could be handled with national SCT extensions, but this requires a huge maintenance job (as there will be very many products and packages in each country). My other question was when it is expected that IDMP will these kind of identifiers. If there will be a different set of MPIDS for IDMP they would have to be mapped to SNOMED CT and these maps needs to be continuously maintained. My understanding is aslo that the SPOR database also will contain all products on national level, so that this new IDMP identifier will be much more efficient than using SNOMED CT ....</p>",
        "id": 205783675,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1596454292
    },
    {
        "content": "<p>My understanding is, that SNOMED is partner in the UNICOM project and involved directly in two WPs.</p>",
        "id": 205787440,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1596457592
    },
    {
        "content": "<p>My understanding is also that SNOMED is involved, but I'm not particularly clear at the moment about the nature and extent of their current and anticipated involvement.  It would be good to have a clearer picture of that.   I can try to do some inquiry on the SNOMED side, but anything about it that anyone is able to pass along would be good to have.</p>",
        "id": 205788152,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1596458066
    },
    {
        "content": "<p>UNICOM is a valueable reference. The question might be what is the best strategy with regards to taking decisions at the current time - as the UNICOM project still as I understand it is in its early infancy. If it is very likely that IDMP identifiers will be used for MPIDs - it might be not the best investment to convert all you products and packages to SNOMED CT.</p>",
        "id": 205788236,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1596458144
    },
    {
        "content": "<p>.. as a temporary measure</p>",
        "id": 205788325,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1596458193
    },
    {
        "content": "<p>The update I gave was from UNICOM. (actually <span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span>). <br>\nI haven't read the documentation yet, but if SCT supports the same concepts as MPIDs and PCIDs, then wither SCT adopts those codes (hardly) or indeed a mapping would be necessary.</p>",
        "id": 205789391,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596458936
    },
    {
        "content": "<p>Hence my first reaction - i expect these codes to be mastered at country level, and I do not see a reason why SCT would map them to a common set of codes - would be easier for some agency to just maintain the set of codes for the countries, insteading of adding one more code set.</p>",
        "id": 205789514,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596459028
    },
    {
        "content": "<p>Wow - what a lot of text to describe the age old problem of blending together the terminology model and the information model,  particularly where one is basic and the other is detailed.  Everything is solvable, but probably not on a Zulip chat, despite the constant desire for that to be the case.  I can explain both IDMP and SNOMED options, plus how they work together.....if anyone wants the detail, please reach out directly</p>",
        "id": 205790209,
        "sender_full_name": "Julie James",
        "timestamp": 1596459539
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span> - I guess my main curiousity for now is a ballpark perspektiver on when a set of IDMP MPIDs could be expected to be ready. And is the hash algorithm approach to produce them still the planned way to go?</p>",
        "id": 205797204,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1596463270
    },
    {
        "content": "<p>The hash algorithm has been considered for PhPID, not MPIDs, AFAIK</p>",
        "id": 205798952,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596464229
    },
    {
        "content": "<p>In order to have all constituents of potential future MPID already in place, we added information on the Market Authorization Holder (including an ID) to CDA ManufacturedProduct in eHDSI Patient Summary and ePrescriptions: <a href=\"https://ec.europa.eu/cefdigital/wiki/display/EHOPERATIONS/CP-eHealthDSI-019%3A+Include+Marketing+Authorization+Holder+%28MAH%29+in+the+description+of+the+Medicinal+Product\">https://ec.europa.eu/cefdigital/wiki/display/EHOPERATIONS/CP-eHealthDSI-019%3A+Include+Marketing+Authorization+Holder+%28MAH%29+in+the+description+of+the+Medicinal+Product</a> (without the full machinery of the CPM, of course)</p>",
        "id": 205807951,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1596468428
    },
    {
        "content": "<p>I think the ATC can play a useful role in identifying what something IS (it's chemistry) so that drug-to-drug interactions can be detected. What a medicine's GTIN is indicates manufacturer's product right down to the packaging level (different pack size of identical drug... different GTIN). Different manufacturer's make functionally equivalent products with different trade names... but made out of the same active ingredients. These would have the same ATC codes, as I understand it. For this reason, I think the ATC code adds a useful bit of value to the medicationStatement in the IPS.</p>",
        "id": 210313064,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1600286542
    },
    {
        "content": "<p>All classifications do add value. I think ATC should not be mistaken with a product code for different GTINs. ATC is much coarser than that. Fortunately we (will (eventually)) have IDMP to bring additional codes.</p>",
        "id": 210321024,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600290648
    },
    {
        "content": "<p>Is there a more recent thread on this topic?</p>\n<p>This thread addresses questions about 1) slicing an element with a cardinality of 1 (as I see it, creating a \"choice\" structure) and  2) how widely the granularity of codes can vary in a CodeableConcept. I'm interested in #2.</p>\n<p>I don't think I see a clear consensus on that question. Conceptually, it seems that ATC and NDC could both be used, the NDC to identify the medication in the workflow and the ATC for reference or classification. I also think the concern about using such a broad code in, e.g., an order or dispense, is significant. Is it reasonable to think we can assert rules about using the most specific code, not the first code you can resolve, or about context of use (allow ATC on historical query results including orders, not on order placement)?</p>\n<p>I have a case for a historical query where the classification would be useful, and where the instantiation of MedicationKnowledge seems heavy. <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span></p>",
        "id": 268697719,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1642688109
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> I don't know if there is a more recent thread (i'm not recalling one).  I think I would say a couple of things: (1) Use the code that most precisely represents the meaning that you want to convey (within the limits of the codes that you have available - based on whatever particular constraints may apply in your situation); (2) Include all of the appropriate codes that you know.  In most medication cases, I think that both ATC and NDC would probably fit within #2.  For ordering, as long as you send a specific code that, along with the other information model attributes, accurately specifies the item that you intend to order and that your ordering system can appropriately respond to, it would be acceptable (and maybe in some cases desirable) to also include a classification code (e.g, ATC).  I don't think it needs to be exclusive in that regard.  Also, carrying that a bit farther, it might <strong>even</strong> be possible to design an ordering system using \"classification\" codes, provided that the additional required specificity for the ordered item is being properly encoded via the other information model attributes (i.e. \"post coordination\" in the information model).</p>",
        "id": 268913834,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1642805280
    }
]