[
    {
        "content": "<p>An den verschiedenen FHIR Implementierungsleitfäden wurde im 2020 weitergearbeitet und wir möchten einen konsolidierten Anhörungsprozess starten, um für die folgenden Implementierungsleitfäden neue Versionen im 2021 zu publizieren :</p>\n<ol>\n<li>Zweiter STU Ballot HL7 für FHIR CH-Core (HL7 Benutzergruppe Schweiz)</li>\n<li>Informativer Ballot CH-EMED (eHealth Suisse)</li>\n<li>Informativer Ballot CH-VACD (eHealth Suisse)</li>\n</ol>\n<p>Das Abstimmungsverfahren wird am 15.2.2021 starten, die Materialien werden dann für die Anhörung online bereitgestellt.  </p>\n<p>Der aktuelle Zwischenstand vor der Publikation ist einsehbar unter </p>\n<p><a href=\"http://build.fhir.org/ig/hl7ch/ch-core/index.html\">http://build.fhir.org/ig/hl7ch/ch-core/index.html</a> <br>\n<a href=\"http://build.fhir.org/ig/hl7ch/ch-emed/index.html\">http://build.fhir.org/ig/hl7ch/ch-emed/index.html</a><br>\n<a href=\"http://build.fhir.org/ig/ehealthsuisse/ch-vacd/index.html\">http://build.fhir.org/ig/ehealthsuisse/ch-vacd/index.html</a></p>\n<p>Das Abstimmungsverfahren endet am Montag, 15.03.2021. Die Zwischenresultate werden am<br>\n22.03.2021 publiziert. Anschliessend geht es an die Bereinigung von offenen Punkten und das Resultat der Anhörung wird am 29.03.2021 publiziert. Falls der Anhörungsprozess erfolgreich ist, werden die Spezifikationen per Ende April publiziert. </p>\n<p>Details 2. STU Ballot HL7 für FHIR CH-Core (HL7 Benutzergruppe Schweiz)<br>\nEs gelten die Ballotregeln publiziert unter:<br>\n<a href=\"https://www.hl7.ch/default/assets/File/Publikationen/20200130_BallotVerfahrenHL7Schweiz.pdf\">https://www.hl7.ch/default/assets/File/Publikationen/20200130_BallotVerfahrenHL7Schweiz.pdf</a>.</p>\n<p>Bitte melden Sie sich bei unserem technischen Projektleiter, Oliver Egger, damit Sie am Abstimmungsverfahren teilnehmen können (pro Mitgliederorganisation können 2 TeilnehmerInnen teilnehmen). Wir brauchen mindestens 10 TeilnehmerInnen damit das Abstimmungsverfahren überhaupt erfolgreich sein kann!</p>\n<p>Informativer Ballot CH-EMED und CH-VACD (eHealth Suisse)<br>\nDie Anhörung wird von eHealth Suisse durchgeführt. Bei den Spezifikationen handelt es sich um die FHIR-Version der bereits seit längerem bestehenden CDA-Formate von eMedikation bzw. eImpfdossier. Bitte teilen Sie Annatina Foppa von eHealth Suisse per Mail mit, ob Sie am informativen Ballot teilnehmen wollen. Eine Mitgliedschaft bei HL7 ist nicht notwendig, ebenso wenig eine Mindestanzahl an Teilnehmenden. Der informative Ballot ermöglicht die Kommentierung der vorgeschlagenen Spezifikation, um fachliches Feedback einbringen zu können.</p>",
        "id": 225089107,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1612389469
    }
]