[
    {
        "content": "<p>Bitte <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSc9oO2YgBXWpMyS-h6cY32iEiUHW36Vj9nc0Dom64wQwBdWdQ/viewform\">registriert</a> euch für den 2. Ballot der Implementierungsleitfäden bis am 31. Juli 2021!</p>\n<p>Mehrere neue Austauschformate sind in einer ersten Version veröffentlicht worden: eAllergienIntoleranzen, eLaborauftrag, eRadiologieauftrag, eÜberweisungsbericht sowie das übergeordnete CH-ORF (eAuftrag und Überweisung).</p>\n<p>Bereits weiter ausgereift sind die Formate eMedikation und eImpfdossier, die aktualisiert wurden und 2022 für die Aufnahme in die EPD-Rechtsgrundlagen vorgesehen sind.</p>\n<p>Alle Austauschformate sind am EPD-Projectathon für Tests verfügbar und werden bis Ende September angehört, sogenannt «ballotiert». Auch die mHealth-Spezifikationen für den mobilen Anschluss ans EPD wurden aktualisiert und werden angehört.</p>\n<p>Das Abstimmungsverfahren wird am 1.8.2021 starten. Das Abstimmungsverfahren endet am 24.09.2021 mit dem Ende des EPD-Projectathon. Die Zwischenresultate werden am 15.10.2021 publiziert. Anschliessend geht es an die Bereinigung von offenen Punkten und das Resultat der Anhörung wird am 30.11.2021 publiziert. Falls der Anhörungsprozess erfolgreich ist, werden die Spezifikationen per Ende Jahr publiziert.</p>\n<p>Bitte meldet euch mit dem <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSc9oO2YgBXWpMyS-h6cY32iEiUHW36Vj9nc0Dom64wQwBdWdQ/viewform\">Formular</a>  an, um am Abstimmungsverfahren teilnehmen zu können. Es braucht mindestens 10 Teilnehmer*Innen, damit das Abstimmungsverfahren überhaupt erfolgreich sein kann!</p>\n<p><a href=\"https://www.hl7.ch/default/assets/File/Technisches_Komitee/202101622_BallotVerfahrenHL7Schweiz.pdf\">Details für Teilnahme am Ballot</a>. <a href=\"https://www.hl7.ch/default/assets/File/Technisches_Komitee/20210622_BallotIntro.pdf\">Einführungs-Slides zu den jeweiligen Leitfäden</a>.</p>",
        "id": 246426609,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1626681806
    }
]