[
    {
        "content": "<p>Looking at where we landed in the bulk data project, our <code>$export</code> operation is very, very close to the (now evolved) <code>$everything</code> operation. In the <a href=\"http://build.fhir.org/patient-operation-everything.html\" target=\"_blank\" title=\"http://build.fhir.org/patient-operation-everything.html\">current spec for <code>$everything</code></a> I see the following language:</p>\n<blockquote>\n<p>In the US Realm, at a minimum, the resources returned SHALL include all the data covered by the meaningful use common data elements as defined in the US Core Implementation Guide. Other applicable implementation guides may make additional rules about how much information that is returned.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> how does the base spec make this kind of \"SHALL\" constraint about US Realm usage? Any why the tie to US Core, rather than Argonaut? Does this make sense, or is it just an oversight/mistake?</p>",
        "id": 160136144,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1551907694
    },
    {
        "content": "<p>(This bit of language makes it much harder to profile the operation; I'm trying to understand whether we really need a separate <code>$export</code> operation, and this is maybe the only argument for it that I've seen so far.)</p>",
        "id": 160136447,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1551907937
    },
    {
        "content": "<p>The core spec should have no such assertion about US-specific behavior.  Can you submit a change request to remove it?</p>",
        "id": 160149403,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551913296
    },
    {
        "content": "<p>Does everything allow for the accept types/different response formats today (eg: ndjson)?</p>",
        "id": 160150758,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1551914484
    },
    {
        "content": "<p>yes everything allows for use with bulk data. The US rule should be moved to a US specific location somewhere now</p>",
        "id": 160152076,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551915652
    },
    {
        "content": "<p>and updated accordingly to keep it in sync with community expectations and regulatory requirements</p>",
        "id": 160152093,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551915675
    },
    {
        "content": "<p>Most likely US Core...</p>",
        "id": 160158509,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551919728
    },
    {
        "content": "<p>Could that text instead of being removed be changed to indicate that local jurisdictions may define what resources are returned by this data, such as that defined in US Core for the US realm. - or similar ;)</p>",
        "id": 160259223,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1552014177
    },
    {
        "content": "<p>I'm not thrilled with any U.S. realm references in the core spec.  There's already a perception in some quarters that FHIR (and HL7) are too U.S. focused.  If we're going to reference any realm's artifacts, it should be a different country's.</p>",
        "id": 160260464,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552015768
    },
    {
        "content": "<p>it would be fine to simply say \"local jurisdictions may define a minimum set of resources are returned by this operation\"</p>",
        "id": 160264540,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552021817
    },
    {
        "content": "<p>I thought that $everything's use of FHIR <a href=\"https://www.hl7.org/fhir/compartmentdefinition-patient.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/compartmentdefinition-patient.html\">compartment</a>s was elegant. We really created $export in part to explicitly not include everything in the compartment. Why is $everything being reduced to CCDS/USCDI?</p>",
        "id": 160846556,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1552624593
    }
]