[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> for <a href=\"http://jira.hl7.org/browse/FHIR-35364\">FHIR-35364</a> listed above... the resolution refers to a HackMd doc but I don't know if that doc is frozen. In the doc I see:</p>\n<blockquote>\n<p>Although QuestionnaireResponse can be searched using the standard FHIR RESTful API search parameters, individual responses are not directly searchable in QuestionnaireResponse. In order to search directly for and individual responses, they must be “parsed” into a searchable form - i.e. to a local FHIR or non-FHIR data store such as a database or FHIR Observations.</p>\n</blockquote>\n<p>but I disagree with this. It is possible to search for QuestionnaireResponse <em>for specific questions and answers</em> in a structure way; you just happen to get back the whole instrument when you find a match.</p>",
        "id": 274442786,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646680412
    },
    {
        "content": "<p>That's an easy tweak though, just changing the descriptive language slightly.</p>",
        "id": 274442911,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646680455
    },
    {
        "content": "<p>Also on:</p>\n<blockquote>\n<p>Each QuestionnaireResponse must support:<br>\nthe questions and boolean, decimal, string, coded, and Attachment(a.k.a., binary) type answers<br>\neach question must have a identifier the pointing to question</p>\n</blockquote>\n<p>I'm not clear on what this means -- aren't the Questions part of the Questionnaire rather than the QuestionnaireResponse? Are the quoted bits just talking about <code>linkId</code>s?</p>",
        "id": 274443222,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646680596
    },
    {
        "content": "<p>Re: search params I'd turn SHOULD into SHALL For the <code>questionnaire</code> param:</p>\n<blockquote>\n<p>questionnaire SHOULD  reference   Allows retrieving QuestionnaireResponses that have been completed against a specified form</p>\n</blockquote>",
        "id": 274443319,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646680645
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/MNB2ahhbEkM1lDh_-i_N374x/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/MNB2ahhbEkM1lDh_-i_N374x/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/MNB2ahhbEkM1lDh_-i_N374x/image.png\"></a></div><p>What does this MS mean for implementations choosing \"Option 2\" (Observations)? It seems at a glance to require them to support \"Option 1\" as well (since the <code>derivedFrom</code> points to a Questionnaire, right?)</p>",
        "id": 274443609,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646680768
    },
    {
        "content": "<p>Yes, you can't point out a single question you get the whole blob.</p>",
        "id": 274450275,
        "sender_full_name": "Eric Haas",
        "timestamp": 1646683746
    },
    {
        "content": "<p>yes linkID's</p>",
        "id": 274450542,
        "sender_full_name": "Eric Haas",
        "timestamp": 1646683902
    },
    {
        "content": "<p>making think SHALL trigger certification testing so would be nice to get implementers to opine too</p>",
        "id": 274450637,
        "sender_full_name": "Eric Haas",
        "timestamp": 1646683941
    },
    {
        "content": "<p>no need to support FHIR questionnaire beyond meta elements can point to any form - so technically no.   This is a question for implementers since we talked a lot about linking all the observations to a singe survey that is one way to do this.</p>",
        "id": 274450917,
        "sender_full_name": "Eric Haas",
        "timestamp": 1646684070
    },
    {
        "content": "<p>I have serious misgivings about this approach btw,  As you have pointed out, these are pieces of the whole Q/QR workflow and making it understandable without including all the other pieces is challenging.</p>",
        "id": 274451661,
        "sender_full_name": "Eric Haas",
        "timestamp": 1646684431
    },
    {
        "content": "<p>@Josh, I invited you to edit</p>",
        "id": 274747077,
        "sender_full_name": "Eric Haas",
        "timestamp": 1646857357
    }
]