[
    {
        "content": "<p><a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=55939878\" target=\"_blank\" title=\"https://confluence.hl7.org/pages/viewpage.action?pageId=55939878\">Argo R4/US Core Connectathon</a> Track Orientation Webinar</p>\n<p>There will be a track orientation webinar on <strong>Wed August 14th at 3-4 PM Eastern</strong> to provide an overview of the Connectathon Process and specifics on the Scenarios and Goals for this track.</p>",
        "id": 172057964,
        "sender_full_name": "Eric Haas",
        "timestamp": 1564507566
    },
    {
        "content": "<p><strong>Webinar call coordinates:</strong></p>\n<p>GoToMeeting: <a href=\"https://global.gotomeeting.com/join/977233229\" target=\"_blank\" title=\"https://global.gotomeeting.com/join/977233229\">https://global.gotomeeting.com/join/977233229</a></p>\n<p>Audio: 1 866 899 4679</p>\n<p>Access Code: 977-233-229</p>",
        "id": 172057973,
        "sender_full_name": "Eric Haas",
        "timestamp": 1564507574
    },
    {
        "content": "<p>We are a FHIR “requestor” and need to be able to pull patient data into a research databases.  We have a back end server application that calls FHIR APIs and de-identifies patients for research.  We are adding in OAuth2 Client Credentials and can use either Bulk Data APIs or the “traditional” APIs but from a back-end application (not a web app).   </p>\n<p>We are wondering if anyone attending this Argo/R4 US Core track at the Connectathon would be able to provide us the ability to try out some R4 code to access R4 FHIR servers to extract data on multiple patients at a time (using search parameters) and some clinical data (also using search parameters).</p>",
        "id": 173910693,
        "sender_full_name": "Karen Fairchild",
        "timestamp": 1566499889
    },
    {
        "content": "<p>sounds like the bulk data track to me</p>",
        "id": 173914497,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1566502714
    },
    {
        "content": "<p>We discussed on yesterday's call.  there are user facing apps that may want to query across patients.  They don't have system level scope.  Right now the feedback was that they would need to query patients one by one.  We will be adding some future  based guidance on this including recognizing the bulk data approach.</p>",
        "id": 173920636,
        "sender_full_name": "Eric Haas",
        "timestamp": 1566507614
    },
    {
        "content": "<p>wouldn't provider level access do it?</p>",
        "id": 173920683,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1566507662
    },
    {
        "content": "<p>yes that is what we are talking about  but is not been implemented that way by the servers.  there is valid concern about non-performant query if provider asks for all patients observations for example.</p>",
        "id": 173920935,
        "sender_full_name": "Eric Haas",
        "timestamp": 1566507870
    },
    {
        "content": "<p>can you explain exactly what has not been implemented by the servers?</p>",
        "id": 173920957,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1566507893
    },
    {
        "content": "<p>if you have users scopes for 3 patients and you want to search for allergies for all three patients you can not do a :</p>\n<p><code>Get [base]/AllergyIntolerance</code></p>\n<p>nor </p>\n<p><code>Get [base]/AllergyIntolerance?patient=123,345,456</code></p>\n<p>but only this:</p>\n<div class=\"codehilite\"><pre><span></span>Get [base]/AllergyIntolerance?patient=123\nGet [base]/AllergyIntolerance?patient=345\nGet [base]/AllergyIntolerance?patient=456\n</pre></div>",
        "id": 173929040,
        "sender_full_name": "Eric Haas",
        "timestamp": 1566515036
    },
    {
        "content": "<p>I don't understand this for several reasons. What does it mean to \"have users scopes for 3 patients\"? 3 different scopes, or 1 scope? But I asked about provider scope</p>",
        "id": 173932639,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1566519489
    },
    {
        "content": "<p>I think the scenario is an app with scopes like <code>user/AllergyIntollerance.read</code>, where the user is a provider.</p>",
        "id": 173932915,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1566519914
    },
    {
        "content": "<p>yes that is what I am asking about</p>",
        "id": 173932966,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1566519964
    },
    {
        "content": "<p>And with these scopes, several EHRs (Cerner and Epic at least, if I understood correctly) will permit queries that provider a singles patient id, but do not support the comma separates query (or the query where <code>patient</code> is omitted).</p>",
        "id": 173932982,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1566520019
    },
    {
        "content": "<p>ok thx</p>",
        "id": 173933008,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1566520080
    },
    {
        "content": "<p>I think this is a good implementation. Make the client be specific about what it wants. It is not uncommon for API to be restricted to only one Patient, vs other API that are focused on bulk. This very much makes Privacy and Security more achievable. I do understand the theoretical-desire for the alternative, but it is not compelling relative to the problems it brings.</p>",
        "id": 173971571,
        "sender_full_name": "John Moehrke",
        "timestamp": 1566569377
    },
    {
        "content": "<p>Agreed, re: issuing 1 API call vs 3. Issuing 3 calls is no big deal, especially since you can do them in parallel. The much more important API issue, I think, is why you don't know which patients you're asking about (e.g. \"tell me all out-of-range lab results over the last 30 min\").</p>",
        "id": 174001880,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1566593197
    },
    {
        "content": "<p>Or, you are trying to get information about a group of patients that have a set of diagnoses you are studying for research.  We have a research database and when he don't have bulk data APIs available, but have the basic ones, this would be very useful.  The group of patients would not necessarily be for a single provider either.   We would be going in as a back-end service.</p>",
        "id": 174003101,
        "sender_full_name": "Karen Fairchild",
        "timestamp": 1566594342
    },
    {
        "content": "<p>Of course the standard FHIR REST API defines all this, and most \"generic FHIR servers\" (like you'd probably use for a research database) support it just fine.</p>",
        "id": 174005742,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1566596701
    },
    {
        "content": "<p>The challenge has been in operational clinical systems, is \"give me the most recent observations sorted by date, across patients\" something they can/will support in production environments. That's where the US Core / Argonaut guidance comes into play.</p>",
        "id": 174005772,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1566596738
    },
    {
        "content": "<p>I think it absolutely makes sense to support research, population, and realtime physician care use cases. I don't think anyone in the thread disagrees with that (correct?)</p>",
        "id": 174144784,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1566828656
    },
    {
        "content": "<p>However, the performance needs, use cases, etc differ vastly between those use cases. I think it also may make sense to handle those separately - eg: many systems have population management as a separate platform</p>",
        "id": 174144829,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1566828700
    },
    {
        "content": "<p>But generally these population health systems are not up to the minute for operational data like lab results. So organizations that want to get access to the most recent labs wind up using <del>proprietary</del> vendor-specific APIs or direct database calls.</p>",
        "id": 174145273,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1566828963
    },
    {
        "content": "<blockquote>\n<p>I think it absolutely makes sense to support research, population, and realtime physician care use cases. I don't think anyone in the thread disagrees with that (correct?)</p>\n</blockquote>\n<p>I am willing to somewhat agree on research and population... but not fully because I dont think that the ramifications are completely understood. Privacy and Security can't be something we ignore until it is too late...  You also brought in \"realtime physician care\" as an exception which is confusing.</p>",
        "id": 174145280,
        "sender_full_name": "John Moehrke",
        "timestamp": 1566828968
    },
    {
        "content": "<p>I don't think any of them are exceptions. They're all primary use cases needed in different scenarios</p>",
        "id": 174145926,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1566829368
    },
    {
        "content": "<p>\"realtime physician/practitioner\" is what I would categorize most of your daily care or what people use to think of as the traditional EHR</p>",
        "id": 174145969,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1566829397
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  if it's most recent for a specific patient, they should be able to get that today via API calls - though they may need to do parallel calls as you mentioned</p>",
        "id": 174146075,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1566829449
    },
    {
        "content": "<p>It's when they don't know the population, are trying to identify the population, or are looking for different research data that I think it starts to go closer to bulk access</p>",
        "id": 174146116,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1566829481
    },
    {
        "content": "<blockquote>\n<p>Jenni Syed: @Josh Mandel if it's most recent for a specific patient, they should be able to get that today via API calls - though they may need to do parallel calls as you mentioned</p>\n</blockquote>\n<p>Agreed; it's for things like \"the patients in my ED right now,\" or \"all patients with recent lab results\" where current FHIR implementations don't work.</p>",
        "id": 174147802,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1566830769
    }
]