[
    {
        "content": "<p>In the Data Query IG, <a href=\"http://www.fhir.org/guides/argonaut/r2/StructureDefinition-argo-patient-definitions.html#Patient:argoprofile.extension:birthsex\" target=\"_blank\" title=\"http://www.fhir.org/guides/argonaut/r2/StructureDefinition-argo-patient-definitions.html#Patient:argoprofile.extension:birthsex\">birth sex</a> is defined as \"The codes required are intended to present birth sex (i.e., the sex recorded on the patient’s birth certificate) and not gender identity or reassigned sex.\"    Note that this mirrors the <a href=\"https://s.details.loinc.org/LOINC/76689-9.html?sections=Comprehensive\" target=\"_blank\" title=\"https://s.details.loinc.org/LOINC/76689-9.html?sections=Comprehensive\">LOINC definition</a></p>\n<p>This definition explicitly refers to the birth certificate, which ties the birth sex to a legal sex.  Was that reference to birth certificate intentional?    We (Epic SOGI experts) view birth sex as an approximation of likely physiological structures (i.e. it is a biological summary finding, not a legal one).</p>\n<p>In the base Patient resources, we're adding some <a href=\"http://build.fhir.org/patient.html#gender\" target=\"_blank\" title=\"http://build.fhir.org/patient.html#gender\">language around sex and gender</a>.   When I initially drafted that, I based my SAAB definition on the US Core definition of birth sex.  However upon review with our SOGI experts, they wanted me to omit the reference to birth registration, and make SAAB more of a \"clinical summary finding\".  However if I do that, then the definitions in R4 Patient will differ from US Core and LOINC.  Does anyone object to that difference?</p>",
        "id": 153938692,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1519076345
    },
    {
        "content": "<p>Birth sex in US Core is driven by the ONC's definition and US regulations, so that is not changing unless the regulations change.  I think that your changes will make it more confusing for US implementers including epic.</p>",
        "id": 153938713,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519080348
    },
    {
        "content": "<p>Clinical summary findings should be Observations, not demographic data on Patient.</p>",
        "id": 153938714,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519080391
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> The problem is that ONC just says \"sex\".  I don't see anywhere in actual ONC documentation where they even reference the birth certificate definition.  170.207 (n)(1) literally just says \"sex\", and then the value set.</p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I agree, but birth-sex is already a US Core extension on Patient.  I see two options:<br>\n1. We double down on the ONC definition by including it, and a reference to US Core in the <a href=\"http://build.fhir.org/patient.html#gender\" target=\"_blank\" title=\"http://build.fhir.org/patient.html#gender\">sex and gender section in Patient</a> as is in the current build.<br>\n2. We cut ties with the US Core definition and update the R4 language in patient to just count birth sex as a type of clinical sex (which we already call out, and point to Observation.</p>",
        "id": 153938716,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1519081095
    },
    {
        "content": "<p>My understanding is that the US Core definition is demographic in nature</p>",
        "id": 153938717,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519081166
    },
    {
        "content": "<p>see <a href=\"https://www.healthit.gov/sites/default/files/2015Ed_CCG_CCDS.pdf\" target=\"_blank\" title=\"https://www.healthit.gov/sites/default/files/2015Ed_CCG_CCDS.pdf\">https://www.healthit.gov/sites/default/files/2015Ed_CCG_CCDS.pdf</a>  and <a href=\"https://www.healthit.gov/standards-advisory/draft-2017/I-R/representing-patient-sex-at-birth\" target=\"_blank\" title=\"https://www.healthit.gov/standards-advisory/draft-2017/I-R/representing-patient-sex-at-birth\">https://www.healthit.gov/standards-advisory/draft-2017/I-R/representing-patient-sex-at-birth</a></p>",
        "id": 153938729,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519082803
    },
    {
        "content": "<p>Right - neither of those sources document sex assigned at birth as the sex on the birth certificate.  </p>\n<p>As Darth Vader would say (to the ISA and CCDS):<br>\n   \"I find your lack of specificity disturbing.\"</p>",
        "id": 153938740,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1519084214
    },
    {
        "content": "<p>The final piece of the puzzle that super glued this definition into US EHRS.....<br>\n<a href=\"https://s.details.loinc.org/LOINC/76689-9.html?sections=Comprehensive\" target=\"_blank\" title=\"https://s.details.loinc.org/LOINC/76689-9.html?sections=Comprehensive\">https://s.details.loinc.org/LOINC/76689-9.html?sections=Comprehensive</a></p>",
        "id": 153938746,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519084458
    },
    {
        "content": "<p>( I could have never come up with this stuff by myself)</p>",
        "id": 153938747,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519084492
    },
    {
        "content": "<p>That definition \" The sex that was assigned and recorded on the birth certificate at the time of an individual's birth.\" seems like \"administrative sex as recorded at birth\". Which leave room for \"administrative sex as last determined by a legal process\". Which can be a different data element.</p>",
        "id": 153938761,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1519090949
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> so the LOINC code is the root of all our problems :(.  I wonder who submitted that LOINC code (was it ONC, or someone that just tried to interpret the ONC definition).</p>",
        "id": 153938954,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1519137602
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191357\">@Andrew Torres</span> I just submitted a gforge tracker for this with an updated definition for SAAB:  <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15588\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15588\">15588</a></p>",
        "id": 153938961,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1519138724
    },
    {
        "content": "<p>My proposed definition is:</p>\n<p><strong>Sex assigned at Birth</strong> - the sex assigned to a person at birth, usually based on physical properties that are visually apparent at the time of birth.  The sex assigned at birth is not a legal sex, however it often is used as the initial value on birth registrations. It can be represented as an Observation, using, for example, LOINC code 76689-9. The US realm defines a US specific extension for this property.</p>",
        "id": 153938963,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1519138766
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>  What does this mean 'The sex assigned at birth is not a legal sex...'? What is the legal sex  for a newborn?</p>\n<p>The Birth Sex observation was first created for C-CDA -- our compromise after lots of debate was to state </p>\n<p>\"This observation represents the sex of the patient at birth. It is the sex that is entered on the person's birth certificate at time of birth.<br>\nThis observation is not appropriate for recording patient gender (administrativeGender).\"</p>",
        "id": 153941462,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1519911263
    },
    {
        "content": "<p>So do you consider sex assigned at birth a clinical sex, a legal sex, or both?  I'd think we'd want to avoid \"both\" given the shifting regional approaches to what are valid legal sex values (since birth certificates are issued by the state, not the federal government).</p>",
        "id": 153941584,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1519934527
    },
    {
        "content": "<p>Good question, I am uncomfortable calling it 'clinical sex' based on comments from clinicians that at birth it's just an observation. I don't know what 'legal sex' is...</p>",
        "id": 153941596,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1519934887
    },
    {
        "content": "<p>Isn't legal sex whatever the legal system determines the sex to be? Sometimes that is better called gender. <br>\nWhat can be known reliably is<br>\n1- what those at the birth think the sex is - an observation<br>\n2- what is first recorded in administrative systems - Birth sex<br>\n3- what is the currently asserted gender -  gender</p>",
        "id": 153941665,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1519946391
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> I would consider legal sex anything that shows up on a legal document issued by the government.  So there isn't just one \"legal sex\", there are potentially a ton that can vary by realm.  And each legal sex value would need to be qualified by the legal document type.  For example, you could have a birth certificate in one state that is \"male\", and a drivers license in another state that is \"female\" and a taxpayer registration in another state that is \"X\".  And since birth certificates are state specific, there isn't a single value set for birth certificate \"sex\", but rather each state specifies what that state allows for the birth certificate.  And they are all starting to be different. :/</p>\n<p>That's why I was trying to make my proposed language separate clinical and legal.  The initial (usually visual) clinical observation is used as the basis for the \"initial\" legal sex (i.e. the one on the first government-issued legal document, the birth certificate).    While I'm not sure if it is probably that an intersex/non-deterinate sex is often recorded as the initial clinical sex assigned at birth, if it were, and the state did not allow that on the birth certificate, the SAAB and the sex on the birth certificate could differ.</p>\n<p>All that said, I'm not sure I'm all that passionate for untangling this immediately, as I think everyone is just going to have to be somewhat flexible in the sex/gender domain anyway.</p>",
        "id": 153941850,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1520028942
    }
]