[
    {
        "content": "<p>Can #FHIR28179 be pulled from the block vote please?</p>",
        "id": 213369428,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602723812
    },
    {
        "content": "<p>(<span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> )</p>",
        "id": 213374390,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602729503
    },
    {
        "content": "<p>what block vote?</p>",
        "id": 213413096,
        "sender_full_name": "John Moehrke",
        "timestamp": 1602763151
    },
    {
        "content": "<p>Ha, hasn't  posted yet, just organizing trackers. Lloyd noticed us categorizing trackers for a future block.</p>",
        "id": 213433634,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1602771991
    },
    {
        "content": "<p>The plan is to post the first US Core block vote later today, and then likely ever Thursday for the next few weeks as discussed on the Cross Group Projects WG call.</p>",
        "id": 213433833,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1602772062
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Did you pursue #FHIR28179 in base FHIR?</p>",
        "id": 213434143,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1602772193
    },
    {
        "content": "<p>The base standard is a little different.  In theory, there could be a use-case where you'd want to capture who was involved in manipulating a record (or even just when it was manipulated) and not what the actual change was.  (An uncommon need, but not outside the realm of possibility.)  US Core, on the other hand, is definitely not dealing with that use-case.  Even if you were to allow for it, the activity presumably should be at least mustSupport.</p>",
        "id": 213444554,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602776287
    },
    {
        "content": "<p>I don't agree with that sentiment. If it were to be mustSupport it would end up being constrained to 1 value. The reason the profile was created was to meet us-regulation which was to comply with a requirement that we share the \"last-hop\" of provenance which was the organization that the information came from. There is no requirement to record what type of activity was done. There is a desire to keep this somewhat simple. The profile was designed to be simple enough to avoid these types of contentious issues. I don't think activity is needed to meet the objective what was laid out in front of us. </p>\n<p>That field also doesn't match to the type of activity that EHRs currently capture (If at all). This would impose a great burden for our implementation to support.</p>",
        "id": 213446833,
        "sender_full_name": "Drew Torres",
        "timestamp": 1602777196
    },
    {
        "content": "<p>So you're saying that the Argonaut use-case is simply to capture who was involved in the last manipulation of this resource - regardless of what that manipulation was?  (creation, revision, translation, anonymization, whatever)</p>",
        "id": 213447052,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602777293
    },
    {
        "content": "<p>If that's true, it would be good if the profile description made that intended use a bit more clear.</p>",
        "id": 213447130,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602777337
    },
    {
        "content": "<p>I would not like to see the current definition of must support applied to .activity... but I do think that a more soft \"must populate if the activity is known\" is appropriate.</p>",
        "id": 213447596,
        "sender_full_name": "John Moehrke",
        "timestamp": 1602777525
    },
    {
        "content": "<p>I did submit a change request - <a href=\"http://jira.hl7.org/browse/FHIR-19410\">FHIR#19410</a>.  Unfortunately, you didn't do everything I said.  The <em>only</em> codes in the current value set that are appropriate are the ones from ActCode and DataOperation.  You shouldn't have anything from object-lifecycle-events, event-status, v3-DocumentCompletion or v3-ActStatus.</p>",
        "id": 213448586,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602777926
    },
    {
        "content": "<p>(You didn't actually do much of what I said - you only linked the participation codes)</p>",
        "id": 213448641,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602777947
    },
    {
        "content": "<p>That was the intent <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 213462678,
        "sender_full_name": "Drew Torres",
        "timestamp": 1602784180
    },
    {
        "content": "<p>I have a question for resolution of FHIR-27727, 27728, 27729, and 27730. Does this effectively create two sets of \"must support\", ie: USCDI \"must support\", and US Core \"must support\"?</p>",
        "id": 213969707,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1603222848
    },
    {
        "content": "<p>We are discussing exactly how to document using a single profile to meet both USCDI cert and other use cases.</p>",
        "id": 213973039,
        "sender_full_name": "Eric Haas",
        "timestamp": 1603224564
    },
    {
        "content": "<p>We have fine line to walk -- if going forward we mark everything in USCDI as 'must support' in US Core we limit reuse. For example, 'birth sex' isn't used in other use cases so developers create their own IG.</p>",
        "id": 214059283,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1603291295
    },
    {
        "content": "<p>Is there a reason to not create two profiles - a USCDI constraint on a base?</p>",
        "id": 214069034,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603294817
    },
    {
        "content": "<p>It's unclear to me the ongoing benefit to maintaining two vs the cost -- many changes to one will ripple to the other, and future IGs will likley default to US Base when in many cases they will be capable of using US Core.</p>",
        "id": 214071496,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1603295801
    },
    {
        "content": "<p>Our current path is to collect 'variance' requests on US core, if we get a large number, we will entertain a base.</p>",
        "id": 214071586,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1603295837
    },
    {
        "content": "<p>So is this, moving USCDI requirements from structured definition to notes, a temporary solution (or trial solution) till US Core has finial decision on dealing with difference between USCDI and US Realm IGs?</p>",
        "id": 214081355,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1603299611
    },
    {
        "content": "<p>We haven't finalized the approach -- we will likely propose a few options on a CGP call</p>",
        "id": 214082023,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1603299859
    },
    {
        "content": "<p>Is the block vote still tomorrow?</p>",
        "id": 214085163,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1603301087
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> Then I don't understand why these four tickets are in the block vote since US Core or CGP has not decided what to do.</p>",
        "id": 214085719,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1603301300
    },
    {
        "content": "<p>The block vote is to no longer mark those as must support</p>",
        "id": 214085910,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1603301375
    },
    {
        "content": "<p>exactly how we communicate the USCDI piece is TBD. if you want those both addressed at same time, pull the comments.</p>",
        "id": 214086020,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1603301408
    }
]