[
    {
        "content": "<p>The Clinical Notes Guidance specified 5 types of DocumentReference and 3 categories of DiagnosticReport as \"minimum\" required clinical notes. </p>\n<p><a href=\"https://www.hl7.org/fhir/us/core/clinical-notes-guidance.html#fhir-resources-to-exchange-clinical-notes\">US Core FHIR Resources to Exchange Clinical Notes section</a> states that</p>\n<blockquote>\n<p>In order to enable consistent access to scanned narrative-only clinical reports the Argonaut Clinical Note Server SHALL expose these reports through both DiagnosticReport and DocumentReference by representing the same attachment url using the corresponding elements listed below.</p>\n</blockquote>\n<p>Does this attachment matching requirement apply to<br>\n1) only the 8 minimum required clinical notes, or<br>\n2) DocumentReference with category=clinical-notes and DiagnosticReport whose category is not LAB, or<br>\n3) any DocumentReference and any DiagnosticReport</p>\n<p>Example: a Pathology DiagnosticReport has a presentedForm sample.pdf and the same pdf is attached in a Referral Note DocumentReference. Since Referral Note is not on of the 5 required DocumentReference types, does such match satisfy the attachment matching requirement?</p>\n<p>Another question is statement </p>\n<blockquote>\n<p>If servers properly categorized scanned reports and used the correct resource per report type (e.g. Pathology scan in DiagnosticReport) this wouldn’t be required.</p>\n</blockquote>\n<p>Does this statement create an exception from the SHALL requirement?</p>",
        "id": 214851980,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1603898666
    },
    {
        "content": "<p>no, the statement doesn't create an exception -- it is included to support the design of referencing from both.</p>",
        "id": 214868815,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1603905350
    },
    {
        "content": "<p>for your path  question, is this a hypothetical or something you are seeing in implementation?</p>",
        "id": 214868991,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1603905429
    },
    {
        "content": "<p>It is a hypothetical. I am checking if Inferno tests this area correctly. My first thought was that the attachment in DiagnosticReport has to be also included in one of the 5 required DocumentReference. But when I though more about it, I am trending to think that any DocumentReference with category=clinical-note should be included. On top of that, since the guidance does not say that DocumentReference SHALL has category=clinical-note and the terminology binding is extensible, that means I cannot exclude any DocumentReference in theory.</p>",
        "id": 214871184,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1603906290
    },
    {
        "content": "<p>The DocumentReference is generic -- we didn't create it just for clinical-notes</p>",
        "id": 214876632,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1603908444
    },
    {
        "content": "<p>I undserstand. So what's your opinion on my question about the matching attachment requirement? Or what is the intention for that section?</p>",
        "id": 214887046,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1603913742
    },
    {
        "content": "<p>My immediate reaction is limiting to those 5 doesn't sound quite right.</p>",
        "id": 214888035,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1603914321
    },
    {
        "content": "<p>should I raise a ticket to clarify that?</p>",
        "id": 214889514,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1603915081
    },
    {
        "content": "<p>If you have a proposal, else we should discuss a bit more</p>",
        "id": 214890637,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1603915521
    },
    {
        "content": "<p>I agree that only those 5 doesn't sound right. So the first question is if the requirement covers DocumentReference with category=clinical-notes, or any DocumentReference.</p>",
        "id": 214895461,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1603918030
    },
    {
        "content": "<p>My immediate reaction is any thing that is a 'clinical-note' in DiagnosticReport must be available through DocumentReference. Defining that list is the challenge</p>",
        "id": 214911054,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1603928369
    },
    {
        "content": "<p>At least the three minimum required by the guidance.</p>",
        "id": 215348994,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1604337204
    }
]