[
    {
        "content": "<p>At the last WGM (or maybe it was DevDays? - all meetings sort of run together...), I chatted briefly with <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> about my concerns around the lack of support for List in Argonaut, and more specifically about the presumption that APIs would only expose 'current' information.  She suggested I write my thoughts down for discussion.  I finally have.  They can be found here: <a href=\"https://docs.google.com/document/d/1ya4FBfwcxYuRdAOblCgTxTBsGmINK60qQOuP1dUMXtg\" target=\"_blank\" title=\"https://docs.google.com/document/d/1ya4FBfwcxYuRdAOblCgTxTBsGmINK60qQOuP1dUMXtg\">https://docs.google.com/document/d/1ya4FBfwcxYuRdAOblCgTxTBsGmINK60qQOuP1dUMXtg</a></p>\n<p>Thoughts/opinions welcome.</p>",
        "id": 169368251,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561957086
    },
    {
        "content": "<p>Looks like access may be locked down and we need to request</p>",
        "id": 169394866,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1561987600
    },
    {
        "content": "<p>Fixed</p>",
        "id": 169398730,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561990377
    },
    {
        "content": "<p>I find it interesting you picked the Argonaut list to post this -- why isn't this in the implementer stream? how is the international community handling lists?</p>",
        "id": 169418140,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1562004930
    },
    {
        "content": "<p>on the use of lists -- I feel like this is an 'invented standards approach' without clear implementer input. We would all benefit from starting with a clear problem statement</p>",
        "id": 169418299,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1562004983
    },
    {
        "content": "<p>From my perspective, it's not at all clear that we'll want a single FHIR endpoint from a system of record to also expose (arbitrary, complete, unvetted) FHIR data from <em>other</em> systems directly alongside the source of truth. It seems just as likely to me that such systems will provide multiple FHIR endpoints to manage this complexity -- separating the stuff they vouch for from the archive of stuff that's just \"here it is, as we received it.\"</p>",
        "id": 169426090,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1562011104
    },
    {
        "content": "<p>From the pure standards/interop perspective, in theory there's a cheap thing Argonaut could to do avoid getting stuck in a possible future where EHRs <em>do</em> want to manage this complexity:  just define (but don't actually use) a tag like <code>external-data</code> meaning \"This data is not part of the system of record\" and the Argonaut guide could say \"clients should filter out any data with the <code>external-data</code> tag if present\".  In <em>theory</em> that would allow us to maintain a compatible API even in a possible future where multiple perspectives are all layered together alongside the system of record. But in <em>practice</em> it'd probably just confuse people. Kind of like wrapping everything in a List (but at least it wouldn't directly change how people used the API today).</p>",
        "id": 169426366,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1562011312
    },
    {
        "content": "<p>It's not just a question of external data.  It's any \"non-current\" data.  EHRs are respositories that contain all sorts of stuff - and there are use-cases for exposing <em>all</em> of that stuff via FHIR API.  The challenge is the presumption that the API will only expose 'relevant' information as opposed to exposing wheat + chaff, with the expectation for the client to filter based on their particular definition of \"chaff\".</p>",
        "id": 169431259,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562015087
    },
    {
        "content": "<p>List is <em>a</em> mechanism for a system (or particular users) to curate and identify what they currently consider to be \"wheat\" - where each List has a context that defines the intended purpose of the information within it.  We could potentially come up with a different way.</p>",
        "id": 169431369,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562015188
    },
    {
        "content": "<p>My base problem statement is that every Condition, AllergyIntolerance, MedicationStatement, etc. that an EHR has in its database needs to be retrievable from a single FHIR endpoint.  At the same time, there needs to be a mechanism to filter such that a client who only wants to see the authoritative problem list, allergy list, medication list, etc. can get those.  (I personally believe that the notion of a single 'problem list' is itself problematic, as we've spent lots of time in PatientCare talking about the notion that what's a problem for one clinician - and is on \"their\" list isn't necessarily relevant to others and those won't be on someone else's list)</p>",
        "id": 169431516,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562015326
    },
    {
        "content": "<p>The issue isn't necessarily U.S.-specific, but Argonaut is where the trends seem to be set and where most of the major EHRs are doing their preliminary work.  And it's where the initial decision to forego List was made.  So it seemed the most appropriate place to start the discussion.</p>",
        "id": 169431548,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562015392
    },
    {
        "content": "<p>To be clear: it was made to bypass list because we don't attempt to formally define what \"current\" is to each consumer. We allow them to get the list based on their own requirements. Some consumers need the in errors to sync systems up</p>",
        "id": 169431990,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562015751
    },
    {
        "content": "<p>I believe if we went the way of the point in time or something other than \"current\" of X, Y, Z status, then it would be List</p>",
        "id": 169432040,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562015776
    },
    {
        "content": "<p>Though I hate List :) From a modeling side, it's just a way to wrap things up, but I never expose just \"List\" APIs... I expose a resource that may have a list of things :)</p>",
        "id": 169432062,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562015815
    },
    {
        "content": "<p>IE: In Java, it's not List.getMyFunObjects(param 1, param2). Its MyFunObjects.getSomeList()</p>",
        "id": 169432085,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562015844
    },
    {
        "content": "<p>but that is a separate thing :)</p>",
        "id": 169432096,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562015869
    },
    {
        "content": "<p>I will also clarify that Allergies, med history, and conditions have always been read/write in Cerner's FHIR implementation. As of today, what is written <em>is</em> part of the legal record, and is returned via the same APIs</p>",
        "id": 169432532,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562016207
    },
    {
        "content": "<p>We are getting ready to start exposing some of what you're referring to (the \"pending\" not \"legal\" record) and have been talking a bit about how to do this, both within HL7 and this chat, as well as in some of the patient empowerment channels</p>",
        "id": 169432613,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562016261
    },
    {
        "content": "<p>So far, consensus seems to be that much of this data is likely the security tag on the resource, which Josh is referring to above.</p>",
        "id": 169432678,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562016347
    },
    {
        "content": "<p>There is still a lot of discussion I feel needs to be had within FHIR about how this process <em>should</em> work from a standards method, eg: patient provided data</p>",
        "id": 169432734,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562016375
    },
    {
        "content": "<p>but as Lloyd alludes to, it's not just patients that provide this data.</p>",
        "id": 169432750,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562016403
    },
    {
        "content": "<p>However, I think perhaps the main point here is: right now, we do NOT take a stance to define every system's interaction as the \"source of truth\" for what statuses should be considered current, nor what an app may care about. IE: it's not a fully curated list in that the app calling has the control over understanding their workflow and what their user (or system) needs to know.</p>",
        "id": 169432922,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562016585
    },
    {
        "content": "<p>Which means that the argonaut use case as it's defined now doesn't seem to match with the List concept (others hopefully will weigh in, but this is why we call out that status parameters are required to be supported)</p>",
        "id": 169433567,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562017229
    },
    {
        "content": "<p>We could absolutely define a generic \"getSomeList\" operation that could be run against arbitrary resources so you could say something like MedicationRequest/$inlist?code=activemeds or $AllergyIntolerance/$inlist?code=activeallergies or something like that if that were deemed useful.</p>",
        "id": 169445415,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562029825
    },
    {
        "content": "<p>Using security seems an odd way to filter.  meta.security is supposed to be about access control constraints, not information about where data came from.  That said, meta.tag could be a candidate.</p>",
        "id": 169445449,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562029879
    },
    {
        "content": "<p>It's true that patient-written data can be part of the current authoritative record.  The bigger challenge is the data that comes in as part of other things.  A patient-submitted allergy or med-statement would presumably be submitted in the context of what you've already got in the record, so adding another isn't a problem.  However, if you receive a discharge summary, referral or similar collection that includes some stuff you've got in the current record but perhaps expressed differently (as well as some new things), there's a problem.  From a medical record perspective, you need retain what was sent to you (as sent).  And you probably want the 'new' stuff.  But you don't want the other items to appear in the official list of allergies or meds.</p>",
        "id": 169445736,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562030339
    },
    {
        "content": "<p>The meta.security might be a solution for some, but it can't cover the clinical assessment of 'relevant'... We do have tags for the integrity of the data (patient asserted, vs clinician asserted, etc)... and we now have CopyMark to be used to tag data that you are not the official repository of (like the paper world big rubber-ink stamp \"COPY\"). I think this CopyMark is what Josh was referring to as external-data.   I don't think that this mark should be an indicator of being excluded from being locally 'relevant'.</p>",
        "id": 169479552,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562073520
    },
    {
        "content": "<p>\"relevant\" is going to be slippery and contextual. We can't solve problems that we can't state clesrly. (For what it's worth I was referring to Meta.tag rather than something security specific.)</p>",
        "id": 169480696,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1562074470
    },
    {
        "content": "<blockquote>\n<p>\"relevant\" is going to be slippery and contextual. We can't solve problems that we can't state clesrly. (For what it's worth I was referring to Meta.tag rather than something security specific.)</p>\n</blockquote>\n<p>understood... I am just pointing out that we do have a security tag for CopyMark...</p>",
        "id": 169487237,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562078937
    },
    {
        "content": "<p>isn't the topic of List all about \"relevant\"?</p>",
        "id": 169487252,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562078948
    },
    {
        "content": "<p>as in this part of FHIR spec? <a href=\"http://build.fhir.org/list.html#query\" target=\"_blank\" title=\"http://build.fhir.org/list.html#query\">http://build.fhir.org/list.html#query</a></p>",
        "id": 169487302,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562078992
    },
    {
        "content": "<p>List is about identifying arbitrary subsets of a collection that are of interest for a particular purpose.  The alternative is to embed information in the resources that can be used to perform the same sort of filtering.  In either case, the challenge is that clients are being trained to not do any filtering at all...</p>",
        "id": 169487730,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562079232
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  where are they being trained to not use any filtering?</p>",
        "id": 169488233,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562079600
    },
    {
        "content": "<p>in our server that meets the argonaut profile, if they pass nothing, they get everything. If they want just \"current\" they pass the statuses they need.</p>",
        "id": 169488316,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562079639
    },
    {
        "content": "<p>I know there were other conversations on making the language more clear/requiring status (which has drafts in progress), but that should be a completely different issue</p>",
        "id": 169488347,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562079664
    },
    {
        "content": "<p>The argonaut use case wasn't intended to be a manicured/maintained \"current\" defined by the server</p>",
        "id": 169488372,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562079683
    },
    {
        "content": "<p>The trick is that they don't get \"everything\" - they don't get 15 versions of the same allergy or 50 versions of the same Condition (that reflect all of the different representations of the resources that have come in as part of referrals, discharge summaries, etc.)</p>",
        "id": 169489227,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562080301
    },
    {
        "content": "<p>At least, not as I understood it :)</p>",
        "id": 169489234,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562080308
    },
    {
        "content": "<p>When the time comes where that data also gets exposed over the AllergyIntolerance, Condition and other endpoints, clients will be in for a rude surprise.</p>",
        "id": 169489328,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562080360
    },
    {
        "content": "<p>We are getting ready to expose that in our system, but not in the way it seems to be expected here. If there are \"50 of the same\" they are not duplicated (the provenance will track if the source is several systems)</p>",
        "id": 169489514,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562080532
    },
    {
        "content": "<p>There is a lot to it, but we are trying to take a large burden on our server where we can to make this simple for clients</p>",
        "id": 169489618,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562080599
    },
    {
        "content": "<p>So that it is harder to mess up, at least that is the goal</p>",
        "id": 169489662,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562080644
    },
    {
        "content": "<p>This is also what we try to do for internal apps, so that doctors don't see 50 of the same allergy</p>",
        "id": 169490128,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562080988
    },
    {
        "content": "<p>\"the same\" doesn't necessarily mean identical.  Each would have different provenance and might assert slightly different things - different granularity, different code, different description, different severity, different dates, etc.  However, from a clinical perspective, they'd all be talking about the \"same\" issue</p>",
        "id": 169490130,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562080990
    },
    {
        "content": "<p>How do you deal with reflecting accurately what data was actually received (where the variances would presumably matter) vs. reflecting a single consolidated view that is 'current' in the allergy or problem list?</p>",
        "id": 169490219,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562081061
    },
    {
        "content": "<p>It depends on the data domain</p>",
        "id": 169490978,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562081594
    },
    {
        "content": "<p>In our system, there has always been some level of dup checking</p>",
        "id": 169490994,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562081607
    },
    {
        "content": "<p>EG: you can't enter a problem more than once, the underlying apis determine that a \"create\" may actually be a modify of an existing problem (and track versions)</p>",
        "id": 169491078,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562081645
    },
    {
        "content": "<p>For things that aren't part of the legal record, or that may come in from other systems, it's more complex</p>",
        "id": 169491137,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562081687
    },
    {
        "content": "<p>The system does what it can to recommend and make the view for the clinician readable/understandable. There are automated ways something can become part of the legal record (and history is tracked to multiple CCDs as sources, for eg)</p>",
        "id": 169491203,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562081749
    },
    {
        "content": "<p>As well as manual ways. As a piece of data moves through that workflow, privs/security/etc comes into play on who can see that data</p>",
        "id": 169491288,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562081804
    },
    {
        "content": "<p>Once a clinician has reconciled data, and it is part of the legal record, history and provenance is updated to point to the source (or, if the clinician rejects it as unreliable, it is often deleted and that is audited for records)</p>",
        "id": 169491336,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562081854
    },
    {
        "content": "<p>But importantly: If there  are 10 CCDs as source of 1 Condition, the Condition resource will NOT expose all 10 versions of that Condition. The provenance may point back to 10 CCDs if an app for some reason wanted that</p>",
        "id": 169491439,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562081917
    },
    {
        "content": "<p>But the FHIR call reflects the actual discrete data that was extracted or combined from those</p>",
        "id": 169491451,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562081937
    },
    {
        "content": "<p>Since that was determined to be the accurate representation of the Condition (allergy, etc)</p>",
        "id": 169491496,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562081978
    },
    {
        "content": "<p>Many feeds from external systems that are technically \"part\" of that system are sent straight to the legal record.</p>",
        "id": 169491650,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082101
    },
    {
        "content": "<p>which all get exposed through Condition today</p>",
        "id": 169491663,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082115
    },
    {
        "content": "<p>This is also what our underlying apps (and DB) see, so FHIR is reflecting the underlying system</p>",
        "id": 169491899,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082291
    },
    {
        "content": "<p>warms my heart to see excitement about Provenance as a tool in Reconcilliation... Your description seems to work well for when the source was not FHIR (CCD or even a v2 message). But what would your Provenance.entity point at if the source was originally sent to you in FHIR form?</p>",
        "id": 169491926,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562082312
    },
    {
        "content": "<p>If it is sent in as a raw condition, which happens today, it depends on the source</p>",
        "id": 169492029,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082384
    },
    {
        "content": "<p>Today, the apps that integrate via FHIR are all trusted, clinicians are interacting directly (or B2B systems that are technically part of the same system are interacting), so hit immediately hits the legal record and is immediately accessible via FHIR</p>",
        "id": 169492070,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082430
    },
    {
        "content": "<p>What happens when the CCDs or Referrals come in as a FHIR Bundle?  Will that data be queriable over the interface?</p>",
        "id": 169492101,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562082463
    },
    {
        "content": "<p>In the future, more trust structures are in place. If it is fed in from an untrusted source, it will be added as Unreliable initially (with provenance for source, which still could point to a CCD fed in through FHIR if that is the workflow, but could also just say \"the patient created this\" in provenance)</p>",
        "id": 169492158,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082484
    },
    {
        "content": "<p>It will be available to the apps and/or users that have privs to see unreliable/non-legal record data</p>",
        "id": 169492204,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082536
    },
    {
        "content": "<p>If it is determined to be unreliable and should not be part of the legal record, it is deleted (audited and provenance updated)</p>",
        "id": 169492236,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082569
    },
    {
        "content": "<p>If it is accepted, it depends on what the clinician decided to do. Provenance and auditing will still be there no matter what. If they accept it, the unreliable tag is dropped, provenance is updated and it is now visible to anyone that can see the legal record</p>",
        "id": 169492349,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082647
    },
    {
        "content": "<p>For \"pending modifies\" ... this is more fun, and is a thread that I think may have started on patient engagement :)</p>",
        "id": 169492400,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082698
    },
    {
        "content": "<p>Ok.  And are your current interfaces exposing \"unreliable/non-legal record\" data?  If so, how are you filtering?  If not, how are you ensuring that clients are trained to do that filtering anyhow?</p>",
        "id": 169492556,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562082817
    },
    {
        "content": "<p>(And interested in what other EHR vendors are doing too :&gt;)</p>",
        "id": 169492566,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562082829
    },
    {
        "content": "<p>DSTU 2 does not do that today, but R4 will</p>",
        "id": 169492622,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082843
    },
    {
        "content": "<p>Also the \"non-legal record\" didn't really fully exist until R4 :)</p>",
        "id": 169492669,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082866
    },
    {
        "content": "<p>outside of you being able to read the CCD under the covers</p>",
        "id": 169492676,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082876
    },
    {
        "content": "<p>IE: the system did not unpack the CCD (and none of this came in through FHIR) automatically.</p>",
        "id": 169492758,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082940
    },
    {
        "content": "<p>and what did come in via FHIR was immediately part of the legal record and is exposed in current resources</p>",
        "id": 169492822,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562082970
    },
    {
        "content": "<p>Also the Argonaut work on provenance is helping to make sure we represent this correctly, which is another reason we're waiting until R4</p>",
        "id": 169492854,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562083019
    },
    {
        "content": "<p>I would say it was much tougher/less understood/less guidance on DSTU 2 itself how to handle some of this well, ignoring underlying system capabilities</p>",
        "id": 169492973,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562083116
    },
    {
        "content": "<p>To the filtering question: only certain apps and users will have privs to see unreliable data. That is enforced in the FHIR server</p>",
        "id": 169493168,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562083270
    },
    {
        "content": "<p>For those that can, we were going to expose an additional parameter that allows them to filter out unreliable data if they want</p>",
        "id": 169493211,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562083315
    },
    {
        "content": "<p>This is in addition to the normal status field</p>",
        "id": 169493255,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562083324
    },
    {
        "content": "<blockquote>\n<p>(And interested in what other EHR vendors are doing too :&gt;)</p>\n</blockquote>\n<p>Our system is not exactly an EHR - we typically aggregate data from other sources - with very little / no deduping, so that's all you get via FHIR - there is no curated or authoritative list of anything. We are adding Provenance so you can see where the data originally came from.</p>",
        "id": 169493471,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1562083517
    },
    {
        "content": "<blockquote>\n<p>For those that can, we were going to expose an additional parameter that allows them to filter out unreliable data if they want</p>\n</blockquote>\n<p>so &amp;_security:not=UNRELIABLE</p>",
        "id": 169493749,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562083716
    },
    {
        "content": "<p>yup :)</p>",
        "id": 169494448,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1562084245
    },
    {
        "content": "<p>I'd have expected that as a meta.Tag rather than meta.Security value.</p>",
        "id": 169527356,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1562109696
    },
    {
        "content": "<p>we already have the list functionality Lloyd proposed above ;-)</p>",
        "id": 169739399,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562366265
    },
    {
        "content": "<p>I've followed this discussion but I'm not sure where it's landed. An EHR will have lots of conditions:</p>\n<ul>\n<li>the patient's curated problem list </li>\n<li>past conditions linked as causes/sources e.g. presenting diagnoses for past encounters - these are active but not part of the problem list, or reasons for prescriptions. They may turn out to be erroneous reasons, but they are the reasons the prescription was given</li>\n<li>conditions received as part of archiving information from other systems, including the patient, tagged with provenance.</li>\n</ul>\n<p>The cause of the concern is that the Argonaut spec says it describes the use of \"the Condition resource to record, search and fetch a list of problems and health concerns associated with a patient\" - which is a subset of the valid reasons to access a condition</p>",
        "id": 169739538,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562366493
    },
    {
        "content": "<p>consider this:</p>",
        "id": 169739695,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562366695
    },
    {
        "content": "<blockquote>\n<p>Example:</p>\n<p><code>GET https://fhir-open-api-dstu2.smarthealthit.org/Condition?patient=1032702&amp;clinicalstatus=active,relapse,remission</code></p>\n<p>Support: Optional to support search by status.</p>\n<p>Implementation Notes: Search for all active problems and health concerns for a patient</p>\n</blockquote>",
        "id": 169739718,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562366715
    },
    {
        "content": "<p>what's the definition of <code>active</code>?  - I'm fairly sure that clients will assume it means 'actively a problem now'. But a condition quoted as evidence for a prescription would be active at the time....</p>",
        "id": 169739828,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562366862
    }
]