[
    {
        "content": "<p>Argonaut Condition.category lists four values on the resource page (complaint | symptom | finding | diagnosis) and two on the linked value set page (problem &amp; health-concern).  The value set page also defines it as all codes from the system, which link contains the four values from the first page.</p>\n<p>The binding is 'preferred.' What are Argonaut implementers choosing to use?</p>",
        "id": 153935871,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1518039687
    },
    {
        "content": "<p>Cerner uses category codes of diagnosis, problem, and health-concern</p>\n<p>Argonaut specific guidance says \"The DAF Condition Category Codes support the separate concepts of problems and health concerns so API consumers can separate health concerns and problems. However this is not mandatory for 2015 certification\"</p>\n<p>Note:  I have an outstanding change request, <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13772\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13772\">GF#13772</a>, logged to clean up some of the US-Core duplicate codes (problem and problem-list-item), which manifested when Patient Care updated the DSTU3 value set.</p>",
        "id": 153935947,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1518055492
    },
    {
        "content": "<p>Hi Michelle, can you clarify how and when 'diagnosis' category code is used?  How does it differ from 'problem'?</p>",
        "id": 153936001,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1518056411
    },
    {
        "content": "<p>Thanks. So, supporting the linked value set values, but taking advantage of the 'preferred' flexibility. Others?</p>",
        "id": 153936210,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1518093695
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197476\">@Dave Carlson</span> </p>\n<ul>\n<li>diagnosis -- encounter-specific conditions, which are typically coded in ICD-10 (or ICD-9) in the US.  For example, E11.621 Type 2 diabetes mellitus with foot ulcer.</li>\n<li>problem -- conditions that have been added to the problem list, which are typically coded in SNOMED and are not specific to a single encounter like diagnoses are.  For example, 44054006 Diabetes mellitus type 2</li>\n<li>health-concern -- any additional concerns expressed by the patient or related person, which are typically freetext (no coding).</li>\n</ul>\n<p>In R4, a new extension has been added for condition-related, which would enable us to relate the encounter-specific diagnoses (e.g. E11.621 Type 2 diabetes mellitus with foot ulcer) with the problem (e.g. 44054006 Diabetes mellitus type 2)</p>",
        "id": 153936243,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1518100084
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> this aligns with my general understanding of use, but your specific definitions and examples are very helpful!</p>",
        "id": 153936513,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1518139521
    }
]