[
    {
        "content": "<p>We have (religion) data using null values. R4 religion extension is extensible, but US Core DSTU2 extension has a required binding. </p>\n<p>1. We can't DAR values on a required binding, but I think we can DAR the whole extension, no? If not, we're looking at creating another extension.<br>\n2. DAR values are not lining up as well as we'd like. Do these look reasonable?<br>\nASKED BUT DECLINED TO ANSWER: <br>\n    DSTU2: asked<br>\n    The definition asserts that this is \"unknown\" to the respondent; this is incorrect. Does that matter? <br>\n    Alternatives include 'masked' (by the patient) and 'unknown' (to the system).<br>\n    V4 has 'asked-declined,' when we get there.<br>\nOTHER: unsupported. <br>\n    OTH would be better; this is lossy but seems to fit as well.<br>\nUNKNOWN/NO PREFERENCE: unknown.<br>\n    A little incorrect but seems ok. 'unsupported' might be closer for 'no pref' ('n/a' isn't in DSTU2) but even that's lossy, and we don't know which it is.</p>",
        "id": 172777701,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1565279922
    },
    {
        "content": "<p>What null values do you currently have in your system? Religion isn't mandatory so I would leave out unless clear value in exchanging the null value</p>",
        "id": 172788335,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1565287518
    },
    {
        "content": "<p>You can't DAR the extension if the extension is properly defined.  Extensions are defined to either allow a value or child extensions.  So if the extension is present, the value element must be present.</p>",
        "id": 172792553,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565289974
    },
    {
        "content": "<p>the DAR goes on the extension value, since that's what's unknown</p>",
        "id": 172792608,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565290022
    },
    {
        "content": "<p>And you can't have an extension in place of a value attribute if the value has a required binding</p>",
        "id": 172792651,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565290065
    },
    {
        "content": "<p>OK. So we could just not include the extension in the null cases (values in CAPS above). But if the client needs them, we have to create another extension, unless we can find a way to use the extension that asserts it's R4 (and has extensible binding).</p>",
        "id": 172793084,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1565290338
    }
]