[
    {
        "content": "<p><a href=\"https://www.hl7.org/fhir/us/core/general-guidance.html#missing-data\">https://www.hl7.org/fhir/us/core/general-guidance.html#missing-data</a> instructs server to output a data absent reason extension for mandatory elements for which there is no data available, but I sort of fail to see the point?</p>",
        "id": 248670602,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628285245
    },
    {
        "content": "<p>If the client need that data the fact that there is an extension saying why the data is not there does not really help in any way</p>",
        "id": 248670700,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628285290
    },
    {
        "content": "<p>If the client does not need that data ditto</p>",
        "id": 248670720,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628285304
    },
    {
        "content": "<p>and the server needs extra code to generate extensions that client cannot really use for anything</p>",
        "id": 248670780,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628285350
    },
    {
        "content": "<p>and also server author have a sort of escape hatch to get out of the required elements requirement - that in some case is just a fact of life, but maybe if there was no escape hatch they would try harder..</p>",
        "id": 248670881,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628285406
    },
    {
        "content": "<p>This was a workaround to make data elements mandatory that actually aren't.  Agree that it's not an appropriate use of DAR - that extension should <em>only</em> be used if there's a legitimate need to capture and use the reason why the data is missing.  If the expectation is that it SHOULD always be there, make it 0..x and must support.  And if you want to jump up and down about it being really important, put a warning or best practice invariant on the parent that yells if the element is missing.  At least then you're not requiring systems to capture and display information they don't need.  (I.e. the code indicating why the element is misisng.)</p>",
        "id": 248691787,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628305314
    },
    {
        "content": "<p>Why? - Because real life is messy</p>",
        "id": 248695892,
        "sender_full_name": "Eric Haas",
        "timestamp": 1628311271
    },
    {
        "content": "<p>That's not a very satisfying answer Eric.  The base requirement of \"this is important and SHOULD always be present, but we accept that occasionally in the real-world it can't be\" is fine.  However, there are some elements where, if missing, you're better off not having the record at all (so DAR is inappropriate).  As well, there are mechanisms of declaring the 'SHOULD' in ways that don't involve requiring support for capturing a reason that no-one actually caries about.</p>",
        "id": 248719511,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628347377
    },
    {
        "content": "<p>I appreciate your opinion @Lloyd , however after several rounds of successful ballots will ample US implementer feedback who understand the real world limitation vis a vis standards, we feel this is the best approach.</p>",
        "id": 248742341,
        "sender_full_name": "Eric Haas",
        "timestamp": 1628381117
    },
    {
        "content": "<p>Thanks Lloyd</p>",
        "id": 248857300,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1628520613
    }
]