[
    {
        "content": "<p>I've been poking around the Argonaut docs and can't get a handle on how stable vs. on-demand is supported.</p>",
        "id": 168968339,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1561490323
    },
    {
        "content": "<p>It's unclear how it is supposed to work.</p>",
        "id": 168968353,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1561490333
    },
    {
        "content": "<p>on-demand is not  a pre-exisitng indexed document, but rather is created upon request.</p>",
        "id": 168969345,
        "sender_full_name": "Eric Haas",
        "timestamp": 1561491046
    },
    {
        "content": "<p>MHD bakes this behaviour into the GET..</p>",
        "id": 168969381,
        "sender_full_name": "Eric Haas",
        "timestamp": 1561491074
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  can explain it more deeply than I , if you need more info</p>",
        "id": 168969408,
        "sender_full_name": "Eric Haas",
        "timestamp": 1561491106
    },
    {
        "content": "<p>On-Demand, as known in XDS, has not been addressed formally by IHE. It was not in the original scope of MHD, and has not been brought up as something that has interest.  I do have theory of how it works, which is mostly like <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> has indicated. The On-Demand and Deferred-Creation could be supported similarly in that they would be a DocumentReference with hash and size missing, this is the indication that the result is not a pre-existing (aka stable) document. Thus doing a GET on the provided URL (not REST, just http GET), would cause that document to come into existence according to the DocumentReference.<br>\nThis is not formally recognized... So the $docRef mechanism as defined in Argonaut might be the better model for IHE to formally use to bridge XDS On-Demand with FHIR... Need a group interested to bring this up in IHE.</p>",
        "id": 169399726,
        "sender_full_name": "John Moehrke",
        "timestamp": 1561991199
    }
]