[
    {
        "content": "<p>I am slightly confused by doc ref dates.</p>\n<p>DocumentReference.created -                 seems clear until you read the Comments:<br>\n    \"This is the creation time of the document, not the source material on which it is based.\"<br>\n    Should \"not the source material on which it is based\" be deleted? It seems to blur an otherwise clear boundary.<br>\nDocumentReference.indexed -                 clear: when the reference resource was created.<br>\nDocumentReference.content.attachment.creation       unclear: the attached document, or the attachment serialization? (not critical for me)<br>\n    \"The date that the attachment was first created.\"<br>\nDocumentReference.context.period            clear: period of care documented<br>\nDocumentReference.context.encounter.period      clear: period of care documented</p>\n<p>I plan to use DocumentReference.created for the document reference date.</p>\n<p>VistA: \"This is the Date (and time) by which the clinician will reference the document. For Progress Notes, this will likely be the date of the provider's encounter with the patient. For Discharge Summaries, it will correspond to the Discharge Date of the Admission referenced in the document.  (If there is no Discharge Date when dictated, it will correspond to the dictation date of the record instead.) In all cases, this is the date by which the document will be referenced and sorted.\"</p>",
        "id": 160102386,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1551884174
    },
    {
        "content": "<p>some of this has been fixed in later versions of FHIR.  Not much we can do to older DSTU or STU.. they were just for trial use...</p>",
        "id": 160103060,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551884662
    },
    {
        "content": "<p>that said... the .created was intended to track the lifecycle creation of the DocumentReference... which might be late than the document bits. However even today the attachment.creation is not queryable, so in IHE I have dictated that .created should be the same as attachment.creation; leaving a gap for those that want to know a difference in time between when the document bits were created and when it was published.</p>",
        "id": 160103407,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551884893
    },
    {
        "content": "<p>this because document bits creation date is more important than publication date... at least that is the comments received at IHE on the topic.</p>",
        "id": 160103448,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551884934
    },
    {
        "content": "<p>in DSTU2... yes there is two redundant places to hold the date that the document bits were created. this redundancy was noticed and corrected after DSTU2.</p>",
        "id": 160113099,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551891362
    },
    {
        "content": "<p>A similar item about querying using context.period <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20123\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20123\">GF#20123</a> will be discussed on Structured Documents tomorrow</p>",
        "id": 160116372,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1551893656
    },
    {
        "content": "<blockquote>\n<p>A similar item about querying using context.period <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20123\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20123\">GF#20123</a> will be discussed on Structured Documents tomorrow</p>\n</blockquote>\n<p>That is already supported. look at the 'period' query parameter .  Been there since DSTU2.</p>",
        "id": 160137763,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551908943
    },
    {
        "content": "<p>sure, question is about requiring in the profile.</p>",
        "id": 160147896,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1551912082
    },
    {
        "content": "<p>ah, right sorry to miss the scope. in IHE MHD, I had already included it and a large number given XDS basic query. Much more, but specific use-case drove this: patient, status, identifier, date, author, category, type, setting, period, facility, event, security-label, format, and related.</p>",
        "id": 160197634,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551966341
    },
    {
        "content": "<p>how well supported are all those searches? In US core we have added very minimal based on feedback</p>",
        "id": 160199960,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1551967914
    },
    {
        "content": "<p>well, the IHE target audience is slightly different. MHD is primarily used as an API to an XDS or XCA environment; where those all map to one query type.  In that context they are thus well supported. MHD can be used as simply an API to an EHR, where for historic documents these query parameters are not hard to support, and where the dominant result is just one onDemand entry for which the parameters are of little value.<br>\nPeriod is a common use-case, when looking only at a specific time-range in the past; usually done for coverage or business-rules based investigations. Sometimes for clinical use, when the patient can't recall where treatment happend, but does know when; so a nationwide search with a period is useful to find a discaharge summary from the one place that has documents during that time period.</p>",
        "id": 160202193,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551969230
    }
]