[
    {
        "content": "<p>I found two us-core-1 invariants in US Core v4.1.0. I thought invariant id has to be unique in an IG but apparently IG publisher think differently. Is that a concern?</p>",
        "id": 266113693,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1640531707
    },
    {
        "content": "<p>Sounds like a ballot comment is in order</p>",
        "id": 266116789,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1640536594
    },
    {
        "content": "<p>There is no rule that I can find.  Agree would be nice to make them sequential in IG, but am reluctant to change invariant id's if already widely used and would cause  a lot of headaches for implementers.</p>",
        "id": 266179876,
        "sender_full_name": "Eric Haas",
        "timestamp": 1640618339
    },
    {
        "content": "<p>Having duplicate ids would be more of a problem for implementers. It would cause ambiguity as to which error was being violated if you were doing a translation based in the id.</p>",
        "id": 266206894,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1640641169
    },
    {
        "content": "<p>Only requirement is that the id is unique in the context of a given StructureDefinition.  No rule they have to be unique across StructureDefinitions.</p>",
        "id": 266650762,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641184202
    },
    {
        "content": "<p>Would be nice to be unique per IG....</p>",
        "id": 266694456,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1641221593
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>  + <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>  - Should we change Ids already in use?</p>",
        "id": 266694511,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1641221632
    },
    {
        "content": "<p>My comment was on the original post that the two invariants were found in the ballot version. if the use of the same invariant id for two different invariants is already published, I have no strong opinions either way. I agree it is nice if all invariants are unique in the IG, but it may be easier to edit individual structure definitions with an independent numbering of invariants.</p>",
        "id": 266696838,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1641222836
    },
    {
        "content": "<p>I created a ballot comment for this issue. <a href=\"https://jira.hl7.org/browse/FHIR-34646\">https://jira.hl7.org/browse/FHIR-34646</a></p>",
        "id": 266813713,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1641306552
    }
]