[
    {
        "content": "<p>While testing the example questionnaire resources provided for the connectathon track, I've found a few errors.  Three of the examples include the 'questionnaire-hidden' extension on the top-level item group.  I believe this will cause all child items to be hidden, and thus the entire questionnaire?  Assume that this extension was intended to hide only the first 'display' type item, so move the extension into that item?  See questionnaire-example-audit, questionnaire-example-asq3, and  questionnaire-example-housing</p>",
        "id": 153998874,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1537498533
    },
    {
        "content": "<p>I submitted Issue #17910 to clarify use of the text element on a group-type item (it was accepted).  The group text element is intended to be a short section name, correct?  This guideline is not followed in example 'questionnaire-example-audit'.  Suggest that this long text string be moved into a display type item within that group.</p>",
        "id": 153998882,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1537498883
    },
    {
        "content": "<p>In the phq9 questionnaire, the item with linkId 'g1.s' is a display type, but it also includes a code element.  This violates constraint \"que-3\" on the Questionnaire resource.</p>",
        "id": 153998883,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1537499151
    },
    {
        "content": "<p>Thanks for the heads up I missed that  hidden affect descendant items.</p>",
        "id": 153998908,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537504382
    },
    {
        "content": "<p>I thought I had fixed the code on a display.</p>",
        "id": 153998909,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537504577
    },
    {
        "content": "<p>OK I fixed the examples and added a readonly/hidden total score question to PHQ9, but I have  updated the test renderer to handle this correctly in the forms view but I may show up in the adaptive view as a question until I can fix that  (it will show up as any other question. Will discuss whether we how we support this in the simple flat form  this weekend.)</p>",
        "id": 154000077,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537985547
    },
    {
        "content": "<p>Thanks Eric.  I implemented support for hidden items in my rendering app and most of these examples now work.  Except the DAST example still has hidden on the top item, so it has no available questions.  For the Audit example, my app correctly displays only the second display-type item.</p>",
        "id": 154000118,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1537999107
    },
    {
        "content": "<p>I'll see you this weekend, although will be mostly occupied with leading the Care Management track.</p>",
        "id": 154000119,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1537999130
    },
    {
        "content": "<p>let  me check DAST</p>",
        "id": 154000121,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537999384
    },
    {
        "content": "<p>forgot to update that one</p>",
        "id": 154000122,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537999447
    },
    {
        "content": "<p><span class=\"emoji emoji-1f44d\" title=\"thumbs up\">:thumbs_up:</span></p>",
        "id": 154000124,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1537999653
    },
    {
        "content": "<p>fixed DAST, I left both the group and display as hidden for scoring.  I know that the display extension is technically superfluous but won't be flagged as hidden for my application right now.  I'll fix it when I get a chance.</p>",
        "id": 154000132,
        "sender_full_name": "Eric Haas",
        "timestamp": 1538000350
    },
    {
        "content": "<p>Assume you changed the group \"g2\" that contains scoring question? Problem I still have is that the first group \"g1\" is hidden, which hides all questions.</p>",
        "id": 154000178,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1538014374
    },
    {
        "content": "<p>Ah, I see that you have hidden = false for \"g1\".  It's working, cool!</p>",
        "id": 154000187,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1538017254
    },
    {
        "content": "<p>yes I just edited the boolean values.</p>",
        "id": 154000282,
        "sender_full_name": "Eric Haas",
        "timestamp": 1538058600
    }
]