[
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16133\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16133\">GF#16133</a> Blood pressure expressing systolic and diastolic as components </p>\n<p>This comment from the CIMI group is questioning how Argonaut/USCore and the fhir vital signs profiles represents BP.   </p>\n<p>Brief history:</p>\n<ul>\n<li><code>component</code> present in  pre STU1 Observation and used to represent BP </li>\n<li>Taken out in STU1 and replaced with <code>.related</code> which was used to represent BP</li>\n<li>Due to overwhelming implementer feedback (including specific feedback to represent BP using <code>components</code>) it was put pack in Observation  DSTU2 and used to implement the vitals profile in Argonaut, USCore and FHIR vitals....</li>\n</ul>\n<p>Seeking feedback on the comment as well as my proposed disposition.</p>",
        "id": 153955744,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525376922
    },
    {
        "content": "<p>You mean the <em>Resolution</em> field, which currently states:</p>\n<blockquote>\n<p>Resolution:<br>\nIt is critical to represent these concepts in a single way and the implementation community wanted Systolic and Diastolic in a single observation.</p>\n<p>Secondarily  it has been modeled this way since DSTU2 and Argonaut and has a wide implementation base.  The justification that CIMI models it differently is not a compelling reason to change this profile.</p>\n</blockquote>\n<p>I agree!</p>",
        "id": 153955786,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1525379913
    },
    {
        "content": "<p>\"CIMI has a different model\" is not a sufficent rationale.  If the balloter were to provide specific clinical cases that need to be expressed that are expressible with the CIMI approach and not with the current model, that would be something we'd need to look seriously at.</p>",
        "id": 153955821,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525385040
    },
    {
        "content": "<p>it appears that the statement about CIMI is not true. It is true that \"one CIMI member believes that the CIMI models should do X irrespective' but there's no agreement amongst CIMI that either (a) that's what should be done or (b) it would be done irrespective.</p>",
        "id": 153956090,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1525492813
    },
    {
        "content": "<p>You are correct,  I misrepresented the connection to cimi and I amend my question to read...</p>\n<p>This comment is questioning how Argonaut/USCore and the fhir vital signs profiles represents BP vs how is proposed in the cimi modeling...</p>",
        "id": 153956470,
        "sender_full_name": "Eric Haas",
        "timestamp": 1525703400
    }
]