[
    {
        "content": "<p>From last week's Cross-Group Project call, we had some open discussion on whether/how to represent SDOH survey instruments. I wanted to share my take on the relevant questions (and some proposed answers) here, to help frame follow-on discussion: <a href=\"https://hackmd.io/@jmandel/sdoh-assessments\">https://hackmd.io/@jmandel/sdoh-assessments</a></p>",
        "id": 270606460,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643917491
    },
    {
        "content": "<p>(FYSA <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> and <span class=\"user-mention\" data-user-id=\"192672\">@Floyd Eisenberg</span> since we were making the case for these capabilities on last week's call.)</p>",
        "id": 270607505,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643917912
    },
    {
        "content": "<p>RE Josh's proposal above in an alternative the current state and this proposal <a href=\"http://jira.hl7.org/browse/FHIR-35364\">FHIR-35364</a></p>",
        "id": 270607797,
        "sender_full_name": "Eric Haas",
        "timestamp": 1643918018
    },
    {
        "content": "<p>If I'm reading the proposed \"Not persuasive w/ mod\" disposition on  <a href=\"http://jira.hl7.org/browse/FHIR-35364\">FHIR-35364</a> correctly, <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>, your answer to my <a href=\"https://hackmd.io/@jmandel/sdoh-assessments#Questions\">Question (1)</a> is \"No, that's out of scope\"?</p>",
        "id": 270608058,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643918124
    },
    {
        "content": "<p>It'd be good to answer the design questions first to make sure we have agreement on the requirements, before reaching a decision on the ballot items.</p>",
        "id": 270608357,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643918236
    },
    {
        "content": "<p>this needs a new thread - since it may overwhelm the meeting and block announcements</p>",
        "id": 270608524,
        "sender_full_name": "Eric Haas",
        "timestamp": 1643918289
    },
    {
        "content": "<p>(Moved!)</p>",
        "id": 270612164,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643919900
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Thank you for your thoughtful analysis of the situation with respect to survey instruments. As I see the issue, USCDI version 2 specified SDOH Assessment with examples of types of assessments. Unfortunately, it is difficult to reference an evaluation tool and create a generic US Core Screening Response Observation Profile without expanding the scope and stakeholder community since there is a large clinical and quality improvement community that use screening response observation instruments to manage clinical care, to provide clinical decision support, and to measure outcomes with respect to quality. Some of those screening instruments are risk-assessment and clinical status tools as well. Such screening tools are widely used in clinical care clinicians use EHR products to collect the responses; it is the ability to tie together the components and sharing through a FHIR API that seem to be the challenge.      I've tried to consider different approaches: (1) Terminology-based - allow each tool and each of its components to remain observations (I.e., not Observation.component) and use the LOINC AccessoryFiles/PaneslAndForms.csv to find the parent for each component code.  This approach requires terminology services that may not be readily available in all cases. (2) Retain the \"must support\" proposed for Observation.component in the new profile - this requires significant work on the part of vendors for a generic use case that cannot cover all possible variations in evaluation instruments, some of which have nested components and, thus, seems unreasonable. (3) Suggest use of Questionnaire and QuestionnaireResponse to contain any evaluation instrument of interest (the Questionnaire) and the results (QuestionnaireResponse). This approach seems analogous to a document-based answer that may create additional overhead in trying to evaluate change over time (and which specific change in components) such that the QuestionnaireResponse would need to be unpacked anyway except for just human viewing. (4) Create a Must Support for Observation.derivedFrom such that each component observation maintains metadata about the parent instrument code from which it is derived (note the US Core proposed profile already includes MustSupport for derivedFrom with reference to the same profile. An alternative is the suggestion Josh Mandel provides using hasMember for the instrument parent code to list its members (note that hasMember is not currently listed as Must Support).    From this review, it seems that Josh's suggestion to have 2 profiles: \"SDOH Item\" and \"SDOH Panel\" with the Must Support items he listed makes the most sense - I leave it to the community and more technical folks to determine if hasMember or if derivedFrom is the better approach but either seems more palatable and useful than the current Observation.component Must Support.  I also might consider that SDOH in the name of both the \"Item\" and the \"Panel\" show consistency with the USCDI v2 requirement, a less restrictive name for the profiles is worthy of consideration.</p>",
        "id": 270662427,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1643944323
    },
    {
        "content": "<p>Note - now that this is a separate stream, I want to be sure that there is good community participation. Will keeping it as a separate stream limit review and comment? We really need good community review.</p>",
        "id": 270662549,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1643944455
    },
    {
        "content": "<p>This is a topic within the Argonaut stream; everyone subscribed to the stream should see this topic.</p>",
        "id": 270662577,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643944483
    },
    {
        "content": "<p>Thanks for the detailed response here! I take it from your analysis that you agree we should treat (1) and (2) (as described in my write-up) as design requirements.</p>",
        "id": 270662628,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643944552
    },
    {
        "content": "<p>Yes, I do agree with your write-up</p>",
        "id": 270662684,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1643944584
    },
    {
        "content": "<p>Note - the discussion really applies to all four trackers: <a href=\"http://jira.hl7.org/browse/FHIR-35364\">FHIR#35364</a>, <a href=\"http://jira.hl7.org/browse/FHIR-35363\">FHIR#35363</a>, <a href=\"http://jira.hl7.org/browse/FHIR-35282\">FHIR#35282</a>, and <a href=\"http://jira.hl7.org/browse/FHIR-34752\">FHIR#34752</a> - and to their proposed resolutions.</p>",
        "id": 270662781,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1643944692
    },
    {
        "content": "<p>edited - \"RE: this needs a new thread\" comment above (apparently the entry before was confusing- I don't see other participating in this thread but we really need input to the design issues.</p>",
        "id": 270992176,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644246806
    },
    {
        "content": "<p>This is a dedicated thread about survey instruments. It's visible to everyone subscribed to <a class=\"stream\" data-stream-id=\"179175\" href=\"/#narrow/stream/179175-argonaut\">#argonaut</a> .</p>",
        "id": 270998344,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644249165
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 271009798,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644253700
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> Interested in your take on the suggestions posed by Josh Mandel re: design requirements of (1) sdoh_item and (2) sdoh_panel (<a href=\"https://hackmd.io/@jmandel/sdoh-assessments\">https://hackmd.io/@jmandel/sdoh-assessments</a>).</p>",
        "id": 271040469,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644267361
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Can you help me clarify when it is appropriate to use .derivedFrom versus .hasMember? I.e., a panel code .hasMember of a number of component questions that each might be referenced as an observation and connected as members of the \"parent\" ---- versus each \"component\" observation .derivedFrom the parent panel code.  Which might be better for an observation with 1 answer versus an observation with multiple responses allowed?   Your explanation will help with this discussion.  Thank you.</p>",
        "id": 271040862,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644267548
    },
    {
        "content": "<p>My understanding:<br>\nderivedFrom = \"The value of this Observation or its components was determined - at least in part - from the value of the referenced resource<br>\nhasMember = \"This is a 'grouping' observation which typically has no value of its own, that is grouping the referenced observations\"</p>\n<p>Though probably best to vet that with OO.</p>",
        "id": 271042790,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644268511
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> Can you comment on Lloyd's description of .derivedFrom and .hasMember above? Might I use .hasMember to reference a risk survey tool that has a value imputed from all the results of the components listed as members?</p>",
        "id": 271045438,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644269863
    },
    {
        "content": "<p>That's my read as well. I would not expect <code>derivedFrom</code> to represent the relationship of an observation to it's parent panel, that would be <code>hasMember</code> (from the panel to the constituent observations). We use <code>derivedFrom</code> to indicate the Observation was extracted from a QuestionnaireResponse.</p>",
        "id": 271054353,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1644273822
    },
    {
        "content": "<p>These are orthogonal concepts. From a US Core perspective, I think the most important thing is to have a consistent structure for representing granular and nested observations (i.e., <code>hasMember</code> semantics). We don't have any expectations that such Observations will have originated from Questionnaires (i.e., <code>derivedFrom</code> semantics), though of course that's one path.</p>",
        "id": 271054971,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644274196
    },
    {
        "content": "<p>if you are looking for a direct link to the assessment tool from where the questions came from for an observation you need to use either Provenance or the relatedArtifact extension.   To fetch based on a particular questionnaire or form you would use a chained search a la:</p>\n<div class=\"codehilite\"><pre><span></span><code>GET [base]/Observation?patient=Patient/123&amp;Observation.derivedFrom:QuestionnaireResponse.questionnaire.url=http://somequestionnaire12345\n\nor\n\nGET [base]/Observation?patient=Patient/123&amp;Observation.derivedFrom:QuestionnaireResponse.questionnaire.title=My%20Questionnaire\n</code></pre></div>",
        "id": 271055132,
        "sender_full_name": "Eric Haas",
        "timestamp": 1644274291
    },
    {
        "content": "<p>The current profile in both US Core and SDOH have a 0..1 MS on <code>derivedFrom</code> .</p>",
        "id": 271055289,
        "sender_full_name": "Eric Haas",
        "timestamp": 1644274396
    },
    {
        "content": "<p>mock up of Josh's proposal with a few edits: <a href=\"https://hackmd.io/ObMVJ_ohQu2QsFZMiKYSBg?view\">https://hackmd.io/ObMVJ_ohQu2QsFZMiKYSBg?view</a></p>\n<p>This demonstrates the need for multiple profiles and terminologies and some 'Splainin' on how it all fits together...</p>",
        "id": 271080268,
        "sender_full_name": "Eric Haas",
        "timestamp": 1644294957
    },
    {
        "content": "<p>FWIW, there is this <a href=\"http://hl7.org/fhir/R4/observation.html#gr-other\">further clarification in observation</a>. The application of these elements to survey instruments described above seems reasonable. In general I think use of .hasMember should be somewhat constrained. It should be used when the primary observation is, in part at least,  defined by these references, each of which is distinct and used as is. </p>\n<p>.derivedFrom really is anything else, but more specifically the primary observation is doing some transformation of the referenced observation to yield a \"derived\" result.</p>",
        "id": 271131694,
        "sender_full_name": "Robert McClure",
        "timestamp": 1644329140
    },
    {
        "content": "<p>In the LOINC community we had a lot of discussion about the various \"collections\" of things across domains (lab, clinical, forms, structured reports, etc) that have child members and found far more similarities than differences and thus elected to use a common structure (\"panels\") to represent them. Many SDOH surveys are remixes of other instruments whose items can stand on their own as interesting/important.</p>\n<p>Seems that <code>.hasMember</code> to indicate child observations is a good way to go, though many SDOH (and other) surveys are nested (e..g subpanels for each domain). The description of <code>.hasMember</code> mentions DiagnosticReport  for nested grouping.</p>\n<p>If/when there is a <code>QuestionnaireResponse</code> you'd use <code>.derivedFrom</code> to link.</p>\n<p>Occasionally, but not always, the instrument will have one or more summary/total score variables, so conceivably those could point to the individual observations that contributed to the summary AND the QuestionnaireResponse if there was one?</p>",
        "id": 271141664,
        "sender_full_name": "Daniel Vreeman",
        "timestamp": 1644333068
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> I like the multiple profile examples and agree with the .hasMember (which needs to be Must Support) - would the \"panel\" profile allow responses to individual component observations be singular or multiple (depending on the panel definition)?  I.e., the multiple responses to one question would be handled as multiple observations based on the same code? I think that was part of the original ask.</p>",
        "id": 271147719,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644335510
    },
    {
        "content": "<p>What are existing implementations doing?</p>",
        "id": 271158537,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644339907
    },
    {
        "content": "<p>We support hasMember outbound and inbound only referencing contained observations</p>",
        "id": 271164370,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1644342273
    },
    {
        "content": "<p>to be clear I am not advocating this approach just trying to flesh out how it would look.</p>",
        "id": 271164987,
        "sender_full_name": "Eric Haas",
        "timestamp": 1644342586
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192672\">@Floyd Eisenberg</span>  the  components are used for multipart answers as demonstrated in <a href=\"http://build.fhir.org/ig/HL7/US-Core/Observation-prapare-multiselect-example.html\">this example</a>.    I think I will capture a screenshot of the alternative option  adjacent to this one so we can compare side by side.</p>",
        "id": 271165623,
        "sender_full_name": "Eric Haas",
        "timestamp": 1644342878
    },
    {
        "content": "<p>I now have the <a href=\"https://hackmd.io/ObMVJ_ohQu2QsFZMiKYSBg?view\">two options</a> mocked up with enough detail to cause implementers heartburn.</p>",
        "id": 271176570,
        "sender_full_name": "Eric Haas",
        "timestamp": 1644347463
    },
    {
        "content": "<p>Overall, we think that the emphasis on screening instrument/survey is a mistake.</p>",
        "id": 271195977,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644356913
    },
    {
        "content": "<p>What matters is the ability calculate risk assessments based upon discrete and calculable answers. Surveys share questions, there's little value in transmitting grouping them by survey.</p>",
        "id": 271196006,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644356931
    },
    {
        "content": "<p>An interop exchange would always transmit all SDOH data, not just the observations limited to a specific survey.</p>",
        "id": 271196007,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644356933
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> I think we need to explore your comment more deeply.  Yes, the ability to calculate risk assessments is critical when the evaluation tool has such calculate as part of the tool and calculation is generally performed in a SMART APP or in an EHR to provide an answer. However, the individual responses do have value for trending in addition to the overall score (if indeed a score is involved). There is value in transmitted grouping by survey and all data related to any survey could not necessarily be transmitted as a whole unless I am missing something. There are surveys that have unique entries that have meaning only as part of specific tools and the USCDI request is not specific to any given survey.</p>",
        "id": 271196672,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644357283
    },
    {
        "content": "<p>Hey Floyd,</p>\n<blockquote>\n<p>the individual responses do have value for trending in addition to the overall score</p>\n</blockquote>\n<p>trending responses doesn't have anything to do with grouping as a survey, though, right?</p>",
        "id": 271196846,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644357359
    },
    {
        "content": "<blockquote>\n<p>There is value in transmitted grouping by survey </p>\n</blockquote>\n<p>Can you please point to an authoritative example of this value?</p>",
        "id": 271196944,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644357396
    },
    {
        "content": "<blockquote>\n<p>all data related to any survey could not necessarily be transmitted as a whole</p>\n</blockquote>\n<p>I think a query on observation with a bunch of LOINC codes would transmit all data related to a survey, wouldn't it?</p>",
        "id": 271197037,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644357461
    },
    {
        "content": "<blockquote>\n<p>There are surveys that have unique entries that have meaning only as part of specific tools</p>\n</blockquote>\n<p>Please reference these surveys.</p>",
        "id": 271197114,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644357487
    },
    {
        "content": "<p>Isaac, no - there are surveys that have value as a whole, but individual results can be trended for specific improvement for individual care over time. These may not be SDOH-specific but they are evaluation instruments for clinical care and measure developers have sought to look for specific improvements in elements. That includes the asthma scales.  I will request some examples from the quality measure community.  However, as for a query on observation with a bunch of LOINC codes - I don't know that they would transmit all data related to the survey unless they were linked somehow with .hasMember. Or one would have to use the LOINC tables to reconnect them (at least that what I have been given to understand).  Note that CDS may also need to refer to components of a survey to suggest specific interventions.</p>",
        "id": 271197529,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644357661
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> for your example: ---- your words: \" :thinking_face: Do we require support for chained search to fetch all observations by survey instrument using the derived-from searchparameter?\"    Answer/Question - I thought we were proposing using .hasMember (as must support) for the survey tool to indicate which component codes are members (rather than the component code listing .derivedFrom). .derivedFrom seems to indicate the result of the component is derived from something - the .hasMember seems more appropriate to the use case.</p>",
        "id": 271329016,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644432734
    },
    {
        "content": "<p>I think we should separate out our goals for required query parameters, until we've got a handle on the required data models.</p>",
        "id": 271330375,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644433324
    },
    {
        "content": "<p>There are various ways to improve the ergonomics of queries, but even a simple two-step query process is feasible If we don't want to get into chaining. I would suggest we defer the discussion about query ergonomics.</p>",
        "id": 271330534,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644433388
    },
    {
        "content": "<p>hasMember points to other Observation in a group or panel.</p>\n<p>derivedFrom point to the Instrument from where it came from. like a QuestionnaireResponse or a PDF</p>\n<p>One of Josh's concerns in his ballot comment was how a client would be able to fetch all the answers from the same survey which is a reasonable question.   I have provided one answer to address that concern.   Search is tied into profiling so it is an important consideration.</p>",
        "id": 271339855,
        "sender_full_name": "Eric Haas",
        "timestamp": 1644437192
    },
    {
        "content": "<blockquote>\n<p>... a reasonable question.   I have provided one answer to address that concern.   </p>\n</blockquote>\n<p>Can you spell out the answer for me?</p>",
        "id": 271342398,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644438455
    },
    {
        "content": "<p>FHIR RESTful search  based on <code>derived-from</code> search parameter.</p>",
        "id": 271365156,
        "sender_full_name": "Eric Haas",
        "timestamp": 1644450465
    },
    {
        "content": "<p>But that would only work if there was also a QuestionnaireResponse available.</p>",
        "id": 271375064,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644456829
    },
    {
        "content": "<p>And if that was available we wouldn't need observations. The question for me is <em>what core set of capabilities</em> should be consistently and universally supported. I doubt if that core set needs to include multiple representations (observations <em>and</em> questionnaire responses hardly seems parsimonious).</p>",
        "id": 271375169,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644456913
    },
    {
        "content": "<p>If the QR was available we would still need the observation to search out individual QA pairs, otherwise why go to all the trouble of data extraction in the SDOH guide?     All I am saying is derived-from it is one way to tie the observations together and it doesn't need to be pointing to a FHIR QR.</p>",
        "id": 271382430,
        "sender_full_name": "Eric Haas",
        "timestamp": 1644464176
    },
    {
        "content": "<p>If both of the following are true:</p>\n<ol>\n<li>The <em>one defined way</em> to tie observations together is based on co-occurrence in a FHIR QuestionnaireResponse</li>\n<li>USCDI-enabled EHRs are not required to support FHIR QuestionnaireResponse</li>\n</ol>\n<p>... then it follows that USCDI-enabled clients will not have a reliable way to tie observations together. </p>\n<p>(This is why I wouldn't introduce a dependency on QuestionnaireResponse into the grouping story.)</p>",
        "id": 271383838,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644465852
    },
    {
        "content": "<p>Seconding Isaac' comment above. We surely have SDOH data, but in general the original surveys and attended grouping is long lost.</p>",
        "id": 271384824,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1644467077
    },
    {
        "content": "<p>Are you saying you <em>never</em> know how survey questions are grouped, or just that you don't <em>always</em> know?</p>",
        "id": 271384920,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644467187
    },
    {
        "content": "<p>Even if you do know, the way things are grouped in the Questionnaire isn't necessarily the way they ought to be grouped in a 'panel' Observation.</p>",
        "id": 271385169,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644467508
    },
    {
        "content": "<p>I'm just trying to ascertain whether it's sometimes  known that \"this set of observations was collected as part of one instrument\".</p>",
        "id": 271386293,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644468976
    },
    {
        "content": "<p>I am saying that we aggregate data from various sources, and what we get is often (always?) just the raw observations, we do not know if they came from a survey or what survey, so if the SDOH profiles mandates or relies on those kind of information we won't be able to comply</p>",
        "id": 271446894,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1644506776
    },
    {
        "content": "<p>The mandate would be to ensure that systems <em>support</em> grouped observations, not that observations always <em>are</em> grouped.</p>",
        "id": 271447955,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644507229
    },
    {
        "content": "<p>the better question here is -- <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>, why is it reasonable for you to not know what survey the observation came from? Would it be reasonable to never know what survey an observation came from? My point is that the survey (for SDOH domains at least) isn't important.</p>",
        "id": 271472736,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644517300
    },
    {
        "content": "<p>I'm not sure that's a \"better question\" -- along those lines I think you'd need to ask:</p>\n<ul>\n<li><em>should support for US Core SDOH imply that your system can represent data collected from survey instruments?</em></li>\n</ul>",
        "id": 271473116,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644517466
    },
    {
        "content": "<p>That's the question we need to answer before hashing out profiles and conformance requirements. (For me it's a clear \"yes\".)</p>",
        "id": 271473274,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644517560
    },
    {
        "content": "<p>Josh, I think your characterization is incorrect, How about:</p>",
        "id": 271474320,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644517981
    },
    {
        "content": "<blockquote>\n<p>should support for US Core SDOH <strong>require</strong> that your system can represent <strong>that data was  collected as part of a</strong> survey instruments?</p>\n</blockquote>",
        "id": 271474326,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644517985
    },
    {
        "content": "<p>I (nor anyone else I think) is disputing that systems should be able to represent data collected as part of a survey being completed. I'm just pointing out that the value of maintaining a reference to that survey isn't important, and I haven't seen any evidence to the contrary above.</p>",
        "id": 271474367,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644518001
    },
    {
        "content": "<p>(will continue on call happening now)</p>",
        "id": 271474661,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644518149
    },
    {
        "content": "<p>We handle SDOH data discretely, we do not really care if it comes from a survey</p>",
        "id": 271475026,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1644518308
    },
    {
        "content": "<p>yup, so do we</p>",
        "id": 271475093,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644518345
    },
    {
        "content": "<p>The issue with \"multi-select\" is that if you refactor the questionnaire to be \"better\"(?) and have individual 1-5 questions about \"how hard is been to get x\" and \"how hard has it been to get y\", then you need to maintain multi-select support even if you collect that same data in a more discrete way.</p>",
        "id": 271475647,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1644518660
    },
    {
        "content": "<p>Not sure what you mean </p>\n<blockquote>\n<p>then you need to maintain multi-select support even if you collect that same data in a more discrete way.</p>\n</blockquote>\n<p>Isn't it just  a new set  of observations?</p>",
        "id": 271476705,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1644519140
    },
    {
        "content": "<p>And maybe an updated instrument so folks would know how to get the key data in version 1.0 vs 2.0</p>",
        "id": 271476756,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1644519164
    },
    {
        "content": "<p>Yeah, I guess my normal \"legacy data\" speech undermines my point that future, improved questionnaires would negate the need for MS on multi-select answers...  Dang.</p>",
        "id": 271478206,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1644519697
    },
    {
        "content": "<p>It seems there are 2 parallel yes related questions.  I understand Josh's suggestion is:</p>",
        "id": 271478348,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644519746
    },
    {
        "content": "<p>Sorry - entered too soon: Josh's Suggestions as I understand it: Question for modeling:<br>\n(1) Set of answers collected as part of the same instrument (these six questions are part of one survey) and any single question may have 1 or more answers AND (2) Individual assessment observation which may have 1 or more answers. I'm finding it confusing when we include the single question with one or more answers as part of the \"single observation\" and as part of the \"panel\" - different evaluation tools have different approaches and we need to support a generic approach to handle them.</p>",
        "id": 271478648,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644519874
    },
    {
        "content": "<p>And please note, the USCDI v2 element is SDOH Assessment. However, US Core balloted a more generic approach \"US Core Observation Screening Response (<a href=\"http://build.fhir.org/ig/HL7/US-Core/StructureDefinition-us-core-observation-screening-response.html\">http://build.fhir.org/ig/HL7/US-Core/StructureDefinition-us-core-observation-screening-response.html</a>). Thus the proposed profile in US Core would encompass any other structured evaluation/risk assessment tool including those generated as PROMIS measures included in LOINC - and many such components have value only as part of the tool in which they exist.</p>",
        "id": 271480230,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644520559
    },
    {
        "content": "<p>I think it would be a very useful baseline capability for US core to define generic\"observation item\" profiles and \"observation panel\" profiles. If we had such building blocks, then using those with a set of specializations for SDOH items and SDOH panels would be quite natural.</p>",
        "id": 271487907,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644524026
    },
    {
        "content": "<p>However, I think the design discussion is getting a little bit ahead of the consensus right now. On the phone call today I tried to take a straw poll about whether we think solving these problems is in scope. It looks like we won't get a chance to finish that poll until next week though.</p>",
        "id": 271487993,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644524051
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192672\">@Floyd Eisenberg</span> :  Lloyd's general description's of derivedFrom and hasMember follows closely the definitions here: <a href=\"https://build.fhir.org/observation-definitions.html\">https://build.fhir.org/observation-definitions.html</a>.  Depending on the definition of \"risk survey tool\" the hasMember is potentially appropriate.  It may be that the survey \"tool\" is the Observation where the hasMember points to the individual results \"survey tool components\" of that \"tool\".  I.e., if the tool is instantiated as an observation instance that could flow.</p>",
        "id": 271904240,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1644881051
    },
    {
        "content": "<p>Since we seem to have agreement on the scope (i.e., systems need to support some way to communicate sets of responses together, as a set), it's worth evaluating proposed technical approaches. Based on conversation with <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> I've updated my doc to start listing trade-offs between \"Observation-focused\" and \"Questionnaire-focused\" approaches to SDOH assessments</p>\n<p><a href=\"https://hackmd.io/@jmandel/sdoh-assessments#Pros-and-cons\">https://hackmd.io/@jmandel/sdoh-assessments#Pros-and-cons</a></p>",
        "id": 272019062,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644950471
    },
    {
        "content": "<p>Thanks Josh, for the updated approaches and trade-offs.  I tend to lean toward option A and for this reason:  I have heard the concern about multiple choice responses and I need more context from experts in the field of SDOH.  I specifically looked at PRAPARE ( <a href=\"https://forms.loinc.org/93025-5\">https://forms.loinc.org/93025-5</a>) and I basically see one survey tool code (93025-5) which has 5 sections: Personal Characteristics (94043-8), Family&amp;Home (93042-0), Money&amp;Resources (93041-2), Social&amp;EmotionalHealth (93040-4), and OptionalAdditionalQuestions (93039-6) - each of these \"sections\" has a number of question components but each of those questions has a single response chosen from a list of normative response options.  So, I see this as an observation.hasMember with each section as an observation.hasMember and the subsequent questions as single observations each with one result.  I don't know that I would consider that a multiple response but a nested set of observations.  IF that is the case, Option A should work well. And the US Core guidance could provide the PRAPARE tool as an example.  I look forward to comments from others.</p>",
        "id": 272028481,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1644954609
    },
    {
        "content": "<blockquote>\n<p>each of those questions has a single response chosen from a list of normative response options.</p>\n</blockquote>\n<p>Ah --- the problem you're seeing is just the result of a bug in the LOINC definitions. (See <a href=\"#narrow/stream/233957-Gravity-sdoh-cc/topic/LOINC.20PRAPARE.20questionnaire\">my report here</a>.) Once that's fixed, the form demo at <a href=\"https://forms.loinc.org/93025-5\">https://forms.loinc.org/93025-5</a> will show these as \"Check all that apply\"</p>",
        "id": 272030543,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644955479
    },
    {
        "content": "<p>I look these options as to whether we inject US Core at the beginning (pre data extraction) or the end (post data extraction)  ( or both ends) of the data collection chain.  So depending how data is collected and stored will skew your opinion.  Also I noted there is a fair mix of FHIRR5 search concepts in the mix so don't get thrown off by that.</p>",
        "id": 272041173,
        "sender_full_name": "Eric Haas",
        "timestamp": 1644960674
    },
    {
        "content": "<blockquote>\n<p>each of those questions has a single response chosen from a list of normative response options.<br>\n   I see that the issue is a bug in the LOINC display now - there are some that should be \"choose one\" and some questions that allow multiple responses.  I'm wondering if the observation.value can have a cardinality of 0.. * to accommodate the multi select without interfering with the other modeling. (Sorry if this sounds like a naive response, I'm trying to help get to some solution)</p>\n</blockquote>",
        "id": 272121703,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1645021232
    },
    {
        "content": "<p>The QuestionnaireResponse for data entry doesn't preclude the Observations for final output target too.<br>\n(using the observation based data extraction is actually pretty simple to setup)<br>\nHaving this capability could then lower the bar for data capture, could leverage a smart app launch that does the SDOH questionnaires to generate the QR and then extract into the Observations. Happily moving the complexity - and also then use pre-pop to grab any existing data, but still be able to append in any that doesn't already exist.</p>",
        "id": 272122841,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1645021792
    },
    {
        "content": "<p>Agreed; this is akin to (C) in my write-up.</p>",
        "id": 272122991,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645021867
    },
    {
        "content": "<p>for me, I think profiling both and how they work together would be awesome - then be able to leverage both where requried.<br>\nBut on the where does this data end up question - I think that really does belong down in Observations... (and supporting QR if that's where it was originally collected from)</p>",
        "id": 272123048,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1645021900
    },
    {
        "content": "<p>Yup, pretty close to (c)</p>",
        "id": 272123135,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1645021929
    },
    {
        "content": "<p>Both <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span>  and I could demo that stuff working now with some existing systems.</p>",
        "id": 272123189,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1645021957
    },
    {
        "content": "<p>The main question we're looking at right now is how to be judicious with requirements US core while still meeting the policy objectives.</p>",
        "id": 272123358,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645022035
    },
    {
        "content": "<blockquote>\n<p>for me, I think profiling both and how they work together would be awesome - then be able to leverage both where requried.</p>\n</blockquote>\n<p>The SDOH guide has already done this.</p>",
        "id": 272138247,
        "sender_full_name": "Eric Haas",
        "timestamp": 1645028367
    },
    {
        "content": "<p>Based on the Feb 17th Call proposol to include <strong>both</strong> QuestionnaireResponse and Observations to Record and Store Assessments Responses in FHIR, I am drafting a mock up how this would look <a href=\"https://hackmd.io/ObMVJ_ohQu2QsFZMiKYSBg?view\">here</a>.    This is preliminary as I  have only completed some of the technical aritifacts. I will draft the narrative introduction and Quick starts and overall guidance later today.   Based on this, I will update all the assessment related trackers so we can review and vote on them on the thursday call.</p>",
        "id": 273698147,
        "sender_full_name": "Eric Haas",
        "timestamp": 1646163394
    }
]