[
    {
        "content": "<p>For <a href=\"http://build.fhir.org/ig/HL7/US-Core/StructureDefinition-us-core-observation-screening-response.html\">SDOH Screening</a>, Observation.component is <em>NOT</em> tagged as MS, but Observation.component.code is MS.  What does that mean?  The narrative implies that component results are must-support, but if that is true, why is it not flagged with MS?</p>\n<p>Also, do we think Observation.component should be MS?  I get Observation.value, but without knowing what screenings are relevant, how can we know if Observation.component is even necessary?</p>",
        "id": 262373440,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1637612975
    },
    {
        "content": "<blockquote>\n<p>For SDOH Screening, Observation.component is NOT tagged as MS, but Observation.component.code is MS. What does that mean?</p>\n</blockquote>\n<p>I thought we had  guidance on that, but we don't which make me think we don't do that anywhere else, but I need to see if there are any other places we do that.  </p>\n<blockquote>\n<p>Also, do we think Observation.component should be MS? I get Observation.value, but without knowing what screenings are relevant, how can we know if Observation.component is even necessary?</p>\n</blockquote>\n<p>Good question -Need to follow  up on the above question first , but I think it should be so that the use cases handles more complex questions -  we took this profile from the SDOH guide and simplified it a bit.     Then you can make a ballot comment so we can hash it out.</p>",
        "id": 262534615,
        "sender_full_name": "Eric Haas",
        "timestamp": 1637715117
    },
    {
        "content": "<p>I have asked why a backbone element needs to be marked MS. Seems if an element is MS that should be enough, as one can't have that element without the backbone element that it lives within. (similar for summary) -- I don't think MnM has given us good guidance.</p>",
        "id": 262583377,
        "sender_full_name": "John Moehrke",
        "timestamp": 1637758190
    },
    {
        "content": "<p>If a parent isn't marked as MS, the children being MS only comes into play if you choose to support the parent.  (Sort of works like cardinality - a mandatory child is only mandatory if the parent is present.)</p>",
        "id": 262598301,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637765508
    },
    {
        "content": "<p>I found this ticket: <a href=\"https://jira.hl7.org/browse/FHIR-28607\">https://jira.hl7.org/browse/FHIR-28607</a> which states:</p>\n<p>If a child is MS and the parent isn't, then if you support the parent you must support the child, but there's no expectation that you must support the parent.</p>\n<p>But this is still confusing. \"if you support the parent\", what does that mean?</p>",
        "id": 262598557,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1637765616
    },
    {
        "content": "<p>I think this presumes a specific definition of \"support\", which is not defined.</p>",
        "id": 262599781,
        "sender_full_name": "John Moehrke",
        "timestamp": 1637766168
    },
    {
        "content": "<p>I think I do follow the argument that it is much like cardinality, except that is a very different vector.</p>",
        "id": 262599875,
        "sender_full_name": "John Moehrke",
        "timestamp": 1637766237
    },
    {
        "content": "<p>if the element is populated, it does make the backbone element appear... thus, this is what I expected out of MS on an element without egregious MS on the backbone element.</p>",
        "id": 262599995,
        "sender_full_name": "John Moehrke",
        "timestamp": 1637766301
    },
    {
        "content": "<p>if we really must have egregious marking of the backbone elements, then we really need FHIR-Core build and IG builds to warn when this is not the case. (Yes, I have FHIR core resources with this problem)</p>",
        "id": 262600202,
        "sender_full_name": "John Moehrke",
        "timestamp": 1637766411
    },
    {
        "content": "<p>Maybe I've got a deep misunderstanding  but the problem is that marking the parent should be unnecessary.  If you've forced support to a child element, and a parent is a backbone (without a value), then you only care that the child element is supported.  What could Must Support of a backbone element entail?</p>",
        "id": 262605077,
        "sender_full_name": "David Pyke",
        "timestamp": 1637768794
    },
    {
        "content": "<p>There is difference for validation. Assume a server has 100 Observation resources and none of them has Observation.component. When both component and component.code are MS, then we can say that this server fails to demonstrate supporting both element. When only component.code is MS, then we don't know if this server supports component.code or not.</p>",
        "id": 262612334,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1637772027
    },
    {
        "content": "<p>I am willing to follow MnM guidance, but today it is unclear if egregious MS marking of backbone elements is necessary.... similarly if egregious _summary marking of backbone elements is necessary. --- And if egregious marking are necessary, then we really need the build tooling to warn when egregious marking is missing.</p>",
        "id": 262618421,
        "sender_full_name": "John Moehrke",
        "timestamp": 1637774915
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>  I checked and this is the only place in US Core I can find.  So  (ignoring the above  histrionics  ;-)), we will change component to MS and you are free to comment during the ballot.  Thanks for catching this!</p>",
        "id": 262626399,
        "sender_full_name": "Eric Haas",
        "timestamp": 1637779264
    },
    {
        "content": "<p><del>FYI ... it looks like the SDOH guide just pulled component from their screening survey observation. <span aria-label=\"rolling eyes\" class=\"emoji emoji-1f644\" role=\"img\" title=\"rolling eyes\">:rolling_eyes:</span></del></p>",
        "id": 262627149,
        "sender_full_name": "Eric Haas",
        "timestamp": 1637779695
    },
    {
        "content": "<p>Eric, why change component to MS right now? There's no justification for being stricter than Gravity, and there's a reasonable argument that component (support for \"multi-select\" answers) is unnecessary. Why not leave as is, or remove MS from code?</p>",
        "id": 262632275,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1637782711
    },
    {
        "content": "<p>Make a ballot comment.  We are not making any more substantive changes - all qa from now on in.</p>",
        "id": 262634990,
        "sender_full_name": "Eric Haas",
        "timestamp": 1637784433
    },
    {
        "content": "<p>disregard my earlier comments SDOH does have component ... I must have been looking at the wrong version <span aria-label=\"rolling eyes\" class=\"emoji emoji-1f644\" role=\"img\" title=\"rolling eyes\">:rolling_eyes:</span></p>",
        "id": 262635395,
        "sender_full_name": "Eric Haas",
        "timestamp": 1637784722
    },
    {
        "content": "<p>This has happened to me before also on gravity -- I think a few teams were generating guides in the early days before moving to single branch.</p>",
        "id": 262635627,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1637784865
    },
    {
        "content": "<p>Pretend that every implementer creates their own profile that documents exactly what they <em>do</em> and <em>don't</em> support.  If they mark the backbone element as supported (MS=true) and a profile marks children of that backbone element as MS=true, then in order to comply with the profile, they'd <em>also</em> have to mark those elements as MS=true.  On the other hand, if they indicate that they don't support the backbone element, then the MS on the children never comes into play.</p>",
        "id": 262648524,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637793998
    },
    {
        "content": "<p>If an IG wants to force support for children of a backbone element, then they <em>must</em> also force support for the backbone element itself.</p>",
        "id": 262648556,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637794024
    },
    {
        "content": "<p>Fyi - <a href=\"https://jira.hl7.org/browse/FHIR-34384\">https://jira.hl7.org/browse/FHIR-34384</a>; some of the metadata for the issue is incorrect because, I think the package-list.json isn't accurate, because the IG content isn't yet complete b/c the content complete deadline isn't until the end of next week.</p>",
        "id": 262825295,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1637951620
    },
    {
        "content": "<p>We may need a call on this one... <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> and I will chat today and get back to this stream</p>",
        "id": 263018649,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1638197797
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> This is a tough one, we want to align with Gravity and they aren't putting  a MS on Component right now...our options:</p>\n<ol>\n<li>Remove MS on Component, add a section to Conformance Expectations on what it means when children are 'MS'</li>\n<li>Keep MS on Component on down. (current US Core build)</li>\n<li>Remove all MS from Component on down</li>\n</ol>\n<p><span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span>  and <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> - Have you considered the implications of not marking Component MS on the <a href=\"http://hl7.org/fhir/us/sdoh-clinicalcare/StructureDefinition-SDOHCC-ObservationScreeningResponse.html\">SDOHCC Observation Screening Response Profile</a>?</p>",
        "id": 263074259,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1638223690
    },
    {
        "content": "<p>We are happy to revisit this entire profile during ballot - MS and beyond.</p>",
        "id": 263074560,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1638223889
    },
    {
        "content": "<p>we are adding MS to the Component for SDOHCC Observation Screening Response profile in the STU 2 version (Jan 22 ballot)</p>",
        "id": 263168816,
        "sender_full_name": "Robert Dieterle",
        "timestamp": 1638289265
    },
    {
        "content": "<p>Thanks, Bob, <a href=\"http://build.fhir.org/ig/HL7/fhir-sdoh-clinicalcare/StructureDefinition-SDOHCC-ObservationScreeningResponse.html\">this profile</a>, right? (Hasn't been updated yet). Given that Gravity is using <a href=\"http://build.fhir.org/ig/HL7/fhir-sdoh-clinicalcare/mustsupport_and_missing_data.html\">US Core's definition of MS</a>, do you happen to know why systems should be mandated to be capable of recording multiple answers for a screening question in a single Observation?</p>",
        "id": 263173592,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1638291211
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>  - Good point. We discussed at our Gravity IG team meeting today and think it makes sense to add Must Support at  the level of Component, so we'll be doing that in our upcoming spec.</p>",
        "id": 263211761,
        "sender_full_name": "Daniel Vreeman",
        "timestamp": 1638307901
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191864\">Isaac Vetter</span> <a href=\"#narrow/stream/179175-argonaut/topic/Must-support.20on.20child.20properties.20on.20a.20parent.20that.20is.20not.20MS/near/263173592\">said</a>:</p>\n<blockquote>\n<p>Thanks, Bob, <a href=\"http://build.fhir.org/ig/HL7/fhir-sdoh-clinicalcare/StructureDefinition-SDOHCC-ObservationScreeningResponse.html\">this profile</a>, right? (Hasn't been updated yet). Given that Gravity is using <a href=\"http://build.fhir.org/ig/HL7/fhir-sdoh-clinicalcare/mustsupport_and_missing_data.html\">US Core's definition of MS</a>, do you happen to know why systems should be mandated to be capable of recording multiple answers for a screening question in a single Observation?</p>\n</blockquote>\n<p>This is a key question and I hope we get plenty implementation feedback and can land on an answer.</p>",
        "id": 263216679,
        "sender_full_name": "Eric Haas",
        "timestamp": 1638310463
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> - what was the justification why systems should be mandated to be capable of recording multiple answers for a screening question in a single Observation?</p>",
        "id": 263220187,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1638312490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> - The rationale was that many of the \"benchmark\" screening assessments used nationally, like PRAPARE (LN:<a href=\"https://loinc.org/93025-5/\">93025-5 </a>) and the Accountable Health Communities tool (LN:<a href=\"https://loinc.org/96777-8/\">96777-8</a>), have multiselect answers for individual questions. The SDOHCC IG specifically included the example of a PRAPARE question with multiselect (using the Component structure) as an example  for the <a href=\"http://build.fhir.org/ig/HL7/fhir-sdoh-clinicalcare/Observation-SDOHCC-ObservationResponsePRAPAREUnmetNeedsMultiselectExample.html\">SDOHCC Observation Screening Response</a> profile. Multiple answers to a single question is one of the <a href=\"https://www.hl7.org/fhir/observation.html#gr-comp\">identified use cases for the Observation.component structure</a>.</p>",
        "id": 263276017,
        "sender_full_name": "Daniel Vreeman",
        "timestamp": 1638358060
    },
    {
        "content": "<p>It seems like the \"must support\" need for the profiles is really tied to the specific questionnaires/questions.  USCDIv2 doesn't mandate any specific assessments, so while it might be common for folks to use those standard assessments, it seems odd to have requirements a profile that are ultimately independent of USCDIv2 (though I get that US Core isn't <em>just</em> USCDIv2).</p>",
        "id": 263295781,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1638367927
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span>  -  Do we have examples of systems (Servers + Clients) that have tested this approach?</p>",
        "id": 263351092,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1638389507
    },
    {
        "content": "<p>This got minimal discussion time in the US Core design sessions this fall -- we pulled in based on the Gravity design.</p>",
        "id": 263351665,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1638389766
    }
]