[
    {
        "content": "<p>Question about the Encounter.class value set and its extensible binding: <a href=\"https://terminology.hl7.org/2.1.0/ValueSet-v3-ActEncounterCode.html\">https://terminology.hl7.org/2.1.0/ValueSet-v3-ActEncounterCode.html</a>. The concepts seems to have some ambiguity. Should we be interpreting these concepts as defined by clinical criteria rather than billing practices? E.g., \"outpatient\" as defined for US hospital outpatient services is not specifically covered (as distinct from ambulatory), and (2) virtual includes email, telemedicine and robotic procedures. How can we specify / differentiate we want to express telemedicine (not the other choices). From the definition of extensible we can't include a code for telemedicine because it is covered in Virtual - can the value set be expanded and updated.  I look for guidance about how different Encounter \"classes\" are identified and distinguished.</p>",
        "id": 238377677,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1620765249
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 238383163,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620767655
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> ?</p>",
        "id": 238390534,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1620771721
    },
    {
        "content": "<p>I'll give two answers:  one with my standards hat one, one with my implementers hat on:<br>\n[Standards hat]: Because Encounter.class is 1..1, I'd almost think the telemedicine aspect of a visit is orthogonal to the class.  You might have a telemedicine encounter for an \"outpatient\" issue, which is what we often think of.  But you might also be admitted (inpatient) and have a sub-encounter with a specialist that would be virtual.  Which might mean our valueset isn't really great, since VR is in there...</p>\n<p>[Implementers hat]:  Class is kinda a nebulous thing, and having it be 1..1 in the spec means that we (Epic) don't/can't really use it that well.  Because the spec required it, we kinda made up a single thing we could put there, but we put all the useful information we have in Encounter.type.  For anyone that uses Epic, the normal thing you'd see as the \"patient class\" in the EHR will actually show up in Encounter.type.</p>",
        "id": 238541732,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1620852401
    }
]