[
    {
        "content": "<p>Text from 2015 Final Rule says Inhaled oxygen concentration must be exchanged as part of the\u000bCommon Clinical Data Set using a LOINC(r) code and with a UCUM code for the unit of\u000bmeasure.</p>\n<p>Is anybody exchanging this?</p>",
        "id": 153864426,
        "sender_full_name": "Eric Haas",
        "timestamp": 1482273662
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> We would return anything that is charted, so if the result has been recorded, it could be retrieved from FHIR</p>",
        "id": 153864564,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1482330699
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> , as you saw on the OO list, I'm working to figure out how this should be coded. Have you gotten any confirmation that your proposed approach to link two observations with \"qualified by\" is how folks are doing this in FHIR? Any thoughts on how they have aligned a C-CDA tempalte for the same thing?</p>",
        "id": 153864670,
        "sender_full_name": "Robert McClure",
        "timestamp": 1482362549
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>  is tuned into CCDA for this.  I think we are still in discovery</p>",
        "id": 153864672,
        "sender_full_name": "Eric Haas",
        "timestamp": 1482362907
    },
    {
        "content": "<p>would you refernce the fiO2 from the spO2 as part of a vitals observtion.  ( for both clinician and patient)? </p>",
        "id": 153864741,
        "sender_full_name": "Eric Haas",
        "timestamp": 1482389490
    },
    {
        "content": "<p>We haven't had a chance to discuss on SD  </p>",
        "id": 153864836,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1482443661
    },
    {
        "content": "<p>I think that Eric's approach for this makes sense.  If we do want to record/transmit the device and it's settings (which I think we typically don't), then Cecil's comments on the OO list about Device/DeviceMetric also would apply.</p>",
        "id": 153864913,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1482513112
    },
    {
        "content": "<p>To add to <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> 's earlier comment, I don't believe we are using related observations for this currently.  </p>",
        "id": 153865275,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1483454812
    },
    {
        "content": "<p>Has there been any movement on this? We'd like to qualify SpO2 with O2 rate.</p>",
        "id": 153948719,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1522250869
    },
    {
        "content": "<p>No.    Question is whether the community implements this as a separate observations  and if so a stand alone observation or a component or is a code.  If its  a separate observation I would personally think component would be better  ( shifting my view from before ) and if is typically a code  ( O2 at room air, etc ) then use translations on code.     @Brett has CCDA worked this out yet?</p>",
        "id": 153948748,
        "sender_full_name": "Eric Haas",
        "timestamp": 1522255045
    },
    {
        "content": "<p>No, not resolved in C-CDA. Just didn't get enough momentum that both are captured.</p>",
        "id": 153948930,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1522292196
    }
]