[
    {
        "content": "<p>The Standard for Trial Use (STU) update of US Core version 3.1.0 (continuous build) , which is based on FHIR R4, is in the home stretch for a planned publication later this month.</p>\n<p>During the review this week, participants brought forward two additional items for Structured Documents to consider:</p>\n<p>Add HCPCS to US Core Procedure.code value set (<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=24925\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=24925\">GF#24925</a>)<br>\nAdd ICD to US Core Condition.code value set (<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=24924\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=24924\">GF#24924</a>)</p>\n<p>The US Core Condition Profile, and US Core Procedure profile were not in the original proposed scope of the STU update.</p>\n<p>Structured Documents discussed theses updates and approved proceeding with the expansion of scope. A final decision on these trackers will occur on the next Structured Documents call, on 10/17/2019.</p>",
        "id": 177840451,
        "sender_full_name": "Eric Haas",
        "timestamp": 1570732761
    },
    {
        "content": "<p>Does  addition of ICD to Condition include ICD-10 (mandatory) plus ICD-9 for data elements entered prior to Oct 2015 since electronic history goes back to ICD-9?      VSAC oids typically contain SNOMED, ICD-9, ICD-10  for quality measurement.    Procedure codes need to contain SNOMED, CPT,  HCPCS and also recommend HCC codes to cover the essential data elements.   Of course, LOINC and RxNorm  also need to be included in oids for quality measures (but they have already been included in standard)  <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 177864164,
        "sender_full_name": "Peter Muir",
        "timestamp": 1570750577
    },
    {
        "content": "<p>ICD-10-CM</p>",
        "id": 177864986,
        "sender_full_name": "Eric Haas",
        "timestamp": 1570751588
    },
    {
        "content": "<p>and  HCPCS II</p>",
        "id": 177865042,
        "sender_full_name": "Eric Haas",
        "timestamp": 1570751650
    },
    {
        "content": "<p>Obviously needs ICD10 but also needs ICD9 to meed operational needs of clinicians and patients.    C-CDA contains ICD9.   Items recorded by ICD9 are not going to come through to patient record?    If FHIR does not have the capability of pulling previous diagnosis by ICD-9 from record then you are requiring providers to edit medical history of items entered prior to Oct 2015 across the US which would significantly increase clinician burden.  Some quality measures will pull information from more than 10 years ago.  For example CMS124 refers to an VSAC oid that contains ICD-9 that cover conditions that may have occurred 20 years ago and have been entered 10 years ago.   According to the 80:20 rule, if FHIR can not meet an 80 need ....</p>",
        "id": 177866852,
        "sender_full_name": "Peter Muir",
        "timestamp": 1570753631
    },
    {
        "content": "<p>80:20 rule relates to resource design and when to include content. It doesn't apply to terminology selection in IGs. Sounds like ICD-9 should be legal too.</p>",
        "id": 177870778,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570758597
    },
    {
        "content": "<p>regs say ICD-10 for encounter diagnosis</p>\n<p>...the same argument could be had for SNOMED RT and READ everywhere we have SNOMED CT.</p>",
        "id": 177876258,
        "sender_full_name": "Eric Haas",
        "timestamp": 1570767233
    },
    {
        "content": "<p>what do the regs say about legacy data?<br>\n- don't send it<br>\n- recode it in ICD-10?<br>\n- ... what else?</p>",
        "id": 177879343,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570771777
    },
    {
        "content": "<p>The ability to handle legacy Read coded data would be important if we were in the UK (or probably New Zealand).  And both Read and legacy SNOMED (alphanumeric) coded data should have readily available direct 1 to 1 mappings to SNOMED CT (at least in nearly all cases), if that's needed, which isn't the situation for ICD-9-CM or ICD-10-CM to SNOMED CT.</p>",
        "id": 177880997,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1570774347
    },
    {
        "content": "<p>The tracker title 'Add ICD to US Core Condition.code value set.' was intentional to see what discussion it generated. I see no problem adding both ICD-9 and ICD-10...</p>",
        "id": 177900541,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1570795445
    },
    {
        "content": "<p>Although since I am standards developer I can argue with myself -- we want to point people to use SNOMED CT and ICD-10. Systems likely won't be forced to certify on ICD-9 so no need to include....and since no validator exists  to properly test the 'extensible' binding (that I am aware of) folks will just send ICD-9 when that's all  they have and not get dinged.</p>",
        "id": 177900937,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1570795885
    },
    {
        "content": "<p>Maybe a compromise is to include ICD-9 and state 'for historical data only'</p>",
        "id": 177900948,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1570795899
    },
    {
        "content": "<p>also not testable without providing new test data <span aria-label=\"yum\" class=\"emoji emoji-1f60b\" role=\"img\" title=\"yum\">:yum:</span></p>",
        "id": 177901015,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1570795944
    },
    {
        "content": "<p>Might be best to qualify 'historical' with \"coded before year X\", to avoid those trying to find a loophole by saying that 10 seconds ago is technically historical...</p>",
        "id": 177912925,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570804724
    },
    {
        "content": "<p>This came separately from Avinash at ONC:</p>\n<blockquote>\n<p>During the 2015 Edition ONC Certification, ONC had requested feedback from the stakeholders, and the recommendation was to use ICD-10 rather than ICD-9.  Here’s the link to the relevant discussion at the time:<br>\n<a href=\"https://www.federalregister.gov/d/2012-20982/p-265\" target=\"_blank\" title=\"https://www.federalregister.gov/d/2012-20982/p-265\">https://www.federalregister.gov/d/2012-20982/p-265</a></p>\n</blockquote>\n<p>So it sounds like his position is that we don't need to include ICD-9-CM here (although I'm still not entirely sure of the rationale for that conclusion when dealing with historical data).</p>",
        "id": 177921337,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1570809506
    },
    {
        "content": "<p>that depends on what you think 'use' means</p>",
        "id": 177925295,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570812139
    },
    {
        "content": "<p>Is there really no translation between 9 and 10?</p>",
        "id": 177932365,
        "sender_full_name": "Eric Haas",
        "timestamp": 1570816967
    },
    {
        "content": "<p>What part of standard coding system am I missing.</p>",
        "id": 177932447,
        "sender_full_name": "Eric Haas",
        "timestamp": 1570817038
    },
    {
        "content": "<p>They're really totally different code systems</p>",
        "id": 177933849,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570817877
    },
    {
        "content": "<p>That doesn't mean there aren't mappings, but the mappings definitely aren't exact.  ICD10 is more granular in lots of places</p>",
        "id": 177933936,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570817913
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  ICD 10 is 4x as large as ICD 9</p>",
        "id": 177934457,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1570818224
    },
    {
        "content": "<p>And the easiest example as to why it's not easy to do 1:1 is the concept of giving info like \"Struck by orca, first encounter\"</p>",
        "id": 177934554,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1570818263
    },
    {
        "content": "<p>much more specific than what ICD 9 often had contained in the actual code</p>",
        "id": 177934590,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1570818285
    },
    {
        "content": "<p>In ICD9 this would have been \"Other specified injury caused by animal\"</p>",
        "id": 177934689,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1570818356
    },
    {
        "content": "<p>if it even got that specific, I guess :)</p>",
        "id": 177934797,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1570818399
    },
    {
        "content": "<p>it's that second encounter with the orca that you really have to worry about :)</p>",
        "id": 177934866,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1570818450
    },
    {
        "content": "<p>There really are some awesome ICD 10 codes</p>",
        "id": 177935022,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1570818515
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  Avinash sent link which dates back to 2012 and was looking forward to ICD-10 transition in Oct 2015.<br>\nBottom line is that FHIR should be able to pass all code systems contained in VSAC oids (ICD-10, ICD-9 and SNOMED for condition/diagnosis and CPT, HCPCS and SNOMED for procedure).   LOINC and RxNorm are also found in VSAC but they are already included as code systems.    Clinical and payer systems would be ICD-10 and CPT/HCPCS since 10/2015 (but still have  pertinent ICD-9  data from before that).    The spec should include code system and code value for a resource similar to how CQL manages VSAC oids.  <br>\nClinical systems  must deal with patient information going back in time.    Cross-mapping between coding systems is extremely difficult and usually gets dropped on the shoulders of clinicians.   If code system and value are passed, then comparing to data sets such as the VSAC oids are the way to go for CQM, CDS, etc.<br>\nps  my personal favorite for ICD-10 was      V97.33XD: Sucked into jet engine, subsequent encounter.</p>",
        "id": 177946765,
        "sender_full_name": "Peter Muir",
        "timestamp": 1570826195
    },
    {
        "content": "<p>On a Da Vinci call today, we learned that there are HCPCS codes for medications too - and those don't necessarily have clean mappings to RxNorm.  It's possible that more generic (ingredient-level) mappings + HCPCS translations will meet the need, but more investigation is required.  Not something we can (or probably should) try to fix in this next release, just  a note that there will probably be additional adjustments required after this release is out.</p>",
        "id": 177950582,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570828856
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195980\">@Peter Muir</span> Yeah, that one is definitely a classic!  I'm trying to imagine if anyone has ever used that code, and I'm trying to avoid imagining the situation if they did. :)  I agree with you - but Avinash did seem to be making at least some degree of a counter-argument (my interpretation).  But probably what you have suggested is most likely to cover what is needed.</p>",
        "id": 177950756,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1570828971
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> The most common way that I have used HCPCS codes personally in practice is to document charging for specific medications that were administered in the office - so I didn't even think to mention it specifically.  And I agree that they might not always map easily to RxNorm.  I'm not quite sure what you are thinking that \"more generic (ingredient-level) mappings + HCPCS translations\" would look like.</p>",
        "id": 177951146,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1570829241
    },
    {
        "content": "<p>The door is closed to looking at any more change requests.</p>",
        "id": 177951667,
        "sender_full_name": "Eric Haas",
        "timestamp": 1570829567
    },
    {
        "content": "<p>My understanding is that the HCPCS codes reflect a specific administration dose.  As such they don't necessarily map nicely to the medication strength level of RxNorm.  However, they should theoretically still be expressible at the 'ingredient' level of RxNorm.</p>",
        "id": 177951811,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570829702
    },
    {
        "content": "<p>That's true.  Probably the majority of the time the medication being administered will be from a standard unit dose vial, and when that is the case there likely would be a clean map to RxNorm.  But I agree that is not always the case.  When it isn't, certainly the ingredient level at least should work, as you say.</p>",
        "id": 177952238,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1570830025
    },
    {
        "content": "<p>Avinash and I had further communications to clarify<br>\nAlso Clem McDonald @NLM.<br>\nCQI added comment<br>\n  /pm</p>",
        "id": 177952630,
        "sender_full_name": "Peter Muir",
        "timestamp": 1570830419
    },
    {
        "content": "<p>.. and?</p>",
        "id": 177961568,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570839941
    },
    {
        "content": "<blockquote>\n<p>.. and?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  It was just <span class=\"user-mention\" data-user-id=\"195980\">@Peter Muir</span> explaining some of the reasons why historical data was needed for some of the quality measure calculations.  Nothing pertinent to bring to this thread.</p>",
        "id": 178210471,
        "sender_full_name": "Avinash Shanbhag",
        "timestamp": 1571157091
    },
    {
        "content": "<p>well, he said he had further communications, but nothing about what came out  of them.</p>",
        "id": 178213217,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571159029
    }
]