[
    {
        "content": "<p>I understand that a clinical notes must have five DocumentReference. I am confused about the requirement for the three DiagnosticReports (Cardiology, Pathology, and Radiology) mentioned in US Core Clinical Notes Guidelines. There are four places related to these three reports:<br>\n1) In <a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html#clinical-notes\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html#clinical-notes\">https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html#clinical-notes</a>, it says that \"three DiagnosticReport categories which systems <strong><em>should</em></strong> support\"<br>\n2) In the same section, next paragraph says \"They represent the <strong><em>minimum</em></strong> set a system must support to claim conformance to this guide\"<br>\n3) In <a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html#support-requirements\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html#support-requirements\">https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html#support-requirements</a>, it says that \"This guide requires systems ... to support a <strong><em>minimum</em></strong> of the three report categories\"<br>\n4) In <a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-diagnosticreport-note.html#mandatory-and-must-support-data-elements\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-diagnosticreport-note.html#mandatory-and-must-support-data-elements\">https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-diagnosticreport-note.html#mandatory-and-must-support-data-elements</a>, it says that \"The DiagnosticReport.category binding must support at a <strong><em>minimum</em></strong> the US Core DiagnosticReport Category Codes of Cardiology, Radiology, and Pathology. Other categories may be supported.\"<br>\nMy understanding is the first one (with wording <strong>should</strong>) contradicts with the other three (with the wording <strong>minimum</strong>).<br>\nWhich one is correct? Is a US Core clinical notes required/mandatory to have these three reports or not?<br>\n<span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <br>\nThanks</p>",
        "id": 185265150,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1578610193
    },
    {
        "content": "<p>Thank you Yunwei for pointing out the inconsistency. The guidance on the profile page is the <em>final</em> word. Systems must support those three categories.</p>",
        "id": 185321118,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1578670999
    },
    {
        "content": "<p>Do you need to JIRA ticket to fix that?</p>",
        "id": 185328553,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1578675296
    },
    {
        "content": "<p>please</p>",
        "id": 185347400,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1578687607
    },
    {
        "content": "<p>Another question. Section <a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html#fhir-resources-to-exchange-clinical-notes]\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html#fhir-resources-to-exchange-clinical-notes]\">2.2.1.2</a> \"In order to enable consistent access to scanned narrative-only clinical reports the Argonaut Clinical Note Server SHALL expose these reports through both DiagnosticReport and DocumentReference by representing the same attachment url using the corresponding elements listed below.\" </p>\n<ol>\n<li>Does the SHALL apply to \"scanned narrative-only clinical reports\" ONLY?</li>\n<li>If yes, how do I know if the attachment is a \"scanned narrative-only clinical reports\". Assume it is a PDF, there are still generated PDF vs scanned PDF.</li>\n</ol>",
        "id": 185938664,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1579282362
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 185938805,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1579282454
    },
    {
        "content": "<p>ALL notes are accessible through DocumentReference.  Ideally, Imaging/Cardiology/Lab/etc. are available through DiagnosticReport. The issues is not all systems categorize their scanned reports as 'Imaging' -- they just get marked as scanned note</p>",
        "id": 186183579,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1579614402
    },
    {
        "content": "<p>So I cannot say the an attachment must be cross referenced by both DocumentReference and DiagnosticReport. Is that correct?</p>",
        "id": 186193127,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1579620161
    },
    {
        "content": "<p>All DiagnosticReports can be Cross referenced by Document Reference.</p>",
        "id": 186211710,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1579631190
    },
    {
        "content": "<p>Not all DocumentReference can be cross referenced by DiagnosticReport since some DocumentReferences point to notes that are not DiagnosticReports!</p>",
        "id": 186211782,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1579631240
    },
    {
        "content": "<p>You mean all \"attachments\" in DiagnosticReport. Right?<br>\nthen, should that statement in 2.2.1.2 be clarified in IG?</p>",
        "id": 186211912,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1579631310
    },
    {
        "content": "<p>Please let me know how you want us to improve this text :\"For example, when DiagnosticReport.presentedForm.url references a Scan (PDF), that Attachment SHALL also be accessible through DocumentReference.content.attachment.url.(See Figure 2) This guide requires servers implement the duplicate reference to allow a client to find a Pathology report, or other Diagnostic Reports, in either Resource. If servers properly categorized scanned reports and used the correct resource per report type (e.g. Pathology scan in DiagnosticReport) this wouldn’t be required.\"</p>",
        "id": 186212084,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1579631402
    },
    {
        "content": "<p>No, a DocumentReference.content.attachment.url can point at a DiagnosticReport.   given that the element in DocumentReference is simply a URL, it can point at FHIR resources or anything else.  Hence DocumentReference can index anything. -- Note that \"Document\" in the context of DocumentReference is the broader definition of \"Document\" as defined in http standard, not limited to CDA like documents.</p>",
        "id": 186212188,
        "sender_full_name": "John Moehrke",
        "timestamp": 1579631454
    },
    {
        "content": "<p>so, is it only attachmets? that are common, or is the relationship a hierarchy (DocumentRefernece -&gt; Binary or DiagnosticReport; where DiagnosticReport may point at another Binary?)</p>",
        "id": 186212447,
        "sender_full_name": "John Moehrke",
        "timestamp": 1579631589
    },
    {
        "content": "<p>simple diagram may be better than words</p>",
        "id": 186212476,
        "sender_full_name": "John Moehrke",
        "timestamp": 1579631614
    },
    {
        "content": "<p>agree - seee <a href=\"/user_uploads/10155/qJZNKESr_zvuMHfdF28dHi0P/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/qJZNKESr_zvuMHfdF28dHi0P/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/qJZNKESr_zvuMHfdF28dHi0P/pasted_image.png\"></a></div>",
        "id": 186212504,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1579631633
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/ijiXW4wqm59wbcqEnyuFJPmk/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/ijiXW4wqm59wbcqEnyuFJPmk/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/ijiXW4wqm59wbcqEnyuFJPmk/pasted_image.png\"></a></div>",
        "id": 186212579,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1579631654
    },
    {
        "content": "<p><a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html#fhir-resources-to-exchange-clinical-notes]\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html#fhir-resources-to-exchange-clinical-notes]\">https://build.fhir.org/ig/HL7/US-Core-R4/clinical-notes-guidance.html#fhir-resources-to-exchange-clinical-notes]</a></p>",
        "id": 186212585,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1579631658
    },
    {
        "content": "<p>My confusion is on the paragraph above this, esp the \"scanned narrative-only clinical notes\". For example, is an x-ray report with images \"narrative-only\"?</p>",
        "id": 186213592,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1579632294
    },
    {
        "content": "<p>On the US Core Diagnostic Report and Note page (<a href=\"http://hl7.org/fhir/us/core/STU3.1.1/StructureDefinition-us-core-diagnosticreport-note.html\">http://hl7.org/fhir/us/core/STU3.1.1/StructureDefinition-us-core-diagnosticreport-note.html</a>) is a link and description of the Diagnostic Report Category (extensible).  A similar concept with different categories is also on the Laboratory variant of DiagnosticReport.  If I select to look at the list of category codes , a new page opens <a href=\"http://hl7.org/fhir/us/core/STU3.1.1/ValueSet-us-core-diagnosticreport-category.html\">http://hl7.org/fhir/us/core/STU3.1.1/ValueSet-us-core-diagnosticreport-category.html</a>.  On this page are three codes identified as LOINC Code   Display<br>\nLP29684-5   Radiology<br>\nLP29708-2   Cardiology<br>\nLP7839-6    Pathology<br>\nIf I click on the link for each code, I get a loinc error page indicating that the link is bad.  If I search in LOINC for these codes, I also am unable to find them.  So at the very least, the US Core FHir page should be corrected to have working links.  I am looking at the latest version.  At a different level, it is not clear at all whether the category should be just that- a category that could include many different types of Radiology, Cardiology, and Pathology reports or if it has some other meaning.  In main FHIR this maps to a Diagnostic Service Section which is an easily relatable concept.  I am guessing that the US Core didn't want the local codes that are allowed in the Diagnostic Service Section list so instead they imposed a rule that everything has to be categorized in one of these three codes.  So- two questions:  Can the links be fixed so that the codes  can be seen in LOINC ?  Can there be a better description in US Core to make it clear that multiple Diagnostic Service Sections codes can and should be mapping to the three examples presented - for example the HL7 table 0074 Diagnostic Service section code for CT could map to this LP29682-5 Radiology code?  note that the US core document cites Loinc 2.68 but Loinc is now at 2.69.</p>",
        "id": 236759137,
        "sender_full_name": "Ruth berge",
        "timestamp": 1619736593
    },
    {
        "content": "<blockquote>\n<p>Can the links be fixed so that the codes can be seen in LOINC ? </p>\n</blockquote>\n<p>the bad loinc links was a known issue and fixed for the <a href=\"file:///Users/ehaas/Documents/FHIR/US-Core-R4/output/clinical-notes-guidance.html#clinical-notes\">next version</a></p>",
        "id": 236763028,
        "sender_full_name": "Eric Haas",
        "timestamp": 1619738985
    },
    {
        "content": "<blockquote>\n<p>US core document cites Loinc 2.68 but Loinc is now at 2.69.</p>\n</blockquote>\n<p>Can you clarify where you saw the version of LOINC referenced ?  I did a search and did not find it.  We rely on the ig-publisher terminology server to update the code systems to the latest versions.  perhaps this is on their todo list.</p>",
        "id": 236763411,
        "sender_full_name": "Eric Haas",
        "timestamp": 1619739236
    },
    {
        "content": "<blockquote>\n<p>Can there be a better description in US Core to make it clear that multiple Diagnostic Service Sections codes can and should be mapping to the three examples presented - for example the HL7 table 0074 Diagnostic Service section code for CT could map to this LP29682-5 Radiology code? </p>\n</blockquote>\n<p>US Core documents the <em>minimum</em> requirements, so implementers can use as many categories schemes as they want because the cardinality of the element is 0..* and the binding is extensible.</p>\n<p>Whether categories codes <em>should</em> be mapped to the example binding of  Diagnostic Service Section Codes is an opinion and has not been raised the implementers before.</p>",
        "id": 236764081,
        "sender_full_name": "Eric Haas",
        "timestamp": 1619739777
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <a href=\"/user_uploads/10155/vPgB8UkvUKF31uCv5OyQjdiq/Screen-Shot-2021-04-30-at-9.16.42-AM.png\">Screen-Shot-2021-04-30-at-9.16.42-AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/vPgB8UkvUKF31uCv5OyQjdiq/Screen-Shot-2021-04-30-at-9.16.42-AM.png\" title=\"Screen-Shot-2021-04-30-at-9.16.42-AM.png\"><img src=\"/user_uploads/10155/vPgB8UkvUKF31uCv5OyQjdiq/Screen-Shot-2021-04-30-at-9.16.42-AM.png\"></a></div>",
        "id": 236863401,
        "sender_full_name": "Ruth berge",
        "timestamp": 1619800353
    },
    {
        "content": "<p>yes the screenshot show the valueset expansion which is based on the common ig-publisher's terminology server.  I don't know the update policy for LOINC but maybe <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  does.</p>",
        "id": 236871964,
        "sender_full_name": "Eric Haas",
        "timestamp": 1619803777
    },
    {
        "content": "<p>A follow up question is... given that these are examples , how would I find other codes that can meet the criteria set out by US Core as to what comprises a default scheme?  LP means these are Loinc Parts I think but not finding them in the base lookups in LOINC.  Perhaps I have to download and use RELMA?  Would it be possible for US Core the explain this rather than just throwing a non-working example?  That would help implementers to understand and find alternatives.</p>",
        "id": 236876546,
        "sender_full_name": "Ruth berge",
        "timestamp": 1619805632
    },
    {
        "content": "<p>What do you mean by a non working example?</p>",
        "id": 236905781,
        "sender_full_name": "Eric Haas",
        "timestamp": 1619817800
    },
    {
        "content": "<p>Hi, what I mean is that the examples provided don't link.  An explanation of the logic behind choosing the LP types would at least provide the background information about what we should look for in LOINC to find similar codes that could properly extend the category, per the authors of US Core.  What is the criteria that distinguishes the Loinc codes used for the category?  Aside from that is the separate issue that FHIR probably would not address that searching for these in Loinc is different.  I did find a way to retrieve the descriptions from the API but still not understanding  how I could find an appropriate category to match many of the codes in OBR-24.  I'm just looking for a deeper explanation of what the authors of US Core are expecting to find in the category.  Thanks.</p>",
        "id": 236937510,
        "sender_full_name": "Ruth berge",
        "timestamp": 1619844525
    },
    {
        "content": "<p>During US Core/Argonaut Clinical Note design we learned clinical systems have developed custom note types. Exactly what site specific concepts will mapped to these LP will unfortunately vary by deployment. I do believe over time LOINC will be able to provide exactly which LOINC codes match up with each LP, and then clinical systems will be able to use these to guide their mappings.</p>",
        "id": 237166135,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1620050977
    },
    {
        "content": "<blockquote>\n<p>Hi, what I mean is that the examples provided don't link. </p>\n</blockquote>\n<p>examples provided don't link to what exactly?  - can you clarify  and provide a screen shot or a specific reference to what is not linking in the examples so we can fix it if it is a broken link?</p>",
        "id": 237185605,
        "sender_full_name": "Eric Haas",
        "timestamp": 1620057857
    }
]