[
    {
        "content": "<p>Could someone point me to information on how we should be storing risk adjustment / HCC codes in US Core? My company is working on becoming a Medicare Direct Contractor -- we will need to start documenting HCC codes. I'm unsure if this should be stored as a code in the Condition resource, of if there is another resource (claims?) where we should be storing these?</p>",
        "id": 250058635,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1629413434
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191924\">@Linda</span> ? Isn’t this a DaVinci thing that your are involved with?</p>",
        "id": 250062743,
        "sender_full_name": "Eric Haas",
        "timestamp": 1629417075
    },
    {
        "content": "<p>Da VInci has a group working on Risk Adjustment.  Our first focus is on the Risk Adjustment Coding Gap Report going from payer to provider.  For that we are using the MeasureReport Resource and the code under Group is where we represent the HCC code.  Use case link - <a href=\"https://confluence.hl7.org/display/DVP/Risk+Adjustment\">https://confluence.hl7.org/display/DVP/Risk+Adjustment</a> and the RA Implementation Guide in development , <a href=\"https://build.fhir.org/ig/HL7/davinci-ra/index.html\">https://build.fhir.org/ig/HL7/davinci-ra/index.html</a></p>\n<p>I think <span class=\"user-mention\" data-user-id=\"408229\">@Daniel Tam</span> question is slightly different.  Since it is a Hierarchical Condition Code, I can see the logic to representing it as a Condition but there is not a code system for them yet.  We are discussing that.  Daniel you can find the info for our calls on Thursday if that interests you<br>\n<span class=\"user-mention\" data-user-id=\"192119\">@Yan Heras</span></p>",
        "id": 250068952,
        "sender_full_name": "Linda",
        "timestamp": 1629424051
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191924\">@Linda</span>  and <span class=\"user-mention\" data-user-id=\"192119\">@Yan Heras</span>  , Thanks for this info! Very helpful. You are correct; I am less interested in the coding gap report going from payer to provider, and am more interested in how we should be documenting HCC's for the purpose of direct contracting with CMS. Especially interesting to me is that documentation needs to be updated annually for the risk adjustment payments to continue. </p>\n<p>I am definitely interested and will start hopping onto your calls to learn more.</p>",
        "id": 250181735,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1629500256
    }
]