[
    {
        "content": "<p>Based on our recent discussions, I've roughed out a new OperationDefinintion for appointment availability search here: <a href=\"https://simplifier.net/Scheduling/Appointment-availability2\" target=\"_blank\" title=\"https://simplifier.net/Scheduling/Appointment-availability2\">https://simplifier.net/Scheduling/Appointment-availability2</a></p>",
        "id": 153893022,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1496960537
    },
    {
        "content": "<p>does it make sense to add a parameter to ask the server to choose the first/best available as an option for the client? </p>",
        "id": 153893024,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496962604
    },
    {
        "content": "<p>I think that an array of proposal : Appointment is better than a bundle</p>",
        "id": 153893025,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496962640
    },
    {
        "content": "<p>(syntactical point only)</p>",
        "id": 153893026,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496962649
    },
    {
        "content": "<p>does it make sense for a server to be able to return a recommendation for another service if there's no available appointments?</p>",
        "id": 153893027,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496962684
    },
    {
        "content": "<p>and I think that the definition of the operation should be in the main specification, though I expect Argonaut to profile it. Yes?</p>",
        "id": 153893028,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496962712
    },
    {
        "content": "<p>What does \"array of proposal : Appointment\" mean.  BTW my idea is to return a bundle of  intent = \"proposed\" pre-filled appt resources.  the user picks one and then the app changes \"proposed\" to \"ordered\" and returns appt (as a second operation? or an update?) to server which confirms.</p>",
        "id": 153893036,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496964461
    },
    {
        "content": "<p>Well I think Argo should bang on the operation a bit. don't care where it goes.  Re profiling an operation.  I expect will profile the Appt resource going in to define the bare minimums per use case.   Never profiled an operationDef before is that technically similar to profiling an SD?</p>",
        "id": 153893038,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496964714
    },
    {
        "content": "<p>well, the operation as proposed returns a bundle of appointments, like a search, but with a separate operationoutcome. it would be better, I think, to use parameters directly, a list of appointments, rather than putting them inside a bundle</p>",
        "id": 153893045,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496969328
    },
    {
        "content": "<p>K thanks.</p>",
        "id": 153893056,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496973136
    },
    {
        "content": "<p>FYI - I got this feedback from some folks who work with ZocDoc.  This confirms ourguess that they do indeed pre-fetch availability:  </p>\n<p>What we've seen in the wild for organizations who use ZocDoc is that they aggressively prefetch slots.  Initially they were fetching slots for all doctors every 10 minutes, but we had to tune that in order to reduce the load on our servers.  But their preference is to build their own cache of slots. </p>",
        "id": 153893108,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1497015498
    },
    {
        "content": "<p><a href=\"https://github.com/argonautproject/scheduling/blob/master/meeting-notes/scenario2a-r2.sequence.png\" target=\"_blank\" title=\"https://github.com/argonautproject/scheduling/blob/master/meeting-notes/scenario2a-r2.sequence.png\">Here</a> is an updated Interaction Diagram for the Pre-fetching work-flow</p>\n<div class=\"message_inline_image\"><a href=\"https://github.com/argonautproject/scheduling/blob/master/meeting-notes/scenario2a-r2.sequence.png\" target=\"_blank\" title=\"Here\"><img src=\"https://github.com/argonautproject/scheduling/blob/master/meeting-notes/scenario2a-r2.sequence.png\"></a></div>",
        "id": 153893186,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497060642
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>  @<strong>Brian Postlethwaite (new)</strong> What is the benefit of Parameter over a Bundle?  </p>",
        "id": 153893827,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497465745
    },
    {
        "content": "<p>there's 2 benefits. I think: it's syntactically simpler, and allows you to indicate the reason for including a resource</p>",
        "id": 153893834,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497468725
    },
    {
        "content": "<p>I prefer the bundle as it then gives you the paging constructs if needed. the simple parameters can't do that.</p>",
        "id": 153893905,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1497481287
    },
    {
        "content": "<p>Especially if the potential list of appointments could be large, let the client choose.</p>",
        "id": 153893906,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1497481327
    },
    {
        "content": "<p>then the way the operation is defined, the only output should be the bundle, and there'll never be an option for a more refined response than 'here's the list of possible appointments' </p>",
        "id": 153893911,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497481927
    },
    {
        "content": "<p>The only output is a Bundle or an OperationOutput right?  On our call today we decided that using Appointment as an input parameter was not appropriate and went back to plan A.  I'm updating Coopers DSTU operation to STU3 and adding some more details.  I don't have a dog in this hunt on Bundle vs Parameters but brought it up today for folks to consider.  Also is this operation indempotent?  I'm guessing yes....</p>",
        "id": 153893926,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497490239
    },
    {
        "content": "<p>plan A = listing the multiple inputs as parameters</p>",
        "id": 153893927,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497490278
    },
    {
        "content": "<p>I proposed a parameter to ask the server to just make the appointment. That wouldn't be idempotent</p>",
        "id": 153893943,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497491082
    },
    {
        "content": "<p>otherwise it is. </p>",
        "id": 153893944,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497491088
    },
    {
        "content": "<p>if it's just a smart query with paging, then only document output is a Bundle, which a note that it's the same as a search bundle </p>",
        "id": 153893945,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497491120
    },
    {
        "content": "<p>I will bring up your proposals on the call  ( ran out of time yesterday ). </p>",
        "id": 153894003,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497537718
    },
    {
        "content": "<p>I don't think we're proposing that this makes the actual appointment - I think it returens all options the user could choose from. Even if there is only one, I think we would want confirmation before creating it.</p>",
        "id": 153894019,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1497552346
    },
    {
        "content": "<p>i'm happy if you want not to auto-create an actual appointment, and in lots of cases that makes sense. but I've seen other protocols - particularly within institutions, where that is the practice. So I think it's int the space of the operation definition even if it's not in the argonaut space</p>",
        "id": 153894068,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497562415
    },
    {
        "content": "<p>\"The operation\" meaning a separate operation or the same one we are working on.   Scheduling the next available for a client automatically seems like a great idea - but what percentages of patients/client will need to reschedule or cancel ? </p>",
        "id": 153894069,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497562781
    },
    {
        "content": "<p>vs the baseline?</p>",
        "id": 153894077,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497563901
    },
    {
        "content": "<p>depends on the business rules. Like I said, it's usually with in an institution where needing to reschedule is rare (patients don't get to have a life). In the outpatient/ambulatory context (argonaut context) it doesn't make sense</p>",
        "id": 153894078,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497563970
    },
    {
        "content": "<p>Draft <a href=\"file:///Users/ehaas/Documents/FHIR/Argo-Scheduling/output/operations.html\" target=\"_blank\" title=\"file:///Users/ehaas/Documents/FHIR/Argo-Scheduling/output/operations.html\">updated R3 appointment$find</a> </p>",
        "id": 153894579,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497983472
    },
    {
        "content": "<p>Spoke with ShareCare and ZocDoc yesterday.   One thing that we the Argo scheduling team didn't discuss was whether we need some sort of 'configuration transaction'  so the app can retrieve data to perform there own logic for schedule availability.   in other words, providing them with enough information to screen suitable patients for a given appointment.   I feel that this is in scope or at the very least we need to document it.  Also,  this kind of relates to the slides that @<strong>Brian Postlethwaite (new)</strong> shared.</p>",
        "id": 153894580,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497984007
    },
    {
        "content": "<p>Also after creating a couple of examples for the Appointment$find  discovered/created a bunch of  <a href=\"https://github.com/argonautproject/scheduling/issues/6\" target=\"_blank\" title=\"https://github.com/argonautproject/scheduling/issues/6\">issues</a> for the operation.</p>",
        "id": 153894835,
        "sender_full_name": "Eric Haas",
        "timestamp": 1498075230
    },
    {
        "content": "<p>discussion about Appt  Availability and indicating preferences  ( e.g.,  My first choice is this time period,  my second is this time period)  using OperationDefinition could we indicate preference using an input parameter 'preference' of type integer  with a nested  parameter = appt template? </p>",
        "id": 153895473,
        "sender_full_name": "Eric Haas",
        "timestamp": 1498669492
    },
    {
        "content": "<p>I know I gave my example as preferred, but I'm not sure if we need to consider that immediately. However, still worth figuring out how to represent something like that/if it's currently possible</p>",
        "id": 153895474,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1498670282
    },
    {
        "content": "<p>I was trying to make sure we could handle \"OR\" and \"AND\" with the model being proposed</p>",
        "id": 153895475,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1498670308
    },
    {
        "content": "<p>I'm not sure that we have clarified the OR and AND when it come to the inputs.</p>\n<p>My Assumptions:</p>\n<ul>\n<li>\\&gt;1  requested times is an OR</li>\n<li>\\&gt;1 Specialties or Providers or Services is unclear</li>\n<li>\\&gt;1 locations is an OR</li>\n</ul>\n<p>(logged as an issue)   We will be talking about a SPRINT on today's call to help discover and flesh out these issues.</p>",
        "id": 153895482,
        "sender_full_name": "Eric Haas",
        "timestamp": 1498671058
    },
    {
        "content": "<p>The order of the time ranges listed could have a meaning. Then don't need flags.<br>\nThere is no mention that they should be sequential</p>",
        "id": 153895980,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1499138600
    },
    {
        "content": "<p>Hi all, we will potentially join this project. Why availability is represented as Appointment operation, why not Slot?</p>",
        "id": 153904904,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1504824556
    },
    {
        "content": "<p>Since there may be codependencies of several slots for multiple physical assets for a single appointment,  it doesn't sense to share them with the client and instead aggregate it into a set of avaialable Appointments.  The Server deals with the slots in the backgrounds.</p>",
        "id": 153904914,
        "sender_full_name": "Eric Haas",
        "timestamp": 1504832572
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  Could you share more details and may be some examples / real cases  about this?</p>",
        "id": 153905027,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1504896232
    },
    {
        "content": "<p>I think, i've got it - slot is just free/busy time for specific resource or actor.  An appointment could be related to many  actors and these relations could be very specific  - that's why you  provide vendor/case specific operation $find for that.</p>",
        "id": 153905041,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1504904607
    }
]