[
    {
        "content": "<p>Hi- I'm working a data collection use case for public health. To avoid double data entry, we want to collect telephone interview data using the Questionnaire Response (QR) Resource and flow data to state dept. public health and also to hospital EHR. We can control the state DPH, but I want to know if/how Argonaut allows SMART data flows into EHR systems, e.g., can I upload a QR resource? What about an observation resource with patient-reported blood pressure? Any help wonderful :) </p>",
        "id": 153844556,
        "sender_full_name": "Fred Sieling",
        "timestamp": 1471800394
    },
    {
        "content": "<p>Do you have any drafts of the questionnaire(s) that you are going to be using?<br>\n(I'd like to try it out with our SmartQ renderer)</p>",
        "id": 153844564,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1471823105
    },
    {
        "content": "<p>No draft yet. We are firming up our use case. Likely will be a couple months before we go ahead and write up the questionnaire. I can share at that point :)</p>",
        "id": 153844670,
        "sender_full_name": "Fred Sieling",
        "timestamp": 1471893814
    },
    {
        "content": "<p>We have not looked at the Questionniare resource in Argo or how to update or create resources in EHRs.  Only use case is provider and patient access to EHR data.    <br>\nThat said what is your specific use case?  I am interested in rationale for using Questionnaire vs Resources/Profiles for PH surveillance and reporting purposes.</p>",
        "id": 153844830,
        "sender_full_name": "Eric Haas",
        "timestamp": 1471990830
    },
    {
        "content": "<p>OK. Thanks for your response :) In brief, we are collecting post-discharge data via telephone interview. In one question, we ask if the patient has taken their blood pressure and then ask for the measurements. I understand it's incorrect to create an observation resource to contain the patient-reported blood pressure because the measurements were not observed directly. One way to faithfully record the concept is using the Questionnaire and Questionnaire Response resources, where we can explicitly capture the questions and answers. I'm not sure the best approach to enable the hospital EHR system to see this data going forward. More complete information found on the FHIR resources pages:  <a href=\"https://www.hl7.org/fhir/questionnaire.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/questionnaire.html\">https://www.hl7.org/fhir/questionnaire.html</a> and <a href=\"https://www.hl7.org/fhir/questionnaireresponse.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/questionnaireresponse.html\">https://www.hl7.org/fhir/questionnaireresponse.html</a></p>",
        "id": 153844980,
        "sender_full_name": "Fred Sieling",
        "timestamp": 1472061910
    },
    {
        "content": "<p>Can the patient-reported blood pressure be recorded in an observation resource with the patient as the performer?</p>",
        "id": 153845026,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1472080856
    },
    {
        "content": "<p>I moved this conversation to the Implementors stream <a href=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Questionnaire.20v.20Observation\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Questionnaire.20v.20Observation\">here</a>  With my response </p>",
        "id": 153845028,
        "sender_full_name": "Eric Haas",
        "timestamp": 1472081145
    },
    {
        "content": "<p>Cross posted from implementers/Questionnaire v Observation:  <a href=\"https://chat.fhir.org/#narrow/near/35203/stream/implementers/topic/Questionnaire.20v.20Observation\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/near/35203/stream/implementers/topic/Questionnaire.20v.20Observation\">https://chat.fhir.org/#narrow/near/35203/stream/implementers/topic/Questionnaire.20v.20Observation</a></p>\n<p>It leaves open a practical or policy question: in terms of real-world use, which FHIR- or SMART-compliant systems will allow resources (Observation/Encounter/Procedure/Etc.) to flow into their systems and when? My understanding is at this time, no implementers are working on a generic feature to allow data to flow in. Is that fairly stated? </p>",
        "id": 153845839,
        "sender_full_name": "Fred Sieling",
        "timestamp": 1472572144
    },
    {
        "content": "<p>yes, no one is working on that. Some of the argonaut implementers have done specific inwards data flow, for some reasons. And it is a commonly requested feature</p>",
        "id": 153845854,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472588329
    },
    {
        "content": "<p>I think that's accurate: the specifications are clear enough for writing data in a general-purpose way, but most real-world EHR systems aren't going to support such a general write API anytime soon. There are specific places (e.g. adding a new problem to the problem list, or creating a new free-text note) where vendors have built support.</p>",
        "id": 153845873,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1472597371
    },
    {
        "content": "<p>EHR systems do not support generic reads either because they are resulting in internal API/service/db calls + business logic for _each resource_. EHR systems are not treating FHIR resources as simple documents (which is really the only way in which you can support general purpose reads/writes)</p>",
        "id": 153845972,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1472669876
    },
    {
        "content": "<p>I suspect this is a case of being able to crawl before trying to walk, skip, run, sprint, jump, ...    A write API has issues of data Provenance, Authority, versioning, and verification. Also much harder to prevent malicious attack or misuse.  All requiring a very different policy discussion. I would expect, as Josh indicated, there will be a much smaller set of objects open for write, and they will likely go into an 'inbox' to be reviewed by a human before acceptance. Experience will create some automated flows,  like from authorized and well-behaved devices and services.  </p>",
        "id": 153845975,
        "sender_full_name": "John Moehrke",
        "timestamp": 1472670367
    },
    {
        "content": "<p>All-- This helps me put our prototyping activity in context. Thank you for your responses :)  For now, I'll limit my ambition to writing a free-text note with data from Questionnaire Responses. I heard there is already a SMART app that does this and it seems like the lowest common denominator. </p>\n<p>EDIT: maybe the The 'EnrG | Rheum' SMART app? see <a href=\"https://chat.fhir.org/#narrow/near/24132/stream/smart/topic/Smart.20App.20that.20writes.20back.20into.20the.20EHR\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/near/24132/stream/smart/topic/Smart.20App.20that.20writes.20back.20into.20the.20EHR\">https://chat.fhir.org/#narrow/near/24132/stream/smart/topic/Smart.20App.20that.20writes.20back.20into.20the.20EHR</a></p>",
        "id": 153846573,
        "sender_full_name": "Fred Sieling",
        "timestamp": 1473173530
    },
    {
        "content": "<p>Hey sorry I missed lots of this discussion. My team is currently using Questionnaires and observations to file nursing documentation into the EMR (in production)</p>",
        "id": 153846585,
        "sender_full_name": "Mat Coolidge ",
        "timestamp": 1473186437
    },
    {
        "content": "<p>We are using it for compliance purposes for timely documentation requirements</p>",
        "id": 153846586,
        "sender_full_name": "Mat Coolidge ",
        "timestamp": 1473186468
    },
    {
        "content": "<p>We also partially support questionnaire=&gt;response=&gt;observation workflows with another app likely seeking production implementation  by end of year</p>",
        "id": 153846588,
        "sender_full_name": "Mat Coolidge ",
        "timestamp": 1473186513
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153846604,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1473193675
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192431\">@Fred Sieling</span> - Our production FHIR server here at Cerner supports several writes already. You check them all out at <a href=\"http://fhir.cerner.com/dstu2/\" target=\"_blank\" title=\"http://fhir.cerner.com/dstu2/\">http://fhir.cerner.com/dstu2/</a><br>\nThe EnrG|Rheum SMART app was the first SMART app to take advantage of our FHIR server's write capabilities</p>",
        "id": 153846690,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1473265664
    }
]