[
    {
        "content": "<p>Just has a conversation about the meaning of Argonaut labels for Smoking Status, <a href=\"#narrow/stream/48-terminology/subject/smoking.20status/near/182071\" title=\"#narrow/stream/48-terminology/subject/smoking.20status/near/182071\">here</a>.</p>",
        "id": 153992562,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1535808121
    },
    {
        "content": "<p>The smoking status observation profile appears not to require a category - am I right? That would make it the only observation without a category - that seems wrong?</p>",
        "id": 209095882,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1599227537
    },
    {
        "content": "<p>Indeed. This has come up in our discussion about granular scopes too (which I know will not bother you :-))</p>",
        "id": 209095965,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599227589
    },
    {
        "content": "<p>Fun time. Thanks <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>  please log a tracker</p>",
        "id": 209100844,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1599230286
    },
    {
        "content": "<p>Ideally we'd want to use a specific category like smoking history rather than a general category like social history, based on experience from several Argo vendors trying to keep very different kinds of data under distinct categories.</p>",
        "id": 209100970,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599230372
    },
    {
        "content": "<p>Ah not ideally for us...</p>",
        "id": 209108080,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1599233488
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-28436\">https://jira.hl7.org/browse/FHIR-28436</a></p>",
        "id": 209108682,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1599233779
    },
    {
        "content": "<p>Thank you sir</p>",
        "id": 209109650,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1599234293
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 209110549,
        "sender_full_name": "Eric Haas",
        "timestamp": 1599234828
    },
    {
        "content": "<p>if up to us ( and might as well be)  would be category = social-history</p>",
        "id": 209110735,
        "sender_full_name": "Eric Haas",
        "timestamp": 1599234918
    },
    {
        "content": "<p>although the lack of category makes it easier to implement and anything we propose will meet opposition somewhere.</p>",
        "id": 209110894,
        "sender_full_name": "Eric Haas",
        "timestamp": 1599234985
    },
    {
        "content": "<blockquote>\n<p>if up to us ( and might as well be) would be category = social-history</p>\n</blockquote>\n<p>Can you explain why <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> ? We had very strong negative reaction to lumping this level of 'harmless' (smoking) data along with 'sensitive' (e.g., alcohol abuse, family life) data. <span class=\"user-mention\" data-user-id=\"191339\">@Pascal Pfiffner</span>, <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> , <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> expressed concern about this on our Argonaut calls if I recall correctly.</p>",
        "id": 209143577,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599255593
    },
    {
        "content": "<p>This was one of the few <em>concrete</em> suggestions we heard about how to improve policy-based access control.</p>",
        "id": 209143633,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599255614
    },
    {
        "content": "<p>Yes, lumping \"smoking status\" and e.g. \"sexual history\" together is problematic for us when we think about how users would share this data with 3rd parties. Currently this is based on category. I can see appeal in pulling these together under \"social history\" but this is something that creates an issue for us specifically. In fact we have the same problem with labs, \"harmless\" and sensitive labs are still just \"laboratory\" after all, so maybe creating a different category to separate items of different sensitivity is not the right approach?</p>",
        "id": 209144293,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1599256233
    },
    {
        "content": "<p>The \"right\" approach would be to use security labels here -- the challenge as always is how to apply them consistently. keeping tobacco history in its own rum given that it is a distinct category in the US core seems like the low-hanging fruit approach.</p>",
        "id": 209144452,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599256401
    },
    {
        "content": "<p>Well what should it be then? We are at loggerheads with categories which is why there is nothing now.</p>\n<p>Btw. I think one can make the same argument for all the categories.  </p>\n<p>Sent from my iPhone</p>",
        "id": 209155709,
        "sender_full_name": "Eric Haas",
        "timestamp": 1599270718
    },
    {
        "content": "<p>I'd just categorize it under \"smoking history\" or \"tobacco history\". I agree this is basically an adhoc answer, but I still think it solves a practical problem.</p>",
        "id": 209155783,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599270833
    },
    {
        "content": "<p>I think the same argument could made other categories as well.  The base categories terminology was not designed to discriminate what is sensitive, There are security and privacy tags that do that.  What other solutions were proposed?   This  lack of consensus is why is not specified in US Core btw.</p>",
        "id": 209192357,
        "sender_full_name": "Eric Haas",
        "timestamp": 1599334167
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179175-argonaut/topic/Smoking.20status/near/209155783\">said</a>:</p>\n<blockquote>\n<p>I'd just categorize it under \"smoking history\" or \"tobacco history\". I agree this is basically an adhoc answer, but I still think it solves a practical problem.</p>\n</blockquote>\n<p>IMO just use the code instead, that is essentially what super fine grained categories are...</p>",
        "id": 209192428,
        "sender_full_name": "Eric Haas",
        "timestamp": 1599334260
    },
    {
        "content": "<p>How is this security issue solved in CCDA, since that is  one of the primary inspirations for these categories?</p>",
        "id": 209192600,
        "sender_full_name": "Eric Haas",
        "timestamp": 1599334487
    },
    {
        "content": "<p>I've only ever seen CDA files shared wholesale, never broken into parts and used to fuel an API (except for a couple of demos I built in like 2012...)</p>",
        "id": 209193513,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599335811
    },
    {
        "content": "<p>it happens inside products</p>",
        "id": 209201456,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1599351190
    },
    {
        "content": "<p>I've seen meds, problems, allergies extracted (that's required in the US) but often with a pretty manual importing step.</p>",
        "id": 209203002,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599354733
    },
    {
        "content": "<p>I haven't come across different security/sharing rules being applied to different parts of a CCDA</p>",
        "id": 209203068,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599354930
    },
    {
        "content": "<p>I would agree. although DS4P theorizes it, the implementation of these fine-grain controls always tend to be too difficult. Further the recipient must be authorized to receive the most sensitive of the content, thus the marking of some stuff at less sensitive than that seems to be of limited benefit. We did make this easier in FHIR, but the effort is still going to be a big effort, and the fact that the recipient must be authorized to receive the most sensitive tends to leave us in the same place. That is, you either are authorized to receive THIS data, or you are not. I need to know the distinction within my walls, but all I need to do is filter out the stuff you are not authorized and send that subset. Hence why most use of DS4P today is at the Document level (bundle). There are Normal and there are Restricted; there is just not much benefit in mixed.   so, like Grahame said, this happens inside the product.</p>",
        "id": 209408109,
        "sender_full_name": "John Moehrke",
        "timestamp": 1599581170
    },
    {
        "content": "<p>category vocabulary should be big enough to group reasonable things together; but not so big as to group things that are different. What is not clear is if the category should try to group similar sensitivity things (like social-determinants-of-health would include smoking status and drinking status and sexual health indicators); or if that distinction is enough to make a more fine grain social health categories.  I suspect that these are two different vectors, and any attempt to have category be broken down into likely-sensitivity fine grain; will fail.</p>",
        "id": 209408866,
        "sender_full_name": "John Moehrke",
        "timestamp": 1599581474
    },
    {
        "content": "<blockquote>\n<p>and any attempt to have category be broken down into likely-sensitivity fine grain; will fail.</p>\n</blockquote>\n<p>Agreed, re: general-purpose strategies. But today smoking status is the <em>only</em> kind of social history data required in ONC's core data set, and it sounds like Argonaut participants would be happy enough with a \"spot fix\" for this issue.</p>",
        "id": 209421559,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599587689
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-28436\">J#28436</a> proposed disposition</p>",
        "id": 214896286,
        "sender_full_name": "Eric Haas",
        "timestamp": 1603918459
    },
    {
        "content": "<p>Gah, that's too bad in my view (it lumps smoking history in a large-and-generally-quite-sensitive bucket).</p>",
        "id": 214897183,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1603918938
    },
    {
        "content": "<p>(It means that even with the addition of SMART's v2 \"category-based scopes,\" we still lump together a <em>lot</em> under social history.)</p>",
        "id": 214897287,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1603919003
    },
    {
        "content": "<p>I would like to get others to chime in too - it can be pulled for discussion.</p>",
        "id": 214897293,
        "sender_full_name": "Eric Haas",
        "timestamp": 1603919005
    }
]