[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"246928\">@Josh Lamb</span>  asked </p>\n<blockquote>\n<p>Thanks, I am mostly interested in ANY resource that has \"universal\" read/write.</p>\n</blockquote>",
        "id": 225208717,
        "sender_full_name": "Eric Haas",
        "timestamp": 1612466503
    },
    {
        "content": "<p>Huh? None do today</p>",
        "id": 225262694,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1612502395
    },
    {
        "content": "<p>It's important that consumers can add the \"identity proofed\" value of their choice (some certification standard needed), regardless of the EHR used. This will enable a consumer to participate in linking systems together. My instinct is that this is a great PE usecase.</p>",
        "id": 225340518,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612551245
    },
    {
        "content": "<p>Data producers can assist in this process by agreeing to use open access identifiers. Both use cases can follow same IG.</p>",
        "id": 225340809,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612551389
    },
    {
        "content": "<p>Most Hospitals, etc. Identity proof as part of the EHR remote access enrollment</p>",
        "id": 225341071,
        "sender_full_name": "David Pyke",
        "timestamp": 1612551515
    },
    {
        "content": "<p>Yes, this is a good opportunity to create an open id.</p>",
        "id": 225341226,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612551602
    },
    {
        "content": "<p>I would also like for EHRs to begin capturing health plan member identifiers in a predictable way. There are several viable options. This will be key for uniform access across healthcare nodes. Currently there will be an organizational OID, that the organizations create. This makes it difficult to predict what the identifier system will be.</p>",
        "id": 225347518,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612554553
    },
    {
        "content": "<p>I think the issue there is for insurers to expose health plan member identifiers in a predictable way.  In my experience, every member 'card' exposes the information differently and sometimes uses different names for what turns out to be the same information.</p>",
        "id": 225347792,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612554697
    },
    {
        "content": "<p>If there was an easy way to look at the card and easily capture the information in a way that allowed it to be used as a globally unique identifier, that would be wonderful.</p>",
        "id": 225347917,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612554757
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thanks, there is another initiative led by Humana to create a virtual id card. I think this could be a great input into the \"add a user id\" endpoint. we will follow wedi standards and can ID proof via our portals (and trust relationships). but as I think through this some more I think a simple post of a key value pair is enough..</p>",
        "id": 225347925,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612554761
    },
    {
        "content": "<p>\"we\" =?</p>",
        "id": 225347975,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612554791
    },
    {
        "content": "<p>fixed, when i was in school I was taught to use inclusive language. Sometimes it creates the wrong impression.</p>",
        "id": 225348122,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612554844
    },
    {
        "content": "<p>So <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> do you think education about how ids are submitted when using X12 may help? <span class=\"user-mention\" data-user-id=\"195439\">@Cloud Cray</span>  if you know this one.</p>",
        "id": 225348467,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612555031
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"246928\">Josh Lamb</span> <a href=\"#narrow/stream/179175-argonaut/topic/universal.20read.2Fwrite.20.20IRL/near/225347518\">said</a>:</p>\n<blockquote>\n<p>I would also like for EHRs to begin capturing health plan member identifiers in a predictable way. </p>\n</blockquote>\n<p>Not all organizations use their EHR for registration.  Many organizations use an EHR for clinical documentation, but have a separate system for registration and billing.  Typically the reg/billing system will know the member identifiers.  The clinical EHR system may not.</p>",
        "id": 225355977,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1612558838
    },
    {
        "content": "<p>That's not necessarily going to help if patients are trying to provide their ids.  Admissions clerks eventually get to recognize the patterns and figure out where to put stuff, but patients would presumably have much less of a clue.  Also, member ids don't act as proper FHIR ids because they're not globally unique.  For proper FHIR (or CDA) identifiers, you have two elements - a root which is a URI (or OID for CDA) which humans generally never see and a 'value' which is a single identifier string that humans do see.  If an id has multiple parts, all must be expressed in that one string and expressed consistently in every usage.  RIght now, Da Vinci has a special operation where you pass in all of the card information to the target payer and it comes back and tells you its \"unique member identifier\" for that patient.  That's not necessarily even something that appears on the card.</p>",
        "id": 225355994,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612558850
    },
    {
        "content": "<p>To your point <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  patients created IDs will need guardrails. We cannot let people misuse the system with a weak ID or claim ownership of an ID that is not identity proofed. The creation of an id (and allowing someone to create an ID) requires trust. A HIPAA covered entity (US Realm) will have this status.</p>\n<p>Regarding endpoint awareness, a payer should be able to determine via claims history where claims have been submitted (NPI/tin-&gt; trust directory-&gt; fhir endpoint). This is important because this allows us to avoid the negotiation process we see with a single patient launch sequence (by taking advantage of HIPAA status and a requirement to trust that a request has been proofed and authorized, prior to being created). It is the requester that is responsible for ID proofing, not the fulfiller.</p>",
        "id": 225373081,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612569002
    },
    {
        "content": "<p>It is important that we can push IDs because if we over-rely upon a member ID (a weak id), it could cause security vulnerabilities.</p>",
        "id": 225373424,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612569265
    },
    {
        "content": "<p>I don't think we can expect systems to support patient-generated ids at all.  If we're going to standardize something, it should be something the EHRs already store - like insurance ids.  Expecting them to store patient-generated ids doesn't sound like something they'd already have capability for and there's a long line of \"essential new features\" that would probably be ahead of this one.</p>",
        "id": 225374025,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612569670
    },
    {
        "content": "<p>The patient does not generate the id, good point. It's federated.</p>",
        "id": 225374136,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612569738
    },
    {
        "content": "<p>So HIPAA (us realm) entity can push federated IDs.</p>",
        "id": 225374157,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612569762
    },
    {
        "content": "<p>Is it something that EHRs already do?</p>",
        "id": 225374168,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612569775
    },
    {
        "content": "<p>I.e. there's a database slot and an ability to render via their UI, etc.?</p>",
        "id": 225374220,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612569798
    },
    {
        "content": "<p>This exists but not universally (VA has a federated ID you can buy and CARIN mentioned a PASS ID).</p>",
        "id": 225374334,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612569855
    },
    {
        "content": "<p>If an EHR or portal wants to integrate, they can.</p>",
        "id": 225374366,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612569879
    },
    {
        "content": "<p>(deleted)  meant for another thread</p>",
        "id": 225435255,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612654189
    },
    {
        "content": "<p>For efficiency sake, what is the easiest way to enable search across multiple patient identifiers? </p>\n<p>In today's world you will search like this normally (using scoped FHIR patient id): GET base/Condition?Patient=Patient/123</p>\n<p>How can I search for conditions, for a patient, that may have multiple \"sovereign\" identifiers? I saw discussions about this before (I believe we were playing with a list in the smart token payload, which I like!).</p>\n<p>This will prevent duplication of data in the receiving system and reduce the number of duplicate calls to a source.</p>",
        "id": 225485234,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612733823
    },
    {
        "content": "<p>As far as the FHIR API is concerned, you can query for <code>Condition?patient.identifier=https://system.example.org|123</code>. There are some major drawbacks here though:</p>\n<ul>\n<li>Not every system you talk to is necessarily going to have the identifiers you need</li>\n<li>Not every system you talk to is going to support this kind of \"chained\" searching (it tends to be much more resource-intensive than matching on a \"simple\" indexed search param)</li>\n<li>The \"extra\" work of resolving an identifier would need to be re-spent on each query</li>\n</ul>\n<p>A more pragmatic approach would be to:</p>\n<ol>\n<li>Resolve the patient so you learn the remote-system-specific FHIR id (e.g., by calling <code>$match</code> or doing a search against Patients)</li>\n<li>On subsequent queries, use this remote-system-specific FHIR id directly</li>\n</ol>",
        "id": 225488702,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1612738531
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> , I will put together a few alternatives and will look forward to more feedback.</p>",
        "id": 225488965,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612738858
    },
    {
        "content": "<p>If we can coordinate identifiers between X12 submissions and what is exposed through the EHRs (and coordinate search against US Core standards and requirements) we should be able to address a few of the bullets you listed.</p>",
        "id": 225489141,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612739071
    },
    {
        "content": "<p>I like your suggestion better <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> . This does not require changes from the EHRs.</p>",
        "id": 225490178,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612740713
    },
    {
        "content": "<p>This output could be significant and a bulk operation may be needed (especially given the negotiation process highlighted above).</p>",
        "id": 225491046,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612741867
    }
]