[
    {
        "content": "<p>Hi guys, I imagine Argonaut is going to continue to use the US-Core profiles? If that's the case, does anyone have insight into why MedicationRequest is among them, but ProcedureRequest is not? Will Argonaut participants be able to handle ProcedureRequests returned as a decision from a system using CDS-Hooks? </p>",
        "id": 153891030,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1495576210
    },
    {
        "content": "<p>Why.. because was not a Common Clinical Data Set ( CCDS ) Data Element and that was the initial scope.  </p>",
        "id": 153891032,
        "sender_full_name": "Eric Haas",
        "timestamp": 1495578239
    },
    {
        "content": "<p>I'm looking at the US Core profile for Immunizations and I'm trying to understand Immunization.status. The supported values are completed and entered-in-error, where DSTU2 additionally supported on-hold and in-progress. How are multi-part (i.e. more than one dose) immunizations represented? Are they always complete and the fact the immunization is in progress inferred from the number of doses in the series, or is nothing reported until the entire immunization is complete? </p>",
        "id": 153894407,
        "sender_full_name": "Jeffrey Danford",
        "timestamp": 1497903618
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192825\">@Jeffrey Danford</span> STU 3 Immunizations actually removed those statuses, which is the version US Core is based on: <a href=\"http://hl7.org/fhir/stu3/immunization.html\" target=\"_blank\" title=\"http://hl7.org/fhir/stu3/immunization.html\">http://hl7.org/fhir/stu3/immunization.html</a> <br>\nThe profile itself didn't restrict the base value set at all.</p>",
        "id": 153894422,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1497907605
    },
    {
        "content": "<p>We had restricted it in the Argonaut version that was against DSTU 2, with knowledge that the change was coming. <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9070\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9070\">GF#9070</a> has more detail/background</p>",
        "id": 153894423,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1497907816
    },
    {
        "content": "<p>I don't think the Immunization.status was intended to indicate the status of a series, it just inherited the Med Admin status.</p>",
        "id": 153894424,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1497908044
    },
    {
        "content": "<p>So how should the first of three doses be reported, if only one dose has been administered and the other two are scheduled for future dates?</p>",
        "id": 153894425,
        "sender_full_name": "Jeffrey Danford",
        "timestamp": 1497908130
    },
    {
        "content": "<p>Based on the documentation on the core resource, the status is for that specific dose. This may be a conversation that needs to migrate over to the normal implementers channel and PHER, since this is a question for the core resource</p>",
        "id": 153894426,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1497908267
    },
    {
        "content": "<p>It does seem weird since they do have the list of doses in a series at the bottom, so you could put more than one dose in a single immunization event</p>",
        "id": 153894427,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1497908310
    },
    {
        "content": "<p>I will say that our server doesn't fill out the protocol section yet.</p>",
        "id": 153894428,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1497908447
    },
    {
        "content": "<p>Also, if you did want to accurately represent a half-done series, you wouldn't be able to do it with the status was there - there's no way to know which vaccines you list in that protocol section were done and which weren't</p>",
        "id": 153894449,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1497912260
    },
    {
        "content": "<p>If you just listed the ones that were complete (likely what our server would do), then the status would be completed. However, I still think it's confusing to have the whole protocol list in a single event</p>",
        "id": 153894450,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1497912295
    },
    {
        "content": "<p>I have applied several technical edits baseded upon GForge trackers for US-Core (Filter for US Core in the 'Specification' field) and will be bringing these changed up for a committee vote in the near future.</p>\n<p>There are, however, 2 more substantive changes that need further consideration and we don't have to make them as part of a new version if we focus only on a \"technical update\" but I'd like to consider them anyway....</p>\n<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13180\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13180\">GF#13180</a> :  US_Core Medication constraint 1..1 .code dose not allow for compounded meds</p>\n<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13127\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13127\">GF#13127</a>  :  For MedicationStatement Profile consider whether the encounter should be must-support</p>\n<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>,  <span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span> ?</p>",
        "id": 153897336,
        "sender_full_name": "Eric Haas",
        "timestamp": 1500486073
    }
]