[
    {
        "content": "<p>There is a strong push to change the vital signs profile spO2 code to  <em>methodless</em>. First,  a bit of history,  early on in  Argonaut we started out with this and got a lot of push back from the CCDA community to make it a pulse ox reading.  This means that technically laboratory measures of spO2 (by arterial sticks) are not a vital sign.   Categorizing something as a vital depending on the method was not intentional and certainly not explicitly defined in the profiles nor consistent with other vitals in the panel. </p>\n<p>Here is the argument for why we should change spO2 to methodless code:</p>\n<p>There is confusion as to how to apply other spO2s by other methods.  According to the definition of extensible binding in the spec.  An spO2 arterial stick is not covered by the concept spOs by pulse Ox so it would not be a vital.  But it could be argued it is vital sign according to our categorization and hence  follow the profile. To be consistent and avoid this ambiguity it would be better to make the spO2 a methodless code to inclusive of all spO2s regardless of method.   That way all translations of SpO2 codes would be technically correct.</p>\n<div class=\"codehilite\"><pre><span></span>Extensible binding sidebar using a box of crayons analogy:\n\nYou have a box of crayons with 8 extensible color bindings one of which is a\nblue crayon.  You can&#39;t simply add a baby blue crayon to the box (or replace the\nblue crayon with a baby blue crayon) - you already have a blue crayon!  However\nyou can scotch tape the baby blue crayon to the blue crayon  ( like an\nadditional coding element in CodeableConcept) and call it a translation.\n\nOn the other hand, if you have a box of crayons with 8 extensible color bindings\nand with only a &quot;royal blue&quot; crayon,  &#39;baby blue&#39; can be added to the box! -\nit&#39;s not covered by the concept &#39;royal blue&#39; but rather is its sibling.  You\ncan&#39;t tape it to the royal blue crayon either since its not a\ntranslation.\n</pre></div>\n\n\n<p>On a separate but equally important note,  the fiO2 issue is still open and would really really like to know how this is being represented in the wild today.</p>",
        "id": 153971047,
        "sender_full_name": "Eric Haas",
        "timestamp": 1529636130
    },
    {
        "content": "<p>The real question is - is the intention for these profiles to apply regardless of method?  If so, the codes MUST be methodless.  Otherwise, data you want won't show up under the codes.  You can't adopt a convention that says \"we're going to use this code, but pretend it's methodless\".</p>",
        "id": 153971196,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529681877
    },
    {
        "content": "<p>In this case of SpO2 it has been suggested that only one of the available methods (specifically pulse oximetry) is suitable for use as a \"vital sign\".  But that's probably not actually the case in all contexts (e.g. ICU) and across realms, and it also excludes other future methods that would be generally considered to fall within the notion of \"vital sign\" that may be added over time.  So I think the methodless code is the best choice for this one just as for the others.</p>",
        "id": 153971210,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1529682627
    }
]