[
    {
        "content": "<p>According to <a href=\"http://hl7.org/fhir/us/core/STU3.1.1/CapabilityStatement-us-core-server.html#location\">US Core Server CapabilityStatement</a>, server SHALL support US Core Location. <br>\nAccording to <a href=\"http://hl7.org/fhir/us/core/STU3.1.1/general-guidance.html#referencing-us-core-profiles\">US Core General Guidance</a>, a reference to Location SHOULD be US Core Location.</p>\n<p>That creates an interesting situation that when US Core Encounter references a Location, according to Server CapabilityStatemeent, the reference Location resource SHALL be US Core Location and according to General Guidance, the referenced Location resource MAY be a FHIR resource.</p>\n<p>Is that correct?</p>\n<p>Or should the Server CapabilityStatement be interpreted as \"Server is required to support US Core Location but MAY also support FHIR Location resource additionally.  Client SHALL check meta.profile to verify the actual profile. If meta.profile is empty, client MAY treat the resource as a FHIR Location resource.\"</p>\n<p>Then, should the US Core Location's <code>CapabilityStatement.rest.resource.supportedProfile</code> include both USCore profile and FHIR profile?</p>",
        "id": 265580933,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1640015652
    },
    {
        "content": "<p>Is there a specific FHIR profile on Location? If not, the base specification is assumed to be supported for all resources, isn't it?</p>",
        "id": 265583233,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1640016612
    },
    {
        "content": "<p>If I have a server which claim to be US Core conformant, is it a problem that my Location endpoint provides base FHIR location resource instead of US core Location resource?</p>",
        "id": 265585926,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1640017954
    },
    {
        "content": "<p>Remember the US Core Server CapabilityStatement, server  states SHALL must support Patient +1  so if you support location use it everywhere.</p>",
        "id": 265586476,
        "sender_full_name": "Eric Haas",
        "timestamp": 1640018253
    },
    {
        "content": "<p>We pulled back on practitionerrole and location to base FHIR since we did not have consensus there for US Core.  Hence the guidance</p>",
        "id": 265586910,
        "sender_full_name": "Eric Haas",
        "timestamp": 1640018451
    },
    {
        "content": "<p>as far as base profile in  supported profile in capability statement - no.   A fhir server may have a profile in <code>CapabilityStatement.rest.resource.profile</code> for Location that is different from the base Location.  See : <a href=\"http://build.fhir.org/profiling.html#profile-uses\">http://build.fhir.org/profiling.html#profile-uses</a></p>",
        "id": 265587632,
        "sender_full_name": "Eric Haas",
        "timestamp": 1640018799
    }
]