[
    {
        "content": "<p>Does the common search parameters such as _profile, _Tag still applicable for UC Core IG Profiles apart from the mandatory and optional search options already defined in the IG? What is a best practice as there are 26 US Core profiles so is that an expectation that 26 different API end points will be created and its upto the 3rd party app to subscribe to which API endpoint based on their need? Plz suggest.</p>",
        "id": 203199250,
        "sender_full_name": "SSM",
        "timestamp": 1594154017
    },
    {
        "content": "<p>There will be one endpoint per resource.  For example, Observation will have a single endpoint even though there are multiple associated profiles.</p>",
        "id": 203205090,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594157134
    },
    {
        "content": "<p>Clients can choose what endpoints to pay attention to.  Some might choose to just use the $everything operation.</p>",
        "id": 203205204,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594157164
    },
    {
        "content": "<p>Those common search parameters (e.g. _profile) are not required to be implemented, so you cannot assume as a client that a server that claims conformance to US Core will have implemented them.</p>",
        "id": 203206506,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1594157853
    },
    {
        "content": "<p>The $everything operation is not required in US Core either, so the client can only choose to use it if the server chooses to implement it.</p>",
        "id": 203207065,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1594158160
    },
    {
        "content": "<p>When multiple profiles in US Core derive from a single resource type (e.g. Observation), one of the required search parameters essentially serves a discriminator you can use to determine which profile should apply to the resources returned.  For Observation, that is the <code>code=</code> parameter.</p>",
        "id": 203209463,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1594159643
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179175-argonaut/topic/US.20Core.20Search.20Parameters/near/203205090\">said</a>:</p>\n<blockquote>\n<p>There will be one endpoint per resource.  For example, Observation will have a single endpoint even though there are multiple associated profiles.</p>\n</blockquote>\n<p>as a follow up question, if we build out the vital signs profile (endpoint) are you suggesting we don't need separate endpoints for BMI and Pediatric Weight profiles?</p>",
        "id": 203271141,
        "sender_full_name": "SSM",
        "timestamp": 1594217133
    },
    {
        "content": "<p>You definitely don't for each type of observation. In fact there isn't really even a way to do that with FHIR.</p>",
        "id": 203277822,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1594220345
    },
    {
        "content": "<p>The example queries in the US Core guide represent the minimum of what your server needs to be able to support.  The Inferno tool knows how to automatically test these queries, so your best bet is to focus on making sure your server works with Inferno (while learning more about how FHIR works overall).</p>",
        "id": 203278039,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1594220433
    },
    {
        "content": "<p>Right,  both of those profiles point to the vital signs 'quick start', which describes what queries must be supported at [base]/Observation to return vital signs generally, as well as those two profiled vital signs specifically (when you pass a <code>code</code> you know which type of vital sign you will get).  <a href=\"http://hl7.org/fhir/us/core/STU3.1/vitals-search.html#mandatory-search-parameters\">http://hl7.org/fhir/us/core/STU3.1/vitals-search.html#mandatory-search-parameters</a></p>",
        "id": 203278726,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1594220795
    },
    {
        "content": "<p>So within a FHIR server that supports US Core IG, a query for observation, patient and let's say the Pediatric BMI Loinc code should return the US Core Pediatric BMI profile.  The reason Sudhansu is asking is because we have facade layers over legacy data in some instances and have no FHIR server to work with.</p>",
        "id": 203288316,
        "sender_full_name": "Douglas DeShazo",
        "timestamp": 1594225003
    },
    {
        "content": "<p>When hitting the Observation endpoint in some cases you might get data that doesn't comply with any of the US Core profiles because it isn't covered by any of them (e.g. psychiatric evaluations - which aren't lab, vital signs or smoking related.  If you're exposing data that is covered by the scope of one of the profiles, then the instance is expected to comply with the relevant profile</p>",
        "id": 203299343,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594230420
    },
    {
        "content": "<blockquote>\n<p>If you're exposing data that is covered by the scope of one of the profiles, then the instance is expected to comply with the relevant profile</p>\n</blockquote>\n<p>Is this stated explicitly anywhere in US Core (or base FHIR, but it seems like an IG type detail)?  Its how we interpret it while testing, otherwise clients wouldn't ever be able to assume any given resource ever conforms to the expectations of a US Core profile.  But a line to point to for requirements traceability would be nice.</p>",
        "id": 203306426,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1594233991
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 203313044,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594237331
    },
    {
        "content": "<p>Unless I don't understand the question, that is what the must support, QuickStarts and the capstatements are all about.   Since we are discouraged from  identifying that an instance is conformant to xyz profile using meta.profile I'm not sure what else we can do.</p>",
        "id": 203331296,
        "sender_full_name": "Eric Haas",
        "timestamp": 1594247118
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span> <span class=\"user-mention\" data-user-id=\"194135\">@Douglas DeShazo</span>   -   If the client doesn't have a FHIR server /FHIR repository and all transactions are real time from source system to FHIR API to the requester..in that case, i am not sure how the observation resource with code search will work and how one observation resource can satisfy different other US Core profiles such as BMI, Age &amp; Height etc. As an alternate option, Why cant we have individual API endpoints for each of the 26 US Core Profile, in that way i am not restricting the 3rd part app or dictating which profile needs to be subscribed to get different data?</p>",
        "id": 203510027,
        "sender_full_name": "SSM",
        "timestamp": 1594389827
    },
    {
        "content": "<p>I think there is a misunderstanding here, but I'm having trouble putting my finger on it.</p>",
        "id": 203511452,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1594390634
    },
    {
        "content": "<p>FHIR defines a standard API that allows a client to ask for many different kinds of data. The overall scope of the FHIR API is broader than US Core, which is part of why it is valuable (indeed, you asked horrible grow over time and it would be unworkable if FHIR needed new features to make that happen). But if a client queries for specific data elements that are part of US Core, then you can satisfy the requirements set out by that dataset.</p>",
        "id": 203511650,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1594390744
    },
    {
        "content": "<p>So there are not 26 different endpoints, but for each element of the US core there is a fhir query that you can issue to retrieve that element.</p>",
        "id": 203511712,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1594390781
    },
    {
        "content": "<p>Several of these elements are captured in the fhir Patient resource (e.g., name, address, race), and so a single query to fetch patient demographics will get a coherent resource that includes all of these.</p>",
        "id": 203511808,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1594390825
    },
    {
        "content": "<p>Another batch of us core elements are represented with the fhir observation resource, so you can do targeted queries to fetch observations of a specific category or code.</p>",
        "id": 203511860,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1594390864
    },
    {
        "content": "<p>The US Core guide lists these queries explicitly on its profile pages.</p>",
        "id": 203511888,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1594390881
    },
    {
        "content": "<p>I don't know if any of this is helpful, because I'm not exactly sure where the \"impedance mismatch\" is here, but I'm at least trying to frame things the way I think about them :)</p>",
        "id": 203512017,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1594390946
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> We may need to educate clients more on FHIR.  The expectation is not for query for data elements but for the entire US Core profile/s and that may be where the confusion lies.  We always say follow US Core because of the mandate and the defined queries there but always get 'we don't have a fhir server and are not supporting base FHIR, we are only supporting IG's (US Core, Davinci, etc.)</p>",
        "id": 203531372,
        "sender_full_name": "Douglas DeShazo",
        "timestamp": 1594399958
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I meant to follow up with you on the discouraged to use meta.profile.  Could you share the thinking on that please?</p>",
        "id": 203548155,
        "sender_full_name": "Douglas DeShazo",
        "timestamp": 1594408900
    },
    {
        "content": "<p>You MUST have a FHIR server to be able to support US Core (or any other profile)</p>",
        "id": 203559224,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1594416130
    },
    {
        "content": "<p>see this: <a href=\"http://build.fhir.org/resource.html#profile-tags\">http://build.fhir.org/resource.html#profile-tags</a></p>",
        "id": 203560872,
        "sender_full_name": "Eric Haas",
        "timestamp": 1594417352
    },
    {
        "content": "<p>Couldn’t agree more, thanks. <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span></p>",
        "id": 203593052,
        "sender_full_name": "Douglas DeShazo",
        "timestamp": 1594467778
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194135\">@Douglas DeShazo</span> <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> - Do we need only the FHIR server or FHIR server with a FHIR repository? Is FHIR Repository also a must?</p>",
        "id": 203603781,
        "sender_full_name": "SSM",
        "timestamp": 1594485186
    },
    {
        "content": "<p>No, a FHIR repository is not needed. I believe most (all?) current implementations are FHIR server on top of existing systems / repositories</p>",
        "id": 203609464,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1594494708
    },
    {
        "content": "<p>This is all about providing an API; anything happening under the hood is not knowable or relevant for clients; it's below the abstraction barrier.</p>",
        "id": 203610271,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1594496109
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"295758\">@SSM</span>  this is why we are looking at HAPI Plain Provider and others like Vonk Facade.</p>",
        "id": 203611908,
        "sender_full_name": "Douglas DeShazo",
        "timestamp": 1594498985
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"295758\">@SSM</span> it’s the under the hood stuff that takes some thought to get right.</p>",
        "id": 203612250,
        "sender_full_name": "Douglas DeShazo",
        "timestamp": 1594499467
    }
]