[
    {
        "content": "<p>I'm pretty sure US Core allows for PDF/format of choice for Notes and documents in the clinical note section.  However, the 21st Century Cures regulation seems to say Notes are constrained to plain text: <br>\n\"We note that in the Proposed Rule we proposed in 84 FR 7480 that the clinical note text included in the “DocumentReference” resource would need to be represented in its “raw” text form, and further proposed in 84 FR 7480 that it would be unacceptable for the note text to be converted to another file or format (e.g., .docx, PDF) when it is provided as part of an API response. We clarify that the clinical note text included in any of the notes described in the “Clinical Notes Guidance” section of the US Core IG adopted in § 170.215(a)(2) must be represented in a <strong>“plain text”</strong> form, and would be unacceptable for the note text to be converted to another file or format (e.g., .docx, PDF) when it is provided as part of an API response.\"</p>",
        "id": 194330825,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587054217
    },
    {
        "content": "<p>I assume that's just horrible wording and they really meant \"represented as stored/used in the source system\" - but I'm not missing anything in US Core that would have required this, correct?</p>",
        "id": 194330946,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587054266
    },
    {
        "content": "<p>taking something that is formatted and has (for example) strikethroughs and making it plain text seems dangerous.</p>",
        "id": 194330982,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587054288
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> I wonder (with no review of Cures to confirm) if the intent was to use a different exchange element to exchange notes that are not plain text? <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Thoughts on this?</p>",
        "id": 194358085,
        "sender_full_name": "Robert McClure",
        "timestamp": 1587066616
    },
    {
        "content": "<p>This question was posted to Structured Documents Listserv a few weeks back. <span class=\"user-mention\" data-user-id=\"192087\">@Avinash Shanbhag</span>  mentioned ONC is reviewing...</p>",
        "id": 194359006,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1587067089
    },
    {
        "content": "<p>I don't think ONC intended the media type 'text/plain' here. My memory on intent here was to not have server convert everything to PDF on retrieval.</p>",
        "id": 194359207,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1587067200
    },
    {
        "content": "<p>Often times, PDF is the raw format HCPs get from third parties.  There are ways to EXTRACT that text, but they AREN'T perfect by any stretch of the imagination, and FAX is still used by some, which at the very least, best exchanged using PDF rather than raw image formats which don't support pagination well (TIFF is the only format that really supports paging, and few viewers work, and it's garbage for compatibility).</p>",
        "id": 194359333,
        "sender_full_name": "Keith Boone",
        "timestamp": 1587067260
    },
    {
        "content": "<p>At least with PDF you can get to PDF/A without harm to content, and there may be some access to text even with FAX (using OCR) through standardized access methods.</p>",
        "id": 194359482,
        "sender_full_name": "Keith Boone",
        "timestamp": 1587067323
    },
    {
        "content": "<p>I agree it would not be fun to force servers to always convert to some other format, even ignoring the lossy conversion issues. Here's hoping that ends up the confirmed intent :)</p>",
        "id": 194360136,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587067596
    },
    {
        "content": "<p>ONC would like to clarify that clinical note text that originates from Health IT Modules must be exchanged using a “plain text” (e.g., “machine readable”) format. The intent of this policy is to prohibit Health IT Modules from converting clinical notes from a “machine readable” format to a non-“machine readable” format (e.g., PDF). Clinical note text that originates from outside Health IT Modules should be exchanged using its original format. ONC will include clarification in the Certification Program documentation for the associated criteria. Thanks for highlighting this ambiguity.</p>",
        "id": 194489322,
        "sender_full_name": "Matt Rahn",
        "timestamp": 1587151893
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191942\">@Matt Rahn</span> We have notes that are raw pdf and scanned in via fax. We were planning on exposing the data as it is raw in our system and read by clinicians.</p>",
        "id": 194491222,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587152929
    },
    {
        "content": "<p>Most of the data today is not in that format, but we would expose what we have. For patient apps that want to actually display data to the user, we also offer to convert to PDF since that is one of the best ways to get a consistent cross-platform view of a document. But they would have access to the raw (eg: RTF) if it wasn't pdf.</p>",
        "id": 194491496,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587153089
    },
    {
        "content": "<p>Going from any of that to plain text/json/xml loses clinical context and human readability, which is dangerous.</p>",
        "id": 194492782,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587153694
    },
    {
        "content": "<p>There ought to be a better description of the intent. I don't think that formatting and presentation are necessarily \"not machine readable\". Was the distinction meant for discrete data?</p>",
        "id": 194494960,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1587154835
    },
    {
        "content": "<p>I read as 'maintain the value' of whatever format the server had when passing to a client --  don't convert everything into PDF.</p>",
        "id": 194498619,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1587156879
    },
    {
        "content": "<p>That would make an excellent clarification, especially since \"text/plain\" has a very specific technical meaning.</p>",
        "id": 194499021,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1587157103
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191410\">Brett Marquard</span> <a href=\"#narrow/stream/179175-argonaut/topic/US.20Core.20vs.20ONC.20plain.20text/near/194498619\" title=\"#narrow/stream/179175-argonaut/topic/US.20Core.20vs.20ONC.20plain.20text/near/194498619\">said</a>:</p>\n<blockquote>\n<p>I read as 'maintain the value' of whatever format the server had when passing to a client --  don't convert everything into PDF.</p>\n</blockquote>\n<p>Yeah, thanks Brett. That is what I was trying to convey. You should maintain the value that it was received.  If you received and were forced to store as a pdf then it would be ok to return that way. Also, the rule was not meant to imply convert to ‘text/plain’.</p>",
        "id": 194733646,
        "sender_full_name": "Matt Rahn",
        "timestamp": 1587416891
    }
]