[
    {
        "content": "<blockquote>\n<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14472\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14472\">GF#14472</a>: <strong>Jan 2018 Ballot: US Core Profile DocumentReference shouldn't require additional format</strong> posted by <code>jsyed</code></p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  and <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  This is something I carried over from the original argonaut DR profile that Grahame created a couple of years ago.  I can' t remember why I kept it anymore and before I go digging I'd thought I'd ask you two why it was included in the first place.</p>",
        "id": 153929302,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516212643
    },
    {
        "content": "<p>This could be solved either way. the formatCode is required in IHE, so it is possible that the IHE profile make it manditory. I would prefer though that US-Core and IHE-MHD be identical unless there is a compelling reason to have a difference.  Note that IHE has just last year added a formatCode to be used as a kind of nullFlavor.</p>",
        "id": 153929306,
        "sender_full_name": "John Moehrke",
        "timestamp": 1516213853
    },
    {
        "content": "<p>I am working with Grahame to get the IHE FormatCode vocabulary turned over to IHE control. I have published their vocabulary through Simplifier, but it somehow is not showing up on <a href=\"http://registry.fhir.org\" target=\"_blank\" title=\"http://registry.fhir.org\">registry.fhir.org</a></p>",
        "id": 153929309,
        "sender_full_name": "John Moehrke",
        "timestamp": 1516214035
    },
    {
        "content": "<p>see all the IHE published conformance and vocabulary at ftp://ftp.ihe.net/TF_Implementation_Material/fhir/</p>",
        "id": 153929311,
        "sender_full_name": "John Moehrke",
        "timestamp": 1516214061
    },
    {
        "content": "<p>I'm not sure providing a nullFlavor most of the time is going to be any better than just leaving it unset...</p>",
        "id": 153929317,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1516215670
    },
    {
        "content": "<p>This seems to assume doc ref is only used for strict inter-system doc exchange, where the primary use for us right now is SMART apps and patients viewing data</p>",
        "id": 153929320,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1516216001
    },
    {
        "content": "<p>I understand... My first acknowledgement was that IHE-MHD could add the constraint... I just want it recognized as a incompatible delta, and want that decision made in the open with full knowledge.</p>",
        "id": 153929353,
        "sender_full_name": "John Moehrke",
        "timestamp": 1516223638
    },
    {
        "content": "<p>I don't know that it makes it incompatible. We would add the format if it has one. I assume the IHE profile wouldn't want the simple PDF/HTML (non-standard) documents that aren't really meant to be parsed and processed? Or do those formats listed (especially all the text/html based ones) not actually have content requirements?</p>",
        "id": 153929363,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1516229453
    },
    {
        "content": "<p>I do want to understand what the format is intended to convey :)</p>",
        "id": 153929364,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1516229477
    },
    {
        "content": "<p>The format is more specific than the mime-type.  There are many profiles on CDA, thus knowing only that the document is a CDA document is not sufficient to know if your system can fully process it. The formatCode is intended to allow more specific technical formats. I go into greater detail here <a href=\"https://healthcaresecprivacy.blogspot.com/2017/10/granularity-of-formatcode.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2017/10/granularity-of-formatcode.html\">https://healthcaresecprivacy.blogspot.com/2017/10/granularity-of-formatcode.html</a> and <a href=\"https://healthcaresecprivacy.blogspot.com/2015/10/ihe-formatcodes-are-mandatory.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2015/10/ihe-formatcodes-are-mandatory.html\">https://healthcaresecprivacy.blogspot.com/2015/10/ihe-formatcodes-are-mandatory.html</a></p>",
        "id": 153929415,
        "sender_full_name": "John Moehrke",
        "timestamp": 1516282720
    },
    {
        "content": "<p>MHD/XDS/XCA is perfectly happy with PDF/HTML/TEXT documents. They are quite common, especially for historic, or less formal content.</p>",
        "id": 153929416,
        "sender_full_name": "John Moehrke",
        "timestamp": 1516282777
    },
    {
        "content": "<p>We use the CCDA format codes, it's one of the scenarios where we actually have one</p>",
        "id": 153929434,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1516291379
    },
    {
        "content": "<p>yes, for CCDA there are already assigned ones... so you don't have a gap</p>",
        "id": 153929437,
        "sender_full_name": "John Moehrke",
        "timestamp": 1516293212
    },
    {
        "content": "<p>Sorry, still trying to make sure I'm following the purpose of the additional format. </p>\n<p>If I'm interpreting your posts and the Value Set correctly, this is essentially trying to take a post-coordinated set of codes and make it pre-coordinated? At least in cases like simple PDF? IE: this is a simple clinical note, in PDF version rather than looking at the doc type (note) and contentType (application/pdf)? Or is there more to it than this? (or less -ie, is there such a thing as \"just pdf\" on the formatCode? I didn't see an example like that in the value set)</p>",
        "id": 153929511,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1516308686
    },
    {
        "content": "<p>Again, CCDA makes total sense to me since it's far more specific that application/xml. Thre are actual schemas required for the content that are more restrictive than \"plain\" XML</p>",
        "id": 153929512,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1516308790
    },
    {
        "content": "<p>Take a look at the codes that have been defined. They are specific IHE profiles, that then have specific encoding rules. Remember that this concept predates C-CDA... It also is content agnostic. Where in CDA you can look for templateID values to understand the encoding... this mechanism is similar in a content agnostic way.</p>",
        "id": 153929527,
        "sender_full_name": "John Moehrke",
        "timestamp": 1516315505
    },
    {
        "content": "<p>Using your PDF example.  the mime-type can only tell you that the content is PDF. Yet there is a Healthcare specific PDF (PDF/H) that can carry encoded elemental data, can carry a CDA inside the PDF. Thus it would be important to know this, prior to downloading the document and realizing that it has content beyond simply displayable PDF content.</p>",
        "id": 153929529,
        "sender_full_name": "John Moehrke",
        "timestamp": 1516315679
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>  See above for other questions ^^</p>",
        "id": 153931446,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1517088965
    },
    {
        "content": "<p>Planning to relax...</p>",
        "id": 153931600,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1517097906
    }
]