[
    {
        "content": "<p>First, I apologize if this has been answered before but in my searching it still wasn't clear.    I'm looking at the US Core Location Profile - <a href=\"https://www.hl7.org/fhir/us/core/StructureDefinition-us-core-location.html\">https://www.hl7.org/fhir/us/core/StructureDefinition-us-core-location.html</a> and trying to understand how it is actually referenced.  The opening paragraph talks about being used by patient, provider or organization.  </p>\n<p>**\"This profile sets minimum expectations for the Location resource for recording, searching for and fetching a Location associated with a patient, provider or organization.\"  <br>\n**<br>\nI believe this may just be a relic that needs updating as none of those US Core Profiles use the location reference.  Additionally, later in the profile, I see the following which confirms that:</p>\n<p>**\"Additional Profile specific implementation guidance:<br>\nAs a result of implementation feedback, the US Core Location and PractitionerRole Profiles are not explicitly referenced in any US Core Profile. However they SHOULD be used as the default profile if referenced by another US Core profile. See this guidance on Referencing US Core Profiles.\"**</p>\n<p>I understand that first sentence of that, but the second sentence has me scratching my head a bit.  If I were implementing US Core in order to meet CMS guidelines, wouldn't it be the case that since nothing references this profile, it is basically unused and dead?  Even if I loaded data into Location resources using the US Core Profile, it seems like it would just be siloed information that nothing refers to.  I guess technically you could search it but to what end....</p>\n<p>I was going to enter a Jira ticket but I figured I'd start here first.</p>\n<p>Thanks for any guidance that can be provided.</p>\n<p>Fred</p>",
        "id": 220603273,
        "sender_full_name": "Fred Harmon",
        "timestamp": 1608568847
    },
    {
        "content": "<p>There are two parts to your question:</p>\n<ol>\n<li>Reference to location from patient, provider, or organization</li>\n<li>References to the US Core Location profile</li>\n</ol>\n<p>Here is my understanding on that:<br>\nFor part 1, Patient is linked to Location through Encounter. Practitioner is linked to Location through PractitionerRole. Organization has a reverse link - from Location to Organization. This is how the base resources work.</p>\n<p>For part 2, US Core has chosen not to profile the references to Location in the US Core Profiles of Encounter, and PractitionerRole, even though there is a US Core Location Profile. The additional implementation guidance states that when these non-profiled references are populated they SHOULD (but not MUST) be populated with references to the US Core Profiled Location. Also note that the US Core Profile for Location references the US Core Profile of Organization.</p>",
        "id": 220608564,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1608572077
    },
    {
        "content": "<p>specific text is here in the most current version that is in ballot:  <a href=\"http://hl7.org/fhir/us/core/2021JAN/general-guidance.html#referencing-us-core-profiles\">http://hl7.org/fhir/us/core/2021JAN/general-guidance.html#referencing-us-core-profiles</a></p>",
        "id": 220615027,
        "sender_full_name": "Eric Haas",
        "timestamp": 1608575880
    }
]