[
    {
        "content": "<p>Hi, In US Core Condition profile, for Condition.code which has a binding value set of US Core Condition Code(extensible), can i map both ICD code and SNOMED CT codes in the same field or only one codeset is allowed? <br>\nAlso another question is in USCDI guidelines they have only listed the condition(problem) to map with applicable standard as SNOMED CT, not with ICD code (please refer here <a href=\"https://www.healthit.gov/isa/sites/isa/files/2020-03/USCDI-Version1-2020-Final-Standard.pdf\">https://www.healthit.gov/isa/sites/isa/files/2020-03/USCDI-Version1-2020-Final-Standard.pdf</a>) but as in US Core Condition it has allowed both the codeset. So which one will take more precedence and to get compliance with CMS rule. Plz suggest.</p>",
        "id": 204515722,
        "sender_full_name": "SSM",
        "timestamp": 1595312847
    },
    {
        "content": "<p>You can use both SNOMED and ICD (as long as they are codes meaning the same thing of course!). I think SNOMED is better if you can do it</p>",
        "id": 204548763,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1595339118
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> It is confusing for client as why USCDI has only applicable standard as \"SNOMED CT\" for condition where in US CORE both ICD and SNOMED CT are allowed.</p>",
        "id": 204704621,
        "sender_full_name": "SSM",
        "timestamp": 1595442730
    },
    {
        "content": "<p>in our source system, for the same patient, onset date(Date of service) we have multiple ICD codes which needs to be mapped. But as per the condition profile, cardinality of code is 1..1, i am not sure if how can i map multiple ICD codes in this \"code\" data element? Do we need to show only one ICD per resource? So if there are two ICD codes so there will be two resource ids for the same patient and same date of service with different ICD codes each? Please guide.</p>",
        "id": 226088650,
        "sender_full_name": "SSM",
        "timestamp": 1613099246
    },
    {
        "content": "<p><code>Condition.code</code> is type  <a href=\"http://hl7.org/fhir/R4/datatypes.html#CodeableConcept\">CodeableConcept</a>.  The FHIR specification and US Core provide guidance on <a href=\"http://hl7.org/fhir/us/core/general-guidance.html#using-multiple-codes-with-codeableconcept-datatype\">Using multiple codes with CodeableConcept Datatype</a></p>",
        "id": 226095222,
        "sender_full_name": "Eric Haas",
        "timestamp": 1613101405
    },
    {
        "content": "<p>so if i map multiple codes in coding under codeableconcept as coding is 0..* cardinality then i will not get fhir validation error for condition.code cardinality 1..1?</p>",
        "id": 226097283,
        "sender_full_name": "SSM",
        "timestamp": 1613104332
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 226098761,
        "sender_full_name": "SSM",
        "timestamp": 1613106161
    }
]