[
    {
        "content": "<p>Hi, in a FHIR facade approach where there is no terminology service or server involved. Can i use the URI for example in Immunization profile for CVX code     \"<a href=\"http://www2a.cdc.gov/vaccines/iis/iisstandards/vaccines.asp?rpt=cvx\">http://www2a.cdc.gov/vaccines/iis/iisstandards/vaccines.asp?rpt=cvx</a>\", since we are directly using the vaccine code set from CDC website not the HL7 specified one. All the external code sets are required to use from HL7 site registered URI or we can directly use the source URL in system. Please confirm. <br>\n {<br>\n        \"system\" : \"<a href=\"http://www2a.cdc.gov/vaccines/iis/iisstandards/vaccines.asp?rpt=cvx\">http://www2a.cdc.gov/vaccines/iis/iisstandards/vaccines.asp?rpt=cvx</a>\",<br>\n        \"code\" : \"1234\",<br>\n        \"display\" : \"dummy\"<br>\n},<br>\n{<br>\n        \"system\" : \"<a href=\"http://hl7.org/fhir/sid/cvx\">http://hl7.org/fhir/sid/cvx</a>\",<br>\n        \"code\" : \"1234\",<br>\n        \"display\" : \"dummy\"<br>\n},</p>",
        "id": 206084116,
        "sender_full_name": "SSM",
        "timestamp": 1596665312
    },
    {
        "content": "<p>You must use the HL7-published URL.  That's the only thing that tells other systems what code system you're using.</p>",
        "id": 206085392,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596666282
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179175-argonaut/topic/USCore.20System.20URI.20for.20codesets.20terminologies/near/206085392\">said</a>:</p>\n<blockquote>\n<p>You must use the HL7-published URL.  That's the only thing that tells other systems what code system you're using.</p>\n</blockquote>\n<p>Will there be any validation error if the non HL7 URL is used here in this example CDC URL. Technically we are using the codesets from CDC site for CVX code example, so is this still required to use HL7 URL? <br>\nAnother issue is in some cases complete up to date codeset is not available in profile site for external codeset and for example in US Core Immunization profile  this URL for CVX code is not working \"<a href=\"http://hl7.org/fhir/sid/cvx\">http://hl7.org/fhir/sid/cvx</a>\" giving 404 error.</p>",
        "id": 206103319,
        "sender_full_name": "SSM",
        "timestamp": 1596687514
    },
    {
        "content": "<p>If you're using the CVX code system, you're required to use the HL7-registered URL (just as you must use the HL7-registered URL for UCUM, SNOMED, etc.)  The validator won't yell - because it'll think you're using some weird custom code system it's never heard of.  But you're certainly be non-conformant with the FHIR spec.  It clearly says \"The following names (URIs) may be used in the system element of the Coding data type. If a URI is defined here, it SHALL be used in preference to any other identifying mechanisms.\"</p>\n<p>It's certainly possible for certain terminology servers to be out of date with the source of truth - that's an issue of the terminology server.  You're free to use your own terminology server if you can keep it more up-to-date for the terminologies you care about.  That's orthogonal to the system URL though.</p>",
        "id": 206104738,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596689599
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"295758\">@SSM</span> Another way to look at this is that CodeSystem.url <em>is the canonical unique identifier</em> for the idea of the code system noted. In FHIR, that has to be in a uri format and we like them to be a url. That easily leads to the assumption, that is occasionally correct, that it is the url to a page \"where you can find the code system.\" Given that FHIR is RESTful, even that statement can be misleading, but you can never use an independently found url for a code system FHIR has already specified a defined identifier for, because as Lloyd says, you'll essentially be telling everyone you are using a different code system you made up. It's about shared understanding of meaning.</p>",
        "id": 206531069,
        "sender_full_name": "Robert McClure",
        "timestamp": 1597107735
    }
]