[
    {
        "content": "<p>I have been digging into US-Core heavily recently. Did others know that US-Core requires support for writing DocumentReferences and DiagnosticReports? How are others treating this requirement? In addition to that thought, how are you treating must support elements for those resources? For example, DocumentReference has MustSupport for encounter. Did you think that requires to support encounter writes? Encounter has MustSupport for Location, did you expect to support writes for Locations? How far down the rabbit hole are others going?</p>",
        "id": 201648395,
        "sender_full_name": "Drew Torres",
        "timestamp": 1592853222
    },
    {
        "content": "<p>In general, if a server also supports writes, how should the server deal with MustSupport elements on writes?</p>",
        "id": 201648481,
        "sender_full_name": "Drew Torres",
        "timestamp": 1592853248
    },
    {
        "content": "<p>In the case of DocumentReference -&gt; Must support encounter, I believe the must-support stops at supporting the reference. It does not mean that the server must support writes for Encounter. I suspect there are many different ways for implementers to handle the recording of the reference...</p>",
        "id": 201649527,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1592853873
    },
    {
        "content": "<p>Well I am sure you are in a similar position we are in where organization type security for behavioral health comes into play especially with notes. Not properly recording the encounter reference and supporting resources would be dangerous.</p>",
        "id": 201649973,
        "sender_full_name": "Drew Torres",
        "timestamp": 1592854166
    },
    {
        "content": "<p>Yes, recording the reference is important, and may require additional processing. My point was that this additional processing is not the same as requiring write for the Encounter resource.</p>",
        "id": 201650909,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1592854719
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>  <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I thought we got rid of/clarified that no writes were required for USCDI exchange compliance but I'm not finding that verbiage in the conformance section or general guidance</p>",
        "id": 201658104,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1592858386
    },
    {
        "content": "<p>no writes? I thought DocumentReference and DiagnosticReport for notes always had writes</p>",
        "id": 201658167,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1592858418
    },
    {
        "content": "<p>I don't think we talked about writing the refernced resoruce.</p>",
        "id": 201658230,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1592858466
    },
    {
        "content": "<p>To meet USCDI (read only) requirements?</p>",
        "id": 201659902,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1592859418
    },
    {
        "content": "<p>for Patient access??</p>",
        "id": 201659917,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1592859424
    },
    {
        "content": "<p>I don't think it was our intent to require that support for USCDI</p>",
        "id": 201659942,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1592859442
    },
    {
        "content": "<p>And I don't think anyone has tested writes by a patient (not sure how much writes for notes by provider were tested, but I don't think diagnosticreport writes were)</p>",
        "id": 201660335,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1592859656
    },
    {
        "content": "<p>here is where we talk about writes : <a href=\"http://hl7.org/fhir/us/core/future-of-us-core.html#future-candidate-requirements-under-considerations\">http://hl7.org/fhir/us/core/future-of-us-core.html#future-candidate-requirements-under-considerations</a></p>",
        "id": 201661933,
        "sender_full_name": "Eric Haas",
        "timestamp": 1592860506
    },
    {
        "content": "<p>The only place describing write is for Clinical Notes.</p>",
        "id": 201662140,
        "sender_full_name": "Eric Haas",
        "timestamp": 1592860628
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191358\">@Dennis Patterson</span> had the pleasure of discussing writes in Koln, we added the functionality to discover supported read/write types as a result of that conversation: <a href=\"http://hl7.org/fhir/us/core/clinical-notes-guidance.html#discovering-note-and-report-types\">http://hl7.org/fhir/us/core/clinical-notes-guidance.html#discovering-note-and-report-types</a></p>",
        "id": 201720748,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1592916774
    },
    {
        "content": "<p>This isn't to say he was endorsing us supporting writes :)</p>",
        "id": 201721042,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1592916966
    },
    {
        "content": "<p>my memory of that discussion was purely around the fact that some DocumentReference writes have one type inbound and a different type outbound, and how that could be represented/discovered, just as that specific section makes mention.  Not around what's required in USCDI :)</p>",
        "id": 201741666,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1592926261
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191357\">@Drew Torres</span> my take on must-support here would be that if you must-support a reference on an inbound resource, then you must check it, and if it does not exist, then you must either allow it be to created, or to be a broken reference, or, if you don't accept broken references - which an EHR should not - then reject the POST/PUT. you can't simply ignore it</p>",
        "id": 201789606,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592949758
    },
    {
        "content": "<p>That is my take as well. That is why I asked about the implications around regulation and the relation to US-Core and must support elements. It feels wrong to declare that we support a must-support element, but except when writing.... That seems wrong. I have reached out to regulators to ensure they fully understand the implication of some of the must support elements.</p>",
        "id": 201789897,
        "sender_full_name": "Drew Torres",
        "timestamp": 1592949906
    },
    {
        "content": "<p>the US core statements around must-support are all geared towards read-only usage, so it would be good for a future version to clarify the expectations. But the underlying intention in the spec is that if an element is labelled must-support, you can't claim that you didn't know an element, and there was some subsequent safety issue that arose later</p>",
        "id": 201790260,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592950134
    },
    {
        "content": "<p>the spec specifically says that you can support an element by rejecting certain values for it</p>",
        "id": 201790309,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592950166
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179175-argonaut/topic/Writes.2C.20must.20support.2C.20and.20references.3F/near/201790309\">said</a>:</p>\n<blockquote>\n<p>the spec specifically says that you can support an element by rejecting certain values for it</p>\n</blockquote>\n<p>Where is that?</p>",
        "id": 201861149,
        "sender_full_name": "Eric Haas",
        "timestamp": 1593011792
    },
    {
        "content": "<p>It is buried in the create section that says server can implement their own business logic on writes.</p>",
        "id": 201879863,
        "sender_full_name": "Drew Torres",
        "timestamp": 1593020504
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/http.html#create\">http://hl7.org/fhir/http.html#create</a></p>",
        "id": 201880015,
        "sender_full_name": "Drew Torres",
        "timestamp": 1593020577
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/updates.html#7.14\">http://hl7.org/fhir/updates.html#7.14</a></p>",
        "id": 201880122,
        "sender_full_name": "Drew Torres",
        "timestamp": 1593020639
    },
    {
        "content": "<p>Even if a system supports all of the data elements provided, not all systems will actually persist the data received or be capable of returning it in response to a query. mustSupport indicates that a system supports an element but does not prescribe exactly what the system must do with supported elements. Data might be persisted, displayed, relayed, analyzed, tabulated or used in a variety of other fashions. The behavior of a given system should be unsurprising given its context, but it is still important to recognize that not all systems will persist the data they receive.</p>",
        "id": 201880178,
        "sender_full_name": "Drew Torres",
        "timestamp": 1593020649
    },
    {
        "content": "<p>In order to know whether a particular data element is likely to be stored by a given server, a client should check the Capability statement of that server. If, for a given resource, the StructureDefinition pointed to indicates that the element or extension is \"mustSupport=true\", and the server is capable of storing and returning data in general, then it would be expected that the system will be capable of storing and returning that data element. (Some servers such as decision support systems might not be capable of storing or returning any received data.)</p>",
        "id": 201880803,
        "sender_full_name": "Drew Torres",
        "timestamp": 1593020972
    },
    {
        "content": "<p>Regarding the bit what is required from US Core CapabilityStatement for ONC Cures certification, I interpret the <a href=\"https://ecfr.federalregister.gov/current/title-45/subtitle-A/subchapter-D/part-170#p-170.315(g)(10)(i)(A)\">(g)(10)(i)(A)</a> requirement as starting with the base of US Core Server CapabilityStatement, but then filtering that down only what is specified in 170.213 (USCDI) (so it excludes Encounter, Location, Organization, etc.). So anything listed in the Server CapabilityStatement, but not listed in the <a href=\"http://hl7.org/fhir/us/core/general-guidance.html#us-core-data-for-interoperability-and-2015-edition-common-clinical-data-set\">USCDI v1</a> mapping wouldn't be required.   It also says you only need to respond to requests for data, so that would exclude writes.    </p>\n<div class=\"codehilite\"><pre><span></span><code>(g)(10)(i)(A) Respond to requests for a single patient&#39;s data according to the standard adopted\nin § 170.215(a)(1) and implementation specification adopted in § 170.215(a)(2), including\nthe mandatory capabilities described in “US Core Server CapabilityStatement,” for each\nof the data included in the standard adopted in § 170.213. All data elements indicated\nas “mandatory” and “must support” by the standards and implementation specifications\nmust be supported.\n</code></pre></div>\n\n\n<p>Does anyone have a different view on this?</p>",
        "id": 205922837,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1596555434
    }
]