[
    {
        "content": "<p>Den här topicen används för att driva vidare nationella frågor kring hur vi ska angripa införandet i Sverige</p>",
        "id": 154020496,
        "sender_full_name": "Viktor Jernelöv",
        "timestamp": 1542900529
    },
    {
        "content": "<p>Tack allesammans för en bra diskussion igår! Jag kommer lägga upp lite anteckningar, frågor och slutsatser här snart.</p>",
        "id": 154020582,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1542961536
    },
    {
        "content": "<p>Tack själv! Jag tänkte hålla mina chefer informerade om vad vi diskuterade igår för att få lite driv i frågorna från högre höjd också. Framför allt rörande hur vi enas om långsiktigt produktions- och förvaltningsansvar för olika delar.</p>",
        "id": 154020584,
        "sender_full_name": "Viktor Jernelöv",
        "timestamp": 1542962368
    },
    {
        "content": "<p>Hej! Jag var inte med på gårdagens möte men startade en stream här för Patient, och la upp  ett tidigt exempel på Patient-profil tillsammans med några frågor . Tanken är att se om vi kan ha vissa diskussioner  och möjlighet att få återkoppling här på profilering som görs på  svenska marknaden.</p>",
        "id": 154020597,
        "sender_full_name": "Elisabeth Adelgren",
        "timestamp": 1542975183
    },
    {
        "content": "<p>Jag gillar upplägget med en tråd för Patient, och sen kanske en tråd för andra resurser! Jag lägger upp mina anteckningar nästa vecka.</p>",
        "id": 154020618,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1542988761
    },
    {
        "content": "<p>Nu ligger mina anteckningar i Patient-tråden</p>",
        "id": 154021291,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1543399715
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193182\">@Emmeli Gross</span> , <span class=\"user-mention\" data-user-id=\"197106\">@Elisabeth Adelgren</span> , om ni är intresserade så har vi börjat titta lite på Medication-resurserna, och jag ställde några frågor i <a href=\"#narrow/stream/4-implementers/subject/Planned.20Medication.20administrations\" title=\"#narrow/stream/4-implementers/subject/Planned.20Medication.20administrations\">https://chat.fhir.org/#narrow/stream/4-implementers/subject/Planned.20Medication.20administrations</a> </p>\n<p>Jag vet inte hur långt ni kommit med NLL-arbetet, men starta gärna upp en ny Topic för Medication-resurserna om ni vill diskutera frågor här i Sweden on FHIR.</p>",
        "id": 154022777,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1543934768
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197234\">@Martin Grundberg</span>  MedicationRequest är en av de mest centrala resurserna för de användningsfall vi behöver lösa (skapa förskrivning, hämta läkemedelslista etc) så vi kommer absolut starta en separat tråd kring det. Hittills har vi främst fokuserat på att gå igenom och mappa mot våra befintliga tjänster och domänmodell, återkommer när vi gjort någon konkret profil.</p>",
        "id": 154023044,
        "sender_full_name": "Elisabeth Adelgren",
        "timestamp": 1543998878
    },
    {
        "content": "<p>Hej<br>\nFöreslår att läkemedel hamnar i den existerande gruppen stream:Sweden+Drugs+on+FHIR</p>",
        "id": 154023051,
        "sender_full_name": "Oskar Thunman",
        "timestamp": 1544004522
    },
    {
        "content": "<p>Hej Alla! Sedan den 28:e är R4 av FHIR ute. Om någon kommer att ögna igenom nya versionen får ni gärna skriva några rader här i samma veva. Jag har mycket kort tittat på workflow samt medicationRequest och ser bara några få små avgränsningar.  Det går att överblicka ändringarna under fliken \"R3 Conversion\" på respektive resurs.</p>",
        "id": 154673441,
        "sender_full_name": "Oskar Thunman",
        "timestamp": 1546978501
    }
]