[
    {
        "content": "<p>Ett förslag är att hantera alla frågeställningar och beslut (kanske rekommendationer, vet inte vart beslut formellt fattas) kring profilering i allmänhet här. Ska vi ha öppna/stängda profiler t.ex. Vad avgör om vi ska ta med en Extension i en basprofil? Osv...</p>",
        "id": 154021286,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1543399243
    },
    {
        "content": "<p>Jättebra med separata kanaler! En fråga i den här tråden. Går det att samla in referenser och eventuella leverabler från de ansatser som gjorts med att \"tämja\" FHIR för svenska förhållanden, t ex Ineras PoC, eHM, övriga?</p>",
        "id": 154021314,
        "sender_full_name": "Oskar Thunman",
        "timestamp": 1543413791
    },
    {
        "content": "<p>Lyfter över mitt svar på frågeställningarna till den generella tråden eftersom det är mycket som är allmänt.</p>\n<p>Jag är med på <span class=\"user-mention\" data-user-id=\"191563\">@Oskar Thunman</span>s spår - det är klokt att förstå vad en bas-/grundprofil är för oss och hur de ska användas i relation till andra profiler så att vi enklare kan förstå vad vi ska lägga in i dem samt definiera regler/kriterier för när vi lägger in vad precis som <span class=\"user-mention\" data-user-id=\"197234\">@Martin Grundberg</span> åskådliggjorde i sina anteckningar från förra workshopen.</p>\n<p>Angående vägen framåt <span class=\"user-mention\" data-user-id=\"197106\">@Elisabeth Adelgren</span> , där landade vi inte i något konkret på mötet. HL7 Sverige ska ha ett strategimöte den 14/12 på vilket de ska bestämma vad de vill fokusera på nästa år. <span class=\"user-mention\" data-user-id=\"191563\">@Oskar Thunman</span> kan förtydliga om jag missat syftet med det mötet i egenskap av HL7-hotshot ;). Min personliga förhoppning är att HL7 Sverige i egenskap av \"neutral\" part vill ta på sig ansvaret att sammankalla till gemensamma workshops för framtagning av basprofiler där intressenter från myndigheter, landsting och industrin i lagom stora grupper kan delta. Ett annat alternativ är att eHM med sitt regeringsuppdrag att samordna arbetet kring standardisering nationellt tar på sig uppgiften.</p>\n<p>Jag skulle ändå vilja poängtera att för mig är det skillnad på att definiera <strong>vilken</strong> information som rent <em>logiskt</em> bör ingå i en basprofil och att faktiskt <strong>representera</strong> den informationen mha FHIRs resurser, datatyper och verktyg. Det är inte alldeles uppenbart för mig att det är samma grupperingar/människor som ska utföra båda dessa aktiviteter.</p>",
        "id": 154022050,
        "sender_full_name": "Viktor Jernelöv",
        "timestamp": 1543567920
    },
    {
        "content": "<p>Version 4 av FHIR instriducerar några små, men inte bakåtkompatibla ändringar i hur profilet utformas- Sammanfattas bra här: <a href=\"https://blog.fire.ly/2019/02/06/fhir-r4-profiling-and-forge/\" target=\"_blank\" title=\"https://blog.fire.ly/2019/02/06/fhir-r4-profiling-and-forge/\">https://blog.fire.ly/2019/02/06/fhir-r4-profiling-and-forge/</a>. Sammanfattningsvis behöver alla profileringsverktyg uppgraderas för att stödja v4 och profiler som nyttjar element-type constraints eller choice type-constraints behöver ändras om de ska följa v4.</p>",
        "id": 157685287,
        "sender_full_name": "Oskar Thunman",
        "timestamp": 1549455611
    }
]