[
    {
        "content": "<p>Hi,<br>\nIf we already have the CDA type of document for eICR in the EHR, how can we send it to CDC without using the eCR Now app? Is there any endpoint we can send to using Direct or XDR? <br>\nThanks,<br>\nOzlem</p>",
        "id": 197309125,
        "sender_full_name": "Ozlem Kurt",
        "timestamp": 1589304207
    },
    {
        "content": "<p>Yes! There is an on-boarding process for health systems that have EHRs that can do CDA electronic case reporting. Case reporting in the US goes to state and local public heath agencies and then they send some data on to the CDC.  You can connect-up to the on-boarding process via Rob Brown the eCR on-boarding manager (Brown, Rob &lt;<a href=\"mailto:robbrown5@deloitte.com\">robbrown5@deloitte.com</a>&gt;). I will pass your information on to him as well.</p>",
        "id": 197314314,
        "sender_full_name": "John Loonsk",
        "timestamp": 1589306387
    },
    {
        "content": "<p>Apologies for the super-newbie question, but this is my first time learning about eCR Now... I spent a few hours during the Connectathon reading through the eCR Now FHIR App materials and source code. Is it accurate to say that eCR Now ultimately uses SMTP as its only supported protocol (whether through Direct Secure Messaging or XDR)?</p>\n<p>As a complete novice to this space, SMTP as a chosen protocol is surprising, in that it's much more onerous than modern secure-connection technologies. I'm guessing this is for historical reasons to not need to upgrade existing EHR systems that have been in place for years. But are there plans to support a more modern API (e.g. REST, etc)?</p>\n<p>I'm specifically asking because I'm working with the Gates Foundation to push a bit on enabling smartphone-based at-home COVID rapid diagnostic tests. I'd like to be able to have the smartphone app be able to report COVID positivity through eCR Now, but it appears with the current design that I'd need to instead implement an entire SMTP server (both outbound to send the report, as well as inbound to receive the response) as well as to parse emails as the main interface to electronic reporting. Is this a correct understanding of how this is supposed to work? I suspect I'm likely missing some fundamental method that's much easier to integrate with.</p>\n<p>Thank you for your help and guidance!</p>",
        "id": 197607685,
        "sender_full_name": "Philip Su",
        "timestamp": 1589485405
    },
    {
        "content": "<p>I don't know if the eCR Now app uses SMTP, but if it does, it is probably part of the Direct protocol. The Direct protocol has two incarnations, one is SMTP based, secured via S-MIME, and the other is WS-I based SOAP Web Service (XDR).</p>\n<p>I am sure you will get more specific comments on your specific use case, home based rapid diagnostic tests...</p>",
        "id": 197612807,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1589487862
    },
    {
        "content": "<p>Philip,<br>\nCurrently the infrastructure that is used to receive electronic case reports support XDR and Direct. Direct is based on Email/SMTP protocols and XDR uses SOAP based protocols. The App currently is trying to leverage this existing infrastructure and hence it is build to work with the existing infrastructure. As the infrastructure evolves to use other methods like FHIR, the app could evolve.</p>",
        "id": 197612904,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1589487903
    },
    {
        "content": "<p>I think part of the question is whether at-home rapid diagnostic test results are appropriate to report via eCR...</p>",
        "id": 197613166,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1589488022
    },
    {
        "content": "<p>if it's at all appropriate to report at home diagnostic tests, then how would it be appropriate to report them?</p>",
        "id": 197613408,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589488130
    },
    {
        "content": "<p>I think that reporting by direct is the least of the problems - it's all the identifiers that are the problem</p>",
        "id": 197613438,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589488149
    },
    {
        "content": "<p>Thanks, everyone - I'll look into XDR a bit more!</p>",
        "id": 197641330,
        "sender_full_name": "Philip Su",
        "timestamp": 1589509195
    },
    {
        "content": "<p>Beginner question, I'm working through the setup of eCRNow on my dev machine. In the readme for FHIR configuration and transport configuration, are there some test server values that I could use to try this out? For example, following the configuration guide on Transport Configuration, it shows an example <a href=\"http://ett.healthit.gov\">ett.healthit.gov</a> setup. Could I reuse this one, and if so, what would the password be for the test instance? cc: <span class=\"user-mention\" data-user-id=\"192017\">@Nagesh Bashyam</span> , <span class=\"user-mention\" data-user-id=\"246871\">@John Loonsk</span></p>",
        "id": 197745912,
        "sender_full_name": "Mashallah Behbehani",
        "timestamp": 1589573027
    },
    {
        "content": "<p>I'm also trying to install the app.  Does anyone know if there is a Docker container for the eCR Now App?</p>",
        "id": 201339666,
        "sender_full_name": "Greg Johnson",
        "timestamp": 1592524420
    },
    {
        "content": "<p>Docker Files will be available shortly.</p>",
        "id": 201425908,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1592591545
    }
]