[
    {
        "content": "<p>Hi all,<br>\nI'm evaluating the eCRNow FHIR App and having trouble determining exactly what is the minimum set of R4 FHIR API endpoints required for this to work. I've looked through the mapping spreadsheets in the documents directory in github, but that doesn't seem to line up exactly with the code. We're in the process of implementing US-Core APIs and trying to determine what, if any, additional work beyond that would be required to satisfy eCRNow. Any thoughts or better documentation would be much appreciated. Thanks.</p>",
        "id": 224084906,
        "sender_full_name": "Jay Rankin",
        "timestamp": 1611686992
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"199669\">@Jay Rankin</span> </p>\n<ol>\n<li>First step is to integrate the SMART on FHIR on your FHIR server</li>\n<li>Provide the right client credentials into the eCR Now App</li>\n<li>If you launch with only PatientId, eCR Now will review the Patient reosurce and retrieve all the relevant FHIR resources associated with that Patient namely: Encounter, DiagnosticReport, Observation, ServiceRequest, Immunization, Document, MedicationRequest, Pracitioner, Organization - all of these will be utilized to publish the eICR.</li>\n</ol>\n<p>As mentioned, if the Step #1 and #2 are done the right way, we need not worry which FHIR resources eCR Now will be reviewing. Thanks</p>",
        "id": 224997117,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1612348082
    },
    {
        "content": "<p>Thanks for the reply <span class=\"user-mention\" data-user-id=\"194167\">@Santosh Jami</span> , unfortunately, that doesn't really answer my question. We're in the process of implementing FHIR APIs, but primarily focusing on the required US-Core profiles to satisfy USCDI/21st Century Cures regulatory requirements. What I'm trying to determine is if that set of 26 or so endpoints will be sufficient for the eCRNow app to produce a useful or valid eICR, or if we need to look at adding additional Resources to our API offering first. Thanks again.</p>",
        "id": 225023018,
        "sender_full_name": "Jay Rankin",
        "timestamp": 1612362800
    },
    {
        "content": "<p>Was there an answer to this question? We are interested in the same thing - we're on track to build out the 27 main USCDI Cures-required endpoints, but looking for details on whether that will contain enough info to build out eCRs using the FHIR app. If not, it would be super helpful to have an exact list of the additional profiles/data items enumerated<br>\nThank you (and apologize if already answered, but searching here I didn't find it)</p>",
        "id": 265365198,
        "sender_full_name": "Ilia Malkovitch",
        "timestamp": 1639777757
    },
    {
        "content": "<p>Ilia<br>\nUSCDI gives most of the APIs and data elements for eICRs but does not have all of them.<br>\nPlease refer to the following link to understand the FHIR R4 Queries and data elements captured in eICRs. <br>\n<a href=\"https://github.com/drajer-health/eCRNow/blob/master/documents/eCR_R1.1_FHIR_Mapping_R4_v2.xlsx\">https://github.com/drajer-health/eCRNow/blob/master/documents/eCR_R1.1_FHIR_Mapping_R4_v2.xlsx</a></p>",
        "id": 267913780,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1642100111
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192017\">@Nagesh Bashyam</span> , following up here...I think the outstanding question is whether -all- of these data elements need to be transmitted, or only a subset of them? Are some critical for eCR messages to be accepted, while others are nice-to-have elements?</p>",
        "id": 274423861,
        "sender_full_name": "Bob McCarthy",
        "timestamp": 1646673088
    },
    {
        "content": "<p>Bob, <br>\nAn email detailing the specifications and the data elements should have been already sent out to your team.<br>\nPlease let us know if you need anything else.</p>",
        "id": 274433288,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1646676559
    }
]