[
    {
        "content": "<p>Hi everyone,<br>\nI am trying to find more information about running eCR Now in System Account Launch mode.  I read in the documentation that in the FHIR Configuration section I can select System Account Launch mode, but in looking at the code I have not been able to find where that is implemented.  I am interested in tracing through the code to understand how that's done.  Can someone point me to where this code is?  Many thanks!</p>",
        "id": 223650305,
        "sender_full_name": "Carlos Felix",
        "timestamp": 1611326967
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192017\">@Nagesh Bashyam</span> - are you able to help with this question?</p>",
        "id": 224053449,
        "sender_full_name": "Michael Collier",
        "timestamp": 1611674316
    },
    {
        "content": "<p>Hi!  I’m hoping someone can provide guidance on these questions. As far as I can tell, a patient ID is always required to initiate a trigger query on that individual patient. In other words, the app must be given context as to which patient ID resources it will review for trigger codes. My first question is – is this understanding accurate?<br>\n    If that is accurate, I’d like to understand any best practices and recommendations for leveraging eCR Now for automated workflows, where there is no requirement that a provider be physically in a patient’s record to initiate a report. For example, trigger code queries performed daily for all newly admitted patients, and subsequent queries performed until discharge. On the Github, it states the app supports 3 launch mechanisms – 1 being “API based launch along with System Account access which can be used to integrate with systems which generate patient/encounter lists throughout the day and can report on these patients/encounters at the end of the day. Once such integration uses the ADT feeds” If I’m interpreting this correctly, 1 pattern is to use an ADT feed in order to give eCR Now the Patient ID context to perform the trigger queries.  I’m specifically looking for any recommendations or guidance as to how automation might occur in an ambulatory setting; for example, and independent chain of urgent care clinics. With potentially hundreds of case reports required to be reported per day for some organizations, complete automation will be critical.  <span class=\"user-mention\" data-user-id=\"194167\">@Santosh Jami</span> ?</p>",
        "id": 225298385,
        "sender_full_name": "Michael Collier",
        "timestamp": 1612531969
    }
]