[
    {
        "content": "<p>We need help with the configuration of eCR Now. We have the FHIR Configuration details now, but we don't know how to setup any of the Transport Configuration. We're also not sure what to put in App Configuration for Assigning Authority ID, ERSD File Location, and Schematron Location. Can we get help with these fields?</p>",
        "id": 265625824,
        "sender_full_name": "Lewis Strasburg",
        "timestamp": 1640041049
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192017\">@Nagesh Bashyam</span></p>",
        "id": 265733185,
        "sender_full_name": "Lewis Strasburg",
        "timestamp": 1640120165
    },
    {
        "content": "<p>Lewis,<br>\nTransport Configuration is to configure the eCRNow App to use one of Direct or XDR methods to connect with the AIMS Platform. <br>\nThe Transport configuration details are outlined in the App Configuration Guide document in github. Please let us know if you have any other questions. Your HISP Vendor should be able to provide Direct Configuration details. If you are using XDR, then you will be able to accept the payload and route the payload through the e-Health Exchange hub using XDR.</p>",
        "id": 267913479,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1642099981
    },
    {
        "content": "<p>Nagesh, to avoid filling up email inboxes, I thought I'd follow up about the REST API here. What scenarios would a REST API be used for? It doesn't sound like it's something we can build ourselves to replace Direct messaging or XDR. Are there certain EMR's that use a REST API for eCR's? Where can I learn more?</p>",
        "id": 269284462,
        "sender_full_name": "Lewis Strasburg",
        "timestamp": 1643128910
    },
    {
        "content": "<p>Follow-up question here. Can you explain further how/why the HISP messaging vendor (as I understand it, for us it would be MaxMD) is needed for the integration if we are planning to use the FHIR App? They could stand in for the HIE/HIN?</p>\n<p>Specifically - do you mind please pointing me to documentation that explains how the eICR responses can be sent over Commonwell network, vs sending over something like direct messaging?</p>\n<p>Thank you</p>",
        "id": 269434848,
        "sender_full_name": "Ilia Malkovitch",
        "timestamp": 1643212837
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321324\">@Ilia Malkovitch</span> is MaxMD a separate vendor or somehow associated with your EHR? <span class=\"user-mention\" data-user-id=\"192017\">@Nagesh Bashyam</span> Still hoping for more information but we're probably looking for a HISP now.</p>",
        "id": 270265556,
        "sender_full_name": "Lewis Strasburg",
        "timestamp": 1643741832
    },
    {
        "content": "<p>REST API is used more to handoff the document to your software so that you can use your own protocols to either send messages via Direct or use e-HealthExchange hub along with XDR protocols.</p>",
        "id": 274433910,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1646676782
    }
]