[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> We have completed the implementation of the adaptive forms in our DTR application. I find a minor discrepancy in how the specification is modeled. If you look at the $next-question operation described here <a href=\"http://build.fhir.org/ig/HL7/sdc/OperationDefinition-Questionnaire-next-question.html\">http://build.fhir.org/ig/HL7/sdc/OperationDefinition-Questionnaire-next-question.html</a>, it says $next-question would return an Adaptive QuestionnaireResponse Profile. While there is no technical issue with that, from an intuition point of view, when you are requesting a question, you tend to expect to get back a Questionnaire with the Questionnaire response in the contained section. This is not a show stopper but I think it is counter intuitive.</p>",
        "id": 258798181,
        "sender_full_name": "Sreekanth Puram",
        "timestamp": 1634956216
    },
    {
        "content": "<p>You get a QuestionnaireResponse with a contained Questionnaire.  The Questionnaire is unique to (and only relevant in the context of) the QuestionnaireResponse and the primary persisted thing is the QuestionnaireResponse.  So it's always QuestionnaireResponse in, and QuestionnaireResponse back.</p>",
        "id": 258798572,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634956895
    },
    {
        "content": "<p>This discussion interests me a lot because at eviCore, we have what we call \"Silent pathways\".  This allows us to change the data we gather in subsequent steps based on data we gathered in earlier steps.  So, if the adaptive questionnaire is initially able to \"prefill\" all answers from EMR data, and one or some of those answers trigger another questionnaire that is also able to be answered from EMR data without the provider having to do anything, we'd like to be able to do that and then just magically tell the provider the order is approved.</p>",
        "id": 260192719,
        "sender_full_name": "Ellen Anderson",
        "timestamp": 1635971121
    },
    {
        "content": "<p>You can magically tell the provider the prior authorization is approved just using CRD.  DTR should only be needed if there's content the user needs to fill in (or at least review) before it goes to the payer.  But yes, in that case, you could also pass back a prior authorization in an adaptive form.</p>",
        "id": 260204482,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635977361
    }
]