[
    {
        "content": "<p>Dear IBM FHIR team,<br>\nright now, only a subset of the spec-defined search modifiers are supported by IBM FHIR server (<a href=\"https://ibm.github.io/FHIR/Conformance/#search-modifiers\">https://ibm.github.io/FHIR/Conformance/#search-modifiers</a>). We are now working in a consortium project in Germany and are trying to use IBM FHIR server. It will be very nice that many as possible search modifiers, such as \":text\", \":not\", \":above\", \":below\" etc., are available in IBM fhir server.<br>\nRelated \"ask for feature\" issue has been created on Git Hub (<a href=\"https://github.com/IBM/FHIR/issues/1522\">https://github.com/IBM/FHIR/issues/1522</a>). <br>\nI would like to kindly ask whether these modifiers will be available soon?</p>",
        "id": 217121666,
        "sender_full_name": "guokun zhang",
        "timestamp": 1605698175
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"240520\">@guokun zhang</span> thanks for the well-written and well-thought-out feature request.  Unfortunately, our team is pretty heads-down on other efforts right now and so I'm not sure when we'll get to this one.<br>\nI would say that <code>:text</code> and <code>:not</code> are really quite different from <code>:above</code> and <code>:below</code> in that the latter requires deeper terminology services.<br>\nBased on that, I'd recommend splitting <code>:above</code> and <code>:below</code> into a separate issue.  If you don't mind, I can turn the one you opened into an \"Epic\" (a capability that ZehHub layers on top of github issues) and then open 3 issues below it:</p>\n<ol>\n<li>support for <code>:not</code> (token-only)</li>\n<li>support for <code>:text</code> (token-only)</li>\n<li>support for <code>:above</code> and <code>:below</code> (token-only)</li>\n</ol>\n<p>I'm not sure if it will help use get to them or not, but at least it will be less intimidating to approach / try to squeeze in if we can focus on one at-a-time.</p>",
        "id": 217266305,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1605791403
    },
    {
        "content": "<p>Also, it could help to have a more focused conversation on how to implement a given modifier in case someone from your team would like to try their hand at it (with our guidance).</p>",
        "id": 217266465,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1605791484
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span>  Hi, thank you for your quick reply!  And thank you for opening the Epics. It will be great if we can have <code>:not</code> and <code>:text</code> firstly implemented. It is a good suggestion that someone from our team will have a try. But right now, I just cannot tell whether and what our team is able to contribute. We will discuss internally and will let you know.</p>",
        "id": 217348220,
        "sender_full_name": "guokun zhang",
        "timestamp": 1605831242
    }
]