[
    {
        "content": "<p>We got a really nice external contribution for adding this feature that will improve deployment automation for fhir-server in a modern architecture:  <a href=\"https://github.com/IBM/FHIR/pull/1552\">https://github.com/IBM/FHIR/pull/1552</a></p>\n<p>Basically the PR implements an approach that I had outlined where we us Apache StringSubstitutor to replace values in the config file with values from environment variables.</p>\n<p>I think there is only one outstanding discussion on this PR and we wanted to call attention to it / open it up to the wider team:  <a href=\"https://github.com/IBM/FHIR/pull/1552#discussion_r498413614\">https://github.com/IBM/FHIR/pull/1552#discussion_r498413614</a></p>",
        "id": 212319736,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1601913479
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192632\">@Paul Bastide</span>  I've read and thought your arguments on this one but I'm leaning towards NOT forcing the prefix/pattern for env var substitutions.  The main thing swaying me is that neither Liberty (server.xml), Docker, nor Kubernetes seem to impose any such pattern/limitation on environment variables that can be set / configured.<br>\nDo you have any pointers to common / adopted systems that do enforce such a pattern?<br>\nHow strong do you feel about the security benefits of forcing the prefix?</p>",
        "id": 212359083,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1601933224
    },
    {
        "content": "<p>the other thing swaying me is that the external contributor seemed to feel strongly enough to argue about not forcing the prefix.  i realize this isn't a great reason, but I really want to encourage external contributors like this person and, if the security impact is negligable, I'd give the \"benefit of the doubt\" to how it was coded up in the PR</p>",
        "id": 212359272,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1601933341
    },
    {
        "content": "<p>I'm personally against it.  I think it's a bad pattern that pollutes the entire namespace. leading to side-effects, for instance  look at so many antipatterns with namespaces and the concepts of isolating concerns.  Also, take a peek at environment variables themselves in Java.  I defer to you and John. to break the tie.  I don't think this is a good pattern and makes it near impossible to consistently isolate concerns.  These are my ten cents and more.</p>",
        "id": 212369906,
        "sender_full_name": "Paul Bastide",
        "timestamp": 1601941250
    },
    {
        "content": "<p>Looks like John added his 2 cents on the PR as well.  Having noted the dissenting opinion, I think we're set on this one.  Ready to merge?</p>",
        "id": 212447203,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1601999272
    },
    {
        "content": "<p>definitely</p>",
        "id": 212587437,
        "sender_full_name": "Paul Bastide",
        "timestamp": 1602089617
    }
]