[
    {
        "content": "<p>I just opened <a href=\"https://github.com/IBM/FHIR/pull/592\" target=\"_blank\" title=\"https://github.com/IBM/FHIR/pull/592\">https://github.com/IBM/FHIR/pull/592</a> to update all of our modules from version <code>4.0.0</code> to <code>4.0.1</code>.<br>\nThis includes both the modules that have changed since 4.0.0 (irregardless of the scope of change) and modules that have not changed at all.<br>\nWe've also had a few discussions on how to manage module versioning going forward and we'd like to open that to the broader community.</p>",
        "id": 185701579,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1579098168
    },
    {
        "content": "<p>In the past (for our internal-only DSTU2 server), we used the following strategy:</p>\n<ol>\n<li>All modules in the master branch have a version of 99-SNAPSHOT</li>\n<li>\n<p>At \"DCUT\":  <br>\ni. Decide what version number to use for the new release (say 4.0.1)<br>\nii. cut a release branch which has a name that matches the desired version<br>\niii. update all the modules to be a snapshot of this version (4.0.1-SNAPSHOT)</p>\n</li>\n<li>\n<p>Finally, at release time, we'd overwrite the version as part of the build and end up with 4.0.1-DATETIME</p>\n</li>\n</ol>",
        "id": 185709675,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1579102939
    },
    {
        "content": "<p>A few things we didn't like about this for the open source project:</p>\n<ul>\n<li>the release branches seems unnecessary and potentially even harmful because we don't want to maintain a bunch of different versions of the project.  we'd like to move to more of a tag-based release process thats always moving forward along master</li>\n<li>the definition of \"DCUT\" is not as well-defined for an open source project...the notion of when a given version is ready is a bit looser and less formal</li>\n<li>it forces all modules to be updated and released in lock-step.  like if want to release an important fix for just one module, we end up bumping the version number of each and every module in the release.  that could be a pain for anyone using just the <code>fhir-model</code> or fhir-validation` modules outside of the full server</li>\n<li>it leads to \"sentimental versioning\", where we decide \"how big is the scope of all changes\" wholistically, which might lead to only a patch level increase when in fact we've changed an entire module's API around.  And that could get us in big trouble with users that are expecting a patch level bump not to break them</li>\n</ul>",
        "id": 185710251,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1579103291
    },
    {
        "content": "<p>For 4.0.0 we decided that we'd bump all the module versions to 4.0.0 and so everything became 4.0.0-SNAPSHOT in master.<br>\nFor 4.0.1 we wanted to get it out immenently, so we've decided just to bump everything to 4.0.1-SNAPSHOT.<br>\nFor post-4.0.1 I'd really like to explore independently versioning the modules; potentially even attempting semantic versioning at a per-module level.</p>",
        "id": 185710862,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1579103674
    },
    {
        "content": "<p>One barrier toward doing that is having a well-defined external contract for each module: <a href=\"https://github.com/IBM/FHIRa/issues/567\" target=\"_blank\" title=\"https://github.com/IBM/FHIRa/issues/567\">https://github.com/IBM/FHIRa/issues/567</a><br>\nWe definitely don't have that today, which means that we'd need to handle any externally-visible changes as a major version bump which I think would lead to a whole lot of major version revs.</p>",
        "id": 185710903,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1579103698
    },
    {
        "content": "<p>In the meantime, I've added an <code>API-stable</code> flag for each module in the repo and listed those at <a href=\"https://github.com/IBM/FHIR#ibm-fhir-server-module-catalog\" target=\"_blank\" title=\"https://github.com/IBM/FHIR#ibm-fhir-server-module-catalog\">https://github.com/IBM/FHIR#ibm-fhir-server-module-catalog</a>.  Initially, the only module i've marked as stable is <code>fhir-model</code>.</p>",
        "id": 185711031,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1579103767
    }
]