[
    {
        "content": "<p>I just opened <a href=\"https://github.com/IBM/FHIR/issues/744\" target=\"_blank\" title=\"https://github.com/IBM/FHIR/issues/744\">https://github.com/IBM/FHIR/issues/744</a>  IBM FHIR Server - DB2 Multitenancy Guide #744  ... if there are specifics people want added to the multitenancy guide beyond what I included, feel free to add as comments</p>",
        "id": 189511122,
        "sender_full_name": "Paul Bastide",
        "timestamp": 1583168369
    },
    {
        "content": "<p>I want to use multi-tenancy feature of ibm fhir server, but defining a static issuer in mpJWT config prevents me to use different realms in keycloak. what is the best practice of resolving that. could you point me to a direction? I couldn't find anything about this specific problem in docs.</p>",
        "id": 265446126,
        "sender_full_name": "Batuhan Bulut",
        "timestamp": 1639865033
    },
    {
        "content": "<p>Hi Batuhan.  We havn't actually addressed this in our server implementation to date.<br>\nIf you can validate the JWTs in FRONT of the fhir server (e.g. via an API Gateway), thats probably the best way to avoid running a server-per-tenant.  You can still use our fhir-smart module for the authorization.</p>\n<p>Alternatively, you could fork our <code>fhir-smart</code> module and do the JWT validation there instead, but we prefer doing that up front to avoid any additional processing on the server from unauthenticated users.</p>\n<p>There may be a way to do it via liberty config as well but I havn't ever done it...let us know if you do :-)</p>",
        "id": 265571133,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1640011146
    },
    {
        "content": "<p>Can we run IBM FHIR server as Single instance with multi tenant?</p>",
        "id": 268668230,
        "sender_full_name": "Sreenivas Dunna",
        "timestamp": 1642672879
    },
    {
        "content": "<p>yes.  the limitation described above is about configuring JWT validation.  i suggested two different workarounds for addressing that limitation in order to have a single server instance.</p>",
        "id": 268690538,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1642685024
    }
]