[
    {
        "content": "<p>Hey, are there currently any developments related to an admin web interface? One of my bachelor students aims to develop one in which multiple instances can be connected, showing status, number of patients and having a validity check of mapped profiles. Also a user friendly upload interface was aimed. Any projects / informations related to that topic, are welcome :)</p>",
        "id": 217242984,
        "sender_full_name": "Marius Herr",
        "timestamp": 1605776609
    },
    {
        "content": "<p>Hi Marius, our team has no plans for adding UI of any kind to the FHIR Server at this time.  In practice, we typically run this behind some API Management technology and so our \"user interface\" is really provided at that level.<br>\nThat said, we'd <em>love</em> to see a friendly admin / upload interface on top of our FHIR Server and I'd be more than happy to review whatever y'all come up with.</p>",
        "id": 217266882,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1605791694
    },
    {
        "content": "<p>Also, we do get asked for this type of interface from time-to-time, so I'm definitely not saying that we wouldn't consider adding one in the future.</p>",
        "id": 217267042,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1605791769
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"365578\">@Marius Herr</span>  The HAPI FHIR JPA Starter provides a way to configure remote FHIR servers for its \"Testpage\" GUI (see <a href=\"https://github.com/hapifhir/hapi-fhir-jpaserver-starter/blob/master/src/main/resources/application.yaml#L89\">https://github.com/hapifhir/hapi-fhir-jpaserver-starter/blob/master/src/main/resources/application.yaml#L89</a>). I've never tried if it actually works with arbitrary FHIR servers, but maybe that's something you can check out. There's also the SMART Patient Browser: <a href=\"https://github.com/smart-on-fhir/patient-browser\">https://github.com/smart-on-fhir/patient-browser</a> which might be interesting.</p>",
        "id": 217268602,
        "sender_full_name": "Christian Gulden",
        "timestamp": 1605792639
    }
]