[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , I see that there is a \"HL7 IG template for FHIR-related implementation guides published in the Canadian realm (not tied to HL7),\" and it looks like we're using it for CA Baseline. What is the status of the template? Is it finished? It says for IG's published in Canada, \"not tied to HL7\", but it has HL7 Canada branding, so does it mean not tied to HL7 International? Is it intended for all IGs in Canada? All published by HL7 Canada?</p>",
        "id": 247599864,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1627572613
    },
    {
        "content": "<p>I'm not sure there's been that much thought about the intended scope.  At the time it was created, there wasn't necessarily a clear governance process.  I think the simple answer is: the template can be whatever you want it to be.  However, in its current form, it should be only for content that are approved by the affiliate (as opposed to HL7 international).</p>",
        "id": 247710220,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627652958
    },
    {
        "content": "<p>Any objections if I clarify the description to be HL7 Canada, and address a couple of colour issues?</p>",
        "id": 247717930,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1627656659
    },
    {
        "content": "<p>I wonder if it makes sense to migrate the template to <a href=\"https://github.com/HL7-Canada\">HL7-Canada</a> instead of under <a href=\"https://github.com/HL7\">HL7 International</a>?</p>",
        "id": 247718759,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1627657047
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191380\">Elliot Silver</span> <a href=\"#narrow/stream/213856-Canada-Core/topic/CA.20IG.20Template/near/247718759\">said</a>:</p>\n<blockquote>\n<p>I wonder if it makes sense to migrate the template to <a href=\"https://github.com/HL7-Canada\">HL7-Canada</a> instead of under <a href=\"https://github.com/HL7\">HL7 International</a>?</p>\n</blockquote>\n<p>No concerns from me. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  you ok if we migrate the <a href=\"https://github.com/HL7/ig-template-ca\">https://github.com/HL7/ig-template-ca</a> over to the <a href=\"https://github.com/HL7-Canada\">HL7 Canada Repo</a>. We should be able to add you and Elliot to that repo if future editing of the template is the concern.</p>",
        "id": 247720187,
        "sender_full_name": "Sheridan Cook",
        "timestamp": 1627657644
    },
    {
        "content": "<p>Feel free to migrate.  The only concern would be if you decide to impose any additional validation requirements that require scripting.  Any templates that involve scripting need to be under HL7's strict control if you want them to work with the CI build.</p>",
        "id": 247751331,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627673224
    },
    {
        "content": "<p>OK, I'll leave it. The origin of my thought was that I didn't see other national templates in the HL7 international repository, and it would help clarify the role of the template. Beyond that, I didn't have a motivation to move it.</p>",
        "id": 247769064,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1627683819
    }
]