[
    {
        "content": "<p>Currently the .deviceName.type includes a udi-label-name and a manufacture-name type.  As part reviewing <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> 's <a href=\"https://jira.hl7.org/browse/FHIR-28197\">https://jira.hl7.org/browse/FHIR-28197</a>, we are considering removing manufacturer-name and indicate that udi-label-name is assigned by the manufacturer or labeler according to the jurisdiction.  This then would also be the name type that corresponds to the brand name in GUDID. <br>\nAlternatively we can keep the two name types and clarify that the udi-label-name would represent the brand name in GUDID for those subject to FDA, thus manufacturer-name would be used where there is a different name in play as well that is the name according to the manufacturer.<br>\nEither way, we would clarify that the newly added commercialBrand extension (per <a href=\"https://jira.hl7.org/browse/FHIR-27765\">https://jira.hl7.org/browse/FHIR-27765</a>) does not represent the brand name as documented in GUDID.</p>\n<p>Any arguments for the alternatives are welcome to improve clarity.</p>",
        "id": 238490152,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1620832202
    },
    {
        "content": "<p>There is a need for a formal device name part of the registration process of the device to the jurisdiction under which it will be marketed. The US jurisdiction delivers the authorization to the labeler. I understand that It's the labeler who registers the device into the GUDID and provides the formal name, stored in the GUDID as the \"brand name\". If this statement is true, then the brand name is what is currently called the <strong>udi-label-name</strong> in the ValueSet device-nametype.<br>\nOn the EU side, the entity  who  submits a device to get a marketing authorization, and who, then, registers it into the EUDAMED database is the \"manufacturer\" defined in the EU regulation as *\"a natural or legal person who manufactures or fully refurbishes a device or has a device<br>\ndesigned, manufactured or fully refurbished, and markets that device under its name or trademark; \"*. (So manufacturer in a very broad sense)<br>\nI think the <strong>labeler</strong> in US has the same role as the <strong>manufacturer</strong> in EU. Both of them assign a formal name to the device and register it to the jurisdictional database. <br>\n\"brand name\" in US, \"device name\" attached to the Basic UDI-DI in EU. It seems that these two names have a close (if not identical) semantic: the formal name registered in the jurisdictional database.<br>\nTherefore I agree to keep a single value in the ValueSet to represent this formal name, replacing the two current values <strong>udi-label-name</strong> and <strong>manufacturer-name</strong>.  </p>\n<p>Assuming we are free to rename the current values of the ValueSet (in maturity level 2), I would suggest to call this merger value <strong>udi-registered-name</strong> with a  display *UDI registered name *, and a definition <em>a name assigned by the entity who registers the medical device into a jurisdictional database (e.g. brand name assigned by the labeler in US, device name assigned by the manufacturer in EU)</em>.</p>\n<p>In addition to that the ValueSet also offers <strong>model-name</strong> which is needed and unambiguous on both sides of the Atlantic. </p>\n<p>EUDAMED in EU also needs any number of <em>trade names</em> in multiple languages. A <strong>trade name</strong> is attached to the UDI-DI in EUDAMED (corresponding to Primary UDI-DI in US), and there may be any number of such names, in any language. Can we consider that these European <strong>trade names</strong> can use the value <strong>user-friendly-name</strong> in the ValueSet ? Or should we assign another specific value to represent that type of name?</p>",
        "id": 238635716,
        "sender_full_name": "François Macary",
        "timestamp": 1620919093
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> here is what I came up with so far....</p>\n<p>registered-name – the term assigned to a medical device by the entity who registers or submits information about it to a jurisdiction or its databases (e.g., brand name assigned by the labeler in US, device name assigned by the manufacturer in EU).</p>",
        "id": 239309332,
        "sender_full_name": "Marti Velezis",
        "timestamp": 1621365036
    }
]