[
    {
        "content": "<p>How to query ventilator TV (tidal volume) settings from FHIR?</p>\n<p>#1. I checked both Device and DeviceMetric type resource. But it does not have  field value to hold setting value.</p>\n<p>#2. Are they can be get using Observation resource type?</p>",
        "id": 229175094,
        "sender_full_name": "Prasanth Vijayan",
        "timestamp": 1615111607
    },
    {
        "content": "<p>I'd expect this to be DeviceMetric, but indeed something seems to be missing. <span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span> <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> ?</p>",
        "id": 229194004,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1615129470
    },
    {
        "content": "<p>(I may be missing something)</p>",
        "id": 229194312,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1615129776
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"395454\">@Prasanth</span> - It's true that at present there isn't an obvious built-in way to mark a quantity as a setting. Looking at existing HL7 V2 practice, for example in the IHE Device Enterprise Communications profile, the way that the \"setting\" nature of a quantity is represented by the choice of the nomenclature code, so that you distinguish, say, tidal volume setting from the patient's observed tidal volume measurement is by giving them nomenclature codes that contain that semantic. So in the MDC (IEEE 11073-10101 Medical Device Communications Nomenclature standard, a generic tidal volume measurement is identified by the code 151980, mnemonic reference id MDC_VENT_VOL_TIDAL, while the setting is identified by the code 16929196, reference id MDC_VENT_VOL_TIDAL_SETTING. This is an example, there are as I'm sure you know, multiple variations on the concept and ways of measuring, and, as you would expect, corresponding different nomenclature terms).<br>\nThe US National Institute of Standards and Technology maintains a website for the freely-available IEEE MDC nomenclature term set, <a href=\"https://rtmms.nist.gov\">https://rtmms.nist.gov</a>. Unfortunately, the nomenclature, altough long recognized in HL7, is not yet easy to use in FHIR since it is not yet in FHIR terminology servers. We have hopes that this will not be a problem much longer.  Looking for help, <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 229219801,
        "sender_full_name": "John Rhoads",
        "timestamp": 1615153002
    },
    {
        "content": "<p>In this particular case (TV) and others, LOINC also provides different codes for its different variations as measurements and as settings. I venture to say that since, unlike LOINC, the MDC nomenclature is pretty completely device-focused, you may find that it contains more out-of-the-way ventilator concepts in it than does LOINC (full disclosure of possible bias - I work on the relevant IHE and IEEE committees).</p>",
        "id": 229221759,
        "sender_full_name": "John Rhoads",
        "timestamp": 1615154929
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192181\">@John Rhoads</span> We'll follow up on the support for MDC, as we discussed.</p>",
        "id": 229241695,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1615173703
    },
    {
        "content": "<p>Thanks everyone!</p>\n<p>For the time being, i hope I  can use Observation resource based method with MDC_VENT_VOL_TIDAL_SETTING for my demo application.</p>",
        "id": 229247705,
        "sender_full_name": "Prasanth Vijayan",
        "timestamp": 1615179398
    },
    {
        "content": "<p>FWIW - I posted my response in the FHIR Chat community forum, as follows:  \"Check out DeviceMetric:category\"</p>",
        "id": 229311453,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1615215445
    },
    {
        "content": "<p>Thanks @Todd Cooper. </p>\n<p>I had checked the DeviceMetric:category field and understood that this field shows whether specified thing is setting, measurement, or calculation. But could not find any fields to get the values.</p>\n<p>My aim is to query its value (e.g. Tidal Volume, PBW, P/F, PO2) of Ventilator. I thought of using DeviceMetric for that. But could not find any way to get its value using DeviceMetric type resource in FHIR. What I understood by latest discussion is that Observation based resource can be used for this by using correct nomenclature codes (MDC_VENT_VOL_TIDAL_SETTING for TV settings).</p>\n<p>Please correct me if i am wrong. I am new to FHIR.</p>\n<p>Thanks,<br>\nPrasanth</p>",
        "id": 229316218,
        "sender_full_name": "Prasanth Vijayan",
        "timestamp": 1615217166
    },
    {
        "content": "<p>The \"values\" will be in Observation resource instances.  Take a look at the PoCD FHIR IG draft for examples.  (or the spec too).  The DeviceMetric provides metadata per the ISO/IEEE 11073-10201 and related information model standards that include a \"Metric\" object.  This is information that is static or rarely changes, like \"setting\"; whereas, the values can change frequently (including waveform snippets) and are formalized in Observation.  Check out the examples in the IG, which also contains a good <a href=\"https://build.fhir.org/ig/HL7/uv-pocd/profiles.html#profiles\">section on 11073 Containment</a>  Good luck!</p>",
        "id": 229322958,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1615219378
    },
    {
        "content": "<p>Thank you very much!</p>",
        "id": 229422376,
        "sender_full_name": "Prasanth Vijayan",
        "timestamp": 1615265927
    }
]