[
    {
        "content": "<p>I want to check whether a particular patient (with Id) is on ventilator.  I am planning to use the following method:</p>\n<ol>\n<li>Query Device with patient ID.</li>\n<li>If Device is available and its code corresponds to ventilator, then it is assumed that the patient is on ventilator.</li>\n</ol>\n<p>Is it a good way to do using FHIR? Or Should query service request for ventilator? Which method shall be good.</p>\n<p>Thank you for the help!</p>",
        "id": 229851817,
        "sender_full_name": "Prasanth Vijayan",
        "timestamp": 1615471259
    },
    {
        "content": "<p>\"assumed\" is never a good thing when talking about medical devices connected to patients ... !  <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span>  <br>\nIOW your question is whether a device is in ACTIVE use for a specific patient ... it is a question of timestamps and not just relationships (references) ... though there are some other approaches \"in the works\" that should more directly address this, including a FHIR-based PCIM profile and related resources.  <br>\n<span class=\"user-mention\" data-user-id=\"192181\">@John Rhoads</span>  <span class=\"user-mention\" data-user-id=\"192966\">@Stefan Karl</span>  ... your opinions on this?</p>",
        "id": 229861244,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1615474472
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"395454\">@Prasanth Vijayan</span>   As <span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span>  says, when associations between patients and device data sources are not really, truly known to be right, things can go very, very badly. Every clinician in every risk analysis meeting I've ever been in when this topic comes up has rightly pointed out, \"you can kill the patient\" (by treating the patient on the basis of the wrong person's physiological state).  So you want to step carefully, with a thorough analysis of everything that could possibly go wrong in your methods for attributing real-time data to a particular patient identity. There is some discussion of this in an IHE Device domain white paper and \"trial implementation\" HL7 V2 profile about \"Point-of-Care Identity Management\". See <a href=\"https://ihe.net\">https://ihe.net</a>. There is new work and prototyping going on in an IHE committee which will probably lead to a FHIR profile. Let me know if you are interested in sitting in or participating.</p>",
        "id": 229942568,
        "sender_full_name": "John Rhoads",
        "timestamp": 1615503107
    },
    {
        "content": "<p>And that goes for even trying to ascertain if a specific patient is intubated with a ventilator ... right now.</p>",
        "id": 229956994,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1615510881
    },
    {
        "content": "<p>Ok Thank you very much. I need to have a detailed study in this topic. :)</p>",
        "id": 230014341,
        "sender_full_name": "Prasanth Vijayan",
        "timestamp": 1615548877
    },
    {
        "content": "<p>There could exist a gap/lag between the record/data and the reality even when the ventilator was connected.</p>",
        "id": 232132371,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616895583
    }
]