[
    {
        "content": "<p>Hi there, </p>\n<p>apologies if this is not the correct thread to post this in.</p>\n<p>My question: Is there a way to somehow reference multiple device sources for one observation?</p>\n<p>Use Case: Our system is receiving a daily step count from the Apple Health Kit. The step count from the health kit can potentially originate from multiple sources (e.g Apple Watch + iPhone itself). One measurement (daily step count) is sent to us via a FHIR conform POST Request. </p>\n<p>Since the data is supposed to be used for a study, we need this request to include information about all devices that are involved (including product type, manufacturer and OS version).</p>\n<p>If I understood correctly, the documentation states that there can only be one referenced measurement device for an observation (<a href=\"https://www.hl7.org/fhir/observation.html\">https://www.hl7.org/fhir/observation.html</a>). </p>\n<p>As a first idea, I thought it would maybe work if I only have one Object of resourceType \"Device\" but add multiple \"deviceName\" as well as \"version\" and \"identifier\" objects. But I am very unsure if this is a good/valid approach in any way.</p>\n<p>Something like this:</p>\n<p>{ \"resourceType\": \"Bundle\",<br>\n    \"type\": \"transaction\",<br>\n    \"entry\": [{ \"resource\": { <br>\n      \"contained\": [{ \"resourceType\": \"Device\", \"id\": \"1\", \"manufacturer\": \"Apple Inc\",<br>\n        \"deviceName\" : [<br>\n            { \"name\" : \"Apple Watch Series X\", \"type\" : \"model-name\" },<br>\n            { \"name\" : \"iPhone XYZ\", \"type\" : \"model-name\" }],<br>\n        \"version\" : [<br>\n            { \"value\" : \"7.0\"},<br>\n            { \"value\" : \"8.0\"}],<br>\n        \"identifier\": [<br>\n            { \"value\": \"device_id_1\" },<br>\n            { \"value\": \"device_id_2\" }] },<br>\n    \"resourceType\": \"Observation\", \"device\": { \"reference\": \"#1\" }, } }]}</p>\n<p>Thank you very much in advance for any help or advice on this matter :)<br>\nCheers!</p>",
        "id": 226119637,
        "sender_full_name": "Cado",
        "timestamp": 1613125328
    },
    {
        "content": "<p>Using device.reference one can construct a hierarchy of devices, one device being part of another one (e.g. an App, on a cell phone, OR a watch, and a cell phone app).</p>",
        "id": 226123063,
        "sender_full_name": "René Spronk",
        "timestamp": 1613127796
    },
    {
        "content": "<p>If you are looking for a way to represent a second device which assumes the role of a gateway (connecting the sensor - in your case the Apple Watch) to the Internet, you should take a look at the gatewayDevice extension <a href=\"http://hl7.org/fhir/extension-observation-gatewaydevice.html\">http://hl7.org/fhir/extension-observation-gatewaydevice.html</a><br>\nAlso, take a look at the PHD implementation guide at <a href=\"http://hl7.org/fhir/uv/phd/2019May/\">http://hl7.org/fhir/uv/phd/2019May/</a></p>",
        "id": 226151723,
        "sender_full_name": "Jacob Andersen",
        "timestamp": 1613143911
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192966\">@Stefan Karl</span>  <span class=\"user-mention\" data-user-id=\"224056\">@Kathrin Riech</span>  <span class=\"user-mention\" data-user-id=\"192181\">@John Rhoads</span>  ... DoF reponse?</p>",
        "id": 226165744,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1613149766
    },
    {
        "content": "<p>I agree with Jacobs proposal - the gatewayDevice extension has been introduced to link a gateway device to an observation in addition to the measurement device.</p>",
        "id": 226357542,
        "sender_full_name": "Stefan Karl",
        "timestamp": 1613378937
    },
    {
        "content": "<p>Thanks a bunch for the quick replies and suggestions! I will try my luck with the gateway device extension :)</p>",
        "id": 226368594,
        "sender_full_name": "Cado",
        "timestamp": 1613386023
    },
    {
        "content": "<p>Hi again, </p>\n<p>one follow-up question for when I have a collection of devices (more than 2) that I want to link to the observation in addition to the main measurement device. Could I still use the gatewayDevice extension? It seems a bit odd to add more than one gatewayDevice extension to a single observation but I need a way to basically link an arbitrary amount of devices to one observation ... </p>\n<p>Thanks again if anybody can help me with this!</p>",
        "id": 227590571,
        "sender_full_name": "Cado",
        "timestamp": 1614169922
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"388396\">@Cado</span>   Could you give an example?  That would really help:  What observation and which kinds of devices (and why you need multiple devices for a single Observation instance)</p>",
        "id": 227653635,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1614193434
    },
    {
        "content": "<p>Yeah, of course. The use case is for a medical study monitoring patients and tracking specific activities, for example their daily step count. To be as accurate as possible about how a measurement was generated, they need to know exactly which devices were involved.</p>\n<p>As far as I know, you can use your phone to trace your steps as well as an Apple Watch or any other private device. Say, your watch tracks 200 steps, you take it off and your phone has tracked about 400 steps while an independent tracking app has counted 450 steps. This data will be run through an algorithm, duplicates will be deleted and you'll end up with one single end result for the accumulated steps of that day. I want to send this one value via a FHIR observation somewhere else and I need to include all devices that were involved in calculating this one value. Does that make more sense?</p>\n<p>I have actually thought of trying the first suggestion in this thread and appoint one parent device with an arbitrary amount of child devices. That would probably make more sense than trying to add multiple gatewayDevice extensions.</p>",
        "id": 227736105,
        "sender_full_name": "Cado",
        "timestamp": 1614243166
    },
    {
        "content": "<p>Yes, this hits VERY close to home:  I have the same issue between my iPhone tracking and my Oura ring.  Of course, both report to my Apple Health and then it shows up automagically in my Withing's HealthMate app.  Ditto for sleep info that is sent to Apple Health both from my bed and my ring - good news is that they are relatively consistent with each other BUT obviously one is better at some info (e.g., bed exits) and the other at different info (e.g., sleep stage tracking).  </p>\n<p>And I agree that the gatewayDevice extension path is pretty ... ugly.</p>\n<p>And there are analogous scenarios in the device informatics world where multiple data sources (including both sensors such as EEG and independent devices) are combined to drive a therapeutic algorithm that derives a more stable indicator.  For example, you might want to know an individual's temperature, but there could be 2 or 3 different sensors that report that temperature.  At one level, the clinician (or other applications) just want a temperature, but knowing the sources could become crucial in certain scenarios.  </p>\n<p>All to say:  I'd recommend using Observation.method to indicate that this is an algorithmically derived value (sorry, but I can't give you a specific recommendation as to a code) + Observation.derivedFrom (0...*) where you could identify a set of observation instances (each with a Device reference and if you want a sample array of readings).</p>",
        "id": 227782133,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1614265978
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span> Thanks a lot for your detailed response :) <br>\nI really like the idea of adding Observation.method to make it clear that the measurement is an algorithmically derived value.</p>\n<p>The other thing you suggested, adding Observation.derivedFrom and referencing a set of additional observation instances, might not work for me however. Problem is, I don't have access to the individual measurements that make up the accumulated result. I only get one number from the Health Kit and the additional info that a specific Apple Watch, a specific phone and maybe a specific third device were involved in calculating the end result. So I think it wouldn't make sense to separate those into individual observation instances. </p>\n<p>I tried to simply add all involved devices to the Observation.contained array and add a parent property to all but one. <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  Is this what you meant by using device.reference? <br>\n.....<br>\n\"resource\": {  \"contained\": [<br>\n{<br>\n                        \"resourceType\": \"Device\",<br>\n                        \"id\": \"1\",<br>\n                        \"manufacturer\": \"Apple Inc\",<br>\n                        \"deviceName\" : [ { \"name\" : \"Watch6,2\", \"type\" : \"model-name\" } ],<br>\n                        \"identifier\": [ { \"value\": \"id_1\" } ] },<br>\n                    {<br>\n                        \"resourceType\": \"Device\",<br>\n                        \"id\": \"2\",<br>\n                        \"manufacturer\": \"Apple Inc\",<br>\n                        \"deviceName\" : [{ \"name\" : \"iPhone 11 Pro\",  \"type\" : \"model-name\" }],<br>\n                        \"identifier\": [ { \"value\": \"id_2\"  } ],<br>\n                        \"parent\": { \"reference\": \"#1\"  } },<br>\n                    {<br>\n                        \"resourceType\": \"Device\",<br>\n                        \"id\": \"3\",<br>\n                        \"manufacturer\": \"Apple Inc\",<br>\n                        \"deviceName\" : [{ \"name\" : \"random private device\", \"type\" : \"model-name\" }]<br>\n                        \"identifier\": [{ \"value\": \"id_3\" }],<br>\n                        \"parent\": {  \"reference\": \"#1\"  } <br>\n}],<br>\n            \"resourceType\": \"Observation\",<br>\n            \"device\": {<br>\n                \"reference\": \"#1\"<br>\n            }, <br>\n........... }</p>\n<p>But it seems that when I try to parse this using our FHIR framework (FhirContextForR4().newJsonParser().encodeResourceToString(observation)), the only thing that remains in the Observation.contained array is the first entry that I specifically referenced within the device property. All other data is simply lost. Like I said, kinda new to FHIR tbh ^^\" so I might be misunderstanding how this works.</p>\n<p>But is there an option where I can add info about additional devices that do not stand on their own (they don't need to). I simply need this information stored somewhere inside one observation instance so it can be forwarded in a FHIR-conforming way.</p>",
        "id": 228366232,
        "sender_full_name": "Cado",
        "timestamp": 1614670644
    },
    {
        "content": "<p>w.r.t. my proposal to use .derivedFrom, the focus was on a simple way to put a list of Device instance references and not on including all the related sample data.  A single value is fine IMHO, and in fact, you probably DON'T want to pass on all that info on at the same time.</p>",
        "id": 228431550,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1614699921
    },
    {
        "content": "<p>IIRC there was a change request to add Device to observation .performer</p>",
        "id": 228468178,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1614712496
    },
    {
        "content": "<p>I believe the use case was the same as is hinted above- it's not really a person using a device that takes a measurement, but rather a device that does some determination (e.g. a clever algorithm in a system)</p>",
        "id": 228468292,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1614712546
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"388396\">@Cado</span> <br>\nI would probably model this along the lines also suggested by Todd: In the real world, you have a number of devices. Each device collected some data. You do not have access to the original data but only the aggregated / total sum or whatever. So one suggestion that maps this into a FHIR model could be the following pseudo code with aggregated data from 3 sources:</p>\n<div class=\"codehilite\"><pre><span></span><code>{\n  resourceType: Observation,\n  derivedFrom: [ obs-1, obs-2, obs-3 ],\n  valueQuantity: { THE_AGGREGATED_VALUE },\n  contained: [\n    {\n      id: obs-1\n      resourceType: Observation,\n      dataAbsentReason: { not-asked }\n      device: { DEVICE_1 }\n    },\n    {\n      id: obs-2\n      resourceType: Observation,\n      dataAbsentReason: { not-asked }\n      device: { DEVICE_2 }\n    },\n    {\n      id: obs-3\n      resourceType: Observation,\n      dataAbsentReason: { not-asked }\n      device: { DEVICE_3 }\n    }\n  ]\n}\n</code></pre></div>",
        "id": 228775752,
        "sender_full_name": "Jacob Andersen",
        "timestamp": 1614866183
    },
    {
        "content": "<p>You can only have contained resources if they reference the parent or are referenced by the parent.  What's the relationship between parent and contained resources here?</p>",
        "id": 228779271,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614867507
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I assume you are answering Cado's question from March 2nd about why content is disappearing, right? If the comment was instead addressed to me, please elaborate.</p>",
        "id": 228780791,
        "sender_full_name": "Jacob Andersen",
        "timestamp": 1614868025
    },
    {
        "content": "<p>It was addressed to you  <span class=\"user-mention\" data-user-id=\"191693\">@Jacob Andersen</span>.  Your example showed multiple contained Observations, but no reference from the containing Observation to the contained Observations - which isn't conformant.  It wasn't clear to me what the relationship should be either.</p>",
        "id": 228787358,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614870287
    },
    {
        "content": "<p>But there <em>are</em> references from the parent to the contained resources, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> The derivedFrom property of the parent points to all three contained observations</p>",
        "id": 228790948,
        "sender_full_name": "Jacob Andersen",
        "timestamp": 1614871387
    },
    {
        "content": "<p>That wasn't shown in the instance you posted.  If you've got derived from, that would work.  So you're essentially saying \"this result was derived from 3 other observations about which no details are known other than what devices were used\"?  Would you not want to reflect the chain of derivation?  I.e. would obs-3 not have a derivation relationship to obs-2 and obs-2 having a derived relationship to obs-1?</p>",
        "id": 228791565,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614871567
    },
    {
        "content": "<p>Yes, that is in line 3 of the code block - and has been there all along.</p>\n<p>As I understand Cado's original question [elaborated in the posting on Feb 25 at 9:52 am], there is no logical derivation chain. I understand the use case such that there is a number of devices that all provide data. These original data are unknown because some piece of software aggregates/summarises them. This is what I am attempting to reflect here.</p>",
        "id": 228792391,
        "sender_full_name": "Jacob Andersen",
        "timestamp": 1614871817
    },
    {
        "content": "<p>In other words: I am modelling an (unordered) set of devices contributing to the observation in contrast to an ordered list of devices.</p>",
        "id": 228794963,
        "sender_full_name": "Jacob Andersen",
        "timestamp": 1614872634
    },
    {
        "content": "<p>ok</p>",
        "id": 228799706,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614874071
    }
]