[
    {
        "content": "<p>Hi, we are looking into a standardization strategy based on ISO/IEEE 11073 SDC combined with FHIR PoCG IG (<a href=\"http://hl7.org/fhir/uv/pocd/2018Jan/\">http://hl7.org/fhir/uv/pocd/2018Jan/</a>). There has come up questions on whether the PoCG IG is expected to be basis for products like Microsoft Azure API for FHIR/ IoT connector, Google healthcare API etc. Anyone have information on how big vendors plan to integrate with devices through FHIR? Cheers</p>",
        "id": 232169273,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1616940567
    },
    {
        "content": "<p>Best way to get that information is to dial into one of the Devices on FHIR PoCD calls (every Monday at 0600 Pacific) and ask - the context of your question is (I think) the interface between 11073 SDC (\"from the device interface\") and FHIR (integration with everything beyond the SDC networked systems &amp; devices) ... that will be directly addressed in the IHE-HL7 Gemini SDPi+FHIR profile specification (specifically a SOMDS FHIR Gateway) that will leverage this version of the PoCD DoF IG w/ SDC mapping ... specifically for implementation in products.  That should be out for public review in the June timeframe. </p>\n<p>All to say, I've heard that YES - vendors are starting to implement this in products ... or at least have support included in their \"near term\" plans (i.e., later in '21, definitely '22).  BUT this all depends on market demand ... and currently, the vast majority of demand is directly addressed by the IHE Devices V2-based profiles.  that's starting to change, but remains more in the \"noise\" vs. a clear need for product support.  </p>\n<p>And of course, that same SDPi profile has \"HL7 V2 Gateway\" &amp; \"IHE DEC Gateway\" actors defined also.  :-)  </p>\n<p>Hope that helps ...</p>",
        "id": 232259501,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1617020887
    },
    {
        "content": "<p>Thanks Todd, very helpful, I will dial in.</p>",
        "id": 232262579,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1617022418
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span>  and you did ... speedy!!!</p>",
        "id": 232266601,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1617024167
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span>  Very interesting discussions - I will be back :). And I hope the work we are doing in Norway will send some demand signals to the market quite soon. Regarding the specifics around the AzureAPIs IoT connectors relation to this standardization work - should i ping Microsoft directly - or could that be a topic for the call? Cheers</p>",
        "id": 232285977,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1617031296
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span>  I'd say do it in parallel!  Then you can share with us what you hear back and compare notes with the others on the call who have done the same.  Note that we punted on the call this coming Monday ... so it will be the 2nd Monday in April ... almost April already!</p>",
        "id": 232287874,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1617032096
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span> Hi Todd, we are planning to send out an RFI at the end of next week requesting feedback on support and roadmap from the vendor market on the use of IEO/ IEEE 11073 SDC, FHIR PoCG IG and FHIR PHD IG. We are projecting the use of these standards in a future national target architecture for medical device interoperability.  If there are a few minutes on the agenda in the Devices on FHIR-meeting Monday May 3rd, we would like to shortly present our plans and discuss a couple of clarfications.  Cheers,</p>",
        "id": 236517937,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1619620698
    }
]