[
    {
        "content": "<p>Hallo Zusammen,<br>\nkurz zum Kontext:<br>\nIch programmiere gerade eine App für Android Geräte und möchte praktisch den Prozess der Wunddokumentation als digitales Format erstellen.<br>\nIch habe dazu schon den eWundbericht auf Simplifier angeschaut. <br>\nMeine Sicht ist rein auf der Clientseite, sprich ich teste zunächst nur mit dem öffenlichen Server <a href=\"https://hapi.fhir.org/baseR4\">https://hapi.fhir.org/baseR4</a>.</p>\n<p>Ich möchte innerhalb der App zunächst einen QR Code Scannen um mich als \"Pflegepersonal\" zu verifizieren.<br>\nIn der nächsten Ansicht wird dann ein QR des Patienten gescannt und schon vorhandene Daten wie Name usw. vom Server abgerufen.<br>\nIn der nächsten Ansicht spiegelt findet sich die Wunddokumentation, welche wie ein klassisches Wunddokumentations-Formular aufgebaut ist. <br>\nIn einer anderen Ansicht kann man eine Art Historie mit grafischer Aufbereitung sehen, um z. B. eine Verkleinerung der Wunde über die letzten 3 Tage schnell zu sehen. </p>\n<p>Meine Überlegungen hierzu waren bezüglich der Ressourcen von FHIR folgende:</p>\n<p>Zunächst wird die Ressource des Pflegepersonals verifiziert. (Ich denke da gibt es wie für Patient auch eine Ressource)<br>\nDann wird ein Patient gescannt und vom Server geholt. (Hierzu gibt es ja die Ressource Patient)<br>\nDas führt dazu das eine Begegnung erstellt wird. (Also die Ressource Encounter, wobei ich mir nicht sicher bin ob ich dies zwingend benötige)<br>\nUnd für den Prozess der Wunddokumentation (also beim Ausfüllen der Felder bezüglich Wundexsudat usw. ) wird eine Observation erstellt.<br>\nDie Observation beinhaltet dann ValueSets über Wundart usw. die nach SNOMED CT definiert sind. <br>\nSo wie beim eWundbericht hier beschrieben: <a href=\"https://simplifier.net/guide/eWundbericht/Wunde\">https://simplifier.net/guide/eWundbericht/Wunde</a> .<br>\nDer Komplette Prozess mit allen Ressourcen wird dann als Bundle an den Server übermittelt.</p>\n<p>Sind die Überlegungen soweit denn korrekt, bzw. übersehe ich etwas?<br>\nIch verstehe z. B. noch nicht wie ich eine Variable erstelle die das Wundexsudat oder die Wundart abbildet.</p>\n<p>Ich möchte ja nicht den kompletten eWundbericht nachmachen/diesen voll umfänglich verwenden, sondern nur zu Testzwecken für meine App innerhalb meiner Bachelorarbeit ein Szenario entwerfen bei dem Ich wie oben beschrieben den Prozess abbilden kann. Mir ist dabei aber nicht wirklich schlüssig wie ich gerade die Attribute der Wunddokumentation wie z. B. Wundränder oder ähnliches erstelle.</p>\n<p>Und kann ein StandardServer wie der R4 diese Daten dann überhaupt verwendet, oder müsste dieser das CodeSystem SNOMED CT auch implementiert haben. </p>\n<p>Entschuldigung falls ich es etwas ungenau formuliert habe, jedoch ist die FHIR Thematik sehr schnell riesig und schwierig für mich dies nur Anhand der Dokumentation (<a href=\"https://www.hl7.org/fhir/\">https://www.hl7.org/fhir/</a>) zu verstehen. </p>\n<p>Vielen Dank für Ihre Unterstützung.</p>\n<p>Beste Grüße<br>\nMorris Miltz</p>",
        "id": 244590090,
        "sender_full_name": "Morris Miltz",
        "timestamp": 1625155454
    },
    {
        "content": "<p>Einem normalen FHIR-Server SNOMED CT mitgeben zu wollen dürfte schwierig werden. In dem Fall empfiehlt es sich vermutlich eher, einen lokalen SNOMED CT Server aufzubauen, z.B. snowstorm, und diesen als Terminologie-Server für SNOMED-CT-Codes zu nehmen.<br>\nIch möchte aber auch darauf hinweisen, dass ich den eWundbericht-IG gerade überarbeite, bevor ich ihn über den Sommer ins Ballot gebe. Vielleicht hilft es Dir für Deine Arbeiten, die Profile und ValueSets, die Du brauchst, einmal herunterzuladen. Das erste Package gibt es voraussichtlich in 3 Wochen.</p>",
        "id": 244916471,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1625479343
    },
    {
        "content": "<p>Okay, vielen Dank für die Antwort.<br>\nDas bedeutet dann, dass der Code aus der Dokumentation (<a href=\"https://hapifhir.io/hapi-fhir/docs/model/working_with_resources.html\">https://hapifhir.io/hapi-fhir/docs/model/working_with_resources.html</a>)<br>\nnur für eine reine oberflächliche Beschreibung dient:</p>\n<p>Coding coding = observation.getCode().addCoding();<br>\ncoding.setCode(\"29463-7\").setSystem(\"http://loinc.org\").setDisplay(\"Body Weight\");</p>\n<p>Aber wenn ich zunächst nichts validieren möchte sollte dies dennoch funktionieren?</p>\n<p>Vielen Dank nochmal für Ihre Hilfe.<br>\nBeste Grüße</p>",
        "id": 244917376,
        "sender_full_name": "Morris Miltz",
        "timestamp": 1625479878
    },
    {
        "content": "<p>Da aktuell die meisten ValueSets als example oder preferred gesetzt sind, sollte auch so ziemlich alles validieren. Wenn Du gegen ein Profil aus dem IG validieren möchtest, ist es wichtig, dass die fixen, also festgesetzten Werte übereinstimmen. Wenn du allgemein gegen die normale FHIR-Spec validierst, dann prüft er nur das, was die grundlegende Definition ist, also z.B. beim Patienten, wenn das Geschlecht vorhanden ist, ob es mit der Spec übereinstimmt und nicht irgendein custom value \"z.B. \"w\" für weiblich eingetragen ist (\"w\" ist kein erlaubter Wert ;-) ).</p>",
        "id": 244917822,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1625480166
    },
    {
        "content": "<p>Super, Danke Ihnen :)</p>",
        "id": 244918102,
        "sender_full_name": "Morris Miltz",
        "timestamp": 1625480384
    },
    {
        "content": "<p>Gerne Interoperabilitäts-Du.</p>",
        "id": 244918158,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1625480408
    },
    {
        "content": "<p>Einverständnis vorausgesetzt.</p>",
        "id": 244918177,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1625480421
    },
    {
        "content": "<p>Gerne, dann Danke dir ;)</p>",
        "id": 244918447,
        "sender_full_name": "Morris Miltz",
        "timestamp": 1625480642
    }
]