[
    {
        "content": "<p>Ist es möglich einem Patienten zusätzliche Attribute zu geben?</p>\n<p>Konkret: in der Wunddokumentation gibt es ja spezifische faktoren die beantwortet werden müsssn, ist das wundexsudat gelb oder rot usw.<br>\nHierzu würde ich bestimmte attribute erstellen wollen, die ich dann in der abfrage, wenn ich einen patienten aufrufe, kurz abfragen kann?</p>",
        "id": 233318113,
        "sender_full_name": "Morris Miltz",
        "timestamp": 1617715674
    },
    {
        "content": "<p>ja, mit extension</p>",
        "id": 233318666,
        "sender_full_name": "Sohrab Hejazi",
        "timestamp": 1617715882
    },
    {
        "content": "<p>Hallo zusammen.<br>\nGenerell würde ich dafür aber eine Observation nehmen, da sonst alles als Extension an den Patienten geflanscht werden kann. <br>\nWir haben für den eWundbericht auch schon dazu Profile, allerdings mit dem Fokus auf Überleitung.<br>\n<a href=\"https://simplifier.net/ewundbericht\">https://simplifier.net/ewundbericht</a>.<br>\nViele Grüße<br>\nMareike</p>",
        "id": 233490226,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1617803308
    },
    {
        "content": "<p>Ich würde auch empfehlen, die Wunde als Condition zu hinterlegen und die Observations auf die Wunde verweisen zu lassen. So hat man abgefangen, dass ein Patient mehrere Wunden haben kann, die unterschiedliche Exsudatfarben haben.</p>",
        "id": 233497484,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1617805729
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"196115\">Mareike Przysucha</span> <a href=\"#narrow/stream/241189-german-.28Students.29/topic/Frage/near/233490226\">said</a>:</p>\n<blockquote>\n<p>Hallo zusammen.<br>\nGenerell würde ich dafür aber eine Observation nehmen, da sonst alles als Extension an den Patienten geflanscht werden kann. <br>\nWir haben für den eWundbericht auch schon dazu Profile, allerdings mit dem Fokus auf Überleitung.<br>\n<a href=\"https://simplifier.net/ewundbericht\">https://simplifier.net/ewundbericht</a>.<br>\nViele Grüße<br>\nMareike</p>\n</blockquote>\n<p>Vielen Dank Mareike Przysucha, soweit bin ich tatsächlich noch nicht durchgestiegen was den Aufbau bzw. die Arbeit mit FHIR betrifft. Wie ich Profile wie das Basisprofil DE(R4) verwende ist mir noch unklar.<br>\nEbenso wie diese funktionieren, ob ich zunächst einen eigenen FHIR Server erstellen muss um mit solchen Profilen zu arbeiten, oder ob ich diese direkt in mein z. B. Kotlin-Projekt direkt einbinden/implementieren kann <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 233508353,
        "sender_full_name": "Morris Miltz",
        "timestamp": 1617808597
    },
    {
        "content": "<p>Gerne doch.<br>\nZu der Frage bzgl. der Basisprofile: Vieles von dem, was dort profiliert ist, sind Teile eines gesamten Profils. So ist beispielsweise der Patient als solches nicht profiliert, sondern einzelne Bestandteile, z.B. die Identifikatoren oder die deutsche Extension für das Geschlecht, da wir, im Vergleich zum Standard, das Geschlecht \"Divers\" extra kennzeichnen wollen. Daher solltet Ihr Euch vorher überlegen, wie in dem Anwendungsfall der Patient aussehen soll. Auch wurde in den Basisprofilen der HumanName extra profiliert, weil wir in Deutschland aufgrund unserer Historie keine Adelstitel mehr haben, aber Zusätze wie \"Prinzessin\" oder \"Graf\" immer noch im Namen mitgeführt werden. </p>\n<p>Zu der Frage des FHIR-Servers: Dies hängt vom UseCase ab. Soll die App die Daten an ein Primärsystem weitergeben? Dann wird kein FHIR-Server benötigt, sondern eine entsprechende Schnittstelle des Primärsystems, von dem die Daten abgerufen werden und an die die Daten weitergegeben werden. Ist die App ein alleinstehendes System, so wird vermutlich ein FHIR-Server benötigt, der die Daten speichert.</p>\n<p>Ich hoffe, ich konnte etwas helfen.</p>",
        "id": 233532921,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1617817745
    },
    {
        "content": "<p>Vielen Dank für Ihre Antwort.<br>\nPrinzipiell soll die App zunächst nur mit einem FHIR Server kommunizieren, und hier Patientendaten abrufen, verändern und wieder an den FHIR Server übermitteln. In weiteren Schritten sollen auch neue Patienten angelegt werden können und diese dann an einen FHIR Server übermittelt werden.</p>\n<p>Habe ich es bezüglich dem ewundbericht richtig verstanden, dass ich dies dann nicht einfach mit dem Public Server R4 verwenden kann, sondern hier einen eigenen Server installieren muss, auf dem ich zunächst das de.basisprofil.r4 installiere um dann den eWundbericht verwenden zu können?</p>\n<p>Verzeihen Sie bitte falls meine Fragen etwas dümmlich klingen <span aria-label=\"grimacing\" class=\"emoji emoji-1f62c\" role=\"img\" title=\"grimacing\">:grimacing:</span></p>",
        "id": 233659671,
        "sender_full_name": "Morris Miltz",
        "timestamp": 1617891411
    },
    {
        "content": "<p>Alles gut. Jeder fängt einmal an. </p>\n<p>Aktuell finalisieren wir noch die Profile für den eWundbericht, sie sind quasi in Version 0.8, wenn 0.9 die Version vor dem Nationalen Ballot sind. Sobald wir auf Version 0.9 sind (voraussichtlich Mitte Mai), aber auch schon vorher können die Profile einem Server \"vorgestellt\" werden, indem man sie hochlädt. Dann kann der Server mit <code>validate</code> die Ressourcen validieren. Sofern man aber gar nicht validieren möchte, kann man die Resourcen nach den Profilen bauen, und lässt hinterher die Prüfung weg. Letztlich würde ich auch vermuten, dass unsere Profile vermutlich eher eine Orientierung sein werden, da die Zielsetzung unterschiedlich ist (Dokumentation vs. Kommunikation). </p>\n<p>Im Zweifelsfall kann auch im deutschen Hauptstream <a class=\"stream\" data-stream-id=\"179183\" href=\"/#narrow/stream/179183-german-.28d-a-ch.29\">#german (d-a-ch)</a> die eine oder andere Frage gestellt werden, dort sind mehrere Personen unterwegs, die sich besser mit FHIR auskennen.</p>\n<p>Viel Erfolg weiterhin!!!</p>",
        "id": 233814385,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1617972430
    }
]