[
    {
        "content": "<p>Hallo Zusammen, <br>\nich würde gerne einen Patienten anlegen und diesem Referenzen für einige Observations (wie z. B. Wundfarbe, Wundgröße usw.) mitgeben,<br>\ndamit ich im Anschluss diesen Patienten nur anhand der ID finde und lade, und so auch die Werte der Observations bekomme, und nicht diese erst<br>\nerneut abfragen muss. </p>\n<p>Hierzu war meine Überlegung den Patienten und die Observations als Bundle zu übergeben. Somit müsste ich aber immer nach dem Bundle suchen und eine Historie würde nicht funktionieren oder?</p>\n<p>Die Historie soll im Anschluss verwendet werden um z. B. einen Wundverlauf darstellen zu können.</p>\n<p>Gibt es die Möglichkeit eine Art Observation-Array zu erstellen, das dann einmalig mit dem Patienten referenziert wird, und die einzelnen Observations dennoch Versionen haben? </p>\n<p>Vielen Dank für Ihre Hilfe.</p>\n<p>Beste Grüße<br>\nMorris Miltz</p>",
        "id": 244915770,
        "sender_full_name": "Morris Miltz",
        "timestamp": 1625478895
    },
    {
        "content": "<p>Hallo Morris. <br>\nBist Du sicher, dass ein Bundle als Bundle hinterlegt wird und Du nicht auf die einzelnen Ressourcen zugreifen kannst?<br>\nAnsonsten frag einfach mal im <a class=\"stream\" data-stream-id=\"179183\" href=\"/#narrow/stream/179183-german-.28d-a-ch.29\">#german (d-a-ch)</a>-Stream nach.<br>\nViele Grüße</p>",
        "id": 244916122,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1625479105
    },
    {
        "content": "<p>Ich dachte das Bundle wird für z. B. die Transaktion vom Client zum Server verwendet. Bin mir nicht sicher, ob dies dann einen Patienten und eine Observation anlegt und automatisch referenziert, weil es als Bundle übergeben wurde?<br>\nWollte meine Fragen zunächst einmal hier stellen, da ich noch in den Anfängen mit FHIR stecke und ich dachte dieser Channel sei eher für Anfänger<br>\nBeste Grüße und Danke</p>",
        "id": 244916758,
        "sender_full_name": "Morris Miltz",
        "timestamp": 1625479547
    },
    {
        "content": "<p>Im Zweifel einfach mal mit einem Testserver und Fake-Daten ausprobieren und schauen, was passiert.</p>",
        "id": 244916878,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1625479595
    }
]