[
    {
        "content": "<p>I have set Azure FHIR Server instance with 400 RU/s throughput. Sometimes (once in a month) HTTP Requests, both GET and POST,  to the FHIR Server via firely-net-api, fail after 100 seconds (i.e 1 minute 40 seconds or 100000 milliseconds) duration, with response status = 'Canceled' in Azure's ApplicationInsights. And the calls fail within the time span of around one hour (although not all calls fail, just around 20 out of 100 fail).</p>\n<p>I am unable to find out the reason why it is happening.  Can someone please help me?</p>\n<p>Note: As the FHIR Server instance is for Development, there is no requests traffic to it.</p>",
        "id": 209100727,
        "sender_full_name": "Muhammad Fahad Nadeem",
        "timestamp": 1599230237
    },
    {
        "content": "<p>Hi Muhammad, do you mind opening an issue against the FHIR Server repository (<a href=\"https://github.com/microsoft/fhir-server/issues\">https://github.com/microsoft/fhir-server/issues</a>). I'm interested to see if we can set something up to replicate so we can track this down. Also want to confirm, are you running the OSS project yourself or Azure API for FHIR (provisioned from the Azure Portal)?</p>",
        "id": 209117018,
        "sender_full_name": "Brendan Kowitz",
        "timestamp": 1599238638
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195075\">@Brendan Kowitz</span>  I am using Azure API for FHIR (provisioned from the Azure Portal).</p>",
        "id": 209264159,
        "sender_full_name": "Muhammad Fahad Nadeem",
        "timestamp": 1599462857
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"330296\">@Muhammad Fahad Nadeem</span>  I have more information on this, can you confirm which Azure region you are using?</p>",
        "id": 209672945,
        "sender_full_name": "Brendan Kowitz",
        "timestamp": 1599755440
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195075\">@Brendan Kowitz</span> That Azure FHIR API I am consuming is deployed in West US 2, whereas the proxy application, I was making calls to Azure FHIR API through, is deployed in West US.</p>",
        "id": 209755714,
        "sender_full_name": "Muhammad Fahad Nadeem",
        "timestamp": 1599814774
    }
]