[
    {
        "content": "<p>Is there some possibility to generate classes, that represent resources under profiles? Profiles can have different cardinalities, so seeing it in code how an object is supposed to look can be quite helpful.</p>",
        "id": 154902710,
        "sender_full_name": "Johannes Höhn",
        "timestamp": 1547196306
    },
    {
        "content": "<p>The classes don't change, although a profile can reduce the cardinality, it is still a collection or not on the wire.<br>\nYou could think of the profile as custom validation business rules on the core resources (hence you'll not that each property has the extension item under the element base class)</p>",
        "id": 154903112,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1547196914
    },
    {
        "content": "<p>(this keeps coming up - maybe worth some explanation somewhere in the specs? )</p>",
        "id": 154911789,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1547207180
    },
    {
        "content": "<p>At least in the dotnet docs or someone's blog.</p>",
        "id": 154950699,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1547244124
    },
    {
        "content": "<p>Not dotnet specifically - recently I saw the same question asked about HAPI</p>",
        "id": 154952518,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1547245724
    },
    {
        "content": "<p>There seems to be a general assumption that to work with a specific profile you need tailored classes - that is not the way things work (or should work)</p>",
        "id": 154952571,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1547245773
    },
    {
        "content": "<p>True, but think does deserve to be where the devs are looking.<br>\nAt least a paragraph summarising on the NuGet package docs and reference somewhere with detailed notes.</p>",
        "id": 154962492,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1547257655
    },
    {
        "content": "<p>While that is technically true, I agree with <span class=\"user-mention\" data-user-id=\"197584\">@Johannes Höhn</span> - if a profile restricts the max cardinality to 1, there's no reason you should work with a list of size 1 in the API.</p>",
        "id": 155240041,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1547631280
    },
    {
        "content": "<p>It's more confusing than helpful.</p>",
        "id": 155240064,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1547631320
    },
    {
        "content": "<p>I guess it depends ;p The FHIR API provides generic and reusable PoCo classes, these require a common structure (with property type and cardinality) for all kinds of reasons, such as serialization. However it is entirely possible to author (derive) custom classes for specific profiles and targeted to specific use cases, manually or using code generation. Such custom classes could then implement additional convenience properties for list elements with cardinality constrained to a single element.</p>",
        "id": 155322557,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1547718495
    },
    {
        "content": "<blockquote>\n<p>I guess it depends ;p The FHIR API provides generic and reusable PoCo classes, these require a common structure (with property type and cardinality) for all kinds of reasons, such as serialization. However it is entirely possible to author (derive) custom classes for specific profiles and targeted to specific use cases, manually or using code generation. Such custom classes could then implement additional convenience properties for list elements with cardinality constrained to a single element.</p>\n</blockquote>\n<p>Very interested in this capability as we are working heavily on profiles and extensions.  Is there indeed a way to add some structure definitions and regenerate from them....to get new CodeGenerated POCOs?  It seems that all the building blocks are in the HL7.FHIR API, but I dont quite see any tests or docs that explain how we can add our own profiles, ideally to get our own POCOs.</p>",
        "id": 157606706,
        "sender_full_name": "Bob Barnard",
        "timestamp": 1549373973
    },
    {
        "content": "<p>Or....put another way....if we CANT generate POCOs for our profiled resources, what is the process for using profile instances w/ the HL7.FHIR API?  If I wanted to, say, create an instance of BMI (derives from Observation), how does one do that?  Ultimately if we can define profiles and interact w/ them via strongly typed code then we get the same benefits as being able to generate POCOs for our profiled resources.   Thanks!</p>",
        "id": 157610880,
        "sender_full_name": "Bob Barnard",
        "timestamp": 1549377755
    },
    {
        "content": "<blockquote>\n<p>create an instance of BMI (derives from Observation)</p>\n</blockquote>",
        "id": 157611640,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1549378321
    },
    {
        "content": "<p>You just use the existing Model.Observation class</p>",
        "id": 157611708,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1549378351
    },
    {
        "content": "<p>what makes it a BMI?  The constructor doesnt seem to take the profile.</p>",
        "id": 157613044,
        "sender_full_name": "Bob Barnard",
        "timestamp": 1549379441
    },
    {
        "content": "<p>The fact that you respect the rules of the BMI profile: fill the elements that need to be filled, use the right value sets etc.</p>",
        "id": 157617861,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1549383219
    },
    {
        "content": "<p>(and set the profile in the Meta element - although I do not think this is strictly needed)</p>",
        "id": 157617965,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1549383297
    },
    {
        "content": "<p>Hmmmm....so there is no way to get strong typing based on the profile (e.g. all of the constraints)?  It really does seem then like a nice feature to add to this API would be the ability of consumers to add their own StructureDefinition and then re-run whatever generation process exists so that we can have our own derived profile resources and SEE our constraints/extensions on POCOs.     I don't suppose anyone knows how the generation process works...I may be able to add that functionality myself, but I'm struggling to see how to regenerate classes from the source profiles</p>",
        "id": 157620547,
        "sender_full_name": "Bob Barnard",
        "timestamp": 1549385636
    },
    {
        "content": "<p>it's not so simple because a resource can conform to multiple different profiles at once. And there's no particular way to know whether a resource conforms to a profile than to test to see whether it conforms to a particular set of rules</p>",
        "id": 157629905,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1549392623
    },
    {
        "content": "<p>it's better to generate a profile is an interface/facade to the underlying resource</p>",
        "id": 157629951,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1549392660
    },
    {
        "content": "<p>but no one has generated these yet, either in java or c#, so far as I know</p>",
        "id": 157629971,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1549392678
    },
    {
        "content": "<p>Strong typing based on (generic) profiles implies that all profile constraints can be verified at compile time. That is quite a challenging problem, to say the least. <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> has been working on generating code and FHIR profiles from an abstract syntax, he might be able to shed some light on this.<br>\nHowever within the scope of a limited use case, say a small mobile app, it would be feasible to manually author custom PoCo classes for relevant profiles, to facilitate app developers. You can easily subclass existing PoCo's. Alternatively, you could implement your own custom PoCo classes based on the new ITypedElement layer.</p>",
        "id": 157685710,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1549456191
    },
    {
        "content": "<p>I have been struggling a bit with this issue as well. Are there any way that one could contribute to the fhir-net-api docs?</p>",
        "id": 160119957,
        "sender_full_name": "Martin Andersen",
        "timestamp": 1551896184
    }
]