[
    {
        "content": "<p>Hi.<br>\nIt was suggested from the Implementers stream, that I'd ask the my question here.</p>\n<p>I'm struggeling with implementing Conformance for Queries. Describing Resources like AllergyIntolerance is fairly simple, but when it comes to describing a query, I'm having a bit of an issue.</p>\n<p>The custom query looks something like this: <a href=\"http://.../fhir?_query=revkirent&amp;name=&lt;someName\" target=\"_blank\" title=\"http://.../fhir?_query=revkirent&amp;name=&lt;someName\">http://.../fhir?_query=revkirent&amp;name=&lt;someName</a>&gt;</p>\n<p>The query will then return a Bundle with Practitioner, Organization and HealthcareService. </p>\n<p>What I want to do is to describe the different search options such as name:exact, name:contains, lastupdated, identifier in the metadata. However, I don't really understand how I'm supposed to do it using Operation and references. I however have made a lot of OperationDefinitions, but I have no clue where to put them in the Conformance object.</p>",
        "id": 153831578,
        "sender_full_name": "Harald Sømnes Hanssen",
        "timestamp": 1464963613
    },
    {
        "content": "<p>I think what you could do best is to put the information about the options in the description of the operation, so in OperationDefinition.description and perhaps also generate that in OperationDefinition.text, so it can be seen when you just display the human readable part.<br>\nIf I understand correctly, you also want to say your server supports this operation, by putting it in the metadata/Conformance statement of the server. That is done by putting the name and the reference to the operation in the Conformance resource. In code, skipping all other parts of filling in the Conformance resource, it could be done like this:<br>\n                var x = new Conformance();<br>\n                var y = new Conformance.ConformanceRestComponent();<br>\n                var z = new Conformance.ConformanceRestOperationComponent();</p>\n<div class=\"codehilite\"><pre>            z.Name = &quot;revkirent&quot;;\n            z.Definition = new ResourceReference() { Reference = &quot;http://example.org/fhir/OperationDefinition/revkirent&quot; };\n\n            y.Operation.Add(z);\n            x.Rest.Add(y);\n</pre></div>\n\n\n<p>All other operations you have defined can also be added in a similar way to the Conformance statement, just keep adding to 'y' after you've specified the right name and reference.<br>\nAnyone who would want to know more about the operations your server supports can first lookup which operations are supported in the metadata, and then retrieve the OperationDefinitions using the references you've provided and read the descriptions.</p>",
        "id": 153831579,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1464964866
    },
    {
        "content": "<p>So in other words, OperationDefinitions are resources which are referenced by ResourceReferences in the conformance object.</p>",
        "id": 153831699,
        "sender_full_name": "Harald Sømnes Hanssen",
        "timestamp": 1465111503
    },
    {
        "content": "<p>Correct.</p>",
        "id": 153831742,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1465176615
    }
]