[
    {
        "content": "<p>Hello,</p>\n<p>Using the API, I've successfully created message bundles that have  DocumentReference focus.  It makes reference to other resources residing alongside it in the message bundle (eg. the subject, author, organization).</p>\n<p>I'm inclined to define the resources referenced by the DocumentReference as contained references rather than to adjacent resources within the Bundle.  It is not evident how one goes about building a contained reference for the author or subject using the .NET API.  Can anyone provide some guidance or point me in the right direction?</p>\n<p>Also, does anyone have any thoughts on whether it is preferable to keep referenced resources at the outer/top level of the bundle rather than encapsulate them deeper within the bundle (ie. within the DocumentReference resource)?</p>\n<p>Thanks,<br>\nKirt</p>",
        "id": 179659293,
        "sender_full_name": "Kirt Noel",
        "timestamp": 1572638125
    },
    {
        "content": "<p>Add the contained resources to the Contained list with some arbitrary ids, and then reference them as <code>#[id]</code></p>",
        "id": 179663060,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1572640668
    },
    {
        "content": "<p>I won't use contained though - it is more likely not to be supported by servers</p>",
        "id": 179663124,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1572640693
    },
    {
        "content": "<p>(our mostly does not support them for example)</p>",
        "id": 179663143,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1572640713
    },
    {
        "content": "<p>If you want a lite resource then it can be contained. If it's a complete resource then it shouldn't.</p>\n<p>I used to make use of them to record identifiers but you can now do that within the reference.</p>",
        "id": 179700278,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1572697338
    },
    {
        "content": "<p>If you don't want it to be searchable, then it can be contained. The spec recommends it's use as a last resort if you can't identify the resource uniquely</p>",
        "id": 179816066,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1572858657
    }
]