[
    {
        "content": "<p>Hi Everyone,</p>\n<p>In our Application, we have patient's prescription data saved in the different tables in the database. For a single prescription, there are several columns including physical examination &amp; history, allergies, medication, advice, diagnosis, etc for a specific patient.</p>\n<p>I need to write a c# code where I can convert all this prescription information including patient information into FHIR format. I had tried writing c# code but I faced some issues:-</p>\n<ol>\n<li>We don't have any FHIR server implemented but just have to map the data from the database in FHIR, in this case, certain terminologies I don't understand are taken from the FHIR server. For example<br>\n\"entry\": [<br>\n{<br>\n\"fullUrl\": \"Composition/3b990853-f0fa-4046-8388-d71dd93a0fa1\",<br>\n\"resource\": {<br>\n\"resourceType\": \"Composition\",<br>\n\"id\": \"3b990853-f0fa-4046-8388-d71dd93a0fa1\",<br>\n\"identifier\": {<br>\n\"system\": \"<a href=\"https://www.max.in/document\">https://www.max.in/document</a>\",<br>\n\"value\": \"3b990853-f0fa-4046-8388-d71dd93a0fa1\"<br>\n},</li>\n</ol>\n<p>In the above-mentioned example, I don't have any Composition in the FullURL parameter.</p>\n<ol start=\"2\">\n<li>In the prescription format specified in SNOMED CT, this is the code for Prescription 440545006. And in the JSON structure of prescription, there is an only practitioner, patient, and medication however there is no information regarding allergies or diagnosis or complaints. How to include all this information in prescription FHR</li>\n</ol>\n<p>I tried to create a model class from JSON, but certain parameters remain null which doesn't make a valid FHIR format.</p>\n<p>Anyone who had implemented Converting raw data into prescription in c# kindly help.</p>",
        "id": 245955918,
        "sender_full_name": "jagjot singh Wadali",
        "timestamp": 1626267720
    },
    {
        "content": "<p>I think your question is more general about how to convert a prescription in your database to a Bundle containing several FHIR resources, and less about C#.  Moving your question to the <code>implementers</code> channel would give you a larger audience.</p>\n<blockquote>\n<p>I tried to create a model class from JSON, but certain parameters remain null which doesn't make a valid FHIR format.</p>\n</blockquote>\n<p>This could be a C# specific question, but I am not sure - what did you mean by \"create a model class\"?  Did you use a class from the .NET library and then serialized to json?  What did you try exactly?</p>",
        "id": 245956821,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1626268199
    }
]