[
    {
        "content": "<p>Hi. I'm having a lot of success with the Fhir .net libraries, thanks to all that have contributed.  I'm attempting to invoke the operation CoverageEligibilityRequest-submit using the .net R4 Fhir client. I see the types CoverageEligibilityRequest and CoverageEligibilityResponse, but it's not apparent to me how to submit (post) the request?</p>",
        "id": 192097136,
        "sender_full_name": "Joseph Evensen",
        "timestamp": 1585357238
    },
    {
        "content": "<p>You would use the FhirClient for that. It has methods for the regular interactions (like Create, Read, etc.) and also for invoking operations. In this case you will need to package your CoverageEligibilityRequest resource in a Parameters resource, and then use the TypeOperation method to send it to the submit operation on your server.</p>",
        "id": 192124790,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1585404239
    },
    {
        "content": "<p>Thanks for the reply. I had tried that previously, and the json sent to their server looks like</p>\n<p>{\"resourceType\": \"Parameters\", \"parameter\": [{ \"name\": \"CoverageEligibilityRequest\", \"resource\": { \"resourceType\": \"CoverageEligibilityRequest\", etc... }}]}</p>\n<p>to which their server responds with an error saying \"Payload resource Parameters does not match CoverageEligibilityRequest\". The example post http body they gave me just has the CoverageEligibilityRequest resource, it isn't wrapped in a \"parameters\" object, and it seems they do not support the parameters object.</p>",
        "id": 192132280,
        "sender_full_name": "Joseph Evensen",
        "timestamp": 1585415157
    },
    {
        "content": "<p>Your parameter should be called 'resource' instead of the name of the resource type. But other than that, it does sound like the server does not support a resource packed within a Parameters, even though that is how the standard specifies to do it. I do not think the FhirClient has a way to send it without using Parameters.</p>",
        "id": 192249791,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1585572453
    },
    {
        "content": "<p>I will share this information with them, and I'm able to get it working using the fhir models for now. Thank you!</p>",
        "id": 192259589,
        "sender_full_name": "Joseph Evensen",
        "timestamp": 1585576946
    }
]