[
    {
        "content": "<p>I have discovered a small inconsistency, whereby a newly constructed FhirXml/JsonParser (without constructor argument) is configured differently than passing the default ParserSettings to the constructor.  Of course, these should be exactly the same.</p>\n<p>The difference lies in the DisallowXsiAttributesOnRoot: if you create a default ParserSettings() disallow will be set to \"true\", however, if you just construct a parser with settings, it it set to \"false\".  </p>\n<p>I can fix this by allowing xsi attributes (it won't break anyones code), but if we feel we'd better be strict - we should standardize on \"true\". </p>\n<p>Opinions? I'll take a look at what HAPI does....</p>",
        "id": 153916779,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1509376181
    },
    {
        "content": "<p>Hi <br>\nI created vonk FHIR server on my local machine need help regarding how can i make it public and need to create sample patient in clinfhir.<br>\nI am able to add my local server there but not able to create scenario in clinfhir my local FHIR vonk server.<br>\nalso in my local vonk FHIR  server i setup database as sql and there when i create sample patient new tables are created there like vonk.entry &amp; more  ..<br>\nFor using rest API how i can access patient data as my endpoint currently is (<a href=\"http://localhost:4080/\" target=\"_blank\" title=\"http://localhost:4080/\">http://localhost:4080/</a>).</p>\n<p>help is greatly appreciated.</p>",
        "id": 153918850,
        "sender_full_name": "shivnath shelake",
        "timestamp": 1510320665
    },
    {
        "content": "<p>Opening up a web server to the public internet is not at all FHIR related - it involves firewall settings and NAT and probably hosting it on something else than your development laptop. There must be plenty of resources on this topic on the internet for this.</p>",
        "id": 153921073,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1511376013
    }
]