[
    {
        "content": "<p>I want to generate the CCD of the patient by retrieving all the resources of the Patient from the Vonk FHIR server? What is the best way to achieve this operation? Does Vonk support $everything? If not any other suggested approach for getting all the related resources to the Patient and generate the CCD on the fly. Thanks</p>",
        "id": 206364970,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1596922515
    },
    {
        "content": "<p>Vonk (by default/by design) doesn't support $everything. It's however relatively easy to create / install a plugin that supports the operation.</p>",
        "id": 206388891,
        "sender_full_name": "René Spronk",
        "timestamp": 1596968676
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  . Any input as to which plugin to install for the same?<br>\nI will look into creation of plugin, as this is the first time I am creating custom plugin for Vonk. I am more worried of the time it will take to complete this operation, if the patient in context has large number of resources.</p>",
        "id": 206405698,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1596996771
    },
    {
        "content": "<p>$everything is based on the resources linked to the patient in the <a href=\"http://hl7.org/fhir/R4/compartmentdefinition-patient.html\">Patient CompartmentDefinition</a>. That may be a lot more than you actually need to fill in the CCD. It may be more efficient to use one or more FHIR searches on the patient using the <a href=\"http://hl7.org/fhir/R4/search.html#revinclude\">_include and _revinclude</a> parameters to get just those resources that you need.</p>",
        "id": 206440048,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1597049661
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span> . Yes _include and _revinclude are good for now. That is what we are implementing.<br>\ncc: <span class=\"user-mention\" data-user-id=\"321627\">@Cibi Siddharth</span></p>",
        "id": 207014872,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1597485888
    }
]