[
    {
        "content": "<p>I have noticed that when I round trip a resource (De-Serialize/Serialize) a resource containing an exponential value e.g <code>&lt;value value=\"5.40e-3\"/&gt; </code> in an Observation resource that the end resource has converted the exponential value to its decimal form e.g <code>\"value\": 0.00540</code>.<br>\nIs this the expected behaviour?<br>\nI had assumed that it should remain in the exponential value format.</p>",
        "id": 193908440,
        "sender_full_name": "Angus Millar",
        "timestamp": 1586875629
    },
    {
        "content": "<p>I'd say expected: the de-serialization converts those values into .NET <code>decimal</code>, that then serialize always as plain decimals with no exponentials</p>",
        "id": 193912198,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1586877086
    },
    {
        "content": "<p>I can understand why it occurs as described <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>  but I still question whether it is expected or correct. I would point out that this is the only item I know of that is converted from one form to another in the serialization round trip. My personal view is that should not occur. I would like to preserve the resource in the form it was provided. Perhaps to shine a different light on it, would it be acceptable that observation values were converted up or down the unit scale on serialization round-tripping, say Liters (L) are converted correctly to Milliliters (ml)?</p>",
        "id": 194539165,
        "sender_full_name": "Angus Millar",
        "timestamp": 1587208443
    },
    {
        "content": "<p>Preserving the format would require de-serializing as string (or to some custom class), that would not be ideal to use the data. De-serializing and then serializing the exact same data does not seem a common use case (why would anyone do it?). Using decimal seems the right call to me.</p>",
        "id": 194546581,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1587219133
    },
    {
        "content": "<p>For full round-tripping you would also need to keep whitespace (and for xml also comments, xml processing instructions, ...)</p>",
        "id": 194639957,
        "sender_full_name": "Johannes Höhn",
        "timestamp": 1587367191
    },
    {
        "content": "<p>Comments and white space aren't expected to be retained, good point.</p>",
        "id": 194762385,
        "sender_full_name": "Angus Millar",
        "timestamp": 1587447327
    }
]