[
    {
        "content": "<p>Please forgive the dumb question, but I’m wondering if there’s a best practice with respect to extracting the dose and rate information as text from a Dosage object (MedicationRequest.dosageInstruction)? The U.S. Core profile says that the Dosage.Text element must be supported, but if it’s not, then we need to get the data from the Dosage.DoseAndRate.  But the members of that are choice elements for dose and rate, and I’m totally stumped and intelli sense in visual studio isn’t giving me clues 🥴</p>",
        "id": 239157048,
        "sender_full_name": "Joe Mundi",
        "timestamp": 1621284247
    },
    {
        "content": "<p>I don't know that this constitutes \"best-practice\" per se, but this guidance is being developed for use in decision support and quality measurement artifacts and is being coordinated and reviewed with the Pharmacy WG: <a href=\"https://github.com/cqframework/CQL-Formatting-and-Usage-Wiki/blob/master/Source/Cooking%20With%20CQL/53/CumulativeMedicationDurationFHIR.cql\">https://github.com/cqframework/CQL-Formatting-and-Usage-Wiki/blob/master/Source/Cooking%20With%20CQL/53/CumulativeMedicationDurationFHIR.cql</a></p>",
        "id": 239185469,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1621301968
    },
    {
        "content": "<p>We are planning to publish that as guidance in an upcoming release of QI-Core, and there is a profile that establishes the more detailed requirements to support that calculation for MedicationRequest here: <a href=\"http://build.fhir.org/ig/cqframework/opioid-mme-r4/StructureDefinition-mmemedicationrequest.html\">http://build.fhir.org/ig/cqframework/opioid-mme-r4/StructureDefinition-mmemedicationrequest.html</a></p>",
        "id": 239185536,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1621302020
    },
    {
        "content": "<p>It is focused on oral medications, but it has seen pilot testing.</p>",
        "id": 239185583,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1621302046
    },
    {
        "content": "<p>Wow. I have to field a lot of questions like \"why do we need standards or common definitions for any of this (quality stuff)?\" Those series of medication duration functions _really_ hit home. I thought the common timing concepts exposed the need, but these are my new go-to for demonstrating the challenge.</p>",
        "id": 239256816,
        "sender_full_name": "Eric Whitley",
        "timestamp": 1621345843
    }
]