[
    {
        "content": "<p>Hello! My organization maintain a patient education app that launches within EMRs (EPIC, Cerner) and we have been using the .net FHIR libraries for authentication, patient context gathering and document write-back. The issue we are having now is that our app is being launched from two different vendors that are wanting to use two different FHIR specs. One is on STU3 and the other supports DSTU2 or R4. If I update our libraries to use the Hl7.Fhir.R4 version will that work with DSTU2, STU3, and R4 clients? Thanks!</p>",
        "id": 174466077,
        "sender_full_name": "Clint Moran",
        "timestamp": 1567093368
    },
    {
        "content": "<p>No - the R4 version works only with R4 server. There is <a href=\"https://www.nuget.org/packages/CareEvolution.Fhir.Core/\" target=\"_blank\" title=\"https://www.nuget.org/packages/CareEvolution.Fhir.Core/\">https://www.nuget.org/packages/CareEvolution.Fhir.Core/</a> that supports multiple version</p>",
        "id": 174467465,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1567094430
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"237439\">@Clint Moran</span>, the .NET API has separate branches &amp; releases for DSTU2, STU3 and R4. Common logic (e.g. FhirPath compiler) has been split of to separate components, independent of the FHIR version. However the core libraries are version-specific.<br>\nIt is possible to consume multiple assembly versions simultaneously from a single project using assembly aliasing. This allows you to create a FHIR client that supports multiple FHIR versions. However you will need to write some conditional logic, depending on the runtime FHIR version.</p>",
        "id": 174467472,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1567094441
    },
    {
        "content": "<p>Also see <a href=\"#narrow/stream/179171-dotnet/topic/Version.20independence.20and.20ITypedElement\" title=\"#narrow/stream/179171-dotnet/topic/Version.20independence.20and.20ITypedElement\">https://chat.fhir.org/#narrow/stream/179171-dotnet/topic/Version.20independence.20and.20ITypedElement</a></p>",
        "id": 174467491,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1567094460
    },
    {
        "content": "<p>Thanks! My initial plan was to create a web API per FHIR specification as I wanted to avoid any reflection or assembly wizardry but spinning up three web APIs felt unnecessary. Thanks again for the info!</p>",
        "id": 174469394,
        "sender_full_name": "Clint Moran",
        "timestamp": 1567095926
    }
]