[
    {
        "content": "<p>I am using .NET FHIR Client. Instead of parsed resource, how can I get raw xml/json from response?</p>",
        "id": 153822494,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1461088781
    },
    {
        "content": "<p>Serialize the output again, and you have the raw xml/json!</p>",
        "id": 153822500,
        "sender_full_name": "Theo Stolker",
        "timestamp": 1461093618
    },
    {
        "content": "<p>Well, you have something semantically equivalent - but not the actual raw response. That distinction may or may not be important, depending on your goals</p>",
        "id": 153822501,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1461095372
    },
    {
        "content": "<p>The issue I have now is that the resource xml received is not valid. So the FHIR parser throws exception. But I don't quite care about those elements in error. Or say I don't need the whole resource but only small portions. So if I can get the raw xml w/o parsing, then I can hand pick the element that I need using XML reader (or xpath).</p>",
        "id": 153822511,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1461099925
    },
    {
        "content": "<p>If the parser is not reading the content, then it likely isn't valid FHIR xml, so question reading the content manually. There could be content in there that you aren't expecting, like modifier extensions.</p>",
        "id": 153822517,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461102010
    },
    {
        "content": "<p>Yes. I know the content is not a valid FHIR xml. While waiting for the content issuer to fix the problems, I would like to continue working on it. For example, if I only need patient's ID and name, then I don't care if patient's address is in valid format or not. I can write my own HTTP client to send request. But since I am already using FHIR client everywhere else, I would like to keep consistency.</p>",
        "id": 153822526,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1461105627
    },
    {
        "content": "<p>Not my favourite bit of code, but there is the <code>LastBodyAsText</code> property on the fhirclient that has just that. This may or may not work, need to be careful and test it well, as it is reading from the LastRequest, and not sure when this is disposed of and could cause a ObjectDisposedException.<br>\nAlso, if you are sharing the fhirclient object across threads, can be overwritten.</p>",
        "id": 153822558,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461115334
    },
    {
        "content": "<p>Think that covers the disclaimers ;)</p>",
        "id": 153822559,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461115360
    },
    {
        "content": "<p>And you can override OnAfterResponse, which has the raw body as a parameter</p>",
        "id": 153822581,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1461142809
    },
    {
        "content": "<p>Yes  Ewout, I think this is the preferred way to do it, as it won't have been disposed here.</p>",
        "id": 153822589,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1461147328
    },
    {
        "content": "<p>Ewout: That sounds a solution. I will try it. </p>",
        "id": 153822889,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1461418079
    }
]