[
    {
        "content": "<p>Hi All, now that the May code freeze is on we are working on getting the dotnet client ready to go.<br>\nAt this point we have a version committed to git that has the latest models available and the entire project builds.<br>\nSome of the unit tests are failing and we are working on getting these fixed (not sure if some are server or the c# code issues)<br>\nWill update when there is news to share, hoping it won't be long.</p>",
        "id": 153819497,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1459461583
    },
    {
        "content": "<p>Update on the code, the unit tests pass except for this pesky decimal precision issue, and some weird issue with binary conversion between XML/json (don't know what it is yet)</p>",
        "id": 153819601,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1459490016
    },
    {
        "content": "<p>The basic CRUD/search has been tested against Grahame's server and works now.</p>",
        "id": 153819602,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1459490041
    },
    {
        "content": "<p>So core and model are good now, and the Valueset/Codesystem operations have been updated too.</p>",
        "id": 153819603,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1459490064
    },
    {
        "content": "<p>Other functionality outside this hasn't been touched, so can't be sure.</p>",
        "id": 153819604,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1459490077
    },
    {
        "content": "<p>If you're game, please grab the code from github in the *ft-connectathon-may2016* branch and build away and let us know how you go.</p>",
        "id": 153819605,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1459490122
    },
    {
        "content": "<p>Ewout, can you update the NuGet package info in there and publish a new version of the stuff?<br>\n(Not sure if this should be called FHIR - 2016 May Connectathon rather than STU3)</p>",
        "id": 153819606,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1459490176
    }
]