[
    {
        "content": "<p>Hello all.</p>\n<p>I am currently working on a basic FHIR client (ASP.NET) and would like to display the results of a transaction in a simple memo style text box. An example would be the success message when a new patient resource is created. I am able to create a patient resource with the following code:</p>\n<p><a href=\"http://ewoutkramer.github.io/fhir-net-api/client-crud.html\" target=\"_blank\" title=\"http://ewoutkramer.github.io/fhir-net-api/client-crud.html\">http://ewoutkramer.github.io/fhir-net-api/client-crud.html</a></p>\n<p>var pat = (Patient)FhirParser.ParseResourceFromJson(jsonString);<br>\nvar patEntry = client.Create(pat);</p>\n<p>\"Most FHIR servers will return a human-readable error description in the OperationOutcome to help you out\"</p>\n<p>I am looking to add a few lines of code to capture and show the HTTP response message from the server showing success (or failure) on my client page.</p>\n<p>Using the .NET API, how would I capture and display this information as a simple HTML string? I have been researching for quite some time and still unsure if I am on the right track. It looks like I need to focus on the \"OperationOutcome\" class, but I am just not sure of the syntax.</p>\n<p>Any ideas or help?</p>\n<p>Thank you! -- Thomas K.</p>",
        "id": 153837707,
        "sender_full_name": "Thomas K",
        "timestamp": 1468353741
    },
    {
        "content": "<p>what version of FHIR are you using? </p>",
        "id": 153837735,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468361726
    },
    {
        "content": "<p>You might get some inspiration from this<br>\n<a href=\"https://github.com/brianpos/spark/blob/dstu2/feature/htmlview/src/Spark/Views/ResourceBundle.cshtml\" target=\"_blank\" title=\"https://github.com/brianpos/spark/blob/dstu2/feature/htmlview/src/Spark/Views/ResourceBundle.cshtml\">https://github.com/brianpos/spark/blob/dstu2/feature/htmlview/src/Spark/Views/ResourceBundle.cshtml</a><br>\nWhich is the htmlrenderer that is also found in sqlonfhir</p>",
        "id": 153837942,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1468407179
    },
    {
        "content": "<p>(Grahame) - Currently I am using the \"DSTU-2\" build of the following project. Is this the information you are looking for? I am sure these is a more robust version / build number, however I am not too sure where to locate that information as I am still in the learning phase on this technology / spec.</p>\n<p><a href=\"https://github.com/furore-fhir/spark/tree/dstu2/master\" target=\"_blank\" title=\"https://github.com/furore-fhir/spark/tree/dstu2/master\">https://github.com/furore-fhir/spark/tree/dstu2/master</a></p>\n<p>(Brian) - Thank you for the link. I am going to look further into the code provided as suggested and see what I can come up with.</p>\n<p>One thing I have noticed is that many of the public testing sites (client pages) seem to have a VERY similar look / layout for performing searches, updates, etc. Perhaps playing around with my own client code is not necessary if an open source client exists? I will continue my research and see if I even need to really be going down this path. I just like to know how things work, thus building my own \"play\" client using the .NET API.</p>\n<p>Thank you both again and I will be in touch. Just need to keep researching I think.</p>",
        "id": 153838038,
        "sender_full_name": "Thomas K",
        "timestamp": 1468441846
    }
]