[
    {
        "content": "<p>Greetings.  I am an experienced software engineer with very much beginners knowledge of FHIR and message structures.  I recently been tasked with converting a set of json FHIR file extracts so I can load them into a relational DB (i.e. SQL).  I am struggling to understand how to parse these files as I am getting parsing errors.  For example, I am attempting to parse the \"Condition\" entity and I get this error: \"Exception thrown: 'Hl7.Fhir.ElementModel.StructuralTypeException' in Hl7.Fhir.Support.dll<br>\nAdditional information: Type checking the data: Encountered unknown element 'resourceId' at location 'Condition.resourceId[0]' while parsing<br>\n\"</p>\n<p>My environment is .NET and leveraging the R5 Core SDK library.  The data set's documentation indicated as \"These resources are FHIR R5 preview 2 (version 4.4) compliant. \".  The data is in .JSON representation with a single extract in each folder.  Each folder represents a data entity (condition, patient,  encounter, etc).   A sample of a single line is demonstrated at the end of my message.</p>\n<p>I apologize if this is the wrong group or message board for this type of posting.  If that is the case, please direct me to the appropriate location.  Any help on this would be greatly appreciated.  If I could be directed to a good resource would be equally appreciated.</p>\n<p>Thanks<br>\nGregg</p>\n<hr>\n<p>Release Format<br>\nFHIR and FHIR+ resources are delivered in new line delimited json files (ndjson). Schema files are delivered as a text file that contains a json object.</p>\n<p>FHIR Resources<br>\nFHIR resources have the following top-level keys/values:<br>\n   resourceId – logical id, an extraction of <a href=\"http://resource.id\">resource.id</a><br>\n   resource – FHIR resource content<br>\nFurther information regarding the structure of each resource can be found by referencing the corresponding <a href=\"http://hl7.org\">hl7.org</a> FHIR schema.</p>\n<p>{<br>\n    \"resourceId\": \"{GUID}\",<br>\n    \"resource\": {<br>\n        \"abatementDateTime\": \"{DateTime}\",<br>\n        \"clinicalStatus\": {<br>\n            \"coding\": [<br>\n                {<br>\n                    \"code\": \"{integer}\",<br>\n                    \"display\": \"{condition display}\",<br>\n                    \"system\": \"{systemId}\"<br>\n                }<br>\n            ],<br>\n            \"text\": \"Resolved\"<br>\n        },<br>\n        \"code\": {<br>\n            \"coding\": [<br>\n                {<br>\n                    \"code\": \"{integer}\",<br>\n                    \"display\": \"{condition display}\",<br>\n                    \"system\": \"{systemId}\"<br>\n                }<br>\n            ],<br>\n            \"text\": \"{Symptom Description}\"<br>\n        },<br>\n        \"id\": \"{GUID}\",<br>\n        \"identifier\": [<br>\n            {<br>\n                \"system\": \"{SystemURL},<br>\n                \"type\": {<br>\n                    \"coding\": [<br>\n                        {<br>\n                            \"code\": \"{Code Name}\",<br>\n                            \"display\": \"{Code Name}\",<br>\n                            \"system\": \"{SystemURL}\"<br>\n                        }<br>\n                    ],<br>\n                    \"text\": \"{Code Name}\"<br>\n                },<br>\n                \"use\": \"{use}\",<br>\n                \"value\": \"{Integer}\"<br>\n            },<br>\n            {<br>\n                \"system\": \"{System Id},<br>\n                \"type\": {<br>\n                    \"coding\": [<br>\n                        {<br>\n                            \"code\": \"{Code}\",<br>\n                            \"display\": \"{Display}\",<br>\n                            \"system\": \"<a href=\"http://hl7.org/v2/diagnosis-id\">http://hl7.org/v2/diagnosis-id</a>\"<br>\n                        }<br>\n                    ],<br>\n                    \"text\": \"DXID\"<br>\n                },<br>\n                \"use\": \"{use}\",<br>\n                \"value\": \"{Integer}\"<br>\n            }<br>\n        ],<br>\n        \"meta\": {<br>\n            \"lastUpdated\": \"{DateTime}\"<br>\n        },<br>\n        \"onsetDateTime\": \"{DateTime}\",<br>\n        \"resourceType\": \"Condition\",<br>\n        \"subject\": {<br>\n            \"reference\": \"{Guid}\",<br>\n            \"type\": \"Patient\"<br>\n        }<br>\n    }</p>",
        "id": 244619428,
        "sender_full_name": "Gregg Ripley",
        "timestamp": 1625169788
    },
    {
        "content": "<p>As I wrote in <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a> : the Condition resource is just the \"resource\" object, not the entire JSON, so you should extract and parse only that piece</p>",
        "id": 244620544,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1625170433
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> for the reply.  I was thinking I could take the file \"as-is\" and parse as it was given to me.  With a little bit of \"parsing the resource\" file, I was able to successfully parse a record (i.e. Condition in this case as a POC).  I just need to rifle through each given fileset as provided to me and rip out the actual object contained in the \"resource\" object just as you said.  Thanks a ton!</p>",
        "id": 244626281,
        "sender_full_name": "Gregg Ripley",
        "timestamp": 1625173260
    },
    {
        "content": "<p>That doesn't lookike a valid fhir json structure.</p>",
        "id": 244633851,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1625177823
    },
    {
        "content": "<p>Is doesn't have the <code>resourceType: \"Condition\"</code> property and the id property is not named right.<br>\nMight want to recheck some examples from the R5 spec to compare.</p>",
        "id": 244634049,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1625177986
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , When I posted, I copied and didn't want to relay any potential PHI so I obfuscated it heavily out of caution.  Also, the \"resourceType\": \"Condition\" is present if you look  6 lines from the bottom up.  I was able to successfully parse the \"Condition\" object as it was embedded in a \"resource\" object.  However, I was hoping I could parse the \"resource\" object and then retrieve the \"resource\" and cast it as a Condition.  When I try to parse it as a \"resource\", I get similar parsing errors.  What I plan to do is rifle through the raw extracts and rip out the \"Condition\" objects (and all the other objects such as Patient, Encounter, etc) and parse those.  That's the plan anyway after successfully parsing the first one.</p>\n<p>I have a team of analysts that just received this data extract and need to quickly review it.  This team are all SQL folks.  I need to convert this to simple SQL tables (no relationships at this point, just raw viewable data).</p>",
        "id": 244638372,
        "sender_full_name": "Gregg Ripley",
        "timestamp": 1625180946
    },
    {
        "content": "<p>Sorry, missed the resoureType in there as you point out.<br>\nThe fhir parser won't be able to understand your custom wrapper that is around it - has that come straight out of the DB of Spark or HAPI or something like that?<br>\n(also interesting that the <code>ResourceID</code> property in your custom wrapper isn't in the <code>id</code> property on resource itself...)<br>\nTo process that, you'd need to extract the resource from the wrapper, and then the FHIR serializer should be able to handle that no problem, and you could cast that to the Condition (or just parse using the generic with Condition, and remove the need to cast too)</p>",
        "id": 244656823,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1625197535
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , to your point, I am stripping out the 'wrapper' of the actual FHIR object and it's working great.  I am going to examine recreating these JSONHD files and see if I can import them into an instance of the FHIR server (SQLite) via the VonkLoader.  With this, my thinking is to export to an equivalent MS SQL so we can review the data.  I am still working through it, but so far, I'm making progress.  I appreciate all the feedback!</p>",
        "id": 244750598,
        "sender_full_name": "Gregg Ripley",
        "timestamp": 1625255872
    },
    {
        "content": "<p>Good to hear.</p>",
        "id": 244761608,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1625262972
    }
]