[
    {
        "content": "<p>Hi All, this is not dotnet specific, but I didn't know the appropriate stream.  I am trying to represent prior/comparison imaging studies and observations in FHIR and wanted to know if there is a standard way to accomplish this.  I haven't been able to google my way to a solution, and have come up with several different, seemingly valid ways to send priors.  So would any one know, or be able to point me in the right direction here?  Thank you!</p>",
        "id": 271855877,
        "sender_full_name": "Catie Ladd",
        "timestamp": 1644858016
    },
    {
        "content": "<p>Hi Catie, generally the best catch-all stream is <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a> , so asking there will likely yield better responses =).</p>\n<p>That said, I spent a little time looking so that I could respond from a completely non-authoritative perspective.</p>\n<p>If you are implementing a server and want to include priors in search results, it is pretty straightforward.  You can just send them along and a client should be able to figure out what to do with them, or at least not choke on them.  Setting <code>Bundle.entry.search.mode</code> to <code>include</code> hints the client that it is a related instance instead of what they were asking for.</p>\n<p>From a client talking to a naive server, they would need to perform searches for priors manually.  E.g., searching for <code>ImagingStudy</code> resources on the same patient (possibly following patient links to old/replaced records), likely looking at modality/bodySite/procedure code to filter.  Relevant Observations could hopefully be identified by searching for relevant codes (e.g., the LOINC codes a client knows how to interpret).  For a single use-case a server could be nice and define a named query to make that easier.</p>\n<p>But yeah, overall I cannot seem to find any standard way of doing this either.  If I were proposing something, my first instinct would be an operation that can be defined on a few resources (e.g., Observation, ImagingStudy, etc.) to explicitly ask for 'relevant' priors, e.g., <code>$relevant-priors</code>.  It is a bit tricky to think through constraints and such though.. do you include 'x' priors by date plus the oldest, what resource restrictions exist, etc.</p>",
        "id": 272178163,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1645045433
    }
]