[
    {
        "content": "<p>I am developing a feature in our clinical software to access a FHIR server. Our development is done in C# .NET targeting .NET Framework 4.7.2. We use Visual Studio 2017 as our development environment. Our final production builds are done using MSBuild in an automated build process on a separate build vm.<br>\nI have incorporated the FHIR R4 DLLs into our Visual Studio solution. This builds perfectly well in Visual Studio with no problem.</p>\n<p>However, the automated MSBuild comes up with errors relating to a version mismatch with the FHIR DLLs.<br>\n*C:\\Windows\\Microsoft.NET\\Framework\\v4.0.30319\\Microsoft.Common.targets(1605,5): warning MSB3258: The primary reference \"Hl7.Fhir.Serialization\" could not be resolved because it has an indirect dependency on the .NET Framework assembly \"System.ValueTuple, Version=4.0.3.0, Culture=neutral, PublicKeyToken=cc7b13ffcd2ddd51\" which has a higher version \"4.0.3.0\" than the version \"4.0.2.0\" in the current target framework.\n*</p>\n<p>I am hoping that someone might have some insight as to why this is happening. Any assistance would be appreciated.</p>",
        "id": 180981398,
        "sender_full_name": "Brian Carter",
        "timestamp": 1574040903
    },
    {
        "content": "<p>Have you tried comparing to other projects that use them, like the fhirpathtester and see if that builds in your environment.<br>\nI build heaps of projects in Azure build infrastructure and haven't had issues.<br>\nDo you have an issue with binding redirects in your app.config or web.config?</p>",
        "id": 180995632,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1574065241
    },
    {
        "content": "<p>Thanks for your reply Brian. Your comments led me to the path that eventually solved my puzzle. It turned out that we were using an old version of MSBuild. Once I changed to a newer version, my problems disappeared. Thanks again.</p>",
        "id": 181277309,
        "sender_full_name": "Brian Carter",
        "timestamp": 1574313604
    }
]