[
    {
        "content": "<p>Hey guys im trying to set up an oidc login for a standalone launch to a SMART on Fhir Server. As far as i can see there are no Nuget Packages for a \"simple implementation\", so i have to implement it from scratch, to find the auth and token routes needed.<br>\nIm using a Fhir Server URL from <a href=\"http://smarthealtit.org\">smarthealtit.org</a> to achieve first steps, so there shouldnt be a problem with client_id and client_secret.</p>\n<p>Does someone had to deal with this step already and can share some advices?</p>",
        "id": 268524623,
        "sender_full_name": "Lars Ewert",
        "timestamp": 1642591166
    },
    {
        "content": "<p>Kindly check the following links they might help you. Vonk (dotnet based FHIR server) has shared their code for smart-on-fhir implementation for dotnet based FHIR servers.</p>\n<p>Documentation: <a href=\"https://docs.fire.ly/projects/Firely-Server/en/latest/security/accesscontrol.html\">https://docs.fire.ly/projects/Firely-Server/en/latest/security/accesscontrol.html#</a><br>\nGitHub code: <a href=\"https://github.com/FirelyTeam/Vonk.IdentityServer.Test\">https://github.com/FirelyTeam/Vonk.IdentityServer.Test</a></p>\n<p>the GitHub code is the example of Authorization server (IdentityServer based =&gt; OAuth2.0 implementation in dotnet) to work with a dotnet based FHIR server, that supports smart-on-fhir login funcionality for the clients of its FHIR server. The authorization server provides the endpoints for authorization code and token.</p>",
        "id": 268533042,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1642596355
    },
    {
        "content": "<p>Thanks for the information, but am i right, that this is a guide to implement Smart On Fhir for a Fhir server?</p>\n<p>I am a third party developer with a standalone Web-Application and want to achieve a authorization against a Smart on Fhir Server. <br>\ni hope its mroe clear what my issue is</p>",
        "id": 268546360,
        "sender_full_name": "Lars Ewert",
        "timestamp": 1642602301
    },
    {
        "content": "<p>So you're a regular web app wanting to handle the launch from a smart on fhir host and do the auth routines with the fhir server connected to it?</p>",
        "id": 268549406,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1642603599
    },
    {
        "content": "<p>If that's what you're up to, it's really just 2 static HTML pages with some javascript in it is all you actually need.<br>\nThere are a few samples out there for this.</p>",
        "id": 268549504,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1642603654
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"382697\">@Lars Ewert</span> yes that is the right guide to get start. HL7 FHIR website also has a page dedicated to this topic. For web app see the FHIR JavaScript library, with that you can have your client side developed.</p>",
        "id": 268576936,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1642614211
    },
    {
        "content": "<p>If you want an overview of SMART app launch, I do have a <a href=\"https://www.youtube.com/watch?v=4okFXW0Ex1E&amp;list=PLsR-zcO--dyp0cnv1AbOZ2EUC36tMLpXY&amp;index=1\">video</a> that walks through the spec.  There are additional videos in that series using C#, so not exactly your scenario, that may be helpful as well.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"4okFXW0Ex1E\" href=\"https://www.youtube.com/watch?v=4okFXW0Ex1E&amp;list=PLsR-zcO--dyp0cnv1AbOZ2EUC36tMLpXY&amp;index=1\"><img src=\"https://uploads.zulipusercontent.net/c0664ec3bd4cdcd25f0e920bad7054b1b3e92076/68747470733a2f2f692e7974696d672e636f6d2f76692f346f6b46585730457831452f64656661756c742e6a7067\"></a></div>",
        "id": 268577788,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1642614535
    },
    {
        "content": "<p>Thanks a lot guys ! </p>\n<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  i have already watched your videos about this ;-) im using an Identity Server with an App Login and a separate SMART-on-FHIR OIDC Login. It was a bit tricky to set up, but its working as expected now. <br>\nOnly have to deal now in the frontend with the authorization but that is standard oidc stuff now ;-)</p>\n<p>Have a great one everyone!</p>",
        "id": 268743380,
        "sender_full_name": "Lars Ewert",
        "timestamp": 1642706278
    },
    {
        "content": "<p>Glad it helped!  If there are any gaps that would be helpful to cover, please let me know.</p>",
        "id": 268743517,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1642706336
    },
    {
        "content": "<p>Hey Gino,</p>\n<p>The main problem for me was, that Microsoft decided to wrap a lot of stuff in a library which is not visible to the developer, except you scaffold the identity server and have a look at the controllers and views. That helped me a lot to understand whats going on and how the different Login Options are achieved. ;-) </p>\n<p>In your videos you search manualy for the Auth and Token URLs and go through the steps, but the identity server 4 does a lot on its own without knowing exactly what.</p>",
        "id": 268745142,
        "sender_full_name": "Lars Ewert",
        "timestamp": 1642707061
    },
    {
        "content": "<p>Makes sense, I have on my list to do a series with common auth providers, so I will add your comments for when I get to it.  Thanks!</p>",
        "id": 268745742,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1642707343
    }
]