[
    {
        "content": "<p>I'm wondering if the DSTU2 core client version 0.90.6.26409 can receive an object from the FHIR server, other than the resource type the client originally sent. The reason why we want to receive a different resource type is to get an Id and perhaps some other information which can be used to retrieve the data which was created, at a later point in time.</p>\n<p>If we on the client side write something like this:<br>\nvar returns = _client.Create(communicationRequest);</p>\n<p>and on the fhir server replies with this where result is a resource type of Communication,</p>\n<p>return new FhirResponse(HttpStatusCode.Created, result);</p>\n<p>The client will however automatically respond with an nullpointer exception.<br>\nIf we look at the rest response, the reply from the server is correct, but the client can't handle a response other than the type it expects.</p>\n<p>Is this intended?</p>",
        "id": 153846494,
        "sender_full_name": "Harald Sømnes Hanssen",
        "timestamp": 1473152305
    },
    {
        "content": "<p>so the server responds to a create with a non-standard response? </p>",
        "id": 153846602,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473192876
    },
    {
        "content": "<p>Should probably have clarified what happens on the client side a bit better.</p>\n<p>When the client receives the response from the server, where the server has put a different resource object in the response compared to the request from the client, the client will cast an nullpointer exception. Is this intended?</p>",
        "id": 153846643,
        "sender_full_name": "Harald Sømnes Hanssen",
        "timestamp": 1473234216
    },
    {
        "content": "<p>The server wouldn't be FHIR conformant if it did that.</p>",
        "id": 153846644,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1473234622
    },
    {
        "content": "<p>If you perform a Create of a CommunicationRequest, the data created on the server should be that CommunicationRequest resource. So any result you would get is either the created resource, or no body (if your Prefer header was set to minimal). In this last case, the API will set your returns variable to null.</p>",
        "id": 153846645,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1473234635
    },
    {
        "content": "<p>You can check _client.LastResult to see what the response was: an error, success, upon success the Location of the newly created resource.</p>",
        "id": 153846646,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1473234708
    },
    {
        "content": "<p>If you need your server to send back a Communication resource when your client sends a CommunicationRequest, you should implement an operation to do so, to be FHIR/REST compliant.</p>",
        "id": 153846647,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1473234806
    },
    {
        "content": "<p>+1 on that.<br>\n<a href=\"http://hl7.org/fhir/dstu2/http.html#2.1.0.5.2\" target=\"_blank\" title=\"http://hl7.org/fhir/dstu2/http.html#2.1.0.5.2\">http://hl7.org/fhir/dstu2/http.html#2.1.0.5.2</a><br>\nIs where the return results are specified, and it is expected to be the resource that was created/updated.<br>\nThe note that says may be different to the client sent refers to that the server may update it from what the client sent for several reasons (like security or other local processing) but specifically the meta tags for the version id and update date will definitely but updated.</p>",
        "id": 153846649,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1473235187
    },
    {
        "content": "<p>Your help is much appreciated. I think I have enough to get things along :)</p>",
        "id": 153846650,
        "sender_full_name": "Harald Sømnes Hanssen",
        "timestamp": 1473236856
    },
    {
        "content": "<p>:)</p>",
        "id": 153846657,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1473241554
    }
]