[
    {
        "content": "<p>We are currently facing some problems with the SMART on FHIR Authentication with the Vonk FHIR Server. Our IdentityProvider does not provide an audience claim in the Access Token (and the company behind that seems unwilling to change that behaviour) and it seems like the audience check in the token validation cannot be disabled in the vonk configuration... is there any possibility to disable the audience check? Another thing that we can't figure out is how to configure Introspection in the Vonk configuration because introspection endpoints are usually secured... More options to configure the Authentication in detail and more information about whats going on here would be really helpful...</p>",
        "id": 182435434,
        "sender_full_name": "Sven-Eric Matthes",
        "timestamp": 1575370009
    },
    {
        "content": "<p>Thanks for bringing this to our attention. We'll look into it, but it may need a bit of time.</p>",
        "id": 182463647,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1575388959
    },
    {
        "content": "<p>Thanks for your reply, I look forward to hear from you again with more informations or new configuration options</p>",
        "id": 182553865,
        "sender_full_name": "Sven-Eric Matthes",
        "timestamp": 1575465174
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"225690\">@Sven-Eric Matthes</span> : Update on this: you currently cannot avoid Audience validation through the settings. But we can easily adjust that to skip Audience validation if there is no Audience configured in the Vonk settings. We'll do that for the next release.</p>",
        "id": 183257657,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1576157003
    },
    {
        "content": "<p>Configuration of token introspection is a bit more work. We'll add it to the todo list, but in the meantime you could fill in this need by creating a plugin that sits in front of the SMART-on-FHIR plugin (so the order of the plugin should be &lt; 2000). The plugin would be structured along the lines of this <a href=\"http://bit.ly/VonkAuthorizationMiddleware\" target=\"_blank\" title=\"http://bit.ly/VonkAuthorizationMiddleware\">gist</a>.</p>",
        "id": 183259737,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1576158464
    },
    {
        "content": "<p>Just to check: are you using your authorization server to generate tokens for any other services, or only for vonk? Audience validation is an important step anytime tokens might be generated for more than one audience. (I've seen projects make serious security errors by trying to skip audience validation.)</p>",
        "id": 183262650,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1576160142
    },
    {
        "content": "<p>For anyone else looking, disabling audience vaidation is now available in Vonk 3.2.0</p>",
        "id": 188371034,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1581939139
    }
]