[
    {
        "content": "<p>I think this is just another flavor of our ongoing discussion about coded must-support values, but I'll ask anyway...</p>\n<p>I'm writing a profile where I want to call out some elements as \"must support\" and others as \"should support\". Is there any formal way to make these pop out for implementers so they don't get lost in the vast array of optional-but-not-particularly-recommended elements?</p>",
        "id": 272313361,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645127535
    },
    {
        "content": "<p>You can get them to show up in the differential by changing or adding a comment.  Other than that, not really</p>",
        "id": 272313496,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645127597
    },
    {
        "content": "<p>OK, thanks. This isn't a super-obscure thing to want to communicate, right? I guess if my comment was \"SHOULD support\" and the differential view displayed this comment inline that'd feel less hacky.</p>",
        "id": 272313791,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645127730
    },
    {
        "content": "<p>(For SMART Health Cards IG, the team wound up defining multiple profiles for each use case, for a similar reason. I guess that's an option too.)</p>",
        "id": 272313899,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645127786
    },
    {
        "content": "<p>No - I've needed to do it and my solution has been adding a comment in the differential.  It does two things:<br>\na) makes the element appear in the differential - which means the reader will pay some degree of attention to it - even if only to ask \"why is this in the differential?\"<br>\nb) adds the note saying \"you 'SHOULD' support this - and ideally why\"</p>\n<p>If we ever get to the point of having multiple mustSupport flavors, then I guess this could be some sort of MS 'flavor'.</p>",
        "id": 272316380,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645128693
    },
    {
        "content": "<p>You could mark the 'should support' elements with mustSupport = true and in your statement describing must support say \"for the following elements 'must support' means 'should support'\".</p>\n<p>Must support does not have to mean the same thing for every element flagged as must support.</p>",
        "id": 272345580,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1645145184
    },
    {
        "content": "<p>I know this is formally true. But what I want is at-a-glance documentation where developers can understand this SHALL/SHOULD/MAY type of logic without having to flip back and forth between different pages to cross reference the meaning of a flag.</p>",
        "id": 272413124,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645197047
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/211987-methodology/topic/.22Should.20support.22/near/272313899\">said</a>:</p>\n<blockquote>\n<p>(For SMART Health Cards IG, the team wound up defining multiple profiles for each use case, for a similar reason. I guess that's an option too.)</p>\n</blockquote>\n<p>This is what I do in IHE. I find that it is far more obvious to have many profiles, each with the specific requirements of their use-case... and when appropriate have them based on a more simple peer.</p>",
        "id": 272432575,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645206117
    },
    {
        "content": "<p>Yeah, though I really should note: there's only one <em>use case</em>, and the multiple profiles were defined for each <em>conformance level</em> (more or less). One for the required, and one for the allowed. Still, this pattern seems like the best way to \"work around\" M-S limitations.</p>",
        "id": 272439948,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1645209389
    }
]