[
    {
        "content": "<p>I just read through the <a href=\"#narrow/stream/211987-methodology/topic/ConceptReference\">discussion here</a> after seeing <a href=\"http://jira.hl7.org/browse/FHIR-25277\">FHIR-25277</a>, and wanted to understand something, regarding the point that <code>doseNumber</code> isn't intended to be computable. I've been thinking plenty about COVID-19 vaccination records, and obviously it's important to know something like \"did a person get both doses in a recommended sequence of two doses?\" Is the idea that this should be done by scanning through the immunization history (and dates) to see if there are two present within a certain window, rather than using <code>doseNumber</code> directly for this purpose?</p>",
        "id": 219493629,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1607616502
    },
    {
        "content": "<p>Because immunization schedules may change over time (doses may be added or removed, spacing between doses may change, new products may be added, etc), what's typically done is that the patient's history is evaluated against a schedule on a \"just in time\" basis. That can be used to determine if the patient's history meets the current recommendations (ie. no more doses are recommended) or if a recommendation for more vaccine is made. The evaluation (conveyed via ImmunizationEvaluation) and forecast (conveyed via ImmunizationRecommendation) that come from this sort of evaluation are typically treated as ephemeral. Typically this sort of evaluation is pretty light weight and it's better to repeat the evaluation rather than rely one the results of one from the past (eg, last visit's evaluation or even last week's evaluation).  Does that help?</p>",
        "id": 219519104,
        "sender_full_name": "Craig Newman",
        "timestamp": 1607627304
    },
    {
        "content": "<p>I am looking at a COVID vaccination app and we are tring to get rid of all \"verification\" and \"evaluation\" steps (in the immunization itself). </p>\n<ol>\n<li>I think the dose numbers may be numbers or may be \"1st reinforcement..\". Those are not computable</li>\n<li>I think we should support computable dose numbers. We should evade from the paper-based process constraints</li>\n</ol>",
        "id": 219522943,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1607629006
    },
    {
        "content": "<p>It helps, for sure <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span>  -- thanks. Bottom line is that when evaluating an immunization history, <code>Immunization.doseNumber</code> isn't a relevant input. That's surprising, but good to know.</p>",
        "id": 219526284,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1607630592
    },
    {
        "content": "<p>Immunization.doseNumber in particular is more about the provider's \"intent\". They may be intending to give the second dose of COVID vaccine but it may not be valid for a variety of reasons (too soon since the first dose or the other vaccine type (the two dose series has to be for the same vaccine manufacturer)). The .doseNumber for ImmunizationEvaluation should be more relevant.</p>",
        "id": 219526975,
        "sender_full_name": "Craig Newman",
        "timestamp": 1607630896
    }
]