[
    {
        "content": "<p>The observation resource splits between subject and focus. I think that this concept applies to other resources too, but it hasn't been discussed.</p>\n<p>Here's what I want to do about this:</p>\n<ul>\n<li>for every reference to a participation resource (CareTeam, Device, Group, HealthcareService, Location, Organization, Patient, Practitioner, PractitionerRole, RelatedPerson), the definitions must define an applicable role code </li>\n<li>the role code must define what kind of role that this plays, to ensure that the committee has thought about this in a structured fashion</li>\n<li>the role code must be taken from an approved list of codes maintained by MnM</li>\n<li>The v3 RoleCode is a candidate for the set of codes... but I am suspicious of it</li>\n</ul>",
        "id": 178683005,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571682015
    },
    {
        "content": "<p>I don't understand this solution or how it deals with subject vs. focus.  Also, are you wanting role or participation?</p>",
        "id": 178688590,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571685774
    },
    {
        "content": "<p>I think I care about both Role code and Participation type</p>",
        "id": 178688761,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571685875
    },
    {
        "content": "<p>maybe the second - I'd have to investiage</p>",
        "id": 178688784,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571685896
    },
    {
        "content": "<p>the intent of the solution is that committees would have to be explicit about what kind of participation / role this thing is playing in their design, and the code list from which they choose makes them think through the issues that arose in Observation with subject/focus (and other issues)</p>",
        "id": 178688926,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571686004
    },
    {
        "content": "<p>SUBJ vs. RTGT are participations in v3.  Role is always Patient or Specimen, regardless of how you're referencing them.</p>",
        "id": 178692483,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571688138
    },
    {
        "content": "<p>I'm not a fan of adding a \"participation code\" every time we reference one of these resources.  We do that in a couple of places, generally around performer, but I don't think it makes sense/is necessary as a general case</p>",
        "id": 178692567,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571688197
    },
    {
        "content": "<p>I do not mean that we would add it to the content of the resource, but that we will require it to be present in the definitions (as a stated fixed value) if it's not present in the instance</p>",
        "id": 178693001,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571688450
    },
    {
        "content": "<p>can we talk about this on MnM today?</p>",
        "id": 179899809,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572926342
    },
    {
        "content": "<p>Decision, for now:</p>\n<ul>\n<li>create a task to ask for discussion of focus vs subject on Procedure</li>\n<li>create a task to ask for a discussion of focus vs subject on ServiceRequest</li>\n<li>create a task to ask for clarification about how to ask for a procedure on an implanted device in a patient</li>\n</ul>",
        "id": 179984932,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572992856
    },
    {
        "content": "<ul>\n<li>also: discuss this at the round table + also schedule for mention at the workflow session</li>\n</ul>",
        "id": 179985042,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572992934
    },
    {
        "content": "<p>add: </p>\n<ul>\n<li>create a task for clarification of subject/focus on Specimen</li>\n</ul>",
        "id": 180690271,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573693371
    }
]