[
    {
        "content": "<p>Tarkkaan otettuna esimerkeissä rakenteisen annostelun eroista (sivu 48 alkaen) on virhe siinä, että THL-tietosisällön osalta samaan aikaan ei voida esittää sekä ”potilasystävällistä” että fysikaalista annoksen määrätietoa. Siis joko kerrotaan administrationUnitCode ja annoksissa unit=”1” tai sitten oikeana PQ-ainemääränä. Sivujuonne on sitten siinäkin, että kyseessä voi olla esim. yhdistelmävalmiste, jolle ei edes ole yhtä fysikaalista ainemäärää (vaan teoriassa kullakin vaikuttavalla aineella on oma määränsä ja valmistetasolla vahvuus on tekstimuotoinen esim. ”100/400 mg”). Luen FHIR Quantity-tyyppiä niin että yhtäältä siinä on helppoa erotella potilasystävällisen ja fyysisen määrän esittäminen toisistaan (system -arvo eroaa) mutta toisaalta pitää huomioida koodaamattoman tiedon ilmoittamisen vaihtoehto (mikä sinänsä toki onnistuu suoraviivaisesti koska system ja code ovat ei-pakollisia). Ja kyllä, olen tietoinen ettei THL-mallissakaan tai sen CDA-rakenneohjeistuksessakaan ole tarkkaan ottaen huomioitu fyysisen (aine)määrän UCUM-sidonnaisuutta .</p>",
        "id": 224634645,
        "sender_full_name": "Kari Heinonen",
        "timestamp": 1612086104
    },
    {
        "content": "<p>Käydään näitä läpi 5.2.2021 työpajassa</p>",
        "id": 224834766,
        "sender_full_name": "Kirsi Vainio",
        "timestamp": 1612248950
    },
    {
        "content": "<p>5.2.2021 työpajassa käyty:</p>\n<ul>\n<li>\n<p>Tietosisältömäärittely ei tätä itse asiassa kiellä, Annos: pakollinen, jos CodeId 98 Annos (fysikaalinen) = tyhjä</p>\n</li>\n<li>\n<p>CDA kylläkin speksaa että vain jompikumpi sallittu sekä rakenteisen vaatimuksena on ”Annos voidaan tallentaa 2 eri muodossa: potilaalle helposti ymmärrettävässä muodossa Annos ja Annosyksikkö (CodeId:t 96 + 97), esim. tabletti, ja fysikaalisessa muodossa Annos (fysikaalinen) (CodeId 98), esim. 50 mg. Vain yhtä muotoa voi käyttää yhdellä määräyksellä. Annos ja annosyksikkö tiedot on tallennettuna joka annokselle”. </p>\n</li>\n<li>\n<p>Esimerkissä oli ylipäätään tavoitteena näyttää, miten tiedot mappautuvat rakenteisiin, hyvä huomio kuitenkin ettei esimerkki vastaa oikeaa skenaariota.</p>\n</li>\n</ul>\n<p><a href=\"/user_uploads/10155/IsAO__9Qj_Cf5x5HecdcEN5c/image.png\">image.png</a> ehkä erottelu potilasystävällisen ja fysikaalisen olisi ennemmin tehtävä doseAndRate.type:llä (oma koodi), ei Quantityn systemillä?  <br>\nMuuten molemmat saadaan annettua samalla rakenteella:</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/IsAO__9Qj_Cf5x5HecdcEN5c/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/IsAO__9Qj_Cf5x5HecdcEN5c/image.png\"></a></div><p>Potilasystävällinen<br>\n\"doseQuantity\": {<br>\n        \"value\": 1,<br>\n    \"unit\": \"tabletti\",<br>\n    \"system\": \"urn:oid:1.2.246.537.6.138.202001\",<br>\n    \"code\": \"18\"<br>\n}<br>\nFysikaalinen<br>\n\"doseQuantity\": {<br>\n    \"value\": 600,<br>\n    \"unit\": \"mg\",<br>\n    \"system\": \"<a href=\"http://unitsofmeasure.org\">http://unitsofmeasure.org</a>\",<br>\n    \"code\": \"mg\"<br>\n}</p>",
        "id": 226620378,
        "sender_full_name": "Kirsi Vainio",
        "timestamp": 1613545615
    }
]