[
    {
        "content": "<ol>\n<li>\n<p>Tarkkaan otettuna annosajankohta + annosaika esimerkki (sivu 30) ei ole yksiselitteisen validi; kirjatun kellonajan tulee olla muodossa hhmm (ST), tästä muodostetulle näyttötekstille ei nähdäkseni ohjeistuksessa tunneta vaihtoehtoa ”klo 8” (lähin vastine ”klo 8.00”). </p>\n</li>\n<li>\n<p>Ymmärrän Dosage.timing.repeat.timeOfDay -elementin FHIR-tietotyyppiä niin, että kyseessä on \"oikea aika\" vähintään sekuntien tarkkuudella sisältäen erottimet (siis hh:mm:ss) ? Kun taas THL-tietosisällössä annosaika on siis hhmm muotoinen merkkijono (ST).</p>\n</li>\n<li>\n<p>Tietojen samanaikainen esiintyminen ei ole kuvatulla tavalla suoraviivaista. Asiaa ei yhtään auta sovellettavien määrittelyiden yksityiskohtien eroavuudet, joita en tässä yhteydessä esittele ellei erikseen pyydetä. Lopputulema on kuitenkin se, että FHIR:ssä tarvitaan molempia samanaikaisesti; nimenomaisesti tieto löytyy dokumentista \"S1 Kirjaa ja muodosta rakenteinen annostusohje V3.00\".</p>\n</li>\n<li>\n<p>Annosajankohdan koodistoon voi tulevaisuudessa kohdistua kehitystarpeita, joilla on vaikutusta Dosage-tyypin yleistä soveltuvuutta arvioitaessa (lue: Timing.repeat.when elementin lukittu ValueSet). Mielipiteeni nimittäin on että esim. ns. annosjakotaulukon muodostaminen ja osastolääkityksen jakokierron huomioiminen olisi helpompaa (”oikeiden”, tekstimuotoisten aikojen sijasta) jos ao. ”suositeltavat lääkkeenoton kellonajat” olisivat esitetty koodeina. Kerron tarvittaessa asiasta tarkemmin.</p>\n</li>\n</ol>",
        "id": 224633368,
        "sender_full_name": "Kari Heinonen",
        "timestamp": 1612084271
    },
    {
        "content": "<p>Käydään näitä läpi 5.2.2021 työpajassa</p>",
        "id": 224834776,
        "sender_full_name": "Kirsi Vainio",
        "timestamp": 1612248959
    },
    {
        "content": "<p>5.2.2021 työpajassa keskusteltu kohtiin 1,2,3: </p>\n<p>Tuo tieto on THL tietosisällössä merkkijono, sillä V3 tietotyypeissä ei ole pelkälle hhmm esitystapaa. FHIRssa tuossa tietotyyppi time: ”A time during the day, in the format hh:mm:ss. There is no date specified. Seconds must be provided due to schema type constraints but may be zero-filled and may be ignored at receiver discretion. The time \"24:00\" SHALL NOT be used. A time zone SHALL NOT be present. Times can be converted to a Duration since midnight.” Eli esim. hhmm 1146 pitäisi antaa 11:46:00. Eikös kaikkien pitäisi tuosta osata muodostaa oikean tarvittava muoto?</p>\n<p>THL tietosisällössä Annosaika: ”kellonaika, jolloin määrätyn lääkkeen annos otetaan Huom. Tämä on vaihtoehtoinen tietokenttä annosajankohdan kanssa. Annosajankohta voidaan tallentaa myös annosajan lisätietona.”<br>\nEli ei THL tietosisällönkään mukaan tarvita molempia yhtä aikaa, vain lisätietona.</p>\n<p>Annosajan mahdollisuus haluttiin säilyttää rakenteisessa annostuksessa, jotta voidaan antaa yksiselitteisesti tietyt ajat. Tai jos halutaan esimerkiksi aamulla annosteltavat ryhmitellä omakseen, mutta samalla tarve kuitenkin antaa annosaika.</p>\n<p>Kohta 4: nämä ovat koodeina FHIRssa mutta onko koodeissa kaikki tarvittavat, onkin toinen juttu</p>",
        "id": 226619645,
        "sender_full_name": "Kirsi Vainio",
        "timestamp": 1613544689
    },
    {
        "content": "<p>Vastauksessa viitattiin koodistopalvelun \"voidaan antaa lisätietona\" –vaihtoehtoon; tällaista lisätieto -elementtiä ei kuitenkaan ole olemassa ja ilmaistu tarve molempien esittämiseen pitää FHIR:ssä toteuttaa jotenkin muuten. Nimittäin ottaen huomioon kaikki dokumentaatio:</p>\n<p>a) THL tietosisällössä codeId:tten 123 ja 124 description sisältää lauseen ”Annosajankohta voidaan tallentaa myös annosajan lisätietona” mikä ei voi olla teknisesti oikein. Ajankohdan CE tyypille qualifier on kuitenkin kielletty (ja originalText/translation semanttisesti vääriä ?); Ajan ST-tyypillä ei tietenkään ole mitään lisätietoja. Tietosisällön määrittelyssä olisi siis jotain täsmennettävää vai olisiko vain sanat ”aika” ja ”ajankohta” menneet kuvaustekstissä ristiin ?<br>\nb) Lääkemääräyksen sanoman CDA rakennekuvaus puolestaan  ei ota mitään kantaa annosajankohdan ja annosajan esiintymiseen samanaikaisesti tai niiden esiintymisen rajoituksiin<br>\nc) Sen sijaan rakenteisen annostelun kirjaamista koskeva toiminnallinen määrittely (dokumentti \"S1 Kirjaa ja muodosta rakenteinen annostusohje V3.00\") kuvaa tilannetta, jossa molemmat ovat käytössä.<br>\nd) On mahdollista että THL tietosisällössä ao. koodien kuvausteksti edelleen viittaa tietomallista sittemmin (omien arkistojeni pohjalta noin 06/2019 \"yksinkertaistetun rakennemallin\" lanseerauksen myötä) karsittuun annoskohtaiseen \"annoksen tarkenne\" -elementtiin (ST).</p>\n<p>Sinänsä annosajankohta+annosaika –ongelman ratkaiseva  annoskohtainen tarkenne</p>\n<ul>\n<li>olisi valmiiksi tarjolla FHIR:ssä (dosageInstruction.additionalInstruction) niin koodatussa kuin tekstimuodossakin ja jopa toistuvana</li>\n<li>ei ole mahdoton toteuttaa (FHIR:iä vastaten) CDA-puolellakaan, koska käytössä on muutenkin geneeriset observation -actit annoksen sisärakenteiden esittämiseen</li>\n<li>tarkenteella / \"annoskohtaisella ohjeella\" / \"miten-se-nyt-sitten-halutaankin-nimetä\" olisi ilmeisesti käyttöä jos tilaisuudessa esitetty \"1 tabletti (400 mg)\" -yleisökommentti huomioidaan. Voidaan kylläkin kysyä onko tämä osoitus tarpeesta avata (taas uudestaan) keskustelu lääkemääräyksen rakenteisen annostelun tietomallin kattavuudesta yms. ?</li>\n</ul>",
        "id": 226622338,
        "sender_full_name": "Kari Heinonen",
        "timestamp": 1613547521
    }
]