[
    {
        "content": "<p>Onko Kanta lääkemääräyksen FHIR-resurssien laatimisella jotain ennalta päätettyjä reunaehtoja tai sitovia linjauksia ? </p>\n<p>Lähinnä ajattelen rakenteisen annostelun osiota. Koska Kanta- ja FHIR- tietomallit eroavat niinkin perustavanlaatuisella tavalla toisistaan, onko harkittu/mietitty annostelun rakenteen tekemistä kokonaan uutena resurssina sen sijaa että jotenkin \"muokattaisiin\" standardia tai käytettäisiin sitä ns. \"luovilla tavoilla\" (esim. esitelty resurssin kokonaisuuden toistaminen) ?</p>\n<p>Enkä kyllä millään haluaisi olla ensimmäinen postaaja mutta kovin on täällä hiljaisen oloista ...</p>\n<p>edit #1. Käytin äsken pari tuntia selaamalla simplifierin MedicationRequest -profiileja. Ylipäätään mitkään rakenteiseen annosteluun liittyvät standardista poikkeamat ovat ns. laskettavissa yhden käden sormilla. Toiseksi mitään Kanta-tietomallia muistuttavaa en onnistunut löytämään ollenkaan - tunteeko joku asiaa paremmin ?</p>\n<p>edit #2: Information to non-Finnish speakers<br>\nAs instructed by stream creator, use of Finnish as a language of conversation is allowed. However, to this I don't personally wholly agree :-) To those interested, this post is about general development plans, directions and guidelines concerning creating MedicationRequest -profile compatible with Finnish national Kanta archive, especially representing Dosage in a structural manner.</p>",
        "id": 223613337,
        "sender_full_name": "Kari Heinonen",
        "timestamp": 1611303250
    },
    {
        "content": "<p>Ensin yleinen kommentti: toivomme, että tekemässämme avauksessa keskusteltaisiin nyt Simplifierista löytyvistä FHIR resursseista ja niiden soveltuvuudesta yksilöintitietojen palautuksen esitystavaksi. Nyt tässä esitetyissä kysymyksissä mennään osin korkeammalle tasolle/arkkitehtuuritasolle ja sen keskustelun paikka ei välttämä ole täällä (ellei niin erikseen sovita).  Palaamme tarvittaessa näihin erikseen. </p>\n<p>Toivottavaa kuitenkin olisi, että yksilöintitietojen FHIR palautuksen kommentit ja muut yleisemmät asiat pidettäisiin ainakin eri keskustelun avauksissa.</p>\n<p>Tässä vaiheessa ei ole ollut reunaehtoja tai sitovia linjauksia.  Työn lähtökohtana on ollut hyödyntää FHIR standardia mahdollisimman pitkälle sellaisenaan ja pyrkiä pysymään standardin mukaisissa rakenteissa niin pitkälle kuin mahdollista. Näin samalla tulee arvioiduksi FHIRin olemassa olevien resurssien soveltuvuus tietosisällön esittämiseen.</p>",
        "id": 224143318,
        "sender_full_name": "Mika Tuomainen",
        "timestamp": 1611727060
    },
    {
        "content": "<blockquote>\n<p>Lähinnä ajattelen rakenteisen annostelun osiota. Koska Kanta- ja FHIR- tietomallit eroavat niinkin perustavanlaatuisella tavalla toisistaan, onko harkittu/mietitty annostelun rakenteen tekemistä kokonaan uutena resurssina sen sijaa että jotenkin \"muokattaisiin\" standardia tai käytettäisiin sitä ns. \"luovilla tavoilla\" (esim. esitelty resurssin kokonaisuuden toistaminen) ?</p>\n</blockquote>\n<p>Mikä on Kanta-tietomalli mihin tässä viittaat? Edit1 kohdassa kysytkin omaan kysymykseesi liittyen, mikä ylipäätään on Kanta-tietomalli. Koodistopalvelusta löytyvä THL Lääkemääräyksen tietosisältö taitaa olla ainoa \"tietomallimainen\" esitys tietosisällöstä, ei pelkkä listaus tietoja kuten aiemmin määrittelyissä on ollut. Toisaalta tuo on tietosisältömäärittely eikä välttämättä ohjaa eri järjestelmien varsinaista tietomallia.</p>\n<p>Nyt on siis pyritty katsomaan, miten hyvin FHIR resurssit soveltuvat tietosisällön esittämiseen. Aika moni (kaikki?) rakenteisen annostuksen (S1 Kirjaa ja muodosta rakenteinen annostusohje\") esimerkeistä on esitettävissä FHIR MedicationRequest-resurssilla. Eikä tässä ymmärtääksemme ole juurikaan tehty mitään luovaa, esitetty tiedot niin kuin ne FHIR standardilla on ollut tarkoitus esittää.</p>\n<p>Kannattaa huomioida, että rakenteinen annostus ei ole FHIRssa resurssi, se on FHIRssa MedicationRequest-resurssin elementin dosageInstruction alainen tieto ja esitetään Dosage-tietotyypillä. Dosage-tieotyypin alla aikoihin liittyvät tiedot puolestaan esitetään Dosage-tietotyypistä löytyvällä timing elementillä, joka on Timing-tietotyyppiä (rakenteisen tietotyypin sisällä toinen rakenteinen tietotyyppi).</p>\n<p>Ja jos korvaamme tuon dosageInstruction-elementin omalla rakenteella, voimme alkaa keskustella koko MedicationRequest-resurssin sopivuudesta.</p>",
        "id": 224143450,
        "sender_full_name": "Mika Tuomainen",
        "timestamp": 1611727211
    },
    {
        "content": "<blockquote>\n<p>edit #1. Käytin äsken pari tuntia selaamalla simplifierin MedicationRequest -profiileja. Ylipäätään mitkään rakenteiseen annosteluun liittyvät standardista poikkeamat ovat ns. laskettavissa yhden käden sormilla. Toiseksi mitään Kanta-tietomallia muistuttavaa en onnistunut löytämään ollenkaan - tunteeko joku asiaa paremmin ?</p>\n</blockquote>\n<p>Selailitko Kanta-projektin (<a href=\"https://simplifier.net/prescriptionr4\">https://simplifier.net/prescriptionr4</a>) MedicationRequest profiilia (vain yksi) eli kohdistuuko tämä kommenttisi siihen vai ylipäätään Simplifierista löytyviä muitakin (muiden maiden) MedicationRequest-profiileja? Tämä \"Ylipäätään mitkään rakenteiseen annosteluun liittyvät standardista poikkeamat ovat ns. laskettavissa yhden käden sormilla.\" ei oikein aukea mitä sillä haet. Ylipäätään toivoisimme nyt tarkkoja esimerkkejä haasteista/ongelmista.</p>",
        "id": 224144223,
        "sender_full_name": "Mika Tuomainen",
        "timestamp": 1611728062
    },
    {
        "content": "<blockquote>\n<p>edit #2: Information to non-Finnish speakers</p>\n</blockquote>\n<p>At first phases, it is maybe better to use Finnish, all terms and concepts are only in Finnish (and Swedish) in Finnish prescription context . Therefore, if we want to discuss Kanta prescription here in English, we have to do some translation work at first. Otherwise, we are afraid, there is a big risk of misunderstandings. After there is a consensus on the basic things of the FHIR, then we can introduce open and more difficult issues to the international discussions.</p>",
        "id": 224144464,
        "sender_full_name": "Mika Tuomainen",
        "timestamp": 1611728399
    },
    {
        "content": "<p>Kysyttiin ”Mikä on Kanta-tietomalli mihin tässä viittaat ?” <br>\nValitettavasti parasta mitä puheenaolleen ”Kanta-tietomallin” suunnalla on tarjolla, on Koodistopalvelun tietosisältöjen, lääkemääräyksen CDA-rakennekuvausten ja toiminnallisten määrittelyiden muodostama dokumentaatiokokonaisuus täydennettynä lääkitysprojektin eri vaiheiden myötä syntyneellä kuvalla tavoite/tahtotilasta. Varsinkin rakenteisen annostelun osalta formaalin tietomallin (ymmärrettynä esim. FHIR-profiilina, XML-skeemana, tms) puuttuminen on ongelmallista, esimerkiksi kompaktien, eksaktien esimerkkien laatiminen kehityskohteiden hahmottamiseksi on kovin hankalaa.</p>\n<p>Itse ratkaisin tämän niin että loin vuosia sitten täysin epävirallisen, karkean ja mm. elementeiltään omavaltaisesti nimetyn, HL7-perustietotyyppeihin pohjaavan XML-skeemaparin (näitä noudattavine esimerkkitapausten XML-instansseineen) rakenteisesta annostelusta: toisen vastaten lääkemääräyksen julkaistua tietosisältöä ja toisen siitä miten ajattelin asiaa voitavan kehittää. Näin oli edes jollain tavalla konkreettinen pohja mistä kulloinkin keskustella.</p>\n<p>Työpajan 20.1.2021 loppupuolella korviini osui yleisön joukosta tullut maininta kansainvälisistä projekteista, joita mahdollisesti voitaisiin hyödyntää. Siispä, aivan kuten kirjoitin, selasin simplifierin MedicationRequest –resursseja (monikossa siis, sekä valmiita että luonnoksia) ja koitin katsoa miten niissä on lähestytty annostelun kuvaamista. Myöskään kokeeksi täällä Zulipissa sittemmin tekemäni  ”dosage -sanahaut” eivät tuoneet esiin mitään enempää (tai sitten en vaan osaa käyttää tätä). Koska tulokset jäivät mielestäni yllättävän laihoiksi, ei rakenteinen annostelu mitenkään voi olla vain kansallinen kysymys, ajattelin kysyä josko joku tuntisi FHIR-kontekstissa tehtyjä projekteja paremmin.</p>\n<p>”Ja jos korvaamme tuon dosageInstruction-elementin omalla rakenteella, voimme alkaa keskustella koko MedicationRequest-resurssin sopivuudesta.”<br>\nNiimpä. Eikä tietenkään ole järkevää käyttää resursseja Dosage -tietotyyppiin pohjaten jos sen avulla ei vaikuta mahdolliselta saavuttaa käyttökelpoista vastinetta rakenteisen annostelun, jonka ympärille ongelmat nähdäkseni (taas) keskittyvät, THL-tietomallille. Mutta samalla todettakoon, että olisi todella erikoinen tilanne jos joustavuudestaan ja laajennettavuudestaan tunnettu FHIR muodostuisi kehittämistä rajoittavaksi tekijäksi, kun asiat kerran on saatu ns. CDA-puolella hoidetuksi. Toki Lääkemääräyksen rakenteisen annostelun perusratkaisun saavuttamiseen meni todella monta vuotta ja projektia. Juuri edellämainituista syistä yritän omalta osaltani herätellä keskustelua \"korkeammalla tasolla / arkkitehtuuritasolla”.</p>",
        "id": 224631631,
        "sender_full_name": "Kari Heinonen",
        "timestamp": 1612081562
    },
    {
        "content": "<blockquote>\n<p>Työpajan 20.1.2021 loppupuolella korviini osui yleisön joukosta tullut maininta kansainvälisistä projekteista, joita mahdollisesti voitaisiin hyödyntää. Siispä, aivan kuten kirjoitin, selasin simplifierin MedicationRequest –resursseja (monikossa siis, sekä valmiita että luonnoksia) ja koitin katsoa miten niissä on lähestytty annostelun kuvaamista. Myöskään kokeeksi täällä Zulipissa sittemmin tekemäni ”dosage -sanahaut” eivät tuoneet esiin mitään enempää </p>\n</blockquote>\n<p>Seuraavia olemme katsoneet läpi ja ottaneet näistä myös mallia:</p>\n<p>NHSllä on paljon esimerkkejä rakenteisesta annostuksesta, noudattaa FHIR Dosagea, huom. ovat kylläkin FHIR STU3 mukaisia mutta niissä ei ole merkittävää eroa FHIR R4:seen:</p>\n<ul>\n<li><a href=\"https://fhir.nhs.uk/\">https://fhir.nhs.uk/</a> </li>\n<li><a href=\"https://developer.nhs.uk/apis/dose-syntax-implementation-1-3-2-alpha/\">https://developer.nhs.uk/apis/dose-syntax-implementation-1-3-2-alpha/</a></li>\n<li><a href=\"https://developer.nhs.uk/apis/dose-syntax-implementation-1-3-2-alpha/dosage-overview.html\">https://developer.nhs.uk/apis/dose-syntax-implementation-1-3-2-alpha/dosage-overview.html</a></li>\n<li><a href=\"https://developer.nhs.uk/apis/dose-syntax-implementation-1-3-2-alpha/dosage-examples-overview.html\">https://developer.nhs.uk/apis/dose-syntax-implementation-1-3-2-alpha/dosage-examples-overview.html</a></li>\n<li><a href=\"https://nhsconnect.github.io/Dose-Syntax-Implementation/dosage-examples-standard.html\">https://nhsconnect.github.io/Dose-Syntax-Implementation/dosage-examples-standard.html</a></li>\n<li><a href=\"https://nhsconnect.github.io/Dose-Syntax-Implementation/dosage-examples-additional.html\">https://nhsconnect.github.io/Dose-Syntax-Implementation/dosage-examples-additional.html</a></li>\n</ul>\n<p>Ruotsissa on kehitteillä kansallinen lääkityslista, tämä löytyy Simplifieristakin (materiaaliin ei tarvita tunnuksia). Myös täällä noudatetaan FHIR Dosagea (muutama laajennus taisi olla tehtynä). Täältä olemme katsoneet jonkun verran millaisia laajennuksia ruotsalaiset ovat tehneet. Mitään yhteistyötä ruotsalaisten kanssa ole ainakaan vielä viritelty:</p>\n<ul>\n<li><a href=\"https://simplifier.net/swedishnationalmedicationlist\">https://simplifier.net/swedishnationalmedicationlist</a></li>\n<li><a href=\"https://simplifier.net/guide/swedishnationalmedicationlist/home\">https://simplifier.net/guide/swedishnationalmedicationlist/home</a></li>\n<li><a href=\"https://simplifier.net/guide/swedishnationalmedicationlist/Dosageexamples\">https://simplifier.net/guide/swedishnationalmedicationlist/Dosageexamples</a></li>\n<li><a href=\"https://simplifier.net/swedishnationalmedicationlist/nllmedicationrequest\">https://simplifier.net/swedishnationalmedicationlist/nllmedicationrequest</a></li>\n<li><a href=\"https://simplifier.net/swedishnationalmedicationlist/nlldosage\">https://simplifier.net/swedishnationalmedicationlist/nlldosage</a></li>\n</ul>\n<p>Kv. järjestelmien osalta löytyy joistakin järjestelmistä FHIR rajapintakuvauksia, esim. Yhdysvalloissa vaaditaan rajapinnat julkisiksi, tässä linkki vaikkapa Epicin FHIR rajapintoihin:</p>\n<ul>\n<li><a href=\"https://fhir.epic.com/\">https://fhir.epic.com/</a></li>\n</ul>\n<p>Ja sitten löytyy myös US core FHIR määrittelyt (erillisiä Argonaut linkkejä en nyt tähän ehtinyt kaivaa):</p>\n<ul>\n<li><a href=\"https://www.hl7.org/fhir/us/core/\">https://www.hl7.org/fhir/us/core/</a></li>\n<li><a href=\"http://hl7.org/fhir/us/meds/\">http://hl7.org/fhir/us/meds/</a> (tämä STU3!)</li>\n</ul>\n<p>Norjalaiset ovat tehneet FHIR resursseista omat pohjaprofiilit, löytyy täältä </p>\n<ul>\n<li><a href=\"https://simplifier.net/hl7norwayno-basis\">https://simplifier.net/hl7norwayno-basis</a></li>\n</ul>\n<p>Zulipista (<a href=\"http://chat.fhir.org\">chat.fhir.org</a>) voi hakea streameista esim. näin:</p>\n<ul>\n<li>stream:implementers &gt; dosage</li>\n<li>stream:implementers &gt; medicationrequest</li>\n</ul>",
        "id": 224904321,
        "sender_full_name": "Mika Tuomainen",
        "timestamp": 1612286312
    }
]