[
    {
        "content": "<p>Olemme julkaisseet Simplifier.netissä ensimmäiset draft-versiot Lääkemääräyksen \"yksilöintitietojen\" palautuksessa tarvittavista FHIR resursseista. Reseptin Simplifier-projekti löytyy tästä osoitteesta:<br>\n<a href=\"https://simplifier.net/prescriptionr4\">https://simplifier.net/prescriptionr4</a> </p>\n<p>Tällä hetkellä on julkaistu profiilit MedicationReqeust- ja Medication-resursseista sekä näissä tarvittavat laajennukset (16 kpl). Näiden lisäksi löytyy esimerkkejä (resurssi-instanssit) MedicationRequest-, Medication-, Patient- ja Practitioner-resursseista.</p>\n<p>Edellisiin liittyen on tuotettu seuraavat materiaalit:</p>\n<ul>\n<li>Excel-taulukko, josta löytyy samat mappaukset kuin FHIR profiileista (myös puuttuvista profiileista), taulukossa mukana myös avoimet kohdat tämän hetkisissä määrittelyissä, Excel-taulukko on ladattavissa täältä: <a href=\"/user_uploads/10155/NtiBGBelFQLty2jYXb5uldvj/20210115_FHIR_mappaus_yksilointitiedot_palautus_PUBL.xlsx\">FHIR resurssien mappaus yksilointitietoihin</a></li>\n<li>PowerPoint-esitys (pdf) avoimista kohdista, joissa on selitetty avoimia kohtia tarkemmin, PowerPoint-esitys on ladattavissa täältä: <a href=\"/user_uploads/10155/kcNjPhVfZmExxnm1pd7gW5eh/Reseptin-FHIR-rajapintasuunnitelma-AVOIMET-20210120.pdf\">Reseptin FHIR rajapintasuunnitelman avoimet kohdat</a></li>\n</ul>\n<p>Määrittelyjen työstövaiheen kommentointi on tarkoitus käydä pelkästään täällä <a href=\"http://chat.fhir.org\">chat.fhir.org</a> alustan Kanta FHIR Prescription streamissa. Kommentit annetaan avaamalla streamiin uusi topic (New topic) tai vastaamalla jo saman aiheen olemassa olevaan topiciin (Reply). Kommentit pyydetään kohdentamaan tarkasti kommentoitavaan kohtaan topicin otsikossa.</p>\n<p>Pelkkien kommenttien tai ongelmakohtien tunnistamisen lisäksi toivotaan keskustelua ja ratkaisuehdotuksia ongelmakohtiin/avoimiin kohtiin sekä myös muiden kommenttien kommentointia tai kommenttien tarkentamista (myös muuten kuin Kela-vetoisesti). </p>\n<p>Jos on jotain epäselvää, ottakaa yhteyttä <a href=\"mailto:kantakehitys@kanta.fi\">kantakehitys@kanta.fi</a></p>\n<p>Esitys joka käytiin 20.1.2021 palaverissa: <a href=\"user_uploads/10155/G8Ta1zMALoIGDXQdSJChioGn/Reseptin-FHIR-rajapintasuunnitelma-20210120.pdf\">Reseptin FHIR määrittelyiden läpikäynti</a></p>",
        "id": 223340819,
        "sender_full_name": "Mika Tuomainen",
        "timestamp": 1611129065
    }
]