[
    {
        "content": "<p>Hi all,</p>\n<p>International Patient Access (IPA) is an HL7 project aimed at specifying a minimal set of base FHIR profiles and interactions for countries to use to give patients access to health data using FHIR.</p>\n<p>We’re continuing pushing the International Patient Access specification forward. In the next FHIR Connectathon, we intend to</p>\n<ul>\n<li>Validate the specification with both server and client implementations.</li>\n<li>Continue comparing IPA against known national and regional FHIR base profile specifications.</li>\n<li>Strengthen cooperation and bindings between IPA and IPS (International Patient Summary).</li>\n<li>Discuss future developments.</li>\n</ul>\n<p>We are inviting people working with national or regional FHIR base profile specifications to participate on the IPA Track at the Connectathon.</p>\n<p>We believe this is an excellent opportunity for you to get your base profile definitions tried out by real world implementations.</p>\n<p>The track will also help you see how well your base profile specification is aligned with the IPA specification and other regional specifications, and is an opportunity to achieve better alignment. Please remember, that the IPA specification is open for change requests too, and this is a great time to affect the development of the specification.</p>\n<p>We will have sessions, office hours, and checkpoints throughout the 24 hours of each day of the Connectathon, making it easy to participate from all parts of the world.</p>\n<p>In case you are interested in this work but are not able to join the Connectathon, please consider<br>\nA) submitting packages for the profile specification that could be used to set up a server conforming to your base profile<br>\nB) submitting example resources that can be validated against the IPA specification, and used by both servers and apps participating on the track.</p>\n<p>Please see the signup sheet on the <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=90358347#id-202205InternationalPatientAccess-Signup\">track page</a> for more details.</p>\n<p>There may be interest among the track participants to test known profiles and examples, and to give you feedback. We may also implement some of the information as references to the IPA specification.</p>",
        "id": 275728743,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1647551884
    }
]