[
    {
        "content": "<p>I am exploring switching my Logical Model SDs from being instances to the new Logical capabilities.  I'm also using indenting of the rules to check how that works.  It definitely made my logical model FSH file much more readable.  But I'm getting a strange error that I can't decipher:</p>\n<blockquote>\n<p>no viable alternative at input '* contactParty BackboneElement'</p>\n</blockquote>\n<p>Here is a snippet of the definition:</p>\n<div class=\"codehilite\"><pre><span></span><code>* labeler 1..1 BackboneElement &quot;Labeler&quot; &quot;The organization that is requesting the NDC Labeler Code.&quot;\n  * dunsNumber 1..1 string &quot;Labeler DUNS Number&quot; &quot;The Dun &amp; Bradstreet number assigned to the Labeler organization headquarters.&quot;\n  * labelerCode 0..1 string &quot;NDC Labeler Code&quot; &quot;The NDC Labeler code assigned by the FDA to Labeler organization.&quot;\n  * name 1..1 string &quot;Labeler Name&quot; &quot;The business name of the Labeler organization.&quot;\n  * address 0..1 Address &quot;Labeler Address&quot; &quot;The Labeler organization&#39;s address.&quot;\n  * contactParty BackboneElement 1..1 &quot;Labeler Contact Party&quot; &quot;The person at the Labeler Organization to contact about this Labeler request.&quot;\n    * name 1..1 string &quot;Labeler Contact Party Name&quot; &quot;The name of the Labeler contact person.&quot;\n</code></pre></div>\n<p>I'm not sure what \"no viable alternative\" means.</p>",
        "id": 255460010,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1632943891
    },
    {
        "content": "<p>That's ANTLR (our parser) speak for \"I expected to see X in this part of the statement, but you put Z.  Z is not a viable token to have in this spot.\"  In your case, it's saying that after reading <code>contactParty BackboneElement</code>, so <code>BackboneElement</code> is the thing it did not expect to see.  That's because it's expecting to see a cardinality there, not a type.  You swapped the cardinality and type on that line.</p>",
        "id": 255460618,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1632944125
    },
    {
        "content": "<p>ah, didn't even notice that! thx</p>",
        "id": 255460771,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1632944181
    },
    {
        "content": "<p>now that SUSHI runs without any errors, I don't see the generated LogicalModel.  I have <code>Logical: LabelerCodeRequestLogicalModel</code> but there is no StructureDefinition-LabelerCodeRequestLogicalModel.json in the fsh-generated/resources directory.</p>",
        "id": 255461508,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1632944508
    },
    {
        "content": "<p>Hmmm... I don't know why that would be.  Can you try it once more?  Just for me?  And can you confirm you're on the latest SUSHI? (I think it's v2.0.1).</p>",
        "id": 255461998,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1632944711
    },
    {
        "content": "<p>i was one version behind so that must have been it.</p>",
        "id": 255474442,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1632949548
    },
    {
        "content": "<p>with the upgrade to the latest version, I'm getting the following warning: \"The match value of filter operator \"=\" must be a code. For string valued properties, use the regex filter operator with a regular expression value. Support for using strings as filter values has been deprecated and will be removed in a future release.\"  But it doesn't tell me what file or where.</p>",
        "id": 255474640,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1632949611
    },
    {
        "content": "<p>maybe that's in a valueSet definition where I use include?  (Yep, that's it)</p>",
        "id": 255475152,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1632949827
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> has marked this topic as resolved.</p>",
        "id": 255475556,
        "sender_full_name": "Notification Bot",
        "timestamp": 1632950013
    }
]