[
    {
        "content": "<p>Hi, I wonder which stream I should post this question. If I put it here is inappropriate, I beg your pardon.</p>\n<p>We build IG in two versions, one is in English, and the other is in Traditional Chinese.<br>\nHowever, I found that Profile's \"differential table\" in our Chinese version will not be displayed the same as in the English version. I guess the reason is that we have translated the default description &amp; constraints from English to Chinese. So, the \"_genonce.bat\" or \"publisher.jar\" thinks we have modified the default values (even though we only do the translation without redefining cardinality, etc.) and put those translated elements in the differential table. as shown below.</p>\n<p><a href=\"/user_uploads/10155/e5o2dXSDZi_Jr3N_celnIraA/Image-1.jpg\">Image-1.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/e5o2dXSDZi_Jr3N_celnIraA/Image-1.jpg\" title=\"Image-1.jpg\"><img src=\"/user_uploads/10155/e5o2dXSDZi_Jr3N_celnIraA/Image-1.jpg\"></a></div><p>I wonder if there is any possibility that we could figure out the display problem by coding, not by manually deleting the unnecessary content in the output HTML files.<br>\nThank you!</p>\n<p>Li-Hui</p>",
        "id": 267844130,
        "sender_full_name": "Li-Hui Lee",
        "timestamp": 1642066588
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196446\">@Li-Hui Lee</span>. I think the differential table shows any element that has changed in any way -- which would include changes to the <code>short</code> description. I understand why you might not want this in cases like yours, where the change really is just a translation of the original text. I think this issue would fit best in the <a class=\"stream\" data-stream-id=\"179252\" href=\"/#narrow/stream/179252-IG-creation\">#IG creation</a> stream, so you might want to post it there as well.  Maybe someone will have an idea or has done something like this before.</p>\n<p>You might notice that a lot of the other data in the elements uses a very light (or partially transparent?) font. This indicates that the data did not actually change.  So users can see that the important things (like cardinality and type) did not actually change.  But... it is pretty subtle.</p>",
        "id": 267870386,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1642081653
    },
    {
        "content": "<p>Thank you! <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>  I have re-posted it to <a href=\"#narrow/stream/179252-IG-creation/topic/A.20problem.20of.20multi-language.20IG\">https://chat.fhir.org/#narrow/stream/179252-IG-creation/topic/A.20problem.20of.20multi-language.20IG</a><br>\nI also noticed what you mentioned. Maybe the last way is to skip this subtle issue.  :)</p>",
        "id": 267880422,
        "sender_full_name": "Li-Hui Lee",
        "timestamp": 1642086040
    }
]