[
    {
        "content": "<p>Is there any way to refer to a CodeSystem defined in a .fsh File by its not-yet-generated url from another part of the file? E.g. I want to define a ConceptMap Instance that maps on of my CodeSystems. So I need to set the group.source element to the CodeSystem.url, but since this URL is generated by SUSHI i do not want to hardcode it.</p>",
        "id": 196198586,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1588606727
    },
    {
        "content": "<p>In this case, no, you cannot access the CS url. This is something that other users have asked for, see <a href=\"https://github.com/FHIR/sushi/issues/355\" title=\"https://github.com/FHIR/sushi/issues/355\">https://github.com/FHIR/sushi/issues/355</a>, so I think this is definitely something we will look to add. </p>\n<p>SUSHI will replace the CodeSystem name with its url when the CodeSystem name is used as part of a code, like if you had a CodeSystem named <code>MyCodeSystem</code>, you could do <code>MyCodeSystem#Foo</code>, and the <code>MyCodeSystem</code> would be replaced with the URL of the CodeSystem. But this unfortunately does not help in your case.</p>",
        "id": 196200073,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1588607391
    },
    {
        "content": "<p>Ok, thanks! I'm looking forward to this feature</p>",
        "id": 196204116,
        "sender_full_name": "Noemi Deppenwiese",
        "timestamp": 1588609114
    },
    {
        "content": "<p>For now, you could hack it... We know the URL will just be your IG Canonical URL + <code>/CodeSystem/</code> + the code system ID.  So I think you should be able to manually specify the URL where you want to use it by using that formula.  You just need to be aware that it is brittle and would need to be manually adjusted if you changed the IG canonical URL or the code system ID.</p>",
        "id": 196212873,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588613104
    }
]