[
    {
        "content": "<p>The language reference (<a href=\"https://build.fhir.org/ig/HL7/fhir-shorthand/reference.html#defining-aliases\">https://build.fhir.org/ig/HL7/fhir-shorthand/reference.html#defining-aliases</a>) describes two conventions for naming aliases ($ and CAPS) and I was wondering if folks have guidance on when to use which.</p>",
        "id": 198126288,
        "sender_full_name": "Rob Reynolds",
        "timestamp": 1589922210
    },
    {
        "content": "<p>The advantage of <code>$</code> is that it does give you extra, more clear, error checking. For example, if you have:</p>\n<div class=\"codehilite\"><pre><span></span><code>Alias: $USCoreOrganization = http://hl7.org/fhir/us/core/StructureDefinition/us-core-organization\n</code></pre></div>\n\n\n<p>And then, in your profile, you do (note that I am intentionally making a typo on <code>USCoreOrganizatioN</code>):</p>\n<div class=\"codehilite\"><pre><span></span><code>Profile: MyPatient\nParent: Patient\n* generalPractitioner only Reference($USCoreOrganizatioN)\n</code></pre></div>\n\n\n<p>you will get the following error:</p>\n<div class=\"codehilite\"><pre><span></span><code> Value $USCoreOrganizatioN does not resolve as alias, values beginning with &quot;$&quot; must resolve\n</code></pre></div>\n\n\n<p>If instead, you did not use the dollar sign:</p>\n<div class=\"codehilite\"><pre><span></span><code>Alias: USCoreOrganization = http://hl7.org/fhir/us/core/StructureDefinition/us-core-organization\n\nProfile: MyPatient\nParent: Patient\n* generalPractitioner only Reference(USCoreOrganizatioN)\n</code></pre></div>\n\n\n<p>you would get the error:</p>\n<div class=\"codehilite\"><pre><span></span><code>No definition for the type &quot;USCoreOrganizatioN&quot; could be found.\n</code></pre></div>\n\n\n<p>In this example, perhaps it isn't a big difference, but I would argue the first error is much more clear and more quickly points you towards the issue, that something that should resolve to an aliased value is not resolving. We can give this more clear error only when the <code>$</code> is used, since this signifies that the value is always an alias.</p>\n<p>So my suggestion would be to use <code>$</code> if you can. Using caps is also good since it makes aliases more visually obvious. If you are giving a short codesystem name like:</p>\n<div class=\"codehilite\"><pre><span></span><code>Alias:   $LNC = http://loinc.org\n</code></pre></div>\n\n\n<p>The caps can be helpful. However, you will notice that further above I did not use caps, since in my opinion:</p>\n<div class=\"codehilite\"><pre><span></span><code>Alias: $USCOREORGANIZATION = http://hl7.org/fhir/us/core/StructureDefinition/us-core-organization\n</code></pre></div>\n\n\n<p>is hard to visually parse. So in my opinion best practice is <code>$</code> always, and caps when you feel it doesn't detract from readability. However, those are just guidelines, not syntax requirements, and you are welcome to ignore them if you have a preferred style that is more readable to you.</p>",
        "id": 198189616,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1589977267
    },
    {
        "content": "<p>As Nick noticed, one advantage of using the <code>$</code> prefix is that SUSHI knows it <em>must</em> be an alias, so it treats it like such.  Without using the <code>$</code>, it could be an alias, but it also could be some existing profile's name or id (which is another way SUSHI can resolve things).</p>\n<p>Since <code>$</code> is only allowed in alias names (and not any other names), it prevents the unintentional mistake of having an alias name that is the same as the name of some other thing in the IG (or the IG's dependencies) -- in which case it is not clear whether SUSHI would use the alias or the thing that has the same name as the alias.</p>",
        "id": 198233593,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1589997015
    }
]