[
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> <br>\nYou talked about adding the capability to auto index arrays (reference last element, add new element, etc) recently. Do you still have plans to do this? Any guestimates on timing?</p>\n<p>I am doing some funky stuff with arrays that would be easier if I didn't have to automatically increment automatic array indices. Hoping you did the work so I don't have to :-)</p>",
        "id": 205632518,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1596224139
    },
    {
        "content": "<p>Hi Kurt, we are planning to Do something with this after the 1.0 release. We’d like to talk to you about ideas you might have associated with macros as a possible workaround.</p>",
        "id": 205632717,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1596224236
    },
    {
        "content": "<p>Mark, here is what MFSH (Macro FSH) currently does.<br>\nLets talk about this and see what parts make sense to move into FSH.</p>\n<hr>\n<p>Macros</p>\n<hr>\n<p>Macros are inserts with the following additions.<br>\na) Named parameters.<br>\n   When the macro is defined, named parameters are defined. When called, each of those<br>\n   parameters must contain a value.<br>\n   #macro XXYYZ(alpha, beta, delta)<br>\n   #apply XXYYZ(\"alpha value\", \"beta value\", \"delta value\")<br>\n   Anywhere in the code that 'alpha' is found, it is replaced with 'alpha value'.<br>\nb) Global parameters.<br>\n   There are parameters that are defined globally, such as</p>\n<p>- the id of the current profile<br>\n   - the url of the current profile.<br>\n   - parameters that can be set on command line<br>\n   many others<br>\n   These can be referenced in any macro just as if it was a named parameter.</p>\n<p>c) Redirection<br>\n   The output of a macro can be redirected to a non-fsh file.<br>\n   The output file name can contain global and named parameters which will get expanded when the macro is called/executed (not when it is<br>\n   first defined)<br>\n   I use this to collate info such as node graph commands I process externalluy to generate svg images, and also to allow embedded<br>\n   macros to generate the --intro implementation guide files for each profile.</p>\n<div class=\"codehilite\"><pre><span></span><code>   #macro XXYYZ() &gt; &#39;redirection path&#39;\n</code></pre></div>\n\n\n<p>d) Once flags<br>\n   The once flag allows a macro to be called only once, even if it is executed multiple times.<br>\n   Example of how this can be used:<br>\n   Several macros are defined that add distinct sliced Observation.component items. These macros are sometimes used in a profile together, and<br>\n   in some profiles separately.<br>\n   Each macro calls a common macro to add component slicing; this should only be called once per profile.<br>\n   One way to handle this is to force the user to call this macro separately, once per profile, but this requires the user to<br>\n   manually add this and allows opportunities to not call it.<br>\n   So a macro is defined that implements the required slicing commands, and it is called with the once flag set, so it <br>\n   only generates FSH output the first time it is called.<br>\n   There are two flavors of the once flag.</p>\n<p>- restrict calls to once per profile<br>\n   - restrict the calls to once period.<br>\n   Named Parameters can be a problem here, as multiple calls can be made with difference named parameter values, and only<br>\n   the first call will create output with its unique parameter values.</p>\n<p>// this is expanded once per profile.<br>\n    #macro once XXYYZ()<br>\n    #end</p>\n<p>// this is expanded once, no matter how many times it is called.<br>\n    #apply once XXYYZ()</p>\n<hr>\n<p>Fragments</p>\n<hr>\n<p>A fragment is kinda a cross between a profile and a macro.<br>\nThe purpose of a fragment is to define a profile fragment that <br>\n  a) can be added to multiple profiles (like a macro)<br>\n  b) is intended to signal to code generators that each fragment can be treated like a separate 'thing' (class or interface).<br>\n  c) breaks the output profile into separate pieces that are functionally unique, implemented in multiple profiles, and documented as separate 'thing'.</p>\n<p>Example.<br>\n  I create a fragment 'f' that is three Observation.component items.<br>\n  I include the fragment in multiple profiles 'a', 'b', and 'c'.</p>\n<p>I generate a c# project that implements a class to process these profiles.<br>\n  I can generate a method 'm' that can accept an interface 'f' that mimics the fragment 'f'.<br>\n  Classes are created that mimic profiles 'a', 'b', and 'c', each of which implements interface 'f'.<br>\n  I can call method 'm' with an instance of 'a', 'b', or 'c'.</p>\n<p>So a fragment is a part of a profile that is to be implemented in multiple profiles but treated like a 'distinct' item<br>\nin generated artifacts (including implementation guide).</p>\n<p>The fragment would have a parent class (like Observation).<br>\nIt should generate an item in the implementation guide showing exactly what it implemented.<br>\nIt should generate documentation in the documentation guide indicating what profiles implement it.</p>\n<p>A profile can include one or more fragments just like a macro.<br>\nNo named parameters are allowed in a fragment call.</p>\n<p>The fragments generate structure definition and other meta data allowing external code generation tools to recognize<br>\nwhen a fragment has been defined, and where it is used. Programming artifacts can be generated from this info.</p>\n<p>#Fragment: Observation.Component.NotPreviouslySeenFragment<br>\n#Parent: Observation<br>\n#Title: \"NotPreviously Seen Fragment\"<br>\n#Description: \"\"\"</p>\n<h1>Adds NotPreviously Seen Component slice.</h1>\n<h1>\"\"\"</h1>\n<p>#apply Observation.Component.Add(\"notPreviouslySeen\", \"0..*\", \"Not Previously Seen\", \"Not Previously Seen\",<br>\n  # \"\"\"<br>\n  # This slice contains the optional components that define prevous encounters in which this abnormality was not seen.<br>\n  # The value of this component is a codeable concept chosen from the NotPreviouslySeenVS valueset.<br>\n  # \"\"\",<br>\n  #   \"ObservationComponentSliceCodesCS#notPreviouslySeen\")<br>\n  #<br>\n  #apply Observation.Component.SetConcept(\"notPreviouslySeen\", \"1..1\", \"NotPreviouslySeenVS\")<br>\n#end</p>\n<hr>\n<p>Conditional compilation</p>\n<hr>\n<p>This is completely experimental and I have not found it to be useful so far, but there may be instances where it may become useful.<br>\nThis is identical to conditional compilation in c++, c3, etc.<br>\nWe may want to ignore adding this to FSH. Not sure if it will ever be usefull, though we still need some way to implement<br>\ndifferent countries using similar profiles.</p>\n<p>i.e.</p>\n<p>#if (value1==\"true\")<br>\nif value1 is true, then include all text here.<br>\n#else if (value2==\"false\")<br>\nif value1 is false, then include all text here.<br>\n#else<br>\notherwise include all text here.<br>\n#end</p>\n<p>The original purpose of conditional compilation was to allow a profile to be made that could be compiled for different countries.</p>\n<p>i.e.<br>\nProfile: Hello<br>\nParent: Observation<br>\n#if Country == \"US\"</p>\n<ul>\n<li>\n<p>greeting = \"Hello\"<br>\n#else if Country == \"CA\"</p>\n</li>\n<li>\n<p>greeting = \"Hello, eh\"<br>\n#else if Country == \"NO\"</p>\n</li>\n<li>\n<p>greeting = \"Uff da\"<br>\n#else if Country == \"AU\"</p>\n</li>\n<li>\n<p>greeting = \"G'Day\"<br>\n#end</p>\n</li>\n</ul>",
        "id": 205638402,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1596227474
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192611\">@Kurt Allen</span> -- for reference, here is a link to the discussion where we proposed an approach for easier management of arrays.  If you read through the comments, you'll see it got some thumbs up, but there were also several people who did <em>not</em> like it: <a href=\"#narrow/stream/215610-shorthand/topic/Feedback.20Needed.3A.20Array.20Syntax/near/203963085\">https://chat.fhir.org/#narrow/stream/215610-shorthand/topic/Feedback.20Needed.3A.20Array.20Syntax/near/203963085</a></p>",
        "id": 205641247,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1596229339
    },
    {
        "content": "<p>I'm going to fork off a new topic on Parameterized RuleSet (Macros) so we keep the two conversations distinct.</p>",
        "id": 206475569,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1597073873
    }
]