[
    {
        "content": "<p>Mark and Chris, I went to your presentation at the DevDays yesterday. It was a great talk! I wonder if FSH could be used to build a new Resource type? We have to create completely new Resource types and currently we're using the Excel spreadsheets to build it. It would be nice if we could use FSH to do it. Thanks!</p>",
        "id": 201031809,
        "sender_full_name": "Dazhi Jiao",
        "timestamp": 1592321110
    },
    {
        "content": "<p>Be aware that new resource types are not FHIR-conformant - and are unlikely to work with most FHIR tooling or implementations.</p>",
        "id": 201031972,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592321163
    },
    {
        "content": "<p>Yes. That's another question I have. Right now we're running a build process to generate some Java files in a semi-automated process which is a pain. I think the problem we have is that the models we are building doesn't have a good existing Resource to extend from. Any suggestions?</p>",
        "id": 201032401,
        "sender_full_name": "Dazhi Jiao",
        "timestamp": 1592321343
    },
    {
        "content": "<p>Basic is the 'conformant' solution to that issue.  Have you raised the use-case on the <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a> stream?</p>",
        "id": 201032791,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592321499
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"239603\">@Dazhi Jiao</span>!  I'm glad you enjoyed it.  FHIR Shorthand currently supports defining profiles, extensions, value sets, and code systems.  It does not support defining <em>new</em> resources. We'll continue to enhance FSH in future versions based on what the community needs.  We already plan to support logical models, as we've received many requests for that; but we haven't yet seen sufficient interest in defining new resources...</p>\n<p>You always have the option to use FHIR Shorthand to define an <code>Instance</code> of a <code>StructureDefinition</code> -- but I imagine that would be a very tedious approach to defining new resources.</p>",
        "id": 201032936,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1592321558
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Thanks! I'll look at the Basic resource. I'll check the implementers stream.</p>",
        "id": 201033449,
        "sender_full_name": "Dazhi Jiao",
        "timestamp": 1592321768
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>  Thank you for the answer! I look forward to the let's build session tomorrow, btw.</p>",
        "id": 201033480,
        "sender_full_name": "Dazhi Jiao",
        "timestamp": 1592321792
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239603\">@Dazhi Jiao</span> -- Great!  Just so you know, 40 minutes isn't enough time to <em>do</em> the exercise, so we'll just be answering questions and going over the solution during the session.  So if you have a chance to work on it before the session, that's probably the ideal situation!</p>",
        "id": 201038202,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1592323707
    }
]