[
    {
        "content": "<p>I have a ValueSet, and I'm trying to set the narrative:</p>\n<div class=\"codehilite\"><pre><span></span><code>ValueSet: VsX\nTitle: &quot;X Value Set&quot;\nDescription: &quot;A X value set&quot;\n* ^text.status = #additional\n* ^text.div = &quot;&quot;&quot;\n&lt;div xmlns=&quot;http://www.w3.org/1999/xhtml&quot;&gt;\nBlah. Blah. Blah.\n&quot;&quot;&quot;\n* codes from valueset http://hl7.org/fhir/ValueSet/marital-status\n</code></pre></div>\n<p>This works. However, originally, I tried:</p>\n<div class=\"codehilite\"><pre><span></span><code>* ^text\n  * status = #additional\n</code></pre></div>\n<p>and</p>\n<div class=\"codehilite\"><pre><span></span><code>* ^text\n  * ^status = #additional\n</code></pre></div>\n<p>but neither worked. Are they expected to?</p>",
        "id": 253820686,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1631921268
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>.  The indent syntax is intended to be used only with primary paths (a term I just made up now, but meaning element paths for instances, profiles, resources, logicals; code paths for code systems).  Value Sets don't really have any primary paths per se, so indent rules don't apply there at all.</p>\n<p>We had thought about supporting indent rules w/ caret paths, but felt it might be more confusing in profile rules that have an element path and a caret path (for users to know which one is the context in an indented rule).</p>",
        "id": 254047760,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1632143764
    },
    {
        "content": "<p>Understood.</p>\n<p>However, the different rules in different contexts has been tripping me up lately. You can't use an extension the same way everywhere (sometimes you can use the url as the index and just supply a value, sometimes you need to explicitly specify url and value elements); indents don't work everywhere; various elements can be accessed directly in some places, but need to be caret-escaped in others. It would be useful if the syntax was more consistent, or there was more clarity about what syntax rules apply when.</p>",
        "id": 254076109,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632154603
    },
    {
        "content": "<p>Thanks for the feedback, <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>.  It's tricky trying to weigh tradeoffs between succinctness and ambiguity, striving for consistency across slightly different use cases, etc...  I can probably give you a reason for each one of the things you brought up, as most were intentional decisions involving tradeoffs between one less-than-ideal thing and another less-than-ideal thing.  BUT... I realize that it still doesn't help you, as a user of the language, know what to do when -- or remember the various little differences.  Do you have any recommendations on how we might at least document these things better to support FSH authors?</p>",
        "id": 254101210,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1632164679
    },
    {
        "content": "<p>Yeah, I can understand how we got where we got here. I think your \"primary paths\" idea is a good start. If the documentation could separate the objects into two classes, and say here are the rules that apply to class A, and here are the rules that apply to class B, that would be helpful. Ideally there are only two cases -- things that \"natively\" support element paths, and things that don't. At least then I can't claim to be surprised when I get tripped up.</p>",
        "id": 254119879,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632172639
    }
]