[
    {
        "content": "<p>In my IG, I'm creating profiles based on profiles found in the <a href=\"http://hl7.org/fhir/uv/genomics-reporting/STU1/index.html\" title=\"http://hl7.org/fhir/uv/genomics-reporting/STU1/index.html\">Clinical Genomics Reporting IG</a>. For example, I'm creating a profile whose parent is the <a href=\"http://hl7.org/fhir/uv/genomics-reporting/STU1/haplotype.html\" title=\"http://hl7.org/fhir/uv/genomics-reporting/STU1/haplotype.html\">Haplotype</a> Observation profile. In Haplotype, <code>derivedFrom</code> is sliced using pattern on <code>resolve().code</code>. In my profile, which is based on Haplotype, I want to add a slice for <code>derivedFrom</code> for a profile for <a href=\"https://www.hl7.org/fhir/molecularsequence.html\" title=\"https://www.hl7.org/fhir/molecularsequence.html\">MolecularSequence</a>. The MolecularSequence resource is one of the acceptable references for <code>derivedFrom</code> in the base <a href=\"https://www.hl7.org/fhir/Observation.html\" title=\"https://www.hl7.org/fhir/Observation.html\">Observation</a> resource. But because MolecularSequence doesn't have a code, any attempt to create a slice in my derived profile to reference a profile on MS results in an error. I'm assuming it's getting the slice pattern and path from the parent. </p>\n<p>Basically I have two questions. First, is it possible to add a <code>derivedFrom</code> slice with a discriminator path different from the parent profile (e.g., maybe <code>resolve().type</code>)? Second, if so, how do I do it in FSH?</p>",
        "id": 193574814,
        "sender_full_name": " Bob Milius",
        "timestamp": 1586529093
    },
    {
        "content": "<p>Bob, I don't think that's possible. The discriminator applies to all the slices.</p>",
        "id": 193817869,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1586809967
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> That's what I was beginning to suspect.</p>",
        "id": 193831790,
        "sender_full_name": " Bob Milius",
        "timestamp": 1586818506
    }
]