[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> , happy new year David,</p>\n<p>Is there a way for ClinFHIR to build bundles in FSH? Or does it only build the bundle in JSON?</p>\n<p>I used ClinFHIR to build the bundle and pasted the JSON output into <a href=\"https://fshschool.org/FSHOnline/#/\">https://fshschool.org/FSHOnline/#/</a> to convert it to FSH. </p>\n<p>The FSH online site either just spins forever and produces nothing or it gives me one error: 'error Definition of ResourceType not found for undefined. Cannot export any Assignment Rules'</p>",
        "id": 266931279,
        "sender_full_name": "Craig Anderson",
        "timestamp": 1641387188
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"408801\">@Craig Anderson</span> - I know you asked a question of David, but I’m interested in the bit about FSH Online. If the bundle is extremely large, it’s possible that FSH Online is just bumping into limitations based on browser memory. Or something else could be going on. If you want us to look into it, please attach the bundle to this thread or DM it to me.</p>",
        "id": 266934348,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1641388840
    },
    {
        "content": "<p>I was also going to suggest that you mention the issue to the mitre team!  Assuming that you're using graphbuilder. then there' an option to save the FSH directly to a file - in the content tab of a view there's a link to the right 'Download all FSH'. Could you do that and upload the result here? Could be some issue with the FSH generation in CF...</p>",
        "id": 266958677,
        "sender_full_name": "David Hay",
        "timestamp": 1641401053
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> , see attached for a copy of the JSON and, as <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> suggested, a copy of the Download all FSH file. </p>\n<p><a href=\"/user_uploads/10155/6b54PKUeRC8JBT5hI0DIaUs_/Vulcan-ePI-Sample-Initial-view-fsh-3.fsh\">Vulcan-ePI-Sample-Initial-view-fsh-3.fsh</a> <a href=\"/user_uploads/10155/NjFEtFPuYTXFzGQxEyJv_kdC/Vulcan-ePI-Sample-Initial-view-3.json\">Vulcan-ePI-Sample-Initial-view-3.json</a></p>",
        "id": 266986733,
        "sender_full_name": "Craig Anderson",
        "timestamp": 1641414504
    },
    {
        "content": "<p>So I was able to paste into fshschool - but quite a few errors, and only 10 of the instances were converted. <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> could it be related to R5 (which is what this graph is)? <span class=\"user-mention\" data-user-id=\"408801\">@Craig Anderson</span> - can you save to the library and send me the link?</p>",
        "id": 267006262,
        "sender_full_name": "David Hay",
        "timestamp": 1641424947
    },
    {
        "content": "<p>Oh. Yeah.  FSH Online only supports R4 at the moment.  So that would probably be important in this case.</p>",
        "id": 267006874,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1641425373
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> what about <code>gofsh</code>- does that support 5.0.0-snapshot1?</p>",
        "id": 267007047,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1641425500
    },
    {
        "content": "<p>Uhhh.... that's a GREAT question that I honestly do not remember.  I will have to look it up.</p>",
        "id": 267007186,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1641425576
    },
    {
        "content": "<p>So the answer is no, GoFSH does not currently support 5.0.0-snapshot1.  GoFSH uses the dependency loader from SUSHI, but the current release uses the SUSHI 2.2.4 loader, and 5.0.0-snapshot1 support was added in SUSHI 2.2.5.  We should be able to update GoFSH pretty easily though.  Probably tomorrow.</p>",
        "id": 267008189,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1641426331
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191321\">David Hay</span> <a href=\"#narrow/stream/215610-shorthand/topic/ClinFHIR/near/267006262\">said</a>:</p>\n<blockquote>\n<p>So I was able to paste into fshschool - but quite a few errors, and only 10 of the instances were converted. <span class=\"user-mention silent\" data-user-id=\"191469\">Chris Moesel</span> could it be related to R5 (which is what this graph is)? <span class=\"user-mention silent\" data-user-id=\"408801\">Craig Anderson</span> - can you save to the library and send me the link?</p>\n</blockquote>\n<p>Having some trouble saving the latest one but here is a link to a recent one that is similar: http://gb2.clinfhir.com#cfsb1639492546985. </p>\n<p>Here's a smaller and less complicated one: http://gb2.clinfhir.com#id1639753349790</p>",
        "id": 267010747,
        "sender_full_name": "Craig Anderson",
        "timestamp": 1641427955
    },
    {
        "content": "<p>What sort of trouble?</p>",
        "id": 267013942,
        "sender_full_name": "David Hay",
        "timestamp": 1641430556
    },
    {
        "content": "<p>and that first graph certainly is complex! Interesting that the narrative is so large as well. Might be worth having a separate view to show narrative - I'll think on it...  The other thing I'll look at doing is to import from FSH. For simplicities sake, I'll assume a single FSH file that has all the resources instances in it. That way, the FSH download can act as a kind of backup in case of issues.</p>",
        "id": 267014303,
        "sender_full_name": "David Hay",
        "timestamp": 1641430826
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191321\">David Hay</span> <a href=\"#narrow/stream/215610-shorthand/topic/ClinFHIR/near/267013942\">said</a>:</p>\n<blockquote>\n<p>What sort of trouble?</p>\n</blockquote>\n<p>Went into Save to Server (HAPI R5) &gt; Prepare to Save and it showed errors that were not picked up by the normal validation step when the resources were built. For example, </p>\n<ol>\n<li>\n<p>All resources had this error<br>\ndom-6: 'A resource should have narrative for robust management' Rule 'A resource should have narrative for robust management' Failed</p>\n</li>\n<li>\n<p>Got this error for both Composition resources Package Leaflet 120 mg and Package Leaflet 30 mg</p>\n</li>\n</ol>\n<p>dom-6: 'A resource should have narrative for robust management' Rule 'A resource should have narrative for robust management' Failed<br>\nNone of the codings provided are in the value set <a href=\"http://hl7.org/fhir/ValueSet/doc-typecodes\">http://hl7.org/fhir/ValueSet/doc-typecodes</a> (<a href=\"http://hl7.org/fhir/ValueSet/doc-typecodes\">http://hl7.org/fhir/ValueSet/doc-typecodes</a>), and a coding is recommended to come from this value set) (codes = <a href=\"https://spor.ema.europa.eu/#100000155538\">https://spor.ema.europa.eu/#100000155538</a>)<br>\nThe value provided ('unrestricted') is not in the value set <a href=\"http://terminology.hl7.org/ValueSet/v3-Confidentiality|2.0.0|2.0.0\">http://terminology.hl7.org/ValueSet/v3-Confidentiality|2.0.0|2.0.0</a> (<a href=\"http://terminology.hl7.org/ValueSet/v3-Confidentiality\">http://terminology.hl7.org/ValueSet/v3-Confidentiality</a>), and a code is required from this value set) (error message = Unknown code 'unrestricted' for in-memory expansion of ValueSet '<a href=\"http://terminology.hl7.org/ValueSet/v3-Confidentiality\">http://terminology.hl7.org/ValueSet/v3-Confidentiality</a>')</p>\n<ol start=\"3\">\n<li>Numerous errors where I used to capture the ISO country code and system. This one should be an easy fix so not a big deal. <br>\nUnknown code 'urn:iso:std:iso:3166#eu' for 'urn:iso:std:iso:3166#eu'<br>\nUnknown code 'urn:iso:std:iso:3166#eu' for 'urn:iso:std:iso:3166#eu'</li>\n</ol>",
        "id": 267045594,
        "sender_full_name": "Craig Anderson",
        "timestamp": 1641464897
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191321\">David Hay</span> <a href=\"#narrow/stream/215610-shorthand/topic/ClinFHIR/near/267014303\">said</a>:</p>\n<blockquote>\n<p>and that first graph certainly is complex! Interesting that the narrative is so large as well. Might be worth having a separate view to show narrative - I'll think on it...  The other thing I'll look at doing is to import from FSH. For simplicities sake, I'll assume a single FSH file that has all the resources instances in it. That way, the FSH download can act as a kind of backup in case of issues.</p>\n</blockquote>\n<p>Agreed. Based on our experience so far, these Electronic Product Information (ePI) documents (a.k.a medicinal product labels) involve about 90 resources. And that narrative text is just the short version! That is only the patient leaflet which is normally a few pages. The document for healthcare professionals can range anywhere from 40 pages for a simple product up to 200 pages for a complex biologic product.</p>\n<p>Import from FSH would be great. Yes, a single file sounds easiest.</p>\n<p>Also, I notice how in the Prepare to Save window, clicking on the resource name brings you to the edit resource window. Could that feature be added to the Resource References tab view? Since the resource list is so long, to edit the ones at the bottom you have to scroll down, select it, then scroll up to the top to click on the Resource Content tab to edit the resource content.</p>",
        "id": 267046151,
        "sender_full_name": "Craig Anderson",
        "timestamp": 1641465340
    },
    {
        "content": "<p>So the 'prepare to save' has 2 main steps:</p>\n<ol>\n<li>Call the sushi API for all resources - this returns 'sushi level' validation which is (deliberately) not comprehensive. You cannot save to a server if any resources fail this step.</li>\n<li>Then calls the $validate operation on the data server. This tends to be more comprehensive - but errors / warnings here won't prevent an attempted save (hapi is quite forgiving of issues). Most of the errors you mention came from this step and - generally - can be disregarded (for our purposes anyway). eg whether a given code is in the ValueSet. Up to you to fix if that is important to you.</li>\n</ol>\n<p>wrt the edit resource comment - one thing that might work for you is to select that tab, then in the right hand pane select the resource content tab. As you select a resource in the left side, the FSH content is shown in the right. You can edit the text directly in the text box (it will save automatically) or click the edit icon at the top right to enter the editor. Will that work for you? There's also a refresh icon next to the edit icon that calls the sushi API.</p>\n<p>btw - given the amount of work you are putting into this, I'd recommend regularly downloading the FSH into a file. It would be a tragedy for there to be some browser based issue and you lose the lot! The import FSH that I'll implement would allow you to recover from this... Actually, another option might be to allow a save the FSH to a Binary or DocumentReference resource on the server with a subsequent import. </p>\n<p>bbtw - what's the performance like with these big graphs? I haven't really tried to optimize for performance thus far but you are pushing the boundaries! (a good thing :) )</p>",
        "id": 267091364,
        "sender_full_name": "David Hay",
        "timestamp": 1641491378
    },
    {
        "content": "<p>Actually - thinking of big graphs - they are stored in the browser cache, which has a limited size. Not sure what will happen if a graph gets over large..  (actually all the graphs a user has)...</p>",
        "id": 267101492,
        "sender_full_name": "David Hay",
        "timestamp": 1641496421
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> - the new GoFSH 1.4.3 now supports FHIR 5.0.0-snapshot1.</p>",
        "id": 267105422,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1641498527
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> , performance is great! To the point I haven’t even thought about it until you asked.</p>\n<p>When you first open the ski Lawrence sample, it takes a few seconds (maybe 4s) for the graph to appear but no big deal. all the resources appear in the References tab right away anyways so it’s not like anything slows me down.</p>\n<p>Validation and building bundles is pretty fast too.</p>",
        "id": 267133241,
        "sender_full_name": "Craig Anderson",
        "timestamp": 1641514295
    },
    {
        "content": "<p>Thanks for the tip on graph size and backups. Will use the download all FSH and the bundle to save offline just in case.</p>",
        "id": 267133411,
        "sender_full_name": "Craig Anderson",
        "timestamp": 1641514405
    },
    {
        "content": "<p>That's good! Almost finished the import from FSH option, so will ping you when that's done.</p>",
        "id": 267250981,
        "sender_full_name": "David Hay",
        "timestamp": 1641594362
    }
]