[
    {
        "content": "<p>Is it possible with FSH to set comments in instances that are shown afterwards in the published IG?</p>",
        "id": 264154258,
        "sender_full_name": "Michaela Ziegler",
        "timestamp": 1638970135
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"233842\">@Michaela Ziegler</span>.  That's an interesting idea, but one we have not considered yet.  I'm not sure how it would work, but we can add it to our backlog as something to look into.</p>",
        "id": 264167055,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1638975768
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> that would be great!</p>",
        "id": 264167313,
        "sender_full_name": "Michaela Ziegler",
        "timestamp": 1638975851
    },
    {
        "content": "<p>Hmmm... actually, it could be a little complicated for us.  We produce the instances as JSON, and JSON does not allow comments (as noted in the spec <a href=\"http://hl7.org/fhir/R4/json.html#2.6.2\">here</a>).  I was remembering a feature that allowed comments in a special <code>fhir_comments</code> property, but it looks like that feature hasn't been in the spec since DSTU2 -- so it seems it might not be valid in R4.  We can still look into it, but I'm not sure if there will be an easy way forward.  I guess we'll see.</p>",
        "id": 264168624,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1638976386
    },
    {
        "content": "<p>It's not a shorthand issue, but the lack of comments in JSON has been a pain for me. I can't comment out an element, I can't leave myself a to-do. I'm sure JSON has its reasons, but I have mine too. </p>\n<p>And while you're at it, get off my lawn!</p>",
        "id": 264191924,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1638985353
    },
    {
        "content": "<p>json element that is a comment</p>",
        "id": 264198087,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638987787
    },
    {
        "content": "<p>JSON5 supports comments.  It would be nice if we could allow JSON5 for at least those instances that are marked as examples in IGs.</p>",
        "id": 264201429,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1638989176
    },
    {
        "content": "<p>I would like my FSH files to be exposed, but the current discussions is to derive fresh and clean FSH from the StructureDefinitions. To me, this is good but not fully satisfying. <br>\nThat said. there is the -intro and -notes and description... that are all rich text markdown... so there are plenty of ways to communicate to the reader</p>",
        "id": 264202668,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638989742
    },
    {
        "content": "<p><code>fhir_comments</code> was removed very deliberately. I disagreed.</p>",
        "id": 264211654,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638993561
    },
    {
        "content": "<p>I could upgrade the IG publisher to accept Json5 in the input resources, and then use normal json everywhere else</p>",
        "id": 264212168,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638993744
    },
    {
        "content": "<p>I always thought <code>fhir_comments</code> was weird, so I'm not particularly sad to see it go.  I think JSON5 would be cool for sure, but just to be up front about this -- I'm not yet ready to commit my team on implementing this SUSHI-side.  So... if you implement it in the publisher, it might be a while before SUSHI actually generates JSON5 w/ comments.</p>",
        "id": 264213361,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1638994297
    },
    {
        "content": "<p>oh it was weird, sure. but people might find json5 useful in a non-sushi context. But I'm not going to do it right now</p>",
        "id": 264215455,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638995306
    }
]