[
    {
        "content": "<p>I have an FSH file as follows:</p>\n<div class=\"codehilite\"><pre><span></span>Extension: NzEthnicity\nId: nzEthnicity\nDescription: &quot;The ethnicity of the patient. One to six level 4 codes.&quot;\n//These files were generated by a script from a model at NzNHIPatient.ethnicity\n\n* extension 0..0\n* value[x] only CodeableConcept\n* valueCodeableConcept from http://standards.digital.health.nz/valueset/ethnic-group-level-4 (preferred)\n</pre></div>\n\n\n<p>But when the IG is built, the snapshot shows all data types for value[x]. What am I doing wrong?</p>\n<p>Interestingly,  other definitions like the one below seem to work OK:</p>\n<div class=\"codehilite\"><pre><span></span>Extension: Registration_status\nId: registration-status\nDescription: &quot;An indicator of the practicing status of the practitioner as supplied by their Responsible Authority or professional body.&quot;\n//These files were generated by a script from a model at HpiPractitioner.qualification.status\n\n* extension 0..0\n* value[x] only CodeableConcept\n* valueCodeableConcept from http://standards.digital.health.nz/fhir/ValueSet/registration-status (preferred)\n</pre></div>",
        "id": 190029635,
        "sender_full_name": "David Hay",
        "timestamp": 1583704779
    },
    {
        "content": "<p>I wasn't able to reproduce this using the FSH in the first snippet. The StructureDefinition generated by SUSHI had <code>value[x]</code> constrained to only <code>CodeableConcept</code>. When you say \"when the IG is built\" do you mean after using the IG Publisher on the output of SUSHI? Is it possible SUSHI may have produced the correct output and something went wrong in the IG building process? Or is it possible there were FSH errors not shown here that may have stopped SUSHI from building?</p>\n<p>It seems like that snippet of FSH is working fine, let me know if you can reproduce the issue with just that snippet, or we can try reproducing using your whole set of FSH files.</p>",
        "id": 190060194,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1583753777
    }
]