[
    {
        "content": "<p>I'm trying to add contained resources to an instance - where the contained resources are of different types, but getting the error:</p>\n<blockquote>\n<p>error Cannot fix Resource value on this element since this element does not have a single type</p>\n</blockquote>\n<p>Is this a sushi limitation?</p>\n<div class=\"codehilite\"><pre><span></span>* contained[0] = medicalHistoryEmpty\n* contained[1] = adverseReactionEmpty\n* contained[2] = immunizationEmpty\n* contained[3] = medicineListEmpty\n</pre></div>\n\n\n<p>The referenced instances are instances of profiled List resources</p>",
        "id": 194757692,
        "sender_full_name": "David Hay",
        "timestamp": 1587439653
    },
    {
        "content": "<p>Hmmmm.  I <em>thought</em> we had tested this situation, but maybe you found an edge case?  Are you using SUSHI 0.12.2 (released on Friday)?  That's the release that I<em>thought</em> addressed this...</p>",
        "id": 194761859,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1587446598
    },
    {
        "content": "<p>Yep - 0.12.2 ...</p>",
        "id": 194762203,
        "sender_full_name": "David Hay",
        "timestamp": 1587447114
    },
    {
        "content": "<p>What does the <code>contained</code> element look like on the StructureDefinition that you are making an instance of? It looks like SUSHI is taking issue with the types on <code>contained</code>. Does <code>contained</code> have more than a single type? Or is that error incorrect altogether?</p>",
        "id": 194790774,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1587469808
    },
    {
        "content": "<p>So what I'm guessing is happening here is that the <code>contained</code> element on the Profile you are making an instance of is constrained to be a choice of several types of Resources. In other situations, SUSHI does not allow you to set an element that is a choice equal to a single value. As in you can't set <code>value[x]</code> equal to some specific string, you must instead set <code>valueString</code>.  That logic was being applied to this situation as well. We would not let you set a specific value, since <code>contained</code> is a choice of types. But I now see resources cannot be treated the same as other data types, so we should allow you to set resources inline into that <code>contained</code> array, as long as their <code>resourceType</code> matches one of the types of the <code>contained</code> array. I've made an issue to track this here: <a href=\"https://github.com/FHIR/sushi/issues/377\" title=\"https://github.com/FHIR/sushi/issues/377\">https://github.com/FHIR/sushi/issues/377</a>.</p>",
        "id": 194808997,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1587479044
    },
    {
        "content": "<p>This is all assuming that the Profile you are making an instance of does have some choice of several types on its <code>contained</code> array. If that is not the case, then all of the above is just a bonus that you've helped us discover!</p>",
        "id": 194809392,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1587479246
    },
    {
        "content": "<p>So this is the ancestor profile I'm constraining from : <a href=\"http://hl7.org.au/fhir/aubase1/StructureDefinition-au-composition.json.html\" title=\"http://hl7.org.au/fhir/aubase1/StructureDefinition-au-composition.json.html\">http://hl7.org.au/fhir/aubase1/StructureDefinition-au-composition.json.html</a><br>\nIt has some constraints on contained - but not restricting to one type I believe. The actual profile doesn't constrain contained any further.<br>\nI can add one instance to contained (an instance of a profiled List) but cannot add an instance of another List profile...</p>",
        "id": 194846348,
        "sender_full_name": "David Hay",
        "timestamp": 1587495140
    },
    {
        "content": "<p>So sorry, glad to have helped with the bonus, but I don't think it's the issue here!</p>",
        "id": 194846490,
        "sender_full_name": "David Hay",
        "timestamp": 1587495233
    },
    {
        "content": "<p>OK... so you're attempting to apply different profiles of the same resource (List).  Maybe that's the difference here...  I'm not sure if we've tested that -- although I would not have expected it to be a problem!  We can take a look.  Thanks for your patience!</p>",
        "id": 194858148,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1587501427
    },
    {
        "content": "<p>no worries! Thanks (as always) for your work on this...</p>",
        "id": 194874140,
        "sender_full_name": "David Hay",
        "timestamp": 1587511807
    },
    {
        "content": "<p>After some further investigation, this just looks like a bug with how we are handling arrays of contained resources. It doesn't seem like there is anything specific to the profiles that is causing this. I've started work on a fix. Thanks for the find! (And the bonus)</p>",
        "id": 194925579,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1587560294
    },
    {
        "content": "<p>you're welcome!</p>",
        "id": 194968128,
        "sender_full_name": "David Hay",
        "timestamp": 1587578020
    }
]