[
    {
        "content": "<p>Currently, SUSHI does not copy over the entire contents of the <code>ig-data</code> folder to the build folder. We stick to only those folders documented here <a href=\"https://build.fhir.org/ig/FHIR/ig-guidance/using-templates.html\">https://build.fhir.org/ig/FHIR/ig-guidance/using-templates.html</a>.</p>\n<p>We are considering changing SUSHI so that everything that is in the <code>ig-data</code> folder will be copied to SUSHI's output folder. So any file/folder in <code>ig-data</code> would be copied, even if it is not one of the inputs to the IG Publisher documented by the link above. We figured this would give people more flexibility to do what they please, and remove a limitation that we are imposing. However, some IGs, such as the <a href=\"https://github.com/HL7/fhir-saner\">saner ig</a> from <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> look like they have a fair deal of extra stuff happening within the <code>ig-data</code> folder, extra stuff that maybe should not be copied to the output folder, and we don't want to suddenly cause problems for people who have been taking advantage of the fact that SUSHI ignores certain files. </p>\n<p>So we are interested in hearing what our users think, and specifically <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> let us know how this would impact you. Should we copy over everything from the <code>ig-data</code> folder, or should we be more conservative and stick to the current approach of only copying over the folders which are documented inputs to the IG Publisher.</p>",
        "id": 203432342,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1594324696
    },
    {
        "content": "<p>I would start by saying that the structure in sushi is different from the IG publisher and templates, so IMO we will have issues as long as that remains.</p>",
        "id": 203442917,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594329977
    },
    {
        "content": "<p>with that out of the way: the list of folders is a bit out of date.. not serious but we need to fix that</p>",
        "id": 203443140,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594330104
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> we believed that the structure of the <code>ig-data</code> folder mimics the structure of the inputs to authoring an IG with templates listed here <a href=\"https://build.fhir.org/ig/FHIR/ig-guidance/using-templates.html\">https://build.fhir.org/ig/FHIR/ig-guidance/using-templates.html</a>. Are you saying our list of folders is out of date with respect to the list there? Or is there some other list we should be looking at?</p>",
        "id": 203496719,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1594381497
    },
    {
        "content": "<p>We need to update that list</p>",
        "id": 203500609,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594384255
    },
    {
        "content": "<p>There were 2 points to my message: the latter is about the folder list - which we will update. It's a simple thing</p>",
        "id": 203500745,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594384334
    },
    {
        "content": "<p>The former is that (and this is my feeling, I cannot pinpoint the problem because I don't have a solution) there is something strange about the way we have the input folders (ig-data) and the output folders (build)</p>",
        "id": 203501025,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594384515
    },
    {
        "content": "<p>I'm not complaining about that, because I only have one issue and a workaround should be available in a few weeks. But it makes me think that there may be a better structure</p>",
        "id": 203501138,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594384574
    },
    {
        "content": "<p>I have abandoned the ig-data folder completely, and my life is so much better. I simply have a fsh folder with just my fsh; all the rest I manage in the normal IG builder input. I manage my hand made conformance resources in resources, sushi puts its  creations into profiles, vocabulary, and examples (which I have marked as not included in git)</p>",
        "id": 203501413,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594384801
    },
    {
        "content": "<p>Figuring out the best structure for SUSHI's input is an interesting discussion, but at least in the short term, we aren't planning on any major shifts in the input structure. We know it does more harm than good for some users, but other users are avid users of <code>ig-data</code>, so we try to be flexible in supporting use cases with and without <code>ig-data</code>. So assuming that <code>ig-data</code> is not immediately changing, for those who do use <code>ig-data</code>, we are interested in hearing if SUSHI copying over every file in <code>ig-data</code> would cause you issues, give you benefit, or basically have no impact on how you currently use SUSHI?</p>",
        "id": 203503008,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1594385915
    },
    {
        "content": "<p>im not against ig-data. Just do like the clean separation of not using ig-data</p>",
        "id": 203503626,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594386267
    },
    {
        "content": "<p>As long as when it copies, it ensures that old data is removed, I'm happy to keep everything in ig-data.  But it's not going to change my life one way or another if it copies it or not. I just need to know where to put what</p>",
        "id": 203503648,
        "sender_full_name": "David Pyke",
        "timestamp": 1594386284
    },
    {
        "content": "<p>OTOH, the sooner you consolidate that, the lesser the impact, right? some decisions are worth postponing, some are not.</p>",
        "id": 203524016,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594396411
    },
    {
        "content": "<p>If you copy everything, and it causes problems in the SANER Build, I'll simply move the files that I had in ig-data somewhere else.  It's only going to cause a minor problem for me.  If you just copy folders in input folder, and not files at the root of it, I'd not have any concerns at all.  The only \"non-standard\" folder we create is \"features\", and those are Gerhkin sources produced by our build which we'd treat as source content for test-cases eventually.</p>",
        "id": 203959029,
        "sender_full_name": "Keith Boone",
        "timestamp": 1594821778
    },
    {
        "content": "<p>Thanks for the feedback <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span>, for now we have decided to continue with our current approach of only copying over folders that are documented in the template documentation. No one seems to be clamoring for us to copy over more things, so no reason to cause any minor inconvenience if there is not some obvious benefits.</p>",
        "id": 203965663,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1594824886
    }
]