[
    {
        "content": "<p>I am using FSHonly -- some of my examples end up in the IG with the description I put into the FSH definition, but some do not. I can not figure out why some do and some do not.</p>",
        "id": 238986717,
        "sender_full_name": "John Moehrke",
        "timestamp": 1621179041
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> -- I'm not sure why that would happen either.  When you say \"end up in the IG\" -- do you mean the IG pages (looking at them in a browser) or do you mean the IG JSON file?  Is there somewhere that we can reproduce this?</p>",
        "id": 239081621,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1621255570
    },
    {
        "content": "<p>sorry, that was poor... The profiles are in the IG, and they do have a place on the table of contents and the artifacts page.. but the artifacts page is lacking the description on -some- of them</p>",
        "id": 239083202,
        "sender_full_name": "John Moehrke",
        "timestamp": 1621256219
    },
    {
        "content": "<p>I would actually expect none of them to make it... because I am using FSH only... but some of them make it, so I wonder why they all don't make it.</p>",
        "id": 239083270,
        "sender_full_name": "John Moehrke",
        "timestamp": 1621256245
    },
    {
        "content": "<p>Oh, right.  You said <em>FSH-Only</em>.  I missed that.  Is it examples or profiles?  You originally said \"examples\", but your last note talks about \"profiles\".  I also would <em>not</em> expect examples to have their descriptions appear.  For profiles, however, since there is a \"description\" field in <code>StructureDefinition</code>, I wouldn't be surprised if the IG publisher pulled the description from that.</p>",
        "id": 239084360,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1621256640
    },
    {
        "content": "<p>examples</p>",
        "id": 239084510,
        "sender_full_name": "John Moehrke",
        "timestamp": 1621256686
    },
    {
        "content": "<p>okay, then I need to manually add the examples to the IG xml... yuck. I like FSH only, but I do have too admit this specific hitch is not fun</p>",
        "id": 239084679,
        "sender_full_name": "John Moehrke",
        "timestamp": 1621256761
    },
    {
        "content": "<p>I started doing this, but I have so many examples, and more examples every day... I guess I would wish for the FSH only to help me out here, but can't think of a good clean solution.</p>",
        "id": 239084956,
        "sender_full_name": "John Moehrke",
        "timestamp": 1621256880
    },
    {
        "content": "<p>any clue how IG build finds some of these descriptions?</p>",
        "id": 239088210,
        "sender_full_name": "John Moehrke",
        "timestamp": 1621258040
    },
    {
        "content": "<p>I don't know how IG build is currently finding any of them even though you don't have them in the IG JSON.  The only thing I can think of is if the example resource happens to have a top-level \"description\" field, then <em>maybe</em> the IG Publisher would pick that up?</p>",
        "id": 239088761,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1621258233
    },
    {
        "content": "<p>I think I remember some discussion a while back about trying to come up w/ some ancillary way to organize example descriptions (outside of IG JSON).  I think there were thoughts of a separate purpose-specific file as well as some ideas about special extensions that would be in the source (and could carry the title and description) but would be stripped from the example in the IG.  But (obviously) that hasn't really gone anywhere.</p>",
        "id": 239089185,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1621258383
    },
    {
        "content": "<p>yes.</p>",
        "id": 239089336,
        "sender_full_name": "John Moehrke",
        "timestamp": 1621258429
    }
]