[
    {
        "content": "<p>Some of the example resources I'm building also include examples of extensions or other profiles (of data types).  Is there a way to easily mark those as examples for the extensions / profiles, or to extract them as examples.  Some of my examples are so buried in slices that it's somewhat challenging from my perspective to figure out how to turn them into a simple example.</p>",
        "id": 195299633,
        "sender_full_name": "Keith Boone",
        "timestamp": 1587843764
    },
    {
        "content": "<p>If I understand your question correctly, I think you want to create <code>Instance</code>s where the <code>InstanceOf</code> is an extension or a profile of a datatype (<em>not</em> a resource).  And then to be able to include those instances inline in other examples.  This is <em>almost</em> possible now that we support the <code>#inline</code> usage -- but I think that SUSHI currently only supports <code>Instance</code>s where the <code>InstanceOf</code> is a resource or profile of a resource.  If you tried to do <code>InstanceOf</code> and extension or datatype, it might partially work -- but it will likely slap a <code>resourceType</code> field on it and maybe a <code>meta.profile</code> field as well.  So... this is something we'll need to address.</p>",
        "id": 195314288,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1587870373
    },
    {
        "content": "<p>No, it's more like, if I create an example resource, AND it uses an extension or datatype profile declared elsewhere in my IG, Sushi would be smart enough to identify this particular situation, and with little or NO extra work on my part, make what I've already given as an example elsewhere for a whole resource as an Example for the extension or profile.  More than two lines of SUSHI text is more work than I want to provide (he whines).</p>",
        "id": 195316070,
        "sender_full_name": "Keith Boone",
        "timestamp": 1587873870
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> </p>\n<blockquote>\n<p>but I think that SUSHI currently only supports Instances where the InstanceOf is a resource or profile of a resource.</p>\n</blockquote>\n<p>Does this mean that something like this is not currently supported since Identifier is not a Resource?</p>\n<div class=\"codehilite\"><pre><span></span><code>Instance: SpecificIdentifierInstance\nInstanceOf: Identifier\nTitle: &quot;Example Identifier&quot;\nUsage: #example\n* value = &quot;ID12345&quot;\n* extension.valueBoolean = true\n* extension.url = &quot;http://a-url-to-use&quot;\n\n\nInstance: ExamplePatientInstance\nInstanceOf: Patient\nTitle: &quot;Example Patient&quot;\n* identifier = SpecificIdentifierInstance\n</code></pre></div>",
        "id": 195614471,
        "sender_full_name": "Matt Sargent",
        "timestamp": 1588102362
    },
    {
        "content": "<p>You're correct, that is currently not supported. If you try that on the latest release of SUSHI (0.12.3), you should see an error along the lines of:</p>\n<div class=\"codehilite\"><pre><span></span><code>Instance SpecificIdentifierInstance of type Identifier is not an Instance of a Resource or Profile of a Resource. Only Instances of Resources or Profiles of Resources may be assigned to other Instances.\n</code></pre></div>\n\n\n<p>to indicate that it isn't allowed. This is something we are planning on adding support for, and you are now one of  a few users who have bumped into this, so we will give higher priority to supporting this.</p>",
        "id": 195618423,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1588104081
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"239822\">@Nick Freiter</span>. Wish we would have been on 0.12.3 since that error is much more helpful than the one we were seeing in 0.11.1. Thank you for your help!</p>",
        "id": 195621868,
        "sender_full_name": "Matt Sargent",
        "timestamp": 1588105469
    }
]