[
    {
        "content": "<p>I have my example instances not in input\\examples but in in sub-folders e.g. input\\examples\\patient, ...<br>\n(my content is not organized by base resource name, but by profile name - so if I have a Practitioner profile for physicians and another for nurses, i would have input\\examples\\physicians, input\\examples\\nurses)</p>",
        "id": 196162669,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588587272
    },
    {
        "content": "<p>while this helps me, others may have a different approach - the problem is that after i move the examples, sushi will them again in the examples folder.</p>",
        "id": 196162974,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588587466
    },
    {
        "content": "<p>any way to handle this (besides moving my files out of the fsh folder of I don't want them generated again?)</p>",
        "id": 196163123,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588587576
    },
    {
        "content": "<p>So was your approach to first generate the example Instances into the input/examples folder using SUSHI, and then manually sort that folder into input/examples/patient, input/examples/nurses, and so on. But then if you re-run SUSHI, the example Instances are all added again to the top level of the input/examples folder? </p>\n<p>If I'm understanding the problem correctly, then unfortunately no there isn't really a better way to handle this. There is no way in SUSHI to specify where an example Instance should go, they are just output to the input/examples folder. If it's something enough people are feeling the need for, we can look into adding it/how it would work.</p>",
        "id": 196171420,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1588594083
    },
    {
        "content": "<p>I actually started without sushi, then added sushi for example generation. So I already had some examples there, and I use sushi to add many more.</p>",
        "id": 196175352,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588596499
    },
    {
        "content": "<p>so it's kind of what you said, but the first step was not sushi</p>",
        "id": 196175396,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588596530
    },
    {
        "content": "<blockquote>\n<p>So was your approach to first generate the example Instances into the input/examples folder using SUSHI, and then manually sort that folder into input/examples/patient, input/examples/nurses, and so on. But then if you re-run SUSHI, the example Instances are all added again to the top level of the input/examples folder? </p>\n</blockquote>\n<p>yes, I did that but the first step was done manually. And i wanted to see if I had some control over which files are created</p>",
        "id": 196175444,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588596586
    },
    {
        "content": "<p>Gotcha, I think my answer from above still applies though. There isn't really a way to control which folders files are generated into. If you want to prevent instances from being generated, the easiest way may be to just comment them out or remove the fsh files until you want to generate them again.</p>",
        "id": 196177743,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1588597935
    },
    {
        "content": "<p>Edit: wrong post</p>",
        "id": 196186410,
        "sender_full_name": "Etienne Cantineau",
        "timestamp": 1588602051
    },
    {
        "content": "<p>that actually gave me an idea: <br>\nwould it be an interesting feature for sushi to have a .ignore file? ( a .include could also work but a .ignore is better for the 80% of people who will not use it)</p>",
        "id": 196187371,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1588602445
    }
]