[
    {
        "content": "<p>I'm using an inline extension and sushi has no problem with it but the publisher doesn't like the fact that the extension url is just the name of the extension.  I can't override it because it's marked as fixed.  What's a poor fisherman to do?</p>",
        "id": 208721405,
        "sender_full_name": "David Pyke",
        "timestamp": 1598981788
    },
    {
        "content": "<p>Anyone?  Beuller?</p>",
        "id": 208815664,
        "sender_full_name": "David Pyke",
        "timestamp": 1599049697
    },
    {
        "content": "<p>Sorry... so... inline extensions can definitely be just a name when they are used within a complex extension.  I assume you are trying to do an inline extension in a profile?  If so, I guess it is possible that this is not supported by FHIR -- but we can try to dig in to see... (and by \"dig in\", I mean ask someone smarter than me ;-).</p>",
        "id": 208817784,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1599050870
    },
    {
        "content": "<p>Okay, then I'll just make it an external extension and save trouble</p>",
        "id": 208818562,
        "sender_full_name": "David Pyke",
        "timestamp": 1599051281
    },
    {
        "content": "<p>Thinking on it more, I guess it makes sense that it might only be supported within extensions themselves.  Here's my thinking:</p>\n<ul>\n<li>When you use an inline extension in a complex extension, then <code>\"url\": \"foo\"</code> is considered relative to the canonical URL of the extension.</li>\n<li>Any time you actually use the complex extension it is a part of, the extension's URL will always be explicitly identified (because that's just how you specify extensions in an instance).</li>\n<li>So... in any instance of a FHIR resource, that inline extension with a relative URL will <em>always</em> be accompanied by the parent URL it is relative to. There is no chance for ambiguity.</li>\n</ul>\n<p>Compare that to attempting to use an inline extension as an extension on a profile.</p>\n<ul>\n<li>The inline extension's url (e.g., \"foo\") <em>could</em> be considered as relative to the profile's canonical URL.</li>\n<li>But... an instance of a FHIR resource does not have to declare what profiles it conforms to.</li>\n<li>So... in some instances of FHIR resources,  the profile URL will not be specified anywhere in the instance, so an inline extension with URL \"foo\" would not have that reference point that it is relative to.  Therefore, the actual definition of the extension is ambiguous to consumers.</li>\n</ul>",
        "id": 208820382,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1599052134
    },
    {
        "content": "<p>That makes good sense.</p>",
        "id": 208820454,
        "sender_full_name": "David Pyke",
        "timestamp": 1599052176
    },
    {
        "content": "<p>It's probably something worth noting in the documentation of FHIR Shorthand.  It might be too late for the 1.0.0 documentation, but if so, we can be sure to include it in the next version.  <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> -- take note.</p>",
        "id": 208820632,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1599052249
    },
    {
        "content": "<p>It should also generate an error so you don't have to wait for the publisher to complain</p>",
        "id": 208820683,
        "sender_full_name": "David Pyke",
        "timestamp": 1599052274
    },
    {
        "content": "<p>Ah.  Good point!  I'll file an issue on SUSHI to implement that check.</p>",
        "id": 208820793,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1599052322
    },
    {
        "content": "<p><a href=\"https://github.com/FHIR/sushi/issues/591\">https://github.com/FHIR/sushi/issues/591</a></p>",
        "id": 208821518,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1599052607
    }
]