[
    {
        "content": "<p>I'm creating a profile on PlanDefinition that has nested action elements, and want to add an extension to the action. If I add the extension to the element thusly:</p>\n<div class=\"codehilite\"><pre><span></span><code>* action.extension contains\n    $TOD named timing-of-days 0..*\n</code></pre></div>\n\n\n<p>It only works at that 'level'. To specify it at a different level, it needs to be explicitly added like so:</p>\n<div class=\"codehilite\"><pre><span></span><code>* action.action.action.extension contains\n    $TOD named timing-of-days 0..*\n</code></pre></div>",
        "id": 204839482,
        "sender_full_name": "David Hay",
        "timestamp": 1595530711
    },
    {
        "content": "<p><code>PlanDefinition.action.action</code> is a <a href=\"http://hl7.org/fhir/R4/elementdefinition-definitions.html#ElementDefinition.contentReference\">contentReference</a> to <code>PlanDefinition.action</code>.  A <em>contentReference</em> is kind of like a symbolic link to the original definition of what it points to.  Since <em>contentReference</em>s do not inherit constraints,  I don't think we can expect an extension at the top-level to be automatically inherited by the nested definition.  From the <em>contentReference</em> documentation:</p>\n<blockquote>\n<p>ContentReferences... always reference the non-constrained definition.</p>\n</blockquote>",
        "id": 204909710,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1595594169
    },
    {
        "content": "<p>But the definition of contentReference says \"ContentReferences bring across all the rules that are in the ElementDefinition for the element, including definitions, cardinality constraints, bindings, invariants etc.\"  If it's bringing that all across, why not extensions?</p>",
        "id": 204910269,
        "sender_full_name": "David Pyke",
        "timestamp": 1595594614
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> -- based on the additional comment that they \"reference the non-constrained definition\", I think the description you cite refers to the elements within the <em>original</em> definition (e.g., as defined by the core FHIR <em>resource</em> or <em>datatype</em>).  I feel like I've brought this ambiguity up before though.  Let me see if I can find on old thread that talks about this.</p>",
        "id": 204910474,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1595594771
    },
    {
        "content": "<p>OK.  Found the old conversation and it did not end as conclusively as I thought.  See: <a href=\"#narrow/stream/179252-IG-creation/topic/Clarification.20on.20contentReference\">https://chat.fhir.org/#narrow/stream/179252-IG-creation/topic/Clarification.20on.20contentReference</a></p>\n<p>I'll poke on that thread and see if Grahame was able to flesh that out in an example or not.</p>",
        "id": 204910864,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1595595028
    },
    {
        "content": "<p>Oh, interesting! It's certainly not a blocker in my Use Case as I'm being specific about the levels in use but can see other scenarios where that may be be so simple. I'll follow the conversation with interest...</p>",
        "id": 204953950,
        "sender_full_name": "David Hay",
        "timestamp": 1595617227
    }
]