[
    {
        "content": "<p>Morning all, I'm running into an issue and was wondering if I have something wrong or if this isn't supported in sushi (yet).</p>\n<p>For context, I'm profiling the subscriptions backport, which includes extensions on <code>Bundle.meta</code>, which is inherited from <code>Resource</code> and not explicitly listed in the <code>Bundle</code> resource.  So my rules like:</p>\n<div class=\"codehilite\"><pre><span></span><code>* meta.extension contains BackportSubscriptionEventCount named subscriptionEventCount 1..1\n</code></pre></div>\n\n\n<p>Returns an error:</p>\n<div class=\"codehilite\"><pre><span></span><code>error No element found at path meta.extension for BackportSubscriptionNotification, skipping rule\n</code></pre></div>\n\n\n<p>Any help/advice would be appreciated, thanks!</p>",
        "id": 198459319,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1590163420
    },
    {
        "content": "<p>This doesn't look like something that isn't supported, so I'm not sure what is going on here. As an example, the following seems to work well for me:</p>\n<div class=\"codehilite\"><pre><span></span><code>Profile: MyBundle\nParent: Bundle\n* meta.extension contains myslice 0..1\n</code></pre></div>",
        "id": 198469230,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1590168004
    },
    {
        "content": "<p>So I suspect there is something more going on here. Could you share more of the FSH definition so we can try to recreate this?</p>",
        "id": 198469329,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1590168066
    },
    {
        "content": "<p>Thanks for the help Nick.  I setup a sushi dev environment so I could step through and see what was happening.... and found it was an error on the previous line causing the issue:</p>\n<div class=\"codehilite\"><pre><span></span><code>* ^type = &quot;history&quot;\n</code></pre></div>\n\n\n<p>Thanks again!<br>\nEdit: not sure where I grabbed the caret from, but removing it fixed the issue.</p>",
        "id": 198484246,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1590175546
    },
    {
        "content": "<p>Oh interesting. The caret syntax is used to set metadata on the Structure Definition itself. It would usually be used for setting something like the publisher, description, contact, or status. In this case you set <code>StructureDefinition.type</code>, to <code>history</code>, but you are making a profile of Bundle, so <code>StructureDefinition.type</code> should really be <code>Bundle</code>. In several places in SUSHI we depend on the fact that if you are making a Profile of Bundle, the type will be Bundle. It seems like we should probably disallow setting <code>StructureDefinition.type</code> on a Profile altogether, since I'm not sure any good can come of it...Anyway, thanks for the find!</p>",
        "id": 198764105,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1590501017
    }
]