[
    {
        "content": "<p>I have a profile of QuestionnaireResponse that I can't get to recognize the canonical of the associated Questionnaire:</p>\n<div class=\"codehilite\"><pre><span></span><code>Instance: WhoCrQuestionnaireCovid19Surveillance\nInstanceOf: Questionnaire\nDescription: &quot;TODO&quot;\nTitle: &quot;Revised case report form for Confirmed Novel Coronavirus COVID-19&quot;\nUsage: #definition\n\n* insert PublisherContextInstance\n* name = &quot;WhoCrQuestionnaireCovid19Surveillance&quot;\n* version = &quot;2020.2&quot;\n* subjectType = #Patient\n* url = &quot;http://openhie.github.io/covid-19/Questionnaire/WhoCrQuestionnaireCovid19Surveillance&quot;\n\n\nProfile:    WhoCrQuestionnaireResponseCovid19Surveillance\nParent:     QuestionnaireResponse\nDescription: &quot;Who Case Reporting QuestionnaireResponse&quot;\nTitle:      &quot;Who Case Reporting QuestionnaireResponse&quot;\n\n* questionnaire = Canonical(WhoCrQuestionnaireCovid19Surveillance)\n* status from WhoCrValueSetQuestionnaireResponseAcceptedStatus\n* subject only Reference(WhoCrPatient)\n</code></pre></div>\n<p>I get the error:</p>\n<div class=\"codehilite\"><pre><span></span><code>error Cannot use canonical URL of WhoCrQuestionnaireCovid19Surveillance because it does not exist. Be sure that WhoCrQuestionnaireCovid19Surveillance exists and it has a URL.\n  File: /Users/elliot/src/covid-ig/input/fsh/who-cr-Provenance.fsh\n  Line: 45\n</code></pre></div>\n<p>It all works fine if I change the third-last line to be:</p>\n<div class=\"codehilite\"><pre><span></span><code>* questionnaire = &quot;http://openhie.github.io/covid-19/Questionnaire/WhoCrQuestionnaireCovid19Surveillance&quot;\n</code></pre></div>\n<p>What am I missing?</p>",
        "id": 224628889,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1612077913
    },
    {
        "content": "<p>Hmm, the Questionnaire is an Instance. <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>, do the URLs of instances get added to the sushi canonical lookup  table, or is it only things that you have special keywords for (ValueSet, Profile, etc.)? Is it only things that have canonical URLs automatically generated that can be used with Canonical()?</p>",
        "id": 224630137,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1612079789
    },
    {
        "content": "<p>As an aside, I also noticed that I can't use the ValueSet: keyword to create a profiled ValueSet instance, e.g., an SDC ValueSet (<a href=\"http://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-valueset\">http://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-valueset</a>). I can create a ValueSet instance, and set its meta.profile value; but I can't create a ValueSet instance with a parent other than ValueSet, unless I want to create the entire instance from scratch using the Instance: keyword.</p>",
        "id": 224630739,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1612080300
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191380\">Elliot Silver</span> <a href=\"#narrow/stream/215610-shorthand/topic/Failed.20canonical.20lookup/near/224630137\">said</a>:</p>\n<blockquote>\n<p>Do the URLs of instances get added to the sushi canonical lookup  table, or is it only things that you have special keywords for (ValueSet, Profile, etc.)?</p>\n</blockquote>\n<p>I think your hunch is probably right; SUSHI probably only looks up items generated by the keywords.  But I think that can and probably should be improved.  Instances don't always have a canonical URL (e.g., and instance of a Patient), but SUSHI should support canonicals for the specific instances that do.  Thanks for using <code>Questionnaire</code> as an example, because I was thinking we only had to do this for <em>Conformance</em> and <em>Terminology</em> resources, but it looks like there are a few other outliers there too.</p>\n<p>I've file this as <a href=\"https://github.com/FHIR/sushi/issues/743\">SUSHI#743</a>.</p>",
        "id": 224726703,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1612186884
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191380\">Elliot Silver</span> <a href=\"#narrow/stream/215610-shorthand/topic/Failed.20canonical.20lookup/near/224630739\">said</a>:</p>\n<blockquote>\n<p>As an aside, I also noticed that I can't use the ValueSet: keyword to create a profiled ValueSet instance, e.g., an SDC ValueSet (<a href=\"http://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-valueset\">http://hl7.org/fhir/uv/sdc/StructureDefinition/sdc-valueset</a>). I can create a ValueSet instance, and set its meta.profile value; but I can't create a ValueSet instance with a parent other than ValueSet, unless I want to create the entire instance from scratch using the Instance: keyword.</p>\n</blockquote>\n<p>When you say \"can't create a ValueSet instance with a parent other than ValueSet\", do you really mean that you can't create a ValueSet that <em>conforms</em> to a specific profile of ValueSet?  Because there is no field in VS to declare a \"parent\" or \"base\" (or anything like that).  Assuming that's what you mean, then the closest thing you can do is what you've already done: set the <code>meta.profile</code> via a <code>^</code> rule.</p>\n<p>If SUSHI allowed you to specify a <code>ConformsTo:</code> field (or re-use <code>InstanceOf:</code> but in the context of <code>ValueSet:</code>), what else would you want SUSHI to do in that case (besides set the <code>meta.profile</code> for you)?  Are are you looking for a more flexible syntax to allow you access to the defined extensions in the profile?  Or are you hoping for additional validation?  Or something else?</p>",
        "id": 224728606,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1612187825
    },
    {
        "content": "<p>Yes,  can't create a ValueSet that conforms to a specific profile.  Adding ConformsTo: would be really nice, assuming you could apply it to anything -- VS, profiles, instances -- this would deal with some of the \"multiple inheritance\" issues I've run into. </p>\n<p>I was thinking about this for two reasons: to have the additional validation to know what I am creating is compliant, and avoid having to \"drop down\" to caret syntax. (It was actually prompted by the fact that I have some ValueSets declared as instances in order to be able to contain them, and other ValueSets declared as standalone, and noticing the difference in how I had to declare them.)</p>\n<p>I recall someone recently was trying to profile a StructureDefinition -- not say that a particular profiled resource met another profile, but to say that the profile StructureDefinition itself met a profile. I wonder if there is a way to solve that problem elegantly with this?</p>",
        "id": 224746506,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1612195079
    },
    {
        "content": "<p>TBH, validation is not a strong suit of SUSHI.  We validate simple things (like cardinality checks), but punt on validation of more complex things (especially terminology-based validation).  We punt on difficult validation because: (a) we don't want external dependencies like terminology servers, (b) we don't think the ROI justifies it when we know the next step in the tool chain (IG Publisher) will do full validation and find any issues that SUSHI did not validate.  The only advantage SUSHI validation gives is quicker feedback since it is more lightweight than the publisher (but perhaps that advantage would be lost as we supported more complex validation capabilities because SUSHI would become less and less lightweight).  So, all that to say, if we supported <code>ConformsTo:</code> then you might get cardinality validation, but that's about it.  Is it worth it?</p>\n<p>As for being able to avoid <code>^</code> rules, we're hoping to extend the value set and code system grammars some more for FSH STU2 to address at least some of the common needs for dropping into <code>^</code> rules in value sets and code systems.  So hopefully that will help.</p>\n<p>I think the idea of <code>ConformsTo:</code> to support building profiled instances of SDs, VSs, CSs, is interesting, but I think we'd want to understand how common a problem it is before embarking on it.  I suspect that right now, anyway, there are probably more commonly occurring issues and limitations we'd want to address first.</p>",
        "id": 224748709,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1612195685
    },
    {
        "content": "<p>Sushi validation is one thing, but putting the information in there so that the IG publisher can validate is another. I don't need the sushi validation if the IG can do it.</p>",
        "id": 224749219,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1612195898
    },
    {
        "content": "<p>But I'd also agree, this isn't a priority.</p>",
        "id": 224749329,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1612195935
    },
    {
        "content": "<blockquote>\n<p>Sushi validation is one thing, but putting the information in there so that the IG publisher can validate is another.</p>\n</blockquote>\n<p>Right.  I think you can accomplish this today via <code>^ meta.profile = \"http://canonical/for/profile/to/conform/to\"</code>, but if you find otherwise, let us know!</p>",
        "id": 224752853,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1612197295
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span></p>",
        "id": 225378015,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1612573682
    }
]