[
    {
        "content": "<p>Hi everyone! After a few months of near daily use of sushi (which we all love!) one thing that would be super great is emphasis on (1) exit codes and (2) making the output optionally machine parsable (both goes for IG Publisher as well). It's kinda tricky now as we are finding ourselves running the output through grep and pattern matching to in our CI/CD publishing pipelines.</p>",
        "id": 211192567,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1600983189
    },
    {
        "content": "<p>Can you provide some more detail or examples regarding what you're looking for?  We currently exit w/ <code>0</code> as long as there are no errors, and <code>1</code> if there are errors.  What other types of exit codes would you be looking for?  And what is it that you want to be machine-parsable?  Do you mean the logs?  If so, what level of detail are you looking to parse out?</p>",
        "id": 211192985,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1600983482
    },
    {
        "content": "<p>what output do you want to parse from the IG Publisher?</p>",
        "id": 211193042,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600983523
    },
    {
        "content": "<p>I think maybe just IG Publisher might not use error return codes. Also I think both tools might consider errors going to stderr (not stdout).</p>\n<p>As far as parsing output, it's mainly stats (like number of errors and number of warnings). We have some tooling where we set gates/thresholds to fail the build (for warnings).</p>",
        "id": 211193375,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1600983792
    },
    {
        "content": "<p>well., under all circumstances I am aware of, the IGPublisher will set an exit code != 0 if it fails</p>",
        "id": 211193506,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600983869
    },
    {
        "content": "<p>have you looked at qa.json and qa.xml?</p>",
        "id": 211193515,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600983880
    },
    {
        "content": "<p>no, I didn't think about that, as we are parsing the output in our CI/CD build process. One situation that comes to mind is grep for /^Translation failed/ for CQL translation.</p>",
        "id": 211193764,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1600984050
    },
    {
        "content": "<p>(<a href=\"https://github.com/HL7/fhir-ig-publisher/issues/128\">https://github.com/HL7/fhir-ig-publisher/issues/128</a>)</p>",
        "id": 211194205,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1600984340
    }
]