[
    {
        "content": "<p>Hello, i noticed there is an issue with case when sushi generates the files. I have an instance patient1, instead of creating/updating Patient-patient1.json in build folder, it was still updating the older mistaken name Patient-Patient1.json.</p>",
        "id": 196590084,
        "sender_full_name": "Etienne Cantineau",
        "timestamp": 1588744480
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"243697\">@Etienne Cantineau</span> -- this may not be in SUSHI's control.  I'm assuming you're on Windows or Mac, which by default uses case insensitive file systems...  If so, <code>Patient-Patient1.json</code> and <code>Patient-patient1.json</code> actually refer to the same file on disk, and copying one (from a different folder) to the other will change the contents of the file but <em>will not</em> change the name of the file.  Here's a little test I did on my mac to demonstrate:</p>\n<div class=\"codehilite\"><pre><span></span><code>$ mkdir a\n$ echo &quot;I am a lowercase file&quot; &gt; a/test.txt\n$ mkdir b\n$ echo &quot;I am an uppercase file&quot; &gt; b/TEST.txt\n$ cat a/test.txt\nI am a lowercase file\n$ cp b/TEST.txt a/\n$ ls a\ntest.txt\n$ cat a/test.txt\nI am an uppercase file\n$\n</code></pre></div>\n\n\n<p>For the longest time I thought Mac used a case-sensitive file system... until I ran into an issue like this!</p>\n<p>So... might that be what's going on?  Or are you experiencing this on a truly case-sensitive file system?</p>",
        "id": 196634038,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588771684
    },
    {
        "content": "<p>Alright Chris! Yes i'm on Windows, it was a trivia issue in case Sushi wasn't doing well the creation. Good to know it's only that.</p>",
        "id": 196639439,
        "sender_full_name": "Etienne Cantineau",
        "timestamp": 1588774009
    },
    {
        "content": "<p>I think if you delete the file in build, then when it recreates it, it will have the right case.</p>",
        "id": 196639607,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588774088
    },
    {
        "content": "<p>I can confirm this is an OS issue, not a Sushi issue, and that Chris's solution will work.  I've had the same problem myself in other situations (e.g., trying to rename a file to use different case in Eclipse or from command line or via APIs on Windoze).</p>",
        "id": 196648985,
        "sender_full_name": "Keith Boone",
        "timestamp": 1588777971
    },
    {
        "content": "<p>Indeed, that's what i finally did!</p>",
        "id": 196657874,
        "sender_full_name": "Etienne Cantineau",
        "timestamp": 1588781465
    },
    {
        "content": "<p>note the ci-build happens on a case sensitive machine, so the publishers try to be as case sensitive as they can</p>",
        "id": 196688527,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588795059
    },
    {
        "content": "<p>Agreed, case sensitivity does matter.  People on case insensitive file systems just need to be aware that wacky things can happen if you make name-changes that only change the casing; and you may need to manually intervene to make the file system do what you want!</p>",
        "id": 196690477,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588795929
    }
]