[
    {
        "content": "<p>Where does SUSHI resolve its packages from? <br>\nI tried to add a package that was published on SImplifier at <a href=\"https://simplifier.net/packages\" target=\"_blank\" title=\"https://simplifier.net/packages\">https://simplifier.net/packages</a> and it could not locate it.</p>",
        "id": 188683154,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1582236100
    },
    {
        "content": "<p>It loads <code>dev</code> versions from your local cache, <code>current</code> versions from <a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">http://build.fhir.org</a>, and all other versions from <a href=\"http://packages.fhir.org\" target=\"_blank\" title=\"http://packages.fhir.org\">http://packages.fhir.org</a>.  We could probably update it to fall back to <a href=\"http://simplifier.net\" target=\"_blank\" title=\"http://simplifier.net\">simplifier.net</a> if it can't find it in <a href=\"http://packages.fhir.org\" target=\"_blank\" title=\"http://packages.fhir.org\">packages.fhir.org</a> (but we haven't implemented that currently).</p>",
        "id": 188686681,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582238312
    },
    {
        "content": "<p><a href=\"http://packages.fhir.org\" target=\"_blank\" title=\"http://packages.fhir.org\">packages.fhir.org</a> is just an alias for simplifier. You'll have to ask firely why a package isn't available</p>",
        "id": 188687110,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582238705
    },
    {
        "content": "<p>Ah, OK.  I was thinking it was a separate instance of simplifier.  I didn't realize (or forgot) it was an alias.</p>",
        "id": 188696921,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582249029
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> -- if you can tell us how you're referencing the package in package.json, we can look at it from our end.</p>",
        "id": 188696981,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582249086
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>  I was attempting to add this package <a href=\"https://simplifier.net/packages/uk.core.r4/1.0.0\" target=\"_blank\" title=\"https://simplifier.net/packages/uk.core.r4/1.0.0\">https://simplifier.net/packages/uk.core.r4/1.0.0</a></p>\n<p>I amended package.json to</p>\n<div class=\"codehilite\"><pre><span></span> &quot;dependencies&quot;: {\n    &quot;hl7.fhir.r4.core&quot;: &quot;4.0.1&quot;,\n    &quot;hl7.fhir.us.core&quot;: &quot;3.1.0&quot;,\n    &quot;UK.Core.r4&quot;: &quot;1.0.0&quot;\n },\n</pre></div>\n\n\n<p>When I executed SUSHI the log showed</p>\n<p>Found UK.Core.r4#1.0.0 in local cache.<br>\nerror Failed to add UK.Core.r4:1.0.0 to ImplementationGuide instance.  Could not determine its canonical URL from the FHIR cache.</p>",
        "id": 188712971,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1582274713
    },
    {
        "content": "<p>SUSHI expects that the ImplementationGuide resource  for this package in <code>hl7fhirukcoreimplementationguider4-january2020.json</code> does not declare a <code>packageId</code>. SUSHI expects that the package <code>UK.Core.r4#1.0.0</code> will have <code>packageId</code> set to <code>UK.Core.r4</code>, and <code>version</code> set to <code>1.0.0</code> in the ImplementationGuide resource. A workaround would be to set these values locally:<br>\n1) Navigate to your local FHIR cache located at <code>~/.fhir/packages</code><br>\n2) Find the <code>UK.Core.r4#1.0.0</code> folder,  and navigate to <code>~/.fhir/packages/UK.Core.r4#1.0.0/package</code><br>\n3) Open the  <code>hl7fhirukcoreimplementationguider4-january2020.json</code> file in this folder<br>\n4) Change the <code>version</code> field from <code>January 2020</code> to <code>1.0.0</code><br>\n5)  Add a <code>packageId</code> field that is set to <code>UK.Core.r4</code></p>\n<p>This should allow SUSHI to correctly find the <code>UK.Core.r4</code> package. It seems this package should come with a <code>packageId</code> already set, since that appears to be a required field on the ImplementationGuide resource. We have been assuming that the <code>version</code> field would match the numerical version given when specifying the dependency, but maybe that is an incorrect assumption on our end.</p>",
        "id": 188728563,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1582289902
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"239822\">@Nick Freiter</span>  that seems to have helped a bit. I'm not sure why the package has these items missing.</p>\n<p>I don't get the error message anymore, now I get a new one.</p>\n<div class=\"codehilite\"><pre><span></span>error Cannot read property &#39;children&#39; of undefined\n</pre></div>\n\n\n<p>My FSH file is</p>\n<div class=\"codehilite\"><pre><span></span>Instance:   RichardSMITH\nInstanceOf: https://fhir.nhs.uk/R4/StructureDefinition/UKCore-Patient\nTitle: &quot;Richard SMITH&quot;\n* gender = #female\n* name.given = &quot;Richard&quot;\n* name.family = &quot;SMITH&quot;\n* name.use = &quot;official&quot;\n</pre></div>\n\n\n<p>I don't get any output from this file at all.</p>",
        "id": 188733271,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1582293728
    },
    {
        "content": "<p>The RichardSMITH output should be located in build/input/examples/Patient-RichardSMITH.json</p>",
        "id": 188739019,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1582297287
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> the folder is empty. I have generated examples from other FSH files but I have removed them all to isolate the problem. I now only have the one FSH file and nothing gets generated. I guess it has to do with the error message I posted previously.</p>\n<p>As I am using the UK Core package I can only imagine that there is an issue with the package.</p>",
        "id": 188740062,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1582297830
    },
    {
        "content": "<p>The following FSH generated OK  so it must be the package that is the issue.</p>\n<div class=\"codehilite\"><pre><span></span>Instance:   JohnSMITH\nInstanceOf: Patient\nTitle: &quot;John SMITH&quot;\n* gender = #male\n* name.given = &quot;John&quot;\n* name.family = &quot;SMITH&quot;\n* name.use = #home\n</pre></div>",
        "id": 188740471,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1582298108
    },
    {
        "content": "<p>The package was created using Simplifier not the HL7 IG Publisher - perhaps there are inconsistencies at the moment. <span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span>  are you aware of any?</p>",
        "id": 188740936,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1582298395
    },
    {
        "content": "<p>It looks like the <a href=\"https://fhir.nhs.uk/R4/StructureDefinition/UKCore-Patient\" target=\"_blank\" title=\"https://fhir.nhs.uk/R4/StructureDefinition/UKCore-Patient\">https://fhir.nhs.uk/R4/StructureDefinition/UKCore-Patient</a> Structure Definition that comes from that package only has a differential, no snapshot. As of now, SUSHI is dependent on a snapshot being present in the Structure Definition. This is something we can consider addressing, but it would be complex to develop, since we would need to either modify a lot of our handling, or develop the ability to generate snapshots from differentials.</p>\n<p>So far the assumption that IGs would have snapshots hasn't come back to bite us. Is having an IG without snapshots more common than we thought?</p>",
        "id": 188741338,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1582298607
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , <span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> -- is it safe to assume, in general, that IGs we retrieve from <a href=\"http://packages.fhir.org\" target=\"_blank\" title=\"http://packages.fhir.org\">packages.fhir.org</a> will have snapshot populated in their SDs?</p>",
        "id": 188741663,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582298774
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239822\">@Nick Freiter</span> I have manually forced the generation of the Snapshot for the profile that was having the issues and now it works.<br>\nI'll feedback to the authors and hopefully, they will fix this in the next release.<br>\nThanks for your help.</p>",
        "id": 188743368,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1582299720
    },
    {
        "content": "<p>Thanks for troubleshooting this, gentlemen!</p>\n<p><span class=\"user-mention\" data-user-id=\"239822\">@Nick Freiter</span> Why is SUSHI relying on the ImplementationGuide resource in a package? I don't think every package will have one.<br>\nI'm surprised to indeed see packageId to be mandatory on the IG resource though. So I'll see how we can fill that at some point.</p>\n<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> I'm afraid that that's not the case. Since calculating snapshots is compute intensive (and the logic changes now and then) we don't include them by default in new packages. It also feels a bit like duplicating content which is contained in the dependencies, although I see the convenience and have had the request before...</p>\n<p>Sidenote: the package registry of course delivers packages, not IGs ;)</p>\n<p>The spec states 'All FHIR Implementation Guides are published as NPM packages, one package for each IG.' but not every package needs to have an IG included. The IG publisher stack creates this one to one link, but it can't be expected from FHIR packages in general.</p>",
        "id": 188752342,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1582304996
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> -- we currently rely on an ImplementationGuide resource because when we build the <code>ImplementationGuide</code> for the SUSHI IG, we need to populate <code>dependsOn</code>.  Unfortunately, <code>dependsOn</code> requires (<code>1..1</code>) the <code>uri</code> property, which has type <code>canonical(ImplementationGuide)</code>.<br>\n<a href=\"/user_uploads/10155/coGVKlpSBQbQEj2egL_fXOdq/image.png\" target=\"_blank\" title=\"image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/coGVKlpSBQbQEj2egL_fXOdq/image.png\" target=\"_blank\" title=\"image.png\"><img src=\"/user_uploads/10155/coGVKlpSBQbQEj2egL_fXOdq/image.png\"></a></div>",
        "id": 188754125,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582306051
    },
    {
        "content": "<p>That's pretty hard to populate if there is no ImplementationGuide to point to.</p>",
        "id": 188754230,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582306103
    },
    {
        "content": "<p>Seems like maybe a hiccup in the system if the intent is to allow dependencies on non-IG packages.</p>",
        "id": 188754417,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582306208
    },
    {
        "content": "<blockquote>\n<p>Since calculating snapshots is compute intensive (and the logic changes now and then)</p>\n</blockquote>\n<p>Ha.  This is exactly why we want to rely on the snapshot being there instead of having to compute it ourselves. ;-)  I guess if we need to support packages that don't include snapshots, we'll either need to revisit our approach to building SDs or we'll have to implement a snapshot generator (sigh).</p>",
        "id": 188754636,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582306347
    },
    {
        "content": "<p>Thank <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>. Yes, that's interesting. You want to help your user to populate the <code>depends on</code> of their IG. But only in the HL7 balloting world there's the convention that the packages an IG depends on will have an IG in the package.</p>\n<p>I guess the aim for FISH is to be there for a larger audience than just that world. There's no guarantee the user even wants to make an IG themselves I'd say. So possibly that logic to help create the IG resource could be optional.<br>\nOr for dependency packages without an IG you could not include that package in <code>depends on</code> of the IG. It will still be in the package.json. Or allow the user to specify a list of <code>depends on</code>s if there are IG linked to those packages but they are not IN the packages (since that's not required).</p>",
        "id": 188755347,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1582306787
    },
    {
        "content": "<p>I believe that someone has already created a Snapshot Generator, although it might not be in your preferred programming language.  One possible solution would be to stand it up as a service somewhere though.</p>",
        "id": 188762259,
        "sender_full_name": "Keith Boone",
        "timestamp": 1582311023
    },
    {
        "content": "<p>Yeah, I think we'll need to think on it some more <span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span>.  SUSHI doesn't require you to produce an IG -- we only create the ImplementationGuide JSON if the FSH Tank has an <code>ig-data</code> folder in it.  Tanks without that folder will get the resource files only (without any IG stuff).  So this is only relevant for folks who <em>want</em> to create an IG.  But if they <em>do</em>, I think we still have an issue if they rely on a package that doesn't have an ImplementationGuide -- as the template-based publishing doesn't use the package.json; it only uses the ig.ini and ImplementationGuide JSON.</p>",
        "id": 188762512,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582311193
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> is correct that packages do not require an Implementation Guide resource. OTOH, all implementation guide packages will have an one. The issue here is that there's no facility for a FHIR implementation guide to depend on profiles that are not published via an implementation guide. That's not a tooling limitation, that's baked into the definition of the implementation guide resource</p>",
        "id": 188762691,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582311315
    },
    {
        "content": "<p>but if I track this discussion correctly, the intent is to depend on a package that is an implementation guide, but doesn't have an implementation guide resource, and there fore the problem is in the source package</p>",
        "id": 188762791,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582311365
    },
    {
        "content": "<p>I think that we should have a rule that all implementation guide packages that represent a published implementation guide should include snapshots</p>",
        "id": 188762891,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582311424
    },
    {
        "content": "<p>I think this conversation actually started w/ a dependency on a package that <em>had</em> an implementation guide, but that implementation guide was not conformant (missing the packageId property).  It also had resources without snapshots.  The conversation then morphed into the more general discussion about our reliance on dependency IGs.</p>",
        "id": 188763028,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582311497
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> -- I'm aware of a snapshot generator in Java (part of the Publisher tooling I think) and one in .NET (part of Forge maybe?).  I don't know how separable they are, but standing one up as a service seems feasible.  I was going to say that the downside is that SUSHI could not run offline -- but we already require network if you need to download dependencies, so in theory we could do the snapshot generation immediately after that (and cache it somewhere).  Still, IMO, the fewer external network dependencies we have, the better...  Gonna have to think on this one.</p>",
        "id": 188763577,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582311803
    },
    {
        "content": "<p>That said, even if I wanted to, I'm not sure I can justify building it myself just because I didn't want a network call.  That said, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> -- is there a published algorithm or approach for generating snapshots?  Are there only a few rules to keep in mind or are there lots of complexities and edge cases?  It's one of those things that sounds simple on the surface (\"just a special merge\") but I bet has lots of gremlins lurking beneath.</p>",
        "id": 188764111,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582312151
    },
    {
        "content": "<p>loooots of gremlins hiding underneath.</p>",
        "id": 188765940,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582313383
    },
    {
        "content": "<p>there's a set of test cases, and I shudder each time I have to revisit them</p>",
        "id": 188765954,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582313396
    },
    {
        "content": "<p>agree it makes sense to generate the depedencies when installing the package. You don't need a network service for it; the validator can generate snapshots on reqeust</p>",
        "id": 188766052,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582313439
    },
    {
        "content": "<p>We're TypeScript/JavaScript -- so we'd need to make a system call to call the validator -- and that would require the user to have Java installed.  Still, if they want to use the IG Publisher, I guess they need Java already anyway.</p>",
        "id": 188766212,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582313524
    },
    {
        "content": "<p>one easy way is to die with an error if the package doesn't have snapshots and get the user to do it manually to the installed package, and I add a command line option to do that</p>",
        "id": 188766427,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582313678
    },
    {
        "content": "<p>You might be able to use Google's JCL (<a href=\"https://www.infoq.com/news/2019/05/j2cl-java-javascript-transpiler/\" target=\"_blank\" title=\"https://www.infoq.com/news/2019/05/j2cl-java-javascript-transpiler/\">https://www.infoq.com/news/2019/05/j2cl-java-javascript-transpiler/</a>) to transcode the Java one to JavaScript and run it inside Sushi.</p>",
        "id": 188823139,
        "sender_full_name": "Keith Boone",
        "timestamp": 1582388112
    },
    {
        "content": "<p>carumba. Given the scope of the dependencies for the validator (json xml rdf apache libraries) I wouldn't hold my breath</p>",
        "id": 188832170,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582403596
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191469\">Chris Moesel</span> <a href=\"#narrow/stream/215610-shorthand/topic/FSH.20Packages/near/188766212\" title=\"#narrow/stream/215610-shorthand/topic/FSH.20Packages/near/188766212\">said</a>:</p>\n<blockquote>\n<p>We're TypeScript/JavaScript -- so we'd need to make a system call to call the validator -- and that would require the user to have Java installed.  Still, if they want to use the IG Publisher, I guess they need Java already anyway.</p>\n</blockquote>\n<p>roll it in docker ... then you're off the hook</p>",
        "id": 188832343,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1582403985
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> we are some people that roll the entire setup in docker ... leaving the Java Runtime as well as Jekyll and Ruby inside the whale where it belongs</p>",
        "id": 188832404,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1582404120
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191387\">Keith Boone</span> <a href=\"#narrow/stream/215610-shorthand/topic/FSH.20Packages/near/188823139\" title=\"#narrow/stream/215610-shorthand/topic/FSH.20Packages/near/188823139\">said</a>:</p>\n<blockquote>\n<p>You might be able to use Google's JCL (<a href=\"https://www.infoq.com/news/2019/05/j2cl-java-javascript-transpiler/\" target=\"_blank\" title=\"https://www.infoq.com/news/2019/05/j2cl-java-javascript-transpiler/\">https://www.infoq.com/news/2019/05/j2cl-java-javascript-transpiler/</a>) to transcode the Java one to JavaScript and run it inside Sushi.</p>\n</blockquote>\n<p>The sun would have burned out long before you get that to succeed ... that would be my estimate</p>",
        "id": 188832464,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1582404231
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> -- Do we want to encourage users to modify their installed packages like that?  I assumed that, for the most part, we wanted packages to be managed more tightly than that?  And when you said \"and I add a command line option to do that\" -- do you mean you would add a command-line option to the validator to populate snapshots in an installed package?</p>\n<p><span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> -- I actually hadn't seen J2CL before.  I'm intrigued!  Even if it doesn't work out here, it might be helpful for one of my JS-based CQL projects than needs to use the Java-based CQL-to-ELM translator.  Thanks for the pointer!</p>\n<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> -- Yes, Docker would certainly alleviate some of these concerns -- but some of the audience we're targeting probably isn't really the Docker type.  Still, we certainly could consider Docker as an option for those who do use it.</p>",
        "id": 188926104,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582551380
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> - well ... my impression is that FSH pretty much targets both kinds of audience ;)</p>",
        "id": 188926880,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1582551902
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> -- agreed.</p>",
        "id": 188926930,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582551956
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> , I too am intrigued.  Let me know how well it works if you get to play with it before I do, and I'll do the same.</p>",
        "id": 188933319,
        "sender_full_name": "Keith Boone",
        "timestamp": 1582556299
    },
    {
        "content": "<blockquote>\n<p>Do we want to encourage users to modify their installed packages like that?</p>\n</blockquote>\n<p>Not in principle, no. But the question here appears to be least worst approach overall. So it's an option</p>",
        "id": 188960564,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582574561
    },
    {
        "content": "<blockquote>\n<p>you would add a command-line option to the validator to populate snapshots in an installed package?</p>\n</blockquote>\n<p>yes</p>",
        "id": 188960578,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582574572
    },
    {
        "content": "<p>I guess there's no need to 'edit the packages' themselves, but rather creating a set of temporary snapshots in the user's cache? Maybe just a phrasing difference, but lets keep packages immutable.</p>",
        "id": 189009292,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1582628364
    },
    {
        "content": "<p>yes they are immutable</p>",
        "id": 189010533,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582629432
    }
]