[
    {
        "content": "<p>Hello everyone, I would like to help to fill the examples in the FSHSchool website. Who do I speak to in order to do so?</p>",
        "id": 269754998,
        "sender_full_name": "João Almeida",
        "timestamp": 1643384398
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"195726\">@João Almeida</span>!  This is exciting!  We're currently tidying up some examples that we already had in the works -- but once we get those through (hopefully in the next few days), we'd love to have some examples from you!  The basic approach to contributing examples is documented in the <a href=\"https://github.com/FSHSchool/FSHOnline-Examples\">FSHOnline-Examples</a> README.  If you're comfortable using Git, then it shouldn't be too tricky.  If you're new to using Git, we can try to help.</p>\n<p>As noted above, however, it's probably best to wait until we merge in our currently in-progress example updates.  That way you don't duplicate any work we've already done -- and that way we also don't end up w/ any conflicts due to you working off an older version.</p>\n<p>Thanks again for asking (and being willing to help).  We'll let you know (soon) when we're ready for your contributions!</p>",
        "id": 269796605,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1643401104
    },
    {
        "content": "<p>Given the ubiquity and ease of FSH I would be happy to contribute to examples in the actual FHIR specification itself. Perhaps that’s a bridge too far :)</p>",
        "id": 269838185,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1643431564
    },
    {
        "content": "<p>FSH example instances for all resources…</p>",
        "id": 269838204,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1643431616
    },
    {
        "content": "<p>Got it! I will wait for the update and then I will add the rest! <br>\nThanks for the info</p>",
        "id": 269998835,
        "sender_full_name": "João Almeida",
        "timestamp": 1643619778
    }
]