[
    {
        "content": "<p>We're really excited to introduce the official 1.0 release of <strong>GoFSH</strong>, a FHIR Shorthand (FSH) decompiler. GoFSH can convert a set of JSON and/or XML FHIR R4 definitions into a working FHIR Shorthand project!</p>\n<p>GoFSH 1.0 comes with the following features:</p>\n<ul>\n<li>Supports <code>.json</code> and <code>.xml</code> FHIR R4 definitions as input</li>\n<li>Produces <code>.fsh</code> files in several configurable layouts</li>\n<li>Produces a simple FSH-only <code>sushi-config.yaml</code> file</li>\n<li>Follows best-practice FSH authoring practices (as much as possible)</li>\n<li>Optionally \"round-trips\" results to compare exported definitions with original definitions</li>\n<li>Provides a simple API for programmatically invoking GoFSH</li>\n<li>Is fully compliant with FHIR Shorthand 1.0 and SUSHI 1.2.0</li>\n</ul>\n<p>For more information, check out the <a href=\"https://github.com/FHIR/GoFSH/releases/tag/v1.0.0\">GoFSH 1.0.0 release notes</a> and <a href=\"https://fshschool.org/docs/gofsh/\">GoFSH documentation</a> in the FSH School!</p>",
        "id": 225910258,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1612992259
    },
    {
        "content": "<p>Cool! (especially the API)...</p>",
        "id": 225913561,
        "sender_full_name": "David Hay",
        "timestamp": 1612993593
    },
    {
        "content": "<p>So what are the Dolphins in the output summary? (I have 38 irritated ones)...</p>",
        "id": 225932331,
        "sender_full_name": "David Hay",
        "timestamp": 1613002267
    },
    {
        "content": "<p>and it seems to have skipped a number of the ValueSets (could this be related to the irritated dolphins?)</p>",
        "id": 225933011,
        "sender_full_name": "David Hay",
        "timestamp": 1613002804
    },
    {
        "content": "<p>I see that dolphins have gone, leaving me with 25 cuddled cuttlefish. I do appreciate the humour - but would like to know the meaning :)</p>",
        "id": 225942200,
        "sender_full_name": "David Hay",
        "timestamp": 1613011144
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span>.  When we built the summary table, we had too many things to report in a single row, so we decided to make it two rows.  But the number of things to report was an odd number, leaving one cell empty.  Well, we couldn't have that -- so we decided to make up fun statistics instead!  Basically, we pick a random number, random species, and random action -- resulting in something like you saw: 25 cuttlefish cuddled.  If you have no errors or warnings, you get a happy action, but if you have warnings or errors, you get an unhappy action (as in your first run with 38 irritated dolphins).</p>",
        "id": 225988445,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1613049800
    },
    {
        "content": "<p>But if you're missing ValueSets in the output, I'd like to take a look if the source is available.  One thing that maybe could go wrong is if you have a <code>ValueSet.name</code> that has spaces in it (which it shouldn't).  If so, then GoFSH might output FSH w/ that name -- which would then cause the SUSHI parser to choke and stop reading the file when it hits that grammar error?  But I'm just guessing now.  Seeing the actual project would help.</p>",
        "id": 225988923,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1613050017
    },
    {
        "content": "<p>Ah - I should have guessed that! (I got confused as only about a third of the ValueSets in the input folders seemed to result in fsh instances). But I'll look into it further - the VS instances came from elsewhere...</p>",
        "id": 226020045,
        "sender_full_name": "David Hay",
        "timestamp": 1613061785
    },
    {
        "content": "<p>Just for anyone else - turned out that my  resources didn't have unique id's which confused goFSH. Next release will allow for that. Many thanks to <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> for the rapid response!</p>",
        "id": 226025715,
        "sender_full_name": "David Hay",
        "timestamp": 1613063907
    },
    {
        "content": "<p>And to further clarify -- when GoFSH encounters a resource with the same <code>resourceType</code> and <code>id</code> it saw from a previous resource, it will ignore it (i.e., it requires the combination of <code>resourceType</code> and <code>id</code> to be unique).  That will likely not change (at least not now).  What was happening in this case, however, is that many of the resources had no <code>id</code> at all -- so GoFSH treated them as if they had the <em>same</em> (blank) <code>id</code>.  We will update GoFSH so that if a resource does not have an <code>id</code>, it will synthesize one using the <code>name</code> and/or a counter.</p>",
        "id": 226026287,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1613064134
    },
    {
        "content": "<p>(Haven't been following along so sorry if this is a repeat question)</p>\n<p>Does the JSON to FSH support FHIR instances, e.g. FHIR Observation to FSH version of it?    This would be helpful in taking existing sample data and creating base FSH files from it.</p>",
        "id": 226176755,
        "sender_full_name": "John Silva",
        "timestamp": 1613154293
    },
    {
        "content": "<p>and an add-on question for my own purposes, does goFSH understand parameterized rulesets and can you give it a set to use to auto-magically compress repeated structures? (or is/will this be considered for next releases of goFSH)</p>",
        "id": 226177086,
        "sender_full_name": "ryan moehrke",
        "timestamp": 1613154456
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298707\">@John Silva</span> -- GoFSH will create FSH for pretty much any FHIR thing you give it.  So, sure, it can be used to transform a set of examples into FSH.  The one caveat is that the FSH instances will have the rules to explicitly set fixed values, even though that technically is not required (since SUSHI automatically applies fixed values to instances).  So the GoFSH-produced FSH is not wrong, but it may be more verbose than necessary.</p>",
        "id": 226179198,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1613155550
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"237342\">@ryan moehrke</span> -- that would be super cool, but no, it does not do that today.  I think there is probably quite a bit of work required by that one little word \"auto-magically\", so I'm not sure if this will ever be a feature.  But I like the idea! (And we do accept contributions! <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span>)</p>",
        "id": 226179505,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1613155713
    }
]