[
    {
        "content": "<p>I'm trying to update examples for an R5 resource and would really like to do it in FSH.  Can GoFSH handle R5 or will I be converting manually?</p>",
        "id": 274566527,
        "sender_full_name": "David Pyke",
        "timestamp": 1646757228
    },
    {
        "content": "<p>GoFSH should be able to handle R5.  Let us know if you run into any issues.</p>",
        "id": 274568808,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1646758166
    },
    {
        "content": "<p>I'm trying to convert the current R5 Consent examples with GoFSH and there are a number of elements being dropped.  How do I tell GoFSH that it's R5, not R4?</p>",
        "id": 274568938,
        "sender_full_name": "David Pyke",
        "timestamp": 1646758216
    },
    {
        "content": "<p>Ohhh... GoFSH figures out the version of FHIR by looking at the <code>ImplementationGuide</code> resource (if available) or looking at the SD/CS/VS resources (since they have <code>fhirVersion</code> properties).  Since <code>Consent</code> doesn't have a <code>fhirVersion</code> property, there's not much for GoFSH to go on.</p>\n<p>You can solve this by throwing in a minimal <code>ImplementationGuide.json</code> file (ideally specifying <code>id</code>, <code>name</code>, <code>url</code>, <code>version</code>, <code>status</code>, and <code>fhirVersion</code>) or by throwing in a minimal profile (since it has a <code>fhirVersion</code>).</p>",
        "id": 274584449,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1646764240
    },
    {
        "content": "<p>We should consider adding an argument for specifying the FHIR version.  Looking at the code right now, I'm also realizing it might not work quite right with FHIR R4B.</p>",
        "id": 274584606,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1646764306
    },
    {
        "content": "<p><a href=\"https://github.com/FHIR/GoFSH/issues/177\">GoFSH#177</a></p>",
        "id": 274749407,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1646858487
    }
]