[
    {
        "content": "<p>Announcing <strong>GoFSH 0.4.0</strong> with the following enhancement and bug fixes:</p>\n<ul>\n<li>Generate <code>ValueSet</code> definitions</li>\n<li>Generate <code>CodeSystem</code> definitions</li>\n<li>Generate <code>Instance</code> definitions, including Instances with <code>Usage</code> of <code>example</code>, <code>definition</code>, and <code>inline</code></li>\n<li>Export unsupported <code>ValueSet</code> and <code>CodeSystem</code> definitions as Instances</li>\n<li>Generate <code>Alias</code> definitions and use in other FSH definitions</li>\n<li>Extract dependencies from a provided ImplementationGuide resource</li>\n<li>Update the output file structure to reflect SUSHI’s desired input structure of FSH Tanks</li>\n<li>Use FSH grammar for Codes, Codings, and Quantities on Assignment Rules and Caret Value Rules</li>\n<li>Generate config.yaml based on the ImplementationGuide resource in the <code>ig.ini</code> file if it is present</li>\n</ul>\n<p>For more information, check out the Release Notes on <a href=\"https://github.com/FHIR/GoFSH/releases/tag/v0.4.0\">GitHub</a>.</p>",
        "id": 219533855,
        "sender_full_name": "Julia Afeltra",
        "timestamp": 1607634362
    },
    {
        "content": "<p>Hi @Julia Afeltra . This looks like great progress.</p>\n<p>Can you share any info about things that GoFSH can NOT do at present?</p>",
        "id": 219536355,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1607635734
    },
    {
        "content": "<p>Hi Saul! GoFSH currently supports all of FHIR Shorthand. We're planning to add support for configuring the layout of your FSH output, potentially a tool to help authors check the output, and any bug fixes that come up before we release a 1.0.0 version.</p>",
        "id": 219546669,
        "sender_full_name": "Julia Afeltra",
        "timestamp": 1607641601
    },
    {
        "content": "<p>Does that include any resource instance? eg a Condition resource, or is it intended for conformance resources only?</p>",
        "id": 219547361,
        "sender_full_name": "David Hay",
        "timestamp": 1607642083
    },
    {
        "content": "<p>and - is there a callable service like sushi has? eg pass it an SD instance and get back FSH...</p>",
        "id": 219547427,
        "sender_full_name": "David Hay",
        "timestamp": 1607642149
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> -- it translates StructureDefinitions to <code>Profile</code> and <code>Extension</code> definitions, Value Sets to <code>ValueSet</code> definitions,  Code Systems to <code>CodeSystem</code> definitions, and everything else into <code>Instance</code> definitions.  It also creates <code>Alias</code>, <code>Invariant</code>, and <code>Mapping</code> definitions as necessary.</p>",
        "id": 219549777,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1607643989
    },
    {
        "content": "<p>Currently it all dumps to one <code>resources.fsh</code> file, but in the next version you will be able to indicate what type of layout you want (for example, organized by conformance type,  organized by base resource type, etc).</p>",
        "id": 219549846,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1607644067
    },
    {
        "content": "<p>We don't yet expose an API for it, sorry!</p>",
        "id": 219549899,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1607644086
    },
    {
        "content": "<p>Sounds good - I'll have a play! I'm hoping that the 'yet' in the last sentence means an API is on the roadmap?</p>",
        "id": 219634118,
        "sender_full_name": "David Hay",
        "timestamp": 1607707282
    },
    {
        "content": "<p>I think we could be persuaded. ;-)</p>",
        "id": 219634780,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1607707585
    },
    {
        "content": "<p>Looking forward to showing you what I've been doing with the other API :)</p>",
        "id": 219636191,
        "sender_full_name": "David Hay",
        "timestamp": 1607708201
    }
]