[
    {
        "content": "<p>I may be going about his all wrong. <br>\nWe have some custom groupings of attributes that we need to store at the Questionnaire.item groups of \"settings\"(general, scale, data). <br>\nI've created a Resource \"QuestionnaireItemSettings\" that I hope to add to Questionnaire.item as an extension (is this a good idea or not?)</p>\n<p>The resource is basically the following after generation to json.</p>\n<div class=\"codehilite\"><pre><span></span><code>{\n&quot;general&quot;:{\n   ...\n}\n&quot;data&quot; :{\n ....\n}\n&quot;scale&quot; :{\n ...\n}\n}\n</code></pre></div>\n<div class=\"codehilite\"><pre><span></span><code>...     Indicates attributes just not shown.\n</code></pre></div>\n<p>I'd like to reuse how questionnaire.maxvalue is defined and add a max/min value to my Resource above. </p>\n<p>So I copied the defintion of questionnaire.maxvalue and saw it formats the attribute as </p>\n<ul>\n<li>minValue 0..1  only date or dateTime or time or instant or decimal or integer \"minValue\"</li>\n</ul>\n<p>Yet FSH complains about the keyword 'only'</p>\n<div class=\"codehilite\"><pre><span></span><code>error As a FHIR choice data type, the specified data.minValue for AddElementRule must end with &#39;[x]&#39;.\n</code></pre></div>\n<p>How would one define a minValue to allow the use of those datatypes ?</p>",
        "id": 277939308,
        "sender_full_name": "Al Pivonka",
        "timestamp": 1649190710
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193364\">@Al Pivonka</span>.  I think you've raised a few questions here.  I'll try to respond as best I can, but let me know if anything is unclear.</p>\n<p>While FSH allows you to create custom resources, this should be done with care -- as you can't expect any other systems to support them.  Typically, custom resources would only be used in an enclosed system where you control all of the FHIR-related software and can build in support for your custom resources.  Custom resources are <em>not</em> generally a good solution for cross-system interoperability.</p>\n<p>As for carrying a custom resource in an extension, this would likely also cause issues (even in a closed system as described above).  The <a href=\"http://hl7.org/fhir/R4/extensibility.html#extension\">Extension definition</a> only allows a particular list of types (see the <em>Notes</em> in the previously linked definition) -- so you couldn't define an extension whose value is a custom resource.</p>\n<p>If you want to add <code>general</code>, <code>data</code>, and <code>scale</code> attributes to <code>Questionnaire.item</code>, the most common approach would be to create a complex extension for them (assuming they should always be grouped together).  You would then apply that extension to <code>Questionnaire.item</code>.  The <a href=\"http://hl7.org/fhir/R4/extensibility.html\">extensibility page</a> discusses simple and complex extensions.  The FHIR Shorthand spec discusses extensions w/ examples in the <a href=\"http://hl7.org/fhir/uv/shorthand/reference.html#defining-extensions\">Defining Extensions</a> section.   It describes how to apply them to a profile in the <a href=\"http://hl7.org/fhir/uv/shorthand/reference.html#contains-rules-for-extensions\">Contains Rules for Extensions</a> section.  Since <code>Questionnaire.item</code> is recursive, if you wanted to apply this extension to all recursions, you should also see Jean Duteau's recent thread <a href=\"#narrow/stream/215610-shorthand/topic/HowTo.3A.20Recursive.20element.20restrictions\">here</a> (and my response to it).</p>\n<p>As for your last question about the <code>only</code> rule -- you're getting that error because FHIR choices (where more than one data type is allowed) <em>must</em> have names ending in <code>[x]</code>.  So to make it work, you would have to say <code>minValue[x]</code>.  But <code>minValue[x]</code> is actually a property of <code>ElementDefinition</code>, which is the backing type for all elements -- so depending on your use case, it might be more appropriate to set it via a <a href=\"http://hl7.org/fhir/uv/shorthand/reference.html#caret-paths\">caret path assignment rule</a>.</p>",
        "id": 278022533,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1649251495
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> thank you for your response. <br>\nGreat information and I will continue to push onward.</p>",
        "id": 278034731,
        "sender_full_name": "Al Pivonka",
        "timestamp": 1649256601
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> </p>\n<p>You may know.. I'm searching GITHUB for examples of what I'm trying to do; \" I know they will be things I will have to interpret from those examples\"</p>\n<p>I'm hoping to find std. tag that is used for FHIR-FSH within GITHUB.   Any Ideas?</p>\n<p>Any assistance you can provide would be greatly appreciated.</p>",
        "id": 278064774,
        "sender_full_name": "Al Pivonka",
        "timestamp": 1649268977
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193364\">@Al Pivonka</span> -- I'm afraid I don't really have any tips for searching GitHub.  If it's helpful, <a href=\"https://fshschool.org/fsh-finder/\">FSH Finder</a> lists IGs that use FSH.  So you could look through them for examples.  <a href=\"https://fshschool.org/FSHOnline/#/\">FSH Online</a> also has some built-in examples.  Otherwise, searching Zulip can be very helpful too.</p>",
        "id": 278069008,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1649270931
    }
]