[
    {
        "content": "<p>hello, I am new in FHIR and I am trying to change the datatype of \"id\" element into \"id\" instead of \"string\" as follows:</p>\n<ul>\n<li>id only id<br>\nbut when I run SUSHI on the FH files it throws the following error:<br>\n\"error The type string is not abstract, so it cannot be constrained to the specialization id.\"<br>\nCould anyone help me in explain that or how could I do it ?</li>\n</ul>",
        "id": 247446250,
        "sender_full_name": "Osaid Nabulsi",
        "timestamp": 1627471157
    },
    {
        "content": "<p>you cannot change the data type definition</p>",
        "id": 247449058,
        "sender_full_name": "Diana_Ovelgoenne",
        "timestamp": 1627473361
    },
    {
        "content": "<p>could you explain more in details please ?</p>",
        "id": 247452998,
        "sender_full_name": "Osaid Nabulsi",
        "timestamp": 1627476084
    },
    {
        "content": "<p>there's not much more to say.  string has no specializations so you can't change the datatype of an attribute that is declared as string.  it will always be string.</p>",
        "id": 247456429,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1627478014
    },
    {
        "content": "<p>Technically, <code>id</code> is a <em>specialization</em> of <code>string</code> (see <a href=\"http://hl7.org/fhir/R4/id.profile.json.html\">id json</a>), but you cannot constrain a concrete element type to a specialization.  You can only constrain it to a profile (e.g., <code>derivation: constraint</code>).  The rules are a bit different if the element type is abstract -- in which case you <em>can</em> constrain it to a specialization.  By way of example:</p>\n<ul>\n<li>You <em>cannot</em> constrain <code>Quantity</code> to <code>Age</code> because <code>Age</code> is a specialization of concrete type <code>Quantity</code></li>\n<li>You <em>can</em> constrain <code>Quantity</code> to <code>SimpleQuantity</code> because <code>SimpleQuantity</code> is a profile (constraint) of <code>Quantity</code></li>\n<li>You <em>can</em> constrain <code>Resource</code> to any resource (specialization or profile) because <code>Resource</code> is abstract</li>\n</ul>",
        "id": 247459270,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1627479314
    }
]