[
    {
        "content": "<p>Can I use FSH and the IG builder based on a build on my local machine rather than an \"official\" build?   I think I must be able to change some of the configuration paths, but I'm not clear which, and I can't find it in the documentation anywhere.</p>",
        "id": 230847494,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1616066914
    },
    {
        "content": "<p>use \"dev\" (instead of current or the published version) in FSH and/or IG. In FSH you have a sushi-config.yaml where the dependencies are specified, in  the IG Publisher you specify the dependency in the ImplementationGuide resource provided to the IGPublisher.</p>",
        "id": 230849934,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1616068390
    },
    {
        "content": "<p>Right.  I believe when you specify a dependency version as <code>dev</code> it uses the <em>last local build</em> of the dependency -- so do note that if you make changes to the dependency locally, you need to build the dependency (using IG Publisher) in order for those changes to be reflected in the project that depends on it.</p>",
        "id": 230856793,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1616071875
    },
    {
        "content": "<p>Thanks both - I've added dependencies with an id and DEV and sushi is finding something it thinks matches that, but it doesn't have the content my local build has created.  I suspect the local build is putting stuff into one cache and sushi is looking in another.  Beyond that I don't really know what I'm looking for or how to fix it.  Words of wisdom and experience would be appreciated.</p>",
        "id": 230935175,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1616100543
    },
    {
        "content": "<p>OK some progress ... doing  a full build updates a folder .fhir with hl7.fhir.r5.core#current<br>\nIf I put this in the dependencies in Sushi-config.yaml Sushi finds it but then says \"Downloading hl7.fhir.r5.core#current since SUSHI cannot determine if the version in the local cache is the most recent build\"</p>\n<p>My IG then fails to build because it cant see my local updates.  Is this a reasonable analysis and if so how do I force it to use the local copy not download a copy?</p>",
        "id": 230943999,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1616104748
    },
    {
        "content": "<p>Are you trying to use a local build of a dependency IG or a local build of FHIR R5?  Do you mind sharing your configuration.yaml file (either here or via direct message to me and <span class=\"user-mention\" data-user-id=\"239822\">@Nick Freiter</span> )?</p>\n<p>The <code>current</code> version is supposed to mean \"last auto build\", so when you specify the version as <code>current</code> SUSHI will always try to download and use the last build from the build server.</p>",
        "id": 231014294,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1616156752
    },
    {
        "content": "<p>We are making significant changes to a resource for R5 and my plan was to build some examples on my local instance before putting anything into the official current build.  The reason being to allow people to consider and understand the effects of changes (and it is very likely they will change their minds on some things) before going through the formal process.  This will also give me examples I can put into the resource documentation.  I'm not at this point actually trying to build an IG though this almost certainly will morph into one at some point in the future.</p>",
        "id": 231045195,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1616169221
    },
    {
        "content": "<p>id: fhir.example.brandr.researchstudy<br>\ncanonical: <a href=\"http://example.org/brandr/researchstudy\">http://example.org/brandr/researchstudy</a><br>\nname: ResearchStudyIG<br>\ntitle: \"HL7 FHIR ResearchStudy Example\"<br>\ndescription: An illustrtation of representing a real regulated study in the ResearchStudy resource<br>\nstatus: draft<br>\nversion: 0.1.0<br>\nfhirVersion: 4.0.1<br>\ncopyrightYear: 2021+<br>\nreleaseLabel: draft<br>\npublisher:<br>\n    name: HL7 International - BR&amp;R Work Group<br>\n    url: <a href=\"https://confluence.hl7.org/display/BRR/Biomedical+Research+and+Regulation\">https://confluence.hl7.org/display/BRR/Biomedical+Research+and+Regulation</a><br>\ndependencies:<br>\n    hl7.fhir.r5.core : current</p>\n<p>menu:<br>\n  Home: index.html<br>\n  Artifacts: artifacts.html</p>",
        "id": 231045396,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1616169291
    },
    {
        "content": "<p>Thinking about it and what you said about current the queston is how I get the local FHIR build to generate hl7.fhir.r5.core : dev</p>",
        "id": 231046763,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1616169734
    },
    {
        "content": "<p>Ah.. OK.  So I think there are a few things going on here:</p>\n<ol>\n<li>\n<p>I think you're running into trouble because your <code>fhirVersion</code> says <code>4.0.1</code>, but you're trying to pull in FHIR R5 as a dependency.  I don't think an R4 project can depend on R5.  So you really need to change the <code>fhirVersion</code> and <em>remove</em> the <code>hl7.fhir.r5.core</code> from the dependencies.</p>\n</li>\n<li>\n<p>Right now, we support <code>fhirVersion: current</code>, but as I noted before, this will always pull down the latest build from the build server.  What you really want is <code>fhirVersion: dev</code>, but right now SUSHI will not allow that.</p>\n</li>\n<li>\n<p>It sounds like you've also found that when you do a local core FHIR build, it is not creating <code>~/.fhir/packages/hl7.fhir.r5.core#dev</code> -- so even if SUSHI allowed for it, it wouldn't be able to find it.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> / <span class=\"user-mention\" data-user-id=\"248736\">@Mark Iantorno</span> -- when you build core FHIR locally, does it put a package anywhere in the local FHIR cache?  If so, where?  If not, any ideas on where/how SUSHI could find a locally built FHIR core package?</p>\n</li>\n</ol>",
        "id": 231047924,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1616170203
    },
    {
        "content": "<p>I ended up asking #3 above in committers, as it seems that's probably the right place to ask.  <a href=\"#narrow/stream/179165-committers/topic/Cached.20R5.20.23dev.20packages.3F\">https://chat.fhir.org/#narrow/stream/179165-committers/topic/Cached.20R5.20.23dev.20packages.3F</a></p>",
        "id": 231049357,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1616170825
    },
    {
        "content": "<p>My core build does produce a new  hl7.fhir.r5.core#current .user/.FHIR so I need to produce a dev version of that</p>",
        "id": 231206498,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1616321233
    },
    {
        "content": "<p>I've now got the changes to the resource into the current build (rather than trying to do it locally).  Setting <code>fhirVersion</code> to <code>current</code> downloads the latest build and sushi runs correctly.  However the IG publisher (I think) then complains it doesn't like <code>current</code>.  I can make it work by renaming <code>hl7.fhir.r5.core#</code> to <code>hl7.fhir.r5.core#4.5.0</code> but this is a hack.  What am I tripping over?</p>",
        "id": 232274353,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1617027159
    },
    {
        "content": "<p>I can confirm.  When I try to build a simple project w/ fhirVersion <code>current</code>, the IG Publisher emits this error:</p>\n<blockquote>\n<p>java.lang.Exception: Error Parsing File /Users/cmoesel/dev/fsh/R5Test/fsh-generated/resources/ImplementationGuide-fhir.example.json: Unknown FHIRVersion code 'current'</p>\n</blockquote>\n<p>I'm 99% sure this used to work.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> / <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> / <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> -- do you have any insight into this?  Shouldn't the IG publisher support IG builds based on the \"current\" version of FHIR?  If so, is there a special way to do this?  We're currently setting <code>\"fhirVersion\": [\"current\"]</code> in the IG JSON file.  I think this used to work (unless we somehow missed testing it?).</p>",
        "id": 232294009,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1617034464
    },
    {
        "content": "<p>I don't recall if it ever worked - \"current\" is not in the valueset, so an IG with that value would be non-conformant.</p>",
        "id": 232294329,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617034613
    },
    {
        "content": "<p>I do not know if there was an exception for the publisher to support \"current\".</p>",
        "id": 232294403,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617034657
    },
    {
        "content": "<p>the place where \"current\" shows up is in the package-list</p>",
        "id": 232294596,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617034743
    },
    {
        "content": "<p>Good point re: the value set.  Perhaps I am remembering it wrong...  But it seems we must have some way of building IGs against FHIR current, right?</p>",
        "id": 232302920,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1617038231
    },
    {
        "content": "<p>'current' is fine for IG dependencies, I don't think it's ever worked for fhirVersion.  That's a fixed enumeration.  Right now, it should be 4.5.0</p>",
        "id": 232303101,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617038296
    },
    {
        "content": "<p>How does it determine if you want the 'local' 4.5.0 vs. the published 4.5.0 (September 2020)?</p>",
        "id": 232303651,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1617038524
    },
    {
        "content": "<p>Right.  In our case, I believe <span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span> needs to build against changes that were just recently made in R5 (not in the preview 3 release that was published as <code>4.5.0</code>).</p>",
        "id": 232312236,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1617041861
    },
    {
        "content": "<p>I presume Grahame will increment the release to 4.6.0 soon-ish.  I don't know what 4.5.0 resolves to right now...</p>",
        "id": 232312506,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617041976
    },
    {
        "content": "<p>Looks like I have to keep hacking it to work ... sigh ...</p>",
        "id": 232318593,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1617044570
    }
]