[
    {
        "content": "<p>Thanks for a great presentation at the Dev Days!</p>\n<p>Browsed through the documentation on GitHub and thought, would'nt it be Nice to be able to define the actual ImplementationGuide Instance in Shorthand to? The way I read the documentation I still have to provide a Handwritten IG instance for the IG-Publisher to actually make an Implementation Guide. Maybe I'am just interpreting the documentation wrong.</p>",
        "id": 182002497,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1574847054
    },
    {
        "content": "<p>that's certainly where we are, but it probably makes sense to do shorthand for the IG as well. But I suspect it's lower priority than everything else</p>",
        "id": 182013668,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574857661
    },
    {
        "content": "<p>Right -- we want to support a simpler approach to generating a whole IG, but we were also waiting for the IG Publisher templating approach to settle down a bit so that we're not chasing a moving target.  But... given a FSH Tank and the package.json file, I think we can generate much of the content of the ImplementationGuide instance.  We just need to design how it should work in a way to also allow flexibility for authors.  As Grahame said, it's just a matter of priorities at this point -- and we're still defining core functionality right now.</p>",
        "id": 182352421,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1575298488
    },
    {
        "content": "<p>It seems <span class=\"user-mention\" data-user-id=\"239822\">@Nick Freiter</span> has started work on this? Sorry, I've missed a few Shorthand calls, though not due to a lack of interest <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span><br>\nI don't see any documentation on it on <a href=\"https://github.com/HL7/fhir-shorthand/wiki\" target=\"_blank\" title=\"https://github.com/HL7/fhir-shorthand/wiki\">https://github.com/HL7/fhir-shorthand/wiki</a> yet, can you give a brief overview of the thinking right now? Shorthand to describe a IG FHIR resource and then markdown files to create the pages, with some special codes for rendering and such? Thanks!</p>",
        "id": 183276437,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1576168497
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> -- Nick is working on downloading the FHIR core packages (and eventually HL7 IGs).  I'm working on the start of exporting something that can be used as source for the IG Publisher.  There isn't much documentation on it yet, as I'm kind of working out how it might work as I go along.  It's a bit complicated by the fact that the template-based IG publishing is not yet fully documented.</p>",
        "id": 183277098,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1576168911
    },
    {
        "content": "<p>The initial version will be very simple.  It will require minimal user input to get something that is buildable, and the result will be admittedly plain.  I think it will probably have a way, however, for a user to provide ancillary files that get fed directly to the publisher -- so there should be a lot of flexibility; but only for people who really know and understand how the template-based publisher works.</p>",
        "id": 183277435,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1576169065
    },
    {
        "content": "<p>A future version will provide more user-friendly mechanisms for controlling the IG output, but we may wait for the template-based IG Publisher work to stabilize a bit (and be more fully documented) before implementing anything <em>too</em> fancy around IG generation.</p>",
        "id": 183277587,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1576169156
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> happy to be a tester if / when you want one...</p>",
        "id": 183284169,
        "sender_full_name": "David Hay",
        "timestamp": 1576173604
    },
    {
        "content": "<p>Sounds perfect <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>, thanks. I'd like to get that working with our Markdown IG editor at some point, so also happy to test.</p>",
        "id": 183563292,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1576512420
    }
]