[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"243697\">Etienne Cantineau</span> <a href=\"#narrow/stream/215610-shorthand/topic/SUSHI.200.2E14.2E0/near/203360837\">said</a>:</p>\n<blockquote>\n<p>Hello, i have problems with the inline reference correction. if I use Reference(OrganizationEx01), instead of having Organization/OrganizationEx01, now i get  #OrganizationEx01 which is not resolvable by the publisher</p>\n</blockquote>\n<p>Hey <span class=\"user-mention\" data-user-id=\"243697\">@Etienne Cantineau</span> , I'm moving this over to a new thread so this conversation isn't mixed up with the one happening where this was originally posted. Is <code>OrganizationEx01</code> declared with <code>Usage: #inline</code> in SUSHI? That is the only situation in which the <code>#</code> should be used, and if the <code>OrganizationEx01</code> example is actually <code>#inline</code>, then SUSHI will not generate an independent JSON file for that resource, so that resource can only exist in the context of another resource, and it isn't proper to reference it as <code>Organization/OrganizationEx01</code>, since that resource does not exist independently.</p>",
        "id": 203375555,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1594294961
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239822\">@Nick Freiter</span> Yes my examples are bundles with each entries as inline resources. I had no error in QA with sushi 0.13.2 and gets now 332 with 0.14.0 saying REF-1 error and unable to resolve resource for each of my references to inline resources</p>",
        "id": 203376238,
        "sender_full_name": "Etienne Cantineau",
        "timestamp": 1594295561
    },
    {
        "content": "<p>We were under the impression from this <a href=\"#narrow/stream/215610-shorthand/topic/Binary.20reference\">thread</a> that resources which don't have an independent existence should be referenced using <code>#id</code>. But it looks like that does not account for Bundles, so we've created a new bug that will need to be fixed, sorry if this is holding you up.</p>",
        "id": 203378276,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1594297100
    },
    {
        "content": "<p>I think the rule is (probably) that if the referenced resource is in <code>contains</code>, you should use <code>#id</code> -- otherwise use a normal reference.</p>",
        "id": 203380280,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1594298598
    },
    {
        "content": "<p>No problem, thank you for quick answers!</p>",
        "id": 203381055,
        "sender_full_name": "Etienne Cantineau",
        "timestamp": 1594299081
    }
]