[
    {
        "content": "<p>Is there any way to remove the warning you get when using inline extensions? eg:</p>\n<div class=\"codehilite\"><pre><span></span><code>warn  Extension with slice name &#39;period&#39; will be treated as an inline extension, even though the name can be resolved to the external extension: http://hl7.org/fhir/StructureDefinition/organization-period. Starting with SUSHI 0.10.0, extension slices using standalone extensions should explicitly declare a slice name and type. If this extension slice should refer to http://hl7.org/fhir/StructureDefinition/organization-period, recommended practice is to define an alias:\n  Alias: PeriodExtension = http://hl7.org/fhir/StructureDefinition/organization-period\nthen use it in the contains rule:\n  extension contains PeriodExtension named period 0..1\n</code></pre></div>",
        "id": 198265228,
        "sender_full_name": "David Hay",
        "timestamp": 1590013603
    },
    {
        "content": "<p>That warning happens because you have an inline extension with the same name/id as an external extension, so it isn't general to all inline extensions. I'm sure that doesn't make it any less annoying though! No, there is nothing you can do to get rid of that warning, assuming you don't want to change the name of your inline extension. However, it has been a good amount of time since we have made the syntax change to <code>x contains y named z</code> which necessitated that warning, so I think it's time we consider removing the warning.</p>",
        "id": 198309638,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1590059824
    },
    {
        "content": "<p><a href=\"https://github.com/FHIR/sushi/issues/456\">https://github.com/FHIR/sushi/issues/456</a></p>",
        "id": 198309887,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1590060029
    },
    {
        "content": "<p>Yes, it was the intent that this message would be temporary -- so I agree that we should consider removing it now.</p>",
        "id": 198314263,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1590063846
    },
    {
        "content": "<p>yep - I remember (and appreciated) the warnings when they came out. I just prefer the 'success' puns to the others :). (I feel a little glow of satisfaction)</p>",
        "id": 198351524,
        "sender_full_name": "David Hay",
        "timestamp": 1590082490
    },
    {
        "content": "<p>Wow.  So you will unlock a whole new set of puns once we make those warnings go away! ;-)</p>",
        "id": 198354487,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1590083986
    },
    {
        "content": "<p>Oh, I do have IG's that build without warning - but I want them ALL to !</p>",
        "id": 198356898,
        "sender_full_name": "David Hay",
        "timestamp": 1590085123
    }
]