[
    {
        "content": "<p>I'm trying to use sushi to create an instance of a logical model of StructureDefinition but no matter what I do, it can't seem get sushi to find the logical model's structure def to build it.  Am I trying to do something sushi doesn't support?</p>",
        "id": 255738643,
        "sender_full_name": "David Pyke",
        "timestamp": 1633092938
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> ?</p>",
        "id": 255756416,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633099950
    },
    {
        "content": "<p>Yes, SUSHI currently doesn't support creating an instance of a logical model.  The line from the specification is a little unclear: <code>quote The value of InstanceOf MAY be the name, id, or url for any profile, resource, or complex datatype defined internally or externally.</code> But logical models aren't profiles, resources, or complex datatypes so Instances can't be done with those.</p>",
        "id": 255758006,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1633100580
    },
    {
        "content": "<p>Correct. Here's an example of a logical model instance: <a href=\"https://build.fhir.org/ig/FHIR/sample-ig/Binary-logical-example.html\">https://build.fhir.org/ig/FHIR/sample-ig/Binary-logical-example.html</a> FWIW</p>",
        "id": 255759710,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1633101322
    },
    {
        "content": "<p>so unless Sushi wants to create arbitraty json structures and xml files, I don't see how that would happen</p>",
        "id": 255759999,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1633101439
    },
    {
        "content": "<p>Yeah this is something we decided against doing when implementing logical models. But our decision was largely based on an assumed lack of need to make instances of logical models. But it seems like we may have been incorrect in our assumption, and there is actually more interest in creating instances of logical models than we think. </p>\n<p>We haven't fully looked into the hurdles of arbitrary JSON like <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> mentioned, so I'm not totally sure if it would pretty much be a non-starter. My first instinct though is that it might not actually be too bad given that logical models are just StructureDefinitions, and we know how to make instances of what StructureDefinitions define.</p>\n<p>I've made an issue <a href=\"https://github.com/FHIR/sushi/issues/924\">here</a> for us to dig a little deeper into this, and either support instances of logical models, or at least be more explicit in our error message saying that we <em>don't</em> support it</p>",
        "id": 255760512,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1633101645
    },
    {
        "content": "<p>Right.  And up until one month ago, the IG Publisher did not support it at all.  If you look at <a href=\"#narrow/stream/179252-IG-creation/topic/Logical.20Model.20Examples\">this thread</a>, however, you can see that there is some complexity to it.  For example, authors would have to mark up their logical models w/ all the info needed to describe how serialization of each element should work (which, at that point, makes it a <em>physical</em> model I guess?).  TBH I'm not even sure if FHIR defines where you put the <em>type</em> of a logical model in a JSON instance (e.g., do you still use a <code>resourceType</code> property?) -- so we might have to make that up.</p>",
        "id": 255762212,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1633102321
    },
    {
        "content": "<p>We're effectively creating custom resources (like the CDA IG) and then assigning values to the elements.  It's a fair amount of work for IG devs, but if you're getting to the level of creating a custom resource, then I expect the extra work would be not a huge hurdle for the IG dev.</p>",
        "id": 255764673,
        "sender_full_name": "David Pyke",
        "timestamp": 1633103287
    },
    {
        "content": "<p>im still struggling with the concept of an Instance of a logical model... this just makes no sense to me. If one can create an instance, then one does not have a logical model, one has a concrete model.</p>",
        "id": 255765796,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633103703
    },
    {
        "content": "<p>Any way you slice it, I don't have the ability to create an Instance of it</p>",
        "id": 255765859,
        "sender_full_name": "David Pyke",
        "timestamp": 1633103731
    },
    {
        "content": "<p>yes you do... you create it outside of sushi, and base64 encode it into a Binary.</p>",
        "id": 255765956,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633103764
    },
    {
        "content": "<p>Sorry, I don't have a way in Sushi to do it</p>",
        "id": 255766145,
        "sender_full_name": "David Pyke",
        "timestamp": 1633103827
    },
    {
        "content": "<p>I think you are looking for a tool called \"Caviar\", not \"Sushi\"..... it is friday, right?</p>",
        "id": 255766792,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633104038
    },
    {
        "content": "<p><a href=\"https://github.com/FHIR/sushi/releases/tag/v2.2.0\">SUSHI 2.2.0</a> now has the necessary support to allow authors to use the mechanism Grahame described for including examples of logical models.  You can't write the example in FSH (you must provide JSON/XML), but it's a step in the right direction.</p>",
        "id": 261309360,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1636750527
    }
]