[
    {
        "content": "<p>Hi!<br>\nI am in the process of writing fsh-files with the purpose of creating an implementation guide.<br>\nIn some profiles I would like to specify that an attribute of type CodeableConcept can only take some values.<br>\nCan I specify \"on the fly\" these values by listing them instead of creating a full-blown valueset? What would the syntax look like in that case?</p>",
        "id": 224048964,
        "sender_full_name": "Gino Almondo",
        "timestamp": 1611672523
    },
    {
        "content": "<p>The only way I can think of to do that <em>without</em> a value set is to slice on <code>coding</code> and create a separate slice for each code you want to support.  But there is at least one potential issue.  If you wanted to require that it <em>must</em> contain one of the codes, you'd have to make it a <code>closed</code> slicing, which would then prohibit an instance from having any <em>additional</em> codings (synonyms, user selected code, etc).</p>\n<p>Even without that issue, however, it would be an overly complicated solution just to avoid using value sets.  In FHIR, value sets and bindings are the canonical approach to restricting a code-like value to a set of codes.  Why don't you want to use that approach?</p>",
        "id": 224073206,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611682067
    },
    {
        "content": "<p>What is the intent of avoiding a \"full-blown valueset\"? Value sets are pretty light-weight and don't need to be defined by some official body, so having a valueset inside you IG is perfectly reasonable. This has the advantage that users of you IG can validate that the values they put in your profile are from the valueset. If you have a valueset that really is only needed in one location, you could consider making it contained within the profile, but I feel that limits its usability.</p>",
        "id": 224248065,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1611781929
    }
]