[
    {
        "content": "<p>Hi! I'm trying to run SUSHI where I create a profile using FSH that is based on another custom profile to which I have the JSON file. I'm reading the docs and it mentions something about a \"local FHIR cache\", where I'm suspecting I'm supposed to be able to put dependencies, but the docs aren't very exhaustive on this. Is there any more info on this topic somewhere? Where is this cache located? How does it work? What kinds of files does it accept?</p>",
        "id": 265585148,
        "sender_full_name": "Håkan MacLean",
        "timestamp": 1640017580
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"364590\">@Håkan MacLean</span>.  The answer to your question depends on where your custom profile comes from and where it should go.</p>\n<p>If your custom profile comes from another IG / package, then you should declare that package as a dependency of your SUSHI project.  When you do that, SUSHI will download the dependency package and should be able to find the custom profile in it.</p>\n<p>If your custom profile does not belong to another package, then you need to include it in your IG.  If you drop it into one of the supported resource folders in your project (like <code>input/resources</code>), then SUSHI will pick it up and you should be able to reference it.</p>",
        "id": 265611369,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1640031692
    },
    {
        "content": "<p>Thanks for taking the time to reply!</p>\n<blockquote>\n<p>When you do that, SUSHI will download the dependency package and should be able to find the custom profile in it.</p>\n</blockquote>\n<p>So if I only have a local package that is not downloadable via its canonical URL, where do I place it so that SUSHI finds it?</p>\n<blockquote>\n<p>If you drop it into one of the supported resource folders in your project (like input/resources), then SUSHI will pick it up and you should be able to reference it.</p>\n</blockquote>\n<p>Where can I read more about these \"supported resource folders\"? Apart from <code>input/fsh</code> I didn't see much in the docs, but perhaps I'm reading in the wrong place?</p>\n<p>Update: I did find a link to <a href=\"https://build.fhir.org/ig/FHIR/ig-guidance/using-templates.html#root.input\">this page</a>, where I found the answers to some of my questions.</p>",
        "id": 265612917,
        "sender_full_name": "Håkan MacLean",
        "timestamp": 1640032625
    },
    {
        "content": "<p>Regarding your first question.  If you have locally built the package w/ the profile you want (using the IG Publisher), then the IG Publisher will put it into your FHIR cache for you.  To specify the local package as a dependency, you use version <code>dev</code> when specifying the dependency in your projects sushi-config.yaml.  E.g:</p>\n<div class=\"codehilite\" data-code-language=\"YAML\"><pre><span></span><code><span class=\"nt\">dependencies</span><span class=\"p\">:</span>\n  <span class=\"nt\">my.local.dependency.package.id</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">dev</span>\n</code></pre></div>\n<p>If you have not build it locally and you just need to get it into your local FHIR cache, you can find your local FHIR cache inside your user's home directory (which differs based on OS), in a folder called <code>.fhir</code>.  If you look at that you can probably get a feel for how the packages are structured.  It may be documented somewhere, but if so, I'm not sure where.</p>",
        "id": 265616104,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1640034501
    }
]