[
    {
        "content": "<p>I have a logical model that refers to parts within the model itself or refers to a different model.  I've been doing that as follows:</p>\n<div class=\"codehilite\"><pre><span></span><code>* packaging.packaging 0..1 BackboneElement &quot;Outer Packaging&quot; &quot;Packaging that contains this package.&quot;\n* packaging.packaging ^contentReference = &quot;http://hl7.org/fhir/us/spl/StructureDefinition/SubmittedProductLogicalModel#SubmittedProduct.packaging&quot;\n</code></pre></div>\n<p>I suspect this isn't the proper way because I'm getting the following errors in the publisher:</p>\n<div class=\"codehilite\"><pre><span></span><code>eld-5: &#39;if the element definition has a contentReference, it cannot have type, defaultValue, fixed, pattern, example, minValue, maxValue, maxLength, or binding&#39; Rule &#39;if the element definition has a contentReference, it cannot have type, defaultValue, fixed, pattern, example, minValue, maxValue, maxLength, or binding&#39; Failed\n</code></pre></div>\n<p>Should I just have the contentReference and nothing else?</p>",
        "id": 268304544,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1642445562
    },
    {
        "content": "<p>Right.  Same as you would if you were just creating the differential directly.</p>",
        "id": 268307751,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642447604
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> I don't see how I can just specify a cardinality and a contentReference.  Sushi complains unless I have a full AddElement, i.e. cardinality, type, and short.</p>",
        "id": 268308875,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1642448445
    },
    {
        "content": "<p>Hmmm... yeah.  This seems like an oversight on the part of the FSH grammar and/or SUSHI processor.  Content references are the one exceptional situation where a type should not be needed.  I'm not sure how we missed that.  I'll log an issue... OK. Logged.  <a href=\"https://github.com/FHIR/sushi/issues/1009\">SUSHI#1009</a>.</p>",
        "id": 268400454,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1642516980
    }
]