[
    {
        "content": "<p>A few things about naming systems:</p>\n<ul>\n<li>What's the way to add a naming system in shorthand? I tried as an Instance, but it is added in examples (normal for an instance i guess) while it was added in terminology before, am i using the good way or there was a change in the publisher layout?</li>\n<li>I have a contact name and telecom but in the generated narrative the contact is still empty.</li>\n<li>My contact is overwritten by the IG to use the infos from the contact (me) in the ImplementationGuide file</li>\n</ul>",
        "id": 195525527,
        "sender_full_name": "Etienne Cantineau",
        "timestamp": 1588057470
    },
    {
        "content": "<p>You can add a NamingSystem that won't be treated as an example by doing the following:</p>\n<div class=\"codehilite\"><pre><span></span><code>Instance: MyNamingSystem\nInstanceOf: NamingSystem\nUsage: #definition\n</code></pre></div>\n\n\n<p>By specifying the <code>Usage</code> as <code>#definition</code>, you tell SUSHI to treat this Instance as a definition of some Resource, not as an example of one. This should fix the issue with adding the NamingSystem to examples.</p>\n<p>As for the bottom two issues, I observed the same thing when I tested it out, but I'm not sure what we can do about that on the SUSHI side. The generation of narratives is controlled by the IG Publisher, and the overwriting of the contact seems to be a decision the IG Publisher is making.</p>",
        "id": 195555050,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1588076605
    },
    {
        "content": "<p>Thank you, it fixed well. I'll report the two issues in IG creation stream.</p>",
        "id": 195557969,
        "sender_full_name": "Etienne Cantineau",
        "timestamp": 1588078084
    },
    {
        "content": "<p>Shouldn't NamingSystem default to being a definition?</p>",
        "id": 195567300,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588082154
    },
    {
        "content": "<p>Currently every Instance defaults to being an example, if no <code>Usage</code> is specified. Our reasoning was that the most common use case we are seeing of Instances is as examples, so we wanted to make that the default. That doesn't mean we are against smarter defaulting though. It does seem fair that we could default Instances of terminology resources to definition, not example. It makes the defaulting behavior more complex to document, but probably easier to work with for users that only ever use the default, and don't specify a <code>Usage</code>.</p>",
        "id": 195572589,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1588084403
    }
]