[
    {
        "content": "<p>Please provide more information when this error is given. I am catching on that it is usually caused by a link to a missing  object, but what link?</p>\n<div class=\"codehilite\"><pre><span></span><code>Sushi: error SUSHI encountered the following unexpected error: Cannot convert undefined or null to object (00:08.0208)\n</code></pre></div>",
        "id": 217902332,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606319744
    },
    {
        "content": "<p>The problem is that this was an \"unexpected\" error, which usually means the error occurred in a low level of code, but we only caught it in higher-level error handling.  This particular error message does not come from SUSHI code, so it probably comes from Node.js or one of our dependency libraries.  So... we likely only have whatever information bubbled up with the error.</p>",
        "id": 217909219,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1606322579
    },
    {
        "content": "<p>If you can identify a specific use case (or line of FSH) that causes this error, and/or if you can provide a stack trace for it, we can investigate and see if we can catch it in the deeper code and provide a more useful error message.</p>",
        "id": 217909365,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1606322648
    },
    {
        "content": "<p>I think I see these errors most often on incorrect array indexes. (1, 2, 4,...)</p>",
        "id": 217909625,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1606322789
    },
    {
        "content": "<p>well, I am constantly confused by the array indexes...  that is what I am tracking down now</p>",
        "id": 217913027,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606324227
    },
    {
        "content": "<p>FWIW I had this exact same error yesterday related to me messing up array indices -- specifically trying to assign <code>something[1]</code> when <code>something[0]</code> didn't exist.</p>",
        "id": 217918473,
        "sender_full_name": "Max Masnick",
        "timestamp": 1606326941
    },
    {
        "content": "<p>yes, would be nice to catch these with more helpful error message.... why sometimes starts at zero and other times starts at one?</p>",
        "id": 217920860,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606328296
    },
    {
        "content": "<p>I think all indexes start at zero. </p>\n<p>My problem is when moving things around I sometimes forget to renumber correctly. (It happens when you have an  80 element StructureDefinition with manually maintained numbering. )</p>",
        "id": 217922967,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1606329439
    },
    {
        "content": "<p>I am not sure it is that clear... the first one is not numbered, the second one is numbered 1... unless you number the first one, then you start at 1</p>",
        "id": 217923558,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606329788
    },
    {
        "content": "<p>I actually hadn’t realized that you don’t need to number the first one. Any time I have a repeating element, I start with index 0.</p>",
        "id": 217923680,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1606329856
    },
    {
        "content": "<p>then if you have slices,you must use the slice identifier... and then what numbers do you use after that?</p>",
        "id": 217923687,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606329858
    },
    {
        "content": "<p>Ooh, good question.</p>",
        "id": 217923754,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1606329910
    },
    {
        "content": "<p>I didn't think it mattered as long as they were sequential.  Is that not the case?</p>",
        "id": 217924398,
        "sender_full_name": "David Pyke",
        "timestamp": 1606330316
    },
    {
        "content": "<p>I think the FSH team is considering a feature to dynamically assign indices rather than having to manually specify them, which would resolve this sort of problem</p>",
        "id": 217932996,
        "sender_full_name": "Max Masnick",
        "timestamp": 1606334874
    },
    {
        "content": "<p>I thought that made it into V1.0?  Oh well, good thing I didnt' test it</p>",
        "id": 217938790,
        "sender_full_name": "David Pyke",
        "timestamp": 1606338064
    },
    {
        "content": "<ol>\n<li>\n<p>The soft-indexing feature that <span class=\"user-mention\" data-user-id=\"322501\">@Max Masnick</span> referred to is in the works but is not yet released.  As Max suggested, it will help w/ these issues a lot.</p>\n</li>\n<li>\n<p>Indexes always start at <code>[0]</code>, but if you reference an array path and _don't_ include an index, then <code>[0]</code> is assumed.  This is to make statements like <code>*name.given = \"Chris\"</code> less awkward (vs. <code>* name[0].given[0] = \"Chris\"</code>)</p>\n</li>\n<li>\n<p>Slices do make this interesting for sure.  If you have a slice that allows multiple cardinality, then you index into the slice's sub-section using indexes after the slicename.  E.g., <code>component[sliceA][0]</code>, <code>component[sliceA][1]</code>, <code>component[sliceB][0]</code>, etc.</p>\n</li>\n<li>\n<p>In the example above, if you also want to add items that don't fit into a defined slice (so you can't reference them by name), I think you probably have to do math and figure out the right index to use.  Following from the example in (3) above, I think the next component is <code>component[3]</code>.</p>\n</li>\n<li>\n<p>Thanks for hints regarding where to track down some of these unhelpful error messages.  We'll see what we can do about that.</p>\n</li>\n</ol>",
        "id": 217939759,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1606338592
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191469\">Chris Moesel</span> <a href=\"#narrow/stream/215610-shorthand/topic/need.20better.20error.20than.20null.20object/near/217939759\">said</a>:</p>\n<blockquote>\n<ol start=\"3\">\n<li>\n<p>Slices do make this interesting for sure.  If you have a slice that allows multiple cardinality, then you index into the slice's sub-section using indexes after the slicename.  E.g., <code>component[sliceA][0]</code>, <code>component[sliceA][1]</code>, <code>component[sliceB][0]</code>, etc.</p>\n</li>\n<li>\n<p>In the example above, if you also want to add items that don't fit into a defined slice (so you can't reference them by name), I think you probably have to do math and figure out the right index to use.  Following from the example in (3) above, I think the next component is <code>component[3]</code>.</p>\n</li>\n</ol>\n</blockquote>\n<p><span aria-label=\"scared\" class=\"emoji emoji-1f628\" role=\"img\" title=\"scared\">:scared:</span></p>",
        "id": 217944935,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1606342084
    },
    {
        "content": "<p>Along with detecting skipped array indices, it would be nice to detect repeated assignment and/or duplicated indices. For example, if I have the following line in my questionnaire twice, it is probably an error.</p>\n<div class=\"codehilite\"><pre><span></span><code>* item[4].item[2].type    =  ...\n</code></pre></div>\n<p>Two occurrences of this line likely mean: </p>\n<ul>\n<li>I've misnumbered something and the two occurrences should be referring to different items</li>\n<li>The assigned values are identical, and one occurrence is therefore redundant</li>\n<li>The assigned values are different, and one occurrence is therefore misleading.</li>\n<li>It is an erroneous attempt to set multiple values in an array.</li>\n</ul>\n<p>Although I first thought of this in the array context, I don't see why it wouldn't also apply to any assignments.</p>\n<p>I don't have a use case for why someone would want to have duplicate assignment, but I suggest only making this a warning, just in case.</p>",
        "id": 218132890,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1606515255
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> -- I can think of one use case, but really it's almost more of an artifact of how SUSHI is implemented.  If a <code>RuleSet</code> has several rules, including assignments, then maybe someone would want to insert the rule set and then override one or more of the assignments.  Looking at the FSH where the rule set is used, you would not see the duplication -- but after expansion, it is there.  That said, we could probably be smart enough to detect that specific case and not warn on it.</p>",
        "id": 218227173,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1606679254
    },
    {
        "content": "<p>If this is a feature you would like, please feel free to log an issue over at <a href=\"https://github.com/FHIR/sushi/issues\">https://github.com/FHIR/sushi/issues</a></p>",
        "id": 218227190,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1606679271
    }
]