[
    {
        "content": "<p>My project (minimum example <a href=\"https://github.com/mjhcorporate/sushi-mwe\">here</a>) contains resources in a subfolder <code>input/resources/nested</code>. If I understand the <a href=\"https://github.com/FHIR/sushi/releases/tag/v2.3.0\">documentation of the newest sushi release v.2.3.0</a> correctly, I should be able to silence possible warning by adding the following snippet to <code>sushi-config.yaml</code>:</p>\n<div class=\"codehilite\"><pre><span></span><code>parameters:\n  path-resource:\n    - input/resources/nested\n</code></pre></div>\n<p>However, the warning about unsupported folders still comes up: </p>\n<div class=\"codehilite\"><pre><span></span><code>The following files were not added to the ImplementationGuide JSON because they are not in one of the supported input folders or are nested too deep in one of those folders. While SUSHI automatically supports resources in sub-folders, the IG Publisher does not, unless the folder is explicitly added via the template or an IG parameter. To fix any issues you may encounter due to this, adjust your IG parameters or template accordingly or move these files so they are directly under a supported input folder (e.g., input/resources, input/profiles, etc.):\n  - /Users/I501618/SAPDevelop/health/TESTS/mwe/input/resources/nested/StructureDefinition-MyPatient.json\n</code></pre></div>\n<p>Are \"nested\" folders in <code>input/resources</code> officially not supported and/or recommended?</p>\n<p>Related question (more of a nitpick, really...): Reading the related documentation about the <a href=\"https://confluence.hl7.org/display/FHIR/Implementation+Guide+Parameters\">IG Publisher Parameters</a>, it seems that if the user specifies a <code>path-resource</code>-parameter, then the default location (<code>input/resources</code>) is ignored by the IG Publisher (this is my interpretation of the docs -- I have not tried this yet!). In contrast to this, sushi seems to interpret user-specified <code>path-resource</code>-parameters as _additional_ folders. Is this the intended behavior or am I misunderstanding something?</p>",
        "id": 274334692,
        "sender_full_name": "Martin Höcker",
        "timestamp": 1646609200
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"217988\">@Martin Höcker</span>.  These are excellent questions.</p>\n<ol>\n<li>\n<p>I think that the behavior with <code>intput/resources/nested</code> is <em>unintentional</em>.  I think that is a use case that probably should work but we missed it.  We'll have to take a look at that.</p>\n</li>\n<li>\n<p>Regarding whether <code>path-resources</code> defines <em>additional</em> paths or replaces the default paths... I think we assumed it is additional paths based on some prior conversations.  I wouldn't trust the doc too much, as it says the default is \"\\resources\", but our experience is that it is <code>\\input\\resources</code>, and also includes a number of other folders like <code>\\input\\profiles</code>, <code>\\input\\extensions</code>, <code>\\input\\vocabulary</code>, etc.  That said, there is some interplay between the <em>templates</em> and the <em>publisher</em>, so that may be what we're seeing here.  Anyway, we'll double-check our assumption and let you know what we find.</p>\n</li>\n</ol>",
        "id": 274402585,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1646665001
    },
    {
        "content": "<p><a href=\"https://github.com/FHIR/sushi/issues/1037\">SUSHI-1037</a> and <a href=\"https://github.com/FHIR/sushi/issues/1038\">SUSHI-1038</a></p>",
        "id": 274427454,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1646674345
    }
]