[
    {
        "content": "<p>Hi All.<br>\nI'm brand new to FHIR and even newer to FSH. I'm really trying to teach it to myself but it's hard going. The documentation seems to be geared towards veteran programmers only and while I am a fairly decent one, mostly in python, some of the text I simply cannot understand and honestly, it feels like banging my head against a wall...</p>\n<p>Right now I am breaking my brain trying to understand what the caret symbol means. I read it several times but I really need a down to earth explanation. Unfortunately, the tutorial doesn't address this.<br>\nAlso what is the difference between \"^\" and \". ^\"?<br>\nSorry, i know this probably trivial stuff but I am trying to prove to the Israeli MOH that FSH is the way to go (They have only just begun defining the national core patient) and if I cannot understand it myself, I certainly cannot explain it.<br>\nThanks kindly!</p>\n<p>Another thing. the FSH tutorial comes with an automatic publisher. Is it possible to re-use it for any project or is it only meant for the tutorial. I suddenly realize now that when I showed it to people and said \"look! there is even a tool that automatically produces the published IG!\" I might have been very wrong about this. If this isn't the case, does this mean I must learn all the ins and outs of ig publishing or are there already automatic tools for this kind of thing?</p>\n<p>Also, I  ran the goFSH tutorial and was surprised to find that not all the info in the  original JSON file actually got converted to FSH.  A LOT of information. And this is the file made by the tutorial! So where does all that missing information go? How it it decided what stays and what not?</p>\n<p>Thank you for your time!</p>",
        "id": 223762461,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1611425748
    },
    {
        "content": "<p>i'll answer the part about the publisher - you can use SUSHI independently to take your FSH files and create inputs for the IG Publisher or just to create profiles, examples, value sets, code systems, etc. that you could use in other projects.  Or you can use the IG Publisher which automatically recognizes that you have FSH files (if you have put them in the proper places) and will convert them to FHIR artifacts and then create a full-blown FHIR Implementation Guide.</p>",
        "id": 223762583,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611425922
    },
    {
        "content": "<p>Ok. Not what I was hoping to hear (unless I missunderstod you, I'm going to have to learn the publisher, no matter if I use fsh or not... right? There is no like... easy to use automated tool. I'm looking at the documentation and it seems like there is quite a lot to learn there). <br>\nNo answer regarding the \"^\" vs \".^\"?  Sorry. It's just - It's been a while since I've felt like a complete idiot :)</p>",
        "id": 223773540,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1611433529
    },
    {
        "content": "<p>it depends on what you are using FSH for.  Are you using it to make example FHIR instances?  Or are you using it to make FHIR artifacts that will then go into the creation of a FHIR Implementation Guide?  If you tell us what you want to use your FSH artifacts for, we can tell you what tools you would need.</p>",
        "id": 223773616,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611433635
    },
    {
        "content": "<p>To make my question regarding the publisher more coherent - does the publisher produce html and all the different resources that the tutorial publisher produces? I'm talking about creating resources. I want to show the nice people in the ministry of health here that FSH will make  the process easier and I want to be able to say - \"here, look\" and have a ready made page that looks like every other FHIR documentation page. The tutorial came with a built in tool that does that but apparently it's configured very specifically only for the tutorial.</p>",
        "id": 223773710,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1611433773
    },
    {
        "content": "<p>Here are answers to some of your other questions (I was in a meeting so couldn't find links and such and it is the weekend so others are probably busy):<br>\n^ <a href=\"https://build.fhir.org/ig/HL7/fhir-shorthand/reference.html#caret-paths\">https://build.fhir.org/ig/HL7/fhir-shorthand/reference.html#caret-paths</a>. It is used to reference the FHIR item that is going to represent the thing you are creating.  So if you are creating a FHIR profile but need to specify pieces of the underlying StructureDefinition that will represent your Profile, you use the ^ path to get to that.<br>\n.  ^. is a special case for setting properties of the first element of a Structure Definition.</p>",
        "id": 223773788,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611433845
    },
    {
        "content": "<p>i don't think that the tutorial comes with a built-in tool but I'll confess to not following the tutorial in a long time.  When I look at the tutorial on <a href=\"http://fshschool.org\">fshschool.org</a>, it uses the regular IG publisher (that is what is being run when you execute the _genonce script).</p>",
        "id": 223773925,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611434010
    },
    {
        "content": "<p>Step 5 of the tutorial around generating the sample IG is just downloading the regular FHIR IG publisher tool and then running it.</p>",
        "id": 223773999,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611434083
    },
    {
        "content": "<p>as to GoFSH - there is a lot of FHIR \"stuff\" that is contained in a StructureDefinition that is extrapolated by the easier syntax of FSH.  As an example, a profile StructureDefinition will have both a snapshot and a differential view.  Armed with the FSH definition of the profile and the resource definition that the profile is based on, you can generate the snapshot from the differential, so we don't express both of those in FSH.  So a lot of the stuff that goes into a Profile StructureDefinition is generated by SUSHI so doesn't have to come across in the FSH file.  And that is actually the point of FHIR Shorthand - it means that we as authors don't need to know the syntax of a StructureDefinition unless you need to for more complicated things.</p>",
        "id": 223774188,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1611434375
    },
    {
        "content": "<p>Hello Kippi, <a href=\"https://fshschool.org/docs/tutorials\">the tutorial</a>, walks you through the process of generating a simple implementation guide. If you can get through that successfully, then you can use exactly the same process to produce any IG. As Jean said, it uses the standard IG Publisher tool.<br>\nThe caret syntax is rather specialized, and to use it, you have to know something about the StructureDefinition resource. It is something like \"direct line\" to the StructureDefinition. If possible, I would stay away from that until you get comfortable with other parts of the FSH language.</p>",
        "id": 223774285,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1611434503
    },
    {
        "content": "<p>Thanks for all the responses!<br>\nregarding the publisher,  it came bundled with the tutorial files so maybe that's what threw me off. I'll try installing and see if that will work. Will return with results.</p>",
        "id": 223776478,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1611436511
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"380122\">@Kippi Bordowitz</span> I often find it helpful to look at examples from other IGs that use FSH. If you haven’t found it already, there’s a list of these IGs here: <a href=\"https://fshschool.org/fsh-finder/\">https://fshschool.org/fsh-finder/</a></p>",
        "id": 223830133,
        "sender_full_name": "Max Masnick",
        "timestamp": 1611515943
    },
    {
        "content": "<p>Neato! I didn't know about fsh-finder, thanks <span class=\"user-mention\" data-user-id=\"322501\">@Max Masnick</span></p>",
        "id": 223846176,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1611536163
    },
    {
        "content": "<p>I disagree regarding what you said about the tutorial. the publisher is already set up automatically. There is no tutorial, that I am aware of, that actually explains how to use it, other than running the <code>_genounce.bat</code> file.  And if I am to understand correctly from reading the documentation, what they use is deprecated. But I'm still trying to wrap my brain around it.</p>",
        "id": 223887364,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1611576352
    },
    {
        "content": "<p>Not sure it matters What I do to make my own life simpler (after installing the dependencies):<br>\nI just have an empty IG structure (as a github template). When I  download and run it  it generates a working, empty IG. <br>\nI use it when I give training - if that thing fails, it's their machine that is broken, not the IG. And this ensures all IGs for a given institution are consistent.<br>\nThen, editors just add fsh files, diagrams, pages...</p>",
        "id": 223897041,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611581648
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"380122\">@Kippi Bordowitz</span> -- The FSH Tutorial starter zip comes with publisher <em>scripts</em> that can then download the actual publisher and invoke it.  There is not a lot to the scripts except to bootstrap those things.  The publisher itself is developed and maintained by the core FHIR team.  The scripts/publisher are <em>not</em> deprecated, although the scripts in the tutorial zip might be an older version.</p>\n<p>SUSHI now has a feature to create a starter project for you -- so you might find that helpful.  Just run <code>sushi --init</code> and it will build a project structure with a baseline config file, starter FSH file, and the latest versions of the publisher scripts (which are now also self-updating).  This is what we recommend for new projects.</p>\n<p>You can also always download the latest scripts from here: <a href=\"https://github.com/HL7/ig-publisher-scripts\">https://github.com/HL7/ig-publisher-scripts</a>.  But if you use <code>sushi --init</code> and then allow the scripts to self-update whenever you run <code>_updatePublisher</code> then you shouldn't need to go to the GitHub location.</p>",
        "id": 223902634,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611584396
    },
    {
        "content": "<p>Cool. Thanks. Will give it a try</p>",
        "id": 223902820,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1611584476
    },
    {
        "content": "<p>OK. Some success! <br>\nBut the page looks nothing (or not much) like a standard FHIR page. I see all the resources needed for it in the output folder but right now it looks like this ( <a href=\"/user_uploads/10155/zvH7-mdS_gD1EN6hdlDGL6cJ/temp.JPG\">temp.JPG</a> ). <br>\nI have no real experience with front end programming but I have a feeling that it's more a config thing than anything else. Am I right? I am showing this to Israeli ministry of health tomorrow and would love for it to actually resemble other FHIR pages.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/zvH7-mdS_gD1EN6hdlDGL6cJ/temp.JPG\" title=\"temp.JPG\"><img src=\"/user_uploads/10155/zvH7-mdS_gD1EN6hdlDGL6cJ/temp.JPG\"></a></div>",
        "id": 223905881,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1611585814
    },
    {
        "content": "<p>The look and feel of the page is controlled by the template.  There are several templates you can choose from, based on the type of IG you are creating.  Have a look at the <a href=\"https://build.fhir.org/ig/FHIR/ig-guidance/index.html\">Guidance for IG Creation</a> documentation.  It lists a set of common templates.  Once you identify a template you want to use, you specify it in your project's <code>ig.ini</code> file.  In your case, the <code>hl7.fhir.template</code> template will give you the look of other FHIR pages -- but note that it really is only appropriate if you will be publishing your IG through HL7.  But for a demonstration of what is possible, I'm sure it will be fine.  In the future, if you choose, you can even design your own template.</p>",
        "id": 223910757,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611587858
    },
    {
        "content": "<p>Great. Will give it a look. Thanks again for all your patience!</p>",
        "id": 223911507,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1611588172
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>   weird. Once I changed the template the _genounce failed. Copied it perfectly.</p>",
        "id": 223914889,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1611589476
    },
    {
        "content": "<p>As for <code>^</code>, hopefully some of the remarks above helped, but if not...  Think of most of FSH as being a higher-level language for doing common profiling tasks.  There is a nice syntax for binding value sets, assigning fixed values, narrowing data types, etc.  But it is a higher level language; behind the scenes, it is really creating and manipulating information in the <a href=\"http://hl7.org/fhir/R4/structuredefinition.html\">StructureDefinition</a> format.</p>\n<p>For example, consider this rule from a profile on <code>Observation</code>:</p>\n<div class=\"codehilite\"><pre><span></span><code>* code from SomeValueSet (preferred)\n</code></pre></div>\n<p>That is shorthand for saying to find (or create) the element in the <code>differential.element</code> array whose <code>path</code> is <code>Observation.code</code>, and then set the <code>binding.valueSet</code> to the canonical URL of <em>SomeValueSet</em> and set the <code>binding.strength</code> to <code>preferred</code>.  It would result in a JSON <a href=\"http://hl7.org/fhir/R4/elementdefinition.html#ElementDefinition\">ElementDefinition</a> in the profile <a href=\"http://hl7.org/fhir/R4/structuredefinition.html\">StructureDefinition</a> something like this:</p>\n<div class=\"codehilite\" data-code-language=\"JSON\"><pre><span></span><code><span class=\"p\">{</span>\n  <span class=\"nt\">\"id\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Observation.code\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"path\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Observation.code\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"binding\"</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n    <span class=\"nt\">\"valueSet\"</span><span class=\"p\">:</span> <span class=\"s2\">\"http://example.org/ValueSet/SomeValueSet\"</span><span class=\"p\">,</span>\n    <span class=\"nt\">\"strength\"</span><span class=\"p\">:</span> <span class=\"s2\">\"preferred\"</span>\n  <span class=\"p\">}</span>\n<span class=\"p\">}</span>\n</code></pre></div>\n<p>Many FSH rules are a lot more complicated than this, but I've intentionally chosen a simple one so you can easily see how the high-level FSH <code>from</code> rule translated to the formal definition in the StructureDefinition.  Notice that you didn't need to know how a binding works in the SD (i.e., you didn't need to know about the <code>binding</code> object or <code>valueSet</code> / <code>strength</code> properties -- nor did you need to fully write out the canonical URL of the VS).  The high-level FSH rules abstract that from you.</p>\n<p>BUT... if you <em>did</em> want to manipulate the StructureDefinition more directly, and control the exact values of those exact properties in that element, you could have done this instead:</p>\n<div class=\"codehilite\"><pre><span></span><code>* code ^binding.valueSet = &quot;http://example.org/ValueSet/SomeValueSet&quot;\n* code ^binding.strength = &quot;preferred&quot;\n</code></pre></div>\n<p>The above <code>^</code> rules have the same exact result as the higher-level <code>from</code> rule.  They say to first find the <code>Observation.code</code> element, and then within that element <em>in the StructureDefinition source</em>, find the  <code>binding.valueSet</code> and <code>binding.strength</code> properties and set them to the specified values.  So you can see, we're going from the higher-level abstract syntax to a lower-level \"directly manipulate the actual SD code\" syntax.</p>\n<p>Of course, when a higher-level approach works, you should use it.  So I would never expect someone to do a value set binding like that.  So here is an example of a more realistic use... If you look at the <a href=\"http://hl7.org/fhir/R4/elementdefinition.html#ElementDefinition\">ElementDefinition</a> structure, you can see that each element's <code>binding</code> also supports an optional <code>description</code> property -- which is <em>not</em> accessible via the higher level FSH syntax (since its use is more rare).  If you wanted to set the binding's <code>description</code>, then your only option is to use the <code>^</code> syntax to directly set it in the StructureDefinition.  In this case, you might use both a higher-level FSH rule to set the binding value set and strength <em>and</em> a caret rule to set the description:</p>\n<div class=\"codehilite\"><pre><span></span><code>* code from SomeValueSet (preferred)\n* code ^binding.description = &quot;Very special codes I&#39;ve selected myself&quot;\n</code></pre></div>\n<p>resulting in:</p>\n<div class=\"codehilite\" data-code-language=\"JSON\"><pre><span></span><code><span class=\"p\">{</span>\n  <span class=\"nt\">\"id\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Observation.code\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"path\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Observation.code\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"binding\"</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n    <span class=\"nt\">\"valueSet\"</span><span class=\"p\">:</span> <span class=\"s2\">\"http://example.org/ValueSet/SomeValueSet\"</span><span class=\"p\">,</span>\n    <span class=\"nt\">\"strength\"</span><span class=\"p\">:</span> <span class=\"s2\">\"preferred\"</span><span class=\"p\">,</span>\n    <span class=\"nt\">\"description\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Very special codes I've selected myself\"</span>\n  <span class=\"p\">}</span>\n<span class=\"p\">}</span>\n</code></pre></div>",
        "id": 223916441,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611590134
    },
    {
        "content": "<p>As for the different path syntaxes, using a profile on <code>Observation</code> as an example:</p>\n<ul>\n<li><code>^publisher = \"Acme, Inc.\"</code> --&gt; search from the top-level of the StructureDefinition for a property called <code>publisher</code> and set it.</li>\n<li><code>. ^short = \"My profile short description\"</code> --&gt; find or create the root element in the <code>differential.element</code> array (e.g., w/ <code>\"path\": \"Observation\"</code>) and set its <code>short</code> property.</li>\n<li><code>code ^short = \"My code element short description\"</code> --&gt; find or create the element w/ <code>\"path\": \"code\"</code> and set its <code>short</code> property.</li>\n</ul>\n<p>Excluding all the other elements (for brevity), your SD would have at least these things based on those rules:</p>\n<div class=\"codehilite\" data-code-language=\"JSON\"><pre><span></span><code><span class=\"p\">{</span>\n  <span class=\"nt\">\"id\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Observation\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"publisher\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Acme, Inc.\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"differential\"</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n    <span class=\"nt\">\"element\"</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n      <span class=\"p\">{</span>\n        <span class=\"nt\">\"id\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Observation\"</span><span class=\"p\">,</span>\n        <span class=\"nt\">\"path\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Observation\"</span><span class=\"p\">,</span>\n        <span class=\"nt\">\"short\"</span><span class=\"p\">:</span> <span class=\"s2\">\"My profile short description\"</span>\n      <span class=\"p\">},</span>\n      <span class=\"p\">{</span>\n        <span class=\"nt\">\"id\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Observation.code\"</span><span class=\"p\">,</span>\n        <span class=\"nt\">\"path\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Observation.code\"</span><span class=\"p\">,</span>\n        <span class=\"nt\">\"short\"</span><span class=\"p\">:</span> <span class=\"s2\">\"My code element short description\"</span>\n      <span class=\"p\">}</span>\n    <span class=\"p\">]</span>\n  <span class=\"p\">}</span>\n<span class=\"p\">}</span>\n</code></pre></div>",
        "id": 223918694,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611590764
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"380122\">Kippi Bordowitz</span> <a href=\"#narrow/stream/215610-shorthand/topic/Noob.20questions/near/223914889\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191469\">Chris Moesel</span>   weird. Once I changed the template the _genounce failed. Copied it perfectly.</p>\n</blockquote>\n<p>I'm guessing that it's because your IG <code>id</code> doesn't match the rules that the HL7 FHIR template requires.  If you look at the last few lines in the output, you'll probably see an error message something like this:</p>\n<blockquote>\n<p>[xslt] Loading stylesheet /Users/cmoesel/dev/fsh/TestFHIRTemplate/template/scripts/onGenerate.genProperties.xslt<br>\nWhen using the HL7 template, the IG id must start with \"hl7.\" - found fhir.example</p>\n</blockquote>\n<p>The HL7 FHIR template requires the IG id to follow the form: <code>hl7.{family}.{realm}.{id}</code>.  For example: <code>hl7.fhir.uv.example</code>.  To fix this, you need to edit the id in two files:</p>\n<p><strong>Within sushi-config.yaml:</strong></p>\n<div class=\"codehilite\" data-code-language=\"YAML\"><pre><span></span><code><span class=\"nt\">id</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">hl7.fhir.uv.example</span>\n</code></pre></div>\n<p><strong>Within ig.ini:</strong></p>\n<div class=\"codehilite\" data-code-language=\"INI\"><pre><span></span><code><span class=\"na\">ig</span> <span class=\"o\">=</span> <span class=\"s\">fsh-generated/resources/ImplementationGuide-hl7.fhir.uv.example.json</span>\n</code></pre></div>\n<p>After that it should work.</p>",
        "id": 223922698,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611592163
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>  Wow, thanks a million. Just came out of a 5 hour power outage and it's 22:00 so I think I'll wait till tomorrow haha. But once again - I really appreciate it all!</p>",
        "id": 223950583,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1611604331
    },
    {
        "content": "<p>To touch on one thing that was sort of glossed over in the other answers, the <a href=\"http://_genonce.sh\">_genonce.sh</a> script, etc. are wrappers around the IG publisher. 99% of the time, they provide the correct parameters to the Java publisher with. Most of the rest of the time, you can pass command line arguments to the script to get the specific behaviour you want. It is only in a very small set of cases that you would need to invoke the publisher.jar directly, supplying  all the parameters yourself.</p>\n<p>Also, if you decide to customize the template, it isn't hard, but it isn't well documented. My best suggestion is to start (here)[https://build.fhir.org/ig/FHIR/ig-guidance/template.html] and look at some of the other examples.</p>",
        "id": 223966248,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1611611758
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> thanks!</p>",
        "id": 224017413,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1611655040
    },
    {
        "content": "<p>Ok. New noob question:<br>\nI'm using a HAPI server and my partner and I are running into this problem we can't figure out:</p>\n<p>I'm trying to understand the purpose of the url field in a ValueSet. I thought it is used as the canonical URL of the ValueSet, the one to which bindings point, for example, but it seems that the server looks at the binded url as an actual resource address.<br>\nIn profiles on the other hand, the server finds the local StructureDefinition resource by it's url attribute, even if the this url leads to nowhere.<br>\nWhat is behind this defference in bahaviour, and  what the value set's url attribute is used for?</p>",
        "id": 225079169,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1612385331
    },
    {
        "content": "<p>this looks like a question that should be on the <a class=\"stream\" data-stream-id=\"179167\" href=\"/#narrow/stream/179167-hapi\">#hapi</a>  stream</p>",
        "id": 225079884,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612385636
    },
    {
        "content": "<p>but your understanding is correct.</p>",
        "id": 225079940,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612385644
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  thanks.. [slaps forehead] Of course :)</p>",
        "id": 225116824,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1612411652
    }
]