[
    {
        "content": "<p>What is the timeline for native support of OperationDefinition in Sushi, similar to how Sushi has made StructureDefinition more easy?</p>",
        "id": 196218524,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588615874
    },
    {
        "content": "<p>Hi John, right now we don't have a timeline for anything beyond approaching OperationDefinition as a instance. I know we batted around some fancier approaches a few months ago, but I don't have a clear idea what approach would look like, exactly. What would be your recommendation to make it easier?</p>",
        "id": 196224706,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1588618580
    },
    {
        "content": "<p>I'll definitely have some thoughts when I get further along in SANER, as I know of at least two operations that need further definition.</p>",
        "id": 196361807,
        "sender_full_name": "Keith Boone",
        "timestamp": 1588710070
    },
    {
        "content": "<p>Using the Instance method in FSH is not adding any value. I will leave my OperationDefinitions in XML... OH, right... I have to convert them to JSON for  sushi to be able to copy the folder to the IG build...  Why does sushi require json, when all it is doing is copying them to the IG build directory?</p>",
        "id": 196648591,
        "sender_full_name": "John Moehrke",
        "timestamp": 1588777893
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/215610-shorthand/topic/OperationDefinition.20in.20Sushi/near/196648591\" title=\"#narrow/stream/215610-shorthand/topic/OperationDefinition.20in.20Sushi/near/196648591\">said</a>:</p>\n<blockquote>\n<p>Why does sushi require json, when all it is doing is copying them to the IG build directory?</p>\n</blockquote>\n<p>This is because, in some cases, SUSHI requires JSON because it's actually doing more than just copying the files.  If you bring your own profile (as XML) and you want to reference it from FSH (as a parent for example), then SUSHI needs to be able to process that parent profile in its entirety (understanding its resource types, constraints, etc).  Since SUSHI only understands JSON, it needs the profile to be in JSON in order to understand it.  Similarly, for instances, if you want to reference an instance that is in XML, then SUSHI can't process the instance to validate (a) that it exists at all (by it's type and id), and (b) that it is a valid type for where it is being used.  Last, when SUSHI is building up the ImplementationGuide, it needs to look into the user-provided files to get metadata to properly populate the ImplementationGuide resources.</p>\n<p>All that being said, I agree that it is an unfortunate limitation and that we should try to address it.  We basically need to find or implement a FHIR XML-&gt;JSON converter in JavaScript.  <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> has pointed me to some (non-JavaScript) code he wrote for this and we have also made a note to look at the VS Code fhir plugin source to see if it already has code for it.  So... it's on the list of things to do.  In the mean time, you could use one of the available tools or plugins to convert your XML to JSON.</p>",
        "id": 196653880,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1588779916
    }
]