[
    {
        "content": "<p>I'm just seeing a new HL7 Publication rule that the package-list.json needs a category.  This must be a new thing because I've never seen this message before.  From what I can see, SUSHI won't produce this new field at all.</p>",
        "id": 210094209,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600151215
    },
    {
        "content": "<p>yes it's new. What I don't understand is why package-list.json has anything at all to do with FSH</p>",
        "id": 210094448,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600151523
    },
    {
        "content": "<p>it doesn't have anything to do with FSH.  but SUSHI has a mode that will generate all of the IG \"control files\" for us.  and many of us use it for that.</p>",
        "id": 210094470,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600151564
    },
    {
        "content": "<p>well, that particular file <em>should not</em> be generated</p>",
        "id": 210094492,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600151621
    },
    {
        "content": "<p>agree to disagree, I guess.  because I drive all of my control files - package-list.json, ImplementationGuide-xxx, ig.ini, menu.xml - from one central config file and I like it that way</p>",
        "id": 210094667,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600151792
    },
    {
        "content": "<p>perhaps you should have asked why I disagree. The workflow for that particular file is quite different to any other file, and you <em>don't author it</em></p>",
        "id": 210094686,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600151834
    },
    {
        "content": "<p>I just deleted the file, ran the publisher without sushi and it complains that there isn't a package-list.json.</p>\n<p>If package-list.json is no longer needed, then the \"file not found\" error should probably be changed and the SUSHI team should be told that they can stop generating it.</p>",
        "id": 210094970,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600152133
    },
    {
        "content": "<p>I didn't say it wasn't needed, just that you don't author it. And I already asked the sushi team to stop generating it, but they ignored me</p>",
        "id": 210094984,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600152167
    },
    {
        "content": "<p>huh?  it's needed, but I don't author it?  where do I get it from then?</p>",
        "id": 210095005,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600152193
    },
    {
        "content": "<p>I just checked all of my other non-SUSHI guides and I authored package-list.jsons there, so I'm missing what you're saying (probably because it's late for me)</p>",
        "id": 210095035,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600152232
    },
    {
        "content": "<p>when you are going to ask for a new release, you download the latest copy from the canonical URL, and then enter the details that are appropriate for your new release.</p>",
        "id": 210095083,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600152249
    },
    {
        "content": "<p>it's not a great way to do it, but I haven't figured out how to do it right - it is just the 6 pieces of information the publishing process needs to execute. It really should be part of some 'publish me' form.</p>",
        "id": 210095113,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600152297
    },
    {
        "content": "<p>so it's likely to go away. But you certainly cannot change anything else about it other than enter the new release details.</p>",
        "id": 210095148,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600152350
    },
    {
        "content": "<p>which is why I say 'you don't author it' and sushi shouldn't try generating it</p>",
        "id": 210095192,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600152367
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> given the above, rather than adding category to the outputted package-list.json, it appears that you need to just stop generating that file altogether as it's not needed to do an actual publishing run and is only needed if you are publishing guides to HL7.</p>",
        "id": 210095274,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600152481
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> -- thanks for tagging me.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> -- I apologize, as I think perhaps we've miscommunicated in the past, as we didn't intend to ignore you re: <code>package-list.json</code>.</p>\n<p>I'm still not sure I fully followed the conversation above, however.  As far as I can tell, HL7 packages still require package-list.json, and HL7 authors are still required to maintain it.  For example, Eric Haas just updated the US Core package-list.json only six weeks ago.  Are you saying that something changed in the last 6 weeks?  And if so, and if the publisher still complains about it, we should just direct authors to ignore that?</p>",
        "id": 210121131,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1600172569
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> The publisher doesn't really complain about it.  There is a note in the qa.html if you don't have that file and it is labeled as HL7 Publishing Rules.  My take is that if you weren't publishing on HL7 you wouldn't need this file at all.  And if you are publishing, it will be created for you and updated when you are actually publishing.  So it's not actually needed for ongoing guide development.</p>",
        "id": 210138243,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600180702
    },
    {
        "content": "<p>The HL7 template <em>does</em> need it as an input because it drives the Jira spec file generation (specifically, the list of versions to include in the dropdown).  So the file does need to exist in your base folder.</p>",
        "id": 210140252,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600181565
    },
    {
        "content": "<p>That's different from whether Sushi should be generating it.</p>",
        "id": 210140283,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600181578
    },
    {
        "content": "<p>Right, to summarize:<br>\nBuilding non-HL7 IG - no package-list.json needed<br>\nBuilding HL7 IG - package-list.json not needed during development but needed before being published and for use in HL7 JIRA.</p>",
        "id": 210142216,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600182384
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/215610-shorthand/topic/Package-list.2Ejson.20missing.20category/near/210140252\">said</a>:</p>\n<blockquote>\n<p>The HL7 template <em>does</em> need it as an input because it drives the Jira spec file generation (specifically, the list of versions to include in the dropdown).  So the file does need to exist in your base folder.</p>\n</blockquote>\n<p>This is for the HL7 templates only -- what is the requirement/need for the file for non-HL7 IGs?</p>",
        "id": 210142825,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1600182585
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/215610-shorthand/topic/Package-list.2Ejson.20missing.20category/near/210095083\">said</a>:</p>\n<blockquote>\n<p>when you are going to ask for a new release, you download the latest copy from the canonical URL, and then enter the details that are appropriate for your new release.</p>\n</blockquote>\n<p>It seems we keep overloading the meaning of canonical URLs. Is this a requirement that the canonical URL must actually resolve?</p>",
        "id": 210143140,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1600182713
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/215610-shorthand/topic/Package-list.2Ejson.20missing.20category/near/210140283\">said</a>:</p>\n<blockquote>\n<p>That's different from whether Sushi should be generating it.</p>\n</blockquote>\n<p>OK, so just to clarify... when we talk about SUSHI \"generating\" <code>package-list.json</code> -- we're talking about SUSHI taking the history data that the author explicitly writes in the <code>config.yaml</code> and translating it to a <code>package-list.json</code> file.  The author is still providing all of the relevant data -- so think of it more as a different package-list authoring format than SUSHI \"generating\" the file out of the ether.</p>\n<p>Anyway -- I still feel like there is conflicting information regarding whether it's needed and when it's needed.  I get that it's only needed for HL7 projects. ; that is clear.  But whether it's cool to have <em>no package-list.json</em> until the very last moment before publishing it for the first time is still unclear to me.  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> -- when you say \"the HL7 template <em>does</em> need it\", do you mean it _eventually_ needs it (at least by publish time) -- or do you mean it should have it from day 1?</p>",
        "id": 210179475,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1600198788
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> non-HL7 projects do not require to have package-list.json but I would highly recommend having it, and following the HL7 publishing pattern; there is a very mature bunch of tools to support that. Part of that is that the canonical URL always does (and SHALL) for HL7 IGs. I also highly recommend this.</p>",
        "id": 210182253,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600200046
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> the thing that's different about the package-list.json is the source of truth. The author can't actually make (or correct) entries in it. The publishing process owns it. If you make the author recreate the data elsewhere so that your process can correctly recreate the file, then you're just forcing them to do make work because they don't have any say in what it says</p>",
        "id": 210182497,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600200134
    },
    {
        "content": "<p>Presumably the long-term solution will be for the publishing tool to just do a GET to pull it back when generating the Jira file?</p>",
        "id": 210183239,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600200426
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> -- so until the publishing process actually creates the file, it just shouldn't exist at all in the project?  Is that what you're suggesting?  Or should there be some kind of stub at least (until publishing takes it over)?</p>",
        "id": 210183354,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1600200479
    },
    {
        "content": "<p>I'm not Grahame, but that was what I understood from my conversation last night/this morning.  That it doesn't need to exist until the publishing process happens.  I tested in all of my guides sushi or otherwise and there is no consequences of not having a package-list.json for non-hl7 guides and non-published hl7 guides.  for published hl7 guides, the note in the qa.html basically says - go get the package-list.json file that is on the published site.</p>",
        "id": 210185613,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600201547
    },
    {
        "content": "<p>The requirement for the HL7 template is that it'll spit out a message in the QA until one exists - and the FMG won't let you go to ballot or publish until that message is gone.  So it won't interfere with your ability to build</p>",
        "id": 210186015,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600201720
    },
    {
        "content": "<p>OK, <a href=\"https://github.com/FHIR/sushi/issues/603\">SUSHI #603</a> indicates that support for package-list.json should be removed from SUSHI.  Thanks everyone for walking me through that.</p>",
        "id": 210187080,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1600202229
    },
    {
        "content": "<p>Is there anyway that you could incorporate this change into a 0.16.1?  I have a couple of IGuides that are close to publishing and I don't want to upgrade to 1.0.0 but I need to have SUSHI stop generating the package-list.json.</p>",
        "id": 213309475,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602690259
    },
    {
        "content": "<p>Can you just remove <code>history</code> from the <code>config.yaml</code> and provide your own <code>package-list.json</code> w/ the <code>category</code> instead?</p>",
        "id": 213322130,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1602695412
    },
    {
        "content": "<p>i'm trying that now. :)</p>",
        "id": 213322444,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602695523
    },
    {
        "content": "<p>hmm, that works just fine.  never mind my request :)</p>",
        "id": 213322906,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602695715
    },
    {
        "content": "<p>That will set you up better for 1.0.0 anyway since <code>history</code> is deprecated there.</p>",
        "id": 213323025,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1602695759
    }
]