[
    {
        "content": "<p>How can I control the section numbering of the artifacts.html page that is generated by the IG Publisher?</p>\n<p>When I do this:<br>\npages:<br>\n  index.md:<br>\n    title: Home<br>\n  downloads.md:<br>\n    title: Downloads</p>\n<p>index.md is section 1<br>\ndownloads is section 2<br>\nand the automatically generated content on artifacts.html is section 3.</p>\n<p>I want artifacts to be section 2 and downloads to be section 3.</p>",
        "id": 220037602,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1608064122
    },
    {
        "content": "<p>i'm pretty sure that if you list artifacts directly, you can control where it appears and thus what section it will be.</p>",
        "id": 220037758,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1608064200
    },
    {
        "content": "<p>This results in a sushi error: <br>\nerror File for configured page artifacts.html not found.</p>",
        "id": 220038047,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1608064322
    },
    {
        "content": "<p>ah, i didn't list it in pages, but in the menu.  just testing if I can change the section numbers that way...</p>",
        "id": 220039034,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1608064740
    },
    {
        "content": "<p>nope.  it's how it is listed in the pages section and not the menu.  now I'm interested in the right answer</p>",
        "id": 220039288,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1608064847
    },
    {
        "content": "<p>i looked at the IG resource that is produced and artifacts isn't listed there, so I suspect that it always gets the last number since it is a generated page.</p>",
        "id": 220039594,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1608064998
    },
    {
        "content": "<p>If you list artifacts in the IG, it should find it and not add it at the end</p>",
        "id": 220044320,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1608067364
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> -- this may be a current limitation in SUSHI.  It does some error checking to ensure that the pages you reference in <code>pages</code> actually exist -- but in the case of <code>artifacts.html</code>, it obviously does not exist at the time that SUSHI runs.  We may need to update SUSHI's configuration processor to allow references to pages that don't exist yet (or to specifically allow certain known generated pages).</p>",
        "id": 220044610,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1608067491
    },
    {
        "content": "<p>That list of pages that are generated may evolve (or depend on the template you're using) - perhaps good to accommodate for some flexibility?</p>",
        "id": 220046197,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1608068217
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> I think it is common (I know an idiot who did this in 3 IGs) to refer to sections in the artifacts.html file from the menus.   So, I think this use case should be accommodated.</p>",
        "id": 220050103,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1608070257
    },
    {
        "content": "<p>Yep.  I've already logged an issue against SUSHI for it.  We should have anticipated this.  I apologize!</p>",
        "id": 220053872,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1608072146
    },
    {
        "content": "<p>Glad you continue to watch out for the idiots.<br>\nI converted my 2nd IG to 1.0.0.  Made fewer mistakes, and the ones I did make were flagged by <em>excellent</em> error messages/suggestions.   No apologies necessary!</p>",
        "id": 220055111,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1608072888
    },
    {
        "content": "<p>I don't think there's anything idiotic about wanting to define page order <em>including</em> generated pages!</p>",
        "id": 220111135,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1608123088
    },
    {
        "content": "<p>Sadly can't do it with natural file order since  afiak Github sort files alphabetically.  but could consider define page order using YAML front matter so this metadata stays with the pages.</p>",
        "id": 220267991,
        "sender_full_name": "Eric Haas",
        "timestamp": 1608223326
    },
    {
        "content": "<p>I'm putting this in my bucked \"to investigate whether a Composition resource can help set the IG content\"</p>",
        "id": 220280201,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1608228584
    }
]