[
    {
        "content": "<p>What's the best way to ensure that the page numbers are consistent with the tab order?</p>",
        "id": 198263726,
        "sender_full_name": "David Hay",
        "timestamp": 1590012700
    },
    {
        "content": "<p>I think this is more of a question for <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> as I think the approach for numbering pages is governed by the templating framework (or the templates themselves).  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> -- do you have any guidance regarding how that works?  Is it documented somewhere?</p>",
        "id": 198264155,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1590012919
    },
    {
        "content": "<p>Tabs and page numbering are orthogonal.  Page numbering is driven by the hierarchy of the pages.  The main menu is driven by what things you think implementers are going to want to be able to jump to quickly.  They're not necessarily the same.  The order of stuff within the menu will typically be similar, but it won't always be the same.</p>",
        "id": 198268797,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590016220
    },
    {
        "content": "<p>Can you give more detail about how to set the page hierarchy?</p>",
        "id": 198269313,
        "sender_full_name": "David Hay",
        "timestamp": 1590016696
    },
    {
        "content": "<p>Dunno how shorthand does it, but in the ImplementationGuide, you'll have a root page (generally the table of contents) which will contain other pages (which may themselves contain other pages).  The HL7 template assigns the root page the number '0'.  The first page within it 1, the second 2, etc.  Sub pages under 1 will be 1.1, 1.2, etc.  Sections within page 1 will be 1.0.1, 1.0.2, etc.</p>",
        "id": 198280869,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590029108
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  - that explains what's happening. Is there a way to turn the numbering off? Or is it needed to change the templates? If so, then is it straightforward to do that?</p>",
        "id": 198282874,
        "sender_full_name": "David Hay",
        "timestamp": 1590031917
    },
    {
        "content": "<p>You'd have to change the templates.  It'd be a pretty significant change.  You'd have to redo all of the layouts, which is a major change.  Why don't you want the numbers?  They're super helpful when people are trying to communicate what part of the spec they're talking about...</p>",
        "id": 198284351,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590033871
    },
    {
        "content": "<p>Main reason is that they don't (in my IG) line up nicely with the tabs so it looks kinda weird that the index page is 1, but the next tab is 8 then page 5 &amp; so on.  Maybe it's just me :)</p>",
        "id": 198286388,
        "sender_full_name": "David Hay",
        "timestamp": 1590036592
    },
    {
        "content": "<p>And I take your point of the value in referring to the spec - though I suspect that people would start with the tab when pointing to a specific part...</p>",
        "id": 198286525,
        "sender_full_name": "David Hay",
        "timestamp": 1590036740
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> -- with the new SUSHI beta you have control over the page list (if you want it) -- so you could change the order of your pages to match the menu/tabs.  Alternately, you also have control over the menu, so you could change the order of the tabs to match the pages...</p>",
        "id": 198314409,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1590063979
    },
    {
        "content": "<p>The main menu tabs in the FHIR spec have never been in numeric order - and I don't think anyone's ever asked why or complained...</p>",
        "id": 198340937,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590077756
    },
    {
        "content": "<p>Well, I never noticed! So much for that issue then...  :)</p>",
        "id": 198351053,
        "sender_full_name": "David Hay",
        "timestamp": 1590082265
    }
]