[
    {
        "content": "<p>Hi. Does anyone know why I might be getting this error when running Sushi on profiles containing \"Parent: PractitionerRole\" ? <br>\nThe error is: Parent PractitionerRole not found for PractitionerRoleTest<br>\n[path shortened] /input/fsh/VJPractitionerRoleTest.fsh   Line: 2 - 6<br>\nThanks in advance.</p>",
        "id": 243906389,
        "sender_full_name": "Andy Harrison",
        "timestamp": 1624622746
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209937\">@Andy Harrison</span> - I would not expect that error.  When I do a simple test on FHSOnline (<a href=\"https://fshschool.org/FSHOnline/#/share/3wVoTRS\">link</a>), it works fine.  I can only think of two things that might cause this:</p>\n<ol>\n<li>If there is some weird hidden character that somehow snuck into that line.  To fix this, I'd delete the line with <code>Parent: PractitionerRole</code> and then retype it.</li>\n<li>If your FHIR cache is corrupted (and does not contain PractitionerRole). One way to test this is to rename your cache to something else (which is a more temporary measure than deleting it) and then try again (which will force the cache to be re-downloaded).  Your FHIR cache is typically in <code>{User Home Directory}/.fhir</code> (note: <code>{User Home Directory}</code> is different on Mac and Windows, which is why I don't specify it directly here).</li>\n</ol>",
        "id": 243911953,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1624626055
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>  - Thanks  for your quick reponse. it's a bit of. a mystery. I tried both those actions and updated the Sushi to the 2.0.0-beta.1 that I saw was running on the FSHOnline. Same error, however, so I will need to dig around a little more. I also get the error when copying across your example.</p>",
        "id": 243918622,
        "sender_full_name": "Andy Harrison",
        "timestamp": 1624629273
    },
    {
        "content": "<p>I am perplexed.  What operating system are you running on? Are you using FHIR R4? Are you using a standard <code>sushi-config.yaml</code>? Does it work ok with other resources (just not <code>PractitionerRole</code>)?  Another thing you could try is using <code>sushi --init</code> to create a brand new project, then copy/paste the definition from FSH Online into <code>input/fsh/patient.fsh</code> and see if it works.</p>",
        "id": 243919214,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1624629514
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>  I'm running MacOS 11.2.3, editing with VS Code and the FSH plugin. I have a set of 10 profiles in the project and all are running without errors except the PractitionerRole. If I create an IG with sushi --init and copy in the example for PractitionerRole on its own it works ok. But as soon as I combine it with the other profiles (patient, careplan, careteam, practitioner, group, goal etc) I get this same error even if I leave the PractitionerRole in it's most minimal form. I have tried adding the files in different orders and editing with a simple text editor but always end up with the same error once all files are added.</p>",
        "id": 244117777,
        "sender_full_name": "Andy Harrison",
        "timestamp": 1624870753
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>  Chris, I found the problem - my bad. I had named a valueset PractitionerRole in the Practitioner profile which was causing the problem. Sorry to waste yor time.</p>",
        "id": 244141451,
        "sender_full_name": "Andy Harrison",
        "timestamp": 1624885745
    },
    {
        "content": "<p>Ah-ha!  Thanks for letting me know.  It's not a waste of my time at all, because now I know what the issue is, and knowing that might help me help someone else in the future!  We can also look into this to see if it is a case we can easily identify programatically and issue a more helpful error.</p>",
        "id": 244142975,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1624886490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>  Can we make the error message more explicit? E.g., \"SUSHI found a value set named PractitionerRole but needed to find a resource named PractitionerRole\"?</p>",
        "id": 249279372,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1628795498
    },
    {
        "content": "<p>Yeah, this is logged as an issue here: <a href=\"https://github.com/FHIR/sushi/issues/858\">https://github.com/FHIR/sushi/issues/858</a> and is one of the tasks we are working on in our current sprint</p>",
        "id": 249364187,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1628863503
    }
]