[
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>error Resource at C:\\Users\\Ward\\Documents\\FHIR workspace\\R4\\SushiProject\\ig-data\\input\\resources\\ACMEUSCorePatientProfile.StructureDefinition.json must define resourceType and id.\n</code></pre></div>\n\n\n<p>Is <code>id</code> an IG publisher requirement because the files need to be renamed to <code>type-id.json</code>? Because <code>id</code> isn't mandatory, right? I generally don't fill it for profiles (I'm not a real user though).</p>",
        "id": 201018360,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1592315826
    },
    {
        "content": "<p>id is mandatory if you want to be able to reference the resource - which obviously in an IG we do</p>",
        "id": 201020835,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592316794
    },
    {
        "content": "<p>You are exactly right as to why SUSHI requires the id in that situation though. Since the IG Publisher expects files to be in the format <code>type-id.json</code>, we rename files to be in that format, so we do require that those files have an <code>id</code>. </p>\n<p>If someone was just using SUSHI to turn FSH files into JSON without any of the extra IG Publisher things I could see why you might not want to have to set an <code>id</code>. But, I'm not so sure why someone using SUSHI for that use case would even be putting resources into <code>ig-data/input/resources</code>, since generally the reason to put resources there is so that they get copied over to the <code>input/resources</code> folder that the IG Publisher will use, while also being included in the SUSHI generated IG resource.</p>",
        "id": 201022691,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1592317478
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"239822\">Nick Freiter</span> <a href=\"#narrow/stream/215610-shorthand/topic/Resource.20must.20define.20resourceType.20and.20id/near/201022691\">said</a>:</p>\n<blockquote>\n<p>the IG Publisher expects files to be in the format <code>type-id.json</code>, we rename files to be in that format, so we do require that those files have an <code>id</code>. </p>\n</blockquote>\n<p>probably not relevant but the publisher can handle files that are not named as `type-id.json/xml'. This naming convention keeps things safe, though</p>",
        "id": 201025133,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1592318496
    },
    {
        "content": "<p>I don't think it can handle files that don't have ids though</p>",
        "id": 201030149,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592320472
    },
    {
        "content": "<p>I'm 98% sure the publisher at least <em>used to</em> complain when file names did not follow the <code>type-id.json</code> format.  It sounds like maybe that's not the case anymore, but as Lloyd noted -- probably still a good idea.</p>",
        "id": 201031208,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1592320886
    },
    {
        "content": "<p>Regardless of the filename, the IG points to the included files by reference - which needs an id.</p>",
        "id": 201031807,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592321109
    },
    {
        "content": "<p>Thanks for the explanations! <span class=\"user-mention\" data-user-id=\"239822\">@Nick Freiter</span> I'm taking advantage of sushi's config.yaml, even when I only have JSON resources, to get my IG Publisher project configured <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> But it's clear I'll just have to add an <code>id</code> to make an IG.</p>",
        "id": 201166094,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1592411359
    }
]