[
    {
        "content": "<p>I upgraded my IG publisher and my sushi and I'm getting a warning on my resources about declaring its jurisdiction.  I'm assuming that this is something that SUSHI can/should do?  Or maybe I need to add this as a line to all of my resources?</p>",
        "id": 200142894,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1591643424
    },
    {
        "content": "<p>in general, you should add it to the IG resource, and then use the parameter <code>apply-jurisdiction</code> to get the IG publisher to set it on all your resources. (see <a href=\"https://confluence.hl7.org/display/FHIR/Implementation+Guide+Parameters\">https://confluence.hl7.org/display/FHIR/Implementation+Guide+Parameters</a>)</p>",
        "id": 200145915,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591645143
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> -- have a look at <a href=\"#narrow/stream/215610-shorthand/topic/Query\">this thread</a>, which is basically the same question but for <code>copyright</code> rather than <code>jurisdiction</code>.</p>",
        "id": 200148670,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1591646482
    },
    {
        "content": "<p>I was able to add them to my resources, but I can't figure out how to add the jurisdiction to the ImplementationGuide resource which is being generated.</p>",
        "id": 200148939,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1591646580
    },
    {
        "content": "<p>You need to use the beta version of SUSHI that uses the new <code>config.yaml</code>.  The <code>config.yaml</code> allows you to control the parameters in the IG file.  BTW -- we plan to bring config.yaml to an official SUSHI release tomorrow or Wednesday.</p>",
        "id": 200149150,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1591646674
    },
    {
        "content": "<p>okay, i'll wait as it's just a warning at this point (and I can't progress since there is some non-SUSHI-related bug in the template)</p>",
        "id": 200149205,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1591646704
    }
]