[
    {
        "content": "<p>Structured Definitions exist for both CDA (see ) and HL7 V2.  I'm wondering if I can \"Profile\" against those SDs in FHIR Shorthand, or create examples against them?</p>",
        "id": 189593233,
        "sender_full_name": "Keith Boone",
        "timestamp": 1583243005
    },
    {
        "content": "<p>Oh. Hmmm... that's a really interesting question.  I'm assuming that you're not talking about CDA or HL7 v2 <em>profiles</em> on FHIR resources, but rather a set of new resource definitions and/or logical models.  Is that right?</p>\n<p>We certainly haven't tested that -- but in theory I think that a lot of the same processing would apply.  For it to have any chance of working though, they'd at least have to use the FHIR data types (e.g., <code>string</code>, <code>code</code>, <code>CodeableConcept</code>, <code>Quantity</code>, etc).  And currently, we can only pull dependencies that are in <a href=\"http://fhir.packages.org\" target=\"_blank\" title=\"http://fhir.packages.org\">fhir.packages.org</a> -- so they'd either need to be there or SUSHI would need to be updated to find dependencies elsewhere...  That would be the starting point at which we could at least <em>test</em> the feasibility.</p>\n<p>All that said, we (MITRE) are currently trying to focus on the core features -- so we likely won't have time to seriously look at something like this for a while.  But it's an interesting thing to think about...</p>",
        "id": 189604839,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1583250313
    },
    {
        "content": "<p>I think the CDA SD (see <a href=\"http://build.fhir.org/ig/HL7/fhir-cda/index.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/fhir-cda/index.html\">http://build.fhir.org/ig/HL7/fhir-cda/index.html</a>) uses new data types, and I'm certain that V2 Refactored (see <a href=\"http://www.hl7.eu/refactored/hl7.html\" target=\"_blank\" title=\"http://www.hl7.eu/refactored/hl7.html\">http://www.hl7.eu/refactored/hl7.html</a>)</p>",
        "id": 189605352,
        "sender_full_name": "Keith Boone",
        "timestamp": 1583250672
    },
    {
        "content": "<p>Sushi and the FHIR IG Builder solve a LOT of problems for HL7 if we can get it to work against those SDs...<br>\nHmmm...</p>",
        "id": 189605500,
        "sender_full_name": "Keith Boone",
        "timestamp": 1583250772
    },
    {
        "content": "<p>New data types is definitely a problem.  A lot of what SUSHI does is pretty dependent on types.  We need to know a string is a string, a Coding is a concept, a Quantity is a quantity, etc.  Abstracting that might be messy.  Not impossible (for sure), but quite potentially messy.</p>",
        "id": 189607308,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1583251790
    }
]