[
    {
        "content": "<p>It would be great if there could be a folder structure for the fsh tank. That way you could, say, separate extension definitions, profiles and instances into their own folders...</p>",
        "id": 184980091,
        "sender_full_name": "David Hay",
        "timestamp": 1578369224
    },
    {
        "content": "<p>and, perhaps, separate folders for the output as well...</p>",
        "id": 184982670,
        "sender_full_name": "David Hay",
        "timestamp": 1578373460
    },
    {
        "content": "<p>I think allowing the FSH tank to have sub-folders is a great idea.  We could certainly do a recursive survey of the tank to find all FSH files.  Using this approach, authors could organize the FSH files however they want in the tank.  Do you think that would be good?  Or would it be better to force some structure by only allowing certain subfolders (e.g., \"profiles\", \"extensions\", etc.)?</p>",
        "id": 185016849,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1578408450
    },
    {
        "content": "<p>As for the output, my only concern is we need to figure out how arbitrary folder names in the output affects IG generation.  If we can figure out a way to make it work without messing up IG generation, then I'm game.  It might not be hard, I just haven't looked into it.</p>\n<p>BTW -- thanks for all the great feedback, <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span>!</p>",
        "id": 185017021,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1578408561
    },
    {
        "content": "<p>I think a consistent folder structure would be good. Some suggestions, mostly borrowed from the IG template:<br>\ncapabilities (capstatements)<br>\nexamples (resource instances)<br>\nextensions (.)<br>\nmodels (logical models)<br>\noperations (.)<br>\nprofiles (structureDefs)<br>\nvocabulary (codesystems / valuesets)</p>",
        "id": 185018537,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578409411
    },
    {
        "content": "<p>if you keep these, it can be reused by ig template</p>",
        "id": 185018608,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578409447
    },
    {
        "content": "<p>The IG (i think) either has all resources in a \"input/resources\" folder or in \"input/profiles, etc...\"</p>",
        "id": 185018718,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578409518
    },
    {
        "content": "<p>Right.  We currently just dump everything into <code>input/resources</code>.  I think it's possible to have arbitrary folders with the template-based publishing framework too.  My one concern with forcing a specific folder structure around \"profiles\", \"extensions\", etc., is that one of the advantages of FSH is that you can group related things together into the same file -- so someone might choose to put a profile and its related extensions in the same source file, in which case its not clear which sub-folder it should go in.</p>",
        "id": 185026105,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1578413890
    },
    {
        "content": "<p>Alignment with the IG template  sounds like a good idea to me, though your point about allowing flexibility is valid (though, I'd err on the side of consistency if pushed).</p>\n<p>Couple of other things: </p>\n<ul>\n<li>Have you some examples of complex extensions? I'm having issues (see <a href=\"#narrow/stream/215610-shorthand/topic/complex.20extensions\" title=\"#narrow/stream/215610-shorthand/topic/complex.20extensions\">separate thread</a>) and <em>think</em> I've followed the pattern in the spec (though that is currently down, so not sure...)</li>\n<li>Also - have you given thought to exposing sushi functionality via a web service? I'm thinking  particularly of instance generation which I do in clinFHIR though I have issues with more complex extensions and so would be interested in alternatives. Haven't thought it through at all  - just wanting to gauge interest...</li>\n</ul>",
        "id": 185029983,
        "sender_full_name": "David Hay",
        "timestamp": 1578416271
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> -- did you see my response in the other thread about complex extensions?</p>\n<p>As for a web service, we've thought about how this might fit into the web, but right now we're focusing on core functionality before moving it to other mediums.  As a Node.js project, though, it should transfer to the web fairly easily.</p>",
        "id": 185042585,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1578423798
    },
    {
        "content": "<p>Yeah - completely appreciate that - and it is certainly a low priority...</p>",
        "id": 185043088,
        "sender_full_name": "David Hay",
        "timestamp": 1578424066
    },
    {
        "content": "<p>One thing I would like to see regarding subfolders is a clean separation between the fsh files and the /build directory. Right now, the /build is created at the same level as all the fsh files. If you have an editor directed at the folder that has the fsh files, all the build files are suddenly in scope of the editor. That's inconvenient. I'm envisioning something like this: <a href=\"/user_uploads/10155/r1x5mIrKfZgtpCEvv15Z5oxB/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/r1x5mIrKfZgtpCEvv15Z5oxB/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/r1x5mIrKfZgtpCEvv15Z5oxB/pasted_image.png\"></a></div>",
        "id": 185255935,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1578604116
    },
    {
        "content": "<p>That seems reasonable to me...</p>",
        "id": 185263269,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1578608922
    },
    {
        "content": "<p>with the generated files all in build / output ?</p>",
        "id": 185267829,
        "sender_full_name": "David Hay",
        "timestamp": 1578612379
    },
    {
        "content": "<p>But the output of sushi must be input for the ig</p>",
        "id": 185268446,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578612909
    },
    {
        "content": "<p>Here's a suggestion: a config file for sushi for the file locations</p>",
        "id": 185268482,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578612952
    },
    {
        "content": "<p>I would put the output of sushi in the folders:</p>",
        "id": 185268548,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578612991
    },
    {
        "content": "<p>StructureDefinitions - the output of sushi would be the folder ig\\input\\profiles<br>\nStructureDefinitions (for logical models) ig\\input\\models<br>\netc</p>",
        "id": 185268678,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578613108
    },
    {
        "content": "<p>Ah - input folders are input for the IG..</p>",
        "id": 185282636,
        "sender_full_name": "David Hay",
        "timestamp": 1578632440
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> is this something to discuss in Sydney?</p>",
        "id": 187004080,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580401857
    }
]