[
    {
        "content": "<p>Does anyone have an example of slicing by the profile of a reference target? I want to say something like my patient profile can have any generalPractitioner references, but at least one must be of my Practitioner profile. I don't want to say only Reference(myPractitioner) or only Reference(Organization | PractionerRole | myPratictitioner).</p>",
        "id": 270793752,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1644022947
    },
    {
        "content": "<p>Is this even permitted since, based on previous discussions, slices need to be disjoint, and a slice that matches Practitioner would also match MyPractitioner (although the reverse is not true).</p>",
        "id": 270794108,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1644023306
    },
    {
        "content": "<p>might be also a topic to raise on the <a class=\"stream\" data-stream-id=\"179177\" href=\"/#narrow/stream/179177-conformance\">#conformance</a> stream. as you pointed out , you can't use slicing as the slices need to be disjoint. what you could do, is to add a constraint, that a least one of the resolved references conforms to your profile.</p>",
        "id": 270811012,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1644044785
    },
    {
        "content": "<p>If I'm understanding what you want, it seems to me that you <em>can</em> use a slice.  While it's true that slices must be disjoint, don't you only need one slice here?  You would slice by <code>#profile</code>, leave the slicing <code>#open</code>, and then define just one slice for the myPractitioner profile.  Other practitioners not conforming to the profile would just fall into the open part of the slicing, right?  Or am I misunderstanding something?</p>",
        "id": 270981840,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1644242511
    },
    {
        "content": "<p>I just wrote a minimal Patient profile using a single slice for a Practitioner profile, along w/ examples to demonstrate its use.  I ran it through SUSHI and the IG Publisher and it has no errors.  If you comment out the line in PatientBob that adds DrSue to the general practitioners, however, there is an error -- showing that it does properly require at least one of the MyPractitioner profile.</p>\n<p>The relevant bit is:</p>\n<div class=\"codehilite\"><pre><span></span><code>Profile: MyPatient\nParent: Patient\nDescription: &quot;Profile of Patient requiring at least one MyPractioner&quot;\n* generalPractitioner ^slicing.discriminator.type = #profile\n* generalPractitioner ^slicing.discriminator.path = &quot;$this.resolve()&quot;\n* generalPractitioner ^slicing.ordered = false\n* generalPractitioner ^slicing.rules = #open\n* generalPractitioner 1..*\n* generalPractitioner contains mygp 1..*\n* generalPractitioner[mygp] only Reference(MyPractitioner)\n</code></pre></div>\n<p>The full FSH definitions to demonstrate this use case is on FSHSchool here: <a href=\"https://fshschool.org/FSHOnline/#/share/3ruI0lp\">https://fshschool.org/FSHOnline/#/share/3ruI0lp</a></p>",
        "id": 270985559,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1644244115
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> Thanks. I realized about midnight last night that the disjoint slices thing was probably a red herring. But I still couldn't find an example of slicing by profile--which looks far simpler than what I was trying.</p>",
        "id": 271021669,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1644258502
    }
]