[
    {
        "content": "<p>Unless I'm missing something, the assumption that the filename is the same as the resource id is not allowing to use different versions</p>",
        "id": 186846521,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580259114
    },
    {
        "content": "<p>I have a careplan-001, where I have<br>\nv1: status = draft<br>\nv2: status= active</p>",
        "id": 186846574,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580259153
    },
    {
        "content": "<p>v1 and v2 are on meta.versionId</p>",
        "id": 186846590,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580259189
    },
    {
        "content": "<p>I <em>thought</em> that the publisher requires the filename to be <code>${type}-${id}.{json|xml}</code>... is there room for the version number in that filename algorithm somewhere?  I don't think I ever thought about having two versions of the same SD in the same IG.  Since you're asking, I'm guessing that this is allowed?</p>",
        "id": 186887347,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1580306279
    },
    {
        "content": "<p>Actually, I see the thread in IG Creation now in which Grahame seems to say you can't have two versions of the same resource in a single IG: <a href=\"#narrow/stream/179252-IG-creation/topic/Adding.20versioned.20examples.20to.20an.20IG/near/186857008\" title=\"#narrow/stream/179252-IG-creation/topic/Adding.20versioned.20examples.20to.20an.20IG/near/186857008\">https://chat.fhir.org/#narrow/stream/179252-IG-creation/topic/Adding.20versioned.20examples.20to.20an.20IG/near/186857008</a></p>\n<p>Did I interpret that discussion correctly or did I miss the point?</p>",
        "id": 186887589,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1580306449
    },
    {
        "content": "<p>My question there was whether and how we can allow this for IGs. I'd say we should but only Grahame and Lloyd can determine the impact. <br>\nFor sushi, I'd suggest we really should support versions. Perhaps sushi should wait for the decision for the IGs, but IMO sushi is not only for making IGs, right?</p>",
        "id": 186903892,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580316199
    },
    {
        "content": "<p>Well... SUSHI requires you to specify a canonical URL (in package.json), so the assumption is that what you're creating is at least in the same _package_.  And I'd assume (but it is an assumption) that any rule regarding uniqueness for IGs would also probably apply to packages.  So for now, you'd need different versions to be in different SUSHI projects.</p>\n<p>Let's see what Grahame, Lloyd, and the community say.  Right now SUSHI makes some assumptions about uniqueness of names/ids, so adding support for definitions that differ only by version will require some rework.</p>",
        "id": 186908772,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1580319094
    },
    {
        "content": "<p>I imagine it will require some rework. Or perhaps we issue a workaround. But we must somehow support versions, even if the IG publication doesn't (yet/ever).</p>",
        "id": 186909047,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580319297
    },
    {
        "content": "<p>If the sushi assumptions did not include versions, now is a good time to change our assumptions. Rework later is going to be more expensive, as will be finding yet another alternative to create instances</p>",
        "id": 186909222,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580319437
    },
    {
        "content": "<p>SUSHI does support multiple versions, it just assumes a single-version per resource per SUSHI project.  To be clear, you're suggesting that a single project should support multiple versions of a resource w/ the same name and id (but different versions), right?</p>",
        "id": 186920304,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1580326473
    },
    {
        "content": "<p>Yes. Some resources like CarePlan, task are evolving over time. They will have different versions.</p>",
        "id": 186921237,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580326971
    },
    {
        "content": "<p>Resource history is core (although optional for servers) but to do some decent workflow it becomes kind of mandatory</p>",
        "id": 186921289,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580327019
    },
    {
        "content": "<p>Hence my example - CarePlan draft --&gt; active...</p>",
        "id": 186921390,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580327089
    },
    {
        "content": "<p>I think assuming a single version per resource id per project does conflict with this need, what do you think?</p>",
        "id": 186921589,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580327178
    },
    {
        "content": "<p>I will ask for the same need on the ig publication side but the current ig limitation should not become legacy/debt for other tools</p>",
        "id": 186921837,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1580327348
    }
]