[
    {
        "content": "<p>I updated our IG project to use Sushi 1.1.0 on Jan 20th and have not seen any errors. Our CI builds (Jenkins) have worked without error until this past Friday.  It was late in the day, so I decided to wait and retry the build this morning. It failed again. This is the error I keep getting:</p>\n<div class=\"codehilite\"><pre><span></span><code>Sushi: info  Checking local cache for hl7.fhir.r4.core#4.0.1...                  (00:03.0709)\nSushi: info  Did not find hl7.fhir.r4.core#4.0.1 in local cache.                 (00:03.0712)\nSushi: info  Downloading hl7.fhir.r4.core#4.0.1...                               (00:03.0715)\nSushi: info  Downloaded hl7.fhir.r4.core#4.0.1                                   (00:19.0785)\nSushi: error Failed to load hl7.fhir.r4.core#4.0.1: ENOENT: no such file or directory, open &#39;/home/jpaquette/.fhir/packages/hl7.fhir.r4.core#4.0.1/other/clinicalreasoning-integrating-decision-support-radiology-request.png&#39; (00:23.0869)\nSushi: error Valid StructureDefinition resource not found. The FHIR package in your local cache may be corrupt. Local FHIR cache can be found at &lt;home-directory&gt;/.fhir/packages. For more information, see\nhttps://wiki.hl7.org/FHIR_Package_Cache#Location. (00:23.0877)\nSushi couldn&#39;t be run. Complete output from running Sushi :                      (00:23.0891)\n</code></pre></div>\n<p>Each time, the \"failed to load\" file is different.<br>\nThe Jenkins build is done within a Docker instance, so the <code>.fhir</code> cache will always be empty when starting the actual build process.</p>\n<p>I tried to repeat this locally. First, I deleted my local <code>.fhir</code> cache and my local NPM <code>node_modules</code>. I then executed the same NPM build commands that are used in our Jenkins build. I got the same error but with a different file. I checked the local <code>.fhir</code> cache, and the file is there and I was able to open the file with no problem.</p>\n<p>I re-ran my local build and of course it succeeded because the <code>.fhir</code> cache now exists.</p>\n<p>It seems like that even though the log shows <code>Downloaded hl7.fhir.r4.core#4.0.1</code> the downloading hasn't really completed. I'm assuming that the download is downloading a package tarball. Maybe the expansion of the tarball contents into the cache has not completed when Sushi is trying to load specific files for use.</p>\n<p>Thoughts?</p>",
        "id": 224721028,
        "sender_full_name": "Joe Paquette",
        "timestamp": 1612184180
    },
    {
        "content": "<p>Never mind... I figured it out. We have a mono-repo (Lerna) with 2 IGs in the project. Lerna parallelizes the sub-project scripts so the execution of Sushi/IG generation were over lapping. Specifically the code that extracts the contents of the downloaded packages and moves it under the <code>package</code> directory from each sub-project were interfering with each other. Setting concurrency to 1 for that process solved the problem.</p>",
        "id": 224859629,
        "sender_full_name": "Joe Paquette",
        "timestamp": 1612266036
    }
]