[
    {
        "content": "<p>Announcing <strong>SUSHI 0.11.2</strong>.  This release contains the following enhancements and bug fixes:</p>\n<ul>\n<li>Adds support for caret rules on the root element using the <code>.</code> path (#277)</li>\n<li>Adds do-not-edit warning to generated IG files where allowed (#309)</li>\n<li>Adds new <code>SUSHI-GENERATED-FILES.md</code> file in IG output</li>\n<li>Adds user-friendly results summary at end of console output</li>\n<li>Enforces requirement that invariant names be valid FHIR ids (#290)</li>\n<li>Fixes issue w/ sparse differentials and slice paths (#293)</li>\n<li>Fixes duplicate entries for instances used in inline references (#333)</li>\n<li>Fixes issue w/ single-line block comments (#155)</li>\n<li>Updates various application dependencies to their more recent versions</li>\n</ul>\n<p>See the <a href=\"https://github.com/FHIR/sushi/releases/tag/v0.11.2\" title=\"https://github.com/FHIR/sushi/releases/tag/v0.11.2\">RELEASE NOTES</a> for details, examples, and links to resolved issues.</p>",
        "id": 192867347,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1585950098
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193397\">@Pétur Valdimarsson</span> and <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> -- this release fixes some bugs you reported. Thanks for your help!</p>",
        "id": 192867595,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1585950260
    },
    {
        "content": "<p>I appreciate the new release, but I'm now getting an error</p>\n<div class=\"codehilite\"><pre><span></span>onGenerate:\nError on line 1 column 1\n  SXXP0003: Error reported by XML parser: Content is not allowed in prolog.\nException generating page /Users/bmilius/Documents/src/fsh/hla-reporting-ig/build/temp/pages/_includes/index.xml: org.xml.sax.SAXParseException; lineNumber: 1; columnNumber: 1; Content is not allowed in prolog. (00:26.0198)\n</pre></div>\n\n\n<p>If I revert to the 0.11.1 version, I don't see this error and it builds fine.<br>\nI'm writing my pages in xml, so I'm using index.xml instead of index.md</p>",
        "id": 192873136,
        "sender_full_name": " Bob Milius",
        "timestamp": 1585954270
    },
    {
        "content": "<p>what version of the ig publisher are you using?</p>",
        "id": 192874785,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585955585
    },
    {
        "content": "<p>Most recent, updated before I ran it.</p>",
        "id": 192874951,
        "sender_full_name": " Bob Milius",
        "timestamp": 1585955714
    },
    {
        "content": "<p>I’m running it in two steps, first running sushi, then the IG publisher in the build dir</p>",
        "id": 192875142,
        "sender_full_name": " Bob Milius",
        "timestamp": 1585955867
    },
    {
        "content": "<p>Make sure the editor you use for the XML file doesn't prepend a byte order mark for utf-8</p>",
        "id": 192876089,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1585956705
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span> -- we're outputting some Jekyll liquid comments in files that we copy or generate now (because users were getting confused between the source and destination files).  I wonder if this is causing the problem.  I know we tested it thoroughly w/ the publisher and custom <code>.md</code> files, but maybe we missed some tests on <code>.xml</code> files (specifically w/ the publisher).  We'll take a look.  Sorry for the inconvenience -- if it's working w/ SUSHI 0.11.1 for you, you might want to stick with that for now.</p>",
        "id": 192879626,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1585960272
    },
    {
        "content": "<p>If your FSH project is open source and publicly available, we can use it as a test case.  If so, please provide a link.  Thanks!</p>",
        "id": 192879692,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1585960339
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> -- if it works with SUSHI 0.11.1 but not with SUSHI 0.11.2, then I'm assuming this is our problem, not yours.</p>",
        "id": 192879714,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1585960385
    },
    {
        "content": "<p>I'm not assuming it's so simple. But what I can say is, I can't hack the XML processor the way I the JSON, but I shouldn't need to... xml comments should work</p>",
        "id": 192881189,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585962228
    },
    {
        "content": "<p>We’re using Jekyll liquid style comments so they don’t persist to the final rendered html files. Maybe we’re applying it to files that aren’t actually going through the Jekyll parser?</p>",
        "id": 192888047,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1585972866
    },
    {
        "content": "<p>I've looked into this... It looks like the publisher (or Jekyll) tries to parse the XML file without ignoring the comments first.  If I surround it in normal XML comments it works.  I've logged a bug and will work on a solution.  See: <a href=\"https://github.com/FHIR/sushi/issues/338\" title=\"https://github.com/FHIR/sushi/issues/338\">https://github.com/FHIR/sushi/issues/338</a></p>",
        "id": 193072723,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1586193354
    },
    {
        "content": "<p>The puns (in the sushi output) are atrocious. Well done!</p>",
        "id": 193104638,
        "sender_full_name": "David Hay",
        "timestamp": 1586208638
    },
    {
        "content": "<p>If you have an ig-data folder, then sushi will generate an IG containing all the resources it created - which is great for when you add new profiles or extensions. However, the IG also contains the page node that is needed to support customizations to the menu, which seems to be replaced with a default each time sushi runs. Is there a way to define the page node in the ig-data folder so that it is merged with the generated IG ?</p>",
        "id": 193124385,
        "sender_full_name": "David Hay",
        "timestamp": 1586224851
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> -- when you say \"page node\", do you mean the pages elements in the ImplementationGuide JSON file that we generate?  And if so, how does it affect the menu?  Last I checked the two were not linked in any way (you had to manually specify your own menu).  It does affect the TOC though...</p>",
        "id": 193184402,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1586264998
    },
    {
        "content": "<p>Hi Chris - yep, that one. I thought you had to put the the pages that you create in there - at least, the IG publisher doesn't seem to generate the page if you don't...</p>",
        "id": 193227126,
        "sender_full_name": "David Hay",
        "timestamp": 1586283451
    },
    {
        "content": "<p>OK.  Yes, it does affect what pages get processed -- so your pages must be listed there.  Currently, using SUSHI, if you put any <code>.md</code> or <code>.xml</code> files in <code>ig-data/pagecontent</code>, then SUSHI will enumerate them and add them to the ImplementationGuide JSON.  If you prefix the file names with numbers (e.g., <code>1_Servers.md</code>, <code>2_Clients.md</code>, etc) then that will affect the order they are listed in (but <code>index.md</code>/<code>index.xml</code> always gets listed first).</p>",
        "id": 193239368,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1586289294
    },
    {
        "content": "<p>As for the menu, you can add your own <code>menu.xml</code> in <code>ig-data/input</code> and that will be used.</p>",
        "id": 193239481,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1586289345
    },
    {
        "content": "<p>A future version of SUSHI will support a more elaborate config file that gives you more control over these things.</p>",
        "id": 193239545,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1586289367
    },
    {
        "content": "<p>Ah. though I did hit the issue I mentioned in another stream with the sushi header seeming to muck up page generation with .xml files.  For now I just added a 'pre-processing' stop in the build process that updates the IG so all good.</p>",
        "id": 193244197,
        "sender_full_name": "David Hay",
        "timestamp": 1586291830
    },
    {
        "content": "<p>Thank you for the previous answers as i was experiencing the same problem of prolog!<br>\n<span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>  thank you, good to know about the number prefix, is there a way to give a number to the Artifacts Summary too? As he it is not in the ig-data/input/pagecontent</p>",
        "id": 193302412,
        "sender_full_name": "Etienne Cantineau",
        "timestamp": 1586343557
    },
    {
        "content": "<p>The artifacts summary page is automatically generated by the template. So yes, there is  a way.</p>",
        "id": 193308029,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586346971
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243697\">@Etienne Cantineau</span> -- we don't have control over the naming of the Artifact Summary page, so I'm not sure how you would currently indicate where you want it to go in the order.  This will be possible with our new config file, however, which we start work on next week.</p>",
        "id": 193443262,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1586435695
    },
    {
        "content": "<p>Also, the prolog issue should be fixed in SUSHI 0.12.0, which we expect to release today.</p>",
        "id": 193443310,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1586435731
    }
]