[
    {
        "content": "<p>I stumbled over a weird issue. If i have:</p>\n<ul>\n<li>a profile on Identifier</li>\n<li>a profile2 using this IdentifierProfile</li>\n<li>creating an Instance of this profile2<br>\neverything works just fine: <a href=\"https://fshschool.org/FSHOnline/#/share/3uofq3N\">https://fshschool.org/FSHOnline/#/share/3uofq3N</a></li>\n</ul>",
        "id": 233347828,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1617725689
    },
    {
        "content": "<p>if i remove the Identifier Profile from the fsh file, replacing it with an external Extension, contained in /resources<br>\neverything still works fine.</p>",
        "id": 233347980,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1617725752
    },
    {
        "content": "<p>If i only build the instance, refering to an external profile, which references the Identifier Profile i get: <code>error The element or path you referenced does not exist: performer.actor.identifier.value</code></p>",
        "id": 233348120,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1617725803
    },
    {
        "content": "<p>I created a minimal test set:<br>\n<a href=\"https://github.com/patrick-werner/reproduce-fsh-issue\">https://github.com/patrick-werner/reproduce-fsh-issue</a><br>\n(please ignore the extension error, i didn't include these to have a minimal test-case)</p>",
        "id": 233348959,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1617726171
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>.  This is an interesting issue.  I believe I've found what the problem is, but I'm not sure exactly what the right solution is... I think the problem is that in <code>TestProfile2</code>, <code>performer.actor.identifier.value</code> is defined as being a choice of two profiles:</p>\n<div class=\"codehilite\"><pre><span></span><code>&quot;type&quot;: [\n  {\n    &quot;code&quot;: &quot;Identifier&quot;,\n    &quot;profile&quot;: [\n      &quot;http://fhir.de/StructureDefinition/identifier-iknr&quot;,\n      &quot;http://fhir.abda.de/eRezeptAbgabedaten/StructureDefinition/DAV-PR-ERP-DAVHerstellerSchluessel&quot;\n    ]\n  }\n],\n</code></pre></div>\n<p>When you try to use that path in an instance, SUSHI doesn't know which profile to use as the definition for the <code>Identifier</code> type that the instance should be built against.  For example, if each profile fixed the <code>Identifier.system</code> to a different value, SUSHI wouldn't know which to apply.  So in this case, it seems like SUSHI is just giving up and not using either (and instead returning a confusing error message).  I noticed that if I removed the second profile (so there was only one profile in the array) then the error went away. You didn't see this w/ your FSH-defined profile because in that one you restrict the <code>Identifier</code> to a single profile (not two profiles).</p>\n<p>I don't think what SUSHI is doing now is the best approach.  At a minimum, we should return a better error message.  I think the best short-term solution is for SUSHI to use the base resource type (<code>Identifier</code>) and issue a <em>warning</em> message that since there were two profiles, SUSHI used only the base definition.  Long term, I think it would be nice for the author to be able to target the profile they want using a path syntax like <code>performer.actor.identifier[http://fhir.de/StructureDefinition/identifier-iknr].value</code> (but I don't know if that's exactly the right syntax  since it could be confused for slice syntax).  What do you think?</p>",
        "id": 233368380,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1617734487
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> <br>\nusing the base resource type in this case sounds like a good short term solution. Long term i could see sushi just trying the profiles until the first fits for the element. Or leave it at the base resource definition. Errors will be catched by the IG publisher downstream</p>",
        "id": 233448011,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1617782519
    },
    {
        "content": "<p><a href=\"https://github.com/FHIR/sushi/issues/794\">SUSHI #794</a></p>",
        "id": 233642880,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1617884567
    }
]