[
    {
        "content": "<p>I'll start by saying that I am a big fan of FSH. And of the all the work on sushi! I was observing the direction of the project, and it got me thinking. The description is \"a reference implementation command-line interpreter/compiler for FHIR Shorthand (FSH)\", but it seems like it's heading in a direction of increasingly wrapping the IGPublisher. </p>\n<p>For maintainability, community adoption, and simplicity I wonder if it would make sense to have the parser/interpreter (with a JSDoc API) cleanly separate from the IGPublisher integration parts? Perhaps go even as far as two npm packages (e.g. <code>sushi</code> and <code>sushi-ig</code>) Thoughts? Is this crazy talk?</p>",
        "id": 198283374,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1590032597
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191782\">@Brian Kaney</span> -- have you been listening to our private conversations?  <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> actually brought up this idea during the Connectathon.  Mark and I just discussed it further yesterday.  While IG components are already somewhat separated in the codebase, we <em>do</em> like the idea of an even cleaner separation by putting them in separate modules -- and we'll be exploring that in the coming weeks.</p>\n<p>One of the reasons we like the idea is that we'd like to gradually move <em>away</em> from most of the IG stuff that SUSHI does -- but we also want our users to continue to enjoy some of the simplicity that SUSHI brings to IGs.  So... our hope is that as the IG Publisher continues to improve in some of the areas where SUSHI is stronger right now, we can incrementally have SUSHI do less and less w/ IGs and rely on the IG Publisher to do those things instead.  Eventually, perhaps the SUSHI IG functionality is no longer needed at all.  Or perhaps it becomes more of a test-bed for new IG features or simplifications...</p>",
        "id": 198314920,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1590064405
    }
]