[
    {
        "content": "<p>Announcing <strong>SUSHI 2.0.0-beta.1</strong>! This beta release introduces significant new features, bug fixes, and several breaking changes. New features include:</p>\n<ul>\n<li>Rule indentation for succinct specification of subpaths</li>\n<li>Logical models and custom resources</li>\n<li>Hierarchical CodeSystems and concept-specific caret rules</li>\n<li>Option to output preprocessed FSH</li>\n<li>Extensions for representing elements from other versions of FHIR</li>\n<li>Extension for profiling BackboneElements</li>\n</ul>\n<p>Since this is a beta release, you must install it by specifying its version (otherwise NPM installs the latest stable release):</p>\n<div class=\"codehilite\"><pre><span></span><code>$ npm install -g fsh-sushi@2.0.0-beta.1\n</code></pre></div>\n<p>See the <a href=\"https://github.com/FHIR/sushi/releases/tag/v2.0.0-beta.1\">Release Notes</a> for details on the new features, additional bug fixes, <em>breaking changes</em>, and instructions for using this beta release in the AutoBuild environment.</p>\n<p>The SUSHI team would like to thank <span class=\"user-mention\" data-user-id=\"211704\">@Joe Paquette</span> and <a href=\"https://www.athenahealth.com/\">athenahealth</a> for implementing support for logical models and custom resources in in this release. Their quality contribution and teamwork has greatly improved SUSHI and allowed the SUSHI team to focus on many of the other proposed FSH STU2 features found in this release. Thank you, Joe and athenahealth!</p>",
        "id": 241581915,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1622834742
    },
    {
        "content": "<p>This is absolutely amazing work --thank you so much for producing this fantastic tool!! I especially love the new support for logical model/custom resources and the support for concept-specific caret rules!</p>",
        "id": 241595189,
        "sender_full_name": "Martin Höcker",
        "timestamp": 1622841971
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"217988\">@Martin Höcker</span>!  The concept hierarchies and caret rules were so obvious.  I can't believe we didn't do that in STU1!  Then again, we had a lot to do in STU1 as it was, so glad we're fitting it into STU2!</p>",
        "id": 241600126,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1622845564
    },
    {
        "content": "<p>I just noticed that some of the supporting documentation (in FSH School and current build of FSH spec) hadn't been fully deployed at the time I published the release notes.  Sorry to anyone who eagerly jumped in and found broken links!  It should be resolved now!</p>",
        "id": 241607150,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1622853629
    }
]