[
    {
        "content": "<p>Announcing <strong>SUSHI 1.2.0</strong> with the following new features, enhancements, and bug fixes:</p>\n<ul>\n<li>Update <code>Quantity</code> syntax to support non-UCUM units</li>\n<li>Add support for the new R5 <code>integer64</code> datatype</li>\n<li>Do not repeat mappings/invariants from the parent definition in the differential</li>\n<li>Do not allow slice errors to halt processing of other slices</li>\n<li>Treat redeclared extensions (via <code>contains</code> rules) as warnings rather than errors</li>\n<li>Treat names that don't match <code>[A-Z]([A-Za-z0-9_]){0,254}</code> as warnings instead of errors</li>\n<li>Support additional name variants (e.g., all numeric, matching flag names, etc.)</li>\n<li>Avoid use of regular expression features not supported in Safari</li>\n<li>Change exit code semantics: exit code now indicates number of errors encountered (<code>0</code> continues to mean success)</li>\n<li>Fix \"Cannot convert undefined...\" error when applying extensions to arrays of primitives</li>\n<li>Fix handling of counting aggregrate cardinalities w/ slices and re-slices</li>\n<li>Fix duplicate values in <code>meta.profile</code> for exported <code>Instance</code>s</li>\n<li>Fix SUSHI documentation link in <code>sushi --init</code> output</li>\n<li>New and improved puns</li>\n</ul>\n<p>See the <a href=\"https://github.com/FHIR/sushi/releases/tag/v1.2.0\">SUSHI 1.2.0 Release Notes</a> for more details.</p>",
        "id": 225621522,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1612824808
    },
    {
        "content": "<p>Is there any chance we could keep the support of older folder structures in the next sushi releases? In a scenario where one needs to work with couple dozens IGs that are interdependent and evolve constantly, having the fsh files at the first level of the folder hierarchy comes very handy:)</p>",
        "id": 228313341,
        "sender_full_name": "Halina Labikova",
        "timestamp": 1614635851
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194075\">@Halina Labikova</span> -- we're not likely to remove support for that until SUSHI 2.0.0, which would likely be after the next FSH ballot (so post Sep '21).</p>",
        "id": 228314758,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1614636376
    }
]