[
    {
        "content": "<p><strong>SUSHI 0.11.1</strong> contains the following enhancements and bug fixes:</p>\n<ul>\n<li><strong>BREAKING CHANGE:</strong> Changes fixed value rules to enable usage of <code>(exactly)</code> keyword</li>\n<li>Adds support for Mixins and RuleSets</li>\n<li>Adds support for Mappings</li>\n<li>Adds <code>Usage</code> keyword on Instances</li>\n<li>Adds support for contained Instances</li>\n<li>Adds support for one sided cardinality statements</li>\n<li>Improves error reporting when applying rules to a sliced element which conflict with slices of that element</li>\n<li>Adds an optional <code>units</code> keyword that has no effect, but can be used to clarify setting values and binding on quantity types: <code>* {Quantity type} units = {system}#{code} \"{display text}\"</code></li>\n<li>Adds support for setting standards status to \"Normative\", \"Trial Use\", or \"Draft\" using the <code>N</code>, <code>TU</code>, and <code>D</code> flags, respectively</li>\n<li>Updates the <code>updatePublisher</code> and <code>genonce</code> scripts based on the updates in the sample-ig: <a href=\"https://github.com/FHIR/sample-ig\" title=\"https://github.com/FHIR/sample-ig\">https://github.com/FHIR/sample-ig</a></li>\n<li>Generates a path-history parameter when being run on an HL7 IG</li>\n<li>Logs an error if a Profile defines itself as its own Parent</li>\n<li>Fixes bug with adding slices of a primitive on an Instance</li>\n<li>Fixes bug with failing to find slices of slices</li>\n<li>Fixes bug that would cause an error when using <code>system</code> in a path</li>\n<li>Fixes bug that caused <code>obeys</code> to fail when applied to <code>id</code></li>\n<li>Fixes bug with local templates in ig.ini</li>\n<li>Fixes bug with line indentation on multiline strings</li>\n</ul>\n<p><strong>NOTE</strong>: We skipped directly to SUSHI 0.11.1 since a small bug was found and fixed in SUSHI 0.11.0 at the very end of the publishing process. For more details see the release notes: <a href=\"https://github.com/FHIR/sushi/releases/tag/v0.11.1\" title=\"https://github.com/FHIR/sushi/releases/tag/v0.11.1\">https://github.com/FHIR/sushi/releases/tag/v0.11.1</a></p>",
        "id": 192064802,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1585335514
    },
    {
        "content": "<p>Awesome job as always guys. I keep looking forward to the next release and am <del>rarely</del>never disappointed.</p>",
        "id": 192083325,
        "sender_full_name": "Pétur Valdimarsson",
        "timestamp": 1585344920
    }
]