[
    {
        "content": "<p>Is it possible to set designations, properties or child concepts on concepts within a FSH CodeSystem definition?</p>\n<p>I am assuming not. If not, are they on the roadmap?</p>",
        "id": 199318743,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1590954830
    },
    {
        "content": "<p>Unfortunately, your assumption is correct. It is not possible to do this within the context of a FSH CodeSystem. It <em>is</em> possible to create an Instance of a CodeSystem, but this is not really a great solution, since you lose a lot of the shorthand that is the whole point of FHIR shorthand. </p>\n<p>Yes, this is a task in our backlog, and multiple uses have run into this issue, so it is something we will prioritize.</p>",
        "id": 199363441,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1591015127
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"239822\">@Nick Freiter</span>  - The issue came up as I generate FSH version of the 1000+ code systems in the R4 spec and clearly these features are used. Will watch with interest as FSH develops. :-)</p>",
        "id": 199376413,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1591022158
    },
    {
        "content": "<blockquote>\n<p>The issue came up as I generate FSH version of the 1000+ code systems in the R4 spec</p>\n</blockquote>\n<p>I assume this was an exercise, right?  I mean, if you have an IG, you can reference any of the CodeSystems in the R4 spec via their canonical URL -- so there's no <em>need</em> to create FSH versions of them all...</p>",
        "id": 199380935,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1591024477
    },
    {
        "content": "<p>Yeah - it was just a means to test the conversion process against a large set of CodeSystems</p>",
        "id": 199382491,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1591025130
    },
    {
        "content": "<p>The same will be done for the ValueSets - once I understand the FSH syntax for these a bit better</p>",
        "id": 199382724,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1591025235
    }
]