[
    {
        "content": "<p>In my haste to fix a problem in an operation, I removed an array element and left just [0] and [2].  sushi had no problem with this but inserted a null element in the output operationdefinition.  This caused the IG publisher to crash with a  Not a JSON Object: null that <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> was able to find for me.  Can it be handled in sushi so that people like me aren't lost?</p>",
        "id": 200578081,
        "sender_full_name": "David Pyke",
        "timestamp": 1591896649
    },
    {
        "content": "<p>I've opened issue <a href=\"https://github.com/FHIR/sushi/issues/486\">https://github.com/FHIR/sushi/issues/486</a> because I'm not likely the only one to be dumb enough to do this.</p>",
        "id": 200578817,
        "sender_full_name": "David Pyke",
        "timestamp": 1591896990
    },
    {
        "content": "<p>To replicate: get any repeating element and create an instance with</p>\n<ul>\n<li>element[0] = ...</li>\n<li>element[2] = ...<br>\noutput json will contain a null in the list.</li>\n</ul>",
        "id": 200579159,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591897124
    },
    {
        "content": "<p>I think sushi should not populate nulls in the json if an array index is skipped in an instance. <br>\nEither fix it automatically (delete null) or give an error - otherwise it will throw incorrect stuff at the publisher.</p>",
        "id": 200579271,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591897179
    },
    {
        "content": "<p>I see it being a feature As in what am I missing?  Otherwise you would not know what you are missing</p>",
        "id": 200581269,
        "sender_full_name": "Eric Haas",
        "timestamp": 1591897980
    },
    {
        "content": "<p>SUSHI has to be able to populate nulls, at least on arrays of primitives, because when there is an array of primitives, and some of those primitives have values, and some have child elements (extensions or ids), the values are in one array, and the child elements are in a corresponding array, and the values are matched with the child elements by padding the arrays with null <a href=\"https://www.hl7.org/fhir/json.html#primitive\">https://www.hl7.org/fhir/json.html#primitive</a>. So we would have to think carefully about how we could do something like this without breaking that use case, since the nulls are there for a reason.</p>",
        "id": 200582802,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1591898632
    },
    {
        "content": "<p>yes, but also on instances?</p>",
        "id": 200583031,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1591898725
    },
    {
        "content": "<p>Unless I'm misunderstanding, this would generally only occur on instances. Generally array indices aren't used on a profile in FSH. If you want to constrain arrays in a profile, you have to do it with slicing. The array indices are used when you are making an instance and wish to specify the actual value of certain elements in an array, and sometimes those values also need extensions placed on them, and in that case the array may have to be filled with null. For example, in this (very contrived) instance:</p>\n<div class=\"codehilite\"><pre><span></span><code>Instance: MyPatient\nInstanceOf: Patient\n* name.given[0] = &quot;Name1&quot;\n* name.given[2] = &quot;Name2&quot;\n* name.given[0].id = &quot;id1&quot;\n* name.given[1].id = &quot;id2&quot;\n* name.given[2].id = &quot;id3&quot;\n</code></pre></div>\n\n\n<p>The <code>name</code> element is represented in JSON as:</p>\n<div class=\"codehilite\"><pre><span></span><code>&quot;name&quot;: [\n    {\n      &quot;given&quot;: [\n        &quot;Name1&quot;,\n        null,\n        &quot;Name2&quot;\n      ],\n      &quot;_given&quot;: [\n        {\n          &quot;id&quot;: &quot;id1&quot;\n        },\n        {\n          &quot;id&quot;: &quot;id2&quot;\n        },\n        {\n          &quot;id&quot;: &quot;id3&quot;\n        }\n      ]\n    }\n  ]\n</code></pre></div>",
        "id": 200583783,
        "sender_full_name": "Nick Freiter",
        "timestamp": 1591899023
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"239822\">@Nick Freiter</span> is exactly right (as usual), but we will take it as a note that it would be helpful to issue a warning or an error when we detect a null element in an array (when there is no reason for it).</p>",
        "id": 200612497,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1591912782
    }
]