[
    {
        "content": "<p>When a profile in one IG uses a structure defined in another IG, the page that the publisher creates for that profile (using the template) has a link to the definition of that structure in the IG where it is defined. (At least it does when referring to the core spec)</p>\n<p>For example, in <a href=\"http://igs.clinfhir.com/ig/hpi/StructureDefinition-HpiLocation.html\">this profile</a> the type 'nzAddress'  is defined in another IG. However, if you look at the link, it is actually directing to my local machine using a 'file://' type reference. </p>\n<p>How do I get it to refer to it's on-line definition? Is it related to the canonical url of the 'defining' IG in some way?</p>",
        "id": 198358997,
        "sender_full_name": "David Hay",
        "timestamp": 1590086247
    },
    {
        "content": "<p>I'm using the FHIR base template...</p>",
        "id": 198359139,
        "sender_full_name": "David Hay",
        "timestamp": 1590086307
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> -- this is probably a question best left to <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>.  That said... how did you define your dependency on that other IG?  If you are using the \"dev\" version of the IG dependency, I'd expect it to link locally -- but if you're using \"current\" or a specific version number of the \"IG\" then I think it's fair to expect it to resolve to a location on the internet.</p>",
        "id": 198362172,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1590087786
    },
    {
        "content": "<p>Ah - that could well be it. I am using a dev version. Looks like I need to learn how to use the packaging / publishing mechanisms...</p>",
        "id": 198363920,
        "sender_full_name": "David Hay",
        "timestamp": 1590088657
    },
    {
        "content": "<p>Yeah -- <code>dev</code> means \"use the IG on my local disk because its different than anything that's published\" -- so that's where the IG is going to link to.</p>",
        "id": 198364333,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1590088881
    },
    {
        "content": "<p>If I publish according to the directions <a href=\"http://hl7.org/fhir/uv/shorthand/2020May/sushi.html#new-ig-publisher-integration-autobuild-configuration\">here</a> - and linked instructions - then do I use 'current' to get sushi to read that version - (and hopefully the publisher to generate the links using the canonical url)...</p>",
        "id": 198369629,
        "sender_full_name": "David Hay",
        "timestamp": 1590091448
    },
    {
        "content": "<p>If an IG uses the \"Auto Build\" infrastructure, then specifying that IG as a dependency with the \"current\" version <em>should</em> refer to the latest auto-build and <em>should</em> link any references to the IG on <a href=\"http://build.fhir.org\">build.fhir.org</a>.  (Note: I say <em>should</em> because I'm not sure I've tested the links to confirm).</p>",
        "id": 198370140,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1590091675
    },
    {
        "content": "<p>guess I'll be doing that next week!</p>",
        "id": 198396516,
        "sender_full_name": "David Hay",
        "timestamp": 1590109068
    }
]