[
    {
        "content": "<p>I wrote the following fsh defining a ValueSet which uses codes from the Swedish version of SNOMED (with URI <a href=\"http://snomed.info/sct/45991000052106\">http://snomed.info/sct/45991000052106</a>)</p>\n<div class=\"codehilite\"><pre><span></span><code>Alias : SCT_SE = http://snomed.info/sct/45991000052106\nValueSet: SeverityValueSet\nId: severity-value-set\nTitle: &quot;Severity Value Set&quot;\nDescription: &quot;&quot;\n* include SCT_SE#442452003 &quot;livshotande&quot;\n* include SCT_SE#59021000052107 &quot;skadlig&quot;\n* include SCT_SE#59031000052109 &quot;besvärande&quot;\n</code></pre></div>\n<p>When running sushi on the fsh-file I do get out a resource, but I do not see an expansion of the valueset with links to each concept in the valueset (see screenshot). I do get an expansion if I indicate the \"base\" version of SNOMED, however.<br>\nIs this known behavior/as it should? Or am I doing something wrong?</p>\n<p><a href=\"/user_uploads/10155/sE7IFAROGJlPPD1ALMIVcE3v/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/sE7IFAROGJlPPD1ALMIVcE3v/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/sE7IFAROGJlPPD1ALMIVcE3v/image.png\"></a></div>",
        "id": 223213476,
        "sender_full_name": "Gino Almondo",
        "timestamp": 1611055437
    },
    {
        "content": "<p>I don't know if that is the right way to express a national release of SNOMED.</p>",
        "id": 223229888,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611065082
    },
    {
        "content": "<p>you are still referring to SNOMED. The problem is that the terminology server does not know the swedish extension, so those codes are not known in the normal SNOMED</p>",
        "id": 223229978,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611065124
    },
    {
        "content": "<p>Thank you for your answer Jose :)<br>\nI do think that is the way to refer to a national release of SNOMED and that the ID of the swedish edition is right, at least according to this <a href=\"https://www.hl7.org/fhir/snomedct.html#4.3.1.0.3\">https://www.hl7.org/fhir/snomedct.html#4.3.1.0.3</a><br>\nThere it says that if one does not specify the version, the terminology server might revert to the latest version of the international edition. I at the moment do not specify the version, so that might explain why the codes are not known.</p>",
        "id": 223235481,
        "sender_full_name": "Gino Almondo",
        "timestamp": 1611067430
    },
    {
        "content": "<p>thanks Gino, I did not know of this syntax. The next issue may be if the server does not support the Swedish edition of SNOMED</p>",
        "id": 223248680,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611072592
    },
    {
        "content": "<p>I know that the department of health and welfare are trying to get the swedish version published in the terminology server and are talking with Graham about this.<br>\nWe refer to a swedish Snomed codesystem like this: <a href=\"http://snomed.info/sct|http://snomed.info/sct/45991000052106\">http://snomed.info/sct|http://snomed.info/sct/45991000052106</a></p>\n<p><span class=\"user-mention\" data-user-id=\"192129\">@Daniel Karlsson</span>  will know more about this</p>",
        "id": 223249155,
        "sender_full_name": "Arvid Thunholm",
        "timestamp": 1611072808
    },
    {
        "content": "<p>Right.  It hasn't been explicitly mentioned yet -- but I don't believe that this is a SUSHI/FSH issue.  SUSHI doesn't expand value sets -- that is the job of the HL7 IG Publisher; and if the HL7 IG Publisher doesn't yet support the Swedish edition of SNOMED, that would explain what you're seeing in the published value set.</p>",
        "id": 223250934,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611073396
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195664\">@Arvid Thunholm</span> This is a long delayed response.  But I want to let you know that I was working for a while with <span class=\"user-mention\" data-user-id=\"192129\">@Daniel Karlsson</span>  on getting the Swedish edition of SNOMED CT imported and supported on <a href=\"http://tx.fhir.org\">tx.fhir.org</a>, but we ran into some impediments and since then it's been on the back burner for a while.  I have the importer issue resolved now and I'm happy to try again and I think we should be able to make progress with this now.  The main thing that we need to make it work is a current and complete Swedish edition snapshot in a single set of files (that's what Daniel and I had worked on, but I think it likely will need some updating now).</p>",
        "id": 238892970,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1621080542
    },
    {
        "content": "<p>Sorry for an even longer delay in response,  <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> and I were working on getting the Swedish SNOMED CT edition into <a href=\"http://tx.fhir.org\">tx.fhir.org</a>. Now we're almost at the next Swedish release (May 31) but after this we might give this a new try. Alternatively, we could set up a separate terminology server instance somewhere.</p>",
        "id": 239041337,
        "sender_full_name": "Daniel Karlsson",
        "timestamp": 1621234215
    },
    {
        "content": "<p>I'd say let's give it a go again after May 31.  We just need to figure out a staightforward but systematic approach to combining the files, so it's a repeatable process that can be used to maintain it going forward.</p>",
        "id": 239041662,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1621234464
    }
]