[
    {
        "content": "<p>Is it possible to create a ValueSet that contains not only codes and names, but also preferred values for each code? (e.g., valueQuantity with preferred unit, valueInteger, etc)?</p>",
        "id": 231054902,
        "sender_full_name": " Bob Milius",
        "timestamp": 1616172932
    },
    {
        "content": "<p>Hi Bob.  I'm not sure I fully understand the question.  If you want to bind a ValueSet to a <code>Quantity</code> in order to specify allowable units, that is possible.  From the ValueSet perspective, it's just a normal value set with some codes (presumably from UCUM).  For example:</p>\n<div class=\"codehilite\"><pre><span></span><code>Alias: UCUM = http://unitsofmeasure.org\n\nValueSet: FeetAndInches\n* UCUM#[ft_i] &quot;foot&quot;\n* UCUM#[in_i] &quot;inch&quot;\n\nProfile: ImperialLength\nParent: Observation\n* value[x] only Quantity\n* valueQuantity from FeetAndInches\n</code></pre></div>\n<p>But I'm not sure that is what you are asking.</p>",
        "id": 231079555,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1616183016
    },
    {
        "content": "<p>I suspect what I want isn't currently possible. e.g., when I look at the <a href=\"https://www.hl7.org/fhir/observation-vitalsigns.html\">vital-signs page</a>, there's a nice table that describes the LOINC code, and the UCUM unit code for the value. It would be nice if there was a way to require that, maybe in a value-set. But The <a href=\"https://www.hl7.org/fhir/valueset-observation-vitalsignresult.html\">vital-signs value-set</a>  doesn't have that connection, and the <a href=\"https://www.hl7.org/fhir/vitalsigns.html\">vital-signs profile</a> doesn't enforce any value[x] info, so I'm thinking it isn't possible, unless to I create many slices, one for each code/value[x] combination. Sorry for the rambling, just speculating.</p>",
        "id": 231080700,
        "sender_full_name": " Bob Milius",
        "timestamp": 1616183579
    },
    {
        "content": "<p>Ah.  Well, the way vital signs does it is they actually create sub-profiles for each row in that table.  So if you click on the specific vital sign name, you'll be taken to another profile that is <em>based on</em> the parent vital-signs profile, and enforces the <code>code</code> and related <code>value[x]</code> (and constraints) for that specific vital sign.  For example, the <a href=\"https://www.hl7.org/fhir/bodyheight.html\">BodyHeight</a> profile.</p>",
        "id": 231088884,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1616187472
    },
    {
        "content": "<p>Ah... that makes sense. I'll have to figure out the best way to do that for a hundred different codes in our valuesets. :/</p>",
        "id": 231089738,
        "sender_full_name": " Bob Milius",
        "timestamp": 1616187835
    },
    {
        "content": "<p>Oh my goodness.  I suppose you might be able to do the whole thing via FHIRPath constrains, but that wouldn't be very readable for people looking at your IG.  If it's on a repeatable element (like <code>Observation.component</code>) then you <em>could</em> do a hundred slices -- although I'm not sure if that's better (and it doesn't work if you want to do it higher up on <code>Observation.code</code> and <code>Observation.value[x]</code>).</p>\n<p>Maybe somebody else here has a bright idea. ;-)</p>\n<p>Or maybe 100 profiles really is the right way.  ¯\\_(ツ)_/¯</p>",
        "id": 231099075,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1616193441
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span>  Can you use <a href=\"http://hl7.org/fhir/R4/valueset-definitions.html#ValueSet.expansion.contains.display\">ValueSet.expansion.contains.display</a> or ValueSet.expansion.contains.designation ?</p>",
        "id": 231247135,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1616367760
    }
]