[
    {
        "content": "<p>When insurers are required to provide a list of their provider resources through an API, how challenging will this be for third-party developers to access this?</p>",
        "id": 226845371,
        "sender_full_name": "Noam Kurtis",
        "timestamp": 1613668318
    },
    {
        "content": "<p>When you say \"provider resources,\" I'm not 100% sure what you have in mind.</p>\n<p>But generally for US federal data interop mandates, there's a FHIR implementation guide describing data profiles. For example:</p>\n<ul>\n<li><a href=\"https://www.hl7.org/fhir/us/core/\">US Core</a> for clinical data, or </li>\n<li><a href=\"http://hl7.org/fhir/us/carin-bb/\">CARIN Blue Button</a> for financials, or </li>\n<li><a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/\">PDEX Plan Net</a> for provider directory, </li>\n</ul>\n<p>... and then there's an IG describing authorization</p>\n<ul>\n<li><a href=\"http://hl7.org/fhir/smart-app-launch\">SMART App Launch</a> is typical for user-facing access when there's patient data being shared; or</li>\n<li>no access control at all, when it's public data (<a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/implementation.html#privacy-considerations-1\">as in Plan Net</a>)</li>\n</ul>",
        "id": 226881059,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1613682541
    },
    {
        "content": "<p>So for Plan Net, the developer \"lift\" is basically: decide which (publicly listed) endpoints you want to connect to; issue some FHIR API calls as often as you need to; store and work with the data (see <a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/artifacts.html#example-example-instances\">examples</a>).</p>",
        "id": 226881594,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1613682739
    },
    {
        "content": "<p>Hi Josh, thanks for your reply. I should’ve known better than to loosely use the word “resources” on a FHIR chat! ( I was referring to a provider directory that  payers will be required to make available via an API) <br>\nThanks for  clarifying the Interop federal data mandates - that is very helpful<br>\nWill the PDEX Plan Net be the sole IG for accessing provider directories from Payers? If I understand this correctly, the PDEX  Plan is a function of the da Vinci project. Will there be a parallel provider directory offered via the payers through a separate pathway?</p>",
        "id": 226960727,
        "sender_full_name": "Noam Kurtis",
        "timestamp": 1613740303
    },
    {
        "content": "<p>Or in other words, will there be another way to access the provider directories of the payers other than through the PDEX plan net ?</p>",
        "id": 226960892,
        "sender_full_name": "Noam Kurtis",
        "timestamp": 1613740395
    },
    {
        "content": "<p>There may certainly be additional ways (some standardized, some not). I think the key question for you though is whether regulations will guarantee that this one particular way works everywhere. I'm not sure if there's a definitive answer to this; it depends on a set of rules that have not yet landed in the Federal register as far as I am aware. as far as I know right now the only guarantee is that there will be some kind of publicly accessible fhir based API</p>",
        "id": 227017101,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1613763541
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> thank you</p>",
        "id": 227018541,
        "sender_full_name": "Noam Kurtis",
        "timestamp": 1613764174
    },
    {
        "content": "<p>I imagine one or more companies will aggregate this data and sell that value add as a service, similar to Plaid, HumanAPI, or Turquoise have done for different public endpoints.</p>",
        "id": 227107115,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1613843909
    },
    {
        "content": "<p>Thanks Brendan</p>",
        "id": 227623346,
        "sender_full_name": "Noam Kurtis",
        "timestamp": 1614182936
    }
]