[
    {
        "content": "<p>Hi! </p>\n<ol>\n<li>Do we have any easily accessible stats around the community's use of <a href=\"http://chat.fhir.org\" title=\"http://chat.fhir.org\">chat.fhir.org</a>, e.g. number of registered users, number of streams, number of daily posts, number of posts ever? Looking for some hard data to illustrate the importance of the tool to the FHIR community.</li>\n</ol>",
        "id": 194325848,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1587052281
    },
    {
        "content": "<ol start=\"2\">\n<li>I'm describing zulip, something like the following:<blockquote>\n<p><a href=\"http://chat.fhir.org\" title=\"http://chat.fhir.org\">chat.fhir.org</a> is the beating heart of the FHIR community. Where else can anyone ask a question about  FHIR or CDS Hooks and have a world-class expert like Bryn Rhodes or Graham or Lloyd McKenzie answer, often right away. With over 11,000 registered users, this chat server spans practically every time zone, even simply searching through previous discussions yields a wealth of questions answered and explains previous decisions. It’s a vital tool for the FHIR community and enables rapid, collaborative, design -- a highly relevent and recent example is the collaboration between developers to design FHIR’s response to the need for COVID-19 capacity reporting. </p>\n</blockquote>\n</li>\n</ol>\n<blockquote>\n<p>it’s a bit meta, but to illustrate -- I actually asked on <a href=\"http://chat.fhir.org\" title=\"http://chat.fhir.org\">chat.fhir.org</a> to get stats about usage -- And Lloyd responded to me! <span aria-label=\"smile\" class=\"emoji emoji-263a\" role=\"img\" title=\"smile\">:smile:</span> </p>\n</blockquote>\n<p>Any suggestions, feedback?</p>",
        "id": 194325893,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1587052299
    },
    {
        "content": "<p>For #1 - see <a href=\"stats\" title=\"stats\">https://chat.fhir.org/stats</a></p>",
        "id": 194328903,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587053415
    },
    {
        "content": "<p>For #2 - it's also a treasure trove of past questions and discussion to better understand past decisions</p>",
        "id": 194329039,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587053486
    },
    {
        "content": "<p>Thank you, Lloyd, that was exactly what I was looking for. Above paragraph updated. Also, only 57% of zulip traffic is on public streams! I was surprised by that.</p>",
        "id": 194329985,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1587053899
    },
    {
        "content": "<p>it's getting a lot of use for private messages! interesting...</p>",
        "id": 194388105,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1587087843
    },
    {
        "content": "<p>Well, one thing to keep in mind is that people are much more chatty in private messages, so the average length of private messages is a lot shorter.</p>",
        "id": 194504244,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1587159998
    },
    {
        "content": "<p>And if you weight by messages read, not messages sent, private messages are vanishingly small in an organization sending 57% public strema messages.</p>",
        "id": 194504287,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1587160027
    },
    {
        "content": "<p>So those numbers are consistent with private messages being a very small part of the community's actual communication.</p>",
        "id": 194504325,
        "sender_full_name": "Tim Abbott",
        "timestamp": 1587160050
    }
]