[
    {
        "content": "<p>We've pushed our FHIR Server to <a href=\"https://github.com/ibm/fhir\" target=\"_blank\" title=\"https://github.com/ibm/fhir\">https://github.com/ibm/fhir</a> and we'd like to announce it sometime soon (once documentation is updated).  First, I wanted to be sure that the following would be appropriate uses of this Zulip instance:</p>\n<ol>\n<li>creation of a dedicated stream for this project (where do we request it?) and heavy use of that stream for project collaboration</li>\n<li>a single message to <a class=\"stream\" data-stream-id=\"179240\" href=\"/#narrow/stream/179240-Announcements\">#Announcements</a> to notify the community that this project exists (with a link pointing folks at the new stream for further discussion)</li>\n</ol>\n<p>For #1, the idea would be to move our internal discussions around our project to this public forum and connect with potential collaborators here.  Today this discussion happens in one of two internal channels (on a private Slack):</p>\n<ul>\n<li>a small channel with the core developers (~5 active contributors with heavy collaboration)</li>\n<li>a large channel with almost 100 members, but limited activity</li>\n</ul>\n<p>We'd keep the internal slack channels for private discussions, but ask all those members to join Zulip for discussions that can happen externally.<br>\nIs this the right place to ask wrt the appropriateness of those two items?</p>",
        "id": 177521375,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1570456611
    },
    {
        "content": "<p>I think the general leaning is that if the discussion is public, <a href=\"http://chat.fhir.org\" target=\"_blank\" title=\"http://chat.fhir.org\">chat.fhir.org</a> is fair game.  If you want private discussions and the work isn't on an HL7-sponsored initiative (and private- discussions on anything HL7- sponsored should be rare), then it needs discussion/approval.  That said, I don't think we have an official process.  I'll add this to the FHIR Management Group's agenda for Wednesday.</p>\n<p>(As an aside, this sort of question is best raised in <a class=\"stream\" data-stream-id=\"179160\" href=\"/#narrow/stream/179160-social\">#social</a>.  This thread is reserved for issues/feature requests for Zulip itself - the stream is monitored by our friends who maintain the application.)</p>",
        "id": 177543484,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570470889
    },
    {
        "content": "<p>Thanks Lloyd.  Public discussion around the new project would be the scope, so it sounds like we're good.  I was debating whether <a class=\"stream\" data-stream-id=\"179160\" href=\"/#narrow/stream/179160-social\">#social</a> or <a class=\"stream\" data-stream-id=\"179238\" href=\"/#narrow/stream/179238-Zulip\">#Zulip</a> was the right stream to ask on, but apparently I guessed wrong;  will use <a class=\"stream\" data-stream-id=\"179160\" href=\"/#narrow/stream/179160-social\">#social</a> for related discussions in the future (e.g. for appropriate naming wrt the dedicated stream).</p>",
        "id": 177576264,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1570497794
    },
    {
        "content": "<p>This stream is shared with <a href=\"http://chat.zulip.org\" target=\"_blank\" title=\"http://chat.zulip.org\">chat.zulip.org</a> and is for us to talk about how Zulip actually works / is working</p>",
        "id": 177579772,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570502886
    },
    {
        "content": "<p>(Which is very good! -we love Zulip)</p>",
        "id": 177579780,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570502909
    }
]