[
    {
        "content": "<p>If we have an Appointment [request] associated with 3 actors, and one of these (or rather: their scheduling application) decides to reject because of a conflict, the overall scheduler would need to set the status of one of the other actors to needs-action, notably for the actor that initiated/proposed the scheduling. However, this is not known to the scheduler. The scheduler will know that Actor '#3' has rejected it. Actors #1 and #2 may already have accepted it. So would the scheduler just set the status of both to 'needs-action' ?<br>\nWe may need an actor-status parameter, to query for participant-status for some specified actor.</p>",
        "id": 189792386,
        "sender_full_name": "René Spronk",
        "timestamp": 1583416058
    },
    {
        "content": "<p>That would depend on your systems requirements. The spec is silent on the behaviour here.<br>\nIt could be that the appointment would be cancelled, rescheduled, or otherwise and could also incur costs, or not, maybe depending on timing.<br>\nNot an easy area.</p>",
        "id": 190056715,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1583750586
    },
    {
        "content": "<p>PA has started a project to define how recurring appointments, requirements are being collated here on Confluence <a href=\"https://confluence.hl7.org/display/PA/Recurring+Appointments\">https://confluence.hl7.org/display/PA/Recurring+Appointments</a></p>",
        "id": 243705104,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1624478676
    },
    {
        "content": "<p>The iCal spec has some good detail on recurring appointments, will review that on the next call too...<br>\n<a href=\"https://datatracker.ietf.org/doc/html/rfc5545#section-3.8.5\">https://datatracker.ietf.org/doc/html/rfc5545#section-3.8.5</a><br>\nHave started the draft of the changes for recurring appointments</p>",
        "id": 244488493,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1625087512
    },
    {
        "content": "<p>The base draft is looking in reasonable shape on the working page, enough that we're going to put something into the core specification for discussion and review.<br>\nOf note is the choice to define the recurrence properties not using the Timing datatype - will want feedback on that.<br>\nAnd propose to do some sample resource drafting of what using the timing datatype would look like in comparison.</p>",
        "id": 245237797,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1625689749
    }
]