[
    {
        "content": "<p>Hello to all. This is my first post on this channel.<br>\nMy health system (Northwell Health) is in the process of converting our HIE data into FHIR. Our HIE maintains a hub-and-spoke architecture of our hospitals and ambulatory practices. The \"hub\" is our patient index and the \"spokes\" are individual hospitals/practices. <br>\nCurrent capabilities:</p>\n<ol>\n<li>This model allows us to view the FULL aggregated patient record or PARTIAL by selecting specific sources to look at.</li>\n<li>Demographics could conflict/change over time and we need to maintain clarity on each source's demographics data for a patient.</li>\n</ol>\n<p>As we transition to FHIR we want to maintain the above two capabilities. How would we design our FHIR resource architecture for patients?<br>\nOptions:</p>\n<ol>\n<li>Use Person resource as the \"golden record\" version of the aggregated demographics and link to the resource ALL relevant Patient resources with clinical data hanging off each of those?</li>\n<li>\n<p>Manage 1 \"formal\" Patient resource  ALONG WITH <a href=\"http://Patient.link\">Patient.link</a> (replaces) records with individual source demographics. <br>\nClinical data will ALL be under the \"formal\" patient record with possible tags pointing to the source Patient record for filtering purposes.</p>\n</li>\n<li>\n<p>Something else?</p>\n</li>\n</ol>\n<p>Would love to have an on-camera zoom/Teams meeting to get this group's understanding of the pros, cons, and general challenges.</p>\n<p>Thank you!</p>",
        "id": 273001055,
        "sender_full_name": "Yuval Romm",
        "timestamp": 1645645284
    },
    {
        "content": "<p>This probably a good topic for the #implementers channel given that its scope is much wider than just patient administration, this being an architectural design question. <br>\nWhat you maintain at the hub need not be what you expose to a FHIR client. If there is a strong use case for #2, go for #2. Otherwise, keep things simple by using #1.</p>",
        "id": 273232176,
        "sender_full_name": "René Spronk",
        "timestamp": 1645797910
    }
]