[
    {
        "content": "<p>Hi, we are trying to extract data from existing EMRs in the UK, where Encounter Specialty is very important (core to billing, and, for my use case, core to Deep Learning research): but the underlying EMR systems don't naturally have the ability to create the associated PractitionerRole entity (their data structures do not suit it).  </p>\n<p>I noticed that the Appointment Resource has its own .specialty field, but there is no equivalent in the Encounter resource in R4.  Is there any home I can put the Specialty for an Encounter, without having a PractitionerRole entity?  </p>\n<p>Thanks in advance!  Alan.</p>",
        "id": 245464486,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1625847846
    },
    {
        "content": "<p>Is the specialty a property of the encounter, or of the location or participant of the encounter?  I.e. can you have a single encounter that spans multiple specialties?  It seems like that would generally be the case.  Is your billing concept the <em>primary</em> specialty?  Perhaps the specialty associated with the reason for admission?</p>",
        "id": 245466330,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1625848725
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191764\">Cooper Thompson</span> <a href=\"#narrow/stream/179254-patient-administration.20WG/topic/Encounter.20Specialty.20field/near/245466330\">said</a>:</p>\n<blockquote>\n<p>Is the specialty a property of the encounter, or of the location or participant of the encounter?  I.e. can you have a single encounter that spans multiple specialties?  It seems like that would generally be the case.  Is your billing concept the <em>primary</em> specialty?  Perhaps the specialty associated with the reason for admission?</p>\n</blockquote>\n<p>Yes, the Specialty is the Primary Specialty responsible for the Encounter / Admission.  In the UK, an NHS Encounter is defined as the period of care when you are under a given Specialist and Specialty.  So if you move between two Wards, and are under a different Consultant for both (regardless of Specialty) you will have two billing Episodes.  If you move Wards and have one Consultant for both, its one Episode.  However our interest is the Specialty rather than the Consultant..</p>",
        "id": 245467189,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1625849193
    }
]