[
    {
        "content": "<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12974&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12974&amp;start=0\">12974 - birthPlace extension should be consistent with other Patient extensions</a></p>\n<p>Looking at this tracker, are we sure we want to do what we have in the resolution?  The birthPlace extension is in general-extensions not patient-extensions, which means it can be applied to any person-type resource (Pracitioner, RelatedPerson, Patient, etc.).  If we update the name to be patient-birthPlace, it still can be used in all those places, but then it's super weird that you have patient-birthPlace on a Practitioner resource.</p>\n<p>Also, the vote on that was May 9 2017, but all the zulip discussion was in December, so I think our initial resolution may be something we want to overturn.</p>",
        "id": 153939873,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1519334689
    },
    {
        "content": "<p>I was thinking the same, although I can understand, that consumers of the spec may find the different naming strange.<br>\nMaybe it would be helpful to have categories for the extensions like \"resource-specific\" and \"general\" to point out the difference.</p>",
        "id": 153940084,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1519372509
    },
    {
        "content": "<p>so we have 2 options: leave as is or move to a patient specific extension and change name to patient-birthPlace? I really dont see much use for birthplace on other resources than patient. Does anyone elso do?</p>",
        "id": 153940566,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1519637236
    },
    {
        "content": "<p>I don't see use of it elsewhere.<br>\nDon't really care about it for RelatedPerson or Practitioner</p>",
        "id": 153940567,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1519637283
    }
]