[
    {
        "content": "<p>How should a homeless patient be indicated in the Patient resource. an empty .address may simply mean it is not known, how do I indicate I know the patient is homless?</p>",
        "id": 270231621,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643730018
    },
    {
        "content": "<p>In Australia we defined a profile on address for that.<br>\n<a href=\"http://hl7.org.au/fhir/2021Aug/StructureDefinition-au-address.html\">http://hl7.org.au/fhir/2021Aug/StructureDefinition-au-address.html</a><br>\nAnd check the non fixed address extension on there too.<br>\nWe also provided and example for a no fixed address in Melbourne.<br>\nThis then permits being able to define an area they are in.<br>\nAlso note that there can be people with no fixed address that aren't homeless too. (e.g. Retirees living in a motor home travelling the country. It's very much a home, just not in one place)</p>",
        "id": 270272884,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1643744526
    },
    {
        "content": "<p>There's the admin side (as discussed above), there could also be a Condition to capture the social aspect [but I guess you were  looking for the administrative aspect]. Note it's rather jurisdiction specific how one deals with addresses for homeless persons, whether they have a registered address at a shelter, etc. In a lot of EU countries you have to have a registered address somewhere (although still some people don't have one). If you're on the road in your motor home, assuming you're a law abiding citizen, you'll probably register at an address of a family member or a friend.</p>\n<p>The AU extension 'no fixed address' extension looks good to me..</p>",
        "id": 270277748,
        "sender_full_name": "René Spronk",
        "timestamp": 1643746377
    },
    {
        "content": "<p>As noted in the Argonaut stream, there's also the SDOH stuff too which appears more clinical in nature.</p>",
        "id": 270278053,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1643746507
    }
]