[
    {
        "content": "<p>Trying to differentiate between the two, and there seems to be a contradiction on <a href=\"http://hl7.org/fhir/R4/location.html\" target=\"_blank\" title=\"http://hl7.org/fhir/R4/location.html\">http://hl7.org/fhir/R4/location.html</a></p>\n<p>For Location, the scope has<br>\n<a href=\"/user_uploads/10155/xiEA-GL5s4QMbS8Yoosxt1Ur/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/xiEA-GL5s4QMbS8Yoosxt1Ur/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/xiEA-GL5s4QMbS8Yoosxt1Ur/pasted_image.png\"></a></div><p>yet further down the page on boundaries, it has </p>\n<p><a href=\"/user_uploads/10155/WBifc1aMVY1W_1yqVIV9Ao8t/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/WBifc1aMVY1W_1yqVIV9Ao8t/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/WBifc1aMVY1W_1yqVIV9Ao8t/pasted_image.png\"></a></div>",
        "id": 180852237,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1573838221
    },
    {
        "content": "<p>It is truely a confusing space, as many systems do confuse these, and even create orgs and locations for the same logical things.<br>\nE.g. creating an Organizational unit around a Location.</p>",
        "id": 180955400,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1573992959
    },
    {
        "content": "<p>I have thought much about this as well. In our EHR we have one \"unit\" concept, and it used both for organizational and physical \"units\" or \"locations\". Im not really sure I see the use of having these as separate resources when many other resources are grouped together and differentiated with types or codes. It could even make interoperability harder as systems confuse these. We would probably map them to the same thing internally regardless.</p>\n<p>We will end up exposing the same internal unit entities, sometimes as Organizations and sometimes as Locations. Overall, when it comes to e.g. Encounters and Appointments, we see that there is one level of department/specialty, and one level of where care is provided. We represent both these as \"Units\" of different \"types\". </p>\n<p>E.g. <br>\nGeneral Surgery Department, Ward 2<br>\nGeneral Surgery Department, Surgery clinic<br>\nCardiology Department, Ward 2  (of course, patients can be treated under different specialties on the same ward)<br>\nCardiology Department, Cardiology clinic</p>\n<p>One we would probably map to Organization, and the other to Location as the FHIR spec. </p>\n<p>The only thing that is clearly a Location to me are things like Rooms and Beds (Bed Location, where you put the bed, not necessarily the thing one wheels). </p>\n<p>For us, moving things like wards to Organization, and have things like rooms as Locations would seem better. If needed, some additional attribute could be added to Organization to determine whether it is a \"logical construct\" like an organization, or a \"physical healthcare facility\" or similar.</p>",
        "id": 181633004,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1574425870
    },
    {
        "content": "<p>Thanks for describing this with such detail and just goes to show the it's a big grey area.<br>\nThere are some things that are definitely orgs, and others that are definitely locs. Then all the stuff in between.</p>",
        "id": 181909710,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1574765515
    },
    {
        "content": "<p>I might prep up some content to describe this.</p>",
        "id": 181909802,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1574765588
    },
    {
        "content": "<p>This is something that <span class=\"user-mention\" data-user-id=\"193299\">@Luke Duncan</span> worked on in the IHE profile using the FHIR resources -- mCSD. There are now two models in there.</p>",
        "id": 181925222,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574778073
    }
]