[
    {
        "content": "<p>I was curious to understand more about <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13607\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13607\">GF#13607</a>, which added hoursOfOperation to Location.  There was a comment saying it would be inappropriate to support hoursOfOperation on the Organization resource.  I'm just curious to understand the rationale preferring Location over Organization because I see validated healthcare directory IG adding more and more extensions to Location (like whether new patients are accepted).  Admittedly, boundaries are fuzzy between Organizations and Locations, but adding these new elements to Location seems to make those boundaries even fuzzier.  Thoughts?</p>",
        "id": 153945185,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1521136954
    },
    {
        "content": "<p>In NZ primary care there is a very clear distinction between Location (facility in our nomenclature) and Organization. Organizations can own multiple general practices and those practices may be spread over several facilities, each with its own opening hours and enrolling status.</p>",
        "id": 153945216,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1521141603
    },
    {
        "content": "<p>My  understanding is that a Location doesn't <em>do</em> anything. It doesn't accept patients or open or close or provide services. It's just an address, a place, a room, a geolocation. <br>\nIt's always the Organization doing stuff <em>at</em> a location. So if an Organization has different \"outposts\" in different locations which offer different services at different times, these \"outposts\" IMO would be Organizations themselves with a partOf-relationship to the primary Organization.</p>",
        "id": 153957136,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525859468
    },
    {
        "content": "<p>...or - as Brian wrote in the follow-up to the CR - the things an Organization does at a specific location could be modeled as HealthcareService.</p>",
        "id": 153957137,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525859594
    },
    {
        "content": "<p>I'd prefer to model those as HealthcareService resources</p>",
        "id": 153957157,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1525868100
    },
    {
        "content": "<p>But I agree with Michelle, that the latest additions to location such as hoursOfOperation make the boundaries between Location and HealthcareService/Organization more unclear. The only context in which opening hours for a location make sense is if a Location is physically inaccessible in a certain period of time, like \"gate closes at midnight\". (Which is - as I understand it - exactly the use case for which this element has been introduced).</p>\n<p>Maybe the term \"hoursOfOperation\" which has been chosen - I assume - for reasons of consistency with HealthcareService, is somewhat misleading.<br>\n\"openingHours\" or \"accessibilityHours\" would be more to the point, considering we're talking about floors and buildings here, not provision of service.</p>",
        "id": 153957185,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1525872831
    },
    {
        "content": "<p>That sounds like some good wording to include in the descriptive section of the property(s).</p>",
        "id": 153957506,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1525948304
    }
]