[
    {
        "content": "<p>What does this group think about the idea of storing the mother's maiden name as a RelatedPerson resources (fixing the relationship to mother, and the name type to maiden) rather than using the existing string-based extension? If it's important to capture more than just the mother's maiden last name, having the ability to use the HumanName data type would be helpful. This is coming up in a v2-to-FHIR discussion where PID-6 can contain more than just the last name (<a href=\"https://v2plus.hl7.org/2021Jan/data-type/XPN.html\">https://v2plus.hl7.org/2021Jan/data-type/XPN.html</a>) and we don't want to lose information by either just transforming the last name to the extension or stringing together other name components into a string value in the extension.</p>",
        "id": 270577549,
        "sender_full_name": "Craig Newman",
        "timestamp": 1643906113
    },
    {
        "content": "<p>That's not within the scope/usage of RelatedPerson ..</p>",
        "id": 270578476,
        "sender_full_name": "René Spronk",
        "timestamp": 1643906497
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> - this doesn't feel right to me, anyone else?</p>",
        "id": 270916954,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1644188528
    },
    {
        "content": "<p>To me it looks like if the mother's maiden name is part of identifying the person, it belongs in Patient as an extension. RelatedPerson is for for people relevant to care.</p>",
        "id": 270918184,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1644190499
    },
    {
        "content": "<p>In many cases, I think mother's maiden name is really more of a knowledge-based authentication question/answer than a real demographic property of the mother.   If you are needing to track KBA properties (like mother maiden name, first car, favorite sports team, etc.) it seems like putting those in either a common extension or maybe Observation makes the most sense.    Scattering the KBA properties across RelatedPerson and other resources seems undesirable, as an app trying to do KBA would need to 1) know where all the KBA answers are and 2) requests scopes for all those resources.</p>",
        "id": 270993222,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1644247191
    },
    {
        "content": "<p>While that perspective is clear from the RelatedPerson's first sentence \"Information about a person that is involved in the care for a patient, .......\", when looking at the Scope and Usage it would seem that the mother's maiden name would fit \"RelatedPersons typically have a personal or non-healthcare-specific professional relationship to the patient. A RelatedPerson resource is primarily used for attribution of information, since RelatedPersons are often a source of information about the patient. \" the person need not be active in providing care and it is about attribution.  If the intent is for mother's maiden name to only be the patient's attribute for whom you need to collect that AND that RelatedPerson is really for those involved in the care, the Scope and Usage statements would have to be refined as that goes beyond those providing care.</p>\n<p>Somewhat related, but more context, for a mother-baby use case there would be two Patient resource instances and one RelatedPerson resource to link the two?  Other?</p>",
        "id": 271022987,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1644259060
    },
    {
        "content": "<p>That mother baby example isn't the mothers maiden name value unless I've misunderstood the data.</p>",
        "id": 271070702,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1644285246
    },
    {
        "content": "<p>Correct, just separate, but related so we can get the full picture of baby, baby's mother's maiden name, relationship to mother and then mother's mother's maiden name.</p>",
        "id": 271131698,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1644329142
    },
    {
        "content": "<p>The mother is a different person, and mother is the role the person plays. Storing data of a different person in the patient instance seems to be weird. So, using extensions for KBA seems to be a convenient workaround only, esp. because this is a typical US feature.</p>",
        "id": 271420818,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1644494277
    },
    {
        "content": "<p>KBA is also not unique to healthcare processing, would tend to be managed in general identity methods. As we recommend for User management.</p>",
        "id": 271435098,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644501867
    }
]