[
    {
        "content": "<p>Curious why the mother's maiden name extension (<a href=\"http://hl7.org/implement/standards/fhir/extension-patient-mothersmaidenname.html\">http://hl7.org/implement/standards/fhir/extension-patient-mothersmaidenname.html</a>) uses the string data type rather than HumanName. Typically, it is the mother's maiden surname that is captured and shared, but why not offer the ability to send discrete name parts?</p>",
        "id": 258572381,
        "sender_full_name": "Craig Newman",
        "timestamp": 1634832255
    },
    {
        "content": "<p>As I understand the US context mothers maiden name is a 'shared secret', akin to the name of your first dog, the city of birth of your father, etc. As such the 'name-structure' aspect doesn't really matter.  In Europe (different law system), if we were to have mothersName as an extension, it would be using HumanName as a data type. But in the European context, that's not a shared secret, but part of a patient's demographics.</p>",
        "id": 258676225,
        "sender_full_name": "René Spronk",
        "timestamp": 1634889320
    },
    {
        "content": "<p>I understood it to simply be the pre-marital surname, not any other parts.<br>\nI guess you coukd also just uss another old name in the repeatin name on patient if you wanted more details.</p>",
        "id": 258688748,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1634896568
    },
    {
        "content": "<p>In many use cases (even in the US), it's treated as demographic information to aid in patient matching. I agree that it's sometimes used as a security verification question, but it's more that just that.</p>",
        "id": 258718929,
        "sender_full_name": "Craig Newman",
        "timestamp": 1634912711
    },
    {
        "content": "<p>I wouldn't think that it would be a repetition of the patient's name as they've (likely) never used that surname (assuming the mother changed her name at marriage) or they are currently using it (if she did not and the child uses her surname)</p>",
        "id": 258719126,
        "sender_full_name": "Craig Newman",
        "timestamp": 1634912784
    },
    {
        "content": "<p>Sorry, missed the \"mothers\" part in there... I should have read more closely.</p>",
        "id": 258798201,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1634956270
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> : So since v2 comes in with a full name data type, should we merge the components into a string OR create an origignalHumanName extension to preserve the details OR do you plan to update the core extension and make it a HumanName data type?</p>",
        "id": 263897981,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1638816689
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> any thoughts on this one?</p>",
        "id": 263938671,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1638832576
    },
    {
        "content": "<p>Note that some countries already use an extension for 'mothersName' (with a HumanName data type). 'maiden' is a name type. That would fit this use case as well.</p>",
        "id": 263964507,
        "sender_full_name": "René Spronk",
        "timestamp": 1638859459
    },
    {
        "content": "<p>just because it was done that way in v2, should not make us invent use-cases to justify something that our current use-cases don't call for. Meaning, the use-cases I know of explicitly call for just the maiden name. Providing more than that is considered unnecessary and a risk. <br>\nThe alternative you do have is to create a RelatedPerson where you carry the full name and other information.</p>",
        "id": 263996405,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638881855
    },
    {
        "content": "<p>If you have the full mother's name, why not just put that in <a href=\"http://Patient.contact.name\">Patient.contact.name</a> instead of the extension?  That way you can represent the mother's name and the father's name the same way.  It is probably worth adding some clarification around when to use <a href=\"http://Patient.contact\">Patient.contact</a> and when to use the extension.  But honestly I'm not sure when you'd use that extension instead of the <a href=\"http://Patient.contact\">Patient.contact</a>.</p>",
        "id": 264007202,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1638886614
    },
    {
        "content": "<p>Well, one needs to be able to contact a contact person. Without contact details, or in the case of a deceased person, it'd be difficult to have them as contacts. We're talking about demographic details of the patient, not about their contact parties. If it's purely about demographics then RelatedPerson also doesn't fit the bill. You're stuck with some sort of extension.</p>",
        "id": 264010291,
        "sender_full_name": "René Spronk",
        "timestamp": 1638888048
    },
    {
        "content": "<p>The invariant on the <a href=\"http://Patient.contact\">Patient.contact</a> structure doesn't require actual contact info.  Having a name is sufficient.    The other option is RelatedPerson.  I'm not sure I like the idea of having a third way of identifying someone's mother's name.</p>",
        "id": 264015049,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1638890264
    }
]