[
    {
        "content": "<p>I am trying to implement a Datamodel for our company using Invoice FHIR data structure.<br>\n<a href=\"https://www.hl7.org/fhir/invoice.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/invoice.html\">https://www.hl7.org/fhir/invoice.html</a><br>\n<a href=\"https://www.hl7.org/fhir/invoice-example.json.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/invoice-example.json.html\">https://www.hl7.org/fhir/invoice-example.json.html</a></p>\n<p>We specifically want to see a Invoice sample/example from a Provider or Nursing Home/Homecare facility who currently uses FHIR Datamodel.<br>\nThere are couple of queries that I currently have:</p>\n<ol>\n<li>\n<p>There is only one tag for date field.<br>\n\"date\" : \"&lt;dateTime&gt;\", // Invoice date / posting date<br>\n  If the services availed by an insured is two weeks, how does a provider/facility send this two weeks date range through this Invoice model?  </p>\n</li>\n<li>\n<p>Does the provider/facility calculates average daily amount for the service on day basis and sends 14 Invoices corresponding to each day of the service availed ?</p>\n</li>\n<li>Is there a provision to include net amt/gross amount on hourly basis alongside with option to have date ranges?</li>\n</ol>\n<p>Thanks for any information you provide. Please let me know if this post needs to goto another stream.</p>",
        "id": 191491620,
        "sender_full_name": "raj",
        "timestamp": 1584977990
    },
    {
        "content": "<p>Invoice.date is the date et which the INvoice has been posted, so it's always a date, never a period.<br>\nServices that are billed in the invoice my have been provided over a preiod of time, which is stated in ChargeItem.occurence[x]</p>\n<p>What we don't have is an overarching period on the Invoice that covers the overall period in which any of the billed items have been provided.<br>\nIs that what you need?</p>",
        "id": 194903267,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1587545638
    }
]