[
    {
        "content": "<p>In some use cases it is necessary to know the time zone of home-based patients and when their day starts (e.g. to know when their sleeping hours are, or whether something happened at their 8am). Where can that info be modeled in FHIR?</p>\n<p>I thought of Encounter.location. But timezone would be only implicit (I guess it could be indirectly derived from location.position). And location.hoursOfOperation is described in a way that seems to exclude the use for home-based patients (to indicate when their \"awake\" day starts and ends)</p>",
        "id": 205092412,
        "sender_full_name": "Javier Espina",
        "timestamp": 1595838990
    },
    {
        "content": "<p>I'd suggest in most places this would have to be implicit, and in the community system I used to work on it was based on the home address of the patient. In a residential aged care facility it might be implied in the location of the facility, it could be in a patient calendar which included respite/leave details, in a hospital environment it might be based on encounter data.</p>",
        "id": 205412283,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1596056040
    },
    {
        "content": "<p>I would add that the \"whether something happened at their 8am\" is often recorded in the resource describing that <em>something</em>. For instance, Observations have an <code>.effectiveDateTime</code> / <code>.effectivePeriod</code> / <code>effectiveTiming</code> / <code>effectiveInstant</code> field. Same for nearly all resources describing that something happened. Ideally, that field would be expressed in local time of the observation, including time zone information. From this information you're able to tell whether it was 8am for the patient, even when they were on holiday several time zones from their home. <span class=\"user-mention\" data-user-id=\"192965\">@Javier Espina</span></p>",
        "id": 205667386,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1596262641
    },
    {
        "content": "<p>Same for Encounter.period. You can (and should) record the time zone there.</p>",
        "id": 205667430,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1596262695
    }
]