[
    {
        "content": "<p>I know we've had this discussion before at WGMs (in context of our lengthy gender debates...) but to my knowledge not with a definite solution.</p>\n<p>But currently this has come up in Germany, since we have officialy introduced the \"third\" administrative gender \"divers\".<br>\nSystem vendors are now wondering how to address a person with an administrative gender of \"other\".<br>\nSome people have advised us to put Herr/Frau/Mr./Mrs. in the HumanName prefix. This solution however has a couple of downsides:<br>\n1. we don't have a standard qualifier for \"salutation\" to distinguish this prefix from <em>actual</em> name part prefixes<br>\n2. in German (and probably other languages as well), salutation is only half the answer, because basically every adjective needs to be gendered and even the salutation changes depending on casus.<br>\n3. it's not clear, how to use a prefix to express a patient's request to be addressed gender neutrally<br>\nTherefore we are leaning towards \"extension\".<br>\nQuestion: is this a potential candidate for standard extension, or is this something that should be defined with national scope?</p>",
        "id": 162599171,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554448035
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> any thoughts?<br>\nThe patient station or title I've always thought of as prefix yes, and  ever had other uses of it, but that's just my personal experience.</p>",
        "id": 162602966,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1554452447
    },
    {
        "content": "<p>FYI: By \"we don't have a qualifier\", I was referring to this extension: <a href=\"http://hl7.org/implement/standards/fhir/extension-iso21090-en-qualifier.html\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/extension-iso21090-en-qualifier.html\">http://hl7.org/implement/standards/fhir/extension-iso21090-en-qualifier.html</a></p>",
        "id": 162612112,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1554461801
    },
    {
        "content": "<p>ask to add TITLE (from <a href=\"http://hl7.org/implement/standards/fhir/v3/EntityNamePartQualifier/cs.html\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/v3/EntityNamePartQualifier/cs.html\">http://hl7.org/implement/standards/fhir/v3/EntityNamePartQualifier/cs.html</a>) to the value set</p>",
        "id": 162617479,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554466923
    },
    {
        "content": "<p>Is the German divers value for intersex or gender identity?  I've seen conflicting info, so it isn't clear to me which it is.</p>",
        "id": 162625243,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1554472657
    },
    {
        "content": "<p>We use a discrete list of patient pronouns to drive form of address, rather than title, gender identity, or any of the other sex or gender values.  Adding an extension to track preferred pronouns is probably a good idea.  We haven't really encountered other systems that can consume patient pronouns, so we have not crossed the bridge of having to exchange that data yet.</p>",
        "id": 162625923,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1554473102
    },
    {
        "content": "<p>\"Divers\" is actually an administrative gender, so basically the equivalent of gender=\"other\". <br>\nBTW we are currently tending towards creating an DE-realm extension \"formOfAddress\" of type coding with an extensible binding to the values male|female|neutral<br>\nDoes anyone think this is useful enough to make it a standard extension?</p>",
        "id": 163536225,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1555483961
    },
    {
        "content": "<blockquote>\n<p>ask to add TITLE (from <a href=\"http://hl7.org/implement/standards/fhir/v3/EntityNamePartQualifier/cs.html\" target=\"_blank\" title=\"http://hl7.org/implement/standards/fhir/v3/EntityNamePartQualifier/cs.html\">http://hl7.org/implement/standards/fhir/v3/EntityNamePartQualifier/cs.html</a>) to the value set</p>\n</blockquote>\n<p>TITLE is not the same thing as pronoun...</p>",
        "id": 163552167,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1555500784
    },
    {
        "content": "<p>An pronoun on the other hand is not really a name part. Systems who do not support the extension and therfore assume a prefix of \"Mr. or Mrs.\" to be an actual name part, could easily end up with a douplicate \"Mr./Mrs.\", if they add/chose form of address based on administrative gender.</p>\n<p>Also, my expectation for a prefix is that it can simply be concatenated with the name, whereas the form of address (at least in German) can be different depending on context.<br>\nTo give you an example: We would write \"Sehr geehrter <em>Herr</em> Mustermann\", but in another context it would be \"...hiermit berichten wir über <em>Herrn</em> Mustermann\".<br>\nI would assume that auto generated salutation (e.g. in a letter) would be implemented as \"if this than that\" not as concatenation of name parts.</p>",
        "id": 163552773,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1555501450
    }
]