[
    {
        "content": "<p><a href=\"https://stackoverflow.com/questions/59100247/fhir-resource-needed-for-capacity-handling\" target=\"_blank\" title=\"https://stackoverflow.com/questions/59100247/fhir-resource-needed-for-capacity-handling\">https://stackoverflow.com/questions/59100247/fhir-resource-needed-for-capacity-handling</a></p>",
        "id": 182162423,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575019327
    },
    {
        "content": "<p>This is an interesting area! </p>\n<p>I would really like this issue to be incorporated into R5: <a href=\"https://jira.hl7.org/browse/FHIR-22687\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-22687\">https://jira.hl7.org/browse/FHIR-22687</a>. We need to be able to associate Slots with Services, and then allocate resource requirements (Practitoner, Locations, Equipment...) to them, as well as allocate resources to the slots. </p>\n<p>When it comes to the use case in the link, and the suggested solution it is a bit tricky. The question is about capacity for a <em>clinic</em> while the answer refers to a Schedule for a <em>Practitioner</em>. The answer maps well to what I am used to, you get free slots from a practitioner's schedule. But what is a clinic in FHIR? This distinction between clinic and practioner schedules caused us some headache when implementing our EHR in the UK where a clinic was seen as something distinct from a practitioner, run by a consultant together with multiple registrars and we were used to Schedules being for individual practitioners (or other resources such as equipment or locations).</p>",
        "id": 183676978,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1576607864
    },
    {
        "content": "<p>Slots are associated with schedules, and they can be associated with healthcare service resources, which are service types. Appointments are the connection to actual services to patients.</p>",
        "id": 184414553,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1577614096
    },
    {
        "content": "<p>Which you decide to use in your scheduling system depends on where you track, and who you expose it to.</p>",
        "id": 184414556,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1577614136
    },
    {
        "content": "<p>Some types of services don't advertise who the practitioner is, and you just get a service appt. But other s do expose the practitioner.</p>",
        "id": 184414566,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1577614189
    }
]