[
    {
        "content": "<p>A quick question on implementation, one of our client wants to represent and ordered inpatient stay as a ServiceRequest in the CRD bundle. Any thoughts or opinions on whether is valid and the order  be sent by organizations as part of CRD ?</p>",
        "id": 177335549,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1570193652
    },
    {
        "content": "<p>Any guidance on this topic, the ServiceRequest object allows for it (however in the Scope and Usage examples, it is denoting this as Exploratory). So just wanted to confirm that we can create a ServiceRequest object that denotes the stay incase of Inpatient or that it will be performed as an outpatient activity.</p>",
        "id": 177776886,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1570679432
    },
    {
        "content": "<p>An inpatient stay could be inferred as the result of a ServiceRequest or an AppointmentRequest.  What gets inferred depends on the nature of the requested service.</p>",
        "id": 177776974,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570679638
    },
    {
        "content": "<p>Instead of inferring would it be erroneous to send an additional explicit ServiceRequest for the stay, which by itself may have additional coverage requirements in some cases apparently according to our client.</p>",
        "id": 177777340,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1570680211
    },
    {
        "content": "<p>Not erroneous, but CRD is triggered by what the clinicians are actually ordering.  The clinician isn't (generally) filling out the order because they're concerned about coverage requirements.  They're filling out the order because they're wanting to order something.  CRD looks at what they're ordering and lets them know if there are any things the payers think they should know (related to coverage or other stuff).  We <em>don't</em> want to change how the clinicians order or what they order.  If the clinician actually orders an encounter, the CRD service will see that.  However, the CRD service can't <em>count</em> on seeing that and will absolutely have to make inferences.  If the inference is \"this might be inpatient or outpatient and the rules are different\", then that will drive the cards that get passed back.</p>",
        "id": 177816362,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570718487
    }
]