[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> would it be possible for a CDS-Hook card  or maybe the DTR smart app to return an option delegate the completion of the information gathering and PAS process to another person, like a office staff member or medical assistant? Office staff is often involved in prior auth. I'm going to cross post this on Da Vinci DTR.</p>",
        "id": 188139926,
        "sender_full_name": "Viet Nguyen",
        "timestamp": 1581621329
    },
    {
        "content": "<p>In theory, that's what Task would do.  Once a Task is created, you can assign it to others, create a time-frame for completion, etc.  However, support for external manipulation of task lists isn't yet something widely supported in most EHR software.</p>",
        "id": 188147521,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581626001
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"192054\">@Viet Nguyen</span> , Lloyd -- apologies for the super delayed response. I think Lloyd sums up the current state of it well. I, personally, think that delegation of administrative tasks away from the clinician is so important that we oughn't be limited by current state. I've even said exactly this in negative ballot comments (I think a few times, but I can only find <a href=\"https://jira.hl7.org/browse/FHIR-24726\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-24726\">one</a>).</p>",
        "id": 188500869,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582067343
    },
    {
        "content": "<p>Overall, the <a href=\"https://jira.hl7.org/browse/FHIR-24703\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-24703\">potential</a> for <a href=\"https://jira.hl7.org/browse/FHIR-24725\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-24725\">increasing</a> provider <a href=\"https://jira.hl7.org/browse/FHIR-24335\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-24335\">burden</a> is pretty significant in CRD/DTR.</p>",
        "id": 188500872,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582067344
    },
    {
        "content": "<p>We certainly don’t want to increase burden. What’s the best (or available) paths forward? Does Epic have the ability to assign tasks to others in a practice? I can check with the other vendors too.  I’m thinking the DTR Smart app would have to save the session and and maybe know to whom the completion was delegated. The host EHR would assign the delegation (via Task resource or inherently). The person delegated  the task would have to resume the session in smart app and complete the DTR process. I think this would happen when Clincial notes or lab data may not be available when the DTR app was launched.</p>",
        "id": 188506382,
        "sender_full_name": "Viet Nguyen",
        "timestamp": 1582072909
    },
    {
        "content": "<p>The general concept of a back office work queue is very widely implemented in epic. I'd think that any prior auth workflow that resulted in something other than a yes, should be moved to a work queue. Relaunching the Smart app with a different user and the same appContext could reasonably enable this now.</p>",
        "id": 188509421,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582076880
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> How could you tie into that back office work queue with the FHIR resources and card types available?</p>",
        "id": 188510663,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582078782
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191358\">@Dennis Patterson</span> <span class=\"user-mention\" data-user-id=\"192825\">@Jeffrey Danford</span>  - Would you please take a look at this discussion and weigh in from the perspectives of Cerner and Allscripts? The ability for the EHR to support delegation and alternate workflows that are initiated by CRD/DTR would help address concerns raised about workflow. I'm just not sure where the SMART/CDS-Hooks/FHIR parts of CRD/DTR fits in with native EHR functionality.</p>",
        "id": 188565425,
        "sender_full_name": "Viet Nguyen",
        "timestamp": 1582133313
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192054\">@Viet Nguyen</span>  Allscripts has the ability to assign tasks (not yet FHIR Tasks) to individuals and groups. Agreed this should be functionality supported in CRD/DTR. In Allscripts the CRD task is typically delegated to a nurse or a nurse group. They do their thing then the assign the task to the provider to sign it. The workflow may also be iterative, i.e. the task moves back and forth between the recipients depending on what's required at a given point.</p>",
        "id": 188825267,
        "sender_full_name": "Jeffrey Danford",
        "timestamp": 1582391633
    },
    {
        "content": "<p>Yes, I think if there's a way to queue or assign the smart app link (along with appcontext), from the cds card, that would provide options for alternative flows (like front-office staff actually performing the PA flow)... Having the feedback on 'is it covered' and the estimated patient cost would still be possible (when keeping the cds info), while we also streamline the flow into PA process, if required... I think that would be a good balance.</p>",
        "id": 188825813,
        "sender_full_name": "Patrick Haren",
        "timestamp": 1582392546
    },
    {
        "content": "<p>It could be a function of the EHR (in terms of functionality to support a smart link) without needing any additional interoperability specification</p>",
        "id": 188825872,
        "sender_full_name": "Patrick Haren",
        "timestamp": 1582392633
    },
    {
        "content": "<p>(Lloyd, Viet -- apologies for the delayed response).<br>\nI, independently, came to the same conclusion as Patrick. A returned card could easily be re-displayed to a different user (preserving <code>appContext</code>, but perhaps not <code>suggestions</code>).</p>",
        "id": 189187064,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582779160
    },
    {
        "content": "<p>A CDS Hooks <code>card</code> is simply a task. The ability to defer it by the user seeing it to another user is merely a capability of the CDS client -- which doesn't require an interop spec.</p>",
        "id": 189187066,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582779165
    },
    {
        "content": "<p>The CDS Service could provide additional value by indicating when a card would be most appropriately deferred. This would require an interop spec. We could achieve this in a few different ways, including:</p>\n<ul>\n<li>return no card to the current user and POST a Task resource to the CDS Client</li>\n<li>markup the card to indicate to the CDS Client that it's deferrable, either through an extension or a standard element</li>\n</ul>",
        "id": 189187067,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582779167
    },
    {
        "content": "<p>It's unclear to me how a CDS Service would know when a card is appropriately deferred to another user.</p>",
        "id": 189187068,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582779168
    },
    {
        "content": "<p>It should be possible to know whether the task is appropriate to defer to another <em>time</em>.  Anything that can be done 'later' could also potentially be done by someone else.  And any mechanism that allows persisting something as a \"remind me later\" wouldn't need much tuning to swap the \"me\" for \"some other person\".  Actions like \"look at this guideline\" or \"switch to this med\" when prescribing don't make much sense to defer.  \"Fill out this form before submitting a prior auth\" would be fine to defer.</p>",
        "id": 189189423,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582783466
    },
    {
        "content": "<p>However, the way we say \"please fill out a Questionnaire\" is still by creating a Task, so not sure how the card would get around that</p>",
        "id": 189189439,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582783510
    },
    {
        "content": "<p>please launch this SMART app, is the same as please fill out this Questionnaire, right?</p>",
        "id": 189189463,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582783558
    },
    {
        "content": "<p>There's a specific card for \"launch this SMART app\"</p>",
        "id": 189189656,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582783805
    },
    {
        "content": "<p>\"fill out this questionnaire\" doesn't necessarily mean there will be a SMART app in play.</p>",
        "id": 189189669,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582783828
    },
    {
        "content": "<p>This is a great topic that I'm finding to be more and more prevalent in connectathon discussions.  In Sydney there was a use-case of having a CDS Service create a task / todo / inbox message for a practitioner to deal with once they logged back in.  For non-critical decision support, this could be appropriate.  Or, these services may be asynchronously listening for FHIR subscriptions notifications (rather than hooks) and want to then create work or an inbox message for a practitioner in a similar manner.</p>\n<p>There's overlap in this thread with deferred work concept, with the added element of delegation.  Both hinge on what API is called to create the deferred work.  Cerner has a task model which isn't exposed currently in our FHIR implementation.  Beyond the Task resource, I'm curious if the Communication resource would be applicable in some of these situations.  Either could be consumed by the CDS Service or the launched SMART App, depending on workflow.</p>\n<p>As for message contents, deferring a card itself could work, but other situations may call for another practitioner to open's a patient's chart and re-trigger patient-view to allow the CDS Service to re-assess current state.</p>",
        "id": 189223585,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1582817408
    },
    {
        "content": "<p>One of the challenges with persisting 'cards' rather than FHIR resources is that there'd be no ability for subsequent CDS calls to query to check whether there's already a \"to-do\" on file (and thus avoid creating yet another one).  Using Task for this would make the to-do list queriable and potentially manipulatable (changing priority, timeline, etc. as a card action).</p>",
        "id": 189230594,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582821646
    }
]