[
    {
        "content": "<p>Hello, I am wondering what others have done, or if there is a recommendation to limit the CDS Hook requests sent from a client to a service. Specifically, if the service is a payer, have others implemented strategies to only make CDS Hook requests to a specific payer for orders where that payer is documented on the order or the patient chart?</p>",
        "id": 253629873,
        "sender_full_name": "Joseph Sadlon",
        "timestamp": 1631817685
    },
    {
        "content": "<p>There had been discussion about possibly introducing a 'pre-filter' in a service's configuration that would indicate how an EHR would know whether a particular hook invocation was potentially of interest.  However, there's no sign of support for that in the current draft, so I'm presuming the community opted to not pursue it for one reason or another.  You could ask on the <a class=\"stream\" data-stream-id=\"179159\" href=\"/#narrow/stream/179159-cds-hooks\">#cds hooks</a> stream.  What is the underlying concern that's driving your question?</p>",
        "id": 253667929,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631835961
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> the underlying concern is two fold. First, making unnecessary calls to a vendor who will only respond to a small percentage (&lt;10%) and secondly sending clinical data to a vendor who does not need the data. I can post in the CDS Hooks stream and see if anyone has mitigated this. Thank you.</p>",
        "id": 253674466,
        "sender_full_name": "Joseph Sadlon",
        "timestamp": 1631840921
    },
    {
        "content": "<p>One of the sample hooks is a patient view hook that's only relevant to specific newborns within about their first 24 hours of life.  To the best of my knowledge, it firs every time a patient record is brought up...</p>",
        "id": 253678133,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631844012
    }
]