[
    {
        "content": "<p>Hello All!</p>",
        "id": 236752788,
        "sender_full_name": "Larry Decelles",
        "timestamp": 1619732872
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , for this CRD functionality is EHR access part of the workflow?<br>\n<a href=\"http://build.fhir.org/ig/HL7/davinci-crd/hooks.html#smart-on-fhir-hook-invocation\">http://build.fhir.org/ig/HL7/davinci-crd/hooks.html#smart-on-fhir-hook-invocation</a></p>",
        "id": 239277507,
        "sender_full_name": "Larry Decelles",
        "timestamp": 1621353163
    },
    {
        "content": "<p>I'm not sure I understand the question.  Access to the EHR by a CDS service is always a 'potential' part of the CDS Hook workflow.  Whether servers will actually query the EHR is dependent on whether the the CDS client satisfies requested pre-fetch and whether there's any other information the service needs to provide the needed guidance.</p>",
        "id": 239281592,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621354446
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, This is the question we are trying to answer: “Other than EHR integration, what other interface methods could be used to allow not just EHRs, but ALL stakeholders the ability to access the prior authorization requirements in the FHIR enabled repository?” I was thinking this would satisfy this request. <a href=\"http://build.fhir.org/ig/HL7/davinci-crd/hooks.html#smart-on-fhir-hook-invocation\">http://build.fhir.org/ig/HL7/davinci-crd/hooks.html#smart-on-fhir-hook-invocation</a></p>",
        "id": 239345197,
        "sender_full_name": "Larry Decelles",
        "timestamp": 1621383074
    },
    {
        "content": "<p>The SMART app approach could certainly be used by others, the issue is whether they'd be able to serve up the information a payer would need to make the decision on whether prior authorization would be required.  The SMART app basically passes in the draft order and (ideally) the pre-fetch information.  If that's enough to make an automated decision on prior authorization (or give any other guidance), then that could work</p>",
        "id": 239359359,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621394441
    }
]