[
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, In the CRD IG there is this statement; \"Potential drug-drug interactions based on existing payer knowledge\". Does this imply the payer knowledge would be sent in the prefetch? For example, would the patient's current medications need to be sent in the prefetch in addition to the new drug in question. Otherwise, how would the payer have the knowledge to know if there was a drug interaction for a particular patient?    <a href=\"http://build.fhir.org/ig/HL7/davinci-crd/hooks.html#order-select\">http://build.fhir.org/ig/HL7/davinci-crd/hooks.html#order-select</a></p>",
        "id": 238677679,
        "sender_full_name": "Larry Decelles",
        "timestamp": 1620938409
    },
    {
        "content": "<p>No need for pre-fetch at all.  The hook call includes the draft orders.  The payer already knows what meds they've paid for for the patient (including typically days supply), so they have enough information to know \"this patient is likely already on a drug that interacts with the one you're about to prescribe\".</p>",
        "id": 238687941,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620943477
    },
    {
        "content": "<p>What if there are two payers that have provided medications? The payer won't be able to give guidance on meds they didn't pay for. Should a warning card still come back even if the payer didn't know for sure that there were any drug interactions?</p>",
        "id": 238780318,
        "sender_full_name": "Patrick LaRocque",
        "timestamp": 1621004418
    },
    {
        "content": "<p>I  think there's value to a clinician in being told about known drug-drug interactions.  There's no value to the clinician in receiving lots of warning messages saying \"There might be interactions with drugs we don't know about\".  That's just a given.</p>",
        "id": 238789752,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621008368
    }
]