[
    {
        "content": "<p>JustinStauffer opened <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>This is in regard to the concept of extensions discussed in issue 76 (<a href=\"https://github.com/cds-hooks/docs/issues/76\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/76\">https://github.com/cds-hooks/docs/issues/76</a>). Since that issue is closed, I created a new one to track this.</p>\n<p>Currently, the CDS Hooks extension model uses a dynamically named element (<a href=\"https://github.com/cds-hooks/docs/commit/b34534ee30c61e99489f86df7662efde65559663\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/commit/b34534ee30c61e99489f86df7662efde65559663\">https://github.com/cds-hooks/docs/commit/b34534ee30c61e99489f86df7662efde65559663</a>).</p>\n<p>An example is:<br>\n<code>\"extension\": {\n   \"example-client-conformance\": \"http://my.hooks.org/fhir/102/Conformance/patientview\"\n}</code></p>\n<p>This dynamically named element will require customization to off-the-shelf JSON libraries because it uses a dynamically named element (e.g. \"example-client-conformance\") whose name is not determined at design time. For example, if you have a C# .NET class that represents this extension element, it would look like this:</p>\n<p><code>public class extension\n{\n    public string example-client-conformance { get; set; }\n}</code><br>\n(This example would not work in .NET because the property name has dashes but let's forget that detail for now.)</p>\n<p>Now if someone wants to use a different extension name (such as \"myextensionproperty\"), application developers will need to add another property to their class called \"myextensionproperty\";</p>\n<p><code>public class extension\n{\n    public string example-client-conformance { get; set; }\n    public string myextensionproperty { get; set; }\n}</code></p>\n<p>That is obviously not sustainable. </p>\n<p>Yes, there are ways one can program around this and everyone will need to do so to handle elements like prefetch. However, this is another case that requires customization and since this piece of the specification is new, we should fix it before it is finalized so we do not require yet more customization to off-the-shelf APIs which makes it more difficult for client and service developers to support this part of the specification.</p>\n<p>Instead of the current approach, can we model this more like a FHIR Extension (<a href=\"http://hl7.org/fhir/extensibility.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extensibility.html\">http://hl7.org/fhir/extensibility.html</a>)? I don't think we have to get _quite as complicated_ as FHIR's extensibility model but using a key/value pair would be much more preferable than using dynamically named JSON properties.</p>\n<p>For example, this is readable/writable using a standard JSON formatter/writer and does not require customizing out-of-the-box / off-the-shelf JSON libraries:</p>\n<p><code>\"services\": [\n{\n    \"extension\": [{\n        \"url\": \"http://domain/example-client-conformance\",\n        \"value\": \"http://my.hooks.org/fhir/102/Conformance/patientview\"\n     },\n    {\n        \"url\": \"http://domain/example-client-another-extension\",\n        \"value\": \"another-extension-value\"\n     }]\n}</code></p>\n<p>Notice that I simplified this a little from the FHIR Extension type in that I am just using one \"value\" property instead of \"valueInt\", \"valueDecimal\", \"valueString\", etc.</p>\n</blockquote>",
        "id": 153927437,
        "sender_full_name": "Github Notifications",
        "timestamp": 1514912410
    },
    {
        "content": "<p>kpshek <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-356110047\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-356110047\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>Hi @JustinStauffer. Is the core of your issue here the same as #89? I realize that #89 was in regards to prefetch but this reads to me as being technically the same argument -- dynamic keys pose a challenge in your use case.</p>\n<p>In these two issues are technically the same (but just different domains -- prefetch vs extensions), can you elaborate on what caused #89 to ultimately get closed? Namely, rather than trying to model the extensions as first class attributes for JSON serialization libraries, can you simply get/set the extension via the JSON map/hash that all libraries I've worked with offer?</p>\n<p>For instance, using <a href=\"https://www.newtonsoft.com/json\" target=\"_blank\" title=\"https://www.newtonsoft.com/json\">Json.NET</a>, here is <a href=\"https://www.newtonsoft.com/json/help/html/DeserializeExtensionData.htm\" target=\"_blank\" title=\"https://www.newtonsoft.com/json/help/html/DeserializeExtensionData.htm\">documentation from that project which shows how this is done</a>.</p>\n</blockquote>",
        "id": 153928042,
        "sender_full_name": "Github Notifications",
        "timestamp": 1515448773
    },
    {
        "content": "<p>JustinStauffer <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-356112497\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-356112497\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>Yes, they are stemming from the same root cause.</p>\n<p>Basically, if you take a .NET class (or presumably Java) and simply wish to deserialize it into a JSON representation, you cannot do that when the element name (which is represented via a property on that class) has a variable name that is not pre-defined at design time.</p>\n<p>To get around that, you have to do something like making a new class (like one called \"DynamicallyNamedElement\") that has a property representing the dynamic element name and its value (instead of using a simple string, decimal, etc.). Then you need to customize your deserialization code to detect the presence of that \"DynamicallyNamedElement\" class and leave it out of your resulting JSON and make the appropriate name adjustments for the dynamic element name. Essentially, it calls for customization to your JSON formatting code wherever these dynamic element names came up.</p>\n<p>I was able to work around this issue for prefetch using an approach like I mentioned above. It seemed to me at the time that nobody was willing to change the specification then because multiple people had implemented prefetch the way it was designed and did not want to change their implementation. However, since this is a new part of the specification, we will not have that justification this time and should do our best to make the spec work with off-the-shelf tools and approaches that do not require making custom JSON formatting/deserialization/serialization code to handle quirks in our message model.</p>\n</blockquote>",
        "id": 153928044,
        "sender_full_name": "Github Notifications",
        "timestamp": 1515449339
    },
    {
        "content": "<p>kpshek <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-356258844\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-356258844\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>@JustinStauffer - What .NET JSON library are you using?</p>\n</blockquote>",
        "id": 153928121,
        "sender_full_name": "Github Notifications",
        "timestamp": 1515497511
    },
    {
        "content": "<p>JustinStauffer <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-356305776\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-356305776\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>Newtonsoft.</p>\n<p>I wasn't aware of the functionality you linked above. Seems helpful. However, it still requires customization that would not be necessary if we modeled this as a key/value pair just like HL7 has done with FHIR. Why are we proposing to do it differently when there is already an existing solution to this in a very similar specification that does not require such customization? </p>\n</blockquote>",
        "id": 153928128,
        "sender_full_name": "Github Notifications",
        "timestamp": 1515509526
    },
    {
        "content": "<p>kpshek <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-356323976\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-356323976\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>@JustinStauffer - Cool! I guessed right with <a href=\"https://www.newtonsoft.com/json/help/html/DeserializeExtensionData.htm\" target=\"_blank\" title=\"https://www.newtonsoft.com/json/help/html/DeserializeExtensionData.htm\">the example</a> in my previous comment. <span class=\"emoji emoji-1f604\" title=\"smile\">:smile:</span> </p>\n<p>I'd prefer to design the API without looking at each and every JSON library across the various languages and platforms. Generally speaking, this is a sound approach as all of the JSON libraries I've used in the past are more than capable of handling de/serialization of a variety of structures. In this case, we have a very clear &amp; clean path for how you can accomplish this with the Newtonsoft Json.NET library.</p>\n<p>The design of how extensions are handled in CDS Hooks also is consistent with our <code>prefetch</code> structure and I think this is a lot of value in structural consistency. Additionally, the community overwhelming agreed that our approach there was not concerning (which resulted in #89 being closed).</p>\n</blockquote>",
        "id": 153928136,
        "sender_full_name": "Github Notifications",
        "timestamp": 1515513042
    },
    {
        "content": "<p>JustinStauffer <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358017282\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358017282\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>What is the justification for doing this differently than an existing, tested standard called FHIR?</p>\n</blockquote>",
        "id": 153929082,
        "sender_full_name": "Github Notifications",
        "timestamp": 1516119678
    },
    {
        "content": "<p>kpshek <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358107489\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358107489\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>@JustinStauffer - The community didn't agree to this with prefetch because existing implementation had already implemented it one way. The problem described there (same issue here) did not receive support from the community which is why we didn't change the design.</p>\n<p>CDS Hooks leverages FHIR data but isn't based upon FHIR API design constructs. Your question of of why we didn't design it according to a particular standard isn't the right question to ask as we could all point to competing examples from other APIs, standards, etc.</p>\n<p>Instead, the question and discussion should focus on why your proposal is a better design. As discussed earlier, you have a method to de/serialize the JSON with Json.NET (in the WGM discussion around #89, other .NET developers in the room did not share your concerns). Additionally, your proposed design runs counter to our design for <code>prefetch</code> and your comment today did not address why it would be acceptable to have conflicting designs for prefetch and extensions.</p>\n<p>Barring other issues or a more compelling argument, I don't see a need to change our extension design. Others following this thread are encouraged to join in the discussion.</p>\n</blockquote>",
        "id": 153929122,
        "sender_full_name": "Github Notifications",
        "timestamp": 1516137174
    },
    {
        "content": "<p>brynrhodes <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358118150\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358118150\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>I agree with @kpshek here, consistency with the prefetch approach, combined with ease of use for the most common consumers provide strong justification for the approach we're proposing.</p>\n<p>Note also that the specification is not prescriptive on this point. The specification is only providing an example that we think is in line with the rest of the specification.</p>\n</blockquote>",
        "id": 153929147,
        "sender_full_name": "Github Notifications",
        "timestamp": 1516139244
    },
    {
        "content": "<p>JustinStauffer <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358120046\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358120046\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>I wasn't involved in the community when prefetch was first being discussed and if I was, I would have raised more of a stink about it then. How do you have a \"standard\" message structure when the _element names_ are not defined? That seems ludicrous to me and I don't like that in prefetch but I am dealing with it because I know that ship has sailed.</p>\n<p>Also, here's the issue with the \"solution\" that's available in Newtonsoft. Our approach takes a simple object model that a customer can create -- not a developer, a customer analyst for example. That simple model is then translated into a C# object and that object is used to serialize/deserialize to/from JSON. With the currently proposed solution, we'd have to make adjustments to this translation since it is no longer a simple one-to-one mapping. Of course there are ways to work around this but that's not the main problem... Despite all the details of JSON library implementations, the proposed solution simply doesn't work at design time for the same reason that prefetch doesn't. Compare this with any other schema-based model representing a message structure. HL7, IHE, etc. No other schema-based models use elements with dynamic element names because you cannot represent them in a schema. Does the \"community\" not care about this? Do we not care about having schema-based validation, code generation tools, etc.? I suspect most in the community probably don't understand the consequences of that or don't care because they're taking less (or not at all) design-time driven approaches.</p>\n<p>Yes I know CDS Hooks is not FHIR but it seems to me we should indeed be borrowing ideas from other existing, more proven standards that have larger communities contributing to them. Why do we need to reinvent the wheel just because CDS Hooks is a different use case? FHIR has solved this and CDS Hooks is _barely_ different from FHIR and this is a divergence from FHIR which will make it less simple for folks familiar with and currently supporting FHIR to implement this specification because they keep having exceptions in one place or the other to how things are done in every other message model in existence.</p>\n<p>Also, prefetch is not the only comparable in CDS Hooks. Look at \"Action\" in the Response message. You have Action/type and Action/resource where type = create, update, or delete (so it's a key-value pair exactly like I want for Extension). Why was that not designed as Action/create/resource, Action/update/resource, Action/delete/resource, or Action/somefuturething/resource? Therefore, the proposed Extension model is not consistent with how CDS Hooks has defined the Action element.</p>\n<p>Finally, you said we should focus on why the \"alternative\" more-FHIR-like approach is better without talking about details of APIs but then you use the JSON.NET API as argument against my proposed change... I think the points I raise above about the Action element model, design-time tooling and validation, as well as the fact that FHIR has already solved this issue are pretty compelling reasons to use their approach (or at least something more similar).</p>\n</blockquote>",
        "id": 153929149,
        "sender_full_name": "Github Notifications",
        "timestamp": 1516139621
    },
    {
        "content": "<p>JustinStauffer <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358121780\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358121780\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>Also, the original proposal for Extensions made by robs16 used the FHIR-based approach:<br>\n<a href=\"https://github.com/cds-hooks/docs/issues/76\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/76\">https://github.com/cds-hooks/docs/issues/76</a></p>\n<p>I don't see any discussion in that thread about using the currently proposed approach in the following commit by @brynrhodes: <a href=\"https://github.com/cds-hooks/docs/commit/b34534ee30c61e99489f86df7662efde65559663\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/commit/b34534ee30c61e99489f86df7662efde65559663\">https://github.com/cds-hooks/docs/commit/b34534ee30c61e99489f86df7662efde65559663</a></p>\n<p>Where is the discussion history available describing why the proposal was changed and implemented the way it was?</p>\n</blockquote>",
        "id": 153929150,
        "sender_full_name": "Github Notifications",
        "timestamp": 1516140012
    },
    {
        "content": "<p>brynrhodes <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358122434\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358122434\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>The discussion is on issue #76. We proposed the approach we have implemented and asked for comment, we didn't receive any for over a month so we committed the change as described in that discussion (namely an extension element whose contents were not prescribed by the spec).</p>\n</blockquote>",
        "id": 153929152,
        "sender_full_name": "Github Notifications",
        "timestamp": 1516140163
    },
    {
        "content": "<p>JustinStauffer <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358122706\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358122706\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>@brynrhodes sorry, I missed that original proposal. I found out about this from a co-worker. Consider my comments on this thread as feedback on that proposal 1 month ago.</p>\n</blockquote>",
        "id": 153929153,
        "sender_full_name": "Github Notifications",
        "timestamp": 1516140228
    },
    {
        "content": "<p>brynrhodes <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358148633\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358148633\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>No worries @JustinStauffer. I think the core of the issue is that these are extensions, they're by definition not known at design time, and messaging schemas that encode extensions just change where they have to be dealt with. To put it another way, it seems like imposing a constraint of strongly-typed systems on an API that's expressed natively in a technology that doesn't have that constraint, and if we do that, the cost is that systems that _can_ deal with dynamically-named elements lose that capability.</p>\n</blockquote>",
        "id": 153929163,
        "sender_full_name": "Github Notifications",
        "timestamp": 1516147221
    },
    {
        "content": "<p>JustinStauffer <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358360742\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-358360742\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>That's incorrect that all extensions are not known at design time. Extensions are sometimes used as temporary placeholders for new features that are intended to be brought into the standard but need short-lived homes for early adopters.</p>\n<p>I also don't quite get what you're saying \"the cost is that systems that can deal with dynamically-named elements lose that capability\". What capability? What benefit is there to a dynamically named element?</p>\n</blockquote>",
        "id": 153929267,
        "sender_full_name": "Github Notifications",
        "timestamp": 1516206620
    },
    {
        "content": "<p>brettmarquard closed <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>",
        "id": 153931637,
        "sender_full_name": "Github Notifications",
        "timestamp": 1517110261
    },
    {
        "content": "<p>brettmarquard <a href=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-361035477\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133#issuecomment-361035477\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/133\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/133\">Issue #133</a></p>\n<blockquote>\n<p>Discussed offline with @JustinStauffer, agreed to close. </p>\n</blockquote>",
        "id": 153931638,
        "sender_full_name": "Github Notifications",
        "timestamp": 1517110261
    }
]