[
    {
        "content": "<p>travisstenerson edited <a href=\"https://github.com/cds-hooks/docs/issues/53\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/53\">Issue #53</a></p>\n<blockquote>\n<p>One of the issues we are contending with is the fact that occasionally the data we would need to provide complete decision support doesn't exist in neatly structured objects, and probably sits in some unstructured text or somewhere outside the reach of an EHR's FHIR server. </p>\n<p>A way we were considering to get around this is a Suggestion card that is basically asking the user to 'make an observation', or more accurately 'structure this Observation in FHIR so we can use it for decision support'. The intention is to suggest this when the service becomes aware that some data should be available - a surgery is complete or a diagnostic report has returned. But this is an extension of the functionality of a suggestion card as we are requesting the user input data, not just select the card. \"What was the distance to the closest surgical margin in that excision surgery\", or \"which histology was noted for the lesion in the biopsy\" are examples. Some of these Observations might already be encoded (I'm not sure on how widespread CAP cancer protocols are in EMRs), but from what I understand they usually will not be.</p>\n<p>We discussed the idea of sending a 'DataRequirement' in a suggestion card, but I suspect it this would be complicated for the EHR and require some pre-arranged agreement on the interpretation of a DataRequirement, removing the vendor agnostic aspect that is so attractive about CDS-Hooks.</p>\n<p>Has anyone else thought about this sort of issue? Of course with SMART app interaction we can simply prompt the user and then return the structured Observation with the decisions. But for a situation where the doctor is viewing the pathology report and we have the opportunity to structure otherwise unstructured data, a suggestion card might be ideal. Structuring unstructured data is an issue in health informatics in general, and CDS-Hooks might allow a minimally intrusive way to ask a user to do so.</p>\n</blockquote>",
        "id": 153893843,
        "sender_full_name": "Github Notifications",
        "timestamp": 1497471887
    },
    {
        "content": "<p>vadi2 <a href=\"https://github.com/cds-hooks/docs/issues/53#issuecomment-308949370\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/53#issuecomment-308949370\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/53\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/53\">Issue #53</a></p>\n<blockquote>\n<p>We're facing a similar issue but we're a SMART app so sa you say, we can just prompt the user. Wouldn't adding structured data entry to cards lead down the slippery slope of the basic cards getting bloated as more and more functionality would inevitably be asked for?</p>\n</blockquote>",
        "id": 153894100,
        "sender_full_name": "Github Notifications",
        "timestamp": 1497596254
    },
    {
        "content": "<p>alextdejong <a href=\"https://github.com/cds-hooks/docs/issues/53#issuecomment-309111400\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/53#issuecomment-309111400\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/53\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/53\">Issue #53</a></p>\n<blockquote>\n<p>Maybe I am missing something, but why would this not work with a SMART app launched from a CDS Hook card?</p>\n</blockquote>",
        "id": 153894252,
        "sender_full_name": "Github Notifications",
        "timestamp": 1497640468
    },
    {
        "content": "<p>travisstenerson <a href=\"https://github.com/cds-hooks/docs/issues/53#issuecomment-309236196\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/53#issuecomment-309236196\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/53\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/53\">Issue #53</a></p>\n<blockquote>\n<p>It absolutely could work with a SMART app launch. But it seems a bit excessive when you're simply asking them to create a single observation in structured data that can then be used by the CDS service when later returning recommendations.</p>\n<p>The actual use case is an EMR who would prefer to simply receive the structured recommended procedures, and in some cases our service needs to ask for data, mostly observations that resulted from some procedure. Their reasoning is to have UI control over the presentation of the recommendations or data requests.</p>\n<p>But I see further use cases, particularly as a way for CDS services or even researchers to interject into the workflow with minimal invasion and ask users for data that otherwise goes unstructured in a note. </p>\n</blockquote>",
        "id": 153894279,
        "sender_full_name": "Github Notifications",
        "timestamp": 1497728899
    }
]