[
    {
        "content": "<p>jmehlbrech opened <a href=\"https://github.com/cds-hooks/docs/issues/365\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/365\">Issue #365</a></p>\n<blockquote>\n<p>_Technical scenario_: I would like one client to retrieve a lot of potential CDS-cards from one CDS-service in a performant way (one request-one response)<br>\n_Scenario_: I would like to retrieve the status for all inbound-patients of a ward - or for the whole hospital to enable visualizing overviews.<br>\n_Issue_: A CDS-Card does not provide context information</p>\n<ul>\n<li>\n<p>While it is possible to provide an own hook like this to enable requesting multiple contexts<br>\n      “context”: {<br>\n            { “patientId”: “1”, “encounterId”: “abc” },<br>\n            { “patientId”: “2”, “encounterId”: “def” },<br>\n            //       ... more....<br>\n       }</p>\n</li>\n<li>\n<p>A response for such a request would have multiple CDS-Cards - missing context info - or a way to retrieve it</p>\n</li>\n</ul>\n</blockquote>",
        "id": 153974868,
        "sender_full_name": "Github Notifications",
        "timestamp": 1531382346
    },
    {
        "content": "<p>kpshek <a href=\"https://github.com/cds-hooks/docs/issues/365#issuecomment-404515723\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/365#issuecomment-404515723\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/365\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/365\">Issue #365</a></p>\n<blockquote>\n<p>I talked with @jmehlbrech offline about this and to provide more color to this issue, I recall having discussions around this topic previously; though, I cannot find any existing issues around this. The gist of this issue is that cards have no reference to a resource/entity/thing back in the EHR.</p>\n<p>For instance, imagine a <code>patient-list-view</code> hook that for its <code>context</code>, informs the CDS Service of each patientId for the patients the user is viewing (see @jmehlbrech's context noted above). The resultant CDS cards have no reference to those individual patients in the list. So, the EHR has no ability to associate an icon/card/etc to individual patients within the list.</p>\n<p>Another example would be on some imagined <code>medication-list-view</code> hook where the hook is invoked when the user is viewing all of the medications the patient is taking. The EHR again has no ability to associate the resultant CDS cards with individual medications.</p>\n</blockquote>",
        "id": 153974919,
        "sender_full_name": "Github Notifications",
        "timestamp": 1531402846
    }
]