[
    {
        "content": "<p>brynrhodes <a href=\"https://github.com/cds-hooks/docs/issues/17#issuecomment-307897213\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/17#issuecomment-307897213\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/17\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/17\">Issue #17</a></p>\n<blockquote>\n<p>In the HL7 Decision Support Service specification, this information is communicated with an organization id as part of the request. When we expressed that in the clinical reasoning module, we made it part of the parameters sent to the $evaluate operation. I think the analog here would be just to add organizationId as one of the parameters that can be sent to the request, in the same way that patientId is passed now. That identifier could be a top-level organization, or a sub-organization, the FHIR Organization resource supports that through the partOf element.</p>\n</blockquote>",
        "id": 153893282,
        "sender_full_name": "Github Notifications",
        "timestamp": 1497296347
    },
    {
        "content": "<p>gdelfiol <a href=\"https://github.com/cds-hooks/docs/issues/17#issuecomment-307907921\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/17#issuecomment-307907921\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/17\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/17\">Issue #17</a></p>\n<blockquote>\n<p>The distinction between an organization that hosts an EHR versus the organization where a patient receives care has also been a challenge in our organization, especially for affiliated clinics that use our EHR, but do not share subscriptions to the same CDS resources. <br>\nThe infobutton standard makes that distinction. There are two parameters: _organization_ provides and ID of the requestor organization, while _careSetting_ provides the identifier of the patient care setting (e.g., a specific clinic, a specific hospital). This approach would work well for us, but not all EHR vendors implemented the careSetting parameter.</p>\n</blockquote>",
        "id": 153893285,
        "sender_full_name": "Github Notifications",
        "timestamp": 1497297733
    }
]