[
    {
        "content": "<p>Hi all, just wanted to ask if anyone has a link to an ERD FHIR model.  Perhaps leveraging a tool like PowerDesigner or ERStudio would be even better...This way its a different visual representation of it...</p>",
        "id": 198914443,
        "sender_full_name": "karim jessani",
        "timestamp": 1590595791
    },
    {
        "content": "<p>It's been tried and it's super hard to read.  If you include extensions, everything can point to everything.  Even without extensions, there are a number of places where Reference&lt;Any&gt; is used (which means pointing to everything).  And if you ignore those, you'll still find almost all resources pointing to Patient, Practitioner, PractitionerRole, Organization, etc.  Thus, we don't bother publishing an official one - just not very helpful to the reader.</p>",
        "id": 198915731,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590596354
    },
    {
        "content": "<p>Ugh, so what if go at it in another direction.  Is there an xls file or something that has all entities (tables)  in one place (Patient / Organization / Address) and with it the corresponding fields like city / province / state ...</p>",
        "id": 198921571,
        "sender_full_name": "karim jessani",
        "timestamp": 1590599040
    },
    {
        "content": "<p>FHIR isn't a database model - its focus is exchange.  There are no simple types in FHIR - even something like a boolean can have extensions, id, etc.  If you want to generate a FHIR-based database model, you should look here: <a href=\"http://build.fhir.org/storage.html\">http://build.fhir.org/storage.html</a> and then check out the discussions here: <a class=\"stream\" data-stream-id=\"179289\" href=\"/#narrow/stream/179289-storage-for-FHIR\">#storage for FHIR</a></p>",
        "id": 198922524,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590599441
    },
    {
        "content": "<p>There are lots of different approaches, driven by how you expect to be querying the data and your performance needs.</p>",
        "id": 198922631,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590599493
    }
]