[
    {
        "content": "<p>Hello,</p>\n<p>Could someone provide me some help / advices please ? Indeed, I’m looking for the right HL7 documents to download and study in order to prepare the development of a new “medical e-reporting solution”.<br>\nThis solution will be first dedicated to Radiologists (in all areas) and later we will complete the solution with additional topics/features for other specialties.</p>\n<p>Interoperability for Radiologist e-Reports is a must have, so, what would be the list of HL7 standard documents (or any other framework ?) we should refer to in order to prepare all the requirements for an interoperability with other e-health solutions (RIS, PACS, HIS, etc.)</p>\n<p>And how should we proceed then for an accreditation ?</p>\n<p>Many thanks in advance and of course at your disposal for any additional information.</p>",
        "id": 217508247,
        "sender_full_name": "Alexis Hamsag",
        "timestamp": 1605976206
    },
    {
        "content": "<p>The first question is what standard are you looking at - are you interested in CDA documents or FHIR content?  Also, this seems like an unusual question to ask on the tooling stream?</p>",
        "id": 217509607,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605978282
    },
    {
        "content": "<p>Thanks Lloyd for your reply. Sorry if I'm not in the right stream, I'm new here and I thought it was the right one when reading its description. If I should post my request on another one, please advise.<br>\nI would say I'm interested in both CDA documents and FHIR content.<br>\nThanks in advance for your feedback.</p>",
        "id": 217512921,
        "sender_full_name": "Alexis Hamsag",
        "timestamp": 1605983622
    },
    {
        "content": "<p>No worries.  <a href=\"http://chat.fhir.org\">chat.fhir.org</a> can be a bit overwhelming when you first arrive.  Tooling is primarily about tools that support developing FHIR content or implementing FHIR, not generally about the 'content' of what's exchanged.  For FHIR, I'd suggest posting on <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a> - I'll try to attract the attention of some of the imaging folks for you.  For CDA, I'd suggest asking on <a class=\"stream\" data-stream-id=\"229921\" href=\"/#narrow/stream/229921-CDA\">#CDA</a>.</p>\n<p>Welcome to the community!</p>",
        "id": 217531742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606015275
    },
    {
        "content": "<p>Thank you very much Lloyd, I will post my questions on these streams you recommended.<br>\nTake care !</p>",
        "id": 217540705,
        "sender_full_name": "Alexis Hamsag",
        "timestamp": 1606033043
    }
]