[
    {
        "content": "<p>Couple of questions regarding index.json of the <a href=\"https://confluence.hl7.org/display/FHIR/NPM+Package+Specification#NPMPackageSpecification-.index.json\">FHIR packages spec</a> :</p>\n<p>In the dotnet package tooling, we have been struggling with returning the right file when searching a package by canonicalUrl:<br>\nIn this case we have a package that has dependencies to <code>hl7.fhir.r3.core</code> and <code>hl7.fhir.r3.expansions</code>. <br>\nWhen searching for a valueset, say: <code>administrative-gender</code>, we would like to return the expanded ValueSet, but there is currently no way to know based on the <code> index.json</code> file, both files would look exactly the same index.json.<br>\nThe same goes for the theoretical case where there are dependencies to multiple packages containing the same StructureDefinition, one with a snapshot, and one without, we would always like to return the snapshot one, but there is no way to know.</p>\n<p>Therefor I'd like to suggest to add the following fields to index.json:</p>\n<ul>\n<li><code>hasSnapshot</code> - a boolean stating whether a file contains a snapshot or not</li>\n<li><code>hasExpansion</code> - a boolean stating wether a file is a valueset that has been expanded</li>\n</ul>\n<p>When looking at the <a href=\"https://confluence.hl7.org/display/FHIR/NPM+Package+Specification#NPMPackageSpecification-.index.json\">confluence page</a> : I see each folder needs a index.json, I think it would be better if we have 1 index for the whole package, but it's probably too late for that. It also states that examples are found in a sibling folder, but looking at the existing packages, I see both sibling and child folders named <code>example</code>, or <code>openapi</code>, and <code>other</code>. I think the child folders are better in this case, shall I update it on the page?</p>\n<p>Also, I don't think the current version of index.json has <code>index-version</code> 1 right? What's the latest version? And what does it look like? I'm willing to update the documentation myself if someone can tell me what the latest version looks like.</p>",
        "id": 259261765,
        "sender_full_name": "Marten Smits",
        "timestamp": 1635350309
    },
    {
        "content": "<p>i think it's a bad idea to have dependencies on both hl7.fhir.r3.core and hl7.fhir.r3.expansions. the expansions package was only published as a convenience to code generators, and shouldn't be a dependency anywhere.</p>",
        "id": 259442100,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635450404
    },
    {
        "content": "<p>It's certainly not a replacement for a terminology service that generates expansions on request</p>",
        "id": 259442162,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635450433
    },
    {
        "content": "<p>but if we're going to put expansion in .index.json, we should put the expansion id, since there could be more than one expansion per value set</p>",
        "id": 259442337,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635450504
    },
    {
        "content": "<p>is there any rationale use case for having both with and without a snapshot? I can't think of any</p>",
        "id": 259442382,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635450528
    },
    {
        "content": "<p>I agree that it's too late to have just one .index.json file for the entire package</p>",
        "id": 259442468,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635450579
    },
    {
        "content": "<p>and please update the documentation - originally we said sibling folders, but we realised a few years ago that wasn't valid against the NPM spec, and so we had to change to child folders. I thought we updated the documentation at the time</p>",
        "id": 259442693,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635450668
    },
    {
        "content": "<p>I don't understand the question about index-version?</p>",
        "id": 259442778,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635450707
    },
    {
        "content": "<p>But we have to run the $expand operation everytime we want to access to actual codes from a ValueSet then? I don't think that's good practice at all. Packages are supposed the be frozen right? But you can get different outcomes each time you run $expand. Same would be to be running the snapshot generator each time, doesn't seem good practice either.</p>",
        "id": 259489680,
        "sender_full_name": "Marten Smits",
        "timestamp": 1635491374
    },
    {
        "content": "<p>I don't know if there is any use for having profiles with and without snapshots, but it's probably going to happen somewhere and I want to prepare for it.</p>",
        "id": 259489821,
        "sender_full_name": "Marten Smits",
        "timestamp": 1635491494
    },
    {
        "content": "<p>I'll update the documentaton about the sibling/child folders</p>",
        "id": 259489844,
        "sender_full_name": "Marten Smits",
        "timestamp": 1635491515
    },
    {
        "content": "<p>The question about index-version: What's the latest version? Is it still 1? Just like it says on the confluence page? Or have there been undocumented changes already? If so, what are they, and which version are we now on?</p>",
        "id": 259489973,
        "sender_full_name": "Marten Smits",
        "timestamp": 1635491599
    },
    {
        "content": "<blockquote>\n<p>But we have to run the $expand operation everytime we want to access to actual codes from a ValueSet then? I don't think that's good practice at all.</p>\n</blockquote>\n<p>No, it's extremely necessary practice. The definition of the value set will define whether you should get different outcomes or not, and the terminology server better be reliable.</p>",
        "id": 259515097,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635509378
    },
    {
        "content": "<p>and which one will you choose if you find multiple different expansions? How will you know which one matches the expansion conditions that you've been asked for? You need a terminology server, not to try to solve this in the packaging system</p>",
        "id": 259515214,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635509440
    },
    {
        "content": "<p>I'm still not convinced about snapshots. Why would it be done when you can just remove the snapshot it you want one without</p>",
        "id": 259515256,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635509471
    },
    {
        "content": "<p>index-version: still \"1\" - the last change we made was the addition of the supplements flag, and that didn't cause an increment in the version</p>",
        "id": 259515456,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635509600
    },
    {
        "content": "<p>I totally agree that the use case of adding just profiles without snapshots. I even think that shouldn't be allowed. But then again, I can see this happening, and I want to make sure that I select the profile with the snapshot instead of the one without.</p>",
        "id": 259531393,
        "sender_full_name": "Marten Smits",
        "timestamp": 1635517340
    },
    {
        "content": "<p>so where are we with this? we could register ValueSet.expansion.identifier in the .index.json, but I don't think it's going to do much good. you need the parameters</p>",
        "id": 260356413,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1636075366
    },
    {
        "content": "<p>After reading your arguments, I think we don't need to change anything right now. We'll solve it in a different way. Thanks!</p>",
        "id": 260376255,
        "sender_full_name": "Marten Smits",
        "timestamp": 1636100384
    }
]