[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> <br>\n<a href=\"http://hl7.org/fhir/R4/medication-definitions.html#Medication.ingredient.item_x_\" target=\"_blank\" title=\"http://hl7.org/fhir/R4/medication-definitions.html#Medication.ingredient.item_x_\">Medication.ingredient.item[x]</a> is 1..1 and its type is a choice between CodeableConcept and Reference.<br>\nI want to bind the CodeableConcept to a value set and constrain the Reference to profiles of the original Substance and Medication.<br>\nForge and the igPublisher pull in different directions here.<br>\nWhen I slice with Forge it displays itemCodeableConcept and itemReference as 0..1 in the Element Tree and its generated snapshot and says nothing in the differential. This is what I'm after.<br>\nThe igPublisher will make itemCodeableConcept and itemReference 1..1, unless the differential explicitly say that they are 0..1.<br>\nBut Forge will not let me record a cardinality of 0..1 in the xml.<br>\nWhat is the way forward?</p>",
        "id": 179503849,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1572501403
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> If a profile introduces a slice, then Forge always considers the base minimum cardinality to be equal to 0 (i.e. named slices do NOT inherit minimum cardinality from the slice entry). This is a special rule introduced specifically to allow the described use case, to allow you to slice a 1...1 choice type element. Minimum cardinality will only be included in the differential if the profile constrains the value (to something &gt;0). Hope this helps.</p>",
        "id": 179514716,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1572514916
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> I don't believe that this is a rule documented in the specification?</p>",
        "id": 179521847,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572520900
    },
    {
        "content": "<p>Could be... I recall that we have discussed this specific aspect within FHIR-I (with you and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ), but that was probably one of those informal chats on Zulip.<br>\nThis behavior seems to follow from functional requirements. For if named slices would inherit minimum cardinality from slice entry, similar to other constraints, then a slice group would not be able to define a set of mutually exclusive options (as the scenario above).</p>",
        "id": 179529626,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1572527667
    },
    {
        "content": "<p>can we talk about this at DevDays?</p>",
        "id": 180685365,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573688307
    }
]