[
    {
        "content": "<p>I have a number of code systems that are externally defined for the CARIN BB IG. Each needs a ValueSet to enable binding for specific elements. </p>\n<p>For the ValueSet that represent the entirety of an external code system, where/how should these be defined? We have a number of tickets saying that these should be moved to THO. I want to know what the preferred approach is.</p>",
        "id": 276397170,
        "sender_full_name": "Corey Spears",
        "timestamp": 1648068097
    },
    {
        "content": "<p>It is absolutely NOT necessary for value sets to be defined in THO.  A value set should only be placed in THO if the following circumstances are met:</p>\n<ul>\n<li>the value set definition is mature enough and well understood enough that being subject to \"good terminology practices\" is reasonable and appropriate</li>\n<li>there's enough complexity to the definition of the value set that the benefit to the organization of having the definition shared is worth the administrative effort of creating and maintaining it in THO</li>\n<li>the definition of the content can be expressed clearly enough that decisions about adding and removing codes can be done without the direct involvement of the IG(s) that are using the value set</li>\n</ul>",
        "id": 276408515,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648073825
    },
    {
        "content": "<p>Code systems, on the other hand, are different.  Once you hit FMM3+, you need TSMG approval to use an IG-specific code system unless it's bound to an extension of type 'code'.</p>",
        "id": 276408568,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648073867
    },
    {
        "content": "<p>Value sets that \"represent the entirety of an external code system\" may be a somewhat special case.  They definitely meet the criteria in Lloyd's 1st and 3rd bullets.  They certainly don't meet it in the second one, as they are the simplest possible to define of all value sets.  But we've also had and have the notion that there would normally be a single \"all codes\" value set for a code system, that would be available to and presumably used by everyone - and we've made special provision for that to be declared and made known and available in CodeSystem.valueSet.  So I think these value sets that Corey is describing certainly are candidates for being defined in THO (though with CodeSystem.valueSet a separate ValueSet resource instance may not be needed - depending on what tooling can support).  Taking the other side for a moment, I'll also say that I think it wouldn't particularly be a crisis if everyone (in multiple IGs) decided to define and use their own \"all codes\" value sets - though it seems to me to be rather pointless to do it that way.  Just define and use CodeSystem.valueSet and be done with it.</p>",
        "id": 276427882,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1648090769
    },
    {
        "content": "<p>OK, Thanks. I will work with you Rob on  how we might consider that. </p>\n<p>Also, my apologies for posting this in tooling (it was right below terminology and I clicked on it by accident.</p>",
        "id": 276553962,
        "sender_full_name": "Corey Spears",
        "timestamp": 1648165424
    }
]