[
    {
        "content": "<p>Should we propose a track for the next connectathon? Deadline is March 1.</p>",
        "id": 272923845,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1645608934
    },
    {
        "content": "<p>Yes, we should! Thank you, Mikael, for reminding us, and for volunteering to submit the proposal!</p>",
        "id": 272970102,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1645632502
    },
    {
        "content": "<p>Track proposal submitted, <a href=\"https://confluence.hl7.org/display/FHIR/2022-05+International+Patient+Access\">https://confluence.hl7.org/display/FHIR/2022-05+International+Patient+Access</a></p>",
        "id": 273118844,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1645722406
    },
    {
        "content": "<p>The topic of IPS ballot reconciliation came up in Patient Care on the Clinicians on FHIR call yesterday.  The PCWG co-chairs would like to know when we want to have the ballot reconciliation on the schedule.  Probably either the Monday PCWG co-chairs calls (every other week) or the Tuesday Clinicians on FHIR calls (where there is some flexibility to set aside some time for this, as needed) will be best.  I have a conflicting meeting today during the IPA call time, so I probably won't be able to make the call today.  But if we come up with a plan, we or I can let them know.</p>",
        "id": 273800978,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1646225435
    },
    {
        "content": "<p>We are targeting the Tuesday  Clinicians on FHIR calls. We are currently gathering issues for the second block vote, and will alert PC when we have something to vote on.</p>",
        "id": 273817263,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1646232573
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>, could you please give the IPA Status Update (ballot, publish, content of IG) session at the Connectathon? Just let me know a time and I can schedule it in Whova.</p>",
        "id": 275724794,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1647550354
    },
    {
        "content": "<p>And would it be possible to get an intro session on profile validation? Anyone? Just explaining people on the track how the tools work and what the outputs mean. If we get people to validate example resources against IPA and potentially other relevant profiles?</p>",
        "id": 275725114,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1647550491
    },
    {
        "content": "<blockquote>\n<p><code>Vassil Peytchev</code>, could you please give the IPA Status Update (ballot, publish, content of IG) session at the Connectathon? Just let me know a time and I can schedule it in Whova.</p>\n</blockquote>\n<p>How about On Wednesday, May 4, at the regular IPA call time?</p>",
        "id": 275851419,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1647631626
    },
    {
        "content": "<p>I have a work meeting conflict during the IPA call time today.  We're looking at additional Inferno IPA tests that may be desired/needed, particularly for what would be useful to support the upcoming Connectathon activities.  Should we look at having a test, or a set of tests, for each of the track scenarios?  And if so, what should those tests be?  If we can start giving some thought to that, and add them to the IPA test list that we've started, that would be great.</p>",
        "id": 277135599,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1648643106
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> are you able to open the call?</p>",
        "id": 277149254,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1648649019
    },
    {
        "content": "<p>(no worries, I got in)</p>",
        "id": 277149747,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1648649210
    }
]