[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> how does the IPA <code>$docref</code>operation differ from the IPS <code>$summary</code>that we have discussed <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ?</p>",
        "id": 265902975,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1640255121
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> obviously, the name is different. :P</p>\n<p>The $docref is named as it is, as such an operation already exists in the US Core and we can just reuse it. The functionality, as specified in the base level IPA specification is that the operation returns an undefined default document when called without specifying a type, but you can also request documents with a profile definition, in which case you get a document based on the specified profile, if such a document exists or if the server can construct it.</p>",
        "id": 265905982,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1640257212
    },
    {
        "content": "<p>So the need for the \"doc extraction operation\" is present in US Core, IPA and IPS. Shouldn't it then either be extracted to its own IG, or hoisted to the global standard?</p>",
        "id": 265907070,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1640257933
    },
    {
        "content": "<p>I guess from IPA perspective we are a kind of extracting it from the US Core to a more generic specification.</p>\n<p>I don't think it would be a problem for for IPA to refer to another IG or the base FHIR specification if it was further extracted.</p>\n<p>I'm not sure which are the differences between the  US Core <code>$docref</code> operation and the IPS <code>$summary</code> operation.<br>\nI have also seen <code>$everything</code> proposed, and we discussed that in IPA too.</p>",
        "id": 265907428,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1640258234
    },
    {
        "content": "<p>I would prefer a modular approach, where the operation to generate an IPS be defined in a purpose specific IG. It could use IPA to access the data, and it would produce an IPS compliant document.</p>",
        "id": 265914361,
        "sender_full_name": "John Moehrke",
        "timestamp": 1640264594
    },
    {
        "content": "<p>I think one of the visions of two different operations is that one would purely create the IPS, and a second would use that first one to create the IPS and also create a DocumentReference instance for that newly created IPS Bundle. Thus if you simply wanted the IPS and had no use for a DocumentReference you could get that, but if you needed the IPS you created to be discovered in the future (persisted) then you would need a DocumentReference instance created for that.</p>",
        "id": 265914529,
        "sender_full_name": "John Moehrke",
        "timestamp": 1640264732
    },
    {
        "content": "<p>I proposed <code>$summary</code> to IPS (<a href=\"https://github.com/HL7/fhir-ips/pull/15/files\">https://github.com/HL7/fhir-ips/pull/15/files</a>) as a broadspectered approach, where one of the input parameters would be a <code>profile</code>URI, in order to determine and leave it to the specific IG to figure out what the summary should consist of.  As such, the <code>$summary</code>operation may have been initially defined in IPS, but is not tailored to it.</p>",
        "id": 265927862,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1640274248
    },
    {
        "content": "<p>A very interesting discussion. My initial view of this is as follows:</p>\n<ul>\n<li><code>$everything</code> returns a graph of resources. It is defined in the core spec, and IGs must constrain it for their use</li>\n<li><code>$summary</code> imposes a (almost?) tree-like structure on top of the generic graph of resources via the root <code>Composition</code> resource. IPS is the first to use it, it is not clear to me if a more generic use case exists.</li>\n<li><code>$docref</code> causes a DocumentReference resource to be returned (whether pre-existing , or newly created) containing or referencing a patient-specific document of some kind. My preference is that it is defined in IPA (without any restrictions on the kind/type of document),  and correspondingly constrained in IPS (document is an IPS FHIR Document or IPS CDA), US Core (Document is C-CDA) and others.</li>\n</ul>\n<p>I think IPS needs both <code>$summary</code> and <code>$docref</code> - they are complementary, but serve different purposes.</p>",
        "id": 265931189,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1640276750
    },
    {
        "content": "<p>I agree, that is what I was viewing as the modular approach.</p>",
        "id": 265934865,
        "sender_full_name": "John Moehrke",
        "timestamp": 1640279303
    },
    {
        "content": "<p>I think the additional discussion is.. where should each of these be defined. as where they are defined drives their reusability.</p>",
        "id": 265934897,
        "sender_full_name": "John Moehrke",
        "timestamp": 1640279329
    },
    {
        "content": "<p>I appreciate the feedback from above. I have been working on a page (should finish in next two weeks) with initial documentation around how to generate an IPS for the IPS IG. Here is the early draft which is currently on a branch: <a href=\"https://github.com/HL7/fhir-ips/blob/generation-and-data-inclusion/input/pagecontent/ipsGeneration.md\">https://github.com/HL7/fhir-ips/blob/generation-and-data-inclusion/input/pagecontent/ipsGeneration.md</a> I will attempt to integrate some of the above as I work on during holidays. Additional feedback welcome.</p>",
        "id": 265938938,
        "sender_full_name": "John D'Amore",
        "timestamp": 1640282567
    }
]