[
    {
        "content": "<p>We had a short discussion with <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> on the Patient Empowerment WG call on the role of the IPA. I believe John was saying that IPA is just about finding and profiling the core set of resources that will work with implementations around the globe. Whereas for me, the major thing is the access part, and I can see use cases for a harmonized rules for app authentication even if the content returned by the server ends up being CDA or HL7v2 or whatever.</p>",
        "id": 253461009,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1631729126
    },
    {
        "content": "<p>To better formulate that I made a pull request to the Github repo, <a href=\"https://github.com/HL7/fhir-ipa/pull/14\">https://github.com/HL7/fhir-ipa/pull/14</a>. Happy to discuss here or there.</p>",
        "id": 253461158,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1631729186
    },
    {
        "content": "<p>that scope sounds more like SMART-on-FHIR</p>",
        "id": 253461198,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631729203
    },
    {
        "content": "<p>Well, to me the point is that we should be able to say that SMART on FHIR is the mechanism you use to get your data. As it currently already says in <a href=\"http://build.fhir.org/ig/HL7/fhir-ipa/branches/main/access.html#gaining-access-to-a-patient-record\">http://build.fhir.org/ig/HL7/fhir-ipa/branches/main/access.html#gaining-access-to-a-patient-record</a>.</p>",
        "id": 253461436,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1631729285
    },
    {
        "content": "<p>And that is a (or, for me, the) key building block of IPA.</p>",
        "id": 253461489,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1631729312
    },
    {
        "content": "<p>The key driver for this approach is the messages I hear from here in Finland and from Denmark: it is unlikely that the implementations currently filled with CDA and HL7v2 data will map that data into FHIR resources, at least in the short term. And for me it is more valuable to get the data to patients soon, regardless of the format, rather than waiting for some years until an implementation supporting the FHIR mapping is available. And the even worse scenario is that implementers deem IPA as not suitable for them because they are not willing to do the resource mapping, and therefore ditch any plans to use SMART too...</p>",
        "id": 253462355,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1631729677
    },
    {
        "content": "<p>Or, without an IG, they might stick to SMART, but everyone would end up implementing their own flavors on it. It is clear that there will be different approaches to app accreditation, for instance. But I'd like to see an attempt to harmonize those on some level, for instance a Nordic profile instead of a Finnish, a Danish, a Norwegian, and a Swedish implementation.</p>",
        "id": 253462784,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1631729850
    },
    {
        "content": "<p>IHE does have that covered -- <a href=\"https://profiles.ihe.net/ITI/HIE-Whitepaper/index.html\">https://profiles.ihe.net/ITI/HIE-Whitepaper/index.html</a></p>",
        "id": 253464702,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631730646
    },
    {
        "content": "<p>that said... I am just another peer on this project. IPA will end up doing what the community desires. I simply am not a fan of re-inventing solutions that already exist.</p>",
        "id": 253465095,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631730788
    },
    {
        "content": "<p>I thought IPA would include content and access...</p>",
        "id": 253470946,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1631733091
    },
    {
        "content": "<p>I think the main topic is if IPA will constrain the kind of content at all.</p>",
        "id": 253483694,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631738233
    },
    {
        "content": "<p>if there is no constraint on the content, then I say that this is what SMART-on-FHIR already expresses.</p>",
        "id": 253483765,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631738269
    },
    {
        "content": "<p>if there are constraints... which the current effort is to determine what the minimal viable set of FHIR resources will be...</p>",
        "id": 253483935,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631738320
    },
    {
        "content": "<p>Fair enough, <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>, and I fully support that. The challenge for me is that some implementers in this part of the world seem to be interested in opening data for patient access, but are less willing to go all the way with mapping their data to FHIR. Hence my proposal for a very generic base level spec that specifies access, and then profiles for content on top of that.</p>",
        "id": 253533892,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1631772601
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , I feel I'm really poor at skimming through IHE documents for some reason. Can you please point me to the part of the white paper that explains an implementer that if you want to open access to data for patient apps, you shall use SMART?</p>",
        "id": 253534088,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1631772757
    },
    {
        "content": "<p>IHE does not use SMART. IHE has had an OAuth profile (IUA) well before HL7 decided to profile OAuth in the SMART spec.  The two are closely aligned, but distinct. And  MHD can be used with SMART. <br>\nThe paper I pointed you at has a whole section 7 dedicated to the concept - <a href=\"https://profiles.ihe.net/ITI/HIE-Whitepaper/index.html#7-security-and-privacy\">https://profiles.ihe.net/ITI/HIE-Whitepaper/index.html#7-security-and-privacy</a></p>",
        "id": 253564538,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631791043
    },
    {
        "content": "<p>Is the point you are asking for is that DocumentReference be included in the core set, so as to enable access to historic (and FHIR) documents? I would agree with this, I have agreed with the inclusion in current us-core. I have worked with them to make the us-core use of DocumentReference as close to aligned with MHD as I can (I have failed because I am just one voice).   I am not against this in IPA, I just want it to be respectful of current implementation guides that are intended to cover the space.</p>",
        "id": 253564866,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631791217
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  Do you have a current list of alignment issues between MHD and US Core DocumentReference?  I don't recall any 'conflicts'</p>",
        "id": 253582060,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1631799218
    },
    {
        "content": "<p>hmm, I am proven wrong on that point. I just looked and see no conflict, infact it seems more aligned than I expected...</p>",
        "id": 253582867,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631799548
    },
    {
        "content": "<p>Maybe another totally naïve question -- Has anyone done a gap analysis of IUA vs SMART?</p>",
        "id": 253583563,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1631799839
    },
    {
        "content": "<p>There is an assessment inside the IUA explaining the intentioned difference in scope. To that point, end-users (practitioners or patients) are not in primary scope for IUA, and they are clearly primary scope for SMART. So i have taken the position of recommending SMART when the use-case is an end-user application, and IUA for B2B where federated identity and tokens are more used. Thus the overlap is biggest between IUA and bulk-data SMART...        THIS said, there is now major overlap in the new HL7 \"udap\" work item that overlaps with both of them.</p>",
        "id": 253584269,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631800084
    },
    {
        "content": "<p>the fhir spec mentions both IUA and SMART in addition to HEART -- <a href=\"http://hl7.org/fhir/security.html#authentication\">http://hl7.org/fhir/security.html#authentication</a></p>",
        "id": 253584567,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631800200
    },
    {
        "content": "<p>As I have asked many times... CR are welcome in both fhir core, and IHE.  I (as HL7 security wg co-chair) do NOT think that enough attention have been given to these topics, there is not enough input from practical reality, there are too few providing feedback and recommendations.</p>",
        "id": 253584895,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631800310
    }
]