[
    {
        "content": "<p>isaacvetter opened <a href=\"https://github.com/fhircast/docs/issues/32\" target=\"_blank\" title=\"https://github.com/fhircast/docs/issues/32\">Issue #32</a></p>\n<blockquote>\n<p>During the HL7 working group meeting in May in Köln, we talked about the re-use of CDS Hooks' hooks by FHIRcast.</p>\n<p>CDS Hooks defines hooks which are workflow events for triggering external, realtime clinical decision support. FHIRcast events are workflow events for triggering external application synchronization. </p>\n<p>The CDS Hooks helpfully defines a <a href=\"http://cds-hooks.org/hooks/\" target=\"_blank\" title=\"http://cds-hooks.org/hooks/\">hook catalog</a>, which currently contains <code>patient-view</code> (essentially equivalent to <code>open-patient-chart</code>), medication-prescribe and order-review. CDS Hook's wiki also lists <a href=\"https://github.com/cds-hooks/docs/wiki/Proposed-Hooks\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/wiki/Proposed-Hooks\">additional, possible hooks</a>.  FHIRcast defines a very similar <a href=\"http://fhircast.org/#event-catalog\" target=\"_blank\" title=\"http://fhircast.org/#event-catalog\">event catalog</a>, which currently contains open-patient-chart, switch-patient-chart, close-patient-chart, open-imaging-study, switch-imaging-study, close-imaging-study, user-logout and user-hibernate. </p>\n<p>CDS Hooks hook + FHIRcast event name unification could mean, in order of increasing compatibility:<br>\n1) Using the same name and understanding of where in the workflow this event actually occurs.<br>\n2) Unifying the type of contextual information passed as part of the hook/event. (E.g. open chart includes some reference of patient and encounter, but necessarily the same formatted content). <br>\n3) Unifying the actual message content. </p>\n<p>Example:<br>\n### CDS Hooks <a href=\"http://cds-hooks.org/hooks/patient-view/\" target=\"_blank\" title=\"http://cds-hooks.org/hooks/patient-view/\">patient-view</a><br>\nCDS Hooks' <code>patient-view</code> requires sending contextual information including the <code>patientId</code> and optional <code>encounterId</code>. These are FHIR resource id's.<br>\n### FHIRcast <a href=\"http://fhircast.org/#open-patient-chart\" target=\"_blank\" title=\"http://fhircast.org/#open-patient-chart\">open-patient-chart</a><br>\n FHIRcast's <code>open-patient-chart</code> returns almost the same information; specifically, the results of these queries against the Hub's FHIR server:<br>\n* Required: <code>Patient/{id}?_elements=identifier</code><br>\n* Optional: <code>Encounter/{id}?_elements=identifier</code></p>\n</blockquote>",
        "id": 153963151,
        "sender_full_name": "Github Notifications (FHIRcast)",
        "timestamp": 1526553449
    },
    {
        "content": "<p>wmaethner <a href=\"https://github.com/fhircast/docs/issues/32#issuecomment-443269660\" target=\"_blank\" title=\"https://github.com/fhircast/docs/issues/32#issuecomment-443269660\">commented</a> on <a href=\"https://github.com/fhircast/docs/issues/32\" target=\"_blank\" title=\"https://github.com/fhircast/docs/issues/32\">Issue #32</a></p>\n<blockquote>\n<p>Hey @isaacvetter I like the idea of having a robust, common set of workflow events that can be used in a variety of mechanisms. It is definitely better than defining them in two different standards with the amount of crossover there is likely to be. </p>\n<p>In the same vein as this, I think it would be useful to call out the differences between the two standards more clearly. It came up at RSNA, why not just use CDS hooks, and I know we have talked about the differences and there are some clear use cases for each. It would be good to really define those and call them out somewhere to be fully transparent.</p>\n</blockquote>",
        "id": 154022136,
        "sender_full_name": "Github Notifications (FHIRcast)",
        "timestamp": 1543597333
    }
]