[
    {
        "content": "<p>bvdh opened <a href=\"https://github.com/HL7/fhircast-docs/issues/72\" target=\"_blank\" title=\"https://github.com/HL7/fhircast-docs/issues/72\">Issue #72</a></p>\n<blockquote>\n<p>An application that is connected to a FHIR Cast session can access the FHIR repository, typically this access is read only. So far as I understand the EMR gathers all changes to the repo in its \"context\", based on changes in this context the CDS Hooks events are send.<br>\nBased on this model, an application should be able to suggest changes to the context. This could be done using the FHIR Cast spec.<br>\nI propose that we add a new event: fhir-change<br>\nEvent-name: fhir-change<br>\nContext:<br>\n    operation: create-update-delete<br>\n    resouce: FHIR resource<br>\nThe list of resource updates will be included in the result of the rest interface.</p>\n</blockquote>",
        "id": 159052124,
        "sender_full_name": "Github Notifications (FHIRcast)",
        "timestamp": 1550740837
    },
    {
        "content": "<p>gkustas <a href=\"https://github.com/HL7/fhircast-docs/issues/72#issuecomment-494796246\" target=\"_blank\" title=\"https://github.com/HL7/fhircast-docs/issues/72#issuecomment-494796246\">commented</a> on <a href=\"https://github.com/HL7/fhircast-docs/issues/72\" target=\"_blank\" title=\"https://github.com/HL7/fhircast-docs/issues/72\">Issue #72</a>:</p>\n<blockquote>\n<p>Hey @bvdh <br>\nI ran into a link to this github issue on a reply to my post on Zulip (in which you were mentioned).</p>\n<p>I think this proposal is essential, or at least one or more events are essential for FHIRCast moving forward. A single event (fhir-change) is fine with me as long as I, as a subscriber, have an indication of what is being changed. For example, are additional exams being added? Prior exams being referenced? Measurements being taken, etc.</p>\n<p>Could the <strong>operation</strong> element specify these kinds of things? </p>\n<p>I'd be happy to collaborate on spec'ing out this new event.</p>\n</blockquote>",
        "id": 166265702,
        "sender_full_name": "Github Notifications (FHIRcast)",
        "timestamp": 1558530798
    }
]