[
    {
        "content": "<p>Hi all, and welcome to the June 2021 US edition! <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> </p>\n<p>If you already have your ticket, you should have received access to the conference app Whova: <a href=\"https://whova.com/portal/webapp/hfdu_202106/\">https://whova.com/portal/webapp/hfdu_202106/</a><br>\nHere you can create your own schedule, ask questions, network, etc. It's the heart of the conference.</p>\n<p>Besides the interactive schedule, we've also published a nice PDF overview of the agenda so you can choose which sessions you want to attend live: <a href=\"https://www.devdays.com/june-2021/schedule/\">https://www.devdays.com/june-2021/schedule/</a><br>\nAfter the conference you will have 6 months exclusive access to the material, so no need for FOMO. Slides and recordings will be shared afterwards. Only the Pubtalks and Meet &amp; Greet sessions will not be recorded.</p>",
        "id": 241130160,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1622629434
    },
    {
        "content": "<p>Hi! Just realised rather late that this is in US time <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>. Will the recordings be made available immediately? I.e. so I can watch Monday's talks on Tuesday during CET working hours?</p>\n<p>And will the coding session be recorded this year? Found them rather useful last year and would be sad to miss them due to the time difference.</p>",
        "id": 241515752,
        "sender_full_name": "Håkan MacLean",
        "timestamp": 1622801994
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"364590\">@Håkan MacLean</span>  Hello!  Yes, the recordings will be made available within 24 hours of their presentation.  All sessions will be recorded, however, if we do not get consent from the speakers to post, we will not do that.  <span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> do you know about the coding sessions he is talking about?</p>",
        "id": 241545562,
        "sender_full_name": "Mary Ann Boyle",
        "timestamp": 1622817790
    },
    {
        "content": "<p>Thanks for the reply <span class=\"user-mention\" data-user-id=\"223704\">@Mary Ann Boyle</span>! If it was possible to make that 12 hours that would be amazing, meaning one could follow the conference during office hours the day after. </p>\n<p>Is there a way to know if there is consent before hand? That way I would know if I should stay up late to watch it or not.</p>",
        "id": 241546098,
        "sender_full_name": "Håkan MacLean",
        "timestamp": 1622817996
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"364590\">@Håkan MacLean</span> I do not have that list yet, but <span class=\"user-mention\" data-user-id=\"241465\">@Marita Mantle-Kloosterboer</span>  might be better able to tell you.  We will do our best to get them loaded quickly, but we try to say at least 24 hours as there are many presentations given daily.</p>",
        "id": 241554339,
        "sender_full_name": "Mary Ann Boyle",
        "timestamp": 1622821461
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"223704\">@Mary Ann Boyle</span> <span class=\"user-mention\" data-user-id=\"364590\">@Håkan MacLean</span> Yes, I believe we will also record all Let's Builds (hands-on coding) sessions. And our FAQ says that they will be uploaded by end of conference day, so I think that should work for you: <a href=\"https://www.devdays.com/june-2021/participant-faq/\">https://www.devdays.com/june-2021/participant-faq/</a> (Validar likely works on this during their end of West-coast day)</p>",
        "id": 241577146,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1622832130
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"364590\">@Håkan MacLean</span> <span class=\"user-mention\" data-user-id=\"223704\">@Mary Ann Boyle</span> We are waiting for the last couple of consent forms, but so far 2 speakers have not given consent. We will also add that to the session description in Whova. It is the yoga sessions and the fixed  withfhire presentation on Tuesday at 2:15: 2:15 - 2:35<br>\nFHIR Based Risk Adjustment Analytics<br>\nJagakarthikeyan Karuppiah, Pranathi Katta, Arati Swadi, Inovalon</p>",
        "id": 241577622,
        "sender_full_name": "Marita Mantle-Kloosterboer",
        "timestamp": 1622832385
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> Are the Pubtalks open to non-attendees?</p>",
        "id": 241807697,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1623085227
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"300914\">@Ryan Harrison</span>, no sorry, this is a part of the program for the FHIR DevDays attendees only.</p>",
        "id": 241808321,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1623085489
    }
]