[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191604\">@Carl Leitner</span>  I've downloaded the rc1 and compiled, but there are several things that are not completely clear to me yet ..</p>",
        "id": 230666881,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1615976255
    },
    {
        "content": "<p>my understanding was that the guides would include the \"full\" certificate and \"extracts\" used for the QR</p>",
        "id": 230667002,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1615976316
    },
    {
        "content": "<p>The extracts (two types ?) might disclose more or less infos depending on the usage</p>",
        "id": 230667132,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1615976404
    },
    {
        "content": "<p>Am I correct that for the time being only the QR \"extracts\" are represented there ?</p>",
        "id": 230667190,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1615976435
    },
    {
        "content": "<p>Are we going to include also the \"complete\" certificate ?</p>",
        "id": 230667267,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1615976481
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span>  cleaning up the repo now, so there may be some more changes.  What we will need is a an \"digital SVC composition\" which goes into the SVC registry and a \"paper SVC composition\"  which represents the content on the physical card.   the paper is what I think you mean by the extract, and the digital can contain more (e.g. lab tests).   we are trying to keep the paper and digital on parity with each other for content, so that  the digital svc composition.  The content in the paper SVC composition (+ provenance, + bundle ID) is what should be what is QR encoded.</p>",
        "id": 230883215,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1616081230
    },
    {
        "content": "<p>does this make sense, or add to the confusion ;-)</p>",
        "id": 230883239,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1616081240
    },
    {
        "content": "<p>Thank Carl I'll get a look to the new version..</p>",
        "id": 230883928,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1616081459
    },
    {
        "content": "<p>I think what we will want is a structure map from SVC Composition into IPS Composition.</p>",
        "id": 231313469,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1616421310
    },
    {
        "content": "<p>and another structure map from \"something\" into the SVC Composition &amp; Bundle where that something represents  the data fields  required for encoding into the QR-code.</p>",
        "id": 231313706,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1616421396
    },
    {
        "content": "<p>This something <em>could</em> be a questionnaire (and then we can use SDC to do the mapping into a bundle) but not sure this is the right fit.</p>",
        "id": 231313825,
        "sender_full_name": "Carl Leitner",
        "timestamp": 1616421444
    }
]