[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194916\">@Alex Kontur</span>  With multiple types of qualifications, what is the best way to distinguish between them? For example in the list of example codes, there are types of degrees, licenses and certificates, but it is not distinguishable which code belongs to which type, which is very helpful for searching. Could the system field be mapped to either 'degree', 'license' or 'certificate'?  Or would an extension field be needed?</p>",
        "id": 172160559,
        "sender_full_name": "Jesse Zuckerman",
        "timestamp": 1564603395
    },
    {
        "content": "<p>Because the binding strength is \"example\", you can use any value set you want. Therefore I would probably create a new one, either using the same codes but adding in some hierarchy (\"is-a\" relationships), or a simpler value set with just the high-level concepts that are relevant to your implementation.</p>",
        "id": 172220688,
        "sender_full_name": "Alex Kontur",
        "timestamp": 1564666718
    },
    {
        "content": "<p>We had an issue with the difference between 'real' degrees (something that proves a level of competence) and registrations (where some authority says you are allowed to practice). These all go in the 'qualification' element, but we are planning to use an extension to distinguish them explicitly (rather than needing to examine code.system) - along with other extensions for registration type info...</p>",
        "id": 172418092,
        "sender_full_name": "David Hay",
        "timestamp": 1564860183
    },
    {
        "content": "<p>Hi  I was trying to use builtin r4 model on organization for vhdir profile is there any way to generate the java model objects for profiles VhDir-organization</p>",
        "id": 172667758,
        "sender_full_name": "Syed",
        "timestamp": 1565175815
    },
    {
        "content": "<p>How to generate Java Model classes from FHIR resources?</p>\n<p>java xml hl7-fhir hapi hapi-fhir</p>\n<p>I was trying to understand how the model classes are getting generated for given FHIR Resource in the below linkhttp://build.fhir.org/ig/HL7/VhDir/StructureDefinition-vhdir-organization.html</p>\n<p>can see XML schema, Json-schema &amp; Schematron, Is there any way to generate the Source java classes from it ?</p>",
        "id": 172667761,
        "sender_full_name": "Syed",
        "timestamp": 1565175825
    },
    {
        "content": "<p>I'd suggest asking questions on HAPI in the <a class=\"stream\" data-stream-id=\"179167\" href=\"/#narrow/stream/179167-hapi\">#hapi</a> stream.</p>",
        "id": 172749739,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1565255313
    },
    {
        "content": "<p>You don't typically create special class for each guide, you can use the same core definitions that come with the HAPI or dotnet libraries.</p>",
        "id": 172749759,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1565255357
    },
    {
        "content": "<p>They are compliant with any conformant guide.</p>",
        "id": 172749771,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1565255381
    },
    {
        "content": "<p>Does anyone have an example of how a medical school degree would be mapped?</p>",
        "id": 173113443,
        "sender_full_name": "Jesse Zuckerman",
        "timestamp": 1565703281
    }
]