[
    {
        "content": "<p>I am preparing a set of discussion items for the nascent argo Direct Write API.  <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> can you comment on #3  <code>meta.tag</code> v <code>meta.security</code> ?</p>",
        "id": 246654825,
        "sender_full_name": "Eric Haas",
        "timestamp": 1626817202
    },
    {
        "content": "<p>link: <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=113672554\">https://confluence.hl7.org/pages/viewpage.action?pageId=113672554</a></p>",
        "id": 246654879,
        "sender_full_name": "Eric Haas",
        "timestamp": 1626817219
    },
    {
        "content": "<p>I am not sure what to react to. Is the ask that I react to \"name sucks \"?  The name of the element is now fixed in normative specification, so it is what it is.  We are having serious discussions that the vocabulary binding and given valueSets need to be relaxed.</p>",
        "id": 246712712,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626871044
    },
    {
        "content": "<p>if the question is why do we have .security and .tag... I don't know. I think if we had a chance to design it again.. which we don't, because it is normative... we likely wouldn't have bothered with two different tags. However, it is what it is, and it is normative.... so, the distinction are that .tag is for workflow, and .security is for protection (security and privacy... there is no good word, so we used security as it is broader than privacy but includes privacy enforcement).</p>",
        "id": 246712920,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626871164
    },
    {
        "content": "<p>I also note a question of provenance... Two other alternatives<br>\na) X-Provenance header --- I am not a real fan of this, but it is an alternative that is documented<br>\nb) Server automatically creates Provenance based on the create/update transactional context. Very likely that there are OAuth tokens associated with the transaction, plenty of good food for Provenance in that OAuth token. This might not be a descriptive Provenance, but if another more descriptive Provenance is sent later, then the two can be used in combination.<br>\nc) Provenance can be sent in a second create/update... classic REST.</p>",
        "id": 246713214,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626871341
    },
    {
        "content": "<blockquote>\n<p>distinction are that .tag is for workflow, and .security is for protection</p>\n</blockquote>\n<p>This makes sense; I think we're talking about workflow (<code>\"tag\"</code><br>\n) here.</p>",
        "id": 246724538,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626876496
    },
    {
        "content": "<p>What is the behavior that results from having the 'tag'?  It seems to be \"this needs review\", then \"this has been reviewed\", which would definitely point to workflow.</p>",
        "id": 246729938,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626878894
    },
    {
        "content": "<p>\"Needs\" review is a bit strong, but \"this was submitted by patient and appropriate workflow should be applied\" it is roughly the intent. We also want to make it very easy for searches to partition query results based on this value (e.g., filtering based on the tag).</p>",
        "id": 246732662,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626879821
    },
    {
        "content": "<blockquote>\n<p>distinction are that .tag is for workflow, and .security is for protection</p>\n</blockquote>\n<p>I think patient supplied is for protection of the server too and that drives workflow so that is not really a distinction.  They both both function to inform you of the data provenance.   I am OK with using tag although there will be confusion no matter what we do,  the concepts are identical in both spaces and I am going to push for reuse of the security codes rather than creating a parallel code system to maintain. </p>\n<p>Also I am trying to flush out  opposition now instead of later in the process.</p>",
        "id": 246736431,
        "sender_full_name": "Eric Haas",
        "timestamp": 1626881571
    },
    {
        "content": "<p>I'd try to avoid a direct dependency on a system like <a href=\"https://www.hl7.org/fhir/v3/ObservationValue/cs.html\">https://www.hl7.org/fhir/v3/ObservationValue/cs.html</a> -- this seems like 1) a kitchen sink from v3, 2) intended specifically for Observation \"value\" use cases, whereas our use case covers other kinds of patient-submitted data</p>",
        "id": 246737614,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626882165
    },
    {
        "content": "<blockquote>\n<p>b) Server automatically creates Provenance based on the create/update transactional context. Very likely that there are OAuth tokens associated with the transaction, plenty of good food for Provenance in that OAuth token. This might not be a descriptive Provenance, but if another more descriptive Provenance is sent later, then the two can be used in combination.</p>\n</blockquote>\n<p>yes the server can and may update its own provenance once the data crosses its threshhold, but that is not what we are talking about here.  This is specifically client side provided provenance.  I should make that clearer.  We are trying to define a minimum set of data and avoid transacting large bundles of data including practitioner and organization.   See the contrived example at the bottom of the page.</p>\n<p>I forgot about x-provenance thanks for that and thanks for your response</p>",
        "id": 246737798,
        "sender_full_name": "Eric Haas",
        "timestamp": 1626882245
    },
    {
        "content": "<p>Kitchen sink terminologies aren't necessarily something to avoid if there's an appropriate code there.  (SNOMED is far more kitchen sink than ObservationValue, and we rely on it heavily.)  Better question is whether the semantics of the code tightly align with your requirement.  If not, then fine to define a new one, though that'll probably end up somewhere in <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a> too - once the usage has matured to the point where we're comfortable defining an 'official' code</p>",
        "id": 246741925,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626884161
    },
    {
        "content": "<p>I will also note that paradoxically, providing more nuanced modeling may make it more difficult to build interoperable solutions here. For example, have different codes for patient asserted versus related person asserted versus caregiver asserted... makes it harder to detect/filter/search for \"stuff that came in from a patient app\". I think we should be parsimonious and basically define one tag, if we can get away with it.</p>",
        "id": 246743599,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626884892
    },
    {
        "content": "<p>It's also possible to mandate one tag and allow systems to also send finer-grained tags if they find value in doing so.</p>",
        "id": 246745372,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626885685
    },
    {
        "content": "<p>there is a security tag vocabulary that seems to be what you are looking for. <br>\n<a href=\"http://hl7.org/fhir/R4/v3/SecurityIntegrityObservationValue/vs.html\">http://hl7.org/fhir/R4/v3/SecurityIntegrityObservationValue/vs.html</a><br>\nPATAST  patient asserted    Security provenance metadata observation value used to indicate that an IT resource (data, information object, service, or system capability) was asserted by a patient.</p>",
        "id": 246754052,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626889464
    },
    {
        "content": "<p>that tag would indicate the data came from the patient. I think the workflow need to have someone review it is independent from marking that it came from the patient (provenance). This valueset holds many assertions of quality/integrity/accuracy/precision/sourcing... as simple tags vs a whole Provenance that would need to be interpreted (and would likely use these vocabulary anyway)</p>",
        "id": 246754195,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626889547
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  that is what we are discussing above, I am proposing reusing some of those and Josh is proposing a new set.  I am willing to prune it down to a scant few.</p>",
        "id": 246754991,
        "sender_full_name": "Eric Haas",
        "timestamp": 1626889911
    },
    {
        "content": "<p>scant few...as in ONE... right?</p>",
        "id": 246755368,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626890054
    },
    {
        "content": "<p>your implementation guide should certainly not send them to the wolves (like we did in the core spec... sorry about that).</p>",
        "id": 246755461,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626890094
    },
    {
        "content": "<p>\"patient asserted\" is a bit over-specific; it's close, but the semantics we've been discussing are more like \"This came from a patient channel\" (collected by a patient's app or device, or communicated by a patient-facing app -- but that could include data generated by an outside EHR, etc)</p>",
        "id": 246756668,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626890571
    },
    {
        "content": "<p>PATRPT  patient reported    Security provenance metadata observation value used to indicate that an IT resource (data, information object, service, or system capability) was reported by a patient.</p>",
        "id": 246758674,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626891600
    },
    {
        "content": "<p>lets be specific.....here is what I have proposed side by side.</p>\n<p><a href=\"/user_uploads/10155/p3ES9FgMCZUb0hbsx_qFoUug/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/p3ES9FgMCZUb0hbsx_qFoUug/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/p3ES9FgMCZUb0hbsx_qFoUug/image.png\"></a></div>",
        "id": 246758791,
        "sender_full_name": "Eric Haas",
        "timestamp": 1626891661
    },
    {
        "content": "<p>not trying to say I have picked the best code.. or that the valueSet given is perfect. Just pointing out that the concept of an integrity tag seems to be part of what you are looking for... where a different part is that the data needs yet to be reviewed by a clinician.</p>",
        "id": 246758823,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626891682
    },
    {
        "content": "<p>I would agree that there seems to be a missing code needed by modern technology... data asserted by a device the patient has chosen.</p>",
        "id": 246759087,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626891819
    }
]