[
    {
        "content": "<p>I noticed a IG under ballot that might be related or overlap with the things we discuss in Argo Write. I refer to PoCD (<a href=\"http://hl7.org/fhir/uv/pocd/2021Sep/index.html\">http://hl7.org/fhir/uv/pocd/2021Sep/index.html</a>) which refers to PHD (<a href=\"http://build.fhir.org/ig/HL7/PHD/\">http://build.fhir.org/ig/HL7/PHD/</a>). How does the work in Argo Write relate to these IG's?</p>",
        "id": 251691258,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1630576430
    },
    {
        "content": "<p>Here is my summary contrasting and comparing Argo Write with POCD:</p>\n<ol>\n<li>POCD intended for \"clinical users of point-of-care device data and as such focused on \"is focused on acute-care devices for professional use mainly in healthcare delivery facilities\". Argo Write provider write is out of scope and the focus is primarily patients, but in future we hope to address other users.</li>\n<li>Both use Observations, both conform to vital signs</li>\n<li>POCD models the Device, Argo is silent on this. An Observation may link to this Device (or DeviceMetric) Profile.</li>\n<li>POCD use the \"MDC Nomenclature model\" and \"many of these have LOINC equivalents, SNOMED equivalents, or both\" Argo write is generall silent on terminology although depending the FHIR Observation Profile ( e.g. US Core Vitals ) typcially uses LOINC and SNOMED.  Mapping may be required between the two.</li>\n<li>POCD is based upon a HL7 V2 Device Data to FHIR and describes the Mapping from the IEEE 11073-10201 DIM, and IEEE 11073-10207 SDC to FHIR (including Patient, Organization, and Device and Observation resources for various classes of data.) Argo Write is not a mapping from another standard, but focuses on a simple create interaction using the FHIR API.  It does not address the technical device metadata about the measurements.</li>\n<li>POCD guidance recommend <em>transaction bundle interactions</em> to initialize and create/update/delete resources.  Argo Write design is to use individual create and interactions for each resource.  Update and delete are out of scope and any initialization steps are considered out of band.</li>\n</ol>",
        "id": 252374300,
        "sender_full_name": "Eric Haas",
        "timestamp": 1631049964
    },
    {
        "content": "<p>Here is my summary contrasting and comparing Argo Write with PHD:</p>\n<ol>\n<li>PHD guide is focused on \"communicating Personal Health Devices (PHDs) to receiving systems.... PHDs are typically consumer devices designed to be used by people without medical background.\"  It uses the IEEE 11073 20601 standard and the communication protocol and is mapped to FHIR Observations. Six types of measurement values (Observations) values are documented and profiled.  Argo write scope does not profile individual types of Observations, instead it define a \"mixin\" profile to add on to other profiles and is general enough to includes all these types of data an profiles. </li>\n<li>PHD describes Personal Health Gateway (PHG)  and Device profile (PHD) and way to reference. Argo write may reference the gateway and use these profiles.</li>\n<li>Both treat Patient information, such as demographic and administrative information about the patient separately</li>\n<li>PHD  does NOT cover measurement data entered manually.  Argo Write does.</li>\n<li>Like POCD, PHD use the \"MDC Nomenclature model\" and \"many of these have LOINC equivalents, SNOMED equivalents, or both\" Argo write is generally silent on terminology although depending the FHIR Observation Profile ( e.g. US Core Vitals ) typically uses LOINC and SNOMED.  Mapping may be required between the two.</li>\n<li>like POCD, PHD describes the Mapping from the IEEE 11073-10201 DIM, and IEEE 11073-10207 SDC to FHIR (including Patient, Organization, and Device and Observation resources for various classes of data.) Argo Write is not a mapping from another standard, but focuses on a simple create interaction using the FHIR API.  It does not address the technical device metadata about the measurements.</li>\n</ol>",
        "id": 252377085,
        "sender_full_name": "Eric Haas",
        "timestamp": 1631051630
    },
    {
        "content": "<p>comments welcome and will add to the draft argo write Ig as a side bar.</p>",
        "id": 252377179,
        "sender_full_name": "Eric Haas",
        "timestamp": 1631051683
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191401\">Eric Haas</span> <a href=\"#narrow/stream/282143-Argo-Write/topic/PoCD.20and.20PHD.20IG's.20and.20Argo.20Write/near/252374300\">said</a>:</p>\n<blockquote>\n<ol start=\"6\">\n<li>POCD guidance recommend <em>transaction bundle interactions</em> to initialize and create/update/delete resources.  Argo Write design is to use individual create and interactions for each resource.</li>\n</ol>\n</blockquote>\n<p>When I upload the data from my continuous glucose monitor, I get around 50,000 individual entries just for these glucose measurements (5 minutes apart, for the duration that fits into the memory of the device). It's painful to upload these into a system that does not support Bundles. Yes, we have experience on that. I'd like to see Bundles supported. :)</p>",
        "id": 253449820,
        "sender_full_name": "Mikael Rinnetm채ki",
        "timestamp": 1631725122
    },
    {
        "content": "<p>And no, I don't think describing these measurements as valueSampledData within an Observation, as application typically search for entries for a certain day or a range of days, for instance, and the period covered by the upload rarely matches what they are searching for.</p>",
        "id": 253449832,
        "sender_full_name": "Mikael Rinnetm채ki",
        "timestamp": 1631725125
    },
    {
        "content": "<p>Other than that, a great summary, thanks! I've also glanced at both POCD and PHD, and agree with your analysis.</p>",
        "id": 253449972,
        "sender_full_name": "Mikael Rinnetm채ki",
        "timestamp": 1631725175
    },
    {
        "content": "<p>As an implementer, we have felt the constraints of mapping to IEEE profiles too constraining (no codes for data we've wanted to transfer) and haven't been able to use those profiles as such.</p>",
        "id": 253450389,
        "sender_full_name": "Mikael Rinnetm채ki",
        "timestamp": 1631725288
    }
]