[
    {
        "content": "<p><a href=\"https://patents.google.com/patent/US10575790B2/en\">https://patents.google.com/patent/US10575790B2/en</a><br>\nA non-transitory computer-readable medium that stores a program that, when executed by a processor, causes the processor to execute, via a patient diabetes monitoring system having a physiological data input device which acquires a plurality of blood glucose concentration measurements of the patient within a time window to generate at least one time window dataset of collected unsupervised daily monitoring profiles and which is in communication with said processor, such that said processor receives said generated at least one time window dataset, and in communication with said memory, an unsupervised daily monitoring profile clustering algorithm that causes said processor to automatically:<br>\npre-process the dataset to generate a pre-processed dataset via a data transformation of the dataset that makes the pre-processed dataset symmetric for retrospective analysis,<br>\nbuild a similarity matrix from the pre-processed dataset, and<br>\noutput an optimum number of similarity clusters,<br>\nwherein the data transformation for retrospective analysis results from processing the dataset with a hazard function defined by: Gt=α<em>ln (G−β)−α</em>ln(α), where parameter α=Tc−β, and parameter β=Dr−1, in which Tc is a center of a transformed space, Dr is a minimum defined glucose level, Gt is the transformed data of the blood glucose concentration measurements provided in the dataset, and G is original glucose level values of the blood glucose concentration measurements provided in the dataset and measured in millimoles per liter.</p>",
        "id": 242916806,
        "sender_full_name": "Chandrakant Bhoslay",
        "timestamp": 1623865672
    },
    {
        "content": "<p>Patient-Generated Data<br>\nPatient-generated data can include a wide array of variables (e.g., physical activity, sleep patterns, self-reported sign and symptoms, uploaded blood sugar levels) and may be captured within an EHR through various means (e.g., integrated personal health records, mobile-health exchange platforms, wearable device interfaces).36 EHR-based patient-generated data are highly customized and inconsistent across EHRs. Standards are becoming more available for mobile health and wearables devices,37 but have not yet been widely adopted for patient-generated data captured within EHRs. Although the quality of the data collected by mobile health and wearable devices is improving, accuracy and comparability are still challenging when such data are collected using different devices. Self-entered data collected via surveys (e.g., entering physical activity types) are subject to a variety of selection factors and errors (e.g., overestimating recall of time spent exercising). Data interoperability may become more challenging as more non-standardized devices enter the market. Additionally, consenting processes via internet and mobile health solutions may be complex, and the creation of large EHR-integrated registries using patient-generated data requires careful attention to legal and regulatory issues.38, 39<br>\n36. <br>\nWorkman TA. Engaging Patients in Information Sharing and Data Collection: The Role of Patient-Powered Registries and Research Networks. AHRQ Community Forum White Paper. AHRQ Publication No. 13-EHC124-EF. Rockville, MD: Agency for Healthcare Research and Quality; September 2013.<br>\n37. <br>\nHealth Level Seven (HL7). Mobile Health. <br>\nxn--http://www-fs6e.hl7.xn--org/Special/committees/mobile/-qm8r<br>\n. Accessed August 16, 2019.<br>\n38. <br>\nArora S, Yttri J, Nilse W. Privacy and Security in Mobile Health (mHealth) Research. Alcohol Res. 2014;36(1):143–51. PMID: 26259009. [PMC free article] [PubMed]<br>\n39. <br>\nDreyer NA, Blackburn S, Hliva V, et al. Balancing the Interests of Patient Data Protection and Medication Safety Monitoring in a Public-Private Partnership. JMIR Med Inform. 2015;3(2). PMID: 25881627. DOI: 10.2196/medinform.3937. [PMC free article] [PubMed] [CrossRef]<br>\n<a href=\"https://www.ncbi.nlm.nih.gov/books/NBK551878/#!po=78.9773\">https://www.ncbi.nlm.nih.gov/books/NBK551878/#!po=78.9773</a></p>",
        "id": 242916885,
        "sender_full_name": "Chandrakant Bhoslay",
        "timestamp": 1623865694
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 242917113,
        "sender_full_name": "Chandrakant Bhoslay",
        "timestamp": 1623865813
    },
    {
        "content": "<p><a href=\"https://patents.google.com/patent/US10575790B2/en\">https://patents.google.com/patent/US10575790B2/en</a></p>",
        "id": 242917176,
        "sender_full_name": "Chandrakant Bhoslay",
        "timestamp": 1623865850
    },
    {
        "content": "<p>Nothing about this patent is touching on writing data back to an EHR, from what I can see (which is a good thing, since we certainly don't want our specs to touch on protected IP!)</p>",
        "id": 242922116,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1623868062
    }
]