[
    {
        "content": "<p>In my experience \"please read the spec\" is technically correct advice but rarely an effective persuasion technique:-)</p>",
        "id": 250683086,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629925741
    },
    {
        "content": "<p>yeah, I know.</p>",
        "id": 250683320,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629925819
    },
    {
        "content": "<p>should I do a Josh style 10 minute walking webinar?</p>",
        "id": 250683358,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629925832
    },
    {
        "content": "<p>in the style of \"let me read that out loud for you\"</p>",
        "id": 250683428,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629925869
    },
    {
        "content": "<p>I mean, it's worth it a shot. I promise I'll watch ;-)</p>",
        "id": 250683448,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629925880
    },
    {
        "content": "<p>But a focused argument might be better (my \"checklist\" series really is just \"here's what the spec says\"; it's not trying to persuade anyone of anything)</p>",
        "id": 250683591,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629925926
    },
    {
        "content": "<p>understood. The key for me is to understand the audience need.</p>",
        "id": 250683659,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629925970
    },
    {
        "content": "<p>especially when the argument is \"seems counter intutitive\" so lets use the exact same datatype on an element sitting right next to it.</p>",
        "id": 250683717,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629926005
    },
    {
        "content": "<p>That's fair. One technical question: is there an existing label that means \"supplied by patient or another patient designated representative\" (i.e., a roll-up code covering this whole space)? That's what (1) in my post upthread was getting at. I think (2) is indeed covered by an existing concept</p>",
        "id": 250684092,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629926183
    },
    {
        "content": "<p>And if it helps you craft an argument: I think these use cases have nothing obvious to do with security, by the time the data have landed in a server. It's more like context/provenance. So sticking the information in an element called \"security\" is indeed counter to my intuitions about where it \"belongs\".</p>",
        "id": 250684280,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629926269
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/282143-Argo-Write/topic/Security.20labels/near/250684280\">said</a>:</p>\n<blockquote>\n<p>And if it helps you craft an argument: I think these use cases have nothing obvious to do with security, by the time the data have landed in a server. It's more like context/provenance. So sticking the information in an element called \"security\" is indeed counter to my intuitions about where it \"belongs\".</p>\n</blockquote>\n<p>I suspect this feeling is due to a lack of understanding of Security. Too often Security is perceived as only about access control. Security is about managing risks to \"Confidentiality\" + \"Availability\" + \"Integrity\". This is why there are a set of codes to indicate the integrity status of the data. This set of codes indicating the integrity status is where PATAST comes from. There are other codes for indicating that the data is from a payer, etc.; also where the codes are for this data has been degraded by de-identification or summarization.<br>\n<a href=\"https://terminology.hl7.org/2.0.0/ValueSet-v3-SecurityIntegrityObservationValue.html\">https://terminology.hl7.org/2.0.0/ValueSet-v3-SecurityIntegrityObservationValue.html</a></p>",
        "id": 250685028,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629926594
    },
    {
        "content": "<p>note that PATRPT might be an alternative to PATAST. slightly different meaning.</p>",
        "id": 250685222,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629926684
    },
    {
        "content": "<p>BUT, as you point out these codes are specific to the Patient. and not patient delegated devices. this is not a concept that we have run across. So I would be fine with identifying that it is new, and this newness is promulgated by the prominence of FHIR and apps.</p>",
        "id": 250685397,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629926766
    },
    {
        "content": "<p>however it could also be just PATRPT + DEVRPT</p>",
        "id": 250685440,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629926792
    },
    {
        "content": "<p>On one hand, the security label is used to \"determine what handling caveats must be conveyed with the data\". Being patient-supplied is a type of handling caveat, it speaks to the reliability and little-p provenance of the data.</p>\n<p>On the other hand, tags are \"used to relate resources to process and workflow\". If the FHIR Write concept is that patient-supplied resources are landed somewhere before potentially being reviewed/processed and then incorporated into the clinical record (whatever that means), that sounds more like a tag to me as it indicates that some workflow needs to happen.</p>\n<p>Another distinction is that an application consuming this data should look at security labels but is under no particular obligation to look at tags. This doesn't seem like a clear-cut decision to me - applications should consider this but there may be nuances about patient-supplied, patient-mediated, device-generated, etc. going beyond <a href=\"http://meta.security\">meta.security</a> that the application would probably have to look at Provenance to understand. Some applications probably won't care at all.</p>\n<p>The general thinking on the Google side (which hasn't turned into anything real yet) is that we like tags because we expect to land data and then take some action on it (validation, connecting references to other non-patient-supplied resources, generating provenance, flagging for review or notification, the list goes on) after which point it might transition to having a different tag. So the tag for \"totally unvetted patient input\" is a workflow stage rather than something fundamental that has to be carried along with the data.</p>",
        "id": 250685548,
        "sender_full_name": "Paul Church",
        "timestamp": 1629926859
    },
    {
        "content": "<p>Indeed, applying these tags on influx was intended to allow for this kind of ingestion workflow without segregating the new data or <em>requiring</em> any particularly workflow.</p>",
        "id": 250701074,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629936592
    },
    {
        "content": "<p>EHRs are free to strip these tags downstream as they see fit, or to retain them to allow queries that use them to filter data.</p>",
        "id": 250701189,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629936653
    },
    {
        "content": "<p><a href=\"https://hackmd.io/@erichaas/rJVqJGmeY/%2FMkcfI0C8TyGyVF0bln3WDA\">Here</a> is a draft of an Observation profile to apply these element to observations.  Notice the patient supplied tag and the and security integrity label plus all the other elements that we think provide context for the write.</p>",
        "id": 250705807,
        "sender_full_name": "Eric Haas",
        "timestamp": 1629939814
    },
    {
        "content": "<p>I'm reading but struggling with <a href=\"http://hl7.org/fhir/uv/security-label-ds4p/2021Sep/concept.html#security-labeling-requires-classification\">http://hl7.org/fhir/uv/security-label-ds4p/2021Sep/concept.html#security-labeling-requires-classification</a></p>\n<blockquote>\n<p>a security label without a Confidentiality code is not a security label because without this minimum bar for entry, such a label would be useless for interoperable access control, and should be regarded as some other type of meta data.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> for a \"simple\" example like a <code>.meta.security</code> value of <code>PATRPT</code>, the text I quoted seems to day it \"is not a security label\" because it has no Confidentiality code. But this use case isn't about confidentiality.</p>\n<p>(I'm probably taking this quote out of context, but I'm not trying to! I'm reading DS4P for ballot review, and trying to apply it to areas I'm more familiar with to check my own understanding.)</p>",
        "id": 251775329,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630612019
    },
    {
        "content": "<p>Please file a CR. That text is not in my view correct.</p>",
        "id": 251776071,
        "sender_full_name": "John Moehrke",
        "timestamp": 1630612322
    }
]