[
    {
        "content": "<p>Hello.</p>\n<p>Is Microsoft powerBI a good choice for working with FHIR? Is there a connector ready to consume server data?</p>\n<p>Thanks for any help.</p>",
        "id": 179967441,
        "sender_full_name": "Paulo Rades",
        "timestamp": 1572982057
    },
    {
        "content": "<p>He - we usually \"flatten\" and export data from aidbox into PowerBI. For example using custom operation $sql-dump - <a href=\"https://docs.aidbox.app/basic-concepts/bulk-api-1/usddump-sql-tutorial\" target=\"_blank\" title=\"https://docs.aidbox.app/basic-concepts/bulk-api-1/usddump-sql-tutorial\">https://docs.aidbox.app/basic-concepts/bulk-api-1/usddump-sql-tutorial</a></p>",
        "id": 180040041,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1573052275
    },
    {
        "content": "<p>Re: connection directly to a fhir server, can you share some of these cases you have in mind? In general for analytics it can often be helpful to connect to the underlying database of a server (or an export -- as Nicola describes, or using the standard $export operation) rather than connecting through the fhir API itself (which works best for more targeted queries).</p>",
        "id": 180138459,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1573137863
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> If it's a Microsoft server (the open source one) what are good options for querying outside of the normal REST API?<br>\nIs there a way to query Cosmos DB for instance?</p>",
        "id": 180284274,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1573256864
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195775\">@Michael Hansen</span> for an authoritative answer (and I since he has also written Azure Data Factory scripts for extraction) -- but yes, I think there should be access to underlying storage.</p>",
        "id": 180284389,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1573256968
    },
    {
        "content": "<p>Hello friends. Thanks for the answers....</p>\n<p>A little more information about the project:</p>\n<p>We have 9 different data sources (9 different applications that implement relational databases like MySql, Postgress, Oracle, Sql, etc.)</p>\n<p>Challenge:</p>\n<p>1 - create a structured data lake in FHIR<br>\n2 - enable information exchange of each of these applications with FHIR<br>\n3 - Analyze the data from this data lake we are building.</p>\n<p>Doubts:</p>\n<p>1 - Is it viable to use Aid.Box as suggested by Nicolas, since our original databases are relational (sql) ....?</p>\n<p>Note: I want to use mirth connect to turn relational bds into FHIR .. I don't understand why move this data to Aid.Box and again have a relational database to perform the analysis?</p>\n<p>2 - For each application should I build a FHIR server for information exchange or would a single FHIR server be the best option? Or would Aid.Box also be used for data exchange with other applications?</p>\n<p>Thank you in advance</p>",
        "id": 180424155,
        "sender_full_name": "Paulo Rades",
        "timestamp": 1573479791
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193385\">@Paulo Rades</span> aidbox is just one of ready-to-use generic FHIR servers with extra features,  it's up to you use it or not. The problem with FHIR and relational databases  is that it's  hard to fit FHIR in general into traditional tables (because object relational impedance mismatch).   You have 9 applications and you want to aggregate data in one place? Can this 9 apps have unified relational structure? Usually not. That's why you probably want to load this data into generic FHIR server and after flatten it again  (with some reasonable information loss) for analytics.  From other side, if you able to find common relational denominator  for all of your apps - you can skip this step.</p>",
        "id": 181990575,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1574831777
    },
    {
        "content": "<p>I have created a very basic open source FHIR Connector for Google Data Studio (it's free for use).<br>\nIf you wish to use Google Data Studio you can start from here. <a href=\"https://github.com/leo9223/FHIR-GDS-Connector\">https://github.com/leo9223/FHIR-GDS-Connector</a></p>",
        "id": 199344299,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1590997830
    }
]