[
    {
        "content": "<p>Hello everyone,</p>\n<p>I am wondering about FHIR search, maybe you could help me:</p>\n<p>I would like to store a list of characteristics of patients in a FHIR resource (example : searching for a particular DiagnosticReport, a particular value for an observation, a prescription or the content of a document).<br>\nThe goal would be to create a FHIR resource to save the list of citeria, that would be used to search for the matching patients (Allowing to generate the URL )</p>\n<p>Have you got an idea of how to do that in FHIR ?</p>\n<p>There is the Group resource, however I don't know how define the search criteria only using a code and a value, and how to generate the restful API request.</p>\n<p>Thanks for your answer !</p>\n<p>Nicolas</p>",
        "id": 199633566,
        "sender_full_name": "Nicolas Riss | Arkhn",
        "timestamp": 1591197741
    },
    {
        "content": "<p>The FHIR Parameters resource would be a good fit for capturing the list of criteria.  However, the Parameters resource, is not supported by the FHIR restful API, meaning that you can not use the FHIR API to store or query instances of this resource.</p>\n<p>Since your use case doesn't fit another existing resource, you could consider using the Basic resource to persist the criteria, potentially using the Parameters resource to capture the criteria in a structured way within Basic.</p>",
        "id": 200172446,
        "sender_full_name": "Brian Wright",
        "timestamp": 1591663369
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256562\">@Nicolas Riss</span> you could also look the Library resource</p>",
        "id": 200266842,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1591725310
    },
    {
        "content": "<p>Thanks everyone for your answers, your propositions are really interesting. <br>\nFinally, I just created my custom characteristic parameters using a code and a value / a text (using CodeableContext.text) and generate the API requests dynamically.</p>\n<p>It's not perfectly satisfying but it works.</p>\n<p><span class=\"user-mention\" data-user-id=\"193657\">@Ryan Brush</span> <span class=\"user-mention\" data-user-id=\"245789\">@Eric Whitley</span>  : to extract data from resources, we are currently developing a tool called FHIR2DATASET to extract data using a sql like format : <a href=\"https://github.com/arkhn/FHIR2Dataset\">https://github.com/arkhn/FHIR2Dataset</a></p>",
        "id": 201259847,
        "sender_full_name": "Nicolas Riss | Arkhn",
        "timestamp": 1592482927
    }
]