[
    {
        "content": "<p>Hi Guys, I am wondering whether FHIR could process the streaming data input or we should process each message one by one ?</p>",
        "id": 208268242,
        "sender_full_name": "Chester Guan （Ziyuan Guan）",
        "timestamp": 1598558405
    },
    {
        "content": "<p>FHIRhose has not been defined yet...<br>\n(Sorry, it's a semi-obligatory pun/joke.)</p>\n<p>What is the use case for handling streaming data? Are you thinking something like Apache Kafka?</p>",
        "id": 208270841,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1598559677
    },
    {
        "content": "<p>I have a similar question and also curious if there are implementations with lessons learnt? Use Case: devices streaming vital signs or other observations - lots of devices, like 3000+ and if each takes the vitals every n minutes for 4 hours, we have a lot of data. On the other hand, there is a FHIR EMR that wants to consume analytics outputs based on the data stream. What would be the suggested approach? All technologies are welcome. Brainstorming the ideas. Where would FHIR play a role?</p>",
        "id": 208279210,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1598563878
    },
    {
        "content": "<p>there are certainly implementations out there built on top of various streaming frameworks that run FHIR resources at bulk through a pipeline.</p>",
        "id": 208280766,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598564866
    },
    {
        "content": "<p>Excellent! anyone can share details? or links or hints? ( a bit more specific than Grahame's hint :)</p>",
        "id": 208281044,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1598565016
    },
    {
        "content": "<p>all the ones i have seen are proprietary and commercial in confidence</p>",
        "id": 208284537,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598567408
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191416\">@Iryna Roy</span> I have worked on a couple of projects at a scale similar to yours that integrated streaming, business rules management, and machine learning model execution with outputs persisted in FHIR and made available via Smart on FHIR apps.  Our number one lesson learned from data science perspective was to utilize the same data model for model development and execution.  We selected FHIR and it has worked well.</p>",
        "id": 208598752,
        "sender_full_name": "Brian Wright",
        "timestamp": 1598899280
    }
]