[
    {
        "content": "<p>New to fhir. i have established fhir Server using hapi. <br>\ni was playing around with fhir server and i know to send create update  patient using rest apis.</p>\n<p>My Question is how to convert my existing data to fhir Format, <br>\ni have lot of patients data stored in My SQL database  and XML files now how to convert this data to fhir Format.<br>\ni think we should do mapping. please guide me About fhir mapping. what is it exactly and how to do</p>",
        "id": 188625266,
        "sender_full_name": "Revathy R",
        "timestamp": 1582193793
    },
    {
        "content": "<p>There's no magic solution - every database or proprietary XML syntax is different.  You'll have to look at each element you have in your existing system and figure out what it corresponds to in FHIR (in some cases, you may need to convert data values too, whether that's changing date syntax or mapping gender codes).  Then you need to write software in the language of your choice that converts data from one place to the other.  You can use the relevant FHIR reference implementation so that you're mapping at the object layer and don't have to worry about the FHIR syntax (and thus can easily produce &amp; consume XML, JSON and/or turtle.  It's really not that different between writing the logic that converts between your persistence layer and your presentation layer - just think of FHIR as a 'different' presentation layer.</p>",
        "id": 188651690,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582214835
    },
    {
        "content": "<p>I know it thier no magical soln. .. I just asked a small example or code of 2 lines. .. Anyways thanks for your reply</p>",
        "id": 188663358,
        "sender_full_name": "Revathy R",
        "timestamp": 1582222920
    },
    {
        "content": "<p>This may be of interest: <a href=\"https://fhirblog.com/2019/03/25/importing-csv-data-into-a-fhir-server/#more-161543\" target=\"_blank\" title=\"https://fhirblog.com/2019/03/25/importing-csv-data-into-a-fhir-server/#more-161543\">https://fhirblog.com/2019/03/25/importing-csv-data-into-a-fhir-server/#more-161543</a></p>",
        "id": 188671644,
        "sender_full_name": "David Hay",
        "timestamp": 1582228442
    },
    {
        "content": "<p>Thanks a lot. It gave me clear idea. Thanks</p>",
        "id": 188704763,
        "sender_full_name": "Revathy R",
        "timestamp": 1582262913
    }
]