[
    {
        "content": "<p>Looking at the “General Syntax Notes” section, there is the following sentence:</p>\n<p>“To avoid parsing ambiguities however, they cannot start with a character, cannot be one of the keywords used in the language (see section Reserved Keywords below) [...]”</p>\n<p>Was it meant to say “[...], they cannot start with a <em>special</em> character, [...]”?</p>",
        "id": 177987088,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1570884334
    },
    {
        "content": "<p>it's hard to figure out what 'cannot start with a character' leaves you...</p>",
        "id": 178018262,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570936616
    },
    {
        "content": "<p>so yes</p>",
        "id": 178018263,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570936619
    },
    {
        "content": "<p>Haha, true. Wouldn't it make sense to define it identical to a 'simple identifier' in FHIRPath? And if you would want more you can default to escaping it?</p>",
        "id": 178050480,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1570993372
    },
    {
        "content": "<p>By that we wouldn't need to explicitly exclude dashes and dots, and lift the 64 chars restriction. In the end the type of these targets in StructureMap will need change from id to string anyway to due a possible escaping, right? So we could harmonise both approaches and allow \"_\".</p>",
        "id": 178051830,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1570995604
    },
    {
        "content": "<p>I'm not sure. you want a simple identifier or not?</p>",
        "id": 178083176,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571041604
    },
    {
        "content": "<p>In the end we need to allow complex / escaped identifiers here. The first issue here is that the FML syntax allows escaped / quoted identifiers, whereas StructureMap expects elements of type 'id' in these cases. If we resolve that issue by changing the type from id to string we could simplify the whole definition by saying that the default for these names are what would essentially be a simple identifier in FHIRPath instead of the current definition as ids. By that we would additionally allow \"_\" at the beginning, but dashes and dots wouldn't need to be excluded.</p>",
        "id": 178085679,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1571043746
    },
    {
        "content": "<p>alright, do you want to make a task for that?</p>",
        "id": 178085965,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571043920
    },
    {
        "content": "<p>Sorry, almost forgot about it. See <a href=\"https://jira.hl7.org/browse/FHIR-25266\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-25266\">https://jira.hl7.org/browse/FHIR-25266</a></p>",
        "id": 182490774,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1575404277
    }
]