[
    {
        "content": "<p>Hi, I'm new here, but hoping I can just jump right in and ask a question!</p>\n<p>The FHIR mapping spec says it \"describes how one set of Directed Acyclic Graphs (an instance) is transformed to another set of directed acyclic graphs\". What is this referring to? I thought that FHIR resources were tree-shaped, i.e. that an element of a resource always has exactly one parent element. Or if it's talking about fhir references, can't there be cycles in the references, thus making it not be a directed <em>acyclic</em> graph?</p>",
        "id": 171108490,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1563390483
    },
    {
        "content": "<p>Every tree is a DAG (we are talking about polytrees actually, which even with multiple parents they can be interpreted as DAGs)</p>",
        "id": 171112372,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1563393617
    },
    {
        "content": "<p>What's the edge relation for which FHIR trees are polytrees? If <code>(A, B)</code> is in the set of edges, I was expecting that to mean that <code>A</code> and <code>B</code> are elements of a resource, and <code>B</code> is nested under <code>A</code> in the structure diagram. (So, for example, <code>(name, given)</code> would be an edge in HumanName.) Is the edge relation something else?</p>",
        "id": 171113066,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1563394102
    },
    {
        "content": "<p>Each class/resource can be seen as a graph node (or tree node) and every attribute that relates classes/resources is a directed edge. The same applies for xml btw</p>",
        "id": 171145651,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1563436678
    },
    {
        "content": "<p>From the perspective of FHIR, I think the documentation could have been written with \"trees\" in place of \"DAGs\". Would that that have been clearer <span class=\"user-mention\" data-user-id=\"231009\">@Justin Pombrio</span> ? (And for others here: Would that description leave out important capabilities or goals of the language?)</p>",
        "id": 171171256,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1563457557
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191708\">@Diego Bosca</span> Since references can <a href=\"https://www.hl7.org/fhir/references.html#circular\" target=\"_blank\" title=\"https://www.hl7.org/fhir/references.html#circular\">contain cycles</a>, I'm guessing you don't mean to include them in \"attributes that relate classes/resources\"? Could you give an example of a resource that has two parents, by edges that aren't references? (Sorry if this is this is an easy thing I'm just missing because I don't know FHIR very well yet.)</p>\n<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> My understanding was that each FHIR resource was a tree, and that resources related to one another primarily via references, which form a (possibly cyclic) graph. So I was expecting that sentence to say either \"tree\" or \"graph\", but not \"DAG\". (With \"trees\" being more appropriate since the mapping language is mostly dealing with transforming individual resources.) But if I'm wrong about that, it's important that the docs say the correct thing.</p>",
        "id": 171178257,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1563461855
    },
    {
        "content": "<p>yeah, but when you reference something you are not including the class, but a reference to a given object (it literally is a class of 'Reference' type). In a data instance, when you arrive to a reference you don't actually put it's contents there, so references are leaf nodes in your tree</p>",
        "id": 171179052,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1563462319
    },
    {
        "content": "<p>Yes, I understand. You said that FHIR resources form a polytree, via edges that are \"attributes that relate classes/resources\", right? If so, it's possible for a resource to have two parents. Can you give an example of a resource that has two parents?</p>",
        "id": 171180526,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1563463246
    },
    {
        "content": "<p>polytrees, which have less constraints than trees (e.g. can have multiple parents), are equivalent to DAGs. Trees in most standards (FHIR included) have more constraints (they only have one parent, etc.) so they are still equivalent to DAGs</p>",
        "id": 171182740,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1563464693
    },
    {
        "content": "<p>Ok, so \"tree\" would be the appropriate thing to say. (As Diego points out, every tree is a DAG. But developers need to know what they have to deal with in the worst case, and they don't have to deal with an element with two parents. And regardless, it's always better to use the more precise term.)</p>",
        "id": 171184512,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1563465684
    },
    {
        "content": "<p>I'm agreeing with you <span class=\"user-mention\" data-user-id=\"231009\">@Justin Pombrio</span> (and tried to express this above; apologies if I was unclear) -- as long as nobody else thinks the mapping language actually applies to non-tree DAGs, we should just be saying \"tree\".</p>",
        "id": 171190786,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1563470433
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>. Yeah, you were clear :-). I think \"tree\" or \"forest\" would make sense; \"DAG\" just scared me because I thought I was missing something about how FHIR resources worked.</p>",
        "id": 171726741,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1564088003
    },
    {
        "content": "<p>Great. I added <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23007\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23007\">GF#23007</a> to capture this conversation.</p>",
        "id": 171728147,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1564088957
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 171728414,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1564089177
    },
    {
        "content": "<p>hang on. catching up with this topic.... FHIR resources are trees, but the mapping language works on DAGs. That's a clear difference</p>",
        "id": 171728487,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564089243
    },
    {
        "content": "<p>Sorry, I accidentally started a new conversation and can't figure out how to delete it. Probably we should continue the other conversation to avoid confusion, though I don't know Zulip well yet.</p>",
        "id": 171728611,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1564089370
    },
    {
        "content": "<p>fixed.</p>",
        "id": 171728678,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564089481
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> You say that the mapping language works on DAGs. What do you mean by that: what are the edges? If the edges are fhir references, then they can form cycles, and so it's a general graph, not a DAG.</p>",
        "id": 171728679,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1564089481
    },
    {
        "content": "<p>references are not edges. But I don't understand your question</p>",
        "id": 171728724,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564089502
    },
    {
        "content": "<p>FHIR resources are trees, with a designated starting point, and a single heirarchy.</p>",
        "id": 171728739,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564089541
    },
    {
        "content": "<p>What are the edges of the DAGs that the language works on?</p>",
        "id": 171728749,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1564089557
    },
    {
        "content": "<p>but the mapping language works with DAGs, and some of the other content that you map from/to are not trees, they are DAGS</p>",
        "id": 171728752,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564089569
    },
    {
        "content": "<p>I don't understand 'what are the edges'</p>",
        "id": 171728756,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564089579
    },
    {
        "content": "<p>What's an example of other content that's a DAG?</p>",
        "id": 171728809,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1564089605
    },
    {
        "content": "<p>I worked with someone who was working with a custom XML format where id links were redirections that were followed internally.</p>",
        "id": 171728867,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564089677
    },
    {
        "content": "<p>HL7 has never published a poly-heirarchy, nor has openEHR or IHE, to my knowledge, but I have seen them in private formats - programmers fall into them naturally and do not have the experience not to until too late</p>",
        "id": 171728930,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564089726
    },
    {
        "content": "<p>But the format didn't allow cycles? I'm surprised because \"the mapping language works on DAGs\" suggests that if you give it a DAG, it can transform it into another DAG, but is not capable of accidentally transforming it into a graph, and I didn't think that was easy to achieve.</p>",
        "id": 171729004,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1564089825
    },
    {
        "content": "<p>The input format did not make use of cycles. I cannot say whether it allowed cycles or not at some level in the definition. In terms of output.... I guess the mapping language could produce a true graph, not a DAG, but I'm not sure exactly how that would work in practice. I'd have to investigate</p>",
        "id": 171729168,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564089962
    },
    {
        "content": "<p>I don't mean to send you off on a whole investigation! The important thing, at least to me, is that the docs scared me into thinking that maybe fhir resources weren't trees. A parenthetical note saying that while the language is more general, it typically acts on fhir resources---which are trees---would clear up the confusion.</p>",
        "id": 171729366,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1564090186
    },
    {
        "content": "<p>I agree with that. I added a note to the task</p>",
        "id": 171729466,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564090301
    },
    {
        "content": "<p>Thanks for diving so deep into one sentence with me.</p>",
        "id": 171729526,
        "sender_full_name": "Justin Pombrio",
        "timestamp": 1564090354
    },
    {
        "content": "<p>no problems</p>",
        "id": 171729545,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564090387
    }
]