[
    {
        "content": "<p>I'd like to get some feedback on this profile: <a href=\"http://build.fhir.org/ig/HL7/fhir-bfdr/branches/master/StructureDefinition-Condition-congenital-anomaly-of-newborn.html\">http://build.fhir.org/ig/HL7/fhir-bfdr/branches/master/StructureDefinition-Condition-congenital-anomaly-of-newborn.html</a><br>\nIt's set up so that it is possible to record the Karyotype evaluation/determination for either \"Down Syndrome\" or \"Suspected chromosomal disorder\" using Condition.evidence. </p>\n<p>The problem with this is that there are two different value sets (Karyotype Down Syndrome (NCHS) and Karyotype Suspected Chromosomal Disorder (NCHS)). BUT, both value sets have the exact same two values contained in them.</p>\n<p>This means that slicing on Condition.evidence doesn't work because it's impossible to differentiate between a slice for Down Syndrome Karyotype evidence and a slice for Chromosomal Disorder Karyotype evidence.</p>\n<p>I wondering if anybody has any insight into how this would actually be stored in an EHR.</p>\n<p>The items on the BC we are trying to model are:<br>\n<a href=\"/user_uploads/10155/JFLwICnWjLZ6evfPHOF80hBa/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/JFLwICnWjLZ6evfPHOF80hBa/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/JFLwICnWjLZ6evfPHOF80hBa/image.png\"></a></div><p>Also, the SNOMED code being used for \"Karyotype confirmed\" (442124003 |Karyotype evaluation abnormal (finding)|) seems ok, but \"Karyotype pending\" (312948004 |Karyotype determination (procedure)) doesn't seem correct.</p>\n<p>Codes aside, I'm wondering if it wouldn't be better to model Down Syndrome Karyotype Status and Suspected Chromosomal Disorder Karyotype Status as separate Observation profiles (there are LOINC codes for both concepts). These could be referenced through Condition.evidence.detail (allows referencing any resource).</p>\n<p>There is also the Condition.verificationStatus, but unfortunately it has a required value set with values: \"unconfirmed | provisional | differential | confirmed | refuted | entered-in-error\".</p>\n<p>Thoughts?</p>",
        "id": 209678210,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1599757593
    },
    {
        "content": "<p>Or should the Karyotype be a Procedure with a status of in-progress or completed and then using .reasonReference to point back to a Condition of either Downs Syndrome or Chromosomal Disorder and a status of provisional or unconfirmed until the Karyotype sheds some light?</p>",
        "id": 209680064,
        "sender_full_name": "Craig Newman",
        "timestamp": 1599758524
    },
    {
        "content": "<p>That might work, but you'd also have to have a result woudln't you? Because the procedure could be completed and come back normal?</p>",
        "id": 209680600,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1599758796
    },
    {
        "content": "<p>Depends if you want the karyotype result or just a confirmation of the Condition as part of the report Procedure.outcome or .report also exist if you need a result associated with the procedure</p>",
        "id": 209680827,
        "sender_full_name": "Craig Newman",
        "timestamp": 1599758929
    },
    {
        "content": "<p>I think just the confirmation. The are only after \"Karyotype confirmed\" and \"Karyotype pending\".</p>",
        "id": 209681113,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1599759065
    },
    {
        "content": "<p>Seems like that would work if the Condition included the suspected diagnosis (Downs Syndrome or something else)</p>",
        "id": 209681292,
        "sender_full_name": "Craig Newman",
        "timestamp": 1599759132
    },
    {
        "content": "<p>Yes - thanks! Exactly the kind of feedback I was looking for... :)</p>",
        "id": 209681564,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1599759266
    }
]