[
    {
        "content": "<p>Did you know that you can use Touchstone during the Connectathon for FREE?! Log in at <a href=\"http://Touchstone.com\">Touchstone.com</a> and set up a free account to start building to thousands of available FHIR Test Scripts!</p>",
        "id": 197298021,
        "sender_full_name": "Sandy Vance",
        "timestamp": 1589299098
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191370\">@Richard Ettema</span> Just successfully executed all the C24 Terminology Services tests on Touchstone!</p>",
        "id": 197348166,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1589322399
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span>  Excellent!  Have you had a chance to think about any new terminology tests?</p>",
        "id": 197351632,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1589324808
    },
    {
        "content": "<p>Time to think but, unfortunately, not too act. Just too busy developing COVID-19 related Value Sets - will be presenting some of them at the Connectathon. Once mature, we might be able to create Test Scripts around them. Most implement beta test SNOMED CT intensional (query-based) reference sets using SNOMED Expression Constraint Language (ECL), so would be great additions to the Touchstone Collection.</p>",
        "id": 197351877,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1589325022
    },
    {
        "content": "<p>Understood.  Let me know when you get further along and ready for some initial testing.  Looking forward to \"seeing\" you at the Connectathon.</p>",
        "id": 197352193,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1589325335
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191370\">@Richard Ettema</span>  If we come up with new tests during the Connectathon that we would like to have, how quickly would we likely be able to get them added (and are you still the single conduit for doing that)?</p>",
        "id": 197455589,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1589394343
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194116\">@Carie Hammond</span> and <span class=\"user-mention\" data-user-id=\"237342\">@ryan moehrke</span> (both with AEGIS) are also supporting test and TestScript development for Touchstone. They are primarily supporting the Da Vinci tracks so, I would likely still be your primary contact for this Connectathon.</p>",
        "id": 197456624,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1589394848
    },
    {
        "content": "<p>The sooner you can get any new test definitions to me the better. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 197456832,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1589394945
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> does \"successfully executed\" mean your server passed them all, or that you've validated that the tests themselves are correct?  FWIW we found that terminology-c24-expand-json failed because Ontoserver actually returns a result, but it was too large for Touchstone to accommodate :-)</p>",
        "id": 208044253,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1598405394
    },
    {
        "content": "<p>Thinking about this, it would be nice if the Touchstone UI had a feature that allowed reporting possible test errors directly from the result.</p>",
        "id": 208044315,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1598405445
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>  - I should have stated that my Server passed all the tests executed.  I'm assuming that the test that Ontoserver failed was \"Simple $expand operation test for ValueSet intensional-case-3. Server expected to return error for expansion too big, but may return expansion if expansion is supported.\" </p>\n<p>For that test, My Server returns the following...<br>\n{\"resourceType\":\"OperationOutcome\",\"text\":{\"status\":\"generated\",\"div\":\"&lt;div xmlns=\\\"http://www.w3.org/1999/xhtml\\\"&gt;\\r\\n  &lt;p&gt;Cannot return a ValueSet with over 9,999 values - please use a filter or search criteria to restrict this number.&lt;/p&gt;\\r\\n&lt;/div&gt;\"},\"issue\":[{\"severity\":\"error\",\"code\":\"too-costly\",\"diagnostics\":\"Cannot return a ValueSet with over 9,999 values - please use a filter or search criteria to restrict this number.\"}]}</p>",
        "id": 208050689,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1598414074
    },
    {
        "content": "<p>Yep.  Ours did return an expansion but it was enormous.</p>",
        "id": 208073851,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1598437079
    },
    {
        "content": "<p>Our default limit for expansions is 50k, but some of our servers have been configured for more</p>",
        "id": 208159621,
        "sender_full_name": "Jim Steel",
        "timestamp": 1598482516
    }
]