[
    {
        "content": "<p>The Touchstone Team is currently reviewing priority for HL7 FHIR Connectathon 16 in San Diego; we are planning to introduce formal testing to the Terminology Track (similar to the Patient Track), we will be working to update any existing test scripts from Connectahton 14/15 which had any Track Lead feedback.  We are looking to explore advanced testing with Patch, Provider Directory and a new Referral effort.</p>",
        "id": 153894379,
        "sender_full_name": "Mario Hyland",
        "timestamp": 1497886355
    },
    {
        "content": "<p>The HL7 FHIR Connectathon 16 test definition group 'FHIR3-0-1-Connectathon16' has been deployed in Touchstone.  The following test tracks are available: FHIR Genomics, GraphQL, LastN-Query, PATCH, Patient, Provider Directories, Scheduling and Terminology.  We welcome all feedback, comments, and suggestions - on this chat or at <a href=\"mailto:Touchstone_Support@aegis.net\" title=\"mailto:Touchstone_Support@aegis.net\">Touchstone_Support@aegis.net</a>.  -Thank you</p>",
        "id": 153901161,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1502287323
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191370\">@Richard Ettema</span> as you'll see from your logs, I've performed all the Terminology Tests in the Connectathon 16 group - managed to pass them all, plus the Capability Statement. Please advise the best format to provide you with suggestions for adding terminology-related Test Scripts. Maybe the Request URLs and expected responses in XML and/or JSON and you can craft the scripts around them. Definitely need more tests for the $lookup and $subsumes operations on Code System and also for $translate on Concept Map; for the later, we may need to use some more test ConceptMap resources from the spec or other sources.  Any other suggestions here, <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>?</p>",
        "id": 153902265,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1502597453
    },
    {
        "content": "<p>can we make the master location in the build at /tests/resources?</p>",
        "id": 153902266,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502604351
    },
    {
        "content": "<p>FYI - Touchstone now has support for GraphQL testing with some initial TestScripts deployed for Connectathon 16.<br>\n<a href=\"/user_uploads/10155/bivo2oVTk0K9KXZYitwact_k/Touchstone_GraphQL.jpg\" target=\"_blank\" title=\"Touchstone_GraphQL.jpg\">Touchstone_GraphQL.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/bivo2oVTk0K9KXZYitwact_k/Touchstone_GraphQL.jpg\" target=\"_blank\" title=\"Touchstone_GraphQL.jpg\"><img src=\"/user_uploads/10155/bivo2oVTk0K9KXZYitwact_k/Touchstone_GraphQL.jpg\"></a></div>",
        "id": 153903412,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1503497451
    }
]