[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191370\">@Richard Ettema</span>  thank you for adding the Terminology Tests to the Connectathon 27 Suite. Although we don't have a full, dedicated Terminology Services Track this time, I've still managed to run all the tests, successfully, on my Server.</p>",
        "id": 239217742,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1621327101
    },
    {
        "content": "<p>Hi all, just wanted to ask- are there any existing tests in Touchstone that do not depend on $everything?</p>",
        "id": 240978298,
        "sender_full_name": "Chetana Suresh",
        "timestamp": 1622569478
    },
    {
        "content": "<p>That are accessible via DaVinci, that is</p>",
        "id": 240979400,
        "sender_full_name": "Chetana Suresh",
        "timestamp": 1622569997
    },
    {
        "content": "<p>Hi Chetana - what kinds of DaVinci tests are you looking for -for which IGs? We have many for their various IGs.</p>",
        "id": 240979990,
        "sender_full_name": "Carie Hammond",
        "timestamp": 1622570263
    },
    {
        "content": "<p>We're starting with mainly the PDex resources, but also want to run tests against Provider Directory too</p>",
        "id": 240981214,
        "sender_full_name": "Chetana Suresh",
        "timestamp": 1622570784
    },
    {
        "content": "<p>The basic issue is, in the event that $everything cannot be available till much closer to the go-live, you would need a way to test the resources without that implemented. Currently OAuth is a barrier as well to some of the existing tests that would give this go-around</p>",
        "id": 240981813,
        "sender_full_name": "Chetana Suresh",
        "timestamp": 1622571050
    },
    {
        "content": "<p>Chetana - yes, you will find PDEX and Provider Directory tests here:  <a href=\"https://touchstone.aegis.net/touchstone/testdefinitions?selectedTestGrp=/FHIRSandbox/DaVinci/FHIR4-0-1-Test/PDEX&amp;activeOnly=true&amp;contentEntry=TEST_SCRIPTS\">https://touchstone.aegis.net/touchstone/testdefinitions?selectedTestGrp=/FHIRSandbox/DaVinci/FHIR4-0-1-Test/PDEX&amp;activeOnly=true&amp;contentEntry=TEST_SCRIPTS</a>.  None of those scripts relies on the patient everything operation and are built to exercise their relevant Implementation Guides.   These scripts also do NOT require a secure system.  We do have some scripts that can help you test a secure server, but those are clearly labeled (as SMART or SECURE).   Most of our tests are agnostic to the security on the server under test.   However, if your server IS secured, that is something you can set up in our Test System setup and information on how to set up your system for testing in Touchstone is found here: <a href=\"https://touchstone.aegis.net/touchstone/userguide/html/test-systems/creating.html\">https://touchstone.aegis.net/touchstone/userguide/html/test-systems/creating.html</a>.  We also have some links and short videos available on the DaVinci Implementer Support Page: <a href=\"https://confluence.hl7.org/display/DVP/Da+Vinci+Implementer+Support\">https://confluence.hl7.org/display/DVP/Da+Vinci+Implementer+Support</a>  (look under the Developer Toolbox area).  Hope that helps.</p>",
        "id": 241071051,
        "sender_full_name": "Carie Hammond",
        "timestamp": 1622579446
    }
]