[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191370\">@Richard Ettema</span>.  Should I leave my server at FHIR Version 3.0.0.0 for the Madrid Connectathon, or would Touchstone handle an upgrade to FHIR Version 3.0.0.1?</p>",
        "id": 153886060,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1493176752
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> There should be little to no impact to your testing in Touchstone if you upgrade your server to FHIR v3.0.1.  Since FHIR v3.0.1 is now the official version I recommend you go ahead and perform the upgrade.  I'll be doing the same to Touchstone over the next few days; i.e. upgrading from v3.0.0 to v3.0.1 as well as updating all the TestScripts and fixtures as needed.  We should have all of this done and ready for Madrid next week.</p>",
        "id": 153886292,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1493302992
    },
    {
        "content": "<p>Peter, going forward Touchstone will plan to support test scripts for each published release.  So, when a FHIR software version such as R3 3.0.0 is publish, followed by 3.0.1 our test scripts are envisioned to have an instance supporting  each version.  Thereby allowing organizations to test both backwards-compatibility and to support future-proofing.  Now, we will NEVER recommend supporting cross-version exchange between different fhir versions.  But, some want to know the impact, so we recommend testing backwards-compatibility to see the results.</p>",
        "id": 153886456,
        "sender_full_name": "Mario Hyland",
        "timestamp": 1493482558
    },
    {
        "content": "<p>Peter, correction - R3 3.0.0 version has been unpublished for all-intents and purpose.  So, if a version of FHIR is administrativeely deemed no longer valid; Touchstone will ultimately deprecate the Test Cases and version support for FHIR R3 3.0.0, in favor of 3.0.1.  Sorry if I caused anyone confusion. </p>",
        "id": 153886509,
        "sender_full_name": "Mario Hyland",
        "timestamp": 1493609608
    },
    {
        "content": "<p>I think there's a bigger question here as to version compatibility.  The implication of a semantic version like 3.0.1 is that it should be compatible with 3.0.0?</p>",
        "id": 153888566,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1494295995
    }
]