[
    {
        "content": "<p>From <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> <br>\nI've been going through one of the Touchstone test scripts /FHIR1-6-0-Basic/P-R/Practitioner/Client Assigned Id/Practitioner-client-id-json, and it expects a 200 code(OK) code for a query for a _history; but the spec states that a 404(NotFound) should be sent if the server doesn't support versioning. <a href=\"https://www.hl7.org/fhir/http.html#versioning\" target=\"_blank\" title=\"https://www.hl7.org/fhir/http.html#versioning\">https://www.hl7.org/fhir/http.html#versioning</a></p>\n<p>I'm fine with implementing versioning over the long run; but it may be 6 or 12 months yet before we get it all in place. In the meantime, I'd like to get the test to have a Warning for a missing 200(OK) code instead of an Error.</p>",
        "id": 153879716,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1490358450
    },
    {
        "content": "<p>We (the Touchstone Team) are currently working on implementing conditional asserts to help refine the behavior of the test engine's processing of the TestScript.  In this particular case the assert would first check the test system's CapabilityStatement.rest.resource.versioning value for the particular resource type under test to determine the level of versioning support.  If the level indicates support; i.e. 'versioned' or 'versioned-update', then the check for 200(OK) would be executed.  If 'no-support' was found, then that assert would be skipped.</p>",
        "id": 153879718,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1490358962
    },
    {
        "content": "<p>I'll be working to implement this functionality on the FHIR 3.0.0 tests over the next couple of weeks.</p>",
        "id": 153879719,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1490359020
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191370\">@Richard Ettema</span> - Thanks for the response.  Having the test scripts check the CapabilityStatement would be brilliant.  We have a workaround for now; and what you're suggesting would be a perfect refactor path.  Thank you much!</p>",
        "id": 153880416,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1490898310
    }
]