[
    {
        "content": "<p>I'm passing a question on from a colleague..</p>\n<p>If a patient is admitted as a patient (ADT^A01^ADT_A01) and then undergoes a series of transfers (ADT^A02^ADT_A02) - is it possible to cancel (ADT^A12^ADT_A09) any of the previous transfers or just the latest one?</p>\n<p>Does the processing of a (ADT^A12^ADT_A09) re-establish the bed state (via PV1-3)?</p>\n<p>Hopefully, this makes sense...</p>",
        "id": 197269974,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1589287825
    },
    {
        "content": "<p>A12 (as a trigger event) only cancels the latest transfer. A12 itself lists the correct location in PV1.  As such if you were to send a single A12 to cancel multiple subsequent transfers it would probably still work, but AFAIK it's not the intent of an A12.</p>",
        "id": 197372517,
        "sender_full_name": "René Spronk",
        "timestamp": 1589350799
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> thanks for the info - after wading through the V2.4 spec then I see that now. That's good news as it makes it easier at our end.</p>",
        "id": 197375369,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1589353831
    },
    {
        "content": "<p>v2 is designed to communicate the newest information. Therefore, all events update the status quo of the patient.</p>",
        "id": 197378933,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1589356735
    },
    {
        "content": "<p>But we do have the same problem. There is a history flag, that indicates an update of old data. But one cannot assume a correct interpretation of events if this flag is ignored. Consequently, one can only update old data by using new events. IIHE ITI has done that within the PAM profile. This new event is called Z99. You will find usage of it in the German National Extension (Vol.4).</p>",
        "id": 197379154,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1589356887
    },
    {
        "content": "<p>(In Germany we have tried to make use of this flag on normal messages, but this is not safe and will certainly lead to modifying the latest data which is not the intend and falsifying the wrong data.)</p>",
        "id": 197379318,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1589356971
    }
]