[
    {
        "content": "<p>I assume that \"Sex assigned at birth\" is not in PID in an ADT, unlike Administrative Sex, but would be an OBX? Is that best practice? Are there any profiles or examples I can refer to? Or is there a \"standard\" for using a Z segment?</p>",
        "id": 230356716,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615819796
    },
    {
        "content": "<p>You are right about there not being a PID field for sex assigned at birth. The OO and Public Health WGs are actively talking about how to convey this data and other concepts (eg. Sexual Orientation and Gender Identity). An OBX segment seems to be the leading candidate. We have set up a Confluence page to gather the concepts and value sets associated (see <a href=\"https://confluence.hl7.org/display/OO/Sexual+Orientation%2C+Gender+Identity%2C+Administrative+Sex%2C+Birth+Sex+etc\">https://confluence.hl7.org/display/OO/Sexual+Orientation%2C+Gender+Identity%2C+Administrative+Sex%2C+Birth+Sex+etc</a>)</p>",
        "id": 230358768,
        "sender_full_name": "Craig Newman",
        "timestamp": 1615820433
    },
    {
        "content": "<p>As well, on Friday this week, the second half of the OO WG's lab/LIVID call will be dedicated to discussion of this issue. All are welcome to attend. This is also an issue that the Gender Harmony group is intending to take up (how to convey these sorts of concepts in all product families).</p>",
        "id": 230358994,
        "sender_full_name": "Craig Newman",
        "timestamp": 1615820490
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> that is good to know about</p>",
        "id": 230377478,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615825741
    },
    {
        "content": "<p>IMO, everything about sex/gender is an observation. PID admin gender is a room category and should be placed in PV1. So, we could deprecate the use of admin gender in PID which would solve the problems and misunderstandings. But I suppose that would break all interfaces, so that everyone will stand up and reject this proposal...</p>",
        "id": 230496486,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1615894372
    },
    {
        "content": "<p>FYI - we have a ton of discussion about this in the Gender Harmony project that Vocab has been running for the past year or so.  We just balloted a whitepaper style guide for sex and gender concepts.  We're starting to think about how those concepts map into HL7v2 and FHIR.</p>",
        "id": 231087901,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1616186944
    },
    {
        "content": "<p>However, I personally try to discourage the use of Sex assigned at birth.  There is almost no good reason to use that value - there are always better values.  If you want to know how to address the patient, use their gender identity.  If you need a value for clinical decision support, use a \"sex for clinical use\" value. SAAB is a poor option for this since it will often be wrong for transgender patients.  Same for lab reference ranges, health maintenance, modality configuration etc.  The only time SAAB might be useful for clinical purposes is when you are dealing with a newborn.  SAAB is also not the same as legal sex, or even the sex on the birth certificate, since some jurisdictions allow you to update the sex on your birth certificate, but that doesn't mean your SAAB will also change.  If you need a legal sex, just use a current legal sex, not SAAB.</p>",
        "id": 231088196,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1616187114
    },
    {
        "content": "<p>Since it is so vague and may change, is it a good idea to use it for identification?</p>",
        "id": 231275193,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1616401040
    },
    {
        "content": "<p>As long as the 'adminstrative gender' matches what's on a government issued ID: yes. Obviously there are better data elements for patient matching.</p>",
        "id": 231275541,
        "sender_full_name": "René Spronk",
        "timestamp": 1616401288
    },
    {
        "content": "<p>What do you mean with 'matches'? Currently everyone has a different belief of what administrative gender means. So it is about guessing? And as long as we are not going to formally describe what it is or should be, this will be a never ending discussion...</p>",
        "id": 231286972,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1616408100
    },
    {
        "content": "<p>Despite the fact that SAAB is included in the ISA, I really think that the better sex/gender concepts to use are:</p>\n<ul>\n<li>Gender Identity</li>\n<li>Sex for Clinical Use (a proxy value for current physiological properties)</li>\n<li>Recorded sex (for things like Legal Sex)</li>\n</ul>\n<p>Note that a patient can have multiple legal sexes on different documents in different jurisdictions.</p>\n<p>Admin Gender and SAAB don't really have a place, mostly because they don't have a good definition or use case.</p>",
        "id": 231319896,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1616423686
    },
    {
        "content": "<p>Exactly. And that is the reason why I would like to handle that information as observations only...</p>",
        "id": 231324225,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1616425204
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191764\">Cooper Thompson</span> <a href=\"#narrow/stream/229447-V2/topic/Birth.20Sex/near/231319896\">said</a>:</p>\n<blockquote>\n<ul>\n<li>Sex for Clinical Use (a proxy value for current physiological properties)</li>\n</ul>\n</blockquote>\n<p>I have to think that different clinical uses also have different requirements.</p>",
        "id": 231570908,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1616550628
    }
]