[
    {
        "content": "<p>I am trying to understand where an EKG strip/image is put in a v2 message.  From what I have read, the EKG results go in an ORU message, example in IG.  A jpg or pdf could go as encoded data in an OBX-5 in an ORU.  So curious, do I have the right location?  Is anyone actually doing this?  ThanQ in advance</p>",
        "id": 221677527,
        "sender_full_name": "Linda",
        "timestamp": 1609868625
    },
    {
        "content": "<p>I'm not sure I've seen an EKG strip done but sending as encoded data in OBX-5 sounds right and is consistent with what I've seen for other types of content like that.</p>",
        "id": 221681467,
        "sender_full_name": "Craig Newman",
        "timestamp": 1609870467
    },
    {
        "content": "<p>If you treat it as a document you can also use MDM messages.</p>",
        "id": 221737243,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1609913585
    },
    {
        "content": "<p>It probably depends some on how you want it treated in the receiving system. Is more like a results or a dictated or scanned document. How a receiving system processes (and ultimately displays) an ORU is potentially quite different than how it displays an MDM</p>",
        "id": 221764679,
        "sender_full_name": "Craig Newman",
        "timestamp": 1609938556
    },
    {
        "content": "<p>Both is encapsulated data, so that the appropriate viewer is needed. But agreed, the mngmt process is different</p>",
        "id": 221782663,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1609948056
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>   Are your familiar with EKG Strips going in V2 messages perhaps as pdfs?</p>",
        "id": 222005419,
        "sender_full_name": "Linda",
        "timestamp": 1610055824
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> Have you seen EKG images  in v2 messages</p>",
        "id": 222005769,
        "sender_full_name": "Linda",
        "timestamp": 1610055990
    },
    {
        "content": "<p>Transporting documents of all types is done with MDM. OBX is either referencing that file by location and name, or included into the message. The letter requires an appropriate encoding as hex or base64.<br>\nHere it does not matter whether it is a small discharge letter, a huge DICOM jpeg2000 file, or an EKG image, the logic is always the same. You can use all file formats. In the end it depends on the viewer.</p>",
        "id": 222045250,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1610091836
    }
]