[
    {
        "content": "<p>Is there a recommended field anywhere in HL7 V2 for the CMS <a href=\"https://www.cms.gov/Medicare/Coding/place-of-service-codes/Place_of_Service_Code_Set\">1500 24b</a> place of service code? We primarily need to distinguish between office \"11\" codes and inpatient hospital \"21\" codes for calculating certain care quality measures. The PV1-2 (patient class) field sort of fits, however I am hesitant to use it because the recommended values in User-defined Table 0004 don't align with the CMS value set. I understand some organizations are also using PV1-10 (hospital service) but that doesn't seem right either. Has anyone ever written a US realm implementation guide covering this topic?</p>",
        "id": 225339101,
        "sender_full_name": "Nick Radov",
        "timestamp": 1612550502
    },
    {
        "content": "<p>I can't speak to the right place, but I'm pretty sure there is no v2 IG that covers this.</p>",
        "id": 225565111,
        "sender_full_name": "Craig Newman",
        "timestamp": 1612800140
    },
    {
        "content": "<p>FT1-37 seems to reference place of service.</p>",
        "id": 225583168,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1612807241
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/229447-V2/topic/Field.20for.20CMS.201500.20place.20of.20service/near/225583168\">said</a>:</p>\n<blockquote>\n<p>FT1-37 seems to reference place of service.</p>\n</blockquote>\n<p>Thanks for the suggestion. I agree that would probably be a better fit than PV1-2 or PV1-10, however unfortunately the FT1 segment isn't included in any ADT message structures and for this use case we need to handle ADTs. It's probably not worth submitting a change proposal to add the FT1 segment to those message structures at this point.</p>",
        "id": 225594116,
        "sender_full_name": "Nick Radov",
        "timestamp": 1612812083
    },
    {
        "content": "<p>I wonder if PV1-3 could be used, even though it is more for identifiers of locations, and not codes. It is not only for inpatient locations, and it references clinic as a valid use. FT1-37 also reference clinics as a place of service...</p>",
        "id": 225598225,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1612813993
    },
    {
        "content": "<p>Expanding PV1-3 seems to make sense.</p>",
        "id": 274412406,
        "sender_full_name": "Amit Popat",
        "timestamp": 1646668946
    },
    {
        "content": "<p>Not sure about the background details here. Just want to mention that user-defined tables can be adjusted to local needs. So if someone believes to use other codes than listed in the standard then this is fine.<br>\nAlthough I highly appreciate that this question is raised here.</p>",
        "id": 274648508,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1646807601
    }
]