[
    {
        "content": "<p>Hello Everyone,<br>\n    I am trying to integrate with Hl7 V2 interface and facing an issue with user defined tables of HL7 V2 so can we read HL7 V2 User defined tables like 0114 Diet Type <a href=\"https://hl7-definition.caristix.com/v2/HL7v2.6/Tables/0114\">https://hl7-definition.caristix.com/v2/HL7v2.6/Tables/0114</a> so as a third party  system integrating with HL7 V2 is it possible to get this type of table values ?</p>",
        "id": 275484999,
        "sender_full_name": "Aditya Tawar",
        "timestamp": 1647422838
    },
    {
        "content": "<p>FYI cross posting from <a href=\"#narrow/stream/179166-implementers/topic/HL7.20DFT.3A.20Integration.20of.20order.20placer.20and.20charge.20processor\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/HL7.20DFT.3A.20Integration.20of.20order.20placer.20and.20charge.20processor</a></p>\n<p>I need help please about how Order Placer, Order Filler and Charge Processor interact when handling a set of orders that are associated with a fixed price package.</p>\n<p>For example placing an Order Set associated with a package described at <a href=\"https://www.healthtestingcenters.com/discount-test-panels/\">https://www.healthtestingcenters.com/discount-test-panels/</a></p>\n<p>The Placer sends the individual orders to the diagnostic Filler interfaces and the Filler then sends charges to the Charge Processor.</p>\n<p>What is the normal way that a Placer communicates a package has been selected and not individual orders. The Filler and Charge Processor are built by 3rd party software vendors.</p>\n<p>Some ideas are:</p>\n<p>1) An orderable is created for the package, and a parent order is sent to the Charge Processor with child orders representing the diagnostic orders. This way the Charge Processor is able to resolve the Charges coming from the Fillers to the parent order charge</p>\n<p>2) Placer sends a DFT message to the Charge Processor directly which refers to the diagnostic placer order ids.</p>",
        "id": 278255307,
        "sender_full_name": "Jim",
        "timestamp": 1649391274
    },
    {
        "content": "<p>If the placer is sending to the filler via a v2 order message, then ORC-4 can be used to send a Placer Order Group Number that could be shared between all of the orders.<br>\nDefinition:  This field contains a unique identifier for an Order Group as referenced by the Placer application. An Order Group is a set of orders grouped together by the placer application.</p>\n<p>Of course, this requires some understanding on the part of the filler and charge processor systems that a group number means the separate orders were placed together. You'd also need to be sure that any other orders placed at the same time but which aren't part of the package don't use the same group number.</p>\n<p>I've also heard (not sure if I've ever seen it happen) that a panel order can be placed and sent to the filler which then explodes it into the individual orders. This may give you issues when resulting the orders as the original panel order may not ever be resulted (but rather the placer system will get \"unsolicited\" results for each of the actual tests. The filler then also has to remember to bill the panel and not the individual tests. </p>\n<p>Overall, it feels like the hard work is on the filler application. You'll need to know what capabilities that system has.</p>",
        "id": 278295101,
        "sender_full_name": "Craig Newman",
        "timestamp": 1649420071
    }
]