[
    {
        "content": "<p>Anyone has experience implementing Laboratory order Interface( LOI) and Laboratory Result Interface (LRI) V2.5.1, what are the barriers and lessons learned or best practices in implementing LOI &amp; LRI V2.5.1?</p>",
        "id": 272820829,
        "sender_full_name": "Sameemuddin Syed",
        "timestamp": 1645544608
    },
    {
        "content": "<p>You might want to post something on the Orders and Observations WG stream pointing them to this thread (don't ask the same question twice, just point them here). I'm not sure LOI has much real world implementation experience behind it. I think the biggest barrier is that there's not enough incentive to implement it. It's a good standard, but in general, people are reluctant to remake integrations that are working well and when a new integration comes along, it's easier to replicate what's been done in the past with ORMs than it is to get vendors to support LOI and the new OML message type. <br>\nLRI is very different as it has been implemented. My personal experience (which is a little dated) was that there are still different ways to interpret how to send results (at least if you are using the earlier version of LRI which is in the US based regulations. Some of the ambiguities may have been resolved in newer versions. SubIDs in OBX-4 were a problem in the early LRI implementations, pay attention to them. Discrete microbiology results still take a lot of time and attention (they're just plain complicated). People don't seem to like OIDs (and to me personally, I'm not sure how much they add to a standard lab-to-EHR integration) - they definitely make the message harder to read and troubleshoot.<br>\nOverall they are both really good specs but I don't think things are quite plug-and-play yet.<br>\n<span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span> <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span>  anything to add?</p>",
        "id": 272946680,
        "sender_full_name": "Craig Newman",
        "timestamp": 1645622312
    },
    {
        "content": "<p>For what it's worth, I'm working on developing a handful of video tutorials about the LOI and LRI IGs to explain how read the IGs, what's common between them and some of what's unique to each of them. If you or someone else needs to learn more about the specs, I'm happy to share the links once they are available</p>",
        "id": 272946902,
        "sender_full_name": "Craig Newman",
        "timestamp": 1645622431
    },
    {
        "content": "<p>We have implemented LOI and LRI as part of a PHL lab webportal pilot - using the NG profile (so no OIDs). I also know that a few PHLs have implemented the NDBS profile.</p>",
        "id": 272950904,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1645624364
    },
    {
        "content": "<p>In general I garee with Craig - many places that have existing interfaces are reluctant to go to something new. What I think is good about these specs is that we worked on making sure they cover all CLIA components and that they have profile components, so you can put them together as you need them; not every system needs every profile, but when you are supporting a specific use case, then you have guidance on how to do it. O&amp;O has been updating both LOI and LRI to adjust to new needs and we will have newer versions published by the May WGM.</p>",
        "id": 272951217,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1645624532
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span> - do you know if the NDBS PHLs have actual live interfaces? If so, do you know what EHRs those are with? I'm not sure who supports the OML message</p>",
        "id": 272951486,
        "sender_full_name": "Craig Newman",
        "timestamp": 1645624668
    },
    {
        "content": "<p>Epic <a href=\"https://open.epic.com/Ancillary/Results\">indicates</a> they implement LRI in their outbound interface.  However, not sure who/how many have implemented. <span class=\"user-mention\" data-user-id=\"195835\">@Kathy Walsh</span>  or <span class=\"user-mention\" data-user-id=\"194495\">@F. Hall</span>  Are you sending/receiving LOI or LRI messages?  Concur with Craig and Riki.  Labs are often on shoestring budgets and if existing interfaces meet their needs, may not upgrade to newer standards like LOI and LRI.  (Most labs except hospital labs, were ineligible for MU incentives and thus no requirements for standards adoption other than ELR by law.) It's great to see folks voluntarily adopting.  Also not sure how many EHR/LIS/PH vendors support.  From a business perspective it's a cost and folks may not wish to expend $ to develop.  They are better from an interoperability perspective supporting increased data needs.</p>",
        "id": 273089488,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1645709842
    },
    {
        "content": "<p>We supported LRI as part of certification program, but not much uptake.   LOI really has not received traction beyond the guidance to communicate data to the Lab for COVID test that could be bolted back into older v2 order message versions (including highly tailored, local interpretations).</p>",
        "id": 273298769,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1645831494
    }
]