[
    {
        "content": "<p>In our v2 training courses, we use a v2 editor/validator for our exercises. <br>\nWe tend to use 7Edit on Windows (we're also considering HL7Soup), what would you recommend we use for Mac ? HL7 Inspector works, but the GUI is not that nice, HL7 Testpanel (HAPI) uses a Java version that's too old for the Mac. Any alternatives for the Mac ? (yes, a virtual machine with 7Edit works, but we'd like to use a native tool, also for Linux)</p>",
        "id": 213050288,
        "sender_full_name": "René Spronk",
        "timestamp": 1602515211
    },
    {
        "content": "<p>By v2 editor, do you mean message editor or profile editor?</p>",
        "id": 213059892,
        "sender_full_name": "Rob Snelick",
        "timestamp": 1602520176
    },
    {
        "content": "<p>message editor. If its also a profile editor, then that's a bonus, but primarily we use a \"v2 message instance editor &amp; validator\"</p>",
        "id": 213065767,
        "sender_full_name": "René Spronk",
        "timestamp": 1602523702
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194455\">@Rob Snelick</span> Has <a href=\"http://HL7.org\">HL7.org</a> now 'officially' embraced the NIST v2 profiling tools instead of MWB ?</p>",
        "id": 213143445,
        "sender_full_name": "René Spronk",
        "timestamp": 1602590498
    },
    {
        "content": "<p>There is a project (PSS) that is still in progress to do so. The goal is have v2 IGs use the tool for balloting; this ensures certain quality and conformance measures built in (computable requirements). This does not preclude other tools that meet HL7 v2 conformance methods.</p>",
        "id": 213151069,
        "sender_full_name": "Rob Snelick",
        "timestamp": 1602594567
    },
    {
        "content": "<p>The NIST v2 tools (<a href=\"https://hl7v2tools.nist.gov\">https://hl7v2tools.nist.gov</a>) has tools for profiling (creating IGs containing one or more message profile--both the narrative and structure), creating test cases (including the ability to create and edit messages) and message validation. Once a profile is built using the platform, a validation tool is automatically built. The tool set is publicly available via web apps (browsers) so they are OS independent. The validation tools are used in the US for meaningful use certification and other testing programs. The tools follow the profiling methods described in the recently published v2 conformance methodology--this specification removed the conformance chapter from the based v2 standard, it is now a standalone specification and applies to all versions of v2.</p>",
        "id": 213152841,
        "sender_full_name": "Rob Snelick",
        "timestamp": 1602595386
    },
    {
        "content": "<p>See <a href=\"https://vimeo.com/467764562\">https://vimeo.com/467764562</a>, a small e-learning video which is part of our HL7 v2 training course. Validators and editor/validators are used by most v2 implementers, IMHO v2 profiling tools are only of use to a small portion of implementers.</p>",
        "id": 213163947,
        "sender_full_name": "René Spronk",
        "timestamp": 1602599743
    },
    {
        "content": "<p>Hey :)<br>\nI'm trying to validate HL7 using clinical Package Validator. I'm using VS code editor for to write the sample message. After saving the message text with .hl7 ext. I get an error: message contains a non-ASCII character<br>\nat position 259.</p>\n<p>my VScode encoding is UTF-8 default. what to do to put off this error?</p>",
        "id": 213394367,
        "sender_full_name": "Rinold S",
        "timestamp": 1602750938
    },
    {
        "content": "<p>It should deal with the editor. Any hl7 editor is available ?</p>",
        "id": 213396253,
        "sender_full_name": "Rinold S",
        "timestamp": 1602752068
    },
    {
        "content": "<p>I had to google: this is a Australian government validator, as far as I can see for HL7 CDA (and not for v2). You'd best ask the authors of that tool if you have any issues with it.</p>",
        "id": 213398294,
        "sender_full_name": "René Spronk",
        "timestamp": 1602753292
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  I sorted the issues by encoding the file to US-ASCII .</p>",
        "id": 213525851,
        "sender_full_name": "Rinold S",
        "timestamp": 1602832882
    },
    {
        "content": "<p>I downloaded 7Edit professional and used that editor to generate a new hl7 message in US-ASCII encode.<br>\nThe editor is bit slow.<br>\nCould anyone suggest any good hl7 editor please.</p>",
        "id": 213526034,
        "sender_full_name": "Rinold S",
        "timestamp": 1602833027
    },
    {
        "content": "<p>IMHO 7Edit is currently the best commercial offering. If you watch the video mentioned above you'll see the names of some of the other popular ones. Hl7 v2 is an old standard, so some of the v2 tools are no longer supported, which means the list of options (esp. open source solutions) is dwindling.</p>",
        "id": 213530137,
        "sender_full_name": "René Spronk",
        "timestamp": 1602835899
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> .</p>",
        "id": 213530482,
        "sender_full_name": "Rinold S",
        "timestamp": 1602836100
    }
]