[
    {
        "content": "<p>This section's doco is confusing ( suspect a typo ):</p>\n<p><a href=\"http://hl7.org/fhir/messaging.html#reliable\" target=\"_blank\" title=\"http://hl7.org/fhir/messaging.html#reliable\">http://hl7.org/fhir/messaging.html#reliable</a></p>\n<p>“Some of the message delivery mechanisms mentioned above are reliable delivery systems - the message is always delivered, or an appropriate error is returned to the source. However most implementations use methods which do not provide reliable messaging, and either the request or the response can get lost in transit. <strong>FHIR messaging describes</strong> a simple approach that receivers SHOULD conform to in order to handle the absence of reliable messaging that maintains predictable functionality.”</p>\n<p>Where is this described??? ( I think is a type and should say…)</p>\n<p>“... The <strong>following simple</strong> approach that receivers SHOULD conform to in order to handle the absence of reliable messaging that maintains predictable functionality.”</p>\n<p>Also...</p>\n<p>If there is a Bundle.identifier and, if added in the future as discussed <a href=\"#narrow/stream/211987-methodology/topic/Resources.20and.20Identifiers\" title=\"#narrow/stream/211987-methodology/topic/Resources.20and.20Identifiers\">here</a> MH.identifier, do they change in a similar fashion and which one trumps the other if they do not?<br>\nhow</p>",
        "id": 185456912,
        "sender_full_name": "Eric Haas",
        "timestamp": 1578875170
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  ?</p>",
        "id": 185456968,
        "sender_full_name": "Eric Haas",
        "timestamp": 1578875325
    },
    {
        "content": "<p>Agree with the change to \"following simple\".  Change request?</p>\n<p>As for the second, <strong>ugh</strong>.  This is why I think it's a bad idea to add stuff for modeling purity when from a requirements perspective, we've decided that something isn't desirable.  We specifically <em>yanked</em> MessageHeader.identifier because it caused problems once Bundle.identifier got added.<br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> thoughts?</p>",
        "id": 185460000,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578881121
    },
    {
        "content": "<p>I don't know. Purity is in the eye of the beholder</p>",
        "id": 185460883,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1578882950
    },
    {
        "content": "<p>Right - but you'd proposed adding identifier everywhere.  This would be one of the places where doing that would have an unpleasant cost.</p>",
        "id": 185462090,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578885438
    },
    {
        "content": "<p>Well right now there is Bundle.identifier and the spec gos on to say....</p>\n<div class=\"codehilite\"><pre><span></span>If the sender of the message implements reliable messaging, it SHALL do the following when it receives no response to a message within a configured timeout period based on the value specified in the CapabilityStatement messaging.event.category for the event associated with the message:\n\nConsequence Resend the same message (with the same MessageHeader.id) with the same Bundle.id\nCurrency    Resend the same message (with the same MessageHeader.id) with a different Bundle.id\nNotification    Resend the same message (with the same MessageHeader.id) with a different Bundle.id\n</pre></div>",
        "id": 185462378,
        "sender_full_name": "Eric Haas",
        "timestamp": 1578886041
    },
    {
        "content": "<p>it raises a question about whether the message header exists independently of the message</p>",
        "id": 185462381,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1578886061
    },
    {
        "content": "<p>so what about Bundle.identifier if present.  I assume that should be the same and then what if <a href=\"http://Bundle.id\" target=\"_blank\" title=\"http://Bundle.id\">Bundle.id</a> is different?</p>\n<p>Re </p>\n<blockquote>\n<p>it raises a question about whether the message header exists independently of the message</p>\n</blockquote>\n<p>in the MH scope section:</p>\n<div class=\"codehilite\"><pre><span></span>The principal usage of the MessageHeader resource is when messages are exchanged. However,\nas a resource that can be used with the RESTful framework, the MessageHeader resource\nhas the normal resource end-point ([base-url]/MessageHeader),\nwhich is used to manage a set of static messages resources.\nThis could be used to make an archive of past messages available.\n</pre></div>",
        "id": 185462500,
        "sender_full_name": "Eric Haas",
        "timestamp": 1578886228
    },
    {
        "content": "<p>which suggests it can be....</p>",
        "id": 185462523,
        "sender_full_name": "Eric Haas",
        "timestamp": 1578886291
    },
    {
        "content": "<p>FYI I'm spit-balling overloading MH for subscriptions <strong>as a straw man</strong> as we try to tease out  using Messaging for unsolicited notifications and Subscription Notifications proposal for a bundle type with some header like resource and Subscription messaging channel....</p>",
        "id": 185462700,
        "sender_full_name": "Eric Haas",
        "timestamp": 1578886664
    },
    {
        "content": "<p>but for the present the above guidance certainly suggests that the id should be profiled as min =1 for Bundles  and MH for messaging use cases</p>",
        "id": 185462757,
        "sender_full_name": "Eric Haas",
        "timestamp": 1578886776
    },
    {
        "content": "<p>I will submit the tracker for the agreed on change above.</p>",
        "id": 185462825,
        "sender_full_name": "Eric Haas",
        "timestamp": 1578886877
    }
]