[
    {
        "content": "<p>I'm looking at a prescription tracking system and we are using FHIR Messaging for exhchanging orders and dispense notifications. We have three core message types:</p>",
        "id": 242875632,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1623848126
    },
    {
        "content": "<ul>\n<li>prescription-order (consequence)</li>\n<li>dispense-notification (notification)</li>\n<li>dispense-claim (consequence)</li>\n</ul>\n<p>Question is: it is intended some of the messages e.g. <strong>prescription-order</strong> are also going to be used as an event notification. <br>\nI'm wondering if I need a new version of this message e.g. <strong>prescription-notification</strong> or should somehow mark the original order as being a notification.</p>\n<p>It is a probably a new message type anyway (as the Provence resource can be dropped).</p>",
        "id": 242876004,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1623848327
    },
    {
        "content": "<p>The event says \"what is the receiver supposed to do\".  You can't use the same event to say \"please fill\" and \"for your information\"</p>",
        "id": 243816620,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624554521
    },
    {
        "content": "<p>thanks was wondering if that was the solution. </p>\n<p>I presume if the structure is the same, I can use base to indicate base MessageDefinition (and just change the eventCoding and category). Inheritence works like profiles?</p>",
        "id": 243818233,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1624555243
    },
    {
        "content": "<p>I would think it would be a completely distinct MessageDefinition.  The responses would probably be different.  The documentation would be different.  basedOn is more for \"My system defines this message interface which is derived from such-and-such a standard message definition, but I constrain a few things or have additional documentation about how mine works\".  I would expect the event to be the same for all derived message definitions.  That said, MessageDefinition is rather under-documented, so feel free to submit a change request asking for clarification.</p>",
        "id": 243819587,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624555896
    }
]