[
    {
        "content": "<p>Welcome to <a class=\"stream\" data-stream-id=\"112\" href=\"/#narrow/stream/fhir-messages\">#fhir-messages</a>.</p>\n<p><strong>Description</strong>: <a href=\"http://build.fhir.org/messaging.html\" target=\"_blank\" title=\"http://build.fhir.org/messaging.html\">http://build.fhir.org/messaging.html</a></p>",
        "id": 153950372,
        "sender_full_name": "Welcome Bot",
        "timestamp": 1522796671
    },
    {
        "content": "<p>I'll see if anybody finds this channel <span class=\"user-mention\" data-user-id=\"193933\">@Benjamin Flessner</span></p>",
        "id": 153950375,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1522796724
    },
    {
        "content": "<p>If anybody is interested in testing messaging with Redox, react to this post, respond, or e-mail me.</p>",
        "id": 153951876,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1523461350
    },
    {
        "content": "<p>Not knowing Redox: where's the spec / the profile of those messages ?</p>",
        "id": 153952000,
        "sender_full_name": "René Spronk",
        "timestamp": 1523510510
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> agreed - probably 95% of healthcare data moves via messages. Glad other people are interested in this too. I'll watch your talk this afternoon. </p>\n<p>We started out creating our own models - informed by HL7v2, FHIR, and various vendor-specific APIs. <a href=\"https://developer.redoxengine.com/data-models/\" target=\"_blank\" title=\"https://developer.redoxengine.com/data-models/\">https://developer.redoxengine.com/data-models/</a></p>\n<p>Now we're looking to convert some of those to FHIR gradually - part of the reason I wanted to create this channel was to figure out how to profile some of these things. </p>\n<p>For example, <a href=\"http://build.fhir.org/messageheader.html\" target=\"_blank\" title=\"http://build.fhir.org/messageheader.html\">MessageHeader</a> and <a href=\"http://build.fhir.org/composition.html\" target=\"_blank\" title=\"http://build.fhir.org/composition.html\">Composition</a> both say that the first entry in the bundle should be the respective resource. </p>\n<p>I'm curious if you're seen anyone attempt to profile Bundle such that it could be used in messaging? Like a profile for a Bundle that represents an ADT^A01 message.</p>",
        "id": 153952077,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1523546761
    },
    {
        "content": "<p>I've created profiles for a variety of message bundles, but they've always been specific to a particular closed environment.  One of the challenges with FHIR is just because something was done with messaging in v2 doesn't mean that there's a use-case to do it with messaging in FHIR.  Messaging imposes an overhead that's not necessarily required for a lot of healthcare transactions and it opens up new ways of systems getting access to relevant information.  So far there hasn't been a whole lot of interest in trying to port the v2 message events and message definitions across to the FHIR spec.   That doesn't mean it couldn't be done.</p>",
        "id": 153952091,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523552402
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> are the profiles somewhere you can share? Mostly just looking for a starting point. I'm somewhat green with <code>StructureDefinition</code> overall. For example, is there a way to explicitly specify that <code>MessageHeader</code> should be the first entry in message Bundle?</p>",
        "id": 153952101,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1523554725
    },
    {
        "content": "<p>Despite urging, the client has not yet hosted the technical artifacts in a place that's accessible to the general public.  I'll see if I can get permission to share them privately.</p>",
        "id": 153952116,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523558689
    }
]