[
    {
        "content": "<p>On our ePrescribing project we will have a queue holding prescriptions awaiting delivery to a pharmacy. <br>\nThey will have a status of queued. When they are collected the status will change to delivered.</p>\n<p>This seems to be a similar concept to {resource}.status and I should create a status extension for MessageHeader?</p>",
        "id": 215678817,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1604562352
    },
    {
        "content": "<p>In our space, we simply delete the messages once the recipient has taken custody of them.  You <em>could</em> create an extension - either a status or a boolean.  Do you have a reason to retain the messages as queriable (as opposed to in audit) once they've been consumed?</p>",
        "id": 215901627,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604695545
    },
    {
        "content": "<p>What I'm looking at is in the sequence diagrams here:  <a href=\"https://specs.prescribeit.ca/R3.0/erx/erx.html#eeh\">https://specs.prescribeit.ca/R3.0/erx/erx.html#eeh</a></p>\n<p>For the Get poll queue requests I'm suggesting:</p>\n<p>GET [base]/Bundle?message.destination.receiver=[ODSCode]&amp;status=queued<br>\nor<br>\nGET [base]/Bundle/{id}</p>\n<p>For the POST clear message queue, I'm looking at PATCH to change the message status for individual messages.</p>\n<p>We also have a prescription tracker api. which is similar queries to the GET poll queue requests.</p>",
        "id": 215941104,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1604730504
    },
    {
        "content": "<p>We can use this in our cancellation process, so if prescription-order has a status of delivered. A prescriber will know they have to contact the pharmacy to cancel the prescription (and the pharmacy will return the order by setting the status back to queued).</p>",
        "id": 215941493,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1604731322
    },
    {
        "content": "<p>Shouldn't the message stay 'queued' until an ack-message has been received by the server?</p>",
        "id": 215943571,
        "sender_full_name": "René Spronk",
        "timestamp": 1604735574
    },
    {
        "content": "<p>Yes, that's what I was thinking. The PATCH acts as an ack. </p>\n<p>I think polling is the wrong description, it's a query API which is also used to collect messages.</p>",
        "id": 215944042,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1604736499
    },
    {
        "content": "<p>In PrescribeIT, the 'ack' is the request by the recipient to delete the message from the queue</p>",
        "id": 215971734,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604780598
    }
]