[
    {
        "content": "<p>In Denmark, MedCom,  we use FHIR Messaging to exchange data between different health players, say communication between general practitioner and a region regarding the patients treatment.  We have planned to add priority to the FHIR message but  would like a general solution that may support not only our simple communication message but as well our referrals, labresults , that are expected to be communicated as FHIR messages as well.  On the other hand, not all of our FHIR Messages shall have a priority.  In our present simple communication message we are using the FHIR Communication ressource in a FHIR Message Bundle.  The Communication ressource  has a priority segment, but will the FHIR Communication message be a part of the refererrals and labresults  as a natural part?   Please share thoughts and experience with using priority in FHIR Messaging.</p>",
        "id": 209357321,
        "sender_full_name": "Irene Zuschlag",
        "timestamp": 1599553011
    },
    {
        "content": "<blockquote>\n<p>The Communication resource has a priority segment, but will the FHIR Communication message be a part of the referrals and lab results as a natural part? Please share thoughts and experience with using priority in FHIR Messaging.</p>\n</blockquote>\n<p>If you have the full picture of the referral process and the lab order/result, the Task and ServiceRequest resources that are pert of them have the same priority field.</p>",
        "id": 209386536,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1599572131
    },
    {
        "content": "<p>Can you explain what priority would mean at the 'message' level (which is generally about the data transport, not the content)?  If you're sending an important lab result, the importance would generally be conveyed by the Observation, not the message (because the system needs to remain aware of the importance once the message header goes away - which generally happens on receipt).</p>",
        "id": 209386553,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599572138
    }
]