[
    {
        "content": "<p>DaVinci Alerts project is seeking feedback from the FHIR Messaging Community</p>\n<p>Our confluence page is here: <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=51225446\" target=\"_blank\" title=\"https://confluence.hl7.org/pages/viewpage.action?pageId=51225446\">https://confluence.hl7.org/pages/viewpage.action?pageId=51225446</a></p>\n<p>This project's goal is to develop a FHIR based framework to notify care team members about patient events that may be of interest to them.<br>\nOur initial use case is on admission and discharge events and for \"unsolicited\" notifications (We plan to implement subscriptions as well but are waiting for event based subscriptions to be worked out in the Argonaut project)</p>\n<p>The stakeholders have expressed interest in having a common FHIR artifact for both unsolicited push notification as well as subscriptions that conveys the information that is needed to decide if an event is of interest to them and optionally either provide supporting information or a means for them to query for more, if authorized.</p>\n<p>We had prepared an IG: <a href=\"http://build.fhir.org/ig/HL7/davinci-alerts/branches/master/index.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/davinci-alerts/branches/master/index.html\">http://build.fhir.org/ig/HL7/davinci-alerts/branches/master/index.html</a>. However, it was decided to recast the proposed FHIR operation to a FHIR messaging paradigm.</p>\n<p>We wanted to draw on your expertise with FHIR messaging to understand the risks, benefit and answer some technical implementation details and issues such as:</p>\n<p>·        Experience and use of MessageDefinition</p>\n<p>·        Experience and use of $process-message</p>\n<p>·        Framework for the receiver to query for additional information.</p>\n<p>·        Notification using FHIR Messaging  -  how does this differ from using V2 ADT messaging and do you use the same transmission infrastructure for both V2 and FHIR?</p>\n<p>·        Cost benefit vis a vis V2 messaging for not native FHIR systems</p>\n<p>The project lead for the DaVinci Alerts project.  <span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span> </p>\n<p>Our community calls are Wednesdays from 12 - 1 PM EDT (I realize for some of you that is rather late in your day), so I was wondering, if you would be able to join our next one on 8/14/2019</p>",
        "id": 173214612,
        "sender_full_name": "Eric Haas",
        "timestamp": 1565797326
    },
    {
        "content": "<p>for similar reasons the IHE Implementation Guide on the use-case for HIE management of a master patient identity chose to use FHIR Message. This can be configured to be sent to a recipient (similar to ADT in v2 world), but can also be subscribed to using the FHIR Subscription. We get to re-use the same message for both.  -- would like to see some experimentation at the Atlanta FHIR Connectathon</p>",
        "id": 173215441,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565797868
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>     As of right now,  the subscription payload is not a bundle but a single resource the topic or nothing - how does IHE define notification payoad as  a bundle?</p>",
        "id": 173221963,
        "sender_full_name": "Eric Haas",
        "timestamp": 1565802362
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/codesystem-subscription-channel-type.html#subscription-channel-type-message\" target=\"_blank\" title=\"http://build.fhir.org/codesystem-subscription-channel-type.html#subscription-channel-type-message\">http://build.fhir.org/codesystem-subscription-channel-type.html#subscription-channel-type-message</a></p>",
        "id": 173235572,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565811988
    },
    {
        "content": "<p>Redox is doing a lot of FHIR messaging today if you'd like to chat or play with our free tools at <a href=\"http://developer.redoxengine.com\" target=\"_blank\" title=\"http://developer.redoxengine.com\">developer.redoxengine.com</a></p>",
        "id": 173292861,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1565877745
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  I must have looked at that valueset a dozen times and never noticed the message type (or forgot it seconds later)</p>",
        "id": 173421280,
        "sender_full_name": "Eric Haas",
        "timestamp": 1566007684
    },
    {
        "content": "<p>Looking for feedback on usage of MessageHeader to determine FMM status/level.  Please respond if you are using MessageHeader in production, and include the country.</p>",
        "id": 271997927,
        "sender_full_name": "Anthony(Tony) Julian",
        "timestamp": 1644941915
    },
    {
        "content": "<p>It's been used in production in Canada as part of PrescribeIT for 4+ years now.  It's also being used in Ontario for e-referrals.</p>",
        "id": 271999724,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644942654
    },
    {
        "content": "<p>I would assume MessageHeader is being used by any systems converting HL7v2 messages to FHIR.  I can't give you a specific example, but you may find more on that stream.</p>",
        "id": 272015637,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1644948979
    },
    {
        "content": "<p>We're using it in pilot implementations in DK</p>",
        "id": 272016874,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644949523
    },
    {
        "content": "<p>And it has nothing to do with HL7v2</p>",
        "id": 272016924,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644949548
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> can you prompt the Danish users of MessageHeader to comment please. And <span class=\"user-mention\" data-user-id=\"191687\">@Kevin Mayfield</span> can you chase comment from UK users, please (or <span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span>?)</p>",
        "id": 272036112,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644958350
    },
    {
        "content": "<p>Ping <span class=\"user-mention\" data-user-id=\"192163\">@Michael Johansen</span>  / <span class=\"user-mention\" data-user-id=\"431942\">@Thea Mentz Soerensen</span> / <span class=\"user-mention\" data-user-id=\"195814\">@Ole Vilstrup</span></p>",
        "id": 272036198,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1644958406
    },
    {
        "content": "<p>We have planed in DK (as Jens mention) our first FHIR messaging during 2021, but due to other project related factors, production is still not taking place. We (MedCom) has as well discussed maturity with the project architects and national authorities. We are from consultants being told to look at UK</p>",
        "id": 272036492,
        "sender_full_name": "Michael Johansen",
        "timestamp": 1644958540
    },
    {
        "content": "<p>Messaging has been widely used in Denmark as a key part of our healthcare information infrastructure. MedCom is the driver of consensus based content first based on UN Edifact, later on a pure Danish Initiative called OIOxml. We see FHIR messaging as mature compared to these initiatives and as it has clear base in HL7v2 messaging it does not seem immature at all. We are as <span class=\"user-mention\" data-user-id=\"192163\">@Michael Johansen</span> mentions, at the moment a bit on hold, as the finances around FHIR Messaging is discussed between the authorities in DK. <br>\nHowever we have developed our first 2 FHIR Messaging initiatives, one, HospitalNotification,  based on cross sector communication of some ADT like messages, which have existed in the Danish Healthcare Sector for more than 20 years, first based on edifact and OIOxml and now because of new demands due to shorter hospitalizations periods ported into FHIR. The second, CareCommunication, probably mostly a Danish Standard for exchanging email-like information concerning encounter-focused hospiatlizations, whether that is  on Hospitals or in HomeCare and widely used to allow for non-structured based information between the Healthcare professionals in the different Sectors.<br>\nIf our situation on hold clears up, we are planning to move some of our other messaging standards to FHIR, some to Messaging, some to API based exchange. As we have a large catalogue of MedCom Messages and as messaging is widely used in Denmark, we will do a thorough investigation of how to move forward with which standards/profiles on FHIR Messaging and which standards/profiles on FHIR  API or even FHIR Documents.</p>",
        "id": 272042299,
        "sender_full_name": "Ole Vilstrup",
        "timestamp": 1644961273
    },
    {
        "content": "<p>IHE has modeled a patient identity feed using FHIR messaging.  This has not yet been converted to an IG publisher, so it is an oldschool PDF document - <a href=\"https://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_PMIR.pdf\">https://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Suppl_PMIR.pdf</a></p>",
        "id": 272042639,
        "sender_full_name": "John Moehrke",
        "timestamp": 1644961496
    },
    {
        "content": "<p>Thanks to all.  I will try to expedite the work to move to normative.</p>",
        "id": 272049442,
        "sender_full_name": "Anthony(Tony) Julian",
        "timestamp": 1644965356
    },
    {
        "content": "<p>In the England we have several national using  specs using MessagingHeader in production. <br>\nThe are roughly aligned around HL7v2 use cases such as ADT, SendDocument, unsolicitied-obsservations and Prescription order + dispense</p>",
        "id": 272072480,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1644985810
    },
    {
        "content": "<p>Is it possible to get approximate numbers in production use from the above? E.g. messages exchanged per month, number of vendors participating in production exchanges?</p>",
        "id": 272074609,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1644988517
    },
    {
        "content": "<p>I'll see if I can get figures. I suspect it's highly skewed by COVID Immunization feeds to primary care providers and alongside that is document feeds (again) to primary care providers.</p>",
        "id": 272081684,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1644996828
    },
    {
        "content": "<p>No figures from Dk yet as we are not in production</p>",
        "id": 272083561,
        "sender_full_name": "Ole Vilstrup",
        "timestamp": 1644998447
    },
    {
        "content": "<p>This article gives some stats on the Canadian PrescribeIT project: <a href=\"https://www.infoway-inforoute.ca/en/news-events-blog/news/2021-news-releases/prescribeit-continues-to-gain-momentum-and-achieve-significant-milestones\">https://www.infoway-inforoute.ca/en/news-events-blog/news/2021-news-releases/prescribeit-continues-to-gain-momentum-and-achieve-significant-milestones</a></p>\n<p>They don't list specific message volume, but based on the other numbers, I'd expect there's well over 100k/day.</p>",
        "id": 272190935,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645051948
    },
    {
        "content": "<p>In England we have high use around COVID Immunization and national demographic updates.</p>\n<p>The majority of these originate from national systems, so I'd be inclined to say our use of FHIR Messaging is not mature.</p>",
        "id": 272218271,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1645078414
    },
    {
        "content": "<p>I think the question asked was about the MessageHeader resource specifically, not messaging in general. Have you found any issues with the resource itself (missing elements, unnecessary elements, unclear definitions, etc.)?</p>",
        "id": 272268978,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1645109078
    },
    {
        "content": "<p>We are only making limited use of it at the moment, it's mostly the eventCoding and focus we use.</p>",
        "id": 272281511,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1645113911
    },
    {
        "content": "<p>hey guys , I need some help in Generating FHIR message in Python for the below given input <br>\nPatient Details :<br>\nJ Henry<br>\n3001 S king Dr<br>\nChicago<br>\n60616</p>\n<p>Doctor Details<br>\nDr Charles John<br>\n2300 S king Dr<br>\nChicago<br>\n60616</p>\n<p>Medication Request<br>\nEltroxin 100 Microgram</p>",
        "id": 274637067,
        "sender_full_name": "Jay B",
        "timestamp": 1646793795
    },
    {
        "content": "<p>Any amount of help would be appreciated</p>",
        "id": 274637082,
        "sender_full_name": "Jay B",
        "timestamp": 1646793817
    },
    {
        "content": "<p>This sort of seems like a \"please do my homework for me\" sort of question.  If you're running into issues with a specific part of your task, feel free to describe the problem and we'll do our best to assist.  However, there is a minimum expectation that you'll read the spec, do your best to map the data elements and try using the reference implementation yourself before seeking help.  (And that you'll search for answers to previous questions before asking one of your own.)  Please see the <a href=\"https://confluence.hl7.org/display/FHIR/FHIR+Rules+for+Asking+Questions\">FHIR Rules for Asking Questions</a>.</p>",
        "id": 274641528,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646798615
    },
    {
        "content": "<p>For Python/FHIR specific questions, there's the <a class=\"stream\" data-stream-id=\"179218\" href=\"/#narrow/stream/179218-python\">#python</a> stream on this forum, if you get stuck during the development process.</p>",
        "id": 274651569,
        "sender_full_name": "René Spronk",
        "timestamp": 1646810971
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Thanks for the input Lloyd. I am new to FHIR Message. I am here not to ask anyone to do my homework . I am here to get to see if some one points any resources.Hope you will understand , when someone asks for help it doesn't mean they are too busy to do their own work</p>",
        "id": 275010666,
        "sender_full_name": "Jay B",
        "timestamp": 1647021815
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  Thank you Rene . Sure Will ask in Python Group</p>",
        "id": 275010819,
        "sender_full_name": "Jay B",
        "timestamp": 1647021868
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"484029\">@Jay B</span> My point was that your question wasn't well framed.  You didn't describe what you'd tried and what you were having problems with.  You simply said \"I need to do X, please help\" without indicating what specific sort of help was necessary.</p>",
        "id": 275011503,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647022182
    }
]