[
    {
        "content": "<p>Hi,</p>\n<p>We are currently having a discussion in the <a href=\"#narrow/stream/179226-norway/topic/Messaging.20og.20HER-id\">norway stream</a> regarding messaging and how to correctly interpret and use the required elements: <code>source.endpoint</code> and <code>destination.endpoint</code>. The use of the word <strong>endpoint</strong> with the datatype <strong>url</strong> suggests that this should be a resolvable protocol specific endpoint where the message can be delivered, e.g. http, ftp or email endpoint.</p>\n<p>However, the <a href=\"https://www.hl7.org/fhir/messageheader.html#notes\">Notes</a> says the following:</p>\n<blockquote>\n<p>If  _MessageHeader.source.endpoint_  and  _MessageHeader.destination.endpoint_, are literal URLs, then they SHOULD identify the addresses to which messages can be delivered. If they are logical URIs (i.e. non-dereferenceable), message delivery intermediaries must know how to deliver the message to the destination application.</p>\n</blockquote>\n<p>And from the <a href=\"https://www.hl7.org/fhir/messaging.html#basic\">Basic Messaging Assumptions</a>:</p>\n<blockquote>\n<p>The exact mechanism of transfer is irrelevant to this specification, but may include file transfer, HTTP based transfer, MLLP (HL7 minimal lower layer protocol), MQ series messaging or anything else. The only requirement for the transfer layer is that requests are sent to a known location and responses are returned to the source of the request. This specification considers the source and destination applications as logical entities, and the mapping from logical source and destination to implementation specific addresses is outside the scope of this specification</p>\n</blockquote>\n<p>Is it correct to interpret that an endpoint can either be a protocol-specific URL or a business identifier (URI) to identify the logical entity, e.g. a practitioner, organization or office? In this case, why is not the uri datatype used, is it related to this paragraph from <a href=\"https://www.hl7.org/fhir/resource.html#canonical\">Canonical URLs</a>?</p>\n<blockquote>\n<p>Some resource types have a defined element <code>url</code> which is the 'canonical URL' that always identifies the resource. This is a special kind of Business Identifier. Note that the element actually contains a URI, but is named <code>url</code> for legacy reasons.</p>\n</blockquote>\n<p>In Norway we use a business identifier called HER-id to identify the communicating entities within the health sector, e.g. a practitioner-role or a department within an organization. When using the Identifier datatype this would look like this:</p>\n<div class=\"codehilite\"><pre><span></span><code>&quot;identifier&quot;:{\n  &quot;system&quot;:&quot;urn:oid:2.16.578.1.12.4.1.2&quot;,\n  &quot;value&quot;:&quot;102287&quot;\n}\n</code></pre></div>\n<p>In some cases this is the only known address of the destination and the message could pass through multiple transfer-protocols (http, kafka, mq, mail) before arriving at the destination. Since <code>destination.endpoint</code> is of type url and not Identifier, would the following be the preferred representation?:</p>\n<div class=\"codehilite\"><pre><span></span><code>&quot;destination&quot;: [\n  {\n    &quot;endpoint&quot;: &quot;urn:oid:2.16.578.1.12.4.1.2.102287&quot;\n  }\n]\n</code></pre></div>\n<p>The alternative would be to add the identifier in the <code>destination.receiver</code> as a logical-reference, but that leaves us with empty endpoint elements. This situation is similar to <a href=\"https://jira.hl7.org/browse/FHIR-26898\">this Jira issue</a>.</p>\n<p>What about the <a href=\"https://www.hl7.org/fhir/endpoint.html\">Endpoint</a> resource, what is its intended use in the messaging context? The only mentioning is the following, which I do not understand:</p>\n<blockquote>\n<p>Messaging: (currently defined in the Message Header, but only as the address)</p>\n</blockquote>",
        "id": 252626891,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1631194731
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, do you have any insight to share on this topic?</p>",
        "id": 253212126,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1631606229
    },
    {
        "content": "<p>I don't have deep insight into how the model got to where it is, but I suspect it is modeled off of early concepts in FHIR and thus might not benefit from current modeling methodology.</p>",
        "id": 253244959,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631624120
    },
    {
        "content": "<p>That said, i would expect in a messaging pattern that the sender and destination should be URI or Identifiers. Having them be references would seem odd. So one recommendation may be to allow them to be identifiers or URI, with another to use current URI modeling.</p>",
        "id": 253245210,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631624241
    },
    {
        "content": "<p>I don't see the relationship of what you describe to the Jira ticket you mention. (I don't understand how the jira ticket expects to work as to me a destination seems always to be necessary in messaging. But I leave that to the workgroup).</p>",
        "id": 253245384,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631624309
    },
    {
        "content": "<p>Overall, I your interpretation is workable. I would recommend you create jira tickets that describe where you feel the specification is lacking and where your design chose to go.</p>",
        "id": 253245499,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631624374
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179263-fhir-messages/topic/Use.20of.20endpoints/near/253245384\">said</a>:</p>\n<blockquote>\n<p>I don't see the relationship of what you describe to the Jira ticket you mention. (I don't understand how the jira ticket expects to work as to me a destination seems always to be necessary in messaging. But I leave that to the workgroup).</p>\n</blockquote>\n<p>I interpret the Jira issue as being the same as our scenario:<br>\nWhat he refers to as destination URL is what I refer to as protocol specific endpoint. Because he lacks an endpoint he uses the destination.receiver of type Reference(Organization) as a logical-reference to the destination, but that still leaves him with an empty destination.endpoint.</p>\n<p>Maybe <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> can clarify this himself?</p>",
        "id": 253247555,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1631625196
    },
    {
        "content": "<p>I agree with John that I'd normally expect the sender and destinations to be URIs or identifiers rather than references.</p>",
        "id": 253249046,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1631625738
    },
    {
        "content": "<p>For messaging, there always may be a destination, but the entity that is generating the MessageHeader may not know it.    Or rather, there are two types of destinations:  1) the ultimate recipient(s)  2) the first hop (e.g. to a routing intermediary).  I don't think we will normally want the MessageHeader.destination to point to the routing intermediaries <em>unless</em> that routing intermediary is a first-class entity in the exchange (like an HIE.  For the purpose of this discussion, I consider the first-class intermediaries as just a recipient.  The routing intermediaries I'm thinking about here are org-internal helper systems like CorePoint, Cloverleaf, etc.  Those routing intermediaries may be the party that knows the ultimate destination(s).</p>",
        "id": 253249049,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1631625739
    },
    {
        "content": "<p>We (Epic) have had a TON of internal discussion about FHIR messaging, and one of the key points is that the entity that generates and sends a message may not know who the ultimate recipient(s) will be.  And this is desired, as it creates a decoupled architecture.</p>",
        "id": 253249418,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1631625883
    },
    {
        "content": "<p>that feels more like an internal systems-design challenge where you could simply ignore the 1..1...  That is to say that there is communication between internal systems to some goal, but by the time the \"message\" is complete it has a destination.</p>",
        "id": 253249672,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631625980
    },
    {
        "content": "<p>as to intermediaries... agree, tendency should be to just target the endpoint.. if one needs to target an intermediary, then wrap it again in another messageHeader. (turtles all the way down)</p>",
        "id": 253249779,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631626026
    },
    {
        "content": "<p>I expect Epic and Corepoint (for example) would want to talk \"real\" FHIR to each other, since we are different systems within an organization footprint.  I think the base spec should be 0..1.  An IG could make that 1..1 if that IG was intended to be used only for non-internal use.</p>",
        "id": 253250060,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1631626116
    },
    {
        "content": "<p>Unless you're telling me that we can fudge all the FHIR spec requirements as long as we are just talking org-internal :p.</p>",
        "id": 253250164,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1631626164
    },
    {
        "content": "<p>im not against it. just giving my initial reaction. I am sure there is some communication of the destination end point, so why is that acceptable in your model to not be part of the interop standard?</p>",
        "id": 253250488,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631626274
    },
    {
        "content": "<p>What about using the destination.endpoint as a logical id (URI) as mentioned in this topic?</p>",
        "id": 253250599,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1631626321
    },
    {
        "content": "<p>im not sure how the idea of multi-casting was intended... Send this patient demographics update to all members...</p>",
        "id": 253250768,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631626377
    },
    {
        "content": "<p>it might eventually be unicast, but I can see how an intermediary that only role is to change multi-cast to unicast(s)</p>",
        "id": 253250897,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631626435
    },
    {
        "content": "<p>my overall impression is that messaging has not received much attention, and been denigrated by many core. So I would expect you should see this as an opportunity to improve the spec, rather than that the spec has some reason to be so poorly defined.</p>",
        "id": 253251163,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631626518
    },
    {
        "content": "<p>I expect most FHIR messages might be going to multiple recipients.  The benefit of a message is that it is a unit of (event,data) that a bunch of folks probably care about.  E.g. a message for a lab order or result probably goes to the lab, but also the infection control system, the data warehouse, maybe a bed monitor so patients can track the status of their labs, etc.</p>",
        "id": 253251175,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1631626521
    },
    {
        "content": "<p>There is usually one primary recipient (lab) but a ton of secondaries (infection control).  But if your job is infection control, you don't really consider yourself as a secondary.</p>",
        "id": 253251217,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1631626536
    },
    {
        "content": "<p>one vision is that each of those groups of target end points is given a URI. the intermediary is the one registered for receipt of that URI, and knows that the role is to change multi-cast (URI) into unicast multiple sends of the copies. Not clear that in this case the origial URI must be changed, but it could be.</p>",
        "id": 253251886,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631626767
    },
    {
        "content": "<p>the URI space is infinite.. so plenty of URI to support this.</p>",
        "id": 253251962,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631626802
    },
    {
        "content": "<p>The wrinkle is that some national messaging frameworks (I'm thinking Denmark MedCom and the Norway e-prescribing stuff I think), require (or are considering requiring) the EHR to specify the ultimate destination, not the intermediary.</p>\n<p>I.e. I think we (as an industry) are trying to implement two different messaging models using the same FHIR Messaging framework.</p>",
        "id": 253262424,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1631630328
    },
    {
        "content": "<p>In the English Prescribing system. destination.endpoint isn't needed. It's always the prescription manager endpoint. <br>\nFrom the Prescription Manager we swap over to FHIR Workflow and rest.</p>",
        "id": 253290609,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1631640750
    },
    {
        "content": "<p>In the US e-prescribing, the (direct) destination is normally a network (like Surescripts), however we also send along the specific pharamcy (e.g. Walgreens on 1st Street in Verona WI) we want Surescripts to send the prescription to.</p>",
        "id": 253296012,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1631642812
    },
    {
        "content": "<p>The intention is that you specify either the URL or some other URI that uniquely identifies the recipient.  We had no use-case for Identifier so didn't specify that as an option.  Also, URI seemed more consistent with \"the FHIR way\".  If you'd really like an identifier, that could submit a change request for it.</p>\n<p>Not sure about making either optional.   A message needs to have a sender and a receiver and every messaging system I've ever encountered has had a computable means of identifying both.  (Really hard to route things without it.)  What's the use-case for making them optional?</p>",
        "id": 253331540,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631657312
    },
    {
        "content": "<p>If I were to create an issue for change for source.endpoint and destination.endpoint, what do you think about the following alternatives?:</p>\n<ol>\n<li>Change the datatype from URL to URI (why is it not URI in the first place?)</li>\n<li>Change the datatype from URL to a choice between URI and Identifier.</li>\n</ol>\n<p>In both of these alternatives the endpoints will remain required (card. 1...1), I also believe this is a reasonable requirement in a message. The exception would be when messaging is used in an Event Oriented Architecture where events are broadcasted without knowing who is interested, but this scenario is already achievable by having 0 destinations.</p>",
        "id": 253335826,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1631659769
    },
    {
        "content": "<p>URL to URI I'd support.  URL to choice with identifier, I'd need to understand why Identifier was necessary and URI couldn't work.  (Changing to URI would be non-breaking, while changing to a choice would be breaking.)</p>",
        "id": 253360718,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631680088
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191764\">Cooper Thompson</span> <a href=\"#narrow/stream/179263-fhir-messages/topic/Use.20of.20endpoints/near/253262424\">said</a>:</p>\n<blockquote>\n<p>The wrinkle is that some national messaging frameworks (I'm thinking Denmark MedCom and the Norway e-prescribing stuff I think), require (or are considering requiring) the EHR to specify the ultimate destination, not the intermediary.</p>\n<p>I.e. I think we (as an industry) are trying to implement two different messaging models using the same FHIR Messaging framework.</p>\n</blockquote>\n<p>In Norway we usually have three layers of messagingHeaders for our mainstream messaging infrastructure.</p>\n<ol>\n<li>On the business level we have a message header that identifies the sender and recevier as business entities e.g. using HER identifiers and other business identifiers. The actual endpoint address is usually not know by the systems generating the actual business messages.</li>\n<li>Most messages use a SOAP MEssageHeader (ebMS 2.0) for non-rep and encryption of the payload, eb:From and eb:To  still contain no acutal endpoint adresses.</li>\n<li>On the transport layer (usually SMTP but other protocols are implemented as well) an actual endpoint adress is provided.</li>\n</ol>\n<p>This means that in Norway a better mapping would be for the destination and source elements to be mandatory, but endpoints should be optional as only the transport level MessageHeaders would contain an actual endpoint address.</p>",
        "id": 253365242,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1631684494
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Re: Also, URI seemed more consistent with \"the FHIR way\". </p>\n<p>Sounds similar to Reference. You can use a uri/reference or an identifier. We've chosen identifier for our national system</p>",
        "id": 253368963,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1631687678
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-33690\">https://jira.hl7.org/browse/FHIR-33690</a></p>",
        "id": 253369766,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1631688326
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191687\">Kevin Mayfield</span> <a href=\"#narrow/stream/179263-fhir-messages/topic/Use.20of.20endpoints/near/253369766\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://jira.hl7.org/browse/FHIR-33690\">https://jira.hl7.org/browse/FHIR-33690</a></p>\n</blockquote>\n<p>This example uses References instead of URI/Identifier to identify the recipient, why cannot the endpoints contain the business-id of the sender/recipient as URIs? Is your interpretation that the endpoints MUST contain a protocol-specific URL?</p>",
        "id": 254027892,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1632133708
    },
    {
        "content": "<p>I don’t think we have a use at the moment for reference or uri.</p>",
        "id": 254490948,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1632380969
    }
]