[
    {
        "content": "<p>Here are some of the concerns that I'd like to see addressed.<br>\n1. We already have a resource to describe the contents of a full DICOM imaging study. ImagingStudy follows the Event prototype, and in many ways, mirrors Observation. The resource lists the contents of the DICOM study, and includes the information needed to retrieve the images from a PACS or other image archive. The actual images aren't stored in FHIR. I don't see the outcome of this discussion will impact that resource significantly. <br>\n2. I see a need to capture the clinical context of other non-DICOM imaging (pathology, dermatology, wound care), video (endoscopy, surgery), potentially ECG and audio waveforms.<br>\n3. I see a need to include “images of interest” in reports, etc. These may be JPEG renderings of DICOM images, selected regions of interest on an image (or a trimmed audio or video clip), an annotated image, etc. It should be possible to link derived media back to the source media or DICOM image.<br>\n4. It should be possible to link derived observations back to the source media or DICOM image.<br>\n5. To cover patient-supplied photos, etc. there should be low metadata requirements on the media content. It should also be possible to have media (with as much context as possible) in the absence of it being used in a report, or referenced by an observation, etc. (Open question is whether clinical media needs to be tied to an encounter or procedure.)<br>\n6. Consider whether we need to support media with multiple “subjects” (a group photo of HL7 WGM attendees who have subsequently come down with a mysterious disease; an audio recording of a group counselling session).<br>\n7. We should review all references to Observation, Media, DocumentReference, ImagingStudy to see if we need to allow other resources.<br>\n<span class=\"user-mention\" data-user-id=\"191960\">@Brad Genereaux</span> Any thoughts about what other success criteria should be?</p>",
        "id": 153912906,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507329160
    },
    {
        "content": "<p>second bullet = Media   Option 2 with some edits<br>\nthird bullet = Media   Option 2 wtith some edits<br>\nfourth bullet = Obs.element = type ref(Media)  Option 2<br>\nfifth bullet = Attachment data type  as is plus /minus height/width/frames/duration<br>\nsixth bullet = Media.subject (Group)?   - already there<br>\nseventh bullet = ?? (this is  part of normal <a href=\"https://docs.google.com/spreadsheets/d/1COTmtlXgGWuFpoSr1ZQQK30S7ReCpVsk_NZI6xIeSHI#gid=1272626212\" target=\"_blank\" title=\"https://docs.google.com/spreadsheets/d/1COTmtlXgGWuFpoSr1ZQQK30S7ReCpVsk_NZI6xIeSHI#gid=1272626212\">QA process</a>)</p>",
        "id": 153912908,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507330558
    },
    {
        "content": "<p>For #5, I was still thinking about \"clinical multimedia\" -- patient supplied wound photos, etc. If we go with \"Option 2\",  I think they would be captured with Media, but we need to make sure that it most content is optional.</p>",
        "id": 153912909,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507331122
    },
    {
        "content": "<p>Agree and In Base standard very little if anything is Min = 1.</p>",
        "id": 153912910,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507331257
    },
    {
        "content": "<p>True.<br>\nI was trying to lay out how could we judge if whatever we decide on works. I've done similar efforts before, and you get to the end and realize that you forgot that one use case that invalidates the whole solution.</p>",
        "id": 153912911,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507331415
    },
    {
        "content": "<p>.. as long as we are shooting for the 80%...</p>",
        "id": 153912914,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507332508
    }
]