[
    {
        "content": "<p>Option One (A) would remove Media and modify Observation by adding a .reasonCode and .view (extension or core TBD), and create a new media data type that can be used as an choice in Observation.value.  It would include: category (image/video/audio), contentType, language, data, url, size, height, width, frames, duration, hash, title, creation.</p>\n<p>Option One (B) would be similar for the changes for Option One (A), but instead of adding a new data type, attachment data type would be updated to also include: category (image/video/audio), height, width, frames, duration.</p>",
        "id": 153912888,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1507319616
    },
    {
        "content": "<p>One of the items in the discussion was removal of Observation.valueAttachment. Do we have a good feeling for what people are using that for now? Does it all overlap with potential Media uses?</p>",
        "id": 153912892,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507324619
    },
    {
        "content": "<p>If we keep an external resource like Media; an one can always use containment if they don't want it as an external resource. Right? Why does that not work?</p>",
        "id": 153912896,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507325588
    },
    {
        "content": "<p>Personally, I don't like the idea of a media data type. I think the non clinical  information can be added to the regular attachment (height, width, etc.), but the clinical context needs to be in a resource.</p>",
        "id": 153912897,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507325838
    },
    {
        "content": "<p>(I know, not answering your question John.)</p>",
        "id": 153912898,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507325858
    },
    {
        "content": "<p>Speaking of containment, and somewhat tangential to this discussion, let me just, again, voice my distaste for inline attachment.data. Getting huge payloads back unexpectedly, or having to send large payloads when updating is a pain. (Updating the address of a patient without a photo means retrieving and sending 10s of KB of info; updating a patient with a photo could be megabytes.)</p>",
        "id": 153912899,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507326231
    },
    {
        "content": "<p>I like adding the (height, width, etc) elements to Attachment datatype. I see no downside to that... The inline attachment.data is helpful when it is a small attachment, but it needs to have 'strong' guidance against use above a number of bytes. I suspect abuse of this would result in quick and clear backlash, thus it will self-correct.</p>",
        "id": 153912900,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507326581
    },
    {
        "content": "<p>There was talk about adding Attachment.valueMedia and valueBinary. In general, I don't like the idea. I feel datatypes should be at the bottom of the complexity, don't jump back up into a resource. On the other hand, I wonder if knowing that a particular attachment.url is actually a reference to a Binary would allow smarter handling?</p>",
        "id": 153912902,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507327239
    }
]