[
    {
        "content": "<p>Questions have come up whether to collapse Media into Observation (considering large overlap between Media and Observation),  keep the current resources but make various modifications, or perhaps combine Media and DocumentReference.</p>\n<p>The minutes to the first meeting on this topic are available here: <a href=\"http://www.hl7.org/documentcenter/public/wg/orders/minutes/Minutes%2020171005_ConCall%20-%20Media.docx\" target=\"_blank\" title=\"http://www.hl7.org/documentcenter/public/wg/orders/minutes/Minutes%2020171005_ConCall%20-%20Media.docx\">http://www.hl7.org/documentcenter/public/wg/orders/minutes/Minutes%2020171005_ConCall%20-%20Media.docx</a>.  This includes a set of slides outlining the options:<br>\n- Option Zero: Do nothing, keep as-is<br>\n- Option One: Collapse Media into Observation and either (A) create a new media data type or (B) update the attachment data type<br>\n- Option Two: Keep Media and Observation, but make a series of changes to Media, Observation, and attachment data type.  A number of these changes could be done incrementally over time.<br>\n- Option Two A or B: Do Option Two and (A) keep DocumentReference as-is, or (B) merge DocumentReference and Media into a new resource.</p>",
        "id": 153912886,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1507319262
    },
    {
        "content": "<p>One comment was that there is many duplicated values between these three. I think the message of this comment is that the user-community would not understand when to use the alternatives, or when the user-community goes looking for 'observations' they might not find all of them as they might be scattered and not well contained.  One solution to this is better clarity on the alternatives, pro/con, with clear guidance on use of all available alternatives.  I favor this, as a core standard needs to recognize momentum of existing approaches, and thus can't ask for radical changes thus eliminating an alternative. Thus the duplicate values are not a problem if the alternative resource methods are well understood.</p>",
        "id": 153912895,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507325479
    },
    {
        "content": "<p>Agree. I don't even think we've go clarity in our discussions about the purpose of various resources. For example, my view is that Media is for \"clinical multimedia\"--things that might go into an Enterprise Imaging system--that is various types of images, videos, and waveforms (audio or otherwise). I'm thinking about things produced during or obtained for patient care (pathology, dermatology, wound care imaging; endoscopy, surgical video; ECG). Others are approaching Media as more generic such as photos of drivers licenses.</p>",
        "id": 153912901,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507326823
    },
    {
        "content": "<p>Keeping Media.view/bodysite would seem entirely reasonable and in-scope if we says Media is for clinical multimedia, but might not meet the 80% if we allow non-clinical content. However, I again think that is where the boundary with DocumentReference becomes important: if you need bodysite, then use Media, if bodysite is irrelevant, than use DocumentReference.(And the view/bodysite of an image isn't necessarily the same as the bodysite of the related procedure, and view might not be implied at all in the procedure.)</p>",
        "id": 153912903,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507327773
    },
    {
        "content": "<p>I've been thinking about this as product director. At least a couple of these resources are FMM &gt;4. Feedback is trending pretty negative on breaking changes from stakeholders who have implemented. That's not a veto. That doesn't mean no changes. But it does mean that what ever we decide has to be very implementation focused.</p>",
        "id": 153912985,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507456222
    },
    {
        "content": "<p>saying that, I think we are trying to be... but there is a consistency vs convenience issue to keep in mind</p>",
        "id": 153912986,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507456259
    },
    {
        "content": "<p>The absence of boundaries between Media and Observation is a huge issue to me - removing value attachment solves that.   Media only really started to move into the Observation Turf at the very end of the R3 publishing cycle.   I think it was a mistake not to bring up with OO prior to those changes in Media and now we are playing catch up.</p>",
        "id": 153913172,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507574794
    },
    {
        "content": "<blockquote>\n<p>The absence of boundaries between Media and Observation is a huge issue to me - removing value attachment solves that. Media only really started to move into the Observation Turf at the very end of the R3 publishing cycle. I think it was a mistake not to bring up with OO prior to those changes in Media and now we are playing catch up.</p>\n</blockquote>\n<p>Well, the absence of boundaries was there prior to R3, since Media claimed to be useful for clinical content. I just tried to make it actually useful for that. It may have been a mistake not to consult with O&amp;O first, but the resource was is/owned by FHIR-I. The difference that talking to O&amp;O would have made is that we would have had this discussion 6 months earlier. We can still roll back the changes to Media if people think that is clearer, but I don't think it is.</p>",
        "id": 153913354,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507657122
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> I am not advocating rolling back -  the issues you brought up were important ones and we didn't realize the impact on Observation until too late in the R3 cycle.  I was justifying why we are try to tackle this now vis a vis Resource maturity.</p>",
        "id": 153913356,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507659902
    },
    {
        "content": "<p>Got side swiped, so did not get to Option Two and DocRef yet.  Here goes Option Two:<br>\nObservation and Media remain, but with some changes.<br>\nIn Observation the valueAttachment choice is removed, while .related gets a reference choice of Media.<br>\nIn Media .basedOne gains Procedure as a reference choice, while ProcedureRequest is removed.  .view, .bodySite, and .content are removed, while .fileSize and data (with Binary as a reference choice) are added. <br>\nIn the meantime, the attachment data type is adjusted to remove .contentType, .title, and .creation, while content with a reference choice to Media is added.<br>\nThe suggestion is also to change .photo in Patient to reference Media, but that was not a critical part of this option.</p>\n<p>These changes could be applied stepwise starting with the changes in Observation and attachment data type (as it is getting ready for normative), while Media could happen more gradually if desired.</p>",
        "id": 153913669,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1507831830
    },
    {
        "content": "<p>And for DocurmentReference, assume Option Two as the starting point for Observation and attachment data type, but then create a new resource combining Media and DocumentReference.  Name tbd.<br>\nUsing DocumentReference as it currently exists and consider the following changes plus a new name.<br>\nAdd photo, vidio, and audio as valid types.  Add .subtype, basedOn (with reference to Procedure), reasonCode, height, width, frames, duration, fileSize, and note.  Allow a binary for .content and add episodeOfCare as a reference choice to .context.</p>\n<p>That completest the choices as presented.  Discussion is already in full swing and see where we land.</p>",
        "id": 153913670,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1507831830
    },
    {
        "content": "<p>To me, saying \"remove Media and just use DocumentReference\" is the equivalent of collapsing Media into Binary... and I don't know why we would do that. I would likely NOT reference something that would have been \"Media\" from DocumentReference. I understand that Tifs (images resulting from fax) may seem to intersect there, but otherwise, we've tried to keep Doc Ref to things we traditionally think of as \"documents\"</p>",
        "id": 153914669,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508345977
    },
    {
        "content": "<p>Doc Ref was also explained to me once (way back in the day, pre-DSTU2) as the thing \"document indexing\" systems used</p>",
        "id": 153914670,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508346024
    },
    {
        "content": "<p>I think that use has changed quite a bit over time, eg: we now expose most documents through that resource, and still don't know where to put Notes :)</p>",
        "id": 153914671,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508346050
    },
    {
        "content": "<p>But I don't think the answer should be \"let's just slam some more stuff into that very generic bucket\" :)</p>",
        "id": 153914672,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508346070
    },
    {
        "content": "<p>We try to avoid using the raw attachement data for size reasons listed earlier. Additionally, Argonaut and a few other IGs recommended using the url field in Attachment</p>",
        "id": 153914673,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508346115
    },
    {
        "content": "<p>Those generally link to Binary for our server, rather than some other \"unknown/non-FHIR\" link</p>",
        "id": 153914674,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508346143
    },
    {
        "content": "<p>I don't like Option 1 because of administrative/non-clinical media uses. EG: patient photo and drivers license. I'm curious if there are servers out there that would use Media for other items, though maybe not the 80% (eg: videos of kids playing at children's hospitals for parent portals, etc)</p>",
        "id": 153914678,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508346636
    },
    {
        "content": "<p>For option 2: why remove reference to procedureRequest (ServiceRequest now)? Not everything that is requested from that resource results in a \"Procedure\" - and I'm not sure Media can only result from a Procedure?</p>",
        "id": 153914680,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508346772
    },
    {
        "content": "<p>(I generally like Option 2, btw, I just don't like all the changes proposed)</p>",
        "id": 153914681,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508346795
    },
    {
        "content": "<p>And I'll repeat the question above if we're sure the \"value\" of an observation can never be an attachment. If an observation is discrete values, is an EKG or Heart rythm not the representation of that? The interpretation of those values usually lies in reference ranges and DiagnosticReport. Or are we saying those types of results should only ever be present in DiagnosticReport, and would have no discrete data in Observation?</p>",
        "id": 153914686,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508346903
    },
    {
        "content": "<p>I definitly understand the concern of someone trying to use a wound picture as an Observation value, when in fact it's likely the supporting info (the Observation.related link in the Option 2 proposal). I agree those should be related and not value.</p>",
        "id": 153914689,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508346965
    },
    {
        "content": "<p>For this: \"In the meantime, the attachment data type is adjusted to remove .contentType, .title, and .creation, while content with a reference choice to Media is added.\"</p>",
        "id": 153914692,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508347040
    },
    {
        "content": "<p>The existing Attachment url is already used to reference whatever we want - FHIR resource or not. EG: we reference Binary today with this, and would have referenced Media for patient photos (and some other scenarios). If we feel we have to add a specific field to reference FHIR Resources instead of just using url, why limit to Media? Why not Binary as well?</p>",
        "id": 153914695,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508347174
    },
    {
        "content": "<p>I'm fine if we want to make that call (if you are referencing a FHIR resource with Attachment, then use the content field, otherwise use url), I just feel like we should be consistent and not make Media the single exception</p>",
        "id": 153914697,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508347248
    },
    {
        "content": "<p>Sorry for the brain dump - trying to catch up on Zulip discussions today :)</p>",
        "id": 153914699,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508347390
    },
    {
        "content": "<p>I agree with almost everything Jenny says.   DocRef and Media IMO are not the same thing and although the intent of DocRef is to cover everything, that scope is not  clear and as I stated  in this stream somewhere the DocRef is document focused and Media is patient focused...</p>",
        "id": 153914700,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508347472
    },
    {
        "content": "<p>Jenny brings up a good point about valueAttachment as to how is it currently being used ( if at all)  links to EKGs files or similar? etc.   I proposed tossing it overboard in favor of media but then Media needs to be clear that images include more than just photos i.e.  graphs, pdfs etc...</p>",
        "id": 153914705,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508347682
    },
    {
        "content": "<p>I'll ask on implementers stream how folks are using valueAttachement</p>",
        "id": 153914706,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508347710
    },
    {
        "content": "<p>I would be happy to see a more clear distinction between Media and DocumentReference; but today there is none. I am really confused by <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> statement that \"... Media is patient focused\". What does that mean? How is DocumentReference not patient focused?</p>",
        "id": 153914749,
        "sender_full_name": "John Moehrke",
        "timestamp": 1508350834
    },
    {
        "content": "<p>Why would we want to remove \" .contentType, .title, and .creation,\" from the Attachment data type and then force someone to include a Media resource to get that information?</p>",
        "id": 153915003,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1508460003
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span>, I second your comment on notes -- really would like an appropriate resource (or guidance on use of an existing resource).<br>\n<span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>, I'm also unclear why we would remove those attributes. I think we have uses for attachment that are outside the scope of Media/Binary/DocumentReference (although some clarity on that scope will be helpful), and for those uses the attributes are needed.</p>",
        "id": 153915140,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1508517691
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>  I agree they should stay on attachment + add height/width/frame/etc. to Attachment.<br>\n<span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>   I found that after lengthy discussions in PC we really did not nail down what a note is.... In fact  I thought I knew what a note was but I came out of those discussions dazed and confused.</p>",
        "id": 153915152,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508541138
    }
]