[
    {
        "content": "<p>Each time I enter a proposed disposition on bulk data, I'm getting taken to a 2nd data entry screen (\"Categorization\") where I need to keep entering \"FHIR-I\" as the workgroup. Is this a bug, or can I somehow skip it?</p>\n<p><a href=\"/user_uploads/10155/-Qjy0-0uzvCBF13J1mVzDjZq/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/-Qjy0-0uzvCBF13J1mVzDjZq/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/-Qjy0-0uzvCBF13J1mVzDjZq/image.png\"></a></div>",
        "id": 241408735,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622734619
    },
    {
        "content": "<p>Is this still an issue?  What is the Issue number?</p>",
        "id": 241424714,
        "sender_full_name": "Melva Peters",
        "timestamp": 1622741439
    },
    {
        "content": "<p>Is this a repeated problem with the same issue or is this something you're hitting with different issues?  If different issues, have the ballot items been triaged yet?  (I have a \"to do\" to move the Work Group onto the \"propose resolution\" page when working with non-triaged issues (and probably remove it entirely for triaged issues as you should use a different mechanism to switch work groups once triaged).</p>",
        "id": 241427841,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622742624
    },
    {
        "content": "<p>It's something I hit with ~12 bulk data issues (each one I tried this morning, with <span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> )</p>",
        "id": 241449759,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622752975
    },
    {
        "content": "<p>This was during what I would have called our ballot triage session, but I'm not sure what you mean formall by \"been triaged yet\".</p>",
        "id": 241449812,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622753009
    },
    {
        "content": "<p>This is a required step when you are transitioning issues from \"submitted\" to \"triaged\" if the comment submitter has not included the responsible Work Group.  If you are doing this in one step (ie proposing disposition) on an issue that has a status of \"submitted\", then you will have to add the responsible Work Group.  Typically the Work Group is added when the issue is triaged.</p>",
        "id": 241455480,
        "sender_full_name": "Melva Peters",
        "timestamp": 1622755023
    },
    {
        "content": "<p>Melva typically triages everything except for balloted content.  When co-chairs imported ballots, they triaged as part of the import process (e.g. assigning work group, vetting that the issue was properly categorized, etc.)  However, with the new Jira ballot process, regular submitters <em>don't</em> triage.  And Melva hasn't necessarily had the bandwidth to complete triage on all the content that came in.  There's some metadata that Jira might be able to use to auto-triage (or at least auto-assign work groups) to some portion of issues, so when I find a bit of time, I'll explore that as a partial solution.</p>",
        "id": 241486321,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622776382
    }
]