[
    {
        "content": "<p>I'm trying to attach a document to this tracker: <a href=\"http://jira.hl7.org/browse/FHIR-23799\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-23799\">J#23799</a>, but it won't let me attach. Is that because I don't have rights or because it's already a resolved item?</p>",
        "id": 185156634,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1578517536
    },
    {
        "content": "<p>I tried marking it unapplied and it still wouldn't let me attach.</p>",
        "id": 185156646,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1578517546
    },
    {
        "content": "<p>Bryn, it looks like you have the permissions you need within the project.  I am not familiar with this project but have done a little poking and can tell you that based on permissions, you have what you need to apply attachments.</p>",
        "id": 185157609,
        "sender_full_name": "David Johnson",
        "timestamp": 1578518053
    },
    {
        "content": "<p>I'm wondering if the project's state of Applied stops allowing for attachments.  I'm not sure, but that's my next guess.</p>",
        "id": 185157685,
        "sender_full_name": "David Johnson",
        "timestamp": 1578518101
    },
    {
        "content": "<p>And Josh Procious is out until late next week. <span aria-label=\"sweat\" class=\"emoji emoji-1f613\" role=\"img\" title=\"sweat\">:sweat:</span></p>",
        "id": 185157722,
        "sender_full_name": "David Johnson",
        "timestamp": 1578518127
    },
    {
        "content": "<p>I suspect it's because it's resolved.  We don't allow comments or attachments to resolved items because the problem is that proponents attach stuff to resolved issues and no-one looks at it (because the issue is already 'dealt with'.  What's your use-case for attaching something to an applied item?</p>",
        "id": 185165889,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578523609
    },
    {
        "content": "<p>We missed attaching the documentation for the change, so it's just supporting documentation for what's already been applied.</p>",
        "id": 185245133,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1578597310
    },
    {
        "content": "<p>So I should re-open it, attach the document and then re-resolve it with the same vote information?</p>",
        "id": 185245161,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1578597340
    },
    {
        "content": "<p>So I did that, but that was a lot of updating. Re-opening cleared all the values, so I had to re-enter everything (which I had to parse out of the comment that saved the information). Is there anyway to make that process a little smoother? I understand (and like) not being able to attach to a closed ticket, but why does it clear all of the disposition information?</p>",
        "id": 185252530,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1578601952
    },
    {
        "content": "<p>Generally when you re-open it's because you've voted to re-open - so it copies the old disposition into a comment and allows you to vote the new disposition.</p>",
        "id": 185253450,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578602560
    },
    {
        "content": "<p>Re-opening because you need to attach something that should previously have been attached wasn't really considered in the use-cases.  My leaning there might be to just pass whatever it is to an administrator to attach if you don't want to go through the re-open/re-close.</p>",
        "id": 185253521,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578602626
    },
    {
        "content": "<p>Understood, thanks Lloyd. I'll use that process in the future (I'll actually make sure these get posted before we close :)).</p>",
        "id": 185253859,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1578602849
    }
]