[
    {
        "content": "<p>Running into the following issues for the SMART App Launch spreadsheet:</p>\n<p>Generally the upload generates lots of errors due to fields being formulas. When those fields are changed to plain text, error messages disappear.  Still left though with the following</p>\n<ul>\n<li>Column B was created with the wrong name (missing \"-\" before HL7 in F1 on the Submitter tab : \"2021-May HL7 FHIR IG SMART APP LAUNCH R2 STU\").  Per error message needs to be exactly according to the JIRA ballot desktop (\"2021-May-HL7 FHIR IG SMART APP LAUNCH R2 STU\").  Copied that to get the match expected, still not accepted.  What is the correct name?  Just to be sure, what are the other correct names for ballots that can be done with JIRA?</li>\n<li>Column I as a result also gives an error that the tracker is not tied to the correct project  Hopefully if the above is fixed, this will work.</li>\n<li>Column O could have benefitted from clarity that it should be the name on the JIRA, not the name of the submitter of the spreadsheet.</li>\n</ul>\n<p>Problems do not seem to be with what the submitter fills out, but the original template not being defined correctly.</p>",
        "id": 238571008,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1620871692
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193599\">@Lynn Laakso</span> note on the issue with Column B.  The value must be \"2021-May - HL7 FHIR IG SMART APP LAUNCH R2 STU\" - i.e. with spaces on either side of the dash following the time-period.  An exact match is needed<br>\nAgree that column I issue should go away when B is fixed.<br>\nThe 'submitter' in the spreadsheet is always the person voting.  onBehalfOf is never specified if you're referencing an existing Jira item.  If you're referencing a new item to be created, it's the person who actually has the comment - and should be the 'reporter' of the issue when it gets created in Jira.  This <em>must</em> be someone who has a Jira account.  Everyone you're gathering comments from in your organization needs to have a Jira account for you to be able to submit their comments correctly.</p>",
        "id": 238578469,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620878816
    },
    {
        "content": "<p>Thank you!  Will be checking this ouw.  Then I expect that the \"-\" issue is in play with every spreadsheet looking at my dashboard.  I'll check that out .</p>",
        "id": 238617260,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1620910734
    },
    {
        "content": "<p>I was able to upload after those adjustments.  Discovered an area in need of clarity that is that if you have after an initial upload you need to upload more, that one better not forget to remove those that already were uploaded and restart the vote number in column A.</p>",
        "id": 238668336,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1620934163
    },
    {
        "content": "<p>You don't have to restart the vote number.  If you want your numbers to be contiguous, you can just set the 'ignore warnings' flag once the \"you're not starting at one?\" is the only remaining issue.</p>",
        "id": 238671240,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620935489
    },
    {
        "content": "<p>Another template problem where the spreadsheet template contained the wrong ballot name for Column B: \"2021-May FHIR IG BULKDATA R1 STU\".  I replaced the formula and the text with \"2021-May - FHIR IG BULKDATA R1 STU\", but that did not work either.  Turns out it needed to be \"2021-May - FHIR IG BULKDATA R2 STU\".</p>",
        "id": 238821016,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1621022201
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193599\">@Lynn Laakso</span></p>",
        "id": 238821264,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621022288
    }
]