[
    {
        "content": "<p>Wouldn't it be nice to have a full dashboard for managing ballot results and reconciliation? <strong>Lets's make that happen</strong>. I am collecting feature ideas here.</p>\n<p>I had put together some dashboards for some January balloted IGs and after talking to Lloyd, found out there was an interest in creating ballot dashboards across all ballots.<br>\nHere is what I threw together:<br>\n<a href=\"https://jira.hl7.org/secure/Dashboard.jspa?selectPageId=14005\">https://jira.hl7.org/secure/Dashboard.jspa?selectPageId=14005</a><br>\n<a href=\"/user_uploads/10155/Fy6MeOy9ELH9XXkPhqsMqdTL/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Fy6MeOy9ELH9XXkPhqsMqdTL/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/Fy6MeOy9ELH9XXkPhqsMqdTL/image.png\"></a></div><p>But f we can make this official, there are a lot more backend development options.</p>\n<p>Some initial feature thoughts (made available through selectable pre-developed and configurable widgets):</p>\n<ul>\n<li>Graphical voting statistics</li>\n<li>Heatmap of reporters (reporters' organizations)</li>\n<li>Tickets submitted during ballot period without ballot votes</li>\n<li>Tickets by most votes - Find the tickets with the biggest bang or most number of interested parties</li>\n<li>Tickets by in-person requesters - aiding with in-person planning</li>\n<li>Block voting management workflow (with notifications to in-person requesters, reporters, and voters)</li>\n</ul>\n<p>Much of this is available to the Savvy Jira  user, but the idea is to make this more widely available for the many that aren't. I would also unlock capabilities not generally available through regular dashboard creation.</p>\n<p>Other ideas? Throw them in here.</p>",
        "id": 270246629,
        "sender_full_name": "Corey Spears",
        "timestamp": 1643735000
    },
    {
        "content": "<p>Obviously we'd want this to generate automatically - presumably at time of ballot approval?  Also, we'd want a link to it from the BALDEF page.  I'm not sure if we can automatically generate a link to the HL7 ballot site page or not - though it'd be nice if we could.<br>\nIf we could auto-edit the dashboard, maybe change the colors of the section headings based on whether the ballot is pending, open, in reconciliation or 'locked' (i.e. results are final and further withdrawal makes no difference)<br>\nQuick links to all voted issues, all negative issues, all in-person issues?</p>",
        "id": 270248794,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643735702
    }
]