[
    {
        "content": "<p>Sometime between this 10 am and 3 pm today, <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>  edited all the FHIR Shorthand issues that were formerly \"submitted\" changed them to \"triaged\".  Is there a way to revert that action?  Now I have lost track of which issues have really been triaged, and which haven't.</p>",
        "id": 198936607,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1590606040
    },
    {
        "content": "<p>Triaged is a function that Melva normally does for all issues - Work groups aren't expected to look at non-triaged items (and in many cases, the work group isn't even assigned).  Work-group-specific triage is generally handled by filling in 'grouping' (ready-for-vote, fit-for-teleconference, etc.)</p>",
        "id": 198937723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590606515
    },
    {
        "content": "<p>There's no way to go back to Submitted from Triaged because all that Triaged means is that the issue has a work group filled in and seems to be expressed in a sufficiently coherent way that a work group could resolve it.  (If the latter test fails, it gets assigned back to the submitter for clarification).</p>",
        "id": 198937859,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590606601
    },
    {
        "content": "<p>That makes no sense to me. Now I don't know which issues I have read and which I haven't.</p>",
        "id": 198937932,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1590606623
    },
    {
        "content": "<p>That's not what Triaged was ever for</p>",
        "id": 198937956,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590606635
    },
    {
        "content": "<p>(Same process was used when we were in gForge for 3+ years</p>",
        "id": 198938023,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590606671
    },
    {
        "content": "<p>How do you define \"triage\"? I guess in HL7 it means something other than \"put into high, medium, and low priority groups\"</p>",
        "id": 198938060,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1590606691
    },
    {
        "content": "<p>Nevertheless, given that they are all triaged, how can I tell which issues don't have suggested resolutions?</p>",
        "id": 198938276,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1590606775
    },
    {
        "content": "<p>It means ensure that the issue is appropriately categorized and is ready for WG resolution (proper issue type, proper project, proper artifact categorization, work group assigned)</p>",
        "id": 198938279,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590606776
    },
    {
        "content": "<p>Check for those without resolutions</p>",
        "id": 198938299,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590606789
    },
    {
        "content": "<p>\"resolution is empty\"</p>",
        "id": 198938316,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590606799
    },
    {
        "content": "<p>I guess it is always dangerous to assume that words mean the same thing in HL7 as in the rest of the world.</p>",
        "id": 198938690,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1590606968
    },
    {
        "content": "<p>Triage: the assigning of priority order to projects on the basis of where funds and other resources can be best used, are most needed, or are most likely to achieve success<br>\nHL7  \"triage\" : ensure that the issue is appropriately categorized and is ready for WG resolution (proper issue type, proper project, proper artifact categorization, work group assigned)</p>",
        "id": 198938840,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1590607057
    },
    {
        "content": "<p>It's the word and definition that's been in place since FHIR started using Jira and this is the first time anyone's had an issue...</p>",
        "id": 198939390,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590607310
    }
]