[
    {
        "content": "<p>What gos in the Ballot column?  It started out as the the Ballot name  \"2020-FEB - QMEXCHANGE R1 STU\"  and then I tried what was in the <code>FHIR_Ballot_def_202001</code> file ,  \"2020-Feb-&gt;QMEXCHANGE R1 STU\", to  \"2020-Feb-FHIR-us-davinci-deqm\" now I am at a loss.   UPdate it is 2020-Feb - QMEXCHANGE R1 STU which is nowhere in the ballot desktop and exists only in JIRA under the arcane search: project = \"Ballot Definition\"</p>",
        "id": 187875299,
        "sender_full_name": "Eric Haas",
        "timestamp": 1581383815
    },
    {
        "content": "<p>also the error \"Request in-person ballot value not recognized YES\" is curious?  I can hand edit those in though.</p>",
        "id": 187876407,
        "sender_full_name": "Eric Haas",
        "timestamp": 1581385465
    },
    {
        "content": "<p>I have corrected all  the issues for DEQM but one.  the row #  for each new  submitter has an error message:</p>\n<p>\"ERROR: 77. (BallotSubmission validate) You do not have permission to create issues in this project.\"</p>",
        "id": 187879063,
        "sender_full_name": "Eric Haas",
        "timestamp": 1581389258
    },
    {
        "content": "<p>So apparently I cannot upload the spreadsheet without proper rights?</p>",
        "id": 187879114,
        "sender_full_name": "Eric Haas",
        "timestamp": 1581389305
    },
    {
        "content": "<p>Welcome to the party Eric.</p>",
        "id": 187919676,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1581433538
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Eric seems to have correct permissions according to group and role. Is something getting caught elsewhere in the scripts?</p>",
        "id": 187921554,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1581434860
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> were you also experiencing permission based errors?</p>",
        "id": 187921571,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1581434881
    },
    {
        "content": "<p>Nope. mine are loading...just working to get a few more folks JIRA accounts. Thanks for checking!</p>",
        "id": 187923043,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1581435756
    },
    {
        "content": "<p>Ok, fantastic!</p>",
        "id": 187923220,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1581435861
    },
    {
        "content": "<p>The ballot column should be \"2020-Feb - QMEXCHANGE R1 STU\".  The Ballot Definition is the source of truth here.  It gets populated via a transformation from the ballot desktop, the objective of which is to make the names at least slightly less cryptic.</p>\n<p>Brett was able to successfully load on his own because, for some reason, he's listed as a Jira Administrator.  The ballot import process is requiring administrator privileges even though it shouldn't.  (Gave up digging into why after about a half day at the connectathon.)  If you send me your sheet Eric, I'll load it.  (Just double-check that all of your rows have summaries and either artifacts or pages because sometimes that check doesn't process until after it gets past the security check - again, not sure why.)</p>",
        "id": 187937614,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581444767
    },
    {
        "content": "<p>thanks Lloyd.   BTW as I mentioned: I like the friendlier processing with interactive iterative approach to updating the spreadsheet for uploading to Jira.  Thanks for that...</p>",
        "id": 187947068,
        "sender_full_name": "Eric Haas",
        "timestamp": 1581450519
    },
    {
        "content": "<p>Note to all:   Use a PC since doesn't play nice with Excel for Mac and/or Mac.</p>",
        "id": 187947369,
        "sender_full_name": "Eric Haas",
        "timestamp": 1581450665
    },
    {
        "content": "<p>Doesn't play nice how?</p>",
        "id": 187947511,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581450727
    },
    {
        "content": "<p>error on using excel xls files.   I have office 365 installed on both my machines and switching to my pc was the solution.</p>",
        "id": 187947882,
        "sender_full_name": "Eric Haas",
        "timestamp": 1581450918
    },
    {
        "content": "<p>easy fix = use a pc</p>",
        "id": 187948017,
        "sender_full_name": "Eric Haas",
        "timestamp": 1581450979
    },
    {
        "content": "<p>Yes, but the longer term plan is to have balloters load their own spreadsheets and \"use a PC\" may not be a viable solution for all balloters.  Granted, they can just post to Jira in the usual way, but if we can make changes to the generated spreadsheets that make them \"Mac-friendly\", that would be better.  (As well, I'm generating spreadsheets for the reconciliation sheets and I'm wondering if those have Mac issues too?)</p>",
        "id": 187948175,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581451076
    },
    {
        "content": "<p>I don't know if the issue is excel for mac or mac since I use 365 for both machines, but I assume is a 365 excel for mac issues.  the spreadsheet is indeed an .xls btw.  I am unable to consolidate using a mac as well so this is not only limited to upload.   I don't  think its that big an issue for most folks to find a PC, and although I haven't tried using a virtual windows machine that may work too.  I would make this a low priority and just make folks aware is pc only.</p>",
        "id": 187949006,
        "sender_full_name": "Eric Haas",
        "timestamp": 1581451490
    }
]