[
    {
        "content": "<p>I just tried uploading a comment spreadsheet for a non-FHIR ballot (in this case, the Nutrition DAM headed for the OTHER spec feedback project).<br>\nThe upload validation is rejecting the page number references the balloter provided, and insisting on Resource and HTML definitions, where this is a PDF. <br>\nAdditionally, for the spreadsheet I received with just a tracker number (OTHER-2161), I get the error [image.png]</p>\n<p>ERROR: 7. Referenced issue is not tied to the correct project.  For this ballot, issues must be recorded in the  specification feedback project.</p>\n<p>but the tracker is in the specification project.  Is there somewhere different I need to go for non FHIR ballots? <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span></p>",
        "id": 254245905,
        "sender_full_name": "Lorraine Constable",
        "timestamp": 1632245212
    },
    {
        "content": "<p>Right.  When we did the initial analysis and the various management groups weighed in on what adjustments they wanted made to the Jira process to accommodate their distinct requirements.  The decision was that section text and mandatory resource or page name would be the same across <em>all</em> product families.  So anything in page number needs to move into 'section' and you must categorize the content as per the pages defined in 'Jira'.  For the second issue, can you share the spreadsheet?</p>",
        "id": 254288757,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632263833
    },
    {
        "content": "<p>ah, yes, but there was no one to ask about the \"other\" requirements as they have no management group (maybe other than TSC) and HQ defined the project pages in Jira so there is really no way for a balloter doing a traditional ballot to find that out. I will send you the second spreadsheet - it has a couple of other  errors (specifying summary when Jira ticket described, etc). One of the spreadsheets I have referenced line numbers as the pdf provided line numbers to aid balloters. We have a mismatch between what we are sending balloters with the spreadsheets and the expectations of jira</p>",
        "id": 254378589,
        "sender_full_name": "Lorraine Constable",
        "timestamp": 1632321575
    },
    {
        "content": "<p>Agree that we should be only sending 'Jira' spreadsheets to all balloters, given that the content needs to be imported into Jira - so there shouldn't be columns for page numbers available to balloters, even if they're still balloting by spreadsheet - <span class=\"user-mention\" data-user-id=\"193599\">@Lynn Laakso</span></p>",
        "id": 254385879,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632324316
    },
    {
        "content": "<p>yes, for the ballots that are currently non Jira ballots, we are setting expectations that do not match with getting them into Jira. This is a fairly small ballot on a pdf document. I am strongly tempted to just reconcile in the spreadsheet and upload to the ballot desktop for this cycle</p>",
        "id": 254411401,
        "sender_full_name": "Lorraine Constable",
        "timestamp": 1632333857
    },
    {
        "content": "<p>You can argue with <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> on that :)</p>",
        "id": 254412637,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632334392
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191408\">@Lorraine Constable</span> if you would like to propose a different structure for the related sections and related pages for the Nutrition DAM, we can change it in Jira.  We tried to get this into JIRA so that the imports could be done.  Going forward, the owing WG will need to take responsibility for the creation of the files in Github that populate Jira.</p>",
        "id": 254419490,
        "sender_full_name": "Melva Peters",
        "timestamp": 1632336960
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> The key problem is the mismatch between the spreadsheets that are sent to balloters and the requirements of the import process. So they provide identification based on what we asked for on the spreadsheet, not what we actually want for Jira. The current rules are not well suited to pdf type specs. The product family management groups are all transitioning to web based specs but we did not really think through the \"other\" category well</p>",
        "id": 254422388,
        "sender_full_name": "Lorraine Constable",
        "timestamp": 1632338170
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191408\">@Lorraine Constable</span> We will make sure make sure the correct spreadsheet is provided for January.</p>",
        "id": 254422514,
        "sender_full_name": "Melva Peters",
        "timestamp": 1632338237
    }
]