[
    {
        "content": "<p>Couple of questions:</p>\n<ul>\n<li>Can I link my vote to multiple people (e.g., within our organization to everybody who entered JIRA votes)?  It appears to only allow linking to one.  Anything beyond that you would have to go to every JIRA and vote individually.</li>\n<li>Will votes submitted by the person you linked to AFTER you linked to that person also be included in your vote?  Or do you have to wait until the person you linked to entered all of their JIRAs/vote?</li>\n</ul>",
        "id": 236899840,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1619816036
    },
    {
        "content": "<p>You can only link to one.  This mirrors the past behavior of \"see comments submitted by X\".  HL7 has never (to my knowledge) supported a \"see comments submitted by X and Y\" capability.  However, the voter you point to could certainly vote on comments submitted by multiple people - and everyone who linked to that voter would be treated as having voted on the same issues.</p>\n<p>The process is that once you link, your overall vote automatically changes as the linked-to submission changes.  When the ballot closes and the individual submissions are transitioned to 'closed', anyone who voted \"same as\" will automatically have all of the detailed vote comments of the original voter cloned into their submission.  In short - only constraints on timing of establishing the linkage are:</p>\n<ul>\n<li>must happen after the \"linked to\" submission has a vote of some kind (simplest is for them to abstain shortly after the ballot opens)</li>\n<li>must happen before the ballot closes<br>\nLinked submissions will be identical to the submissions they're linked to once the ballot closes</li>\n</ul>",
        "id": 236909165,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619819694
    },
    {
        "content": "<p>(And thanks for the questions)</p>",
        "id": 236909170,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619819701
    },
    {
        "content": "<p>In the old format that worked as folks entered JIRAs, then put the link in the spreadsheet, one votes, rest states \"see .....\".  Question is if we were to enter JIRAs by various folks, don't vote, include the link in the spreadsheet with the vote, one person uploads while the rest links their vote to that person, would the work, or must the spreadsheet now contain everything, not just a link with vote?</p>",
        "id": 237406396,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1620165202
    },
    {
        "content": "<p>Link with the vote will work fine.  Also, only one person needs to submit the spreadsheet - everyone else can link their vote to the 'primary' voter so long as that voter submits an abstain or something before the other organizational voters try to link.</p>",
        "id": 237407439,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620165706
    },
    {
        "content": "<p>Can you \"still\" just enter a link to the JIRA in the spreadsheet with vote?  Or in the new flow a spreadsheet is a complete alternative to JIRA (not mixed)?  We're trying to figure easiest with the least amount of duplicative voting.  Linking to multiple voters if you want to go pure JIRA would actually be the easiest.</p>",
        "id": 237410695,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1620167481
    },
    {
        "content": "<p>The spreadsheet can still just include issue #, vote and voter.  And you can use both the spreadsheet approach and linked voters together.</p>",
        "id": 237412546,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620168506
    },
    {
        "content": "<p>How can I view who is linked to my vote?  In our organization voters are supposed to link to my vote, but not sure how to validate they have done so.</p>",
        "id": 237676359,
        "sender_full_name": "F. Hall",
        "timestamp": 1620314083
    },
    {
        "content": "<p>You can go to the Ballot Submission Project and find the ballot submission for the voters in your organization and look to see if they are linked and who they are linked to.</p>",
        "id": 237679044,
        "sender_full_name": "Melva Peters",
        "timestamp": 1620315083
    }
]