[
    {
        "content": "<p>I tried to create a ticket just now, and got a message, \"Error finding specification - contact webmaster\".  I also noticed that the lists for the fields \"Related Artifact\" and \"Related Page\" did not load.   I opened a new tab to try again, and this time the left side-bar did not load (when just browsing an issue).</p>",
        "id": 236163945,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1619439940
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196484\">@Joshua Procious</span></p>",
        "id": 236188421,
        "sender_full_name": "Melva Peters",
        "timestamp": 1619449147
    },
    {
        "content": "<p>I'm taking a look now <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> . Thanks for the ping on this</p>",
        "id": 236192025,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1619449912
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span>  I'm assuming this is for the FHIR Specification feedback project. What issue type were you attempting to create a ticket with? I'm seeing normal functionality on this end as of now</p>",
        "id": 236194223,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1619450527
    },
    {
        "content": "<p>The problem only happens from Firefox on one of my computers.  I was able to create an issue from a second computer, using Firefox.  On the first computer, the Dashboard page is mostly blank, and there are uncaught exceptions in the console.  I tried clearing cookies, and doing shift+reload, but nothing helped.  I guess there is some issue with my Firefox profile, but other sites (like this one) are fine.  Anyway, I can just create issues on the other computer.</p>",
        "id": 236212369,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1619458009
    },
    {
        "content": "<p>The only thing I can hypothesize is that there's some sort of security issue keeping Jira from accessing the dropdown file with your one browser.  Is the one machine in a tightly firewalled environment?  Does it have limitations on the ability to run Javascript?</p>",
        "id": 236213011,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619458261
    },
    {
        "content": "<p>If both computers on the same network, suggest compare Firefox configurations on the Firefox applications tab - popup or site blocker, etc?   Can usually apply a site exception to prevent such issues.</p>",
        "id": 236223719,
        "sender_full_name": "Peter Muir",
        "timestamp": 1619462629
    },
    {
        "content": "<p>Okay, now I am getting problems on the other computer as well, and on both Chrome and Firefox.  When I do a search for issues, the list of issues appears but is grayed out, and the console shows a 500 server error from a network request.<br>\n<a href=\"/user_uploads/10155/mYwN6IliZMgIuM19RvkPJy9I/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/mYwN6IliZMgIuM19RvkPJy9I/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/mYwN6IliZMgIuM19RvkPJy9I/image.png\"></a></div>",
        "id": 236227308,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1619464120
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196484\">@Joshua Procious</span></p>",
        "id": 236232222,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1619466373
    },
    {
        "content": "<p>Oh, if you're doing search, that's normal.  You can't filter by specification unless you've first filtered by project and issue type.  I believe the documentation already describes that limitation.</p>",
        "id": 236240262,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619470139
    },
    {
        "content": "<p>I was using the search box in the blue bar at the top.  I was not filtering by anything.  The search results are not selectable.  Surely that is not normal?</p>",
        "id": 236245401,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1619471691
    },
    {
        "content": "<p>That's normal.  You have to specify some filters before the others become 'enabled'</p>",
        "id": 236255165,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619476554
    },
    {
        "content": "<p>It's not \"nice\", but it is how the Jira plugin we're using works.</p>",
        "id": 236255218,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619476570
    },
    {
        "content": "<p>It is not the filters that are not enabled, but the search results.  I cannot click on any of the issues listed in the results panel.  Are you saying the blue search box at the top cannot be used?  I am pretty sure I have used that before.</p>",
        "id": 236256690,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1619477516
    },
    {
        "content": "<p>Ok, that has nothing to do with the Jira extensions.  I tried your same search and had no issue.  Any chance of network issues?</p>",
        "id": 236262884,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619481441
    },
    {
        "content": "<p>That was from my laptop.  I have tried disconnecting from our VPN, and I get the same result (from Firefox, Edge, and Chrome). I think it probably has something to do with the 500 server error.  That indicates an error in processing a request on the server.  When I search using the blue bar's search box, it takes me to this URL:  <a href=\"https://jira.hl7.org/browse/FHIR-22680?jql=text%20~%20%22cqf-expression%22\">https://jira.hl7.org/browse/FHIR-22680?jql=text%20~%20%22cqf-expression%22</a> .  The search list items are not selectable there.  I am not sure why it picks that particular issue for the URL when I was doing a search.  (It takes me there even if I search from the dashboard.)</p>",
        "id": 236370703,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1619541796
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196484\">@Joshua Procious</span> Do you have time to work w/ Paul to debug?</p>",
        "id": 236380163,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619545809
    },
    {
        "content": "<p>Yes. <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span>  Have you tried clearing all cookies/cache for anything related to <a href=\"https://jira.hl7.org\">https://jira.hl7.org</a> and <a href=\"https://confluence.hl7.org\">https://confluence.hl7.org</a>?</p>",
        "id": 236386604,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1619548238
    },
    {
        "content": "<p>Usually when we see that activity of selecting a particular issue it's due to a bad cache. Additionally, there were some recent significant Microsoft updates to client devices as well as Chrome's updating. Can you please ensure that your browser is up to date as well as your PC?</p>",
        "id": 236387144,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1619548441
    },
    {
        "content": "<p>Clearing cookies and the cache did not solve the problem.  Updates for Windows laptop are managed by my employer; I don't have control over that.  However, I did just try from my own personal laptop (a Mac), and got the same issue (using Firefox).  Have you tried going to <a href=\"https://jira.hl7.org/browse/FHIR-22680?jql=text%20~%20%22cqf-expression%22\">https://jira.hl7.org/browse/FHIR-22680?jql=text%20~%20%22cqf-expression%22</a> ?</p>",
        "id": 236411695,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1619558249
    },
    {
        "content": "<p>FWIW, pasting the URL into FF (on Windows) brought up a grayed out list as I was logged out, but as soon as I logged in, everything seems to work. Could there be problem with your Confluence/Jira account?</p>",
        "id": 236413343,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1619558802
    },
    {
        "content": "<p>I was not logged in.  Yes, it works again now that I have logged in.  When I first reported this issue, I was logged in, as the screenshot above shows, but now it works if I am logged in.  It is odd that the search box works, and shows search results that you can't click on, without mentioning that you have to log in to click on them.</p>",
        "id": 236414398,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1619559269
    },
    {
        "content": "<p>That's not a Firefox specific issue - it's a problem with Chrome too when I run the search in an incognito window (i.e. not logged in).  <span class=\"user-mention\" data-user-id=\"196484\">@Joshua Procious</span> I'm pretty sure this wasn't an issue a year ago when I tried checking to make sure non-logged-on users could still search and look at issues - though my ability to remember more than a week ago is suspect.  Are you able to find out if this is expected behavior or if we've got something wonky with our config?</p>",
        "id": 236421137,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619563248
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  yes, I will look into this and I'll let this stream know when I verify.</p>",
        "id": 236499679,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1619613820
    },
    {
        "content": "<p>Now I am getting this issue even when logged in.  I can't click on any search results, in Firefox or Chrome, whether I am logged in or not.  Work-around:  Right click on the gray rectangle and use the \"Inspect\" option to view the structure of the page, and delete the div with class=\"loading\".</p>",
        "id": 237888764,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1620420976
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196484\">@Joshua Procious</span></p>",
        "id": 237891611,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620422307
    }
]