[
    {
        "content": "<p>Shortly, the v2MG will be debuting a draft of something we are calling v2+. Among other things this will be a new way to access the content of the v2 base standard though the web (no more PDFs or Word documents). Now that v2 is collecting comments in Jira, we need to add v2+ to the config files. While the content of v2 standard will not significantly change, the organization will be different and some of the pages may only apply to either v2.x or v2+ but not both. I'm wondering if we should split v2.x and v2+ into different specs or if v2+ should just be another version of the v2core spec to choose from. Thoughts or suggestions?</p>",
        "id": 218878011,
        "sender_full_name": "Craig Newman",
        "timestamp": 1607108909
    },
    {
        "content": "<p>Do you expect to make ongoing changes to the old v2.x publications?</p>",
        "id": 218881154,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607110568
    },
    {
        "content": "<p>Perhaps some technical corrections, probably nothing more than that.</p>",
        "id": 219077462,
        "sender_full_name": "Craig Newman",
        "timestamp": 1607346733
    },
    {
        "content": "<p>Do you think that the artifacts and page names for v2+ will be \"good enough\" to let people submit issues wrt v2+?  If so, there's a lot of simplicity in having a single spec.</p>",
        "id": 219084356,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607350540
    },
    {
        "content": "<p>Would something like \"HL7v2 messaging\" cover both v2+ and the older v2.x specs?</p>",
        "id": 219086697,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1607351671
    },
    {
        "content": "<p>I think we're leaning towards splitting up the v2.x and the v2+ in Jira so that we can provide a better experience for people commenting on v2+ and to reinforce that this is a bit of a break from the previous method of publishing v2</p>",
        "id": 219096212,
        "sender_full_name": "Craig Newman",
        "timestamp": 1607356062
    },
    {
        "content": "<p>You definitely want to tune for v2+.  The question is whether there's sufficient bang for the buck (and whether it's worth the confusion) to also have a Jira spec for 'legacy' v2.</p>",
        "id": 219096627,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607356232
    },
    {
        "content": "<p>We expect that v2+ will evolve over time but we don't know exactly what that will look like at this time. I'm wondering what we should use as a version for this initial feedback phase. It looks like FHIR Core at one point has an \"initial draft\" version. Would that be a good place to start for v2+ for pre-publication comments?</p>",
        "id": 219852605,
        "sender_full_name": "Craig Newman",
        "timestamp": 1607957943
    },
    {
        "content": "<p>Yes</p>",
        "id": 219854717,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607958819
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - if you're reluctant to add v2+ as a distinct spec, how do you suggest handling the fact that the pages (and possibly the artifacts to a lesser extent) may be very different for the old PDF publication and the new web publication?</p>",
        "id": 219880946,
        "sender_full_name": "Craig Newman",
        "timestamp": 1607969906
    },
    {
        "content": "<p>Are you essentially punting the notion of 'chapters' in v2+?  If so, you can still have pages for each chapter and, when you no longer want to accept technical corrections against those, you can mark them as 'deprecated'.</p>",
        "id": 219884828,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607971674
    },
    {
        "content": "<p>The web version will have domain areas which roughly correspond to the chapters as they are in v2.x but they'll be broken down into subpages and I don't think they'll be labeled the same way.</p>",
        "id": 219886890,
        "sender_full_name": "Craig Newman",
        "timestamp": 1607972574
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193599\">@Lynn Laakso</span> - are there any ANSI restrictions that would require v2.x and v2+ being the same core spec in JIRA?<br>\n<span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>  - do you have thoughts on whether or not v2.x and the new web published version (v2+) should be the same specification in JIRA? The v2MG thinks it would be easier for commenters if they were distinct specs as it's a relatively radical change in the organization and publication of the content, but Lloyd has concerns with this.</p>",
        "id": 219887201,
        "sender_full_name": "Craig Newman",
        "timestamp": 1607972701
    },
    {
        "content": "<p>oh good heavens no</p>",
        "id": 219887670,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1607972914
    },
    {
        "content": "<p>If a user wants a change in V2, will they comment on V2.x or V2+?</p>",
        "id": 219901864,
        "sender_full_name": "Melva Peters",
        "timestamp": 1607979920
    },
    {
        "content": "<p>One way to address this is to only allow technical corrections to V2.x and limit change requests to V2+</p>",
        "id": 219902350,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1607980166
    },
    {
        "content": "<p>The tool can't do that, though policy can.</p>",
        "id": 219902959,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607980526
    },
    {
        "content": "<p>Once v2+ is officially published, I would expect most tickets would be logged against v2+. Certainly all enhancement requests would. If there is an error is in v2+ (and earlier versions) I think it would be logged against v2+. If the error is only in earlier versions (that is v2+ corrected it), then I think it would be logged against v2.x.</p>",
        "id": 219985293,
        "sender_full_name": "Craig Newman",
        "timestamp": 1608042150
    },
    {
        "content": "<p>I understand that's what you would <em>like</em> to happen.  Do you think we can reasonably expect most implementers to do that?  Will they differentiate and see the specs as two different things?</p>",
        "id": 219993013,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1608045490
    },
    {
        "content": "<p>Given that the use of Jira for v2 is brand new (we only have 24 tickets so far and I think I wrote 18 of them) I don't know what to expect. Can we reasonably expect commenters to sort through a set of pages that contain content from two the two types of specs and select the right one?</p>",
        "id": 220116714,
        "sender_full_name": "Craig Newman",
        "timestamp": 1608126517
    },
    {
        "content": "<p>That's my question.  If they can't, you're setting yourself up for an ongoing need to move issues from one spec to the other forevermore. (which will also involve re-choosing the artifacts and/or pages identified).</p>",
        "id": 220138050,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1608136139
    },
    {
        "content": "<p>Lloyd, that would be the V2MG’s concern, but your assumption is that v2 users don’t know what they’re commenting on, and what instead we are saying is that when someone looking at V2+ comments on Jira, they’re looking for V2+, not for V2.x. The “artifacts” are different. The V2MG has decided to move in this. Please help us achieve what the V2MG needs. Thanks</p>",
        "id": 220377187,
        "sender_full_name": "Amit Popat",
        "timestamp": 1608301472
    },
    {
        "content": "<p>Hi Lloyd - balloting with jira is new to V2 folks, so if they are going in there to ballot on V2+ and don't see it, they will be confused - in the long run as Craig points out, most changes will be on the V2+ specification (except for corrections maybe, though I would imagine they show up in V2+ as well). As a rule I would think folks that read pdf chose V2.x specification (based on chapters) while V2+ readers will comment based on the artifact more specifically (since we no longer have chapters). If we find that having both is a big issue in the future, we may revisit, but we don't expect that to be the case.</p>",
        "id": 220380508,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1608303135
    },
    {
        "content": "<p>Revisiting in the future won't really be possible.  Once you create 2 specs, and people have started to capture data, you won't easily be able to move back together.</p>\n<p>However - I have now merged the pull request.  So two specs it is :)</p>",
        "id": 220388730,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1608306947
    }
]