[
    {
        "content": "<p>Is it possible to get reporters in membersOf(foo)  where foo is a group of all people with email address containing \"@example.org\"<br>\nFor the ballot, we may have several people from our organization submitting Jira tickets, but a fewer number of people are allowed to vote, so we want to find Jira ticket numbers reported by non-voting members of our organization and add them to a ballot vote spreadsheet (on behalf of functionality).</p>",
        "id": 185649491,
        "sender_full_name": "Paul Denning",
        "timestamp": 1579041838
    },
    {
        "content": "<p>Yes, that's something we could theoretically write a custom search function for, though it has some privacy implications we'd need to think through and it's probably not something we'll have the time to write any time soon.  In the short term, for organizations that want this, what we'd probably do is run a quick report of all user ids that have the appropriate email suffix and you could then do an 'in' search that lists all of those users.  <span class=\"user-mention\" data-user-id=\"193599\">@Lynn Laakso</span> <span class=\"user-mention\" data-user-id=\"196484\">@Joshua Procious</span>, opinions?</p>",
        "id": 185653689,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579045243
    },
    {
        "content": "<p>Josh returns tomorrow from vacation I will wait for his input. I don't have that skill set in Jira.</p>",
        "id": 185699803,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1579097068
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"194174\">@Paul Denning</span> , I agree with Lloyd. I'd be happy to return you a JQL query which will return all issues reported by users associated by domain (one you are affiliated with). Please feel free to send me the domain at your convenience! (either PM here or <a href=\"mailto:joshua@hl7.org\" title=\"mailto:joshua@hl7.org\">joshua@hl7.org</a>)</p>",
        "id": 185849723,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1579202619
    }
]