[
    {
        "content": "<p>I'm importing FHIRCast ballot issues for Isaac.  I got the error <code>ERROR: 77. (BallotSubmission validate) You do not have permission to create issues in this project.</code>  What do I need to do to be able to import these?</p>",
        "id": 187234246,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1580705063
    },
    {
        "content": "<p>Magic, unfortunately.  Jira is enforcing your permissions even though the import process is using admin privileges.  Double check that you've got a page or artifact on each one and if you have and it runs clean other than the \"you don't have permission\", send it to me and I'll run it for you.  I spent about half a day chasing it this morning and got no-where.  I'll continue to chase, but in the meantime, I can at least get your stuff loaded for you.</p>",
        "id": 187234944,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580706466
    },
    {
        "content": "<p>Ah, it looks like I do <strong>not</strong> have page numbers or artifact IDs.  I'll look into that.</p>",
        "id": 187309915,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1580767395
    },
    {
        "content": "<p>One potentially interesting note: I don't get that error for every row in the sheet; I get it for the first row for each unique commenter.</p>",
        "id": 187309955,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1580767432
    },
    {
        "content": "<p>Is it possible it's applying the security of the commenter rather than the security for my account and/or the import process itself?</p>",
        "id": 187310039,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1580767492
    },
    {
        "content": "<p>It's creating a new ballot submission for the balloter.  Only does that once per balloter.  It's not applying the security of the commenter because at the time it's doing the permission check it thinks the commenter is jiraadmin.</p>",
        "id": 187310599,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580767920
    },
    {
        "content": "<p>It's very definitely determined by the authority of the person who's running the process.  When I run it as someone who's only trusted, if fails.  When I run it as an admin, it succeeds.  Haven't figured out why.</p>",
        "id": 187310695,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580767985
    },
    {
        "content": "<blockquote>\n<p>Double check that you've got a page or artifact on each one...</p>\n</blockquote>\n<p>I don't know what makes sense for these.  </p>\n<ul>\n<li>It isn't a PDF, so there isn't a page number.</li>\n<li>I don't believe FHIRCast has named HTML pages.</li>\n<li>Artifact looks like it's specific to V3.</li>\n</ul>\n<p>I put in <code>(NA)</code> in the <code>HTML Page name(s)</code> column; it didn't error on that column, but I still got the \"You do not have permission...\" error.</p>",
        "id": 187316364,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1580772279
    },
    {
        "content": "<p>If there isn't anything else I can do to make this work, here's the sheet, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\n<a href=\"/user_uploads/10155/A8v9ySPlSAnYI3qaK9U5m7hG/FHIR_IG_FHIRCast_R1_D2_2020FEB_Amalgamated-msd-08.xls\" target=\"_blank\" title=\"FHIR_IG_FHIRCast_R1_D2_2020FEB_Amalgamated-msd-08.xls\">FHIR_IG_FHIRCast_R1_D2_2020FEB_Amalgamated-msd-08.xls</a></p>",
        "id": 187316468,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1580772367
    }
]