[
    {
        "content": "<p>Are there any guidelines for configuring non-web based specifications in the \"Other specification feedback\" project? Now that the Consent Management Service Functional Model has been published, my last task is to set that up (I have a DAM in the queue as well). Most of the configuration instructions I read in confluence seem to assume a web based publication. Do I use the product brief page as the root URL, for eg? Can I set internal sections of the doc as separate artifacts? etc. <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 249779605,
        "sender_full_name": "Lorraine Constable",
        "timestamp": 1629234804
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191408\">@Lorraine Constable</span>for the root URL, use the product brief URL.  Yes, you can use the internal sections as separate artifacts.  You can look at what was done for the specifications that exist in the \"Other\" Specification Feedback Project.</p>",
        "id": 249780147,
        "sender_full_name": "Melva Peters",
        "timestamp": 1629235045
    },
    {
        "content": "<p>BTW, this note on the Configuration page should probably be updated or removed:<br>\nNOTE: The structure of the Git project are set up to support artifacts from all product families.  However, at present, only FHIR has a Specification Feedback project.  Other product families should not use Jira for issue tracking until the appropriate tracker has been set up and approved for use by the Technical Steering Committee.</p>",
        "id": 249781638,
        "sender_full_name": "Lorraine Constable",
        "timestamp": 1629235841
    },
    {
        "content": "<p>Also, are there naming conventions I need to follow listed somewhere?</p>",
        "id": 249781945,
        "sender_full_name": "Lorraine Constable",
        "timestamp": 1629235997
    },
    {
        "content": "<p>The name displayed in Jira needs to be one that the community understands and it is clear what specification is being referred to.  I'll update the page.</p>",
        "id": 249782884,
        "sender_full_name": "Melva Peters",
        "timestamp": 1629236587
    },
    {
        "content": "<p>I was more referring to key names, etc, but I think I have worked it out</p>",
        "id": 249783171,
        "sender_full_name": "Lorraine Constable",
        "timestamp": 1629236772
    },
    {
        "content": "<p>key names can be whatever you wish - but once established, can't change (regardless of what you do to the artifact names)</p>",
        "id": 249794588,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629245619
    }
]