[
    {
        "content": "<p>This is a low priority request, but is there a way to prevent JIRA from timing out so often? Every time I go back I have to log back in, often resulting in lost work :(</p>",
        "id": 187939297,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1581445692
    },
    {
        "content": "<p>If you told it to remember your login information, it seems to time-out near continuously.  If you clear all your jira-related cookies, it gets better.  <span class=\"user-mention\" data-user-id=\"196484\">@Joshua Procious</span> was going to investigate when he had a bit of bandwidth</p>",
        "id": 187939546,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581445838
    },
    {
        "content": "<p>(y)</p>",
        "id": 187939816,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1581446009
    },
    {
        "content": "<p>I'm looking into it this week. I'll relay here what I find.</p>",
        "id": 188008964,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1581513723
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> et all, thanks for your patience on this. So from Jira/Confluence/Crowd (user management software that handles SSO between Jira/Confluence) the timeout of user sessions is set to 100 minutes. All restrictions/logs seem to back this up as happening appropriately. There is one restriction (that I can currently see) that can invalidate sooner and that is an IP change. Bryn, are you still experiencing this still and if so is it possible your IP is changing?</p>",
        "id": 189124143,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1582730793
    },
    {
        "content": "<p>It's not just him.  I'm having to re-login almost every time (at least once a day) despite setting the Remember Me flag.  Mind you I only have to hit the Login link on the page but it's a pain anyway.</p>",
        "id": 189124339,
        "sender_full_name": "David Pyke",
        "timestamp": 1582730917
    },
    {
        "content": "<p>Ok, so in this case if it is once per day, perhaps the 100 minute setting is too low.</p>",
        "id": 189124806,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1582731174
    },
    {
        "content": "<p>I've changed it to 300 minutes to avoid unnecessary re-logins for same day working.</p>",
        "id": 189124933,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1582731247
    },
    {
        "content": "<p>My experience is that \"remember me\" causes logins to have to happen almost every time - I'm wondering if it creates issues between Jira and Confluence?</p>",
        "id": 189129893,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582734140
    },
    {
        "content": "<p>Well, Crowd manages all session tokens and the \"remember me\" function. Have you had to login today Lloyd? (i'm guessing your \"remember me\" setting is still off)</p>",
        "id": 189130259,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1582734361
    },
    {
        "content": "<p>It is - because it bit me so much before.  Had to wipe cookies to correct the problem.  I can try again if you want me to though</p>",
        "id": 189130779,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582734608
    },
    {
        "content": "<p>yes please do and then i'll check logs</p>",
        "id": 189130815,
        "sender_full_name": "Joshua Procious",
        "timestamp": 1582734623
    },
    {
        "content": "<p>FWIW, this behavior has actually improved for me recently. I know that's subjective, I don't have any real data, but I find JIRA keeping me logged in more often lately.</p>",
        "id": 189152474,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1582747091
    }
]