[
    {
        "content": "<p>One of the new few features of Jira is that it sends out a weekly email of any issues that have your user account associated with the issue as \"waiting for input\".  Once you log into Jira, you can select the workflow option \"provide input\" which will let you provide a comment and will automatically transition the issue back to 'Triaged'.  (If you just provide a comment and <em>don't</em> click the 'provide input' link, the status will remain 'waiting for input' and you'll continue to get weekly reminders.</p>\n<p>Also note that waiting-for-input can only be tied to one assignee at a time and must be a registered Jira user.</p>",
        "id": 181006409,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574075562
    },
    {
        "content": "<p>log in to Jira...</p>",
        "id": 181006448,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574075607
    },
    {
        "content": "<p>:)  Fixed.  It's going to take a while for the neurons in my head to get appropriately re-wired...  (Speaking of wiring, in the minutes for my last scouts meeting, I noted that we're going to practice with FHIR extinguishers :&gt;)</p>",
        "id": 181006757,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574075876
    },
    {
        "content": "<p>The transition to \"Waiting for Input\" when assigning an 'open' issue is by design.  The only reason to assign unresolved items to an individual is to solicit input.  Assigning an item once it's been closed will not transition to waiting for input</p>",
        "id": 181580308,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574367619
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span></p>",
        "id": 181580475,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574367730
    },
    {
        "content": "<p>so, I assigned a \"Triaged\" issue to a member of the workgroup, knowing that they would need to propose a resolution</p>",
        "id": 181585275,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1574371024
    },
    {
        "content": "<p><em>when</em> I assigned the \"Triaged\" issue to someone, it transitioned it automatically to \"Waiting for input\"</p>",
        "id": 181585294,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1574371045
    },
    {
        "content": "<p>I would think it should stay \"triaged\"...</p>",
        "id": 181585308,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1574371056
    },
    {
        "content": "<p>I had this same confusing problem on Monday.  I thought I had done something wrong because all I did was add a comment and assign the issue to myself.  It automatically went to \"Waiting for Input\" when I expected it to stay at Triaged.  I believe (although I may be confused) that a Resolved issue also moved to Waiting for Input when I assigned it to Melva to do the work.</p>",
        "id": 181585563,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1574371216
    },
    {
        "content": "<p>If they need to propose the resolution, then the item is waiting on input from that individual.  They will receive weekly email reminders of their need for action (whatever it is).  As soon as they indicate that feedback has been provided (in this case, a proposed resolution), the item will return to triaged, meaning it's ready for work group (rather than individual) action/review.</p>",
        "id": 181590365,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574374786
    },
    {
        "content": "<p>Any item that has a status of \"Resolved - Change required\" that is assigned to someone should <em>not</em> change the status.  (If this happens, please holler).  No other resolved status should allow assigning an assignee.</p>",
        "id": 181590448,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574374836
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> What was the reason for assigning the unresolved issue to yourself?</p>",
        "id": 181590467,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574374856
    },
    {
        "content": "<p>is it possible to see the edit history of an item?  I know the two items that I saw this on, but I can't remember the sequence of what I was doing (to see if I did something wrong or not)</p>",
        "id": 181590756,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1574375053
    },
    {
        "content": "<p>There's a history tab at the bottom</p>",
        "id": 181590988,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574375252
    },
    {
        "content": "<p>(Alternate tab with 'comments')</p>",
        "id": 181591067,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574375292
    }
]