[
    {
        "content": "<p>Hi. I am working on a project in which there are two SQL databases in Azure, one to concentrate data from several external systems with a bit of preprocessing and another that is dimensionally modeled to facilitate the analysis of the business, which It consumes the data directly from the first database. The entire ETL process is being carried out through Azure Data Factory. Finally, Power BI is used to create different reports according to the needs of the business having as source the second database.</p>\n<p>The problem is that now the external systems that had their data in SQL relational databases are now migrating to FHIR servers, which means that the ETL process changes completely as does the structure of our databases. On the other hand, Power BI, which is the data analysis tool that we must use, does not yet have integration with FHIR. I would like to know under these conditions and taking into account that we consider the performance important, which are the edges that are currently being used in these cases. Maybe if you know some references that can help us would be great.</p>",
        "id": 160235700,
        "sender_full_name": "Andy Sanchez",
        "timestamp": 1551991336
    },
    {
        "content": "<p>I’d suggest an intermediate format like FHIR in ndjson but last time I tried it Power BI didn’t parse it on import. Azure SQL appears to have json support as strings which you could use to store FHIR then query. It’s not as elegant as FHIRbase which uses binary blobs but just a test. Sorry if those suggestions are not helpful.</p>",
        "id": 160290013,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1552052752
    },
    {
        "content": "<p>Thanks Richard</p>",
        "id": 160314092,
        "sender_full_name": "Andy Sanchez",
        "timestamp": 1552070697
    },
    {
        "content": "<p>PowerBI desktop now has a FHIR connector. I tested with MS FHIR API so it might work.</p>",
        "id": 191288793,
        "sender_full_name": "Geoff Williams",
        "timestamp": 1584731256
    }
]