[
    {
        "content": "<p>new here and looking for others who might be storing data in a native graph database. (Dgraph, Neo4j, Neptune, etc.) It seems like a good use for a graph database from my perspective because data is highly connective. Thoughts or Experiences?</p>",
        "id": 246654430,
        "sender_full_name": "Anthony Master",
        "timestamp": 1626816943
    },
    {
        "content": "<p>There were few experiments -  <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span> ? I personally do not think this is  \"a good match\", because other scenarios like searches and aggregates does not work well in graph databases.</p>",
        "id": 247910161,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1627903391
    },
    {
        "content": "<p>I've never got far with the experiments, I personally also have never heard from anyone using it in production. I agree with <span class=\"user-mention\" data-user-id=\"191318\">@nicola (RIO/SS)</span> that for most purposes a document or relational database is already a good match. All FHIR search related queries can be expressed in a sufficiently optimised way.</p>",
        "id": 247921428,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1627912040
    },
    {
        "content": "<p>Are there any performance evaluation concerning query times for FHIR engines ? FHIR search is very limited concerning the modeling capabilities of queries representing complex graph like queries. CQL would be a better candidate for that. Although there exist almost no CQL engines. I would be interested to see query time measurements of the Blaze server which can handle CQL.</p>",
        "id": 248316882,
        "sender_full_name": "Georg Fette",
        "timestamp": 1628060616
    },
    {
        "content": "<p>I'm analyzing this Asymmetrik source to decide if It's a good idea to base my project on:<br>\n<a href=\"https://github.com/Asymmetrik/node-fhir-server-mongo\">https://github.com/Asymmetrik/node-fhir-server-mongo</a><br>\nThe thing is they used mongo.<br>\nWhich is faster than SQL options but it has it's own limitations when it comes to querying. Things like Join query and so on ...<br>\nSo I may want to change its data source Postgres. </p>\n<p>The question is:<br>\nShould I design a SQL schema based on FHIR and then use it in the project?<br>\nOr the Asymmetrik library has something to make it easier?</p>",
        "id": 264613419,
        "sender_full_name": "Sajad Asadi",
        "timestamp": 1639301299
    },
    {
        "content": "<p>Are there any FHIR db design examples out there?</p>",
        "id": 264613433,
        "sender_full_name": "Sajad Asadi",
        "timestamp": 1639301343
    },
    {
        "content": "<p>Or any guide about how to create a FHIR db especially something that works with Asymmetrik library?</p>",
        "id": 264613597,
        "sender_full_name": "Sajad Asadi",
        "timestamp": 1639301613
    }
]