[
    {
        "content": "<p>Yesterday I've been asked how we plan to address the endpoint discovery/findability of FAIR data by using FHIR...<br>\nThis might be one of the first possible topics we could try to discuss :-)</p>",
        "id": 219577523,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1607676470
    },
    {
        "content": "<p>As you know one of the foundational principle of FAIR is the findability, that is, FAIR data should be easy to find for both humans and computers. Machine-actionable metadata play in FAIR a relevant role to enable the automatic discovery of relevant datasets and services...but turning this principle in FHIR can imply different things..</p>",
        "id": 219577602,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1607676504
    },
    {
        "content": "<p>If I try to figure out this may work I see three main possible approaches:<br>\n1) The 'simplest one' is \"well-known\" FHIR servers: the FHIR server(s) to be queried are somehow known and FAIR (meta)data are published in that/those \"known\" server(s).</p>",
        "id": 219577687,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1607676568
    },
    {
        "content": "<p>2) A second case may be a sort of special case of the 1st one (could we call it FHIR registry ?)<br>\nA well known FHIR server manages the FAIR metadata (To be clarified what does it mean in practice), that may act as gateway to access other FHIR servers where the FAIR data are stored.</p>",
        "id": 219577772,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1607676605
    },
    {
        "content": "<p>3) A third case might be a federation of these \"registries\" (whatever the federation could mean)</p>",
        "id": 219577789,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1607676618
    },
    {
        "content": "<p>Might be this classification a starting point ? Any suggestion ?<br>\nIf so, we could try to analyze each case identifying known limitations, issues to be resolved, advantages, available solutions we can refer to,...</p>",
        "id": 219577824,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1607676649
    },
    {
        "content": "<p>How global, unique, persistent and (machine) resolvable are the identifiers of the FHIR standards? Is it useful to view the FHIR standards as a source of FAIR metadata?</p>",
        "id": 220019711,
        "sender_full_name": "Ian D Harrow",
        "timestamp": 1608056162
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"370466\">@Ian D Harrow</span>  I don't know if this was your actual question :-), however, you can find more information about the FHIR resource identification <a href=\"https://www.hl7.org/fhir/resource.html#identification\">here</a> and about how resource identity can be managed <a href=\"https://www.hl7.org/fhir/managing.html\">here</a></p>",
        "id": 220095529,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1608112271
    },
    {
        "content": "<p>Thanks, that's a great help. I think the start should include evaluation of the FAIR Maturity Indicators for findability (and accessibility) against the existing FHIR resources, which can be automated.</p>",
        "id": 220225445,
        "sender_full_name": "Ian D Harrow",
        "timestamp": 1608199996
    }
]