[
    {
        "content": "<p>Hallo zusamen.<br>\nIm Projekt PosiThera wollen für die CDA-Variante wir zwischen Primär- und Sekundärverband unterscheiden. In LOINC gibt es dazu folgende Codes:</p>\n<ul>\n<li>72286-8 wound dressing panel mit folgenden Untercodes:<br>\n      * 72285-0 Dressing purpose for Wound, u.a. mit den Antwortmöglichkeiten Primary dressing (LA19070-4) und Secondary dressing (LA19071-2)<br>\n      * 39121-9 Dressing for Wound<br>\nWie codieren wir jetzt am besten Primär- und Sekundärverband mit LOINC? Oder sollten wir neue LOINC-Codes beantragen?<br>\nVielen Dank für Eure Unterstützung.</li>\n</ul>",
        "id": 169203899,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1561706544
    },
    {
        "content": "<p>Hallo Mareike,<br>\ndu solltest an dieser Stelle neue LOINC Codes beantragen. M.E. -ohne weitere Kenntnis über deinen Anwendungsfall, passen die aufgeführten LOINC Codes dafür nicht, um lediglich zwischen Primär- und Sekundärverband zu unterscheiden. </p>\n<p>Heute Nachmittag findet übrigens ein RELMA Tutorial for the Nursing Knowledge statt. Vielleicht ist das etwas für dich?</p>",
        "id": 169210399,
        "sender_full_name": "Elisabeth Pantazoglou",
        "timestamp": 1561713967
    },
    {
        "content": "<p>Hallo Elisabeth,</p>\n<p>vielen herzlichen Dank für die Antwort. Ich habe es befürchtet, dass ich neue LOINC-Codes beantragen muss.<br>\nZum Anwendungsfall: Wir haben ein Projekt zur Wundversorgung. Dazu möchten wir übermitteln (zum Einen zu unserem System, zum Anderen mit dem eWundbericht), wie die Wunde versorgt wird, u.a. Primär- und Sekundärverband. </p>\n<p>Zum RELMA Tutorial: Sehr wichtig, und bei der nächsten Woche bin ich gerne dabei, allerdings bin ich jetzt gerade auf dem Interop-Forum in Heidelberg, daher wird es eher schwierig.</p>",
        "id": 169211075,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1561714628
    },
    {
        "content": "<p>Du, wir sollten mal telefonieren! Wir sind am Thema mit diabetischen Füßen... <span aria-label=\"raising hand\" class=\"emoji emoji-1f64b\" role=\"img\" title=\"raising hand\">:raising_hand:</span>🏻‍♀️</p>",
        "id": 169227836,
        "sender_full_name": "Elisabeth Pantazoglou",
        "timestamp": 1561731131
    },
    {
        "content": "<p>Ich habe Neuigkeiten zu dem Thema: Nach Mails mit LOINC und einem Gespräch mit meinem Kollegen haben wir uns geeinigt, das ganze anders zu gestalten: Wir machen in CDA eine Section mit dem LOINC-Code für WoundDressingPanel (72286-8), das zwei Subsections enthält: 1x DressingPurpose und 1x Dressing. Das kann dann mehrfach verwendet werden.</p>",
        "id": 190274603,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1583928964
    }
]