[
    {
        "content": "<p>Liebes TC Terminologien,</p>\n<p>im Rahmen div. FHIR Projekte kam der Bedarf auf in den Deutschen Basisprofilen FHIR Profile für Vital-Parametern zu gestalten. Diese hat das TC FHIR heute in einer ersten Version veröffentlicht: <a href=\"https://simplifier.net/basisprofil-de-r4/~resources?category=Profile&amp;corebasetype=Observation&amp;sortBy=RankScore_desc\">https://simplifier.net/basisprofil-de-r4/~resources?category=Profile&amp;corebasetype=Observation&amp;sortBy=RankScore_desc</a></p>\n<p>Die Codierung erfolgt verpflichtend per LOINC in Anlehnung an die internationalen Vital Sign Profile (<a href=\"https://www.hl7.org/fhir/observation-vitalsigns.html\">https://www.hl7.org/fhir/observation-vitalsigns.html</a>). Jedoch würden wir gerne eine optionale SNOMED Codierung hinzufügen wollen, da diese in den meisten Projekten gewünscht wird.</p>\n<p>Hierzu haben wir folgende Tabelle erarbeitet mit einer Übersicht der Profile und den dort verwendeten Codes: <a href=\"https://docs.google.com/spreadsheets/d/1-5ITdUSoy_qjoVqQKLVEAOSCeSG3oDNEnPNGgUflDAg/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/1-5ITdUSoy_qjoVqQKLVEAOSCeSG3oDNEnPNGgUflDAg/edit?usp=sharing</a></p>\n<p>Wir würden um ein Review von eurer Seite aus bitten. </p>\n<p>Des Weiteren besteht die Frage ob die Profile besser mit einem Sammelcode kodiert werden sollten (z.B. 27113001 für Körpergewicht) oder man generell für die Kodierung auch die Child Codes zulassen sollte. Die KBV definiert z.B. hier implizite ValueSets welche alle Codes mit einer is-A Relationship zu 27113001 beinhaltet (Siehe <a href=\"https://simplifier.net/base1x0/kbvvsbasebodyweightsnomed\">https://simplifier.net/base1x0/kbvvsbasebodyweightsnomed</a>). Auch hier wären wir über Input dankbar. Es wäre zu evaluieren, welche Vorgehensweise für die Implementierung besser geeignet ist. Letztere Variante würde voraussetzen, dass immer ein Terminologie-Server verfügbar ist, um alle Observations für die Körpergröße in einem FHIR Server abzufragen.</p>\n<p><span class=\"user-mention\" data-user-id=\"194953\">@Heike Dewenter</span> <span class=\"user-mention\" data-user-id=\"212996\">@Elisabeth Pantazoglou</span> <span class=\"user-mention\" data-user-id=\"195473\">@Sylvia Thun</span></p>",
        "id": 218457668,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1606845132
    },
    {
        "content": "<p>Wir müssen hier die Profile von den Codes trennen. Es sollten möglichst wenige Profile definiert werden. Ob eines reicht muss geklärt werden. Die Codes sollten jedenfalls nicht reduziert werden.</p>",
        "id": 218475556,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1606853909
    },
    {
        "content": "<p>Hi Alex, ich habe meine Anmerkungen direkt in die Tabelle gemacht. Ich denke die Antworten hängen vom Use Case ab. Jedenfalls können wir nicht einfach die MIO Kodierungen übernehmen. Bei weiteren Fragen einfach gerne melden oder wir sprechen morgen beim IOF drüber. LG</p>",
        "id": 218527672,
        "sender_full_name": "Elisabeth Pantazoglou",
        "timestamp": 1606898545
    }
]