[
    {
        "content": "<p>Hi <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> , wir arbeiten gerade an einem System wo</p>\n<ul>\n<li>wir Daten mit ATC-Codes aus DE sowohl als auch anderen Ländern bekommen, und</li>\n<li>wo man im UI zwischen DE und EN als Anzeigesprache wechseln kann</li>\n</ul>\n<p>Hätte man ein CodeSystem mit Labels in DE und EN, könnte man ganz einfach den passenden Label je nach Anzeigesprache holen.  Aber für ATC givbt es (m.W.) keine einfache DE-Übersetzung des internationalen ATC-Systems, sondern eine eigene DE-Ausgabe (von BfArM) mit eigenen URL (<code>http://fhir.de/CodeSystem/dimdi/atc</code>). Jetzt fragen wir uns, inwiefern man sie trotzdem kombinieren kann:</p>\n<ul>\n<li>Ist es sichergestellt, dass jeder Code XYZ, der in beiden Systemen (DE/global) vorkommt, immer die gleiche Bedeutung hat? (Dann könnte man, zwecks Übersetzung, immer \"über Kreuz\" nachschlagen)</li>\n<li>Gibt es ein offizielles Mapping (vielleicht sogar CondeptMap) zwischen den beiden Systemen?</li>\n</ul>",
        "id": 235673377,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1619096911
    },
    {
        "content": "<p>PS: wir benutzen nur die ATC-Codes, nicht DDDs.</p>",
        "id": 235674118,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1619097188
    },
    {
        "content": "<p>Meines beschränkten Wissens nach sind die Codes an sich identisch.</p>",
        "id": 235676674,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1619098098
    },
    {
        "content": "<p>ConceptMap wäre also immer der identische Code/nur in einem anderen CS</p>",
        "id": 235676756,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1619098130
    },
    {
        "content": "<p>Ggfs. sollte das dt. ATC CS als supplement gekennzeichnet werden?</p>",
        "id": 235676815,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1619098150
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span>  zur sicherheit würde ich Dir empfehlen sich an das BfArM zur Bestätigung zu wenden. Kontakt findest Du hier <a href=\"https://www.dimdi.de/dynamic/de/arzneimittel/atc-klassifikation/\">https://www.dimdi.de/dynamic/de/arzneimittel/atc-klassifikation/</a></p>",
        "id": 235716129,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1619112329
    },
    {
        "content": "<p>Interessant, ich hatte den Eindruck, dass es durchaus Unterschiede gibt - ein Kollege hat die Codes verglichen und trotz grosser Überschneidung  auch viele Codes (auf beiden Seiten) ohne Gegenstück gefunden. Meine Kollegin fragt gerade bei BfArM nach, ich melde mich hier wieder, wenn wir wir eine Antwort haben.</p>",
        "id": 235733905,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1619119479
    },
    {
        "content": "<p>waren das auch die gleichen Jahresversionen? Bin gespannt auf das Feedback, danke fürs Nachfragen</p>",
        "id": 235798693,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1619162581
    },
    {
        "content": "<blockquote>\n<p>waren das auch die gleichen Jahresversionen?</p>\n</blockquote>\n<p>Da bin ich mir nicht 100% sicher, mag der Grund gewesen sein.</p>",
        "id": 235807695,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1619167904
    },
    {
        "content": "<p>kurze Nachfrage wie das Ergebnis hier war <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> ?</p>",
        "id": 273999705,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1646325423
    },
    {
        "content": "<p>Oha, lange her - da muss ich bei der Kollegin nachfragen.</p>",
        "id": 274000041,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1646325551
    },
    {
        "content": "<p>So, ich habe nochmal beim BfArM nachgefragt und die haben auch prompt geantwortet <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span> </p>\n<blockquote>\n<p>Grundsätzlich kommen bei der deutschen ATC-Klassifikation die gleichen Ordnungsprinzipien zur Abwendung wie bei der WHO-Klassifikation.<br>\nIm amtlich deutschen ATC-Code werden die ATC-Klassifikation mit definierten Tagesdosen bei Bedarf an die Besonderheiten der Versorgungssituation in Deutschland angepasst, d.h. ATC-Codes oder DDDs können sich von denen der WHO unterscheiden.<br>\nZusätzlich bildet der deutsche ATC-Code noch nationale Besonderheiten dadurch ab, dass er z.B. auch ATC-Codes für pflanzliche, homöopathische und anthroposophische Zubereitungen abbildet, die im WHO-ATC-Code nicht enthalten sind.<br>\nWeitere Informationen finden Sie auch direkt bei dem inhaltlich zuständigen Wissenschaftlichen Institut der AOK (WIdO) <a href=\"https://www.wido.de/publikationen-produkte/arzneimittel-klassifikation/\">https://www.wido.de/publikationen-produkte/arzneimittel-klassifikation/</a></p>\n</blockquote>\n<p>Ich habe dann auch in der ATC-Publikation, die unter dem Link zu finden ist, etwas nachgelesen (im Dokument \"Methodik der ATC-Klassifikation und DDD-Festlegung für den deutschen Arzneimittelmarkt\"). Was den eigentlichen ATC-Codes betrifft verstehe ich das jetzt so: das deutsche ATC-System enthält alle globalen Codes, fügt aber weitere Codes hinzufügt, insbesondere in den folgenden Bereichen:</p>\n<ul>\n<li>Phytotherapeutika und homöopathische und anthroposophische Arzneimittel</li>\n<li>Kombinationspräparate</li>\n<li>nach § 4b AMG verkehrsfähige Zell- oder Gentherapeutika</li>\n</ul>\n<p><em>Ein paar relevante Zitate aus \"Methodik der ATC-Klassifikation und DDD-Festlegung für den deutschen Arzneimittelmarkt\"</em></p>\n<p>S. 12</p>\n<blockquote>\n<p>Da das internationale ATC/DDD-System aber nicht in jedem Fall die spezifischen Belange des deutschen Arzneimittelmarktes berücksichtigen kann, wie beispielsweise die Klassifikation von nationalen phytotherapeutischen und anthroposophischen bzw. homöopathischen Spezialitäten sowie von Kombinationsarzneimitteln, werden seit Beginn der Projektarbeit des GKV-Arzneimittelindex entsprechende Ergänzungen und Erweiterungen des internationalen ATC/DDD- Systems unter größtmöglicher Wahrung der Kompatibilität mit dem WHO-Standard vorgenommen.</p>\n</blockquote>\n<p>S. 13:</p>\n<blockquote>\n<p>Sobald die jährliche Neuauflage des ATC-Index mit DDD durch das WHO-Zentrum publiziert ist, werden die Neuerungen in das deutsche System transferiert. Das deutsche ATC-System integriert damit das aktuell geltende, international bindende ATC/DDD-System der WHO voll- ständig, auch wenn einige der gelisteten Wirkstoffe in Deutschland nicht zugelassen sind.</p>\n</blockquote>\n<p>S. 15:</p>\n<blockquote>\n<p>Das derzeit geltende Klassifikationssystem der WHO weist spezifische Lücken für den deutschen Arzneimittelmarkt auf. So sind zum Beispiel als Besonderheiten des deutschen Arzneimittel- marktes zusätzliche Klassifikationen für den Bereich der Phytotherapeutika, der homöopathischen und der anthroposophischen Arzneimittel notwendig. Darüber hinaus müssen vor allem im Marktsegment der Kombinationspräparate neue ATC-Codierungen geschaffen werden, um eine ausreichende Übersicht über solche Kombinationspräparate zu erhalten, die für den deutschen Arzneimittelmarkt von besonderer Relevanz sind, international jedoch nur eine geringere Marktbedeutung besitzen.<br>\nIn Deutschland werden zusätzlich nach § 4b AMG verkehrsfähige Zell- oder Gentherapeutika im ATC-Index aufgenommen, soweit sie im Markt eingeführt wurden und von den Herstellern die notwendigen Informationen zur Verfügung gestellt werden (Fachinformationen, PZN, Arz- neimittelpreis, Marktverfügbarkeit).</p>\n</blockquote>",
        "id": 274651663,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1646811032
    },
    {
        "content": "<p>homöopathische und anthroposophische Arzneimittel <span aria-label=\"clown\" class=\"emoji emoji-1f921\" role=\"img\" title=\"clown\">:clown:</span></p>",
        "id": 274679884,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1646828884
    },
    {
        "content": "<p>Danke für das Nachhaken!</p>",
        "id": 274679899,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1646828895
    }
]