[
    {
        "content": "<p>Guten Morgen <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span>, ich arbeite an ein System, was ruropaweit funktionieren muss, und frage mich gerade, wie ich mit der Kodierung von Grosses bzw. Kleines Blutbild umgehen soll. Einerseits sind das m.W. einschlägige Begriffe in DE. Anderseits ist mein (medizinisch laienhaftes) Verständnis, dass genau welche Messungen in solchen Standard-Test-Panels enthalten sind von Land zu Land variieren kann. Dementsprechend weiss ich nicht, ob es überhaupt passende länderübergreifende Codes geben könnte. So hat LOINC mehrere Codes für CBC (Complete Blood Count) Panels, aber die Definitionen verweisen Teilweise auf US-Spezifische Leistungserstattungsregeln (z.B <a href=\"https://loinc.org/58410-2/\">https://loinc.org/58410-2/</a> ). Wie wird das typischerweise in DE kodiert? Und gibt es dazu Erfahrungen/Ansätze, was länderübergreifende Kodierungen angeht?</p>",
        "id": 216981582,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1605605620
    },
    {
        "content": "<p>Wo siehst Du hier einen Verweis auf \"Leistungserstattungsregeln\"?</p>",
        "id": 217047444,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1605639841
    },
    {
        "content": "<p>Im Term Description von 58410-2:</p>\n<blockquote>\n<p>This panel is the traditional hemogram plus platelet count which must now be reported with with hemograms according to current US re-imbursement rule</p>\n</blockquote>",
        "id": 217055968,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1605643948
    },
    {
        "content": "<p>Ah, stimmt. Ich werde die Frage mal an die Kollegen weiterleiten, die sich im X-eHealth-Projekt mit dem EU-weiten Austauschen von Laborbefunden beschäftigen.</p>",
        "id": 217082334,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1605659475
    },
    {
        "content": "<p>Danke <span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> !</p>",
        "id": 217102621,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1605683869
    }
]