[
    {
        "content": "<p>Ich hatte eben die Gelegenheit mit Clem McDonald über diese Themen zu sprechen. LOINC Concepts/ Answers kann im Prinzip jeder übersetzen. Wenn dies auf irgendeiner (nationalen) Ebene koordiniert wird, umso besser.</p>",
        "id": 155120908,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1547501509
    },
    {
        "content": "<p><a href=\"https://loinc.org/international/translations/\" target=\"_blank\" title=\"https://loinc.org/international/translations/\">https://loinc.org/international/translations/</a></p>",
        "id": 155120914,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1547501516
    },
    {
        "content": "<p>Es gibt 2 verschiedene Arten der Übersetzung: einzelne Wörter, die dann von Regenstrief für Wort für Wort Übersetzungen genutzt werden. Oder man übersetzt das ganze Konzept/Answer.</p>",
        "id": 155121039,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1547501622
    },
    {
        "content": "<p>In FHIR würden wir das allerdings erst mit Hilfe der R4-Supplement Funktionalität technisch in das Terminologie-Framework reinbekommen, was aber nicht heißen muss, dass wir (bzw. das TC Terminologien) die Übersetzungen nicht zwischenzeitlich erstellen und verwenden können...</p>",
        "id": 155121106,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1547501668
    },
    {
        "content": "<p>Allerdings habe ich bislang immer noch keinen Überblick, ob das TC das momentan schon tut und falls ja, wo man die Übersetzungen findet...</p>",
        "id": 155121139,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1547501710
    },
    {
        "content": "<p>Das zweite Thema waren LOINC Answerlists, diese sind nur verpflichtend wenn diese \"normative Answerlists\" sind. Wenn man hier eine andere AnswerList nutzen möchte müsste man eigentlich ein neues Konzept erstellen welches keine Answerlist enthält/verlinkt. Dies hätte den Nachteil dass wir Konzepte duplizieren. Er meinte daher man könne auch einfach die Liste ignorieren \"there is no LOINC police\"</p>",
        "id": 155121336,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1547501874
    },
    {
        "content": "<p>Also genau das, was bisher als best practice gilt wurde, und auch, was Rob dazu meinte.</p>",
        "id": 155121474,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1547501952
    },
    {
        "content": "<p>Die Nutzung von Answerlists verpflichtet einen nicht zu Nutzung des Konzepts der Frage. Manche AnswerLists werden für mehrer Konzept verwendet, es gibt also keine 1:1 Verknüpfung.</p>",
        "id": 155121497,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1547501967
    },
    {
        "content": "<blockquote>\n<p>Das zweite Thema waren LOINC Answerlists, diese sind nur verpflichtend wenn diese \"normative Answerlists\" sind. </p>\n</blockquote>\n<p>Interessant. Verstehe ich das richtig: Demnach wäre beim Code 72166-2, der eine <em>normative</em> Answer List hat, die Verwendung der selbigen verpflichtend?<br>\n<a href=\"https://s.details.loinc.org/LOINC/72166-2.html?sections=Comprehensive\" target=\"_blank\" title=\"https://s.details.loinc.org/LOINC/72166-2.html?sections=Comprehensive\">https://s.details.loinc.org/LOINC/72166-2.html?sections=Comprehensive</a></p>",
        "id": 155123701,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1547503652
    },
    {
        "content": "<p>Ja, und dann doch wieder nein:</p>\n<p>\"Er meinte daher man könne auch einfach die Liste ignorieren \"there is no LOINC police\"\"</p>",
        "id": 155123803,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1547503731
    }
]