[
    {
        "content": "<p>Hallo zusammen, <br>\nich hatte vor einigen Monaten mal Kontakt zum DIMDI und darum gebeten, die von den Deutschen Basisprofilen benötigten Übersetzungen zu prüfen und ggf. bei LOINC Int. zu ergänzen.<br>\nNun kam folgende Rückmeldung:</p>\n<blockquote>\n<p>Zu den Termen für Schwangerschaft und Raucherstatus.</p>\n<ul>\n<li>\n<p>Das sind LA-Codes (List of Answers).<br>\nBisher wurden diese nicht übersetzt, es gibt nach meiner Recherche in den LinguisticVariants auch bisher keine anderen Ländern, die LA-Terme übersetzt haben.<br>\nIch habe daher bei Regenstrief angefragt, wie ich die Übersetzungen schicken kann. Das könnte möglicherweise in dieser Runde nicht klappen, da die Prioritäten dort eindeutig derzeit bei Corona und Co liegen.</p>\n</li>\n<li>\n<p>LA-Code LA4489-6 Unbekannt.<br>\nHat als Copyright Quelle SNOMED CT mit den bekannten Implikationen.</p>\n</li>\n</ul>\n<p>Vitalstatus:</p>\n<ul>\n<li>\n<p>Die Codes 2708-6, 8310-5, 8302-2, 29463-7 sind schon übersetzt und über die LinguisticVariants verfügbar.<br>\nDie Aktualisierungen gebe ich weiter.</p>\n</li>\n<li>\n<p>Den Term „2708-6           Sauerstoffsättigung, arteriell“ müssten Sie in „Sauerstoffsättigung“ ändern, da das „arteriell“ in der Achse System abgebildet wird.<br>\nAlternativ ist zu überlegen, grundsätzlich auf das Datenfeld „LongCommonName“ auszuweichen, um die Informationen der verschiedenen Achsen in einem Feld abzubilden.</p>\n</li>\n</ul>\n<p>Pflegegrad:</p>\n<ul>\n<li>Der Deutsche Pflegegrad entspricht nicht der Definition von „Level of Care“.<br>\nWir sollten daher überlegen, ob nicht eine NationalExtension bei Regenstrief beantragt werden soll.<br>\nRegenstrief hatte uns den Nummernkreis XDE… vorgeschlagen.</li>\n</ul>\n</blockquote>\n<p>Das Ganze bezieht sich auf ein CodeSystem-Supplement, in dem wir zu Testzwecken mal LOINC Codes, die in den DE-Profilen vorkommen, zusammengetragen hatten: <a href=\"https://simplifier.net/basisprofil-de-r4/loinc-supplement-basis-duplicate-2\" title=\"https://simplifier.net/basisprofil-de-r4/loinc-supplement-basis-duplicate-2\">https://simplifier.net/basisprofil-de-r4/loinc-supplement-basis-duplicate-2</a></p>\n<p>Was soll ich hierauf antworten?<br>\nWelche Übersetzungen fehlen uns noch?<br>\nDie Einreichung muss bis Ende des Monats geschehen...</p>\n<p>Hierbei bitte ich zur Klärung das TC Terminologien um Unterstützung...</p>",
        "id": 196208161,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1588610835
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195473\">@Sylvia Thun</span> <span class=\"user-mention\" data-user-id=\"194953\">@Heike Dewenter</span>  <span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> <span class=\"user-mention\" data-user-id=\"212996\">@Elisabeth Pantazoglou</span> <span class=\"user-mention\" data-user-id=\"220379\">@Elisabeth Pantazoglou</span></p>",
        "id": 196208386,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1588610953
    },
    {
        "content": "<p>Von wem kam die mail konkret? Ich würde dann direkt mit Christine (?!?) die Fragen auflösen und hier das Ergebnis berichten.</p>",
        "id": 196235115,
        "sender_full_name": "Sylvia Thun",
        "timestamp": 1588623686
    },
    {
        "content": "<p>Genau selbige!</p>",
        "id": 196235150,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1588623713
    },
    {
        "content": "<p>Mareike hatte, glaube ich, mal Pflegegrade beim Regentrief beantragt- am besten mal fragen, was daraus geworden ist. <span class=\"user-mention\" data-user-id=\"196115\">@Mareike Przysucha</span> , oder?<br>\nWie es scheint, ist ja schon das Vorgehen mit DIMDI abgestimmt. VG, Elisabeth</p>",
        "id": 196270858,
        "sender_full_name": "Elisabeth Pantazoglou",
        "timestamp": 1588659096
    },
    {
        "content": "<p>Hallo zusammen. Das hatte ich, und habe den Code 80391-6, der für \"Level of Care\" steht. Diesen Code kritisiert das dimdi jetzt als unpassend, wenn ich das richtig verstehe. Das Example-Answer-Set passt halt nicht 100%-ig, aber es ist ja auch nur ein example.</p>",
        "id": 196271680,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1588659959
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 196271886,
        "sender_full_name": "Elisabeth Pantazoglou",
        "timestamp": 1588660120
    },
    {
        "content": "<blockquote>\n<p>Den Term „2708-6 Sauerstoffsättigung, arteriell“ müssten Sie in „Sauerstoffsättigung“ ändern, da das „arteriell“ in der Achse System abgebildet wird.<br>\nAlternativ ist zu überlegen, grundsätzlich auf das Datenfeld „LongCommonName“ auszuweichen, um die Informationen der verschiedenen Achsen in einem Feld abzubilden.</p>\n</blockquote>\n<p>FHIR verwendet ohnehin LongCommonName als display</p>",
        "id": 196275770,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1588664187
    },
    {
        "content": "<blockquote>\n<p>Der Deutsche Pflegegrad entspricht nicht der Definition von „Level of Care“.<br>\nWir sollten daher überlegen, ob nicht eine NationalExtension bei Regenstrief beantragt werden soll.<br>\nRegenstrief hatte uns den Nummernkreis XDE… vorgeschlagen.</p>\n</blockquote>\n<p>Kann ich nachvollziehen. Pflegegrad bezieht sich auf die pflegerische Unterstützung, level of care auf das medizinsische Versorgungslevel</p>",
        "id": 196275951,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1588664375
    },
    {
        "content": "<p>Zur Info: <br>\nich habe vom DIMDI folgende Infos erhalten:</p>\n<blockquote>\n<p>Leider gibt es für die Terme beginnend mit „LA“ noch keine Möglichkeit, diese zentral zu übersetzen.<br>\nDas ist bei Regenstrief adressiert, ich hoffe, dass es dafür bald eine Lösung geben wird.</p>\n<p>Bgzl. Der deutschen „Pflegestufe“ würde Frau Thun meinem Vorschlag folgen, dafür eine National Extension zu beantragen, die dann wie ich verstanden habe, auch zentral bei LOINC verfügbar sein wird unter den Codes beginnend mit „XDE“.</p>\n<p>Der Antrag muss noch gemacht werden, LOINC erwartet dazu Infos zur Begründung und Definitionen. Das muss noch abgestimmt werden.</p>\n<p>Die Terme für den CoCos-Datensatz <a href=\"https://art-decor.org/art-decor/decor-datasets--covid19f-\">https://art-decor.org/art-decor/decor-datasets--covid19f-</a></p>\n<p>Sind auch alle übersetzt und alle bis auf die LA-Terme erstmals mit einem deutschen LongCommonName versehen worden, der als Display-Name verwendet werden soll.</p>\n</blockquote>\n<p>Allerdings mussten wir feststellen, dass die deutschen Übersetzungen (noch?) nicht über die LOINC FHIR-API abgerufen werden können.</p>",
        "id": 202789861,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1593772778
    },
    {
        "content": "<p>Mein letzter Stand ist, dass die deutschen LongCommonNames nicht besonders lesbar sind...dachte, ich spreche das an der Stelle mal an, ist aber zugegebenermaßen etwas off-topic...</p>",
        "id": 202795743,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1593777358
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306822\">Sven Helfer</span> <a href=\"#narrow/stream/179316-german.2Fterminologien/topic/LOINC.20.C3.9Cbersetzungen/near/202795743\">said</a>:</p>\n<blockquote>\n<p>Mein letzter Stand ist, dass die deutschen LongCommonNames nicht besonders lesbar sind...dachte, ich spreche das an der Stelle mal an, ist aber zugegebenermaßen etwas off-topic...</p>\n</blockquote>\n<p>Ursache kann mitunter sein, dass die LongCommonNames aus den übersetzten LOINC Parts generiert werden. Component, Property und Method aneinander gesetzt ist vielleicht nicht immer so gut lesbar, wie man es sich wünschen würde.</p>",
        "id": 202804412,
        "sender_full_name": "Julian Sass",
        "timestamp": 1593783427
    },
    {
        "content": "<p>Der LOINC \"fully-specified name\" (FSN) ist ja auch gar nicht für die Lesbarkeit gedacht, sondern dient der Vermeidung von Doubletten. Er ist semantisch äquivalent zu dem LOINC-Code, ist einfach eine Konkatenation der sechs Achsenwerte. Er wird also nicht \"generiert\", sondern er definiert das Konzept eineindeutig. Durch Bereitstellung deutscher Bezeichner für viele Achsenwerte können etliche LOINC Konzepte auch in Deutschland besser \"verstanden\" werden (Dadurch entsteht natürlich kein neuer FSN, denn der ist ja an die englischsprachigen Achsenwerte gekoppelt). </p>\n<p>Der Long Common Name soll ebenfalls das Konzept eindeutig beschreiben, muss dabei aber nicht die strukturierte Form des FSN einhalten. Für knapp 500 Konzepte gibt es schon eine dt. Übersetzung des Long Common Name. Auch der Long Common Name ist nicht für den Zweck der Anzeige gedacht.</p>\n<p>Außerdem gibt es in LOINC noch einen \"Display Name\" und einen \"Short Name\", dafür gibt es allerdings bisher keine offiziellen deutschen Übersetzungen (LinguisticVariantDisplayName).</p>",
        "id": 202806483,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1593784843
    },
    {
        "content": "<p>Auf den Seiten von <a href=\"http://loinc.org\">loinc.org</a> werden unter \"Language Variants\" nicht die übersetzten Long Names angezeigt. Stattdessen werden die übersetzen Achsenwerte aneinandergereiht, ähnlich den Regeln für den LOINC FSN (wie von <span class=\"user-mention\" data-user-id=\"194952\">@Julian Sass</span> beschrieben). Die übersetzen deutschen Long Common Names findet man in der Datei \"LOINC Linguistic Variants\" unter <a href=\"https://loinc.org/downloads/accessory-files/\">https://loinc.org/downloads/accessory-files/</a></p>",
        "id": 202826817,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1593799493
    },
    {
        "content": "<p>Danke für die Details, die waren mir nicht klar. Schön, dass man so immer was lernen kann. Trotzdem Auffällig finde ich das: </p>\n<div class=\"codehilite\"><pre><span></span><code>fr-FRFrench (FRANCE)\n    Hémoglobine:Masse/Volume:Ponctuel:Sang:Numérique:\nde-DEGerman (GERMANY)\n    Hämoglobin:MKnz:Pkt:Blut:Qn:\n</code></pre></div>\n\n\n<p>Die französische \"Language Variant\" ist relativ gut lesbar, die deutsche nicht. Das erschwert leider die automatisierte Umsetzung der Terme in \"einigermaßen\" lesbare Form. Die DIMDI-Übersetzung (wie viele andere auch) ist wahrscheinlich leider eher technisch. Die \"romanischen\" sind eher auf lesbarkeit aus.</p>",
        "id": 202956190,
        "sender_full_name": "Sven Helfer",
        "timestamp": 1594015743
    }
]