[
    {
        "content": "<p>Ich möchte gern über FHIR ausdrücken, dass bei einem im Krankenhaus aufgenommenen Patienten eine Medikationsanamnese stattgefunden hat, mit folgendem Ergebnis: \"Nehmen Sie zur Zeit Medikamente ein?\" – \"Nein, keine.\"<br>\nMeine Idee wäre, ein MedicationStatement-Ressource anzulegen mit einem medicationCodeableConcept aus SNOMED CT: 787481004 | No known medications (situation) oder aber 242571000000102 | Patient not on medication (finding)<br>\nWäre das passend? Welches wäre besser? Oder gibt es eine andere, bessere Lösung? Z.B. über eine Observation (dann wäre aber die Auswertung schwieriger…) <br>\nWichtig wäre die Möglichkeit einer Unterscheidung zwischen \"hat gesagt, nimmt nix ein\" und \"hab nicht gefragt\" (bei letzterem würde natürlich auch nichts angelegt, aber bei ersterem sollte das dokumentiert sein).</p>",
        "id": 226422515,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1613417493
    },
    {
        "content": "<p>Ich würde das MedicationStatement nehmen. Die IPS macht das auch mit Absent or Unknown Medications auf medicationCodeableConcept. <a href=\"https://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-MedicationStatement-uv-ips.html\">https://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-MedicationStatement-uv-ips.html</a> <br>\nWenn feststeht, Patient nimmt nichts ein, dann 'Patient not on medication (finding)'. Wenn unbekannt, dann eher den ersten Code.</p>",
        "id": 226427366,
        "sender_full_name": "Julian Sass",
        "timestamp": 1613421180
    },
    {
        "content": "<p>In IPS geht das mit <a href=\"http://hl7.org/fhir/uv/ips/ValueSet-absent-or-unknown-medications-uv-ips.html\">http://hl7.org/fhir/uv/ips/ValueSet-absent-or-unknown-medications-uv-ips.html</a>. Die Konzepte mappen natürlich auf die von Julian genannten SCT codes, wir wollten aber wegen der zwei Werte nicht SNOMED \"bemühen\" wg. Lizenz usw.</p>",
        "id": 226682241,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1613578786
    }
]