[
    {
        "content": "<p>Wir stehen momentan mit den BfArm in Kontakt zur Frage: Wie müsste eine nationale Terminologie-Infrastruktur aussehen? Was wären die Anforderungen? UseCases? Wünsch? Träume? Ideen?<br>\n...lasst uns das mal hier bitte zusammentragen...<br>\n<span class=\"user-mention\" data-user-id=\"195473\">@Sylvia Thun</span> kannst du hier bitte die Zusammenstellung der MI-I verlinken?</p>",
        "id": 226388480,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1613398205
    },
    {
        "content": "<p>Ich wünsche mir einen nationalen Terminologieserver, der künftig per FHIR Terminology Services alle im deutschen Gesundheitswesen verwendeten bzw. mindestens die vom BfArM verantworteten Terminologien und Kataloge abfragbar macht und in dem diese stets aktuell gepflegt werden <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span></p>",
        "id": 226396834,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1613402810
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"194875\">@Danny Ammon</span>: Abfragbar in welchem Sinne?<br>\na) Validierung eines Codes (Ich möchte wissen, ob \"E10.01\" ein zulässiger ICD10 Code ist.)<br>\nb) Display abholen zu einem Code (Ich möchte wissen, wie der Code \"E10.01\" dargestellt wird)<br>\nc) Suchen nach Codes (z.B. sende ich den Suchstring \"Dia*\", um aus der ICD-10 alle Terminal-Codes der Kategorie E10 -E14 zu erhalten und mir dann über den Display den passenden auszusuchen)<br>\nd) etwas ganz anders</p>\n<p>Ich frage, weil dies für die Auswahl der UseCases und Anforderungen nicht von unerheblichem Interesse ist.</p>",
        "id": 226482298,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1613462235
    },
    {
        "content": "<p>Natürlich ist Mehrfachausauswahl erlaubt, wobei d) bitte weiter zu spezifizieren wäre.</p>",
        "id": 226482324,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1613462265
    },
    {
        "content": "<p>Hallo <span class=\"user-mention\" data-user-id=\"196115\">@Mareike Przysucha</span>, alles drei wäre nett <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span> (kann ich ja jetzt teilweise über das Webportal auch) und d): ich würd gern die jeweiligen CodeSystem- und ValueSet-Ressourcen zentral herunterladbar haben, damit ich sie auf einen Terminologieserver, der in meinem Haus betrieben wird und FHIR Terminology unterstützt, laden kann. Ggf. sogar automatisiert synchronisieren. Dann führe ich die Use Cases a-c bei mir lokal durch…</p>",
        "id": 226485258,
        "sender_full_name": "Danny Ammon",
        "timestamp": 1613464400
    },
    {
        "content": "<p>subsumes wäre ebenfalls wichtig um Konzept-Hirarchien überprüfen zu können</p>",
        "id": 226667196,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1613573750
    },
    {
        "content": "<p>Zuallererst bräuchten wir m. E. einen Dienst, der sich ganz auf Pflege und Bereitstellung der Codesystems und auch Valuesets fokussiert, also als \"source of truth\" fungieren kann für andere Systeme. Die können dann auf diesen Daten erweiterte Services anbieten (wie subsumes , displayName lookup usw.) - das aber dezentral oder lokal.</p>",
        "id": 226682963,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1613579049
    },
    {
        "content": "<p>Bei der Governance sollte man gleich mit-bedenken, wie man diverse Managementfunktionen auf API-Ebene abbilden kan, um künftig automatisieren zu können.</p>",
        "id": 226684491,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1613579574
    },
    {
        "content": "<p>Bei irgendwelchen notification bzw. publish/subscribe Aktivitäten, etwa bei Update eines Codessystem, wäre zu beachten, dass dadurch nicht alle subscriber auf einmal angestoßen werden, und dann gleichzeitig auf den TS zugreifen wollen (Erfahrung aus anderen Terminologieserver-Projekten...)</p>",
        "id": 226687120,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1613580582
    },
    {
        "content": "<p>Grüß euch! <br>\nEs gibt gerade in Ö Entwicklungen das der alte TermServer ersetzt wird - <a href=\"https://termpub.gesundheit.gv.at/\">https://termpub.gesundheit.gv.at/</a>. Dabei hat nach Diskussionen in Fachgremien zuerst eine Ausschreibung stattgefunden, parallel wurde untersucht, ob OpenSource Lösungen die gesammelten Use Cases abdecken würden. Daraus ist ein Open Concept Repository auf unserem GitLab der ELGA GmbH entstanden - <a href=\"https://gitlab.com/elga-gmbh/termgit\">https://gitlab.com/elga-gmbh/termgit</a>. Alle Ergebnisse und Entwicklungen für das Konzept werden selbst wieder OpenSource gestellt. Das Subprojekt Markup Language Converter for Clinical Terminologies, kurz MaLaC-CT, ist gerade im Aufbau und wird in den nächsten Monaten auch offen gestellt. <br>\nDas Team dahinter (nebst mir daweil ist nur <span class=\"user-mention\" data-user-id=\"376049\">@Gabriel Kleinoscheg</span> hier im Chat vertreten) und die restliche HL7 Austria FHIR Community freut sich auf jegliche Zusammenarbeit, auch Diskussionen allgemein zu diesem Thema sind für uns etwas sehr Spannendes!</p>",
        "id": 226926217,
        "sender_full_name": "Nikola Tanjga",
        "timestamp": 1613717201
    },
    {
        "content": "<p>Nationaler Terminologieserver hat diese Woche den Betrieb aufgenommen -  in den Niederlanden:<br>\n<a href=\"https://www.nictiz.nl/standaardisatie/terminologiecentrum/nationale-terminologieserver/\">https://www.nictiz.nl/standaardisatie/terminologiecentrum/nationale-terminologieserver/</a></p>",
        "id": 227912581,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1614337892
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196115\">@Mareike Przysucha</span> um Deine Punkte noch einmal aufzunehmen, technisch werden diese von der ValueSet <a href=\"https://www.hl7.org/fhir/valueset-operation-expand.html\">$expand</a> Operation abgebildet. Ich arbeite in CODEX, ZARS und anderen Projekten an förderierten Suchen. In den Suchen bezieht man sich meist auf nicht endständige Konzepte bzw. ganze ValueSets, wohingegen in den Daten nur endständige Konzepte kodiert sind. D.h. wir müssen diese nicht endständigen Konzepte bzw. ValueSets expandieren können.</p>\n<p>Eine weitere Anwendung, welche ebenfalls von $expand unterstützt wird und Deinem Punkt c) entspricht, ist die Volltextsuche in den Konzepten. Die Volltextsuche ist in Query-UI's sehr nützlich. Wir haben dies beispielsweise im <a href=\"https://samplelocator.bbmri.de\">Sample Locator</a> (Diagnosis ICD-10) mit eigenen Mitteln gebaut.</p>",
        "id": 231457655,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1616500560
    }
]