[
    {
        "content": "<p>Hallo zusammen :)</p>\n<p>in der Hoffnung das dies keine triviale oder bereits gestellte Frage ist:<br>\nWir bräuchten für mehrere Projekte ein ValueSet für die QuestionnaireResponse-Resource, welche die verschiedenen Formen von Quality of Life Questionnaires-Fragebögen der EORTC als CodeSystem abbildet und validieren kann, wie z.B. der EORTC QLQ-LC13: <a href=\"https://www.eortc.org/app/uploads/sites/2/2018/08/Specimen-LC13-English.pdf\">https://www.eortc.org/app/uploads/sites/2/2018/08/Specimen-LC13-English.pdf</a><br>\nIch habe hierfür keine Vorlage gefunden und mit Hilfe des Snapper-Tools nun ein eigenes ValueSet erstellt und den ersten Versuch auf den Ontoserver des CSIRO-Teams gepusht: <br>\n<a href=\"https://r4.ontoserver.csiro.au/fhir/ValueSet/f0ec1a96-5bca-457b-a633-f68d0f2091fb/$expand\">https://r4.ontoserver.csiro.au/fhir/ValueSet/f0ec1a96-5bca-457b-a633-f68d0f2091fb/$expand</a><br>\nGibt es ein solches ValueSet bereits in irgendeiner Form und wäre dies der beste Weg zur Validierung der QLQ-Antworten in den QuestionnairesResponse-Resourcen?</p>\n<p>Vielen Dank für eine Antwort und viele Grüße</p>\n<p>Pascal Escher</p>",
        "id": 231648775,
        "sender_full_name": "Pascal Escher",
        "timestamp": 1616598058
    },
    {
        "content": "<p>Kurzes Update:<br>\nIm SNOMED CT-Release Juni 2021 werden einige neue numeric grades zu finden sein, die aus meiner Sicht für die Codierung der QuestionnaireResponse in FHIR  genutzt werden können:<br>\n<a href=\"https://browser.ihtsdotools.org/multi-extension-search.html\">https://browser.ihtsdotools.org/multi-extension-search.html</a> und nach folgendem Code suchen: 272407005 | Numeric grade (qualifier value) |</p>\n<p>Viele Grüße</p>",
        "id": 240177943,
        "sender_full_name": "Pascal Escher",
        "timestamp": 1621945150
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"251863\">@Alexander Bartschke</span> hast du nicht mal was mit den QoL Questionnaires gemacht?</p>",
        "id": 240180176,
        "sender_full_name": "Julian Sass",
        "timestamp": 1621946375
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"381661\">@Pascal Escher</span>  am besten eignet sich hier LOINC.  Hier ein Beispiel wie QoL Questionnaires abgebildet werden können <a href=\"https://loinc.org/72355-1/\">https://loinc.org/72355-1/</a>  Gerne können wir  für den EORTC QLQ-LC13 beim Regenstrief Codes anfragen.  Um welche anderen Questionnaires geht es genau?</p>",
        "id": 240183667,
        "sender_full_name": "Alexander Bartschke",
        "timestamp": 1621947880
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"251863\">@Alexander Bartschke</span> Hi, danke für die Antwort! <br>\nWir nutzen einige Fragebögen der EORTC, unter anderem BIL21, BN20, BR23 (45), C30, CR29, LC13 und noch einige mehr. Wir können auch gerne mal einen Abgleich machen.<br>\nFür den BR45 (Erweitert den Vorgänger BR23 um einige Fragen) und den C30 habe ich letzte Woche bei LOINC eine Einreichung gemacht und die kleine Hoffnung, dass es für den nächsten Release im Sommer noch reicht. Seid ihr momentan auch noch an Einreichungen dran? Aus meiner momentanen Sicht würde ich LOINC für die Questionnaires nehmen, wenn vorhanden und SNOMED CT für die Codierung der QuestionnaireResponses, siehe oben.</p>",
        "id": 240184784,
        "sender_full_name": "Pascal Escher",
        "timestamp": 1621948382
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"381661\">@Pascal Escher</span> wir sind die ganze Zeit am einreichen <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span>   Ein Abgleich wäre super. Hier ist <span class=\"user-mention\" data-user-id=\"369503\">@Naveen Moses Raj Rajkumar</span>  der beste Ansprechpartner. Es eignet sich am besten die Codes aus der zum LOINC Code dazugehörigen Answer List zu verwenden (manchmal sind die Codes in der Answer List sogar normativ). Die Verwendung der SNOMED Grading finde ich gut  und würde diese auch verwenden, aber nur wenn es keine passenden LOINC Answer List gibt.</p>",
        "id": 240233894,
        "sender_full_name": "Alexander Bartschke",
        "timestamp": 1621969028
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"251863\">@Alexander Bartschke</span> Vielen Dank für den Tipp. Da so wenige Bögen in LOINC verfügbar sind, die wir brauchen,  sind wir teilweise auf SNOMED CT umgestiegen, um überhaupt eine Möglichkeit zur Codierung zu haben. Ich bin schon mit Naveen Rajkumar in Kontakt getreten und wir werden den Austausch per Mail machen. Wir (Universitätsklinikum Tübingen) hatten vor einiger Zeit auch schon Kontakt mit Sylvia Thun., habe ich gerade erfahren. Viele Grüße</p>",
        "id": 240297637,
        "sender_full_name": "Pascal Escher",
        "timestamp": 1622020929
    }
]