[
    {
        "content": "<p>Ein kleiner Hilferuf meinerseits:<br>\nAngenommen man müsste in FHIR (in R4) ServiceRequest.category codieren... Das dort angegebene ValueSet hat ein ExampleBinding auf eine Reihe von SNOMED Codes, diese können in diesem konkreten Fall nicht von uns benutzt werden (Kontext MI-Initiative). Das passendste Konzept wäre '108252007 Laboratory procedure'. Fallen jemanden Alternativen ein die man hier verwenden könnte? Die Aussage die es gilt abzudecken ist \"Der abgebildete ServiceRequest ist eine Laboranforderung\". Konkrete LOINC Codes für bestimmte Anforderungen lassen sich nicht verwenden, da FHIR in der Beschreibung von ServiceRequest.category sagt, dass man auf dem Abstraktionsniveau des Example ValueSets bleiben soll.</p>",
        "id": 166685454,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1559022857
    },
    {
        "content": "<p>Was spricht dagegen das vorgeschlagene Valueset zu nutzen? Es erfüllt doch genau den Use Cases \"Der abgebildete ServiceRequest ist eine Laboranforderung\". Habt ihr bei der MI Bedenken wegen der SNOMED-Lizenz und braucht deshalb eine Alternative?</p>",
        "id": 166802606,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1559126328
    },
    {
        "content": "<p>Exakt, ich bin nicht involviert in irgendwelchen Verhandlungen bezüglich einer SNOMED Lizenz für die MI Standorte, da es sich hier jedoch um die Profile für den Kerndatensatz handelt würde bräuchte ich eine Alternative außer es gibt ein offizielles OK das vorgeschlagene ValueSet zu benutzen.</p>",
        "id": 166803139,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1559126820
    },
    {
        "content": "<p>In der Tat dieses Problem sehe ich auch bei anderen Initiativen. So definiert ATKIN auch eigene Valuesets im HL7 Deutschland Namespace. Kann das für euch ein (Interims)weg sein. Wenn in einer nicht alzu ferner Zukunft SNOMED CT zur Verfügung steht, könnt Ihr dann durch Mapping die Migration machen.</p>",
        "id": 166804305,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1559128066
    },
    {
        "content": "<blockquote>\n<p>So definiert ATKIN auch eigene Valuesets im HL7 Deutschland Namespace. </p>\n</blockquote>\n<p>ist das mit HL7 Deutschland abgesprochen? Normalerweise sollte jedes Projekt nur Dinge im eigenen Namespace definieren. (außer HL7 DE möchte das in die BasisProfile mit aufnehmen.) <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> ?</p>",
        "id": 166810988,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1559134280
    },
    {
        "content": "<p>Huch! Was? Wer? Ist AKTIN das gleiche wie ATKIN? Mit AKTIN hatten wir ja schonmal längliche Diskussionen über die Grenzen zwischen Ge- und Missbrauch der FHIR-Spezifikation...</p>",
        "id": 166812334,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1559135196
    },
    {
        "content": "<p>Besteht denn Interesse seitens HL7, dass man für alle Example ValueSets in der FHIR Spec die rein SNOMED sind ein eignes CodeSystem + Mapping zu erstellen?</p>",
        "id": 166813335,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1559135817
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> danke für die Korrektur, die meinte ich auch <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span></p>",
        "id": 166813384,
        "sender_full_name": "Axel Biernat",
        "timestamp": 1559135855
    },
    {
        "content": "<p>Ich mein natürlich kann die MII das Mapping auch erstellen, ist halt die Frage was hier eher gewünscht ist</p>",
        "id": 166814261,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1559136378
    },
    {
        "content": "<blockquote>\n<p>da FHIR in der Beschreibung von ServiceRequest.category sagt, dass man auf dem Abstraktionsniveau des Example ValueSets bleiben soll.</p>\n</blockquote>\n<p>das lese ich so gar nicht aus der spec. Das ValueSet (was man nutzt) definiert die Granularität. Aber ja hier sollten nicht die einzelnen Anforderungen typisiert werden sondern in Kategorien zusammengefasst werden.<br>\nBzgl. der Lizenzproblematik: Ich würde hier mein eigenes CodeSystem/ValueSet basteln. Ggfs kann man das später auf SNOMED CT mappen.</p>",
        "id": 166815093,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1559136884
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194953\">@Heike Dewenter</span> ...?</p>",
        "id": 166815127,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1559136910
    },
    {
        "content": "<p>Ich hatte \"The level of granularity is defined by the category concepts in the value set.\" (Siehe Comments von ServiceRequest.category) interpretiert als würde es sich auf das hinterlegte ValueSet beziehen.</p>",
        "id": 166818630,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1559138755
    },
    {
        "content": "<p>Ich hatte es so verstanden als wäre eine SCT Affiliate License für die MI-Initiative beantragt- also eine übergeordnete Lizenz? However, Infos dazu gibt es zumindest keine  auf deren Webseite (Ist ja auch nicht so wichtig ;-) . Mit dem Einsatz von selbstkonstruierten Mappings auf SCT wäre ich ohne persönliche Lizenz  auch vorsichtig, siehe: <a href=\"http://www.snomed.org/SNOMED/media/SNOMED/documents/IHTSDO-Affiliate-License-Agreement_UK_20190101_v0-1.pdf\" target=\"_blank\" title=\"http://www.snomed.org/SNOMED/media/SNOMED/documents/IHTSDO-Affiliate-License-Agreement_UK_20190101_v0-1.pdf\">http://www.snomed.org/SNOMED/media/SNOMED/documents/IHTSDO-Affiliate-License-Agreement_UK_20190101_v0-1.pdf</a>   <br>\n(sprich - das Mapping wird durch SCT Intl. nur anerkannt wenn Du eine Lizenz hast und deren Regeln für die Erstellung von Mappings einhältst)</p>",
        "id": 166888792,
        "sender_full_name": "Heike Dewenter",
        "timestamp": 1559203660
    }
]