[
    {
        "content": "<p>Hallo,</p>\n<p>mir sind die verwendeten Codes in den Basis-Namingsystems aufgefallen:</p>\n<div class=\"codehilite\"><pre><span></span>&lt;type&gt;\n    &lt;coding&gt;\n        &lt;system value=&quot;http://hl7.org/fhir/v2/0203&quot;/&gt;\n        &lt;code value=&quot;PRN&quot;/&gt;\n    &lt;/coding&gt;\n&lt;/type&gt;\n</pre></div>\n\n\n<p>Würde nicht der Code MD oder DN bei dem LANR-Namingsystem besser passen, sowie bei BSNR -&gt; XX?<br>\nTendenziell denke ich dass MD besser ist als DN...</p>\n<p>Gruß Max Reith</p>",
        "id": 173634053,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1566284796
    },
    {
        "content": "<p>Ich glaube, das ist ein Fehler. Der IDentifier-Type für LANR müsste  \"LANR\" lauten...</p>\n<p>Sonst wüsste ich nicht, warum wir den Code \"LANR\" in das ValueSet <a href=\"http://fhir.de/ValueSet/identifier-type-de-basis\" target=\"_blank\" title=\"http://fhir.de/ValueSet/identifier-type-de-basis\">http://fhir.de/ValueSet/identifier-type-de-basis</a> aufgenommen hätten...</p>",
        "id": 173789354,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566391124
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> ...?</p>",
        "id": 173789493,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566391234
    },
    {
        "content": "<p>siehe dazu auch die Beschreibung im R4-Guide: <a href=\"https://simplifier.net/guide/basisprofil-de-r4/LebenslangeArztnummerLANR\" target=\"_blank\" title=\"https://simplifier.net/guide/basisprofil-de-r4/LebenslangeArztnummerLANR\">https://simplifier.net/guide/basisprofil-de-r4/LebenslangeArztnummerLANR</a></p>",
        "id": 173789549,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566391285
    },
    {
        "content": "<p>Stimmt, das ist tatsächlich nicht konsistent ...<br>\nDie Frage ist: macht ein type \"LANR\" Sinn, wenn das system dies schon aussagt? Das stammt ja aus v2-Zeiten, wo es keine Namespaces im FHIR-Sinn gibt.<br>\nVon daher würde ich für Max' Vorschlag plädieren: type=MD für LANR und analog type=XX für BSNR.<br>\nDies vorbehaltlich der Klärung, ob die Bedeutung \"Medical License number\" für MD eine spezifsche Bedeutung hat (z.B. nur für den US-Realm oder ähnliches).<br>\nLANR und BSNR würden dann nicht mehr im identifier_type-VS benötigt und wir würden uns dem originalen FHIR-VS wieder annähern.</p>",
        "id": 173791655,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1566392764
    },
    {
        "content": "<p>Dringend brauchen tun wir den Type-Code bei LANR nicht, aber</p>\n<blockquote>\n<p>Die Angabe des Identifier-Types ist optional, da die LANR als solche anhand der einheitlichen Namespace-URL \"<a href=\"http://fhir.de/NamingSystem/kbv/lanr\" target=\"_blank\" title=\"http://fhir.de/NamingSystem/kbv/lanr\">http://fhir.de/NamingSystem/kbv/lanr</a>\" zu erkennen ist. Die Angabe des Types kann jedoch hilfreich sein, wenn sowohl LANRs als auch ZANRs (Zanharztnummern) verwaltet werden müssen, da letztere über keinen einheitlichen Namensraum verfügen und daher ausschließlich am Typ als ZANR erkennbar sind.</p>\n</blockquote>",
        "id": 173793543,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566394118
    },
    {
        "content": "<p>Da wir bei ZANR mit \"ZANR\" zu typisieren und LANR mit \"LANR\" ist halt irgendwie konsistent und Intuitiv...<br>\nMein Argument wäre: Unter \"LANR\" kann sich jeder in DE etwas vorstellen, unter \"MD\"/\"PRN\" nicht unbedingt...<br>\nund außerhalb von DE interessiert sich niemand für LANRs...</p>",
        "id": 173793714,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566394231
    },
    {
        "content": "<p>ohne dabei gewesen zu sein würde ich vermuten, dass es in der Vergangenheit bereits die Diskussion gab, ob LANR=PRN/MD und man sich für \"nein\" entschieden hat, was dazu führte, dass die LANR in das V2-ValueSet aufgenommen wurde. Was auch immer die Gründe waren...</p>",
        "id": 173793798,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566394308
    },
    {
        "content": "<p>Ja richtig, ich glaube, die Differenzierung zur ZANR war der Grund, warum wir LANR als type eingebaut hatten (bzw. wollten ...).<br>\nDann macht es wahrscheinlich doch Sinn, LANR zu nehmen.<br>\nWobei ich im Rahmen der Basisprofile auch kein Problem hätte, MD als alternativen bzw.  umfassenderen type code für LANR bzw. ZANR zu erlauben</p>",
        "id": 173812565,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1566406621
    },
    {
        "content": "<p>Ich hab den Type als Pattern hinterlegt, daher sind Alternative Codierungen problemlos möglich...</p>",
        "id": 173822520,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566413888
    },
    {
        "content": "<p>Generell würde ich für den Raum DE zustimmen, allerdings möchte ich zumindest zur Diskussion stellen, dass man ja auch international verständlich sein könnte. Also dass man nicht NUR einen nationalen Code verwendet. Nach kurzer Recherche könnte der CODE MD allerdings doch eher einer Nummer für die Approbationsurkunde gleichen...</p>",
        "id": 173856861,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1566456041
    },
    {
        "content": "<p>Also um das nochmal weiter zu konkretisieren, auch wenn sich außerhalb von D niemand um LANR schert, wäre es für denjenigen zumindest gut zu wissen, dass er diese Nummer nicht benötigt.</p>",
        "id": 173860633,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1566460528
    },
    {
        "content": "<p>Und wenn man in Richtung medizinische Informationsobjekte denkt, dann könnte dieses Namingsystem auch bei ausländischen Empfängern landen, sei es zu Forschungszwecken (oder wenn Derjenige umgezogen ist)</p>",
        "id": 173860808,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1566460734
    },
    {
        "content": "<p>Ich vermute, dass außerhalb DE die LANR schlicht als Fremdschlüssel aufgefasst würde, ohne den Versuch zu unternehmen, diesem Semantik beizumessen. Aber wenn's der usecase erfordert, kann man den Type ja gerne doppelt codieren (type.coding 0..*), dann würde auch ein ausländisches System die LANR als PRN erkennen können.</p>",
        "id": 174231587,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1566914398
    }
]