[
    {
        "content": "<p>Hallo liebe Terminologen,</p>\n<p>ich benötige Eure Hilfe bei der Erstellung eines geplanten Implementierungsleitfadens \"Dermatologisches Konsil\" auf Basis von CDA.<br>\nDazu ist mittlerweile die Aufnahme der fachlichen Anforderungen erfolgt - und wie zu erwarten war sind dabei natürlich auch eine ganze Reihe von \"Konzepten\" herausgekommen.<br>\nViele davon konnte ich auch auf bereits existierende Codysysteme abbilden, zu anderen aber habe ich so gar nichts passendes gefunden.<br>\nErschwerend kommt hinzu, dass durch die geplante kommerzielle Verwendung derzeit auch nur die \"freien\" Codes aus SNOMED CT verwendbar sind (also aus dem GPS und dem Bereich für IPS?).</p>\n<p>Was mir also im Einzelnen noch fehlt:</p>\n<p>(1) Ein Konzept \"Verlauf einer Hautveränderung\" (oder abstrakter: ein Problemverlauf)<br>\nHierzu sind gewünschte Ausprägungen: \"Unverändert\", \"Zunehmend\", \"Rezidivierend\" und \"Veränderung durcch externe Faktoren\" - also eine wilde Mixtur aus unterschiedlichen Aspekten eines Problemverlaufs.</p>\n<p>(2) \"Art der Veränderung eines Hautproblems\"<br>\nSchwierig zu beschreiben, wie das genau gemeint ist - am besten auch anhand der gewünschten Ausprägungen: \"Veränderung der Grösse\", \"Veränderung der Form\". \"Veränderung der Farbe\" und \"Veränderung des (sonstigen) Aussehens\".<br>\nFachlicher Hintergrund ist hier eine Begründung, wieso ein Hautmelanom vermutet wird (aka: je mehr optische Aspekte sich verändern, desto wahrscheinlicher ist es ein Melanom).</p>\n<p>(3) \"Klassifizierung einer (dermatologischen) Fotografie\"<br>\nHierdurch sollen Fotografien innerhalb des Konsil attributiert werden als: \"Übersichtsfoto\", \"Nahaufnahme\" oder \"Dermatoskopieaufnahme\".<br>\nFachliches Ziel ist eine Größenabschätzung der abgebildeten Hautstelle (in der Regel wird nur bei einer Dermatoskopieaufnahme ein Vergleichsmassstab eingeblendet).</p>\n<p>(4) \"Bewertungsaspekt\" und \"Bewertung\" eines Konsils<br>\nSpeziell hier bei diesen Konsilen soll so etwas wie ein \"360-Grad-Feedback\" eingebaut werden, bei der jeweils der Gegenseite zurückgemeldet wird, wie ihre Arbeit eingeschätzt wird.<br>\nAls zu bewertende Aspekte wurden \"Qualität der Anamnestischen Angaben\", \"Bildqualität\" und \"Qualität des Konsiliarberichts\" gewünscht, jede dieser Aspekte soll dann grob mit \"gut\", \"ausreichend\" oder \"unzureichend\" bewertet werden.</p>\n<p>Falls also hier jemand etwas bekanntes entdeckt oder eine Idee hat, wo ich dazu etwas finden kann: über Hinweise würde ich mich sehr freuen!</p>\n<p>Danke &amp; viele Grüße<br>\nHorst</p>",
        "id": 198590498,
        "sender_full_name": "Horst Kakuschke",
        "timestamp": 1590338605
    },
    {
        "content": "<p>Hallo Horst, evtl. beim Wundbericht?</p>",
        "id": 198636488,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1590387108
    },
    {
        "content": "<p>Hallo zusammen.</p>\n<p>Wenn ich das so lese, ist mein Eindruck: Das haben wir bei uns so nicht. Wir beschreiben keine Veränderungen, sondern nur den aktuellen Zustand. Letztlich ist die Frage aus meiner Sicht, wie gerade (2) gehandhabt werden soll. Vermutlich wäre es hier gut, mehrere Observations zu unterschiedlichen Zeitpunkten zu haben, in denen die jeweiligen Informationen angegeben sind. Dann bräuchte man entsprechend ein ValueSet, das die möglichen Ausprägungen enthält. Ich weiß, das hier ist der terminologien-Stream, aber wenn man darüber spricht, wie etwas terminologisch abgebildet werden soll, müssen wir auch darüber sprechen, wie es modelliert ist. </p>\n<p>Ergänzende Information: Im Wundbericht haben wir aktuell Example-ValueSets mit SNOMED-CT-Codes, die unabhängig sind von der freien Verfügbarkeit (GPS).</p>\n<p>Tut mir Leid, dass wir da nicht helfen können. <br>\nViel Erfolg.</p>",
        "id": 198638026,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1590388758
    },
    {
        "content": "<p>Hallo Mareike,</p>\n<p>schade, gerade auf den Wundbericht hatte ich Hoffnungen gesetzt, weil der ja fachlich nahe am dermatologischen Konsil ist.</p>\n<p>Zur \"Art der Veränderung eines Hautproblems\" (Punkt 2): so richtig glücklich bin ich damit auch nicht.<br>\nNur haben mir die beteiligten Ärzte dazu erklärt, dass ja im ambulanten Bereich viele Beobachtungen auch Selbstbeobachtungen des Patienten sind, die dadurch eher unquantifiziert und entsprechend vage sind.<br>\nDaher ist diese Angabe dazu gedacht, abstrakter als einzelne \"observations\" eine Einschätzung und Zusammenfassung des das Konsil beauftragenden Arztes abzugeben.</p>\n<p>Danke für die Rückmeldung!</p>",
        "id": 198640841,
        "sender_full_name": "Horst Kakuschke",
        "timestamp": 1590391422
    },
    {
        "content": "<p>Die Veränderung der Wund wäre auch eine Observation, welche von allen Observations derived die hierfür genutzt wurden.</p>",
        "id": 198668800,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1590413310
    },
    {
        "content": "<p>Ggfs auch ein MedicalAssesment, aufgrund der Maturity wäre ich aber für eine Observation</p>",
        "id": 198668834,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1590413333
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>  wir sind hier in der CDA-Welt... </p>\n<p>Für mich war die Frage nach der Modellierung insofern relevant, als dass diese Auswirkungen auf die ValueSets hat (Zustand vs. Veränderung). Aber auch CDA kennt Observations <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 198669185,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1590413543
    },
    {
        "content": "<p>ohhh! Sorry ich nehme alles zurück.</p>",
        "id": 198669293,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1590413636
    },
    {
        "content": "<p>Aber dann würde ich das als trotzdem als eine abgeleitet Observation sehen. Ich brauche erst die Zustände.<br>\nVon diesen kann ich dann die Übergänge ableiten.<br>\nDas VS hierfür wird ein anderes sein als das ZustandsVS</p>",
        "id": 198669436,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1590413715
    },
    {
        "content": "<p>Die Frage von Mareike nach der Modellierung ist berechtigt. Es geht hier erstmal um die Erfassung der Zusammenhänge, d.h.welche Informationen überhaupt vorliegen bevor man sich überlegt, wie man das umsetzt.  Da ist es dann egal, ob das CDA oder FHIR ist.</p>",
        "id": 198676011,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1590417856
    },
    {
        "content": "<p>Die Diskussion passt schon...</p>\n<p>Hier bei den Konsilen haben wir die historische Sicht auf einzelne Zustände zu bestimmten Zeitpunkten leider nicht - die Situation ist im ambulanten Bereich deshalb anders, weil der Patient ja nicht wie bei stationärer Behandlung unter permanenter Beobachtung steht.</p>\n<p>Folgende Situation: beim Hausarzt sitzt heute ein Patient, der sagt \"ich habe da vor 3 Monaten eine Fleck auf der Haut bemerkt, der wurde immer größer, und deshalb bin ich zu Ihnen gekommen\".<br>\nDann vermerkt der Arzt also \"Fleck\", \"seit 3 Monaten\" und \"wird größer\" im Konsil, macht noch ein Foto und schickt das als Konsilauftrag zur Bewertung an einen Dermatologen.<br>\n\"Fleck\" und \"seit 3 Monaten\" ist einfach - nur das \"wird größer\" weiß ich derzeit noch nicht sinnvoll auf ein Konzept abzubilden.</p>",
        "id": 198683469,
        "sender_full_name": "Horst Kakuschke",
        "timestamp": 1590422931
    },
    {
        "content": "<p>SnomedCT hätte hierzu Konzepte. Bspw: 107645002 Size finding (finding) hat noch 17 children um den Verlauf der Größe angeben zu können.</p>",
        "id": 198689283,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1590428035
    },
    {
        "content": "<p>Das würde ja gut passen - wenn wir denn eine Lizenz für SNOMED CT hätten.<br>\n So aber bleibt dann wohl nur, eine temporäre Codierung zu erfinden, bis wir SNOMED CT nutzen können?</p>",
        "id": 198704115,
        "sender_full_name": "Horst Kakuschke",
        "timestamp": 1590442931
    },
    {
        "content": "<p>Ab 1.1.2021 haben wir die Mitgliedschaft. Im Vorfeld könnt Ihr Euch bei der TMF eine Lizenz beantragen, sofern Ihr irgendwie mit der MII assoziiert seid.</p>",
        "id": 199302588,
        "sender_full_name": "Sylvia Thun",
        "timestamp": 1590925049
    },
    {
        "content": "<p>Ab 1.1.2021 ist damit SNOMED CT generell in Deutschland verwendbar? Das sind wunderbare Nachrichten!<br>\nMit der MII ist das Projekt zwar nicht assoziert, aber der produktive Einsatz ist auch erst ab 1.1.2021 geplant - wäre daher eine Aufnahme der SNOMED CT Codes in einen CDA Implementierungsleitfaden schon jetzt rechtlich vertretbar (sofern auf eine Nutzbarkeit erst ab 1.1.2021 hingewiesen wird)?</p>",
        "id": 199455512,
        "sender_full_name": "Horst Kakuschke",
        "timestamp": 1591080877
    },
    {
        "content": "<p>Ich würde generell einen Verweis auf die Lizenzen einbringen. Selbst wenn Deutschland Mitglied ist, muss beim National Release Center gegen eine Aufwandsentschädigung die Nutzung angemeldet/beantragt werden (bitte korrigiert mich, wenn ich da falsch liege, <span class=\"user-mention\" data-user-id=\"195473\">@Sylvia Thun</span> <span class=\"user-mention\" data-user-id=\"194953\">@Heike Dewenter</span> <span class=\"user-mention\" data-user-id=\"212996\">@Elisabeth Pantazoglou</span>). Von daher sollte ein entsprechender Hinweis immer noch rein. HL7 Deutschland hat auch mit SNOMED CT vereinbart, dass in den HL7 Implementierungsleitfäden SNOMED-Codes verwendet werden dürfen (Nur die Spezifikation!). Welche IGs das konkret umfasst, da bin ich unsicher. Ich habe das immer so aufgefasst, dass es sich um die IGs handelt, die auch nach HL7-Regeln abgestimmt und entsprechend publiziert werden.</p>",
        "id": 199455974,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1591081326
    },
    {
        "content": "<p>Wenn in den HL7 Implementierungsleitfäden SNOMED-Codes verwendet werden dürfen, die nach HL7-Regeln abgestimmt werden, hätte ich ja kein Problem damit: die Abstimmungsankündigung ist schon für das nächste Interopforum geplant.<br>\nWie müsste dann der Verweis auf die Lizenz aussehen, gibt es dafür eine Quelle, bei der ich das \"abschreiben\" kann?</p>",
        "id": 199456227,
        "sender_full_name": "Horst Kakuschke",
        "timestamp": 1591081665
    },
    {
        "content": "<p>So mache ich das: <a href=\"https://simplifier.net/guide/IGePflegebericht/CodesystemefrpflegerischeKlassifikationen\">https://simplifier.net/guide/IGePflegebericht/CodesystemefrpflegerischeKlassifikationen</a></p>",
        "id": 199456350,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1591081767
    },
    {
        "content": "<p>Ist aber nur ein Beispiel.</p>",
        "id": 199456377,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1591081798
    },
    {
        "content": "<p>Das sieht gut aus. Danke!</p>",
        "id": 199456902,
        "sender_full_name": "Horst Kakuschke",
        "timestamp": 1591082276
    },
    {
        "content": "<p>Sobald Deutschland den Mitgliedsstatus erreicht, und ein National Release Center eingerichtet hat, müssen SCT Lizenzen über dieses bezogen werden. Ob das NRC eine Aufwandsentschädigung erhebt, obliegt dem NRC. In europäischen Nachbarländern (Mitgliedsstaaten)  ist das momentan nicht der Fall.</p>",
        "id": 199632011,
        "sender_full_name": "Heike Dewenter",
        "timestamp": 1591197119
    },
    {
        "content": "<p>Eine gültige Klausel für die Verwendung im Rahmen der Lizenz ist im Affiliate Licensing Agreement der SNOMED Intl.  enthalten. Diese sollte man entsprechend rauskopieren und verwenden.</p>",
        "id": 199632443,
        "sender_full_name": "Heike Dewenter",
        "timestamp": 1591197289
    },
    {
        "content": "<p>Das wären dann ja die kompletten Kapitel 1 bis 4 und Kapitel 8 aus dem Affiliate Licensing Agreement der SNOMED Intl., die man als Klauseln übernehmen müsste?</p>",
        "id": 199634065,
        "sender_full_name": "Horst Kakuschke",
        "timestamp": 1591197968
    },
    {
        "content": "<p>Kurze Frage noch einmal dazu: Reicht es denn dann nicht, das PDF zu verlinken? Den Inhalt (fast) komplett zu kopieren scheint mir jedenfalls nicht der richtige Weg zu sein. Der Hinweis, dass jemand Lizenzen benötigt, besagt ja schon, dass der Nutzer des Implementierungsleitfadens sich informieren muss.</p>",
        "id": 200065993,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1591602061
    },
    {
        "content": "<p>Oh ja, das wäre natürlich der einfachste (und beste) Ansatz.<br>\nDanke!</p>",
        "id": 200068309,
        "sender_full_name": "Horst Kakuschke",
        "timestamp": 1591604054
    }
]