[
    {
        "content": "<p>Is there a single-pass way in the AUPD specifications to get a listing of all providers working at a given clinic if all I know is the clinic name? The user's query is \"Show me all the providers at Newmarket Clinic\". I can do this in two passes by looking up the HPI-O or VDI first and then listing PracRoles from there,  but I haven't figured out a single-pass strategy. And on a related note, is there any formal guidance on how HealthcareService resources are supposed to be named?</p>",
        "id": 169674407,
        "sender_full_name": "John Carter",
        "timestamp": 1562280606
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"195045\">@John Carter</span>  assuming we are looking for an <a href=\"http://Organization.name\" target=\"_blank\" title=\"http://Organization.name\">Organization.name</a>  we have not included a requirement the the chained search on PractitionerRole that would help here; if we did support am thinking something like<br>\nGET [base]/PractitionerRole?organization.name=Newmarket Clinic&amp;_include=PractitionerRole:practitioner</p>",
        "id": 170447014,
        "sender_full_name": "Brett Esler",
        "timestamp": 1562674059
    },
    {
        "content": "<p>so will get a list of PractitionerRoles for that clinic and will include the details of the individual practitioner referenced from the role; i.e. the name etc of the practitioner person</p>",
        "id": 170447088,
        "sender_full_name": "Brett Esler",
        "timestamp": 1562674116
    },
    {
        "content": "<p>we did specify <a href=\"http://Organization.name\" target=\"_blank\" title=\"http://Organization.name\">Organization.name</a> search in the PD Organization profile search requirements; so think requiring a chained search on same parameter from PractitionerRole would not be a big ask...</p>",
        "id": 170447196,
        "sender_full_name": "Brett Esler",
        "timestamp": 1562674206
    },
    {
        "content": "<p>You could test it on our server too John, as it natively supports that chaining.</p>",
        "id": 170497339,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1562713054
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> that example would solve the problem for me, let's put that to the TWG and see if any objections. <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , thanks, good to know!</p>",
        "id": 170500105,
        "sender_full_name": "John Carter",
        "timestamp": 1562716129
    }
]