[
    {
        "content": "<p>Hi all, we have a need for the concept type (eg MPP, MPUU, TPUU etc) to be presented in the Medication resource. Currently we do not have a valueset defined for these types and we do not have a terminology server. But our downstream system needs to be able to consume the FHIR Medication and get at the type. We already have a number of extensions on the Medication model and I was going to add another called medication-type (with an appropriate URL) - sound reasonable? <span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> , Graham suggested I talk to you about it. Note this isn't Australia specific though, other terminologies need this data.</p>",
        "id": 153874563,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488507506
    },
    {
        "content": "<p>but could you define it in a cross- terminology way? I'm sceptical</p>",
        "id": 153874566,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488507601
    },
    {
        "content": "<p>AMT has MP, MPUU, MPP, TPUU, TPP, CTPP.<br>\nDM+D has VTM = MP,  VMP=MPUU, VMPP = MPP,  AMP = TPUU,  AMPP=TPP, TF=TP<br>\nRxNorm has SCD = MPUU, SBD = TPUU etc.</p>",
        "id": 153874568,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488507783
    },
    {
        "content": "<p>Vidal in France has similar types</p>",
        "id": 153874569,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488507825
    },
    {
        "content": "<p>NZULM has the same as AMT</p>",
        "id": 153874570,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488507840
    },
    {
        "content": "<p>We model all five of these and are expressing them back out as Medication resources</p>",
        "id": 153874571,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488507860
    },
    {
        "content": "<p>and our systems need to know what type of data they are getting so they can do the appropiate actions</p>",
        "id": 153874572,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488507888
    },
    {
        "content": "<p>So I am proposing <a href=\"http://fhir.hl7.org.nz/dstu2/StructureDefinition/medication-type\" target=\"_blank\" title=\"http://fhir.hl7.org.nz/dstu2/StructureDefinition/medication-type\">http://fhir.hl7.org.nz/dstu2/StructureDefinition/medication-type</a></p>",
        "id": 153874573,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488508070
    },
    {
        "content": "<p>See <a href=\"http://fhir.hl7.org.nz/dstu2/StructureDefinition/medication-isControlledDrug\" target=\"_blank\" title=\"http://fhir.hl7.org.nz/dstu2/StructureDefinition/medication-isControlledDrug\">http://fhir.hl7.org.nz/dstu2/StructureDefinition/medication-isControlledDrug</a> for example of another extension.</p>",
        "id": 153874574,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488508082
    },
    {
        "content": "<p>I guess this is a case of wanting more of the medications terminology model encapsulated in the Medication resource itself rather than relying on terminolgy services to determine the classification. <span class=\"user-mention\" data-user-id=\"191649\">@Andrew Patterson</span>  might have some comments.  Could we incorporate some indication of reference set as one of the codings i.e. part of AMT + in the MP/MPUU, etc.. ref sets - does that make sense?</p>",
        "id": 153874579,
        "sender_full_name": "Brett Esler",
        "timestamp": 1488510638
    },
    {
        "content": "<p>Why not just define a ValueSet using the AMT codes (and a ConceptMap to document the VTM = MP, etc relationships)?</p>",
        "id": 153874584,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1488513852
    },
    {
        "content": "<p>I think a precise definition across terminologies might be hard to pin down.. I find the concepts within AMT even a bit wooly. I mean 'unit of use' doesn't really actually correspond to the 'use' of the medicine - sometimes its a unitary measurement concepts (1ml of liquid), sometimes the physical artifact (capsule), sometimes the actuation of a nebuliser (a measure almost).</p>",
        "id": 153874585,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488513956
    },
    {
        "content": "<p>And what we call the container/packaging is pretty arbitrary sometimes</p>",
        "id": 153874586,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488514058
    },
    {
        "content": "<p>So given each 'class' (MPUU, MP) has a guaranteed known membership reference set that comes as part of the terminology - is it possible to specify in the Coding that not just is this an AMT code, but this is the AMT code that got picked from X reference set (sorry, using the SNOMED names, not sure of the FHIR equivs)</p>",
        "id": 153874588,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488514495
    },
    {
        "content": "<p>there's an extension for that. But these are actually orthogonal issues - which references set it was picked from, and indication that it has a particular value for some property of the code </p>",
        "id": 153874589,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488514565
    },
    {
        "content": "<p>Yeah agreed - trying to do terminology without a terminology service is hacky at the best of times</p>",
        "id": 153874590,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488514622
    },
    {
        "content": "<p>I have played with the notion of indicating generically what sort of thing a Medication is. Essentially AMT has 7 things which (mostly) map to Medication resources.</p>\n<p>MP = unbranded product with no strengths or form<br>\nMPUU = unbranded product with strengths and form<br>\nMPP = unbranded package with no container<br>\nTP - no translation<br>\nTPUU = branded product with strengths and form<br>\nTPP = branded package with no container<br>\nCTPP = branded package with container</p>\n<p>We could have some sort of indicator for the things on the right hand side which we could then map the various medicines dictionaries to. For example an indicator that means \"unbranded product with no strengths or form\" could have MP and VTM mapped to it.</p>\n<p>I've also experimented with indicating \"branded parent\" and \"unbranded parent\" references for Medication resources to indicate the links between them that you get from medicines terminology. Again looking for non-terminology specific names.</p>",
        "id": 153874883,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488777644
    },
    {
        "content": "<p>Agreed <span class=\"user-mention\" data-user-id=\"191649\">@Andrew Patterson</span> , the category definitions are the things that need to be clearly defined.<br>\n<span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> Why not use the definitions as the codes  (except for \"no translation\" :)</p>",
        "id": 153874919,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1488784327
    },
    {
        "content": "<p>Yes I think that's what is needed <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span>, the main thing is agreeing that those (or something else) are the set of codes and the mappings from those to the terminologies. I think that those are basically it though, if you look at what Medication resources can express. I suppose you could add in there unbranded/branded product with form but no strength - that's something that AMT doesn't have precoordinated.</p>",
        "id": 153874921,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488784821
    },
    {
        "content": "<p>The important thing is that if we're trying to brand a Medication resource as one of these things we don't use something like \"MP\" which only works for AMT content, something more general would be nice...</p>",
        "id": 153874922,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488785204
    },
    {
        "content": "<p>I definitely like the \"branded\", \"non-branded\" terms to refer to the split between left and right of the model. The line is clearly defined (I think) in all jurisdictions and across all drug terminologies. Plus, the actual wording of \"branded\" and \"non-branded\" is clear and unambiguous. I think there is already a boolean element for this in Medication (isBrand) - so problem solved going left or right.</p>",
        "id": 153874925,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488787010
    },
    {
        "content": "<p>Going up and down the model I think the lines are so much blurrier.. one persons container is another persons package is another persons form.. I've been experimenting with some model changes where rather than fixed boxes we instead have 'counting' relations and 'measuring' relations.. so a vial 'measures' an amount of liquid, but a box 'counts' the number of pills. And so then everything that is the source of a counting relationship is a 'package'. (but you get rid of the actual MPP, MPUU distinction)</p>",
        "id": 153874926,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488787234
    },
    {
        "content": "<p>But how you do those distinctions clearly in existing terminologies I don't know. I think a boolean isPackaging (ala isBrand) would be a perfectly valid way to distinguish the very bottom concepts (MPP, TPP, CTPP) across most drug models(?).</p>",
        "id": 153874927,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488787493
    },
    {
        "content": "<p>So a combination of isBrand and isPackaging could at least let someone narrow the Medication reference to the approximate quadrant of most drug models.. </p>",
        "id": 153874928,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488787615
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191649\">@Andrew Patterson</span>  isBrand is fine, but only gets us into the two halves, ie the branded vs unbranded model. However, isPackaging seems redundant when there is already Medication.package which would only be populated for a pack type - however I worry about relying on this being populated to determine this type, ie Medication.package.container plus isBrand would to signal that this is a CTPP - but some terminologies might not have the container info.</p>",
        "id": 153876778,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1489541454
    },
    {
        "content": "<p>We have already correlated six global terminologies to the AMT 7 box model (including substance) so I am wondering if we can just publish this mapping and use these types.</p>",
        "id": 153876779,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1489541593
    },
    {
        "content": "<p>5 sorry, one was internal. AMT, DM+D, NZULM, RxNorm, Vidal.</p>",
        "id": 153876780,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1489541621
    },
    {
        "content": "<p>I'll attach the same screenshot here.<a href=\"/user_uploads/10155/3YTw4Vqj3GL9P5cGda6Wox9l/Screen-Shot-2017-03-15-at-12.39.56-PM.png\" target=\"_blank\" title=\"Screen-Shot-2017-03-15-at-12.39.56-PM.png\">Screen-Shot-2017-03-15-at-12.39.56-PM.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/3YTw4Vqj3GL9P5cGda6Wox9l/Screen-Shot-2017-03-15-at-12.39.56-PM.png\" target=\"_blank\" title=\"Screen-Shot-2017-03-15-at-12.39.56-PM.png\"><img src=\"/user_uploads/10155/3YTw4Vqj3GL9P5cGda6Wox9l/Screen-Shot-2017-03-15-at-12.39.56-PM.png\"></a></div>",
        "id": 153876782,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1489542228
    },
    {
        "content": "<p>Yes that's why I favour using generic names for these things in FHIR, but providing the mapping from well known medicines terminologies to these categories.</p>\n<p><span class=\"user-mention\" data-user-id=\"191649\">@Andrew Patterson</span> I think the issues with forms and packages and \"units of use\" is a long standing issue with AMT. Because different use cases have been tied to the different boxes the modelling has been fudged to have \"an MPUU for this\" rather than modelling what is actually there. I think that the modelling can be corrected to make concepts that do fit between the various forms and packages. The thing this breaks is the use cases attached to concepts from a given \"box\" in the AMT model, which is what I think needs to change.</p>\n<p>Rather than attaching the use case to a \"box\" (or a reference set made up of concepts from that box), I think we need to create reference sets that are use case specific that cut across the \"boxes\" as needed to meet the use cases, and then stick to modelling reality when defining concepts in those boxes. This will stop the warring between the modelling and the what needs to be in a refset to meet a use case. <span class=\"user-mention\" data-user-id=\"192021\">@Matt Cordell</span> has done quite a bit of work on this.</p>\n<p>An example of this is <a href=\"https://ontoserver.csiro.au/shrimp/?concept=45369011000036109&amp;versionId=http%3A%2F%2Fsnomed.info%2Fsct%2F32506021000036107%2Fversion%2F20170228\" target=\"_blank\" title=\"https://ontoserver.csiro.au/shrimp/?concept=45369011000036109&amp;versionId=http%3A%2F%2Fsnomed.info%2Fsct%2F32506021000036107%2Fversion%2F20170228\">ancestim 1.875 mg injection, 1.875 mg vial (medicinal product unit of use)</a> when clearly a vial is a container.</p>\n<p>I think this is similar to your idea of not worrying about boxes and modelling what is there, I think we can do that by modelling according to the boxes but carve up the reference sets across the boxes instead.</p>\n<p>But rather than get tied up in specific AMT issues, and I'm sure the other medicines terminologies have their idiosyncrasies,  my point is that each of these terminologies does clearly define layers of abstraction that are equivalent as <span class=\"user-mention\" data-user-id=\"191477\">@Steve Swinsburg</span> points out.</p>\n<p>I think creating unambiguous labels for those layers in FHIR that are agnostic of any of the terminologies in question is probably the way to go, and allow for mappings from those terminologies to the agnostic FHIR label. It doesn't matter if there is no mapping from a particular terminology to one or more of the labels in FHIR - it just means that terminology doesn't have that layer. This allows clients of that FHIR label trigger rules or logic off those labels and have that code work regardless of the underpinning terminology provided it expresses those layers using the agnostic labels.</p>\n<p>Is there a problem with something like the following categories? Probably more intuitive than \"MPUU\" for the non-AMT/NZMT initiated.</p>\n<ul>\n<li>unbranded product with no strengths or form</li>\n<li>unbranded product with form but no strengths - AMT doesn't have this one, but I believe this is planned for the SNOMED CT drug content, not sure of the exact use case/s</li>\n<li>unbranded product with strengths and form</li>\n<li>unbranded package with no container</li>\n<li>branded product with strengths and form</li>\n<li>branded package with no container</li>\n<li>branded package with container</li>\n</ul>",
        "id": 153877438,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1489664830
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> would you imagine that being turned into a set of codes made up of those sorts of value? Or should there be some sort of acronym with an associated description as above? Also could substance/ingredient be added?</p>",
        "id": 153877601,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1489717162
    },
    {
        "content": "<p>Actually subtance should probably just be a Substance resource</p>",
        "id": 153877602,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1489717194
    },
    {
        "content": "<p>so not included in the list of types for a Medication</p>",
        "id": 153877603,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1489717213
    },
    {
        "content": "<p>So <span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> has dragged me into this, reminding me thatthere's this zulip channel :)</p>\n<p>I like the 7 categories Dion's listed above. You could generate lists of concepts, based on the available attributes (Similar, but not quite the same as the \"foundation\" refsets in AMT). (You could even add another category \"unbranded package with container\")</p>\n<p>As Dion says, I've got some ideas around what should happen with the UoU in AMT, as I think there's a lot of overloading the \"boxes\" to meet  _some_ use case(s)... E.g. \"MPUUs are for prescribing\" (hypothetically).<br>\nSo we end up concepts which could arguably represent the same thing... For example:</p>\n<ul>\n<li>45383011000036109|paracetamol 500 mg / 50 mL injection, 50 mL vial (medicinal product unit of use)|</li>\n<li>47033011000036101|paracetamol 500 mg / 50 mL injection, 1 x 50 mL vial (medicinal product pack)|</li>\n</ul>\n<p>I'd prefer the MPUU be something simpler like |paracetamol 10 mg / mL injection|, and use the MPP for the prescribing requirement. <br>\nWe could even say the PT is \"paracetamol 500 mg / 50 mL injection\"  - which means exactly the same thing as far as I'm concerned - if that's what clinicians are used to..</p>\n<p>So rather than say \"boxes\" are for a purpose. They simply define the meds to a certain level (category). Then define value sets these things for the various purposes (which might contain a mix of MPUU or MPP)</p>\n<p><span class=\"user-mention\" data-user-id=\"191649\">@Andrew Patterson</span> 's comment 'counting' relations and 'measuring' relations - simialr to the distinction I have in mind for the types of products maybe... The \"countable\" (or discrete)  things, have a unitary strength(?), e.g. mg/each (see tablets).  The 'measureables\" (or countinuants) have a concentration e.g. mg/mL, and the packs are defined as a specifiec mass or volume of the stuff... (as opposed to counts).</p>\n<p>I'm still working up a full proposal for consideration, but feel free to send any comments through. (inc. email, if I don't respond here)</p>",
        "id": 153877633,
        "sender_full_name": "Matt Cordell",
        "timestamp": 1489729178
    },
    {
        "content": "<p>catching up on this, the chatter i'm hearing suggests that every country is going to have the same basic need to categorise medication type, and it would be worth defining these base concepts across countries. If, that is, we can agree on which concepts apply....</p>",
        "id": 153879391,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490238758
    },
    {
        "content": "<p>Sorry, I've been on leave camping away from tech.</p>\n<p>Yes Grahame I think that's what's needed - a list of the types of thing a Medication can be that is generic and expresses the things that medication terminologies express. Each medication terminology can map to that and may cover all or only some of the types.</p>\n<p><span class=\"user-mention\" data-user-id=\"191477\">@Steve Swinsburg</span> I think we can start with that list and encompass all the in use variations (there's not that many of them).</p>\n<p>As a start how about</p>\n<div class=\"codehilite\"><pre><span></span>{\n  &quot;resourceType&quot;: &quot;CodeSystem&quot;,\n  &quot;name&quot;: &quot;Medication Type&quot;,\n  &quot;url&quot;: &quot;http://hl7.org/fhir/medication_type&quot;,\n  &quot;status&quot;: &quot;draft&quot;,\n  &quot;description&quot;: &quot;Code system of the different types of medication concepts and the scope that they encompass&quot;,\n  &quot;compositional&quot;: false,\n  &quot;content&quot;: &quot;complete&quot;,\n  &quot;concept&quot;: [\n    {\n      &quot;display&quot;: &quot;Unbranded product with no strengths or form&quot;,\n      &quot;code&quot;: &quot;UPNSNF&quot;,\n      &quot;definition&quot;: &quot;Concept representing a collection of ingredients as an unbranded medication with no included strengths or form&quot;\n    },\n    {\n      &quot;display&quot;: &quot;Unbranded product with form but no strengths&quot;,\n      &quot;code&quot;: &quot;UPFNS&quot;,\n      &quot;definition&quot;: &quot;Concept representing a collection of ingredients as an unbranded medication with a specified form but no strength information for ingredients&quot;\n    },\n    {\n      &quot;display&quot;: &quot;Unbranded product with strengths and form&quot;,\n      &quot;code&quot;: &quot;UPSF&quot;,\n      &quot;definition&quot;: &quot;Concept representing a collection of ingredients as an unbranded medication with specified ingredient strengths and a form&quot;\n    },\n    {\n      &quot;display&quot;: &quot;Unbranded package with no container&quot;,\n      &quot;code&quot;: &quot;UPNC&quot;,\n      &quot;definition&quot;: &quot;Concept representing a package containing medication/s with no specified container or brand information&quot;\n    },\n    {\n      &quot;display&quot;: &quot;Unbranded package with container&quot;,\n      &quot;code&quot;: &quot;UPC&quot;,\n      &quot;definition&quot;: &quot;Concept representing a package containing medication/s with a specified container but no brand information&quot;\n    },\n    {\n      &quot;display&quot;: &quot;Branded product with no strengths or form&quot;,\n      &quot;code&quot;: &quot;BPNSNF&quot;,\n      &quot;definition&quot;: &quot;Concept representing a collection of ingredients as a brand specific medication with no included strengths or form&quot;\n    },\n    {\n      &quot;display&quot;: &quot;Branded product with form but no strengths&quot;,\n      &quot;code&quot;: &quot;BPFNS&quot;,\n      &quot;definition&quot;: &quot;Concept representing a collection of ingredients as a brand specific medication with a specified form but no strength information for ingredients&quot;\n    },\n    {\n      &quot;display&quot;: &quot;Branded product with strengths and form&quot;,\n      &quot;code&quot;: &quot;BPSF&quot;,\n      &quot;definition&quot;: &quot;Concept representing a collection of ingredients as a brand specific medication with specified ingredient strengths and a form&quot;\n    },\n    {\n      &quot;display&quot;: &quot;Branded package with no container&quot;,\n      &quot;code&quot;: &quot;BPNC&quot;,\n      &quot;definition&quot;: &quot;Concept representing a brand specific package containing medication/s with no specified container&quot;\n    },\n    {\n      &quot;display&quot;: &quot;Branded package with container&quot;,\n      &quot;code&quot;: &quot;BPC&quot;,\n      &quot;definition&quot;: &quot;Concept representing a brand specific package containing medication/s with a specified container&quot;\n    }\n  ],\n  &quot;count&quot;: 11,\n  &quot;text&quot;: {\n    &quot;status&quot;: &quot;generated&quot;,\n    &quot;div&quot;: &quot;&lt;div xmlns=\\&quot;http://www.w3.org/1999/xhtml\\&quot;&gt;&lt;h2&gt;Medication Type&lt;/h2&gt;&lt;tt&gt;http://hl7.org/fhir/medication_type&lt;/tt&gt;&lt;p&gt;Code system of the different types of medication concepts and the scope that they encompass&lt;/p&gt;&lt;/div&gt;&quot;\n  },\n  &quot;versionNeeded&quot;: false\n}\n</pre></div>",
        "id": 153879651,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1490317036
    },
    {
        "content": "<p>Would anyone want to prescribe an unbranded product with strength but no form? e.g. take 500mg paracetamol as required.</p>",
        "id": 153879653,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1490318307
    },
    {
        "content": "<p>No, but medications aren't just for prescribing. I was trying to come up with a list of the sorts of levels there are in terminologies (which have many use cases), but to be fair that specific level isn't something that AMT supports and I'm not sure if others do.</p>\n<p>I'd be happy to take the approach of starting with a more limited set and growing it as needed. What I posted was just a straw man possible starting point.</p>",
        "id": 153879654,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1490318496
    },
    {
        "content": "<p>Good starting point.</p>",
        "id": 153879655,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1490318884
    },
    {
        "content": "<p>Agreed. I'll attempt to get the NZMT/ NZULM involved in this.</p>",
        "id": 153879656,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1490318988
    },
    {
        "content": "<p>ok, I think it's time to create a task and propose this on the mai implementers channel</p>",
        "id": 153879658,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490319328
    },
    {
        "content": "<p>Why are we not adding new elements (strength, form, package, etc.) to the Medication resource, so that each Medication instance can be matched to a category in a specific CodeSystem? Sorry if that's a stupid question.</p>",
        "id": 153879672,
        "sender_full_name": "David Cai",
        "timestamp": 1490330546
    },
    {
        "content": "<p>we might. but our usual style is to propose it as an extension. </p>",
        "id": 153879676,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490331298
    },
    {
        "content": "<p>first. and see how much it is used </p>",
        "id": 153879677,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490331310
    },
    {
        "content": "<p>but this one... it's a denormalization of the terminology... we typically find those controversial and they end up as extensions</p>",
        "id": 153879678,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490331336
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> thanks for the explanation.</p>",
        "id": 153879679,
        "sender_full_name": "David Cai",
        "timestamp": 1490331582
    },
    {
        "content": "<p>What's life without a bit of controversy?</p>",
        "id": 153879688,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1490333935
    },
    {
        "content": "<p>that'd be like working for a government department</p>",
        "id": 153879689,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490334293
    },
    {
        "content": "<p>I'm just wondering if rather than come up with another set of acronyms and definitions that describe the same thing, that we perhaps start with using the existing well known ones. In the diagram I posted earlier, we've already mapped these out for a bunch of national terminologies. As we add support for more terminologies, we'll continue to do this.</p>",
        "id": 153879815,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1490595761
    },
    {
        "content": "<p>Also, so I can move this forward, is medication-type ok as a name to represent this set of codes?</p>",
        "id": 153879817,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1490595980
    },
    {
        "content": "<p>For the extension name that is.</p>",
        "id": 153879818,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1490595993
    },
    {
        "content": "<p>I think medication-type is a good enough name.</p>\n<p>In terms of the acronyms I disagree - the AMT acronyms while meaning something to the initiated don't mean much outside that circle. I also don't think FHIR should adopt and align to any of the medicines terminologies in particular, but be a generic point that each of the terminologies can map to. On top of that I think the list we come up with in FHIR should be the superset of levels of representation that the individual medicines terminologies have - it is a pretty finite list but that approach doesn't favour or disadvantage any of the terminologies.</p>",
        "id": 153880353,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1490848138
    },
    {
        "content": "<p>I would like to run with this idea and create a AU valueset and extension of Coding</p>\n<ul>\n<li>unbranded product with no strengths or form</li>\n<li>unbranded product with form but no strengths - AMT doesn't have this one, but I believe this is planned for the SNOMED CT drug content, not sure of the exact use case/s</li>\n<li>unbranded product with strengths and form</li>\n<li>unbranded package with no container</li>\n<li>branded product with strengths and form</li>\n<li>branded package with no container</li>\n<li>branded package with container</li>\n</ul>\n<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span>  codes already thought up?</p>",
        "id": 153923346,
        "sender_full_name": "Brett Esler",
        "timestamp": 1512647306
    },
    {
        "content": "<p>also would like to add a </p>\n<ul>\n<li>branded product with no strengths or form</li>\n</ul>",
        "id": 153924141,
        "sender_full_name": "Brett Esler",
        "timestamp": 1512956533
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span>  using your example service and instances - maybe something like this?</p>\n<ul>\n<li>UPD unbranded product with no strengths or form</li>\n<li>UPDF (?? maybe) unbranded product with form but no strengths - AMT doesn't have this one, but I believe this is planned for the SNOMED CT drug content, not sure of the exact use case/s</li>\n<li>UPDSF unbranded product with strengths and form</li>\n<li>UPG unbranded package with no container</li>\n<li>BPDSF branded product with strengths and form</li>\n<li>BPG branded package with no container</li>\n<li>BPGC branded package with container</li>\n<li>BPD (?? maybe) branded product with no strengths or form</li>\n<li>BPDF (?? maybe) branded product with form but no strengths</li>\n</ul>",
        "id": 153924142,
        "sender_full_name": "Brett Esler",
        "timestamp": 1512956747
    },
    {
        "content": "<p>extension of Coding? or CodeSystem?</p>",
        "id": 153924153,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512964266
    },
    {
        "content": "<p>Coding - so can label the coding e.g. for AMT TPP and MPP levels</p>",
        "id": 153924154,
        "sender_full_name": "Brett Esler",
        "timestamp": 1512965620
    },
    {
        "content": "<p>Yes I've used those suggested above to label Medication resources which represent AMT concepts...but we discussed at the connectathon last week moving that to Coding. I was going to work up some examples changing from extension on Medication to Coding, but I've not done that yet. I'll do that one night this week, hopefully tonight.<br>\nThe other change I was going to make is include the AMT code and the generic codes above for each of the levels - so you can refer to the level by the drug terminology specific code if you know it, or the generic code if your code works across multiple drug terminologies.</p>",
        "id": 153924155,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1512965956
    },
    {
        "content": "<p>the ones I'm working with now are<br>\n    UnbrandedProduct(\"UPD\", \"Unbranded product with no strengths or form\"),<br>\n    UnbrandedProductStrength(\"UPDS\", \"Unbranded product with strengths but no form\"),<br>\n    UnbrandedProductForm(\"UPDF\", \"Unbranded product with form but no strength\"),<br>\n    UnbrandedProductStrengthForm(\"UPDSF\", \"Unbranded product with strengths and form\"),<br>\n    UnbrandedPackage(\"UPG\", \"Unbranded package with no container\"),<br>\n    BrandedProduct(\"BPD\", \"Branded product without strengths or form\"),<br>\n    BrandedProductStrength(\"BPDS\", \"Branded product with strengths but no form\"),<br>\n    BrandedProductForm(\"BPDF\", \"Branded product with form but no strengths\"),<br>\n    BrandedProductStrengthForm(\"BPSF\", \"Branded product with strengths and form\"),<br>\n    BrandedPackage(\"BPG\", \"Branded package with no container\"),<br>\n    BrandedPackgeContainer(\"BPGC\", \"Branded package with container\");</p>",
        "id": 153924156,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1512966025
    },
    {
        "content": "<p>BTW there is now a browser at <a href=\"https://medserve.online\" target=\"_blank\" title=\"https://medserve.online\">https://medserve.online</a> - the direct link is <a href=\"https://browse.medserve.online\" target=\"_blank\" title=\"https://browse.medserve.online\">https://browse.medserve.online</a></p>",
        "id": 153924157,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1512966093
    },
    {
        "content": "<p>cool</p>",
        "id": 153924158,
        "sender_full_name": "Brett Esler",
        "timestamp": 1512966119
    },
    {
        "content": "<p>I have a draft in AU base IG - have a preferred CodeSystem url for these?</p>",
        "id": 153924160,
        "sender_full_name": "Brett Esler",
        "timestamp": 1512966792
    },
    {
        "content": "<p>No, I made a dodgy CodeSystem resource a while back now and in the meantime I've been using <a href=\"http://hl7.org/fhir/medication_type\" target=\"_blank\" title=\"http://hl7.org/fhir/medication_type\">http://hl7.org/fhir/medication_type</a> but I'm not wedded to any of that.</p>\n<p>There's an example use at <a href=\"https://medserve.online/fhir/Medication/66681000036100\" target=\"_blank\" title=\"https://medserve.online/fhir/Medication/66681000036100\">https://medserve.online/fhir/Medication/66681000036100</a></p>",
        "id": 153924162,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1512966950
    },
    {
        "content": "<p>I'd love to formalise it though, and have a real CodeSystem resource and ValueSet to point at</p>",
        "id": 153924163,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1512966983
    },
    {
        "content": "<p>how about  <a href=\"http://hl7.org.au/fhir/CodeSystem/medication-type\" target=\"_blank\" title=\"http://hl7.org.au/fhir/CodeSystem/medication-type\">http://hl7.org.au/fhir/CodeSystem/medication-type</a>  and <a href=\"http://hl7.org.au/fhir/ValueSet/medication-type\" target=\"_blank\" title=\"http://hl7.org.au/fhir/ValueSet/medication-type\">http://hl7.org.au/fhir/ValueSet/medication-type</a>  for now?</p>",
        "id": 153924165,
        "sender_full_name": "Brett Esler",
        "timestamp": 1512967427
    },
    {
        "content": "<p>No problem. Do you want me to make the resources? Do we have somewhere to put them?</p>",
        "id": 153924168,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1512968174
    },
    {
        "content": "<p>i am just about done - I can publish in AU base IG.... a review would be good; just getting my build to work....</p>",
        "id": 153924169,
        "sender_full_name": "Brett Esler",
        "timestamp": 1512968232
    }
]