[
    {
        "content": "<p>Hi all - looking to locate drug schedule in AU profiles -  <a href=\"https://en.wikipedia.org/wiki/Standard_for_the_Uniform_Scheduling_of_Medicines_and_Poisons\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/Standard_for_the_Uniform_Scheduling_of_Medicines_and_Poisons\">https://en.wikipedia.org/wiki/Standard_for_the_Uniform_Scheduling_of_Medicines_and_Poisons</a> - would this be attribute of Medication resource?  <span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span>  <span class=\"user-mention\" data-user-id=\"192027\">@Liam Barnes</span>   have you included this in your work so far and do you have a vocabulary for the schedules?</p>",
        "id": 153965160,
        "sender_full_name": "Brett Esler",
        "timestamp": 1527558293
    },
    {
        "content": "<p>Maybe <a href=\"http://build.fhir.org/medicationknowledge.html\" target=\"_blank\" title=\"http://build.fhir.org/medicationknowledge.html\">MedicationKnowledge</a> in R4.</p>",
        "id": 153965167,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1527563365
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span>, the answer is yes and no.</p>\n<p>MedicationKnowledge doesn't seem to have it, and I thought it would be in the Medication Definition resources in R4 but it isn't there either I can see.</p>\n<p>I was initially going to put an extension on Medication in medserve.online, but at the moment the ARTGID is still an additional identifier for the Medication. I then planned to actually create some sort of regulation information resource, but that was before I saw the MedicationKnowledge and Medication Definition resources in the latest build.</p>\n<p>There is information in the TGA web service for the \"PoisonSchedule\" which is one of the attributes I was going to pull through, but I've not got around to that yet.</p>\n<p>To be honest I'm not really sure what the relationship is between the Medication Definition set of resources and the MedicationKnowledge resource. But my understanding is that for R4 Medication is supposed to be used for instance data and limited to just a wrapper of a code where possible, while the MedicationKnowledge resource is intended for terminological and drug database knowledge...but my understanding of all of that is far from perfect.</p>",
        "id": 153965169,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1527565042
    },
    {
        "content": "<p>I think wrt R3 I think an extension of Medication makes sense, or perhaps an extension of Medication to encapsulate all the regulatory information which this is one property of?</p>",
        "id": 153965170,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1527565130
    },
    {
        "content": "<p>Indeed the schedule information will likely end up in the definitional resource for medications - currently MedicationKnowledge.</p>",
        "id": 153965176,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1527573029
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> - can you explain the relationship between Medication, MedicationKnowledge and the set of Medication Definition resources, and where/how one is supposed to be used rather than another...I'm a little confused</p>",
        "id": 153965177,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1527573120
    },
    {
        "content": "<p>I am also looking at MedicationRequest, MedicationDispense content to include schedule as part of the prescribing, dispensing context...</p>",
        "id": 153965178,
        "sender_full_name": "Brett Esler",
        "timestamp": 1527573141
    },
    {
        "content": "<p>wel, these \"definition\" resouces (including MedicationKnowledge) are all draft resources, so there is no clear boundary</p>",
        "id": 153965181,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1527574682
    },
    {
        "content": "<p>for defining a drug in catalogs, one would expect to use a  definitional resource as\"medicationKnowledge\". the Medication resource is for specifying a drug (basically when you are not really defining a drug, but you just need to take whatever-characteristics-you-need-to-tell-the-next-person-what-they-ought-to-know).</p>",
        "id": 153965182,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1527574854
    },
    {
        "content": "<p>Example: in a prescription you can simply mention a code, but (some) implementers play it safe by sending also the name and other info.</p>",
        "id": 153965183,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1527574930
    },
    {
        "content": "<p>The other definition resources (i assume you talk about the ones from BRR), are the data set needed from a regulator's perspective according to IDMP.</p>",
        "id": 153965184,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1527574966
    },
    {
        "content": "<p>I am personally not sure they would survive as standalone resources. I mean, if you have a medication Definition resource that can incorporate all characteristics, then the IDMP concepts could actually be profiles of that master resource.</p>",
        "id": 153965185,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1527575051
    },
    {
        "content": "<p>Personally, as things advance, I am less convinced of the strict boundary between separating the Definition and theSpecification part (e.g. medication and medicationKnowledge are not that different in fact - same intent, one is a subset of the other, both are definitional).</p>",
        "id": 153965187,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1527575160
    },
    {
        "content": "<p>the boundary between kind and instanceis also not a good one between those - e.g. currently, medication without package info is \"kind\",  medication  without package info is \"instance\". I don't think that is very solid. But that will be best discussed harmonizing with other resources</p>",
        "id": 153965188,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1527575249
    },
    {
        "content": "<p>so, sorry for the brain dump. Short summary: MedicationKnowledge is currently the Medication Definition resource candidate. Knowing your terminology server, I think it is the one resource you should use.</p>",
        "id": 153965189,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1527575298
    },
    {
        "content": "<p>in prescriptions we will use medication, or perhaps Medication will be somewhat combined with MedicationKnowledge (the name may change)</p>",
        "id": 153965190,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1527575348
    },
    {
        "content": "<p>while that does not happen, in terminologies i'd use medicationKnowledge, in clinical workflows i'd use medication.</p>",
        "id": 153965191,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1527575404
    },
    {
        "content": "<p>Thanks for that explanation, that was very useful.</p>\n<p>It was mostly the Medication Definition resources which seem to be defined wrt IDMP that confuse me. I agree that Medication and the MedicationKnowledge things are very similar, just one a greater scope than the other, one just a profile. I can imagine these other definition resources also being an even wider scope and again building on the same thing...but there is probably a limited set of use cases for them, mostly in the regulatory data area.</p>\n<p>Exchanging clinical data I think for the most part the Medication resource just becomes a wrapper around the code, with the ability to provide additional identifying information and codes as you point out. It may also need to be some structured data for an extemporaneous thing that there is no code for.</p>\n<p>But this is really just a slice of the MedicationKnowledge scope, so to me they are just two profiles of the same thing for different use cases, so merging and profiling makes more sense to me. For example there's no reason why in instance clinical exchange you can't provide all the rest of the stuff in the MedicationKnowledge...except that it is probably not necessary, burdensome and redundant.</p>",
        "id": 153965197,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1527580326
    },
    {
        "content": "<p>To be honest I'm not keen to jump to MedicationKnowledge because I'm still not sure where it is all going and if that will turn out to be wasted effort. In the short term my plan is to build out extensions as they seem to make sense to me on STU3 Medication trying to keep them in line with what is in MedicationKnowledge at the time and see where it goes.</p>\n<p>I don't want to swap from Medication to MedicationKnowledge just to swap back again...</p>",
        "id": 153965198,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1527580437
    },
    {
        "content": "<p>I think your approach is very good -both in terms of how you see the different resources coming down to profiles, as well as waiting a little to see if medication will expand to cover medication Definition /knowledge</p>",
        "id": 153965205,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1527591592
    },
    {
        "content": "<p>With that approach, you should stick to what you have until a more solid resource comes up - but your input is very interesting so that we get to the good solution</p>",
        "id": 153965206,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1527591667
    },
    {
        "content": "<p>Sure, I'm happy to contribute - really my building out extensions on Medication is looking for these pieces that are missing and may be common. I'll keep reporting them and I'm keen to see where this goes and how I can help</p>",
        "id": 153965444,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1527655683
    }
]