[
    {
        "content": "<p>Hi All, I am exploring the 'dependsOn' attribute in FHIR ConcpetMap resource. Somehow the description of \"property\", \"display\" and \"Value\" is not very clear in the IG. Any leads on what each of them represents?</p>",
        "id": 194391409,
        "sender_full_name": "Manik Chopra",
        "timestamp": 1587092117
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> ?</p>",
        "id": 194391476,
        "sender_full_name": "Tim Blake",
        "timestamp": 1587092215
    },
    {
        "content": "<p>We don't have support for dependOn in Ontoserver,  partly because I couldn't unpick the doc, and also because we've not had call for it.<br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> would be the best to weigh in on the intended meaning I expect.</p>",
        "id": 194391555,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1587092340
    },
    {
        "content": "<p>In NSWHealth for Medications (transition of care project), I wanted to use it to represent some special cases where when we have one to many mappings between concepts and dependsOn can potentially help in narrowing when used with $translate.</p>",
        "id": 194392077,
        "sender_full_name": "Manik Chopra",
        "timestamp": 1587093005
    },
    {
        "content": "<p>The pattern looks really broken.  My understanding is that the target code has the relationship to the source code if, for each of the dependsOn.property URIs, there is a corresponding dependency.element parameter to $translate where dependsOn.value equals (one of) the dependency.concept.coding.concept values (and system matches also).  I'm kinda-surprised dependsOn.value is string-typed and not a valueCoding or valueCode.  It also doesn't seem to allow for dependencies that are not code-typed or have matching relationships other than equals.<br>\nOf course there's a slippery slope here and you really don't want to end up with a whole expression language (the unmapped semantics is already somewhat complex to deal with)</p>",
        "id": 194440976,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1587130651
    },
    {
        "content": "<p>It would, however, be very useful to have some real-world requirements to help guide the revisions that Vocab is currently making to ConceptMap.  Perhaps you could post some small example cases here or (better) on <a class=\"stream\" data-stream-id=\"179202\" href=\"/#narrow/stream/179202-terminology\">#terminology</a></p>",
        "id": 194441319,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1587130808
    },
    {
        "content": "<p>In spite of <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> 's (probably justified) skepticism about dependsOn, I think your described use case is probably what it is intended for. More concrete examples would be good, though</p>",
        "id": 195801768,
        "sender_full_name": "Jim Steel",
        "timestamp": 1588227481
    }
]