[
    {
        "content": "<p>Houston, we have a problem.</p>",
        "id": 153850953,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475020822
    },
    {
        "content": "<p>Following discussion on the HL7 Aus Patient Admin group, we looked further into to the legality of using government-issued identifiers such as the Medicare Card Number.  It turns out that principle 9 of the Australian Privacy Act is pretty clear that you cannot do so although there is a small loophole in that you can persist or share them as \"identifying information\" (the same applies to name, address, &amp;c., by the way).  The question now arises: does putting a Medicare Card Number in <code>Patient.identifier</code>make it an identifier, or does that still only qualify as identifying information?</p>",
        "id": 153850956,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475021229
    },
    {
        "content": "<p>Incidentally, it's also illegal for the receiver to harvest such identifiers from the data.</p>",
        "id": 153850957,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475021266
    },
    {
        "content": "<p>clearly only qualifies as identifying information. </p>",
        "id": 153850975,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475033680
    },
    {
        "content": "<p>you can't use medicare number as the logical id - that's what it means</p>",
        "id": 153850976,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475033690
    },
    {
        "content": "<p>if I read it correctly, then Medicare Card Number can be used as Business Identifier (Patient.identifier) of the Patient and it's not conflicting with the Privacy Act 9.. is this a right assumption ?</p>",
        "id": 153850977,
        "sender_full_name": "Shovan",
        "timestamp": 1475034315
    },
    {
        "content": "<p>I don't think it's at all clear that a business identifier is \"identifying information\".  It is, after all, an identifier, albeit in this case, someone else's.</p>",
        "id": 153850980,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475034499
    },
    {
        "content": "<p>If we share it as an identifier then it's arguable that we're using it as such.</p>",
        "id": 153850981,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475034544
    },
    {
        "content": "<p>Is the IHI also identifying information even though it's explicitly an exception to the government-issued identifier rule and can be used as an identifier?</p>",
        "id": 153850982,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475034671
    },
    {
        "content": "<p>no one else but the MyHR can use it as an identifier. The rest of us can only use it as identifying information </p>",
        "id": 153850985,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475035976
    },
    {
        "content": "<p>MyHR has special access to allow it to use the IHI as an identifier </p>",
        "id": 153850986,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475035996
    },
    {
        "content": "<p>which is why we can use it as the logical id on the MyHR</p>",
        "id": 153850987,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475036008
    },
    {
        "content": "<p>it is quite clear that a bsusiness identifier is 'identifying information'</p>",
        "id": 153850988,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475036024
    },
    {
        "content": "<p>there can more than one record in the system with the same drivers's license, medicare number etc </p>",
        "id": 153850989,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475036046
    },
    {
        "content": "<p>ergo, it's identifying information </p>",
        "id": 153850990,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475036050
    },
    {
        "content": "<p>You need to have a look at this page: <a href=\"https://www.oaic.gov.au/agencies-and-organisations/app-guidelines/chapter-9-app-9-adoption-use-or-disclosure-of-government-related-identifiers\" target=\"_blank\" title=\"https://www.oaic.gov.au/agencies-and-organisations/app-guidelines/chapter-9-app-9-adoption-use-or-disclosure-of-government-related-identifiers\">https://www.oaic.gov.au/agencies-and-organisations/app-guidelines/chapter-9-app-9-adoption-use-or-disclosure-of-government-related-identifiers</a>.</p>",
        "id": 153850992,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475041690
    },
    {
        "content": "<p>Where does it say that <code>Patient.identifier</code> is identifying information?  I'd love you to be right, but I need indisputable proof, otherwise we're gonna have to tell everyone to put such things in an extension.</p>",
        "id": 153850993,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475041776
    },
    {
        "content": "<p>Incidentally, looking at the legislation, anyone is allowed to use an HI number as their own healthcare identifier, not just the My Health Record system.</p>",
        "id": 153850995,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475041879
    },
    {
        "content": "<p>And that's part of the problem.  If I use the same field to send an IHI and a Medicare Card Number, then it can be argued that I'm treating them both the same and since one is a legal healthcare identifier, I could be deemed to be treating the second as such even though I had no intention of doing so. <img alt=\":disappointed:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/disappointed.png\" title=\":disappointed:\"> </p>",
        "id": 153850996,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475041973
    },
    {
        "content": "<p>(And not necessarily in the same resource instance, either.)</p>",
        "id": 153850997,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475041992
    },
    {
        "content": "<p>If you read chapter 9 in the link Stephen provided, it states:   </p>\n<p>9.5 An ‘identifier’ of an individual is defined in s 6(1) as a number, letter or symbol, or a combination of any or all of those things, that is used to identify the individual or to verify the identity of the individual.</p>\n<p>I would expect that Patient. Identifier would come under that use - you are using it as a way to identify or verify the patient's identity.  I would tread very carefully in providing advice that any government related identifier - including medicare number, drivers license number, DVA number etc, can be used in this instance.  It might be worth while getting legal advice on this area.</p>",
        "id": 153850999,
        "sender_full_name": "Rebbecca Matthews",
        "timestamp": 1475042432
    },
    {
        "content": "<p>Incidentally, this is not about the persisted resource, it's about the resource when it's sent to someone else.  When it's persisted you can clearly argue that the <code>Patient.id</code> is my identifier and <code>Patient.identifier</code> is simply additional identifying information.  However, when I choose to send the resource to someone else, all that context is gone (even though the distinction between <code>id</code> and <code>identifier</code> remains).  Now, all I have is a single piece of data with a Medicare Card Number, say, in a field named \"identifier\".  Furthermore, in practice, it's very unlikely that there'd be \"more than one record in the system with the same driver's license, medicare number etc.\"</p>",
        "id": 153851011,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475046918
    },
    {
        "content": "<p>Interesting discussion. Does the legislation say anything about using medicare card numbers in things like entitlements as specified in the NEHTA CDA IG specs and, in fact, used/implemented by DHS themselves?</p>",
        "id": 153851063,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1475070171
    },
    {
        "content": "<p>Yes.  That's okay because you are using the number to identify their entitlement to Medicare services, not to identify the person.  It's a very subtle, but crucial, difference.</p>",
        "id": 153851149,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475103638
    },
    {
        "content": "<p>I think you're being unrasonable to demand proof in an official international standard definition in order to conform to Australain regulartory issue. If you're really that bothered about it, you just document it clearly in the Australian profile. That's what we've done everyewhere else</p>",
        "id": 153851157,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475110831
    },
    {
        "content": "<p>It's not really me who's being demanding; it's the Australian privacy legislation and the advice from the Office of the Australian Information Commissioner.  I'm certainly happy to write this up in the Australian profile -- indeed, I intend to do so at length! -- but our reading of the legislation and the advice is that even if we're explicit in that documentation that <code>Patient.identifier</code> is strictly identifying information only, the fact that the underlying standard does not say that could be deemed to invalidate our documentation.  Furthermore, and _very_ sadly, even the name of element could be deemed evidence that the data is an identifier irrespective of what any documentation might say. <img alt=\":disappointed:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/disappointed.png\" title=\":disappointed:\"> </p>",
        "id": 153851163,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475116218
    },
    {
        "content": "<p>well, I guess we'll just not have to exchange it in any standard then, because all of them call it 'identifier' </p>",
        "id": 153851166,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475116617
    },
    {
        "content": "<p>I understand that it seems totally crazy, but that is actually what our legal folks are starting to suggest.  We obviously don't like it, but there are already e-mails circulating stating that we need to change all our specifications (v2, CDA, XDS, everything) that even hint that you can do this! <img alt=\":scream:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/scream.png\" title=\":scream:\"> </p>",
        "id": 153851183,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475122593
    },
    {
        "content": "<p>Unfortunately, simple good sense is unlikely to prevail on its own, so what I need is ammunition to fight back this wave of insanity!! <img alt=\":put_litter_in_its_place:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/put_litter_in_its_place.png\" title=\":put_litter_in_its_place:\"> </p>",
        "id": 153851184,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475123018
    },
    {
        "content": "<p>What does this mean from the act?</p>",
        "id": 153851186,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475123652
    },
    {
        "content": "<p>the use or disclosure is for the purpose of communicating or managing health information as part of:<br>\n(a) the provision of healthcare to the healthcare recipient; or<br>\n(b) the management (including the investigation or resolution of complaints), funding, monitoring or evaluation of healthcare; or<br>\n(c) the provision of indemnity cover for a healthcare provider; or<br>\n(d) the conduct of research that has been approved by a Human Research Ethics Committe</p>",
        "id": 153851187,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475123655
    },
    {
        "content": "<p>basically a healthcare provider can supply IHI for these purposes</p>",
        "id": 153851188,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475123718
    },
    {
        "content": "<p>i am pretty sure I could make a case for a patient administration system identifying a patient is part of the 'provision of healthcare to the healthcare recipient' </p>",
        "id": 153851189,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475123880
    },
    {
        "content": "<p>happily there seems to be no definition of 'provision of healthcare' </p>",
        "id": 153851190,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475123986
    },
    {
        "content": "<p>I think the definition of Identfier in the FHIR specs is a pretty good match to IHI usage<br>\n\"A numeric or alphanumeric string that is associated with a single object or entity within a given system. Typically, identifiers are used to connect content in resources to external content available in other frameworks or protocols. Identifiers are associated with objects, and may be changed or retired due to human or system process and errors.\"</p>",
        "id": 153851191,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475124199
    },
    {
        "content": "<p>Believe the usage question is up to the implementing heathcare system operators legal framework - especially as ALL material in a health record has privacy rules associated with it and we are not questioning the usage of that. Systems implemented delivering health care need to address usage concerns all the time.  HI is just another one with it's own set of rules. Having a representation of one form of another does not change the legal usage issues. Putting HI in an extension does not seem to change anything and just makes things more difficult for implementers.   </p>",
        "id": 153851192,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475124620
    },
    {
        "content": "<p>anyhow - right now i'm off to finish up a project that explicitly uses FHIR representation of IHI  to enable healthcare providers in the 'provision of healthcare to the healthcare recipient' ;)</p>",
        "id": 153851193,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475124984
    },
    {
        "content": "<p>IHI is explicitly excluded in its legislation from the general rule governing use of government-issued identifiers, so there is no problem whatsoever with putting an IHI in <code>Patient.identifier</code>. </p>",
        "id": 153851194,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125069
    },
    {
        "content": "<p>The same is true for all HI numbers, i.e. HPI-I and HPI-O as well.</p>",
        "id": 153851195,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125094
    },
    {
        "content": "<p>The problem is with Medicare Card Numbers, DVA Numbers, Military Health Numbers, &amp;c., &amp;c.</p>",
        "id": 153851197,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125136
    },
    {
        "content": "<p>What about the thousands of pathology messages  each day... this is pretty kooky... </p>",
        "id": 153851198,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475125175
    },
    {
        "content": "<p>I'm telling you that if anyone actually bothered to look into this, there could be trouble.</p>",
        "id": 153851199,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125231
    },
    {
        "content": "<p>But who knows?  Maybe they'll decide it's okay (whoever \"they\" are; perhaps the courts).</p>",
        "id": 153851200,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125270
    },
    {
        "content": "<p>But without a ruling the Agency (and HL7 Australia, I suspect) have to be whiter than white.</p>",
        "id": 153851201,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125298
    },
    {
        "content": "<p>We cannot be seen to be even hinting at encouraging something that _might_ be illegal. <img alt=\":disappointed:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/disappointed.png\" title=\":disappointed:\"> </p>",
        "id": 153851202,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125331
    },
    {
        "content": "<p>Australian Standards used for procurement already have a specification of representations - so every juisdiction would be the first  target - think this is about usage.</p>",
        "id": 153851203,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475125374
    },
    {
        "content": "<p>So unless someone can show me incontrovertibly that it is legal, I'm stuffed!</p>",
        "id": 153851204,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125398
    },
    {
        "content": "<p>I know, but what the standards say is irrelevant; they don't trump the law.</p>",
        "id": 153851205,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125447
    },
    {
        "content": "<p>Which, incidentally, is why we could still be in trouble even if our documentation clearly states that the data is \"identifying information\" only.  (Because our documentation doesn't trump the law either.)</p>",
        "id": 153851206,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125537
    },
    {
        "content": "<p>I don't think you need to define usage for the representation - can just state follow the usage laws for your jurisdiction - which after all can change anyway...  that is true of any piece of information... </p>",
        "id": 153851207,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475125541
    },
    {
        "content": "<p>We can tell people how to represent a Medicare Card Number, we just can't tell them \"Put it in <code>Patient.identifier</code>.\"</p>",
        "id": 153851208,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125618
    },
    {
        "content": "<p>In fact, we may be obligated to tell them \"Don't put it in <code>Patient.identifier</code>.\"</p>",
        "id": 153851209,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125670
    },
    {
        "content": "<p>why not?  it is just a representation - if I share you personal medical history on a web site then my usage is illegal regardless if it is FHIR, CDA or a word document</p>",
        "id": 153851210,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475125680
    },
    {
        "content": "<p>Because there's a risk that it could then be deemed that the Medicare Card Number is being used as an identifier of the person which is illegal.</p>",
        "id": 153851211,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125714
    },
    {
        "content": "<p>You could make that assertion if you put it in an extension also.<br>\nMight also consider that there are more uses than just sharing between external organizations where these cases are.<br>\nThere are plenty of uses where you want to share this content internally within an organization between applications, and these need these represnetations also.</p>",
        "id": 153851212,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1475125846
    },
    {
        "content": "<p>That risk does indeed exist, but there's a _lot_ you can do to mitigate against it so that the risk is virtually nil.</p>",
        "id": 153851213,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475125896
    },
    {
        "content": "<p>The same rules still apply to internally sharing the data within an organisation.  in fact, the risk is probably greater there.  Between organisations, it's easier to argue that I'm just sharing some data I know about this person; within an organisation you have much greater control of how things are said and so you have less wriggle-room.</p>",
        "id": 153851214,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475126033
    },
    {
        "content": "<p>all information is under a legal framework of usage; where it ends up in a representation is irrrelavant in court....don't get why we need to police this in the representation especially as the rules can change from scope of use, jursdiction and also by changes to legislation</p>",
        "id": 153851215,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475126044
    },
    {
        "content": "<p>i am not saying ignore the rules; just don't need to enforce them here... </p>",
        "id": 153851216,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475126113
    },
    {
        "content": "<p>That's not the advice we're getting.  We are being told that where \"it ends up in a representation\" is one of the key pieces of evidence used to determine whether a breach has occurred.</p>",
        "id": 153851217,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475126134
    },
    {
        "content": "<p>The argument is that if it represented in a data item named \"identifier\" it _might_ be hard to argue that it's not being used as an identifier.</p>",
        "id": 153851218,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475126227
    },
    {
        "content": "<p>But again, who knows.  Until a case goes to court, we're in the dark.</p>",
        "id": 153851219,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475126246
    },
    {
        "content": "<p>As long as the jurisdictions get sued first i'm happy... </p>",
        "id": 153851220,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475126278
    },
    {
        "content": "<p>And for us, being a government agency, we have to walk well clear of any possible lines here.</p>",
        "id": 153851221,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475126300
    },
    {
        "content": "<p>Re jurisdictions being sued first: <img alt=\":grinning:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/grinning.png\" title=\":grinning:\"> </p>",
        "id": 153851222,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475126310
    },
    {
        "content": "<p>The really annoying thing is that it's quite likely that no-one will ever care, but we still have to go to all this trouble just in case someone might.</p>",
        "id": 153851223,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475126508
    },
    {
        "content": "<p>strictly, medicare number is a coverage identifier </p>",
        "id": 153851225,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475130076
    },
    {
        "content": "<p>not a person identifier </p>",
        "id": 153851226,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475130090
    },
    {
        "content": "<p>but we're not proposing to use it in person.identifier, but in patient.identifier. </p>",
        "id": 153851227,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475130118
    },
    {
        "content": "<p>you should explain the difference</p>",
        "id": 153851228,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475130125
    },
    {
        "content": "<p>You're quite right; a patient is either not a person (e.g. animal) or it's a person strictly for the purposes of receiving healthcare and so, ontologically, they are not equivalent.  And that might've been a way round this whole mess, but unfortunately the legislation (or maybe the OAIC advice, I can't remember) explicitly mentions healthcare identifiers as an illegal use and it would be challenging to claim that <code>Patient.identifier</code> is not a healthcare identifier.</p>",
        "id": 153851390,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475194242
    },
    {
        "content": "<p>And yes, in our discussions with NIO, we have already decided the (very limited) use made of Medicare Card Numbers will be treated as coverage identifiers.</p>",
        "id": 153851392,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475194347
    },
    {
        "content": "<p>In fact, that was one of the things that prompted this discussion.</p>",
        "id": 153851393,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475194377
    },
    {
        "content": "<p>given what you've said, I don't see how associated the coverage identifier with the patient directly - whether by using Patient.identifier, or an extension - is going to allowed in agency specs. But HL7 Australia need not to be so conservative; we can quote the regulations and say that if you still want to use it as identifying information, it goes in Patient.identifier</p>",
        "id": 153851402,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475195721
    },
    {
        "content": "<p>We can certainly use it as a coverage identifier -- there's no question about that -- because that identifies the coverage, not the patient or person.  We've done this for a long time and is one of the main reasons that we have Entitlements in our Participation specification.  (We also handle Prescriber Number in this way.)</p>",
        "id": 153851404,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475198811
    },
    {
        "content": "<p>I think, as well, you may find that the HL7 Australia Board may not agree that they can be less conservative.  (Just saying; and I hope I'm wrong about that.)</p>",
        "id": 153851405,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475198908
    },
    {
        "content": "<p>I think there may be too much overthinking the situation.  It is not the role of the Agency or HL7 AU to enforce the APP legislation, but neither can either encourage people to breach legislation.  This means not providing examples of how government related identifiers, including but not limited to Medicare Nos, drivers license numbers, passport numbers, DVA or even tax file numbers, can be used to <strong>identify patients</strong> in healthcare systems.   Whether vendors etc currently do this or will do so in the future is not for us to police.  Only to provide appropriate guidance in the correct use within the Australian domain.</p>",
        "id": 153851512,
        "sender_full_name": "Rebbecca Matthews",
        "timestamp": 1475471159
    },
    {
        "content": "<p>Actually I would disagree with that comment Graham that the HL7 AU Board need  not be so conservative.  Given the legal obligations healthcare providers have around APP, should a system be developed that causes breaches of the APP, and a provider and/or vendor is sued, as a member of the Board, I would not want to be held accountable due a recommendation we made.    As you have mentioned, this can be managed in the Australian profile, but making any recommendation that promotes the breaching of legislation is not something HL7 Australia should consider.  </p>",
        "id": 153851513,
        "sender_full_name": "Rebbecca Matthews",
        "timestamp": 1475471393
    },
    {
        "content": "<p>of course not. But Stephen is advocating an extremely conservative position, where putting these identifiers in an element named 'identiifer' is somehow inferred to imply that the Agency is approving using these as primary identifiers, not just as identifying information. HL7 Australia should not be constrained in this fashion. while of course, HL7 Australia should still point out the difference</p>",
        "id": 153851518,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475471863
    },
    {
        "content": "<p>for HL7 Australia, this should not be an issue; we've been doing this for ages with the other specifications</p>",
        "id": 153851519,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475471892
    },
    {
        "content": "<p>The FHIR description of an Identifier would seem to make sense for Medicare Number; it is connecting the Patient to the Medicare usage... which has it's own framework and set of protocols... this seems to be a very good description... <br>\n\"A numeric or alphanumeric string that is associated with a single object or entity within a given system. Typically, identifiers are used to connect content in resources to external content available in other frameworks or protocols. Identifiers are associated with objects, and may be changed or retired due to human or system process and errors.\"</p>",
        "id": 153851520,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475472308
    },
    {
        "content": "<p>Who wrote that?  It is a very well considered description.... </p>",
        "id": 153851521,
        "sender_full_name": "Brett Esler",
        "timestamp": 1475472368
    },
    {
        "content": "<p>thx</p>",
        "id": 153851522,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475472391
    },
    {
        "content": "<p>The problem here is not just that it's named identifier; indeed, if that were the only problem, I don't think we'd be having this discussion.  The problem is that the <code>identifier</code> element is used to carry both identifying information, say a Medicare Card Number, and primary identifiers, say an MRN.  Unfortunately, that muddies the waters and means it's arguable that since one is primary identifier, all are.  Furthermore, not that I have anything against Grahame's description, but it equally applies to primary identifiers, so you cannot use it to rule out the fact that the Medicare Card Number is being used as such.</p>",
        "id": 153851729,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475535930
    },
    {
        "content": "<p>I think you are wrong to expect a policy question to be reflected in the content model. All of these things *are* identifiers. There are applicable policies that define when and how they should be used to identify things. Since the policy applies to the identifier by definition, it's neither here nor there whether the representation has a flag on it. Say we added a flag - would the absence of the flag affect whether you could use the identifer in a particular way? No, it wouldn't, and shouldn't. So it should - in any rational world - be enough to say 'this is how to represent it as an identifier and, don't forget, there's policy restraints on it's use'  (as we always have done). However I'm aware that we are rapidly leaving the rational world</p>",
        "id": 153851731,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475537047
    },
    {
        "content": "<p>e.g. a new mooted law to make re-identification illegal....</p>",
        "id": 153851732,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475537101
    },
    {
        "content": "<p>I totally agree with you.  This all seems big-time overkill/overreaction to me, but unfortunately the risk is real. <img alt=\":disappointed:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/disappointed.png\" title=\":disappointed:\"> </p>",
        "id": 153851742,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475540115
    },
    {
        "content": "<p>I'm assuming none of us are privacy lawyers here.  Seems we have at least three realms of potential specification use ... international, national, and agency specific.  I agree that we (Australian use) shouldn't give examples or recommendations for use that explicitly breaks australian law.  However, I also don’t think we should prohibit a mechanism that may be used quite appropriately.  Separation of policy and mechanism comes to mind.  Any Australian profile should appropriately reference any known and pertinent policy constraints.  </p>",
        "id": 153851760,
        "sender_full_name": "Andy Bond",
        "timestamp": 1475547350
    }
]