[
    {
        "content": "<p>Today <span class=\"user-mention\" data-user-id=\"191424\">@Heath Frankel</span> has reminded me that we have an HL7 Australian terminology service... should be at <a href=\"http://tx.hl7.org.au\" target=\"_blank\" title=\"http://tx.hl7.org.au\">tx.hl7.org.au</a>... but no one is using it. In fact, what would we use it for? why have it? is this a good thing?</p>",
        "id": 153927748,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515151315
    },
    {
        "content": "<p>Only thing I can think of is being the definitive location for the AU terminology content, which will be in the AU Implementation Guides.</p>",
        "id": 153927817,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1515188976
    },
    {
        "content": "<p>but we could host that on <a href=\"http://tx.fhir.org\" target=\"_blank\" title=\"http://tx.fhir.org\">tx.fhir.org</a>.... which would be easier more generally</p>",
        "id": 153927821,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515189959
    },
    {
        "content": "<p>Or the registry when that comes online?</p>",
        "id": 153927826,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1515190137
    },
    {
        "content": "<p>(I'm also not sure on what version that tx.hl7au is running)</p>",
        "id": 153927827,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1515190163
    },
    {
        "content": "<p>Think that is an older version of FHIR?  I would be happy with <a href=\"http://tx.fhir.org\" target=\"_blank\" title=\"http://tx.fhir.org\">tx.fhir.org</a> hosting..  <span class=\"user-mention\" data-user-id=\"191424\">@Heath Frankel</span> i can inform the HL7 AU board that the service <a href=\"http://tx.hl7.org.au\" target=\"_blank\" title=\"http://tx.hl7.org.au\">tx.hl7.org.au</a>... should/could be turned off</p>",
        "id": 153929373,
        "sender_full_name": "Brett Esler",
        "timestamp": 1516237273
    },
    {
        "content": "<p>gathering terminolgies from the published Base AU is on the cards - <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  how to go about inclusion for  <a href=\"http://tx.fhir.org\" target=\"_blank\" title=\"http://tx.fhir.org\">tx.fhir.org</a> ?  nominate content in the base AU spec download?</p>",
        "id": 153929374,
        "sender_full_name": "Brett Esler",
        "timestamp": 1516237437
    },
    {
        "content": "<p>I don't know what the process should be - I'll add it to my todo list</p>",
        "id": 153929406,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516270723
    },
    {
        "content": "<p>I'm not too sure how this fits in, or what the distinction should be, but the NCTS is attempting to be a source of terminology resource for FHIR profile binding as well, certainly from the Ageny's CI team but how much further it should or shouldn't go isn't completely clear. The vision and remit for the NCTS is to be a one stop authoritative source for the terminology resources needed for national specifications - intended to make it easier to get this content from a consistent, maintained source in a common form.</p>\n<p>Currently the NCTS is well short of that vision in terms of scope of content, but (while it may not seem like it) there is active work going on to realise that vision. The first round of resources to support the CI team's work will be published in February, and you can expect it to continue after that. The major hurdle for this work so far seems to be getting repeatable, maintainable processes and supporting data feeds, and appropriate legal agreements to publish the content and maintain it ongoing. However we're beginning to round some of those issues. The challenges aren't really technical.</p>\n<p>Clearly their purposes intersect, but what is the vision for the HL7 AU terminology server and how does it intersect and differ from the NCTS?</p>\n<p>To be clear I'm not trying to kill of one in favour of the other or have the NCTS take over the world, I just want to make sure we all understand the purposes of each so we don't unnecessarily duplicate effort and can coordinate/collaborate. There's plenty of work around without duplicating it!</p>\n<p>One suggestion (off the top of my head) is that each server could feed the other, and the owning organisations could maintain distinct sets of content. For example the NCTS may work through the Agency with other government agencies and departments to publish their canonical FHIR forms of their code systems, but get all HL7 international and AU defined code systems from the HL7 AU server and vice versa? Or is that duplicated content not worthwhile?</p>",
        "id": 153929551,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1516330324
    },
    {
        "content": "<p>I think the question was do we need the AU server at all, and could we just use the international server to host that content.<br>\nI personally don't have an issue with the AU content being in the NCTS, infact I would love it to be there.<br>\n(whole thread came around to see if the AU term server was still wanted, should be updated)</p>",
        "id": 153929556,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1516340364
    },
    {
        "content": "<p>I feel as though there's different sources of truth here - source of truth for forth coming ballots, and source of truth for adopted standards. Perhaps that's the difference between HL7 and NCTS?</p>",
        "id": 153929576,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516356336
    },
    {
        "content": "<p>To my mind it is a question of autonomy / control.  I would expect HL7 AU to want to be in control of content, and thus operate its own server.<br>\nI would dearly like this to be an Ontoserver instance and am happy to provide resources to make this happen.</p>",
        "id": 153934904,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1517532417
    },
    {
        "content": "<p>that would work for me</p>",
        "id": 153934905,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517532453
    },
    {
        "content": "<p>I am following up setup of HL7 AU Ontoserver instance to hold HL7 AU terminology content associated with all IG publications - there is also potential for NCTS to support republication and distribution channels through their network</p>",
        "id": 153935393,
        "sender_full_name": "Brett Esler",
        "timestamp": 1517875824
    },
    {
        "content": "<p>I was trying out this service and note that it's not returning json/xml ever...<br>\n<a href=\"https://www.healthterminologies.gov.au/integration/R4/fhir/CodeSystem/australian-indigenous-status-1\">https://www.healthterminologies.gov.au/integration/R4/fhir/CodeSystem/australian-indigenous-status-1</a><br>\nShould it?<br>\nI'm looking for a computable location to download these from via tooling.</p>",
        "id": 250438165,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1629774789
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> I'm not certain of how that url should function but the location you're looking for may be:<br>\n<a href=\"https://api.healthterminologies.gov.au/integration/R4/fhir/CodeSystem/australian-indigenous-status-1\">https://api.healthterminologies.gov.au/integration/R4/fhir/CodeSystem/australian-indigenous-status-1</a></p>",
        "id": 250446507,
        "sender_full_name": "Liam Barnes",
        "timestamp": 1629786145
    },
    {
        "content": "<p>Thanks, I'll give that a whirl.</p>",
        "id": 250448353,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1629788095
    },
    {
        "content": "<p>Has anyone done done an Australian localization of the Jurisdictions Valueset for use here?<br>\nAnd would that have more than just the states in it?<br>\n<a href=\"http://hl7.org/fhir/valueset-jurisdiction.html\">http://hl7.org/fhir/valueset-jurisdiction.html</a></p>",
        "id": 271354627,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1644444490
    }
]