[
    {
        "content": "<p>Folks, I've been wondering about building instances of <code>ImplementationGuide</code>, and I'm trying to figure out what level of granularity we would expect IGs built by the Agency to sit at.  Currently, all the IGs that I've seen appear to be organisation-wide (both DAF and Argonaut have a single IG).  However, it seems to me that we might like to have something more granular.  The choices are broadly</p>\n<ul>\n<li>one IG for the Agency as already described;</li>\n<li>having modular IGs, e.g. one for continuity of care, one for medications, one for Medicare-sourced data, &amp;c.; or</li>\n<li>one for each information exchange, i.e. a Discharge Summary IG, a Prescription IG, and Organ Donor IG, &amp;c.</li>\n</ul>\n<p>Does anyone have any thoughts or suggestions on the matter?</p>",
        "id": 153846024,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1472698249
    },
    {
        "content": "<p>yes, it's about lifecycle. I would have <br>\n- one IG for PCEHR<br>\n- one IG for NPDR<br>\netc</p>",
        "id": 153846026,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472699590
    },
    {
        "content": "<p>So point-to-point continuity of care would consistute an IG?</p>",
        "id": 153846030,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1472706114
    },
    {
        "content": "<p>we always said - probably wrongly - that was the same specs as the PCEHR. So that would say, no, not a different IG</p>",
        "id": 153846032,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472706564
    },
    {
        "content": "<p>Yeah, well, that's one of the things we're looking at correcting and we plan to have specs for general usage -- i.e. point-to-point -- and then specs (probably constraints of the general usage specs) for uploading data to the My Health Record system.</p>",
        "id": 153846033,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1472706763
    },
    {
        "content": "<p>well that would argue for 2 IGs, but it would be good to have a wider consultation and understanding of where this fits in with HL7 AUstralia process etc</p>",
        "id": 153846034,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472706817
    },
    {
        "content": "<p>CI have certainly never forgotten that there's digital health beyond the My Health Record event horizon.</p>",
        "id": 153846035,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1472706833
    },
    {
        "content": "<p>Yeah, so obviously, though collaboration is our new mantra, we're not clear on how we'd work that out with HL7 Australia yet.</p>",
        "id": 153846036,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1472706903
    },
    {
        "content": "<p>\"collaboration is our new mantra\"  :like</p>",
        "id": 153846037,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472707018
    },
    {
        "content": "<p>And transparent is the new black! <img alt=\":smiley:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/smiley.png\" title=\":smiley:\"> </p>",
        "id": 153846038,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1472707065
    },
    {
        "content": "<p>These are all good things of course and I'm only being slightly facetious because CI have always done our best to be collaborative and transparent; we just haven't been given much opportunity before.  Now it actually looks like we might! <img alt=\":grin:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/grin.png\" title=\":grin:\"> </p>",
        "id": 153846039,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1472707310
    }
]