[
    {
        "content": "<p>I attended a workshop on Indigenous Informatics at HIC today, and then had a discussion with Ray from CSIRO Herston who's working on Indigenous health issues. </p>\n<p>Coming out of those discussions, I have the following proposal for consideration:</p>\n<p>We should add an Indigenous Australian affairs appendix to the Australian Base FHIR IG. It would contain:</p>\n<ul>\n<li>the Name status extension</li>\n<li>the Australian language value set that covers native languages</li>\n<li>A standard social determinents of Health questionnaire developed with an appropriate indigenous community</li>\n<li>a note about how to tag resources, to mark that they contain information derived from or pertinent to indigenous communities (support various custody and provenance concerns that a strong in the existing community)</li>\n</ul>",
        "id": 173184177,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565771136
    },
    {
        "content": "<p>Note that the first 2 things already exist; we're not adding them.</p>",
        "id": 173184180,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565771148
    },
    {
        "content": "<p>the questionnaire part depends on finding an appropriate community to leverage existing work (e.g. 715). The rough idea is that we would work towards a common representation of a common SDoH questionnaire which would lead to more consistent data reporting infrastructure, which is clearly an operational challenge now. We have an opportunity to build community that will make a real difference here</p>",
        "id": 173184261,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565771252
    },
    {
        "content": "<p>note that there's plenty of work to do on this proposal on several fronts, so I'm just raising the idea at the moment</p>",
        "id": 173184312,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565771302
    },
    {
        "content": "<p>btw, does anyone know if there's a value set for which people you come from? and your skin name?</p>",
        "id": 173185232,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565772323
    }
]