[
    {
        "content": "<p>Do we have an Australia identifier registry in the IG? (I couldn't see one). In particular, do we have an agreement about the identifier system for NATA?</p>",
        "id": 153933900,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1517349626
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191649\">@Andrew Patterson</span> has been very patient... can we try and land this one?<br>\nNATA identifiers - accreditation and site numbers e.g. e.g. Buderim Private Hospital| ACCREDITATION NUMBER: 18663 | SITE NUMBER: 20670 |<br>\nsome questions/ statement for the diagnostics crowd to comment on <span class=\"user-mention\" data-user-id=\"192323\">@David McKillop</span> <span class=\"user-mention\" data-user-id=\"191397\">@Jared Davison</span>  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191391\">@Angus Millar</span>  <br>\n1) which is the number we mean in HL7 V2 (AUSNATA) ; examples in HB262 2012 seem to refer to ACCREDITATION NUMBER <br>\n2) ACCREDITATION NUMBER (first number in example) is not for a specific location; e.g.</p>\n<div class=\"codehilite\"><pre><span></span> 2623   20948   MATER LABORATORY SERVICES - Holy Spirit Northside Laboratory    Holy Spirit Northside Private Hospital 627 Rode Road , CHERMSIDE, QLD 4032\n 2623   2616    MATER LABORATORY SERVICES - Mater Pathology Raymond Terrace , SOUTH BRISBANE, QLD 4101\n 2623   23231   MATER LABORATORY SERVICES - Springfield Private Hospital    Mater Private Hospital Springfield Level 2, 30 Health Care Drive SPRINGFIELD CENTRAL, QLD 4300\n</pre></div>\n\n\n<ul>\n<li>does this make it an Organization.identifier</li>\n<li>might we use for HealthcareService.identifer (which could be location specific)<br>\n3) is SITE NUMBER in use in exchange; should we attempt to locate this in AU FHIR profiles also?</li>\n</ul>",
        "id": 153973680,
        "sender_full_name": "Brett Esler",
        "timestamp": 1530794241
    },
    {
        "content": "<p>and to the question at hand perhaps system URLs<br>\n<a href=\"http://hl7.org.au/id/nata-accreditation\" target=\"_blank\" title=\"http://hl7.org.au/id/nata-accreditation\">http://hl7.org.au/id/nata-accreditation</a><br>\n<a href=\"http://hl7.org.au/id/nata-site\" target=\"_blank\" title=\"http://hl7.org.au/id/nata-site\">http://hl7.org.au/id/nata-site</a></p>",
        "id": 153973752,
        "sender_full_name": "Brett Esler",
        "timestamp": 1530801551
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span>  I agree with you that the NATA number refers to the accreditation number and I also agree on the creation of specific URL's for \"nata-accreditation\" and \"nata-site\" be created to reduce any ambiguity.<br>\nAt the time of writing of HB 262-2012, NATA was one of three approved accreditation authorities used for diagnostic imaging (DI) and hence the use of the \"location specific practice number (LSPN)\" for DI. Hopefully whatever format/model is devised for NATA number will be suitable for LSPN's.<br>\nI'll flick an email to some of the HL7 Au O&amp;O members who may not be following Zulip that regularly for their input and report back any feedback.</p>",
        "id": 153973945,
        "sender_full_name": "David McKillop",
        "timestamp": 1530840046
    },
    {
        "content": "<p>HB-262 also says this:<br>\n8.1.1 AUSNATA<br>\nAustralian NATA (National Association of Testing Authorities).<br>\n8.1.6 AUSLSPN<br>\nAustralian Location Specific Practice Number which is specific to Diagnostic Imaging (To be proposed to HL7).</p>",
        "id": 153973950,
        "sender_full_name": "Angus Millar",
        "timestamp": 1530843729
    },
    {
        "content": "<p>And also in HB-262:<br>\n8.1.8 NATA NUMBER (NATA#)<br>\nThe number assigned to accredited diagnostics providers by the National Association of<br>\nTesting Authorities, Australia. Where a diagnostics provider has multiple sites use the<br>\nNATA Accreditation Number assigned to the major diagnostics provider site, e.g. The<br>\nBrisbane laboratory rather than regional laboratories.<br>\nNOTE: NATA number has been used in pathology since 1988; however in diagnostic imaging<br>\naccreditation became a mandatory prerequisite for Medicare benefits on 1 July 2008 with NATA<br>\ninvolvement subsequent to this date. Also, in diagnostic imaging NATA is one of 3 approved<br>\naccrediting agents at present, hence the NATA number will not be prevalent across all diagnostic<br>\nimaging providers.<br>\nThis item is used in contexts to uniquely identify diagnostics facilities and along with other<br>\nprimary identifiers to indicate the source of information.<br>\nExample:<br>\nMSH-4 Sending Facility value of ‘QML^2184^AUSNATA’ defines Queensland Medical<br>\nLaboratory.</p>",
        "id": 153973951,
        "sender_full_name": "Angus Millar",
        "timestamp": 1530843748
    },
    {
        "content": "<p>So the NATA number is a site accreditation. I'm not sure if it is specifically location specific or rather Organisation specific. I assume I can have two laboratory sites under the same  Organisation and only one NATA number. But the reverse is also true, One organisation can have many labs and many NATA numbers. But it is clear that in HB-262 it was used to mean \"Where this HL7 V2  message came from\" .</p>",
        "id": 153973953,
        "sender_full_name": "Angus Millar",
        "timestamp": 1530844170
    },
    {
        "content": "<p>And yes HB -262 also says this:<br>\n8.1.9 Practice name<br>\nEvery diagnostic imaging practice has a location specific practice number (LSPN) issued by<br>\nDOHA in the accreditation program. There can be multiple LSPNs per provider radiology<br>\ninformation system, hence the use of LSPN is problematic. This same problem exists in<br>\npathology with multiple NATA numbers for a particular organization.<br>\nFor this reason the provider name descriptor e.g. QXR, can be used in diagnostic imaging.</p>",
        "id": 153973954,
        "sender_full_name": "Angus Millar",
        "timestamp": 1530844318
    },
    {
        "content": "<p>Back to the Brett Questions:<br>\n1. A NATA number is an accreditation number but is used in HL7 V2 to indicate the Service the message comes from, in my view.<br>\n2. No, NATA number is not a specific location but rather a ring around a service that was all accredited as one.<br>\n3. In Pathology HL7 V2 messaging to GPs the NATA number is in use, in Radiology it is more often a local code e.g 'QXR'<br>\n - I feel like NATA number is a HealthcareService.identifer<br>\n - HPI-O cannot be dismissed here as it is a better match for the HB-262 intent, but its use is lowered.<br>\n-The current use of NATA number in V2 messaging is not to communicate that the lab is accredited but just to indicate where the message comes from.</p>",
        "id": 153973958,
        "sender_full_name": "Angus Millar",
        "timestamp": 1530846196
    },
    {
        "content": "<p>Agree with all that. We  (Pathology Providers) don't currently send the location (Worksite) that tested the sample unless it is a reference lab, and only then because it is required by NATA. Is the satellite lab that performed the test useful to anyone?</p>",
        "id": 153974297,
        "sender_full_name": "Michael Osborne",
        "timestamp": 1531133548
    },
    {
        "content": "<p>thanks for comments - we will put this on the agenda for tomorrow's HL7 AU PA WG call 11am <a href=\"https://zoom.us/j/7479215691\" target=\"_blank\" title=\"https://zoom.us/j/7479215691\">https://zoom.us/j/7479215691</a> will attempt to finalise a position for IG draft</p>",
        "id": 153975724,
        "sender_full_name": "Brett Esler",
        "timestamp": 1531829800
    }
]