[
    {
        "content": "<p>Conceptually I am thinking the two letter 'PBS Pharmeceutical Manufacturer Code' would be represented as an identifier? It is used as a reference to an Organisation with a name, address and telecom details... agree?<br>\nexample<br>\nMayne Pharma International Pty Ltd (Manufacturer code: YN)<br>\nLevel 1<br>\n99 King Street<br>\nMELBOURNE VIC 3000<br>\nTel:1300 081 849</p>",
        "id": 153889237,
        "sender_full_name": "Brett Esler",
        "timestamp": 1494494875
    },
    {
        "content": "<p>Medications working group is going around on PBS manufacturer code a couple of discussion topics<br>\na) PBS manufacturer is not necessarily the factory source rather can be factory OR supplier i.e. a sponsor - we are discussing not using Medication.manufacturer and using an extension instead to represent this concept (Medication.manufacturer is used to represent the responsible physical product  source only) - objections?<br>\nb) Reference to PBS manufacturer is via two letter manufacturer code - assertion is this is a logical identifier to an organisation that has a name, address, contact details etc. - would like a suitable URL to use as identifier system; we have a suggestion under <a href=\"http://pbs.gov.au\" target=\"_blank\" title=\"http://pbs.gov.au\">pbs.gov.au</a> but would like this ratified to include.  This overlaps with NCTS concept of adding properties to PBS Code system the complexity of PBS definition is troubling me as seem more like rule based eligibility criteria than coding alone - any comments on this?</p>",
        "id": 153977760,
        "sender_full_name": "Brett Esler",
        "timestamp": 1532473133
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192042\">@Steve Ball</span></p>",
        "id": 153977771,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1532477746
    },
    {
        "content": "<p>On PBS manufactuter, see <a href=\"https://dev.pbs.gov.au/docs/glossary/Manufacturer.html\" target=\"_blank\" title=\"https://dev.pbs.gov.au/docs/glossary/Manufacturer.html\">https://dev.pbs.gov.au/docs/glossary/Manufacturer.html</a></p>",
        "id": 153977830,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1532496493
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span>  that is super helpful and seems aligned to discussion in meds wg</p>",
        "id": 153978297,
        "sender_full_name": "Brett Esler",
        "timestamp": 1532606107
    }
]