[
    {
        "content": "<p>We've got a number of  Healthcare Service and Practitioner Role specialty codes in our internal directory that don't map well to the available SNOMED specialty codes. At a first glance, we have 30-40 specialty codes in HC service and a handful in PracRole that look they will be useful to add to the Australian or even the International editions of SNOMED. I'm guessing that others will have the same experience with their legacy data. The current definition (Mar 2018 Connectathon) of the profiles has the binding strength for both these specialty codes set to Required. While we go through the process of requesting new SNOMED concepts, does it make sense to relax the binding strength so we can send a legacy value when needed? Or is there a better way?</p>",
        "id": 153948525,
        "sender_full_name": "John Carter",
        "timestamp": 1522182671
    },
    {
        "content": "<p>how long is the process likely to take?</p>",
        "id": 153948533,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522183523
    },
    {
        "content": "<p>Best case they could be in the AU version in a month (and April), but for International it's unlikely they'd get in until the Jan 2018 release. If they started in AU, then they could be promoted to International and would thus retain their SCTIDs</p>",
        "id": 153948535,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1522184203
    },
    {
        "content": "<p>Jan 2019?</p>",
        "id": 153948538,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1522184393
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195045\">@John Carter</span> are these specialty codes used by Healthlink products &amp; services in NZ as well?</p>",
        "id": 153948540,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1522184616
    },
    {
        "content": "<p>um, 2019, yes :)</p>",
        "id": 153948551,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1522185519
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> Yes, we use our legacy specialties across both countries. Primarily to assist in searching for a provider or a practice.</p>",
        "id": 153948554,
        "sender_full_name": "John Carter",
        "timestamp": 1522185733
    },
    {
        "content": "<p>OK, another idea for a (partial) solution. Many of the concepts Im looking for and not finding in the existing value set (drawn from Healthcare service (qualifier value)) seem to be available under Physician service (procedure). By seem to be, I mean that these concepts have the right name and don't have any other attributes to suggest they mean anything different than what I want. Is it appropriate to expand the value set definition to include descendants of Physician  service alongside the Healthcare service concepts? I'm not sure the semantic ramifications of mixing those two trees in this value set.</p>",
        "id": 153948615,
        "sender_full_name": "John Carter",
        "timestamp": 1522194128
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> thanks for weighing in. I've submitted a batch request through proper channels just now with the proposed new Healthcare Service qualifier concepts.</p>",
        "id": 153948639,
        "sender_full_name": "John Carter",
        "timestamp": 1522204796
    }
]