[
    {
        "content": "<p>Is there any interest in moving the AU Base IG from XML to FSH? I started doing it as a test of GoFSH and it is an interesting test case.</p>",
        "id": 241423407,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1622740935
    },
    {
        "content": "<p>I wouldn't ordinarily speak for <span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> , but I'm going to suggest that yes, there would be interest</p>",
        "id": 241482065,
        "sender_full_name": "Jim Steel",
        "timestamp": 1622770991
    },
    {
        "content": "<p>Yes interested for sure...  we have a cohort of contributors that are Forge users so I am interested in non-lossy round tripping with FSH would like to move towards FSH but need to work out what to do with those not there yet....</p>",
        "id": 241490058,
        "sender_full_name": "Brett Esler",
        "timestamp": 1622780805
    },
    {
        "content": "<p>Sounds like a case of not only giving them a FSH and letting them eat for a day, but teaching them how to GoFSH, and eating for a lifetime! I'll show myself out...</p>",
        "id": 241490225,
        "sender_full_name": "Jim Steel",
        "timestamp": 1622781030
    },
    {
        "content": "<p>Round tripping is quite possible, but the round trip would no necessarily implement all features in exactly the same way. Moreover, we do not export XML.  We have a feature of GoFSH called \"FSHing trip\" that round-trips from JSON or XML -&gt; FSH -&gt; JSON.  But you end up with JSON. Once you see the FHIR profiles and examples in FSH, your team may indeed prefer working that way, keeping the gold sources in FSH. </p>\n<p>I am thinking of investing some time in this, partly as a debugging exercise for FSH tools, but only if there is a reasonable chance the results would be picked up.</p>",
        "id": 241560512,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1622824157
    },
    {
        "content": "<p>I've done it, so, does anyone want it?</p>",
        "id": 241714823,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1623020374
    },
    {
        "content": "<p>Cool! <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span>  I would love to check it out!</p>",
        "id": 241729382,
        "sender_full_name": "Brett Esler",
        "timestamp": 1623041771
    },
    {
        "content": "<p>Here is a zip file with the results:</p>\n<ul>\n<li>JSON files at the top level are the originals taken from <a href=\"https://build.fhir.org/ig/hl7au/au-fhir-base/examples.json.zip\">https://build.fhir.org/ig/hl7au/au-fhir-base/examples.json.zip</a></li>\n<li>The GoFSH directory contains:<ul>\n<li>/input/fsh contains the FSH translations of the original files</li>\n<li>/fsh-generated directory contains the \"reconstituted\" JSON results from running SUSHI compiler on the FSH files.<br>\nYou can use your favorite comparison software (e.g., BeyondCompare) to compare the originals with the \"reconstituted\" files to see what has been changed. They won't be exactly the same since I fixed a number or errors and stylistic quirks in the originals.</li>\n</ul>\n</li>\n</ul>\n<p><a href=\"/user_uploads/10155/p24H5NXljH97l0dwlXH9ZopQ/au-base-package.zip\">au-base-package.zip</a></p>",
        "id": 241767058,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1623068270
    },
    {
        "content": "<p>Thanks will take a look</p>",
        "id": 241781834,
        "sender_full_name": "Brett Esler",
        "timestamp": 1623075026
    },
    {
        "content": "<p>It wasn't obvious to me how to build your IG, but the gist for the next steps should be:<br>\n1) Remove the existing source files that define the profiles, extensions, value sets, etc. <br>\n2) Create an /input/fsh directory and put all the .fsh files there.<br>\n3) Run SUSHI, which will generate a fsh-generated folder containing what essentially is the replacement for the files removed in (1)<br>\n4) Build the IG, pointing at the new files, however you do it, and see if the results are good<br>\nLet me know how it goes!</p>",
        "id": 241799638,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1623081842
    }
]