[
    {
        "content": "<p>Hello everyone --<br>\nI am a FHIR learner and a Palliative Care physician (currently in Brazil) and I would like to join the efforts in helping with Advanced Directives.  Do you have any pointers I should be looking at? How is this effort going?<br>\nCheers.</p>\n<ul>\n<li>Hank</li>\n</ul>",
        "id": 254871637,
        "sender_full_name": "Hank Lenzi",
        "timestamp": 1632605139
    },
    {
        "content": "<p>Hi Hank,<br>\nThanks for reaching out. We would love to have you join our efforts. If you would like, we can look to arrange some time to have an introduction or orientation of sorts. Our continuing integration build of the Implementation Guide can be found here: <a href=\"http://build.fhir.org/ig/HL7/pacio-adi/\">http://build.fhir.org/ig/HL7/pacio-adi/</a> (Please note that we have some significant resource changes that will be happening in the next couple of weeks based on our findings from the Connectathon and Working Group Meeting. <br>\nWe have several calls a week. You can find the call in details here: <a href=\"https://confluence.hl7.org/display/PC/PACIO+Project+Advance+Directive+Interoperability+%28ADI%29+in+FHIR\">https://confluence.hl7.org/display/PC/PACIO+Project+Advance+Directive+Interoperability+%28ADI%29+in+FHIR</a><br>\nCurrently we are looking to ballot in the January time frame. We are starting with a US Realm ballot, but have interest in expanding this to an international scope, so we definitely want participants from outside the US. (We only started with the US, because that represents the expertise of participants we had to launch the effort.)<br>\nPlease let us know how we can best help get you involved.</p>",
        "id": 254987274,
        "sender_full_name": "Corey Spears",
        "timestamp": 1632714009
    },
    {
        "content": "<p>Hi Corey -- <br>\nI apologize for the late answer (personal reasons). I would love to join but, since you are focused on the US-Core, I will wait and see what you do, for now, as I am part of a group working on BR-Core (Brazil) and we're very much focused on getting a minimal set out now.</p>",
        "id": 261783627,
        "sender_full_name": "Hank Lenzi",
        "timestamp": 1637155849
    }
]