[
    {
        "content": "<p>Ciao,</p>\n<p>Does any publicly available test server exist for testing any of the Italian FHIR profiles? We're running an International Patient Access track at the FHIR Connectathon in January, and are interested in collecting information on all international FHIR implementations.</p>\n<p>At the connectathon, our main goal is to test as many client and server implementations as possible, against each other. We're interested in all country-specific server implementations, <strong>even if people running those servers would not be able to join the connectathon or the IPA track</strong> - as long as there is a test server or a sandbox environment publicly available.</p>\n<p>More info on the IPA track is in <a href=\"https://confluence.hl7.org/display/FHIR/2022-01+International+Patient+Access\">https://confluence.hl7.org/display/FHIR/2022-01+International+Patient+Access</a>.</p>\n<p>Beyond the connectathon, we're also interested in listing information on country-specific FHIR implementations in the IPA Implementation Guide.</p>",
        "id": 265819561,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1640188307
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span>  no official profiles  have been published by HL7 IT yet, there are two on-going IGs under discussion:</p>\n<ul>\n<li><a href=\"https://build.fhir.org/ig/hl7-it/base/\">https://build.fhir.org/ig/hl7-it/base/</a> (Base Profiles)</li>\n<li><a href=\"https://build.fhir.org/ig/hl7-it/dossier-pharma/\">https://build.fhir.org/ig/hl7-it/dossier-pharma/</a></li>\n</ul>",
        "id": 266110622,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1640526869
    },
    {
        "content": "<p>please consider that the base profile doesn't define a minimal common set (as the IPA), but it tries to describe how some commonly used information can be represented +</p>",
        "id": 266110680,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1640526963
    },
    {
        "content": "<p>Thanks for the input, <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span>!</p>",
        "id": 266128945,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1640554732
    }
]