[
    {
        "content": "<p>ciao a tutti ripeto in questa chat alcune delle informazioni inviate ieri via mail alla mailing list di hl7 Italia ...</p>",
        "id": 180713350,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1573723796
    },
    {
        "content": "<p>Si vorrebbe organizzare nel prossimo mese di Gennaio 2020 un incontro.</p>\n<p>L’idea è quella di suddividere l’incontro in due parti:<br>\n1.  la prima di condivisione delle esperienze esistenti<br>\n2.  la seconda di programmazione delle attività future, incluso l’organizzazione di un x-athon (il nome lo decidiamo poi insieme) FHIR, possibilmente prima della metà del prossimo anno.</p>",
        "id": 180713430,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1573723842
    },
    {
        "content": "<p>L'esperienze dovrebbero descrivere :<br>\n•   Tipo di progetto/i e/o scopo per cui viene usato HL7 FHIR<br>\n•   Risorse FHIR (quali e come sono usate, in quale versione di FHIR; ed altri dettagli tecnici)<br>\n•   Eventuali problematiche / argomenti di discussione<br>\n•   Possibili attività in HL7 Italia da suggerire</p>",
        "id": 180713461,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1573723899
    },
    {
        "content": "<p>L'invito è di iniziare da subito a lavorare per la preparazione.<br>\nChi fosse interessato a condividere le proprie esperienze e/o a far parte del core team di organizzazione  mi contatti quanto prima.</p>",
        "id": 180713544,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1573723955
    },
    {
        "content": "<p>Luogo e data sono ancora da definire, ma probabilmente sarà nella settimana fra il 13 ed il 17 gennaio.</p>",
        "id": 180713553,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1573723970
    },
    {
        "content": "<p>Ciao Giorgio,<br>\ncome scrivevo in un altro thread, potrebbe essere di interesse, nell'ambito sopratutto di FSE, andare a definire una mappatura CDA2 - FHIR, adattata alla realtà italiana e ai documenti CDA2 definiti in questi anni. Un'attività del genere è già stata fatta un paio di anni fa da ICAR - CNR (<a href=\"https://intranet.icar.cnr.it/wp-content/uploads/2017/11/RT-ICAR-NA-2017-05.pdf\" target=\"_blank\" title=\"https://intranet.icar.cnr.it/wp-content/uploads/2017/11/RT-ICAR-NA-2017-05.pdf\">https://intranet.icar.cnr.it/wp-content/uploads/2017/11/RT-ICAR-NA-2017-05.pdf</a>) Si potrebbe partire da questo lavoro per andare a contestualizzarlo sugli ultimi CDA2 pubblicati ed andando a definire procedure e metodi automatici per effettuare tali trasformazioni.</p>",
        "id": 180826478,
        "sender_full_name": "Davide Corallo",
        "timestamp": 1573820358
    },
    {
        "content": "<p>bene... abbiamo un altro possibile tema da mettere nella lista ... :-)</p>",
        "id": 181110573,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1574170180
    },
    {
        "content": "<p>Da discutere se, dove e come abbia senso replicare i documenti CDA in FHIR</p>",
        "id": 181110712,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1574170274
    },
    {
        "content": "<p>vedo però interessante come alcune informazioni memeorizzate nel CDA (e.g Vaccinazioni, Allergie, etc) possono essere rappresentate in risorse FHIR</p>",
        "id": 181110813,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1574170359
    },
    {
        "content": "<p>Inoltre non credo che una mappatura \"sintattica\" CDA =&gt; FHIR sia sempre così utile e diretta; penso che possa essere però conveniente partire dai concetti concordati dalle regioni e capire come questi concetti usati nei documenti CDA debbano essere rappresentati in FHIR</p>",
        "id": 181111147,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1574170598
    },
    {
        "content": "<p>Il rischio è di fare una doppia mappatura con quello che ne consegue (ogni mapping introduce delle \"imprecisioni\")</p>",
        "id": 181111257,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1574170690
    },
    {
        "content": "<p>esempio banale l'ASL di assistenza nel CDA è rapprentata come una partecipazione indiretta (participant).  Se voglio gestire una mappatura in FHIR del concetto di generico di participant devo definire una estensione ad hoc (vedi e.g. C-CDA on FHIR).</p>",
        "id": 181111446,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1574170826
    },
    {
        "content": "<p>ma per rappresentare in FHIR l'ASL di residenza non ha senso che usi una estsione del participatn in una composition....</p>",
        "id": 181111504,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1574170891
    },
    {
        "content": "<blockquote>\n<p>vedo però interessante come alcune informazioni memeorizzate nel CDA (e.g Vaccinazioni, Allergie, etc) possono essere rappresentate in risorse FHIR</p>\n</blockquote>\n<p>è proprio a questo che penso. \"trasformare il dato clinico\" al fine di renderlo granulare e trasportabile. Il CDA2 non è così semplice da leggere ed elaborare.</p>",
        "id": 181117622,
        "sender_full_name": "Davide Corallo",
        "timestamp": 1574174941
    },
    {
        "content": "<p>Ciao, brevissima presentazione: sono Pier Alberto Gibellini, lavoro in Dedalus come Solution Architect e seguo da tempo il mondo dell'interoperabilità e di HL7. In Dedalus stiamo lavorando ormai da qualche tempo e investendo con forza su FHIR nell'ambito della vision \"D-four\" che l'azienda sta sostenendo. Raccogliamo volentieri l'invito di Giorgio per organizzare un incontro e offriamo la possibilità di ospitarlo presso i nostri nuovi uffici di Firenze, \"D-four Center\",  pensati proprio per attività fortemente improntate alla collaborazione. Gli uffici sono facilmente raggiungibili in tramvia dalla stazione di Santa Maria Novella.<br>\nAbbiamo diverse esperienze da condividere, in accordo con le modalità proposte da Giorgio, sia nell'ambito infrastrutturale, ad es. Patient e Practitioner, così come in ambito diagnostico e di gestione ordini, sia di prestazioni che di farmaci.<br>\nLa settimana del 13 gennaio per noi va bene, propongo in particolare martedì 14 gennaio come data.<br>\nSiamo disponibili a dare una mano anche sul piano organizzativo per quanto ci sarà possibile</p>",
        "id": 181314927,
        "sender_full_name": "Pier Alberto Gibellini",
        "timestamp": 1574350011
    },
    {
        "content": "<p>Grazie <span class=\"user-mention\" data-user-id=\"209965\">@Pier Alberto Gibellini</span>  per la disponibilità ad ospitare l'evento.</p>",
        "id": 181327217,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1574357384
    },
    {
        "content": "<p>Mi presento anche io, sono Ivano Tomainu della Insiel S.p.A., società in house del Friuli Venezia Giulia. Stiamo anche noi affrontando le stesse problematiche, tra cui la pubblicazione di profili MHD, PDQm e conversione CDA2 in FHIR. Saremmo ben lieti di presenziare e condividere la nostra esperienza, mettendo a fattor comune problemi e soluzioni. Attendiamo nuove.</p>",
        "id": 182095169,
        "sender_full_name": "Ivano Tomainu",
        "timestamp": 1574934628
    },
    {
        "content": "<p>Grazie Ivano</p>",
        "id": 182117279,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1574954897
    },
    {
        "content": "<p>Salve a tutti, mi chiamo Nicola Gentili, lavoro presso l'Istituto Scientifico Romagnolo per lo Studio e la Cura dei Tumori (IRCCS) di Meldola (Forlì).<br>\nSto iniziando a studiare FHIR a seguito dell'utilizzo della tecnologia all'interno di un progetto europeo e mi piacerebbe rimanere aggiornato e imparare tanto su questo argomento.<br>\nNon mi è chiaro il target dell'evento né se ve ne saranno altri, ma mi chiedevo se fosse possibile la partecipazione al gruppo di lavoro o almeno poter rimanere \"in ascolto\" fin quando non sarò in grado di dare contributi attivi.</p>",
        "id": 186142835,
        "sender_full_name": "Nicola Gentili",
        "timestamp": 1579565997
    },
    {
        "content": "<p>Caro Nicola, oggi all'incontro di Firenze è stato concordato un primo piano di azione per il gruppo. Farò circolare a breve un doodle per fissare la data della prima conference call</p>",
        "id": 186203112,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1579625923
    },
    {
        "content": "<p>ti suggerisco di registrarti sulla mailing list fhir in hl7 italia e/o seguire le discussioni  su questa chat</p>",
        "id": 186203163,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1579625963
    },
    {
        "content": "<p>Ecco il link al doodle <a href=\"https://doodle.com/poll/wcidx6593cwepcmm\" target=\"_blank\" title=\"https://doodle.com/poll/wcidx6593cwepcmm\">https://doodle.com/poll/wcidx6593cwepcmm</a>.</p>\n<p>potete anche suggerire date ed ore diverse come commento. In questo caso si può far ricircolare il doodle aggiornato.</p>",
        "id": 186279911,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1579694566
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 186491602,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1579872698
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 186491614,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1579872715
    }
]