[
    {
        "content": "<p>Ciao, nel profilo patient IT possiamo gestire il caso di pazienti nel cui nome compaiono segni diacritici (dieresi, accenti circonflessi, cediglia, ...)? Questo tema è stato affrontato anche in altri tavoli, con l'idea di prevedere una doppia dicitura del nome: </p>\n<ul>\n<li>una con i caratteri originali</li>\n<li>una traslitterata, che è poi quella usata anche per il calcolo del codice fiscale</li>\n</ul>",
        "id": 191917932,
        "sender_full_name": "Paola Lupieri",
        "timestamp": 1585242661
    },
    {
        "content": "<p>la mia domanda è quanto è critico avere una translitterazione nella risorsa FHIR ?<br>\nla translitterazione non è univoca una volta passati i caratteri originali ?</p>",
        "id": 191996581,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1585303723
    },
    {
        "content": "<p>Provo a rispondere Giorgio: sul piano prettamente tecnico non credo ci siano criticità a trattare in FHIR caratteri speciali, i documenti possono essere scambiati sia in JSON che in XML con le codifiche UTF-8 o UTF-16, entrambe li supportano senza problemi.<br>\nPer quanto riguarda la traslitterazione esistono delle regole ufficiali (e.g <a href=\"https://dait.interno.gov.it/documenti/circolare-n-1-2008-0.pdf\" title=\"https://dait.interno.gov.it/documenti/circolare-n-1-2008-0.pdf\">https://dait.interno.gov.it/documenti/circolare-n-1-2008-0.pdf</a>) che rendono il processo sicuramente univoco, salvo omonimie ovviamente.<br>\nSpero di avere indirizzato correttamente i tuoi dubbi.</p>",
        "id": 192055489,
        "sender_full_name": "Ivano Tomainu",
        "timestamp": 1585331521
    },
    {
        "content": "<p>Ciao Ivano, provo a riformulare la mia domanda, dato per scontato la capacità di supportare caratteri di vario tipo incluso quelli ideografici.</p>",
        "id": 192113280,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1585385647
    },
    {
        "content": "<p>nello scambio di informazioni tramite FHIR è strettamente necessario veicolare la forma translitterata del  nome, dato che esiste un processo univoco di conversione ?</p>",
        "id": 192113340,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1585385764
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197698\">@Ivano Tomainu</span>  e <span class=\"user-mention\" data-user-id=\"197699\">@Paola Lupieri</span>  Grahame suggeriva di usare il tag lang per distiguere fra le diverse rappresentazioni, che in pratica significa usare l'estensione universale \"translation\"</p>",
        "id": 197895756,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1589785022
    },
    {
        "content": "<p>questo pone un altro problema cioé cosa utilizzare in questo attributo che deve essere un elemento conforme con IETF BCP 47 language tag</p>",
        "id": 197896168,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1589785290
    },
    {
        "content": "<p>ho provato a guardare un po' lo standard ed al momento mi vengono in mnete due soluzioni od usare un private tag tipo \"it-x-usasciii\" (cosa usare dopo la x lo decidiamo noi...)</p>",
        "id": 197896368,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1589785429
    },
    {
        "content": "<p>provando ad usare i sub-tag definiti la cosa più vicina che mi viene in mente è qualcosa tipo \"it-latn-simple\"</p>",
        "id": 197896495,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1589785536
    },
    {
        "content": "<p>dove 'latn' è lo script sub-tag per Latin (ISO 15924)</p>",
        "id": 197896597,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1589785592
    },
    {
        "content": "<p>e 'simple' è il variant subtag per \"simplified form\"; non so se però \"simplified form\" ha una sua semantica per l'italiano ....</p>",
        "id": 197897075,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1589785818
    },
    {
        "content": "<p>ovviamente possiamo usare it o it-IT indifferentemente...</p>",
        "id": 197897150,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1589785880
    },
    {
        "content": "<p>cos' come possiamo usare il private tag dopo it-latn</p>",
        "id": 197897360,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1589785995
    },
    {
        "content": "<p>ma se c'è qualcuno con un po' più di esperienza con i language tag è benvenuto :-)</p>",
        "id": 197897476,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1589786042
    },
    {
        "content": "<p>Giorgio ho guardato l'estensione e secondo me va bene per lo scopo: l'importante è avere una seconda versione del campo testuale espresso in una diversa lingua con caratteri speciali, in modo da conoscere l'originale che ha dato vita alla forma traslitterata. Per i codici lingua userei serenamente la <a href=\"https://it.wikipedia.org/wiki/ISO_639-1\">ISO 639-1</a> come riferimento alla lingua d'origine.</p>",
        "id": 198043112,
        "sender_full_name": "Ivano Tomainu",
        "timestamp": 1589881785
    }
]