[
    {
        "content": "<p>Is there anything in CMS-9115-F or similar (official) rule that specifically lists what APIs need to be implemented based on FHIR R4. I’ve seen that someone is truly confused, taking a sentence from the CMS-9115-F where it points to the base (technical) standard:</p>\n<blockquote>\n<p>We proposed to adopt the technical standards as finalized by HHS in the ONC 21st Century Cures Act final rule (published elsewhere in this issue of the Federal Register) at 45 CFR 170.215. HHS is finalizing adoption of HL7 <strong>FHIR Release 4.0.1</strong> as the foundational standard for APIs at 45 CFR 170.215(a)(1).</p>\n</blockquote>\n<p>and based on that claims that, for example, the FHIR server/end-point that is built against US Core (the latest is 4.0.0 and therefore does not match FHIR 4.0.1 according to that person's view) shall support a <em>ServiceRequest</em> (which is the part of Prior Authorization Support) as well.</p>\n<p>How to explain, quoting CMS rules, that FHIR 4.0.1 is just a technical standard all other APIs are built based on?</p>",
        "id": 250229955,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1629569277
    },
    {
        "content": "<p>US Core v4.0.0 is based on FHIR v4.0.1</p>",
        "id": 250304316,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629684738
    },
    {
        "content": "<p>Sounds like they are confused by the versioning between the various standards FHIR Standard (4.0.1) and the implementation guide standard (in this case US Core 4.0.0).</p>",
        "id": 250358532,
        "sender_full_name": "Eric Haas",
        "timestamp": 1629728544
    },
    {
        "content": "<p>I think the requirements are:</p>\n<ol>\n<li>\n<p>Expose the same SMART on FHIR APIs as a certified EHR would, for USCDI core data set</p>\n</li>\n<li>\n<p>Alongside the USCDI resources, also support Coverage, ExplanationOfBenefit, and other resources needed for beneficiary access to benefits data (following CARIN BlueButton is the wa to go here, but not strictly required... yet)</p>\n</li>\n</ol>",
        "id": 250679083,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629923911
    }
]