[
    {
        "content": "<p>It is clear from the FHIR guidance that searching by partial dates (i.e. low precision dates) results in an interval being used for the search, such that searching for a resource in the year 2020 (eq2020) results in resources found between 2020-01-01 and 2020-12-31.  My question is whether there is any guidance or not on how to handle low precision dates in the source data when searching by date.  <br>\nSome historical data, such as surgical histories, only has partial date precision (e.g. the patient knows they had knee surgery in 1990 but can’t remember the month or day.)  If such information is returned, as say a FHIR Procedure, what is the intended results of searching for procedures for that patient by date?  It seems fairly straight-forward when the search encompasses the entirety of low precision date, how should one handle the situation when the search only encompasses a portion of the low precision date?  For example, Patient X had knee surgery in 1990.  Any year precision search that would return 1990 would return this procedure.  A month or day precision search that would return the entirety of 1990 would return this procedure (le1990-12 or ge1990-01-01 for example).  The question becomes if I search for procedures ge1990-01-02, would this procedure be returned since there is a chance it occurred on 1990-01-01?  What if the search is ge1990-12-31, would this procedure be returned?<br>\nAdditionally, if the source data doesn’t have a date, should it ever be returned in a date search?  If so, under what circumstances?</p>",
        "id": 226537567,
        "sender_full_name": "Brian Wilkins",
        "timestamp": 1613493142
    },
    {
        "content": "<p>The expectation is that a search will return a hit if there's an intersection of the period implied by the source data and the period implied by the search value.</p>",
        "id": 226539278,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613493747
    },
    {
        "content": "<p>Mhh, depends on the operator? If you use equality it matches if the period of the data is contained in the period of the search value, if you use <code>ap</code> then if they intersect, see <a href=\"http://hl7.org/fhir/search.html#prefix\">http://hl7.org/fhir/search.html#prefix</a></p>",
        "id": 226548716,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1613497442
    },
    {
        "content": "<p>(the table at that link details what happens in the various cases - except when the source has no date at all, that is ambiguous)</p>",
        "id": 226549279,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1613497670
    }
]