[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> I'm getting a IG Publisher error (on the QA page) that I haven't seen before:</p>\n<div class=\"codehilite\"><pre><span></span><code>US FHIR Usage rules require that all profiles on Observation derive from one of the base US profiles.\n</code></pre></div>\n\n\n<p>I guessing this is because mCODE is a US Realm IG. But is the rule really true? US Core has profiles for Labs, and then a few others (weight, height, smoking, etc.), that's all. But there are 1000's of non-lab observations that have no suitable base profile in US Core.  Those observations cannot use US Core Laboratory Result Observation Profile because that profile forces the category to be \"Laboratory\".  So I believe this error message is incorrect, and it is perfectly acceptable to base a profile on Observation even in the US Realm. <br>\nSo what's the deal with this error message?</p>",
        "id": 204836251,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1595529315
    },
    {
        "content": "<p>USRSC decision to add that validation for US Realm to track US Realm IGs in an attempt to encourage use of US Core profiles unless there is good reason not to .  I agree that Observation only covers a limited set of use cases and so this error should not appear for other use cases, however the validation is new and probably need further refinement.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 204841275,
        "sender_full_name": "Eric Haas",
        "timestamp": 1595531489
    },
    {
        "content": "<p>If you have an observation profile With category lab that does not inherit from US core laboratory observation, then I agree with that error message. Otherwise it should not be outputted.</p>",
        "id": 204845876,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1595533968
    },
    {
        "content": "<p>I agree that this is not working right for Observation. It's work in progress to figure out how to get it to work right, since it' not right to simply ignore all observations.</p>",
        "id": 204870162,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595552470
    },
    {
        "content": "<p>ironically, US core fails to conform to itself. Clearly, I still have work to do</p>",
        "id": 204973082,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595629725
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> Now that this is at least stable (or will be, with the next release), I'd like to talk with US steering committee about where we're going with this</p>",
        "id": 205327078,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1596008947
    }
]