[
    {
        "content": "<p>I have several related questions:<br>\n1) When is US Core planning to go normative?<br>\n2) Is it possible for a US Realm IG that is based on US Core to go normative before US Core does?<br>\n3) Since FMM Level 5 is a requirement for normative, and the criteria for FMM 5 says \" has been implemented in at least 5 independent production systems <strong>in more than one country</strong>\" then how can a US Realm IG ever go normative (as long as the US remains one country)?</p>\n<p>See: <a href=\"https://confluence.hl7.org/display/FHIR/FHIR+Maturity+Model\">https://confluence.hl7.org/display/FHIR/FHIR+Maturity+Model</a></p>",
        "id": 249294273,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1628802867
    },
    {
        "content": "<p>It's hard, but not impossible, for something to go normative before its parent.  The requirement for multiple countries doesn't hold for US Realm guides.  US Realm might want to consider whether it's relevant to seek implementation in multiple states.</p>",
        "id": 249313682,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628819449
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> can you say more about \"hard but not impossible\"? Under what circumstances would it be possible?</p>",
        "id": 249361242,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1628861918
    },
    {
        "content": "<p>the one way is to have the IG be stuck to a specific version of the underlying STU. Thus any changes to the normative standard are not recognized in the IG. This makes for a really messy situation as regions start to see a STU as their production, while others are using normative specification.</p>",
        "id": 249361516,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628862062
    },
    {
        "content": "<p>far better that US-Core get broken up into the stable parts and those that are aspirational guidance. This would communicate truth better.</p>",
        "id": 249361682,
        "sender_full_name": "John Moehrke",
        "timestamp": 1628862139
    },
    {
        "content": "<p>That is indeed one way.  For example if you were putting out an IG that was going to be regulated and the reality is that if there were breaking changes in the underlying spec there'd be no chance anyone would ever move, so you're defacto locked in to what's there now forever.  Not an ideal thing to happen, but if it did, the FMG would look at it rather than saying 'no' automatically. </p>\n<p>Two other options:</p>\n<ul>\n<li>you're only using elements inherited from something already normative.  E.g. you have a profile on CarePlan that includes narrative, the id and some extensions (all inherited from the normative DomainResource)</li>\n<li>you're using elements that are exceptionally stable, are tied to patterns that makes them exceedingly unlikely to change, and where the WG responsible for the base WG commits that those aspects of its resource won't change.  E.g. the previous example, but tack on 'subject' and 'identifier'</li>\n</ul>\n<p>The FMG would want to ensure that the IG wasn't painting itself into a version-locked core box - or that painting yourself into that box was intentional; and in the latter case, that that was actually the will of the whole community.</p>\n<p>In short - not an easy lift, and not appropriate for most circumstances, but still possible in some.</p>",
        "id": 249366606,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628864695
    },
    {
        "content": "<p>US Core is somewhat dependent on the USCDI which will have new releases every year (or so).  So, for USCore to go normative, it would have to have a stick in the sand saying \"This version of USCDI is the one we care about\".   I've just assumed we'd get new versions of USCore for every version of USCDI and none would go Normative.</p>",
        "id": 249620760,
        "sender_full_name": "David Pyke",
        "timestamp": 1629135270
    },
    {
        "content": "<p>Are breaking changes possible in USCDI?  I thought it was just a list of data elements?</p>",
        "id": 249621173,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629135467
    },
    {
        "content": "<p>It is a list of elements but new required ones are added.  So USCDI V2 is a superset of V1.  So, it's possible to have USCore be USCDI V1 compatible but need to add new extensions/profiles for V2.</p>",
        "id": 249621386,
        "sender_full_name": "David Pyke",
        "timestamp": 1629135543
    },
    {
        "content": "<p>Adding new elements shouldn't break US Core being normative.</p>",
        "id": 249656875,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629153126
    },
    {
        "content": "<p>Normative = don't break what exists. Adding new things is AOK.</p>",
        "id": 249698609,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1629194848
    },
    {
        "content": "<p>It doesn't break it, it just means that it has something new that means that a new USCore is necessary.  Like I said, they would just have to pick a USCDI version that is going to go for normative and then update with new STUs.</p>",
        "id": 249713550,
        "sender_full_name": "David Pyke",
        "timestamp": 1629204808
    },
    {
        "content": "<p>Sure.  There'll certainly be new versions of USCore after it goes normative.  There'll be new versions of the base spec too.  Also, it's possible for some of USCore to go normative without all of it going normative.</p>",
        "id": 249739687,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629215985
    },
    {
        "content": "<p>I was unaware that it was possible to bring only parts of an IG normative. I had assumed that was reserved for the core.</p>",
        "id": 249740980,
        "sender_full_name": "David Pyke",
        "timestamp": 1629216503
    },
    {
        "content": "<p>Nope, definitely true for IGs too.  Normative is driven by maturity and - if IGs evolve at all - we can't expect that maturity will be consistent across all artifacts.  The ability to capture and expose FMM and standards status on artifacts will hopefully be in the main template in the next week or so.</p>",
        "id": 249794692,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629245706
    }
]