[
    {
        "content": "<p>If I write an IG that includes a Patient profile built on the US Core Patient Profile (let's say I change the cardinality of birthDate from 0..1 in the US Core profile to 1..1 in my profile) and then want to use the US Core Encounter profile as is (no additional constraints), does an instance of the Patient resource conforming to my IG need to list both the US Core Patient profile and my IG profile in Patient.meta because the US Core Encounter profile constrains Encounter.subject to the US Core Patient profile? Or is it sufficient for the Patient resource to just list my IG's profile because it builds on US Core Patient? Or does my IG also have to create a profile of Encounter (building on US Core Encounter) and restrict Encounter.subject to my IG's profile?</p>",
        "id": 189791282,
        "sender_full_name": "Craig Newman",
        "timestamp": 1583415383
    },
    {
        "content": "<p>There's no requirement to list any profile at all.  Declaring profiles is optional.  Some servers/IGs may mandate declaration, but that's generally not considered a good practice.</p>",
        "id": 189812560,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583427530
    },
    {
        "content": "<blockquote>\n<p>Or does my IG also have to create a profile of Encounter (building on US Core Encounter) and restrict Encounter.subject to my IG's profile?</p>\n</blockquote>\n<p>yes</p>\n<blockquote>\n<p>does an instance of the Patient resource conforming to my IG need to list both the US Core Patient profile and my IG profile in Patient.meta because the US Core Encounter profile constrains Encounter.subject to the US Core Patient profile?</p>\n</blockquote>\n<p>no only the derived profile is fine  all the constraints are inherited.</p>",
        "id": 189815976,
        "sender_full_name": "Eric Haas",
        "timestamp": 1583429211
    },
    {
        "content": "<p>There is a way to globally apply profiles in IGs but I don't think its implemented?   <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  ?</p>",
        "id": 189816129,
        "sender_full_name": "Eric Haas",
        "timestamp": 1583429313
    },
    {
        "content": "<p>If you mean \"is it enforced by the validator\", I'm not actually sure.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 189822723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583433499
    },
    {
        "content": "<p>AFAIK   Currently only can say \"use this Y profile defined in this Y IG everywhere Y is referenced in a X IG that lists Y IG as a dependency\", there is no way to say in an IG, \"use this X profile that we just defined in this IG everywhere X is referenced in the <em>same</em> IG\".   Is that correct? <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 189826118,
        "sender_full_name": "Eric Haas",
        "timestamp": 1583435715
    },
    {
        "content": "<p>validator doesn't enforce global profiles, no</p>",
        "id": 189833477,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583440536
    },
    {
        "content": "<p>at least, not yet</p>",
        "id": 189833491,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583440547
    },
    {
        "content": "<p>We haven't defined how global profiles in a derived IG behave with respect to profiles inherited from a referenced (dependency) IG.  My assumption had been that global profiles apply everywhere.  In principle, if a parent and child IG both defined global profiles for the same IG, then both profiles would have to apply, though we could also say it was an error unless the global profile in the child IG was a constraint on the global profile for that same type in the parent.</p>",
        "id": 189838342,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583443647
    },
    {
        "content": "<p>Do we need a change request to clarify that?</p>",
        "id": 189838350,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583443655
    },
    {
        "content": "<blockquote>\n<p>both profiles would have to apply</p>\n</blockquote>\n<p>Yes. Doesn't have to have a direct lineage though</p>",
        "id": 189839503,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583444397
    },
    {
        "content": "<p>\"Doesn't have to have direct lineage though\" - what does that mean?</p>",
        "id": 189840778,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583445111
    },
    {
        "content": "<p>baseDefinition doesn't have to point to the logical parent</p>",
        "id": 189842001,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583445848
    },
    {
        "content": "<p>baseDefinition for the global profiles?  So essentially all global profiles declared for a given type must hold?</p>",
        "id": 189849754,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583451908
    },
    {
        "content": "<p>to clarify, if Craig creates a Patient profile FOO in his IG, he could also declare that FOO is global in his  IG and not have to update Encounter to point to FOO?  ( assuming the tooling supported this )</p>",
        "id": 189860279,
        "sender_full_name": "Eric Haas",
        "timestamp": 1583466595
    },
    {
        "content": "<p>yes</p>",
        "id": 189860977,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583467774
    },
    {
        "content": "<p>I have to admit I started getting lost at the first mention of \"global profiles\", but I think it ended with Grahame confirming that if I declare my IG's patient profile as global (within my IG), then all other references to a Patient resource in other profiles my IG uses would default to my Patient profile. DId I get that right? If so, what is the mechanism for declaring a profile to be global? Thanks.</p>",
        "id": 189892563,
        "sender_full_name": "Craig Newman",
        "timestamp": 1583501670
    },
    {
        "content": "<p>ImplementationGuide.global</p>",
        "id": 189900718,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583506695
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span>  it is not yet implemented in the validation tooling ,  so don't expect error to be caught by the validator.</p>",
        "id": 190001421,
        "sender_full_name": "Eric Haas",
        "timestamp": 1583646906
    }
]