[
    {
        "content": "<p>For legal and/or customer preference, we have a need to be able to represent just the last 4 digits of social security numbers. Is there a defined way to do this?</p>",
        "id": 153821245,
        "sender_full_name": "Bruce Tietjen",
        "timestamp": 1460472798
    },
    {
        "content": "<p>I would think that masking/redaction would be like security, orthogonal to the FHIR API specification (handled by the implementation, such as server implementation api proxy, etc.) and not necessarily a new/different element. What were you thinking would be a way to do this, Bruce?</p>",
        "id": 153821246,
        "sender_full_name": "Hussain Chinoy",
        "timestamp": 1460473043
    },
    {
        "content": "<p>Specifically, there is a defined coding for a Social Security \"Identifier\" (&lt;system value=\"http://hl7.org/fhir/sid/us-ssn\"/), but it seems to be referring to the complete number. Is there a standard way (coding or ??)  to represent just the last 4 digits?</p>",
        "id": 153821248,
        "sender_full_name": "Bruce Tietjen",
        "timestamp": 1460473563
    },
    {
        "content": "<p>(Referring to the FHIR &lt;identifier&gt; resource)</p>",
        "id": 153821249,
        "sender_full_name": "Bruce Tietjen",
        "timestamp": 1460473659
    },
    {
        "content": "<p>In that case, you're not really doing an identifier, you're conveying something to help convey identity.  I'd recommend raising the issue on the implementers list because it's not a realm-specific question.  Same approach would hold for credit card ids, phone numbers and other \"partial\" identifiers that aren't necessarily realm-specific.  We may as well decide on the approach generically.</p>",
        "id": 153821261,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460475421
    },
    {
        "content": "<p>When I raised a similar question about how to mask identifiers (like SSN) via <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8665\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8665\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8665</a>, it was resolved through the use of an extension:  <a href=\"http://hl7-fhir.github.io/extension-rendered-value.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/extension-rendered-value.html\">http://hl7-fhir.github.io/extension-rendered-value.html</a></p>\n<p>Will define an extension called \"renderedValue\" for use with:</p>\n<p>Identifier.value, date, dateTime, time, instant, integer, decimal</p>\n<p>with the definition: \"Provides a rendered version of the value intended for human display.  For example, a sensitive identifier (e.g. social security number) partially obscured by asterisks; a drivers licence number with dashes inserted; a date formatted as MMM dd, yyyy; etc.\"</p>\n<p>requirements: \"Allows determination of appropriate display to be performed by a server where formatting rules may not be known by or may be too complex to be performed by a client.\"</p>\n<p>usage: \"In some cases, this extension may be present and the value won't be present.  For example if the recipient only has permission to see a partially masked view of a value.  The rendering may be realm-specific.  (E.g. the use of ',' vs. '.' when rendering numbers.)\"</p>\n<p>In the definition for Identifier.value will change \"The portion of the identifier typically displayed to the user and which is unique within the context of the system\" to \"The portion of the identifier typically relevant to the user and which is unique within the context of the system\"</p>\n<p>Add a usage note: The value's primary purpose is computational mapping.  As a result, it may be normalized for comparison purposes (e.g. removing non-significant whitespace, dashes, etc.)  A value formatted for human display can be conveyed as an extension e.g. [[renderedValue]]\"</p>",
        "id": 153821555,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1460573861
    }
]