[
    {
        "content": "<p>I'm working on a US Realm birth defect reporting IG and I'm creating a number Observation profiles for non-lab result things like pregnancy outcome, mother's education level, etc. I'm getting a publisher warning that I should be basing these on a US Core Observation profile, but it doesn't seem right to use the lab results profile. Is there a more generic US Core Observation profile that I'm missing and should be using, or for non-lab/non-vitals profile am I OK to ignore this error.</p>",
        "id": 199643785,
        "sender_full_name": "Craig Newman",
        "timestamp": 1591202271
    },
    {
        "content": "<p>The expectation is that you'll come and chat with U.S. Realm about why you're not using their profiles - but once you've got their agreement that the existing US Core profiles aren't appropriate for your use-case, it's fine to add them to the ignoreWarnings.txt file</p>",
        "id": 199649796,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591205166
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nFYI:  I believe there is a new process. I was asked to create JIRA tickets in those instances a US CORE profile will not/could not be used for a US IG. I believe they are looking to document the 'due diligence' and any future changes needed.</p>",
        "id": 199706104,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1591247652
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> What should the tickets say?  Many of the times when there's a choice not to use U.S. Core, it's not because U.S. Core should be changed, it's just not appropriate.  For example, Da Vinci doesn't use US-Core Patient for non-identifiable patients - but we certainly wouldn't want to recommend dropping <a href=\"http://Patient.name\">Patient.name</a> or identifier as mustSupport (or required) in the current profile.  Nor do we necessarily expect US Core to add an anonymized patient profile</p>",
        "id": 199706291,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591247975
    },
    {
        "content": "<p>Thanks folks, this is a timely request. For CARIN RTBC <span class=\"user-mention\" data-user-id=\"238597\">@Frank McKinney</span>  is helping blaze this trail. He logged these <a href=\"https://confluence.hl7.org/display/CGP/Real-time+Pharmacy+Benefit+Check+IG+Variances+wrt+US+Core\">US Core variance requests</a>. We had a brief discussion on these in US Realm SC this week, and will hopefully finalize approval/direction for this set on the Cross Projects Work Group next Thursday.</p>",
        "id": 199763761,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1591284381
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> What field in JIRA would be best to note this is a 'Variance' Request? Grouping?</p>",
        "id": 199763834,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1591284415
    },
    {
        "content": "<p>The FHIR Specification Feedback project is intended for requesting changes to the spec.  I suppose you could use \"question\" and just have an answer saying 'that's fine'..</p>",
        "id": 199774550,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591288721
    },
    {
        "content": "<p>This is a request to change to US Core/variance request</p>",
        "id": 199776240,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1591289455
    },
    {
        "content": "<p>+requirement for future US base</p>",
        "id": 199776317,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1591289486
    },
    {
        "content": "<p>Is it?  Would U.S. base support anonymized access?  Would it support veterinary?  I expect there will still be US profiles that fall outside the declared scope of \"US Base\"</p>",
        "id": 199780158,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591291150
    },
    {
        "content": "<p>Folks can request those changes, and then we can accept/reject.</p>",
        "id": 199786321,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1591293889
    },
    {
        "content": "<p>I am not quite ready to make a judgement on exactly what is in/out of base. I just know constraints will be quite loose</p>",
        "id": 199786383,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1591293927
    },
    {
        "content": "<p>Ooooh.... Maybe I should give <a href=\"https://jira.hl7.org/browse/FHIR-19919\">FHIR-19919</a> a go again... ;-)</p>",
        "id": 199787169,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1591294376
    },
    {
        "content": "<p>eek, I guess US Core flood gates could open. Did you publish profiles in separate guide?</p>",
        "id": 199787752,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1591294695
    },
    {
        "content": "<p>I wouldn't feel comfortable asking for a change that I know already is outside the scope of US Baseline and that, in practice, I wouldn't <em>want</em> to be in US Baseline.</p>",
        "id": 199787800,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591294741
    },
    {
        "content": "<p>US Baseline. Do you have a working scope for the US Baseline?</p>",
        "id": 199796060,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1591298608
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> -- no, I don't have any profiles for that actually.  It's more that I have CQL that queries for assessment observations, and it's annoying that vendors won't expose any observations in their FHIR interfaces except those specified by US Core.</p>",
        "id": 199801590,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1591300929
    },
    {
        "content": "<p>I don't know what you've landed on for the US baseline scope.  But I do know that you'll have to have boundaries - if you don't, you won't be able to say or enforce anything useful...</p>",
        "id": 199832886,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591327768
    },
    {
        "content": "<p>Totally agree. I just thought your last Zulip implied you knew those boundaries!</p>",
        "id": 199904169,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1591375624
    },
    {
        "content": "<p>I have some assumptions and thoughts about what I think is reasonable/appropriate/likely :)</p>",
        "id": 199904406,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591375734
    }
]