[
    {
        "content": "<p>Inferno currently shows validation warnings for compliance issues with ambulatory encounters... \"Could not verify presence of the following must support elements: hospitalization, hospitalization.dischargeDisposition\" So my question is, do we need to run inferno against at least one hospital encounter for this test to pass? What is the expectation for ambulatory practices/EHRs? And will certification allow for multiple inferno runs against hospital vs ambulatory practices to certify or do we need one all encompassing test passing?</p>",
        "id": 274700041,
        "sender_full_name": "Alex McManus",
        "timestamp": 1646838214
    },
    {
        "content": "<p>This seems like an issue with US Core.  Can you submit a Jira against US Core to remove MS from hospitalization.dischargeDisposition?  We have a newish process where if that Jira is accepted and flagged as being a patch to 3.1.1, ONC can recognize that as a \"clarification\".  Then Inferno can update their check.</p>",
        "id": 274702262,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1646839109
    },
    {
        "content": "<p>FYI <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span></p>",
        "id": 274702290,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1646839121
    },
    {
        "content": "<p>Presume that only works for issues that don't affect cardinality or data type?  (E.g. the fact 3.1.1 doesn't allow PractitionerReference some places where that wasn't intentional)</p>",
        "id": 274710946,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646842541
    },
    {
        "content": "<blockquote>\n<p>So my question is, do we need to run inferno against at least one hospital encounter for this test to pass?</p>\n</blockquote>\n<p>Yes<br>\nInferno allows server implementer provides multiple patient ids to cover all test cases</p>",
        "id": 274729354,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1646849468
    }
]