[
    {
        "content": "<p>USCDI is requiring the use of Substance (Drug Class) for Allergy Intolerance.  I am not finding any way to represent that in FHIR R4 or CDA R2.1.  Any suggestions?</p>",
        "id": 193088657,
        "sender_full_name": "SueAnn Svaby",
        "timestamp": 1586200872
    },
    {
        "content": "<p>It goes into AllergyIntolerance.code using RxNorm</p>",
        "id": 193093962,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1586203516
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"258087\">@SueAnn Svaby</span>  I've just looked at the published USCDI pdf and it's less clear then it should be because it does not clarify drug class expectations. In situations like that you should also look at the ISA which helps because it specifies SNOMED CT when you need to represent a <a href=\"https://www.healthit.gov/isa/representing-patient-allergies-and-intolerances-medications\" title=\"https://www.healthit.gov/isa/representing-patient-allergies-and-intolerances-medications\">drug class</a> of medications as the cause of the allergy. That code then goes into AllergyIntolerance.code as Michele noted.</p>",
        "id": 193192354,
        "sender_full_name": "Robert McClure",
        "timestamp": 1586268379
    },
    {
        "content": "<p>With respect to the 21st Century Cures Act, it is clear that the Provenance Author is not required a part of the USCDI.  However, it appears that it is part of FHIR R4 and US Core IG.  Can anyone advise whether author is definitely required for certification (g)(10)?</p>",
        "id": 193472972,
        "sender_full_name": "SueAnn Svaby",
        "timestamp": 1586448961
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> ?</p>",
        "id": 193477554,
        "sender_full_name": "Eric Haas",
        "timestamp": 1586450950
    },
    {
        "content": "<p>Provenance.agent.type of author is required, but is allowed to be just an organization. <span class=\"user-mention\" data-user-id=\"191942\">@Matt Rahn</span>  is the actually the best to comment on overall author requirements</p>",
        "id": 193503399,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1586463220
    },
    {
        "content": "<p>Thanks, Brett <span class=\"user-mention\" data-user-id=\"258087\">@SueAnn Svaby</span>  On page 130 of the Cures Final Rule you can find ONC's thoughts regarding Author. I pulled out this specific section, \"...Our analysis of the various content exchange standards and specifications (e.g., C-CDA and FHIR) indicates that even though the “author” Data Element is not explicitly required in USCDI, the health IT specifications in which USCDI Data Elements are represented also set specific data element requirements for certain contexts...\"  </p>\n<p>To answer your question: Systems will be expected to support Provenance.agent.type of both ‘transmitter’ and ‘author’, as those are flagged as must support and the spec is clear about them being requirements.  You can check the beta version of the Inferno Program Edition at <a href=\"https://inferno.healthit.gov/inferno\" title=\"https://inferno.healthit.gov/inferno\">https://inferno.healthit.gov/inferno</a>  There is reference data as well.</p>",
        "id": 193506784,
        "sender_full_name": "Matt Rahn",
        "timestamp": 1586464984
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191942\">@Matt Rahn</span> Thank you Matt!  You confirmed what I thought but I have a colleague that has a follow up question:</p>\n<p>\"I understand the spec is clear about them, however on page 102 of the ONC Final Rule it states ““Once published, compliance with the standard and/or implementation specification includes the entire incorporated document, unless we specify otherwise.”</p>\n<p>Then on pg 130 - 131 the ONC Final Rule it states: “Our analysis of the concerns raised by commenters identified a risk of unintended burden and potential risk of error and misattribution associated with this particular Data Element. In most use cases, the inclusion of author organization and author time stamp is sufficient to convey provenance. As a result, we have not finalized the “author” as a required Data Element within the provenance Data Class in USCDI. However, we understand that for exchanging certain data elements, such as “clinical notes,” it is critical to also send the “author” information if available. Our analysis of the various content exchange standards and specifications (e.g., C-CDA and FHIR) indicates that even though the “author” Data Element is not explicitly required in USCDI, the health IT specifications in which USCDI Data Elements are represented also set specific data element requirements for certain contexts. For example, in the context of clinical notes, these content exchange standards require health IT systems to be capable of exchanging “author” information when it is available. Further, “author” is treated as a “Must Support” data element in the FHIR US Core Guide STU 3.1.0 and has a “SHALL” constraint (with appropriate null flavor value) in the C-CDA 2.1. As we have noted previously, we believe that the proposed 24-month timeline for updating certified health IT to comply with the new USCDI standard in § 170.213 is an adequate implementation timeline and will maintain this requirement as finalized earlier in this section. “</p>\n<p>The last sentence states “…and will maintain this requirement as finalized earlier in this section.”  My interpretation is that the last sentence is referring to the exclusion of the data element in the USCDI, but recognizes that the referenced specs do require, but ONC has ‘specified otherwise’ in this case.</p>\n<p>Please let me know how I am mis-interpreting the expectation that for certification systems will be expected to support ‘author’ for USCDI data elements.\"</p>\n<p>Once again, thank you so much!</p>",
        "id": 193657483,
        "sender_full_name": "SueAnn Svaby",
        "timestamp": 1586607424
    }
]