[
    {
        "content": "<p>I've generated synthetic USCore data using Synthea to look at DocumentReference and DiagnosticReport references. Is it possible to decode the attachments/do they actually contain meaningful text that would show up in a clinical note? I am trying to understand how the attachment of a clinical note may be exposed in a patient facing application</p>",
        "id": 227460805,
        "sender_full_name": "Hannah Sennik",
        "timestamp": 1614098109
    },
    {
        "content": "<p>They are simply base64 encoded, so you can decode them. No idea if they contain something meaningful</p>",
        "id": 227461498,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1614098352
    },
    {
        "content": "<p>If you base64 decode them, you'll see text generated that follows <a href=\"https://github.com/synthetichealth/synthea/blob/master/src/main/resources/templates/notes/note.ftl\">this template</a>, I believe.</p>",
        "id": 227470908,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1614101776
    },
    {
        "content": "<p>Thank you for your help, I was able to successfully decode! Is this representative of how clinical note attachments are typically stored? Are there cases where the attachments point to a pdf, and if so, what might the process be for pulling the pdf directly?</p>",
        "id": 227598375,
        "sender_full_name": "Hannah Sennik",
        "timestamp": 1614173731
    },
    {
        "content": "<p>While this data embedding method is allowed by US Core, I wouldn't assume it is the most common way this will be implemented by real systems providing a US Core compliant FHIR API.  Synthea needs to embed all data within resources, since it isn't backed by a persistent service that can host documents.  But if you are getting data from a FHIR Restful API, then it is by definition a persistent service, and doesn't have this same constraint.  I imagine that many systems will just point you to another URL to download the file directly.  And I would expect other document formats besides plain text will be popular (e.g. PDF), though I don't have data to back that expectation.</p>",
        "id": 227617194,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1614181102
    }
]