[
    {
        "content": "<p>USCDI is basically a list of data types/fields, in some cases with specific codesets (which one could find in US Core, but they are independent).</p>\n<p>USCDI lists the Author Organization and Author Time Stamp fields for Provenance, so CFR 170.315(10)(i)(A) (linked above) requires that the fields be \"supported\" within the FHIR &amp; US Core specs by EHR APIs. If an actor has data stored to them via APIs and only has the identity that made the API call, does that actually constitute \"Author\" provenance information per the meaning of the FHIR and US Core specs? </p>\n<p>For instance, we may only know that an app created a resource, but not the specific user or actual underlying covered entity / organization where the clinical information was recorded.</p>",
        "id": 257554577,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1634225284
    },
    {
        "content": "<p>The USCDI page says that:<br>\n<em>The following data-elements are mandatory (i.e. data MUST be present) or must be supported if the data is present in the sending system (Must Support definition).</em><br>\nand the \"must support\" definition further echoes the \"must be supported if data is present\":<br>\n<em>In situations where information on a particular data element is not present and the reason for absence is unknown, US Core Responders SHALL NOT include the data elements in the resource instance returned as part of the query results.</em></p>\n<p>So it seems that we aren't required to produce a Provenance resource for every resource in our system if we lack the information to do so -- the USCDI spec says that twice.</p>",
        "id": 257554730,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1634225351
    },
    {
        "content": "<p>the basic Provenance would have you simply claim that your organization has exported the data. The main reason this bar is so low, is as you point out... and also to enable the next custodian to be able to declare where they got the data.</p>",
        "id": 257562168,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634228125
    },
    {
        "content": "<p>But what about when receiving writes from apps? Would we list the app? Or our organization?</p>",
        "id": 257587573,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1634238152
    },
    {
        "content": "<p>is that app an organization deployed app? Provenance could record turtles-all-the-way-down. Basic Prov is only demanding Organizations give/get Provenance credit.</p>",
        "id": 257611235,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634248014
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"200498\">Brendan Keeler</span> <a href=\"#narrow/stream/179190-united-states/topic/When.20is.20Provenance.20required.3F/near/257587573\">said</a>:</p>\n<blockquote>\n<p>But what about when receiving writes from apps? Would we list the app? Or our organization?</p>\n</blockquote>\n<p>We discuss this in the Argo Write project and based on the implementer feedback we assume that the EHR would a have a \"small p\" provenance once the data crosses its threshold.  But we are conspicuously silent on using Provenance and instead implement a meta tag of  \"uploaded-data\" and rely on the resource elements to provide the context.  </p>\n<p>as an aside I think you mis-attribute the quotes above to <em>USCDI page</em> to <em>USCDI</em>when you mean <em>US Core</em></p>",
        "id": 258047105,
        "sender_full_name": "Eric Haas",
        "timestamp": 1634570864
    }
]