[
    {
        "content": "<p>Moving the discussion here from:   <a href=\"#narrow/stream/207606-Da-Vinci.2Fplan-net-connectathon/topic/Optum\">https://chat.fhir.org/#narrow/stream/207606-Da-Vinci.2Fplan-net-connectathon/topic/Optum</a>.  <span class=\"user-mention\" data-user-id=\"337701\">@David Clowers</span></p>\n<p>I'm going to create a tracker to eliminate the _profile= from all of those example queries.<br>\n<a href=\"https://jira.hl7.org/browse/FHIR-31031\">https://jira.hl7.org/browse/FHIR-31031</a></p>",
        "id": 225746794,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1612900175
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> Thanks for the comprehensive response here and in the Connectathon stream. One question. When you say:</p>\n<p>GET [base]/List. This would return all List instances, including those that represent CoveragePlan<br>\nGET [base]/MedicationKnowledge?DrugPlan=myPlanID. This would return all MedicateKnowledge that are supported by the DrugPlan search parameter, and that instance matches the provided PlanID. DrugPlan is only supported for the FormularyDrug profile.</p>\n<p>Without the _profile parameter, how would we differentiate the CoveragePlan profiles from other List data in the List endpoint? (Hopefully that makes sense). E.g. I believe there are certain clinical data stored in the List resource type as well, so if this data is aggregated to the same endpoint, is there a method for filtering only CoveragePlan data? The same may apply to FormularyDrug.</p>\n<p>E.g. Using Provider Directory as an example, we can use the type parameter to differentiate between the Organization and Network profiles using the same Organization endpoint.</p>",
        "id": 225775636,
        "sender_full_name": "David Clowers",
        "timestamp": 1612914878
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"337701\">@David Clowers</span> <br>\nYou are correct.  If there are instances of FHIR List resources that are not connected to the Formulary, they would be returned by a query for GET [base]/List.    <br>\n1)  It would be a reasonable request by a client IMHO to request ALL CoveragePlans, and I don't see any way to easily get only CoveragePlans and not all Lists.<br>\n2) It appears there is a missing search Parameter on CoveragePlan to allow query of a CoveragePlan by PlanID.   I've added a tracker for these two cases. <a href=\"https://jira.hl7.org/browse/FHIR-31038\">https://jira.hl7.org/browse/FHIR-31038</a><br>\n3) FormularyDrug has similar, but not quite as serious issues.  It is possible to query all FormularyDrugs by PlanID, but not easy to query all MedicationKnowledge instances that are FormularyDrugs.  (I haven't created a tracker for this).   Querying MedicationKnowledge resources by code (RxNorm code) might return MedicationKnowledge resources that aren't FormularyDrugs.   Querying by drugName, DrugTier, or DrugPlan leverage content in extensions that will only be present in FormularyDrugs.</p>\n<p>I think we need to consider how best to address these issues.<br>\n<span class=\"user-mention\" data-user-id=\"222957\">@Dave Hill</span></p>",
        "id": 225793600,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1612931755
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> Thanks again for the comprehensive response. Since we're continuing to march toward the 07/01 date, we will work to implement the endpoints as is (List, MedicationKnowledge), deprecate the _profile parameter, and try to absorb any changes for CoveragePlan-specific routing as they're made. Agreed that the FormularyDrug profile issues are not as critical, though it'd be nice to eventually have similar support for querying those data.</p>",
        "id": 225885527,
        "sender_full_name": "David Clowers",
        "timestamp": 1612982009
    },
    {
        "content": "<p>there's no reason why you <em>have</em> to deprecate support for _profile if you find it useful, you just aren't required to support it</p>",
        "id": 225896605,
        "sender_full_name": "ryan moehrke",
        "timestamp": 1612986406
    }
]