[
    {
        "content": "<p>Hello,</p>\n<p>I'm trying to help a customer determine what scope of coverage plans need to be included for PDEX Formulary adherence.  To be more specific, the customer has a number of public coverage plan offerings and an enormous number of private/commercial coverage plan offerings (custom plans made for employers for example).  I tried to look in the IG for guidance on this topic but wasn't able to find anything pertaining to this matter.  I'll try to use an example to explain the situation.</p>\n<p>Let's say we have a coverage plan called \"Coverage Plan PPO\" that the company markets to employers.  Under this \"Coverage Plan PPO\" there are thousands of \"Products\" that represent individual tweaks and customizations done for each employer.  These \"Products\" are not available for the public to take part in (only those people working for a particular employer for a particular \"Product\").  </p>\n<p>To me, it would seem that we wouldn't expose these type of internal plans (\"Products\") via the FHIR API as not just anyone would be able to join that plan.  My thought was to advise that we include in their FHIR endpoints any CoveragePlans which are publicly available.  This seemed to meet the spirit of the IG use case the closest where a person could take Medications A, B and C and see what the costs and formulary alternatives were for available plans that they could actually sign up for.</p>\n<p>Thanks</p>\n<p>Fred</p>",
        "id": 213962804,
        "sender_full_name": "Fred Harmon",
        "timestamp": 1603219544
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222957\">@Dave Hill</span> <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span>   Your question is about the CMS rule and your business decisions, not the IG.  I think you need to review the CMS rule and your business needs, and determine which formularies you need to publish.</p>",
        "id": 213979065,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1603227759
    },
    {
        "content": "<p>Are you using the PDex Drug Formulary to meet the CMS Interoperability Final Rule regarding access to formulary or for something broader?</p>",
        "id": 213988914,
        "sender_full_name": "Robert Dieterle",
        "timestamp": 1603234017
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> .  Yes, <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span>  we are trying to meet the CMS Final Rule.</p>",
        "id": 214056200,
        "sender_full_name": "Fred Harmon",
        "timestamp": 1603290083
    },
    {
        "content": "<p>The final rule only applies to specific plans  -- Medicare Advantage, Medicaid, Medicaid HMO, CHIP and QHP via the federal marketplace.  You should review the actual wording in the CMS Interoperability Final Rule.  The plans you have described to not appear to fall under this rule.  you may wish  work with your customer and their compliance group to determine if the rule even applies.</p>",
        "id": 214057449,
        "sender_full_name": "Robert Dieterle",
        "timestamp": 1603290602
    },
    {
        "content": "<p>Great point <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> .  The customer does offer some medicare and medicaid plans so we do have work to do, but I had forgotten about this language from the rule.  Appreciate the assistance again.</p>",
        "id": 214059328,
        "sender_full_name": "Fred Harmon",
        "timestamp": 1603291318
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span>  <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> <span class=\"user-mention\" data-user-id=\"222957\">@Dave Hill</span> </p>\n<p>I think this is an interesting situation for my customer.  While the final rule does only require the formulary FHIR API's for certain types of plans, it would seem in the best interest of our customer and their members that no matter what plan they are on (commercial or public), they can find formulary and coverage data.  The first use case described in the IG is for the patient looking up formulary coverage information on their medications for their current plan.  For this to be successful for all members, our customer would need to expose all their plans, not just those required by CMS.    The second use case in the IG describes using the API's to shop your medications around to different plans to compare costs.  If our customer were to include all plans to be successful in the first use case, they would then be exposing plans in the second use case which are not available (commercial/employer plans) potentially confusing the end user.</p>\n<p>This will ultimately be up to my customer to decide what they want to expose, but I hoped those working closely with this IG had run into this previously perhaps.</p>\n<p>Thanks for all your time considering this.</p>",
        "id": 214084753,
        "sender_full_name": "Fred Harmon",
        "timestamp": 1603300927
    }
]