[
    {
        "content": "<p>Good day all,<br>\nWe have a difference of opinion on how we should appropriately use the drug tier extension on the Coverage Plan profile.  To illustrate the confusion, I am going to make up an example.  Let’s say we have plan A.  Plan A has 5 drug tiers with one of the drug tiers being “preferred-generic”.  “Preferred-generic” has 6 pharmacy types associated to it.  Each of those pharmacy types have copay and/or coinsurance values associated to them.<br>\n1 month standard retail,<br>\n2 month standard retail,<br>\n3 month standard network retail,<br>\n1 month standard mail order,<br>\n2 month standard mail order and<br>\n3 month standard mail order</p>\n<p>OPTION 1:  costSharing extension is dependent upon the drug tier and mail order value.<br>\nWith option 1, the drugTier extension will repeat twice for “preferred-generic”.  One “preferred-generic” drugTier extension has a mail order set to true and the costSharing extension repeats three times with the following pharmacyType values:<br>\n1 month standard mail order,<br>\n2 month standard mail order and<br>\n3 month standard mail order<br>\nThe second “preferred-generic” drugTier extension has a mail order value of false and the costSharing extension repeats three times with the following pharmacyType values:<br>\n1 month standard retail,<br>\n2 month standard retail,<br>\n3 month standard network retail<br>\nThis option is based on the idea that the drug tier and mail order values, in combination, drive the pharmacy type for a given drug tier extension.</p>\n<p>OPTION 2:  costSharing extension is dependent upon the drug tier, but not the mail order value.<br>\nWith option 2, the drugTier extension will not repeat for “preferred-generic”.  It will appear only once.  The mail order is set to true and the costSharing extension repeats six times.  It has both mail order and retail pharmacy types.<br>\n1 month standard retail,<br>\n2 month standard retail,<br>\n3 month standard network retail,<br>\n1 month standard mail order,<br>\n2 month standard mail order and<br>\n3 month standard mail order<br>\nThis option is based on the idea that the drug tier alone drives the pharmacy type and the mail order value doesn’t limit the pharmacy types that can appear for a given drug tier extension.<br>\n<span class=\"user-mention\" data-user-id=\"360036\">@Mark Neumuth</span></p>",
        "id": 239153481,
        "sender_full_name": "Courtney Bland",
        "timestamp": 1621282739
    }
]