[
    {
        "content": "<p>From <span class=\"user-mention\" data-user-id=\"326428\">@Bryan Briegel</span> : <br>\n<code>I have a general question on the framework for a drug Formulary vs a Preferred Drug List. Is the question noted re: Maryland , known to be specific to that state, or Medicaid FFS in general? MA-PD plans are required to make accessible \"(ii)Formulary data that includes covered Part D drugs, and any tiered formulary structure or utilization management procedure which pertains to those drugs.\" where Medicaid is required to make accessible \"(4) Information about covered outpatient drugs and updates to such information, including, where applicable, preferred drug list information,\" I poked through the IG and I dont see references to \"preferred drug lists\" - just wondering on that, thx.</code></p>",
        "id": 233316170,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1617714937
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"326428\">@Bryan Briegel</span> - seems like 'tiered formulary structure or utilization management procedure' maps nicely to the IG.  Wouldn't 'preferred drug list' information map to drug tiers as well?<br>\n<span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span></p>",
        "id": 233316478,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1617715058
    },
    {
        "content": "<p>Adding my two cents on this. Preferred Drug Lists may or may not be tiered. Generally this used in open formularies where only preferred products are managed on the \"list\" but any other product may covered as \"non-Preferred\" (given other exclusion rules like bulk chemicals, repackaged products, etc.). So being Preferred is a tier or a part of a tier.</p>",
        "id": 233668851,
        "sender_full_name": "Kate Dech",
        "timestamp": 1617894230
    },
    {
        "content": "<p>Thank you, I was curious to understand more about this and how the IG supported preferred drug lists, and it sounds like they are.  The IG notes \" A drug formulary is a list of brand-name and generic prescription drugs a health insurer agrees to pay for, at least partially, as part of health insurance coverage.\"  - which is the case, though it wasnt clear to me if a Preferred Drug list == a Formulary or would be considered a \"Formulary\" as there are differentiations in the Rule and there appear to be nuances.  Thank you.</p>",
        "id": 233832749,
        "sender_full_name": "Bryan Briegel",
        "timestamp": 1617979328
    }
]