[
    {
        "content": "<p>I'm tryinig to understand how the Drug Formulary IG should work within the context of the Patient Access API, which is scoped to a single authenticated user.</p>\n<p>I found <a href=\"https://jira.hl7.org/browse/FHIR-31073\">https://jira.hl7.org/browse/FHIR-31073</a> but, unfortunately, the proposed resolution to this issue is confusing to me and I believe that it inadequately addresses the issue.<br>\n<a href=\"/user_uploads/10155/lGnLwh7mnZMO4-0EEW5DZxPR/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/lGnLwh7mnZMO4-0EEW5DZxPR/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/lGnLwh7mnZMO4-0EEW5DZxPR/image.png\"></a></div>",
        "id": 237702573,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1620324163
    },
    {
        "content": "<p>Specifically, I do not understand the concept of \"plan selection\" in this table.<br>\nHow do we get from a single patient context (provided via SMART App Launch) to a list of plans for the user to perform this selection?</p>",
        "id": 237702614,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1620324183
    },
    {
        "content": "<p>We were thinking that this could be done by linking a CARIN for BlueButton Coverage resource (with type DRUGPOL or HIP or similar) to a Drug Formulary \"Formulary Coverage Plan\", either explicitly through an extension of type Reference or implicitly through an identifier that would match the PlanId that is used in both the \"Formulary Coverage Plan\" List.identifier and the Formulary Drug MedicationKnowledge.usdf-PlanId-extension.</p>\n<p>If such linkage was explicitly prescribed, it would be possible for both clients and servers to:</p>\n<ol>\n<li>obtain a list of active Coverage resources for a single patient</li>\n<li>either allow the end user to select a particular plan or scope all requests to the member's active plan(s)</li>\n</ol>",
        "id": 237703044,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1620324336
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span> Using the Coverage resource to connect to the Formulary CoveragePlan is what we were thinking as well.  We can potentially discuss this further during today's PDex call.</p>",
        "id": 237838471,
        "sender_full_name": "Dave Hill",
        "timestamp": 1620400278
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span></p>",
        "id": 237843780,
        "sender_full_name": "Dave Hill",
        "timestamp": 1620402124
    },
    {
        "content": "<p>Copying over to thread the notes as recorded from today's PDex call:</p>\n<p>Q: Formulary - Once a patient logs in, how do we connect them to their formulary?</p>\n<p>R:  Options: </p>\n<p>Through PDex coverage resource, then an internal mapping to get them to the appropriate coverage and coverage plan.<br>\nBehind the scenes internal mapping (outside FHIR) - then you wont have the dependency between coverage plan and coverage resource. <br>\ncan also be one prescription drug plan offered to members, no choice, so just return the single drug plan.  <span class=\"user-mention\" data-user-id=\"222957\">@Dave Hill</span> <span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span> <span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span></p>",
        "id": 237871404,
        "sender_full_name": "Bryan Briegel",
        "timestamp": 1620413111
    },
    {
        "content": "<p>Thanks Bryan.  It still seems to me that we'd want to have some way to link a member's Coverage resource to its corresponding Formulary Coverage Plan and that there ought to be a recommended way for doing that.</p>\n<p>Assuming you wanted to link a PDex Coverage (assuming that is <a href=\"http://hl7.org/fhir/us/davinci-pdex/StructureDefinition-hrex-coverage.html\">http://hl7.org/fhir/us/davinci-pdex/StructureDefinition-hrex-coverage.html</a> ?) to a Formulary Coverage Plan, which field would you use for that?</p>",
        "id": 237872857,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1620413745
    }
]