[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> The PlanID extension states:  Unique, 14-character, HIOS-generated Plan ID number.  Isn't a HIOS Plan ID only for QHP plans?  How should payers handle other lines of business for the PlanID extension (such as Medicare, CHIP, etc...)?</p>",
        "id": 207017771,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1597491231
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span>  <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span></p>",
        "id": 207048189,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1597540696
    },
    {
        "content": "<p>Are there natural plan IDs for these other lines of business?</p>",
        "id": 207264506,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1597760247
    },
    {
        "content": "<p>For non-QHP plans, yes, just not a HIOS ID.  The language in the extension causes confusion:  <a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-formulary/StructureDefinition-usdf-PlanID-extension.html\">https://build.fhir.org/ig/HL7/davinci-pdex-formulary/StructureDefinition-usdf-PlanID-extension.html</a></p>",
        "id": 207286249,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1597770360
    },
    {
        "content": "<p>What is your recommendation for how it should be described?  I can create a Jira ticket for the next update, or if you want to track it, you can create it.<br>\nObviously, copying some of the descriptions lock-stock-barrel from the QHP formulary wasn't such a great idea, sigh.</p>",
        "id": 207309284,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1597781271
    },
    {
        "content": "<p>Is the intention to have a unique plan ID for government mandated plans or all plans (including commercial)?  <br>\nIf the latter, could do something simple like:  Unique, Payor generated Plan ID number. (Plan IDs must be unique, even across different markets.)<br>\nIf the former, could do something like: Unique, generated Plan ID number, such as HIOS ID for QHPs or Contract Number for Medicare Advantage Plans. (Plan IDs must be unique, even across different markets.)</p>",
        "id": 207393251,
        "sender_full_name": "Jason Teeple",
        "timestamp": 1597834355
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-28293\">https://jira.hl7.org/browse/FHIR-28293</a></p>",
        "id": 207468684,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1597875989
    },
    {
        "content": "<p>Confirming that I'm interpreting this thread correctly in that we are not obligated to use HIOS IDs for the plan ID. We're just waiting for an update to the IG to reflect this per the above Jira ticket. Is that a correct assessment?</p>",
        "id": 220740275,
        "sender_full_name": "David Clowers",
        "timestamp": 1608675639
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> Forgot to tag you here.</p>",
        "id": 220748043,
        "sender_full_name": "David Clowers",
        "timestamp": 1608681119
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"337701\">@David Clowers</span> Yes.  The issue raised by <span class=\"user-mention\" data-user-id=\"197108\">@Jason Teeple</span> remains unresolved, and should be addressed in a future update of the IG.   The recent technical correction was just that -- addressing some purely technical issues in IG publication that weren't caught prior to publication of the STU1.</p>",
        "id": 220753717,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1608687039
    },
    {
        "content": "<p>Is the intention for the PlanID to be something that the patient or a provider associated with a patient has access to (such as being printed on their insurance card) or is an internal identifier sufficient? </p>\n<p>My guess would be that, in order to support the search use cases that have PlanID in them, it would either need to be something that is accessible or it would need to be abstracted underneath via the front-end UI (i.e. via a lookup, predefined plan drop-down list, or something similar).</p>",
        "id": 225334642,
        "sender_full_name": "Dale Brown",
        "timestamp": 1612548387
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"264105\">@Dale Brown</span> - I think there are two issues.<br>\n1) the definition of the PlanID.   See <a href=\"https://jira.hl7.org/browse/FHIR-28293\">https://jira.hl7.org/browse/FHIR-28293</a><br>\n2) how would a user/member select the appropriate PlanID.  In particular, how would the PlanID be selected with the member has already authenticated.</p>",
        "id": 225339503,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1612550726
    }
]