[
    {
        "content": "<p>For Medicare Advantage plan, what should be the ID Type to use in Plan Id Type Extension?<br>\n<a href=\"http://hl7.org/fhir/us/davinci-drug-formulary/StructureDefinition-usdf-PlanIDType-extension.html#root\">http://hl7.org/fhir/us/davinci-drug-formulary/StructureDefinition-usdf-PlanIDType-extension.html#root</a></p>",
        "id": 234531028,
        "sender_full_name": "Tun Naing",
        "timestamp": 1618417867
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194834\">@Tun Naing</span> The current version of the IG (as you no doubt have observed) doesn't specify any values for this string except for Marketplace plans (\"Type of Plan ID. For all Marketplace plans this should be: HIOS-PLAN-ID\").   Seems like an area where additional guidance would be helpful.</p>\n<p><span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span></p>",
        "id": 234684908,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1618496699
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"215604\">@Saul Kravitz</span> When we should expect any updates with a defined vocabulary for plans other than marketplace plans?</p>",
        "id": 236197486,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1619451762
    },
    {
        "content": "<p>Is this with respect to List.extension:usdf-PlanIDType-extension on the Formulary Coverage Plan profile? <br>\nIs the intent to identify a Plan Type or the actual Plan ID?</p>\n<p>Wouldn't there be only three valid values based on the plans required to meet the Drug Formulary API requirement?</p>\n<ol>\n<li>HIOS-PLAN-ID</li>\n<li>MAPD-PLAN-ID</li>\n<li>MCO-PLAN-ID</li>\n</ol>",
        "id": 236261033,
        "sender_full_name": "John Achoukian",
        "timestamp": 1619480038
    },
    {
        "content": "<blockquote>\n<ol>\n<li>HIOS-PLAN-ID</li>\n<li>MAPD-PLAN-ID</li>\n<li>MCO-PLAN-ID</li>\n</ol>\n</blockquote>\n<p>I hope there are some SMEs in the Drug Formulary team to answer what plans typically in use. Should I create a JIRA ticket for this one?</p>",
        "id": 236355991,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1619536386
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222957\">@Dave Hill</span> <span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span></p>",
        "id": 236360716,
        "sender_full_name": "Saul Kravitz",
        "timestamp": 1619537923
    },
    {
        "content": "<p>The plan ID is supposed to be placed in the List.identifier for the Formulary Coverage Plan profile. There is not currently any terminology defined for the Plan ID Type. Currently the Implementation  Guide (IG) specifies that the ID is an HIOS ID. However, it has been identified that not all plans have an HIOS ID. There is ongoing discussion within the IG development team about what exactly the guidance should be. A decision has not yet been reached, but the requirement at the most fundamental level is that the client be able to query a single public facing endpoint for formularies with an uniquely identified plan (unique within the context of the endpoint the client is calling).</p>",
        "id": 236544398,
        "sender_full_name": "Corey Spears",
        "timestamp": 1619629955
    },
    {
        "content": "<p>I have wondered why there is a separate extension for Plan ID Type when it could be baked into the List.identifier.type codeableConcept. Was there a rationale for splitting this out separately?  Is it truly the ID type or a plan type (similar to InsurancePlan.type for product types?)</p>",
        "id": 238355434,
        "sender_full_name": "Kate Dech",
        "timestamp": 1620755855
    }
]