[
    {
        "content": "<p>I have a few questions interpreting the table provided as guidance for how a Formulary API should respond to requests when a plan ID is specified and when it is not for Authenticated users.  (<a href=\"http://hl7.org/fhir/us/davinci-drug-formulary/use_cases_and_overview.html#authenticated\">http://hl7.org/fhir/us/davinci-drug-formulary/use_cases_and_overview.html#authenticated</a>). </p>\n<p><a href=\"/user_uploads/10155/Dm7FMksA_4wbzaTqj_vmGUCP/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Dm7FMksA_4wbzaTqj_vmGUCP/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/Dm7FMksA_4wbzaTqj_vmGUCP/image.png\"></a></div><ol>\n<li>\n<p>Using Rows 4 and 5 from the table, why does a user with the Situation \"Plan selected/in group with a PlanID not specified\"  (Row 5, Col 1) receive a \"Bundle of available group CoveragePlans. If no plans available, zero plans returned.\" (Row 5, Col 3)  when a user with the Situation \"Plan selected/no group and a PlanID not specified\" (Row 4, Col 1) receive \"Zero plans returned (200)\" (Row 4, Col 3)? I would have assumed that instead of \"Zero plans returned (200)\" they would have received  \"Bundle of available individual CoveragePlans. If no plans available, zero plans returned.\" Rows 4 and 5 appear to differ on whether the user is in a group or not.</p>\n</li>\n<li>\n<p>If the table is correct for Rows 4 and 5, then what is the logic for Rows 2 and 3 in Column 3? In both cases, a Bundle of available CoveragePlans is returned, with the only difference being individual CoveragePlans for Row 2 and group CoveragePlans for Row 3. I would think that if the logic differs on whether the user is in a group or not, then Row 2, Column 3 should be \"Zero plans returned (200)\" to be consistent with Row 4.</p>\n</li>\n<li>\n<p>While the table speaks to handling CoveragePlans, does the same logic extend to querying the FormularyDrug resource? For example, if an authenticated user is not authorized to see CoveragePlans that they have not selected when passing in a PlanID, what should the response be when they search for FormularyDrug resources using a CoveragePlan that does not match their PlanID using the search parameter DrugPlan?</p>\n</li>\n</ol>\n<p>I have reviewed previous conversations on Formulary API behavior for Authenticated users from <span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span> and <span class=\"user-mention\" data-user-id=\"193261\">@Craig McClendon</span>  and the responses from <span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span>  and others but did not see my specific questions addressed.</p>",
        "id": 274878849,
        "sender_full_name": "Rick Lisseveld",
        "timestamp": 1646938299
    }
]