[
    {
        "content": "<p>I want to just get this on the record. HL7 seems to be on track to self-certify as deserving the #PatientsIncluded badge.  It's somewhat loosely defined, has no organisation (the founders passed it on to the public and punted), and it is indeed self-certifying. </p>\n<p>Having said that, it can be a point of great social significance in the patient world ... and anyone who claims it without posting a GDoc with their rationale gets trounced, whereas anyone who is genuinely living the spirit is warmly welcomed and respected.</p>\n<p><a href=\"http://patientsincluded.org\" target=\"_blank\" title=\"http://patientsincluded.org\">http://patientsincluded.org</a></p>",
        "id": 168352681,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560809995
    },
    {
        "content": "<p>There are many of us in HL7 who have experience as a patient or a caregiver. Standing in the shoes of a patient or caregiver with the understanding of what can and cannot be done in technology is always going to be a great benefit. We also need non-technical patients and caregivers to give us insight on their needs. I know there are patient advocates who are not part of HL7. It would be nice if there could be an on option to allow them to join the work group without them having to pay.</p>",
        "id": 168355932,
        "sender_full_name": "Debi Willis",
        "timestamp": 1560813056
    },
    {
        "content": "<p>Agreed. I'll also take a moment to propose again that there are significantly different categories of use cases, and we may at various times want to prioritize them (or at least sequence them) and recruit people for different ones.  Examples:<br>\n- Elder caregiving<br>\n- Pediatrics<br>\n- Diabetes<br>\n- Oncology (of a thousand types)</p>\n<p>Should we be capturing these thoughts (about the content or structure of the patient group) in a GDoc? A wiki? I shudder to think of going back weeks later and thinking \"WHICH topic in that stream had these thoughts???\"</p>",
        "id": 168356071,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560813240
    },
    {
        "content": "<p>I don't think we have #PatientsIncluded as a goal.  We have quality healthcare delivery everywhere as a goal.  Patient inclusion is just a logical and necessary step towards that goal.  I don't think the HL7 organization is currently at a point where it could self-certify.  However, if we're successful in the patient inclusion step (of which a patient-centric work group is a sub-step) and self-certifying will help us attract more people who will help us move towards the true goal, then I'm all for it.</p>",
        "id": 168358248,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560815965
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> There's two different types of 'joining'.  No payment is required to participate.  You can join calls, read specs and submit feedback without paying a dime (excluding internet connection fees :&gt;).  You can even come to work group meetings, though that requires paying quite a few dimes - and even more for not being a member.  What you can't do is:<br>\n1. count as one of the 'initial members' that justifies formation of the work group<br>\n2. serve as a co-chair (or in any other organizational leadership capacity - e.g. board of directors)<br>\n3. formally 'vote' on a standard - i.e. provide feedback which determines whether a given specification will actually be approved as a standard or not<br>\nFor #1, I'm pretty sure that when we start actively soliciting, #1 isn't going to be a problem.  (That said, anyone on this thread, if you're willing to put your name on the list of initial members and you're an active member, please stick up your hand :&gt;)</p>\n<p>For #2, we <em>could</em> seek an exemption or see if we can get someone funded gratis - and there may well come a time where that will be desirable/appropriate.  But it would be better to submit the request for a new work group without having to do that</p>\n<p>For #3, I think we'll have to accept that, in most cases, patient feedback will come in as non-voting feedback.  Such feedback still counts and is still considered, but isn't necessarily processed as quickly and can't \"block\" publication.  Because HL7 is so strongly consensus-based, I expect this won't prove to be a significant issue in practice.  If it turns into a problem, we'll tackle it then.</p>",
        "id": 168358585,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560816410
    },
    {
        "content": "<blockquote>\n<p>However, if we're successful in the patient inclusion step (of which a patient-centric work group is a sub-step) and self-certifying will help us attract more people who will help us move towards the true goal, then I'm all for it.</p>\n</blockquote>\n<p>No surprise, we seem to be aligned.  This is no priority; it's symbolic (with meaning behind the symbol), and the substance is what matters.  </p>\n<p>As I said, I just want to get it recorded.</p>",
        "id": 168358659,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560816524
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thanks much for that explanation of #3 particularly. I didn't realize there's a separation between having a voice and voting - the only options I've seen in other groups are \"full member\" and \"who cares about you? Shut up\" :-)</p>",
        "id": 168358771,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560816666
    },
    {
        "content": "<p>HL7 has always been open to participation from non-members.  However, FHIR's movement to gForge (soon? to be Jira) for both ballot and non-ballot comments has significantly boosted the ability for non-members to provide feedback (and ensure it gets processed).  Work groups look at everything, but will typically address ballot-related feedback first - though priority is also driven by the significance of the feedback.  The other difference is that if a work group disregards a comment of a negative voter, and the spec is going \"normative\" (i.e. locked down), the negative voter can ask all of the other voters to consider their comment and, if enough voters stand with them, they can prevent the spec from proceeding.  Non-vote comments have no such power.</p>",
        "id": 168364082,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560824917
    },
    {
        "content": "<p>@Lloyd McKenzie  Great explanation. I know there are some people who would like  to join the work group but might not know how to do that. Should we just send them a link to your google doc that you posted earlier?</p>",
        "id": 168364230,
        "sender_full_name": "Debi Willis",
        "timestamp": 1560825195
    },
    {
        "content": "<p>If they're already HL7 members and want to sign up, yes.  If they want to sign up as HL7 members and then work group members, then point them to the <a href=\"http://hl7.org\" target=\"_blank\" title=\"http://hl7.org\">hl7.org</a> website (and <em>then</em> point them to the Google doc :&gt;)</p>",
        "id": 168364507,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560825696
    },
    {
        "content": "<p>Note that I haven't added my name as an initial member because I don't know how much of my time I could legitimately contribute.  If I'm needed to push things over the top, I'll do so.  But if we can get over the top without that, it'd be better.</p>",
        "id": 168364563,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560825766
    },
    {
        "content": "<p>(I will - as will many others - provide assistance/guidance as things get up and running.)</p>",
        "id": 168364580,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560825811
    },
    {
        "content": "<p>rare diseases, chronic diseases, caregiver in general.</p>",
        "id": 168876713,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1561403307
    },
    {
        "content": "<p>Bringing patients to conferences is a thing these days.</p>",
        "id": 168876819,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1561403403
    }
]