[
    {
        "content": "<p>In light of <span class=\"user-mention\" data-user-id=\"311763\">@Morgan Gleason</span> winning the patient innovator track this week, I'm going to grab this December thread out of a private stream and float it publicly. </p>\n<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> <a href=\"#narrow/stream/209299-Patient-Innovator.20Judging/topic/A.20.2223.20portals.22.20challenge.3F/near/182867460\">said</a>:</p>\n<blockquote>\n<p>I have a daring \"challenge\" idea (\"challenge\" in the sense that the US government occasionally issues \"innovation challenges.\")  And as it happens it could earn attention from the US govt.</p>\n<p>On a short Twitter thread (incidentally including <span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span>), well-know US e-patient parent Amy Gleason <a href=\"https://twitter.com/ThePatientsSide/status/1203135896410824704\">said yesterday</a> about her daughter Morgan, who's something of an e-patient celebrity with her many conditions:  </p>\n<blockquote>\n<p>Yeah @morgan_gleason  has 23 patient portals!</p>\n</blockquote>\n<p>Imagine the work her family has to coordinate Morgan's records... perhaps in addition to the \"patient innovator\" track, we could have a challenge to the FHIR community in general: what can we do for someone with 23 portals??</p>\n<p>It could easily earn attention from the health IT media community, both for the problem itself and for whatever our contestants can achieve, all oriented around the very real challenges of coordinating care.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"311598\">@Bray Patrick-Lake</span>'s entry was entirely parallel though in different dimensions.</p>",
        "id": 201506913,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592699259
    },
    {
        "content": "<p>Dave, I'm delighted to report that the \"23 portals challenge\" has been solved by at least one company or at least as I understand the challenge.  And, yes the \"10 portals challenge\" and the \"100 portals challenge\" or more have also been solved as well.  This was one of the fundamental design requirements of our new Azuba Lifetime Clinical Records Platform.  Specifically, that the patient would only be required to automatically \"sync\" their smartphone app with a single secure enterprise health connector no matter how many doctors, hospitals, labs or other health providers they have seen during their lifetime health journey and/or will visit in the future.  And, that the Platform automatically retrieves any and/or all of the patients clinical data;  normalizes their data, enables their data to be viewed as a single aggregated Lifetime encounter or as any combination of individual encounters;  and automatically keeps any or all of their health providers up to date with any and/or all of their health data.  And, it does any or all of these functions plus many others at the patients discretion either via their Azuba smartphone app and/or any of our partner apps today.</p>",
        "id": 203728208,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1594653563
    },
    {
        "content": "<p>Has the 23 Portals problem been solved by someone??</p>\n<p>(Has the problem ever been rigorously defined??)</p>",
        "id": 203738679,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1594658650
    },
    {
        "content": "<p>Wow, that's neat. How does that work?</p>",
        "id": 203798786,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1594702485
    },
    {
        "content": "<p>Did I miss understand your 23 Portals problem question?  Or, is there just a timing issue with how things are posting.</p>",
        "id": 203798985,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1594702812
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"216345\">Bart Carlson</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/A.20.2223.20portals.22.20challenge.3F/near/203798985\">said</a>:</p>\n<blockquote>\n<p>Did I miss understand your 23 Portals problem question?  Or, is there just a timing issue with how things are posting.</p>\n</blockquote>\n<p>LOL I think I misunderstood your \"at least one company\" - in my haste I didn't realize you were talking about <strong>your</strong> company!</p>\n<p>Hey, I have an idea - <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> you know about MITRE's Synthea data sets, right?  Think we could talk them into creating a Synthea Morgan dataset, with all the info (like <span class=\"user-mention\" data-user-id=\"311763\">@Morgan Gleason</span>'s) scattered around 23 portals?  And maybe a Synthea Bray, like <span class=\"user-mention\" data-user-id=\"311598\">@Bray Patrick-Lake</span> 's situation - multiple devices etc etc?  In each case developers could demonstrate what their apps (or middleware) can do.</p>",
        "id": 203816605,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1594721210
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/A.20.2223.20portals.22.20challenge.3F/near/203816605\">said</a>:</p>\n<blockquote>\n<p>Hey, I have an idea - <span class=\"user-mention silent\" data-user-id=\"191678\">Abigail Watson</span> you know about MITRE's Synthea data sets, right?  Think we could talk them into creating a Synthea Morgan dataset, with all the info (like <span class=\"user-mention silent\" data-user-id=\"311763\">Morgan Gleason</span>'s) scattered around 23 portals?  And maybe a Synthea Bray, like <span class=\"user-mention silent\" data-user-id=\"311598\">Bray Patrick-Lake</span> 's situation - multiple devices etc etc?  In each case developers could demonstrate what their apps (or middleware) can do.</p>\n</blockquote>\n<p>Remind me, who are the MITRE people around here, particularly those with Synthea expertise?</p>",
        "id": 203816717,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1594721294
    },
    {
        "content": "<p>It is not a matter of what apps can or cannot do, the data in most cases is simply not accessible at the source - regardless of the app</p>",
        "id": 203821533,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1594725499
    },
    {
        "content": "<p>Or the mechanics at each of the 23 are totally different, thus creating a barrier to learning how to get connected.</p>",
        "id": 203829475,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594731456
    },
    {
        "content": "<p>Or the mechanics at each of the 23 are totally different, thus creating a barrier to learning how to get connected.</p>",
        "id": 203829488,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594731464
    },
    {
        "content": "<p>So having 23 nice clean FHIR reference servers all running the same access policy, identity system, and administrative overhead would not be a good simulation.</p>",
        "id": 203829552,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594731500
    },
    {
        "content": "<p>So having 23 nice clean FHIR reference servers all running the same access policy, identity system, and administrative overhead would not be a good simulation.</p>",
        "id": 203829567,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594731510
    },
    {
        "content": "<p>Or the mechanics at each of the 23 are totally different, thus creating a barrier to learning how to get connected.</p>",
        "id": 203829568,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594731510
    },
    {
        "content": "<p>The healthcare community moving toward FHIR is a critically important step. but the front-door is still hidden, locked, boarded-over, ...</p>",
        "id": 203829891,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594731707
    },
    {
        "content": "<p>Oh, one could certainly use Synthea to simulate 23 different portals.  It would be fairly straightforward; it just involves figuring out the differentials for each 23 systems, and creating a pipeline that has a separate generator for each of them.  What you'd want to do is align it around the Argonaut resources, and figure out the 'minimum viable health record' that's common to all portals (the longitudinal record), and then add in 23 differentials.  </p>\n<p>Like John says, though... there are different access policies, identity systems, etc.  So you also sort of want 23 different test servers.  Which is what the Ring of FHIR project was wanting to do.  </p>\n<p>So, there's a question of whether one would want to do one big simulation, that randomly generates 23 organizations, each with different coding styles; or whether one would want to run 23 different simulations, and load each one into a different server.    All of that takes time and effort.</p>\n<p>To the original question though...  yes, we've been using Synthea to do more or less do exactly what you're describing.  There's something like 60+ pipelines in the project now, ranging across the healthcare industry, and they already encode multiple devices, in-so-far as laboratory equipment is different than radiology is different than gastroenterology, etc.  Each of the 60+ pipelines was sponsored by a different organization, and has different subject matter; and you can tell the utility to output in DSTU2, STU3, R4, etc.    So what I'll sometimes do, is pick a patient from a generated dataset, and then I'll do a global search and replace on one of the patient's medical records and names, and rewrite them as a reference patient (Jane123_Doe456, etc).  It's a manual edit as post-processing step, and basically sets it up for testing patient matching functionality.</p>",
        "id": 203839025,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1594736612
    },
    {
        "content": "<p>Also, I've advocated in the past that we need reference patients with detailed medical histories that we can register in each of the EHR test systems, and I think this dovetails with that concern.  If you actually go look at each of the test sandboxes, we'll see the Jason and Jessica Argonaut in Epic, we'll see Nancy SMART and family in Cerner; the Society of Imaging Informatics in Medicine has the Siim family, and so forth.  </p>\n<p>We did this so many times that we created a character roster.<br>\n<a href=\"https://drive.google.com/file/d/1o7VUbWQXzV3mH5XL81xFlKbJaMJ7QzNi/view?usp=sharing\">https://drive.google.com/file/d/1o7VUbWQXzV3mH5XL81xFlKbJaMJ7QzNi/view?usp=sharing</a></p>\n<p>So how do you do the '23 portals challenge', aka verify a longitudinal healthrecord?   Well, you have a few options.</p>\n<p>A) You could assume that Jessica Argonaut and Nancy SMART are the same person, had a name change, and try to merge those two records.  <br>\nB) You could load a Nancy SMART into Epic; and a Jessica Argonaut into a Cerner sandbox.<br>\nC) You could load an independent test patient into both Epic and Cerner sandboxes.  </p>\n<p>And the above logic gets repeated for each of the 23 sandboxes in a Ring of FHIR challenge.  Any/all of the above options require a sort of fully fleshed out longitudinal record as a reference standard that each of the participating systems gets a portion of (and which can be compared back to the original).  </p>\n<p>However, for political reasons, I don't think option B gets very far, because there's a certain vein of thought that sees the test patients files as maybe qualifying as intellectual property.  Paintshedding maybe; but it's real.  Which is where a neutral 3rd party could be very handy to generate that reference in an open/standard way, that each of the vendors could consume and load into their systems without worry of copyright or IP infringement.</p>",
        "id": 203841181,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1594737710
    }
]