[
    {
        "content": "<p>What about the following?</p>\n<p>It allows us to build on what we already have designed:</p>\n<p>Use the Task method we already have in the IG.</p>\n<ul>\n<li>support of official correspondence such as amendment report and denial report and official inputs like request for corrections form and letter of disagreement supported using inputs and outputs.  (however, as much as possible inputs and outputs are optional and information could be communicated by another means)  </li>\n<li>use notes on fulfiller side only to communicate information about the work done on the task which could include notation about patient correspondence.</li>\n<li>carefully design ability to update a request (Vassil and Lloyd have provided advice on this).</li>\n</ul>\n<p>As a separate but related function or project, create a second capability to support a FHIR equivalent of secure messaging between patient portal and provide message boxes.  This could be used for any number of purposes.  One purpose could be to correspond with patient about clarifications on correction request.  Provide capability in the Communication and/or CommunicationRequest resource to point to the RequestforCorrection Task.</p>\n<p>Reflecting on this, I think there is another problem that could use the same paradigm: a patient's Request for Release of Information.   Especially when data is not available to the portal or API, this is very much a manual process.  And if data could come to the API, even as a PDF that would be valuable.</p>\n<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> <span class=\"user-mention\" data-user-id=\"192825\">@Jeffrey Danford</span> <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span></p>",
        "id": 223842472,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1611531296
    },
    {
        "content": "<p>Why on the fulfiller side only?  Allowing the Patient (or caregiver) to add comments seems like something we'd want to support.<br>\nNo real 'careful design' is required.  Updates that check for resource contention are a pretty typical way of doing things.  We'd just need to say that it was mandatory for use with our IG.</p>\n<p>Agree that if we're going to define a generic mechanism for supporting a back-and-forth discussion, it should be generic.  There are a good number of things that patients and providers might find it useful to have a 'conversation' about.</p>\n<p>I still want to better understand <span class=\"user-mention\" data-user-id=\"192825\">@Jeffrey Danford</span>'s concern about the Patient initiating the Task directly and his preference for indirect initiation instead.</p>",
        "id": 223851288,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611544061
    },
    {
        "content": "<p>just saw more of case for notes on fulfiller side and trying to keep it simple.  Excited to learn about resource contention.  Want to know if anyone else is doing something like this.</p>",
        "id": 223863164,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1611560509
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/A.20way.20forward.20for.20patient.20corrections/near/223851288\">said</a>:</p>\n<blockquote>\n<p>Why on the fulfiller side only?  Allowing the Patient (or caregiver) to add comments seems like something we'd want to support.</p>\n</blockquote>\n<p><span aria-label=\"100\" class=\"emoji emoji-1f4af\" role=\"img\" title=\"100\">:100:</span> ^^<span aria-label=\"100\" class=\"emoji emoji-1f4af\" role=\"img\" title=\"100\">:100:</span></p>",
        "id": 223889862,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1611577879
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/A.20way.20forward.20for.20patient.20corrections/near/223851288\">said</a>:</p>\n<blockquote>\n<p>if we're going to define a generic mechanism for supporting a back-and-forth discussion, it should be generic.  There are a good number of things that patients and providers might find it useful to have a 'conversation' about.</p>\n</blockquote>\n<p>I want to note here, because the distinction is subtle and vital, that this is a signal of a shift from the old view \"We know everything that's important, and we're right about it\" to \"To get this right, we need to collaborate.\"  Participatory medicine.</p>\n<p>In the early days of the \"data liberación\" movement, more than once a senior-looking physician said to me after a speech, \"These are MY notes, for MY work! They're none of your business!\"  In that view, it made sense for long-ago vendors to create systems to do what their customers wanted: a system that had no need for dialog.</p>",
        "id": 223890470,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1611578236
    },
    {
        "content": "<p>Here's an artifact from \"These are MY notes\" days.  The desk clerk actually laughed when I asked for a copy but readily provided it :-)<br>\n<a href=\"/user_uploads/10155/MDQmxrGEmA_vAQkVP2tkC4LB/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/MDQmxrGEmA_vAQkVP2tkC4LB/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/MDQmxrGEmA_vAQkVP2tkC4LB/image.png\"></a></div>",
        "id": 223890665,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1611578351
    },
    {
        "content": "<p>A great example of reality!</p>",
        "id": 223943745,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1611601236
    },
    {
        "content": "<p>I am trying to incorporate the notes in this thread with the 'How message are IRL...' thread. I am now realizing I may have been posting in the wrong stream haha. I posted a flow that includes the fewest number of steps I can imagine to provide a simple, \"lets chat about this bit of data, and let me know the status of updates\" functionality. It's not grandiose but it will be more attractive to implementers because of ease of use (realistic first step). I will also take suggestions (as <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  has some ideas on how to change out the task/communication resources that will be helpful).</p>\n<p>I will update the flow with lloyds notes (we add task.note[] instead of the more burdensome communication resources). This will cover the use cases specified in the IG.</p>",
        "id": 223949477,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611603788
    }
]