[
    {
        "content": "<p>Science fiction time, of the terror variety.  (This is uncomfortable but not unreal.)</p>\n<p>Let's say the worst unfolds with this virus, and some or all countries have decided that triage demands denying treatment to elders (of which I'm one). So let's say people like me are left to self-treat, whatever that might mean. Some of us would surely die, and the rest of us would be left to try and outlast the thing: find ways to flatten our own n-of-1 curve, to live long enough for the virus to expire or for other help to arrive. </p>\n<p>What sort of metrics might we collect (crowdsource) that might help discover factors that matter?</p>",
        "id": 190928359,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584491647
    },
    {
        "content": "<p>The best bet is to get to a farm or lake house or cabin if you have one this spring.  There's probably going to be a real estate flight to the suburbs over the next year, and we're going to see the bubble pop for inner city real estate.  </p>\n<p>The viral spread will die down during the summer, in the same way that flus and colds are seasonal.  The warmer weather evaporates the liquid droplets that the virus is suspended in, and then UV/solar energy breaks down the virus itself, in the same way that spending a day in the sun can leave you with a sunburn.  So we'll get a slight reprieve.  </p>\n<p>Once autumn comes around and flu season starts up is when things are going to get hot-spotty.  We're probably going to see a giant game of wack-a-mole as we triage outbreaks and try to roll out Phase II trial vaccines, which will be mixed success.  Bed count capacity is going to become the relevant issue.  Along those lines, UPenn just released this utility for capacity planning:</p>\n<p><a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6645805687261798400/\" target=\"_blank\" title=\"https://www.linkedin.com/feed/update/urn:li:activity:6645805687261798400/\">https://www.linkedin.com/feed/update/urn:li:activity:6645805687261798400/</a></p>\n<p>Which isn't entirely patient centric, but I'm noodling on how to make a patient version of it.  The general idea is dispersion and spreading the load.  So a heatmap or bed count map might be able to tell you not to go to the hospital in this downtown clinic, but maybe check out another hospital one town over.  Maybe.  Something along those lines.</p>",
        "id": 190938801,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1584506373
    },
    {
        "content": "<p>Wow - that's not exactly what I had in mind - I was thinking health data :-).   But as someone with zero expertise in epidemiology, on the face of it that's an.... interesting... scenario, and someone should start scripting the film version right away.  (There MUST be a book someone's written, apocalyptic fiction, along these lines.)</p>\n<p>If what you say is right (spread will slow in warmer weather), then perhaps hospital load might shrink to match capacity at least through the summer.  All other things equal, if warmer weather is safer, is moving south a sane defense?</p>\n<p>Anyway, I was wondering what the 60+ crowd might do if they get pushed off the bad end of the triage curve, to self-monitor (early warning signs?) or crowdsource useful information or ANY such thing.  </p>\n<p>And hm, migrating south ... time to buy a used RV and head to the desert?</p>",
        "id": 190977951,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584537494
    },
    {
        "content": "<p>then drive your RV to south-america when it starts to get cold in the fall</p>",
        "id": 190978256,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584537656
    },
    {
        "content": "<p>Well, I've been tracking all the incoming research I can, coding it up, and working on a synthetic patient module in Synthea, which if modeled correctly can double as a safety protocol for patients and a triaging protocol for staff.  <br>\n<a href=\"https://github.com/synthetichealth/synthea/issues/679\" target=\"_blank\" title=\"https://github.com/synthetichealth/synthea/issues/679\">https://github.com/synthetichealth/synthea/issues/679</a></p>\n<p>For instance, Type A blood is a risk factor; ibuprofin is thought to be contraindicated, so people are recommending acetaminophen instead; stay on blood pressure medications; avoid NSAIDs and other medications that <em>raise</em> blood pressure, warmer climates are probably better.  Maybe add a saline spray, neti-pot, or other nasal irrigation to avoid post nasal drip (indicated by both gastrointestinal symptoms and pnemonia).  </p>\n<p>But other than lots of bed rest and keeping horizontal so that post nasal drip doesn't take the virus from the nose/throat into the lungs, the progression is pretty straight forward and similar to other upper respiratory diseases.  </p>\n<p>The bigger challenge is going to be triaging protocol and keeping up with ventilator operations when there aren't enough ventilator operators or equipment to go around.  Knowing that 600mg of hydroxychloroquine with azithromycin helps clear the lungs of viral infection is only moderately helpful to patients if they're on a feeding tube and immobile or on a ventilator, or if they can't get access to medications.  </p>\n<p>In the meantime, consider a hamper and dedicated 'outside' clothes, and wear a mask, and compious amounts of hand sanitizer.  The local hospital in my hometown is recruiting all the local quilters to begin sewing facemasks.  </p>\n<p><a href=\"https://www.courierpress.com/story/news/2020/03/18/coronavirus-deaconess-ask-public-provide-medical-face-masks/2865273001/?fbclid=IwAR3_VBCCHItKZlUDb_dU-rRTU1ER-tdcLSODWxv41GjvhXHoyac666hk0EI\" target=\"_blank\" title=\"https://www.courierpress.com/story/news/2020/03/18/coronavirus-deaconess-ask-public-provide-medical-face-masks/2865273001/?fbclid=IwAR3_VBCCHItKZlUDb_dU-rRTU1ER-tdcLSODWxv41GjvhXHoyac666hk0EI\">https://www.courierpress.com/story/news/2020/03/18/coronavirus-deaconess-ask-public-provide-medical-face-masks/2865273001/?fbclid=IwAR3_VBCCHItKZlUDb_dU-rRTU1ER-tdcLSODWxv41GjvhXHoyac666hk0EI</a></p>\n<p>And here's how to make hand sanitizer from aloe vera gel and rubbing alcohol if local supplies of pre-made stuff have run out.<br>\n<a href=\"https://www.healthline.com/health/how-to-make-hand-sanitizer\" target=\"_blank\" title=\"https://www.healthline.com/health/how-to-make-hand-sanitizer\">https://www.healthline.com/health/how-to-make-hand-sanitizer</a></p>",
        "id": 191142329,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1584636906
    },
    {
        "content": "<p>Saw this on LinkedIn - <a href=\"https://www.linkedin.com/posts/dr-nikola-cihoric_ehr-ehealth-digitalhealth-activity-6645795165195825152-KxUG\" target=\"_blank\" title=\"https://www.linkedin.com/posts/dr-nikola-cihoric_ehr-ehealth-digitalhealth-activity-6645795165195825152-KxUG\">https://www.linkedin.com/posts/dr-nikola-cihoric_ehr-ehealth-digitalhealth-activity-6645795165195825152-KxUG</a></p>",
        "id": 191148590,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584639324
    }
]