[
    {
        "content": "<p>I just posted this to the listserv - I'll duplicate it here for slackers who hang out here but not there :-)  </p>\n<p><strong>IMPORTANT: busy agenda for Thursday WG meeting</strong></p>\n<p>Your three co-chairs met for 75 minutes today reviewing all the week's news and writing the agenda for Thursday's meeting. </p>\n<p><strong>It will be a packed hour. If you can <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=76163882#id-20200312PatientEmpowermentAgenda-AgendaTopics\" target=\"_blank\" title=\"https://confluence.hl7.org/pages/viewpage.action?pageId=76163882#id-20200312PatientEmpowermentAgenda-AgendaTopics\">review the agenda</a></strong> and get your thoughts moving it will be great!  This will not be a meeting where we want people to show up and have a stunned \"Wow...\" reaction THEN start thinking :-)</p>\n<p><strong>Special notice:</strong> With the release Monday of the Final Rules from ONC and CMS, <strong>the HL7 Public Policy WG has asked all WGs to report back on how the rules will affect them.</strong> For our charter and mission the rules are huge news. <strong>Who among us can contribute to that analysis?</strong></p>\n<p><strong>Separate question, not necessarily for discussion Thursday:</strong><br>\nFew among us can read the 1,244 page ONC rule and the 474 page CMS rule, so the agenda asks what the best summaries are. Josh Mandel suggested starting with <a href=\"https://www.healthit.gov/curesrule/resources/fact-sheets\" target=\"_blank\" title=\"https://www.healthit.gov/curesrule/resources/fact-sheets\">ONC's fact sheets page</a> but I'm hoping to also find a more subjective \"what does it mean TO PATIENTS\" article.</p>",
        "id": 190221179,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583872425
    },
    {
        "content": "<p>I presume that \"consents\" is about privacy? Or about informed consent - patient will, DNR, etc?</p>",
        "id": 190229512,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583876935
    },
    {
        "content": "<p>if about privacy, i presume that it includes \"permissions\" - i.e. proper sharing of data without needing an explicit consent, like when my insurance company gets data from the hospital without me having to consent (or when a specialist gets to see my files etc)?</p>",
        "id": 190229664,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583877033
    }
]