[
    {
        "content": "<p>I'm pasting here this excerpt from <span class=\"user-mention\" data-user-id=\"191936\">@Michael Donnelly</span> 's post tonight in the  \"Epic's CEO\" thread in <a class=\"stream\" data-stream-id=\"179160\" href=\"/#narrow/stream/179160-social\">#social</a>. This will be immensely quotable to the general public of patient innovators:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> is correct above; when the developer of a patient-facing app wants that app to work with Epic, there's nothing that Epic or any org using Epic (in the US) needs to do to make it work.  </p>\n<ol>\n<li>The app developer (who could be the patient themself) goes to <a href=\"https://open.epic.com\" target=\"_blank\" title=\"https://open.epic.com\">https://open.epic.com</a> and creates a record for the app.</li>\n<li>Epic doesn't do anything.</li>\n<li>Health care orgs using epic don't do anything.</li>\n<li>An automatic job runs at the health care provider every few hours and downloads all the new client records.</li>\n<li>The app works.  </li>\n</ol>\n</blockquote>\n<p><strong>Who here will help me see this with my own eyes?</strong> I'm a patient at Dartmouth-Hitchcock in Nashua NH and would love to see it happen. <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> PatientLink?  <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> Symptomatic? <span class=\"user-mention\" data-user-id=\"198669\">@Philip Parker</span> Coral Health? <span class=\"user-mention\" data-user-id=\"197054\">@Ricky Sahu</span> 1upHealth? Come one come all?  Should we have a \"one-patient connectathon\"?</p>",
        "id": 187320678,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1580776942
    },
    {
        "content": "<p>We have that connection- look for myFHR in the Apple store</p>",
        "id": 187322373,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1580779247
    },
    {
        "content": "<p>Or <a href=\"http://myFHR.careevolution.com\" target=\"_blank\" title=\"http://myFHR.careevolution.com\">myFHR.careevolution.com</a> from Web</p>",
        "id": 187322397,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1580779310
    },
    {
        "content": "<p>Yup that's pretty much the case. However for all other EHRs you need to get approved for health systems individually. And a patient's request often isnt enough to make that happen. Although epic is saying this, they seem to be the furthest along in enabling these capabilities. Anyway here's the video of our patient app <a href=\"https://1up.health/products/patient\" target=\"_blank\" title=\"https://1up.health/products/patient\">https://1up.health/products/patient</a> demonstrating the connection.</p>",
        "id": 187323688,
        "sender_full_name": "Ricky Sahu",
        "timestamp": 1580781090
    },
    {
        "content": "<p>Dave I will hand walk you through it.  I have tested a multitude of the apps.  They work.  In fact if you recall my break the wrist test I went to a hospital further away just because I knew their API was turned on and was Epic so I could play with apps :)</p>",
        "id": 187324826,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1580782827
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 187324918,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1580783029
    },
    {
        "content": "<p>I do want to see this happen (connecting a new app) WITH SCREEN RECORDING so we can play it back to the patient innovator public. </p>\n<p>And I want us to publish a list of places you can connect these apps to, so people can see what their options are</p>",
        "id": 187324976,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1580783130
    },
    {
        "content": "<p>Dave, I've actually reviewed all available PHRs that use FHIR. Would be happy to do it with you if you want to DM me.</p>",
        "id": 187330272,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1580791593
    },
    {
        "content": "<p>(Partial) list of places you can connect to: <a href=\"https://fhirendpoints.github.io\" target=\"_blank\" title=\"https://fhirendpoints.github.io\">https://fhirendpoints.github.io</a></p>",
        "id": 187346733,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1580812407
    },
    {
        "content": "<p>Dave, MyLinks has this connection.</p>",
        "id": 187354622,
        "sender_full_name": "Debi Willis",
        "timestamp": 1580819909
    },
    {
        "content": "<p>I'm grateful for all the \"yes I can\" but I think I didn't convey my main point clearly, which was about <em>newly created</em> apps:  </p>\n<p>I've often heard that various EMR vendors have quite a \"toll booth\" set up - connection fees, registration fees - so there are barriers to entry if a developer (including perhaps a one-off person like <span class=\"user-mention\" data-user-id=\"251396\">@John Keyes</span>) wants to connect to systems to get data.   What intrigues me here - not said in the subject line - is that if I myself created a <strong>NEW</strong> app, <strong>I could hook right up to such a hospital with no more \"negotiation\" or dialog than if I were viewing their website. </strong></p>\n<p>I can't overstate the importance of this in the world of frustrated e-patients!</p>",
        "id": 187355565,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1580820950
    },
    {
        "content": "<p>So I want two separate things, and maybe by summer both will be rolling.</p>\n<p>First, yes, separate from this thread, I want to do a screen-capture recording (perhaps just 2-3 minutes each), of LOTS of you fetching my data (yay for common API), and perhaps showing off how useful and/or pretty each of your apps can make my data. These will be cataloged on my YouTube channel (or someone's - I get no $ from this of course).</p>\n<p>Also, since I presume the result will be interest from some number of patient innovators and other developers, there will be questions about \"Can I do that too?\" and \"How?\" and \"Where do I start?\"  This is why I want that list I've mentioned repeatedly of all the FHIR endpoints one can currently connect, so easily. :-)</p>",
        "id": 187356340,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1580821594
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  We are working on listing publicly a dozen or so FHIR patient apps that are connected via our APIs. It may make sense for us to also show other apps that are not using us on the same page to be more inclusive.</p>",
        "id": 187363611,
        "sender_full_name": "Ricky Sahu",
        "timestamp": 1580827286
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> we are connected to about 7000 endpoints, but they are not all published publicly, additionally, they are not available for public consumption, i think that's what <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  is talking about when hes saying there shouldnt be any need to negotiate or speak with the ehrs. however that's not the case. we're still struggling to get access to multiple health systems because they are suggesting \"5 months of security reviews\" before they whitelist our app for their system.</p>",
        "id": 187363788,
        "sender_full_name": "Ricky Sahu",
        "timestamp": 1580827390
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222528\">@Doug Williams</span>  is leading the patient app listing from our side. we'd love to run it by this group and get feedback to see how it can be made more useful for individuals</p>",
        "id": 187363973,
        "sender_full_name": "Ricky Sahu",
        "timestamp": 1580827531
    },
    {
        "content": "<p>Thanks for the detail, <span class=\"user-mention\" data-user-id=\"197054\">@Ricky Sahu</span>.  I wouldn't say I'm ONLY interested in things that anyone in the public can do, but I certainly AM interested, and it will be of interest to potential patient innovators simply to know of available options.</p>\n<p>It really is an unprecedented world for them.</p>",
        "id": 187367949,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1580830119
    },
    {
        "content": "<p>For newly created apps, note that there can be as much as a 12 hour delay between when you register the new app on <a href=\"http://open.epic.com\" target=\"_blank\" title=\"http://open.epic.com\">open.epic.com</a>, and when that app can actually be used at our health systems.  This delay is purely technical.  We have a job running every 12 hours to download client updates.</p>",
        "id": 187373905,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1580833848
    },
    {
        "content": "<p>Just wanted to mention that in case folks run into the delay while trying to do a screen recording that involved registering a new app and using it.</p>",
        "id": 187373946,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1580833885
    },
    {
        "content": "<p>Spectacular observation!</p>",
        "id": 187394674,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1580846448
    },
    {
        "content": "<blockquote>\n<p>there can be as much as a 12 hour delay between when you register the new app on <a href=\"http://open.epic.com\" target=\"_blank\" title=\"http://open.epic.com\">open.epic.com</a>, and when that app can actually be used at our health systems. ...purely technical ... We have a job running every 12 hours to download client updates.</p>\n</blockquote>\n<p>I'll note that while you call this \"purely technical,\" it'll be worth noting that \"it'll become available at any given hospital the next time they update their list, whenever that is.:-)\" </p>\n<p>Seriously, that's important to know. Thanks.  (Lots of stuff these days is expected to update instantly, but people are generally okay with systems that update \"overnight,\" more or less.)</p>",
        "id": 187410979,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1580858580
    }
]