[
    {
        "content": "<p>Floating a principle here ...</p>\n<p>In our informal talks this week we considered how we can provide value to others doing their work.  It may be useful to compile some \"principles of patient empowerment\" or \"Patient POV Principles\" on Confluence.  </p>\n<p>In any case, here's one: Always ask the end user.  (It's not limited to patients of course.)  The rationale is that any developer may not be aware of how things show up in the end user's world.</p>\n<p>My own example this morning is that when I went to refill a prescription, the name of my actual pharmacy did not show up, because it's called something else in the database!  The lesson is that merely piping various \"datums\" onto a screen may not get the job done, in the end user's POV. </p>\n<p>Here's <a href=\"#narrow/stream/179160-social/topic/For.20Pharmacy.20(and.20all)\" title=\"#narrow/stream/179160-social/topic/For.20Pharmacy.20(and.20all)\">the message I just posted in Social</a> until it finds a better home.</p>\n<p>Should we have a Principles document?  (I tried to get on Confluence last night during my travels, on phone apps, and was not able to connect, so I haven't deposited a single bit of anything yet.)</p>",
        "id": 176212695,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1569000042
    },
    {
        "content": "<blockquote>\n<p>the name of my actual pharmacy did not show up, because it's called something else in the database</p>\n</blockquote>\n<p>This is a chronic problem all over the place</p>",
        "id": 176213784,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1569000657
    },
    {
        "content": "<p>I'm hardly surprised; I imagine the root-root cause is that databases were designed and populated with one use in mind, which creates surprises when the data are read in a different context. </p>\n<p>So I assert that my point stands, though the use cases are not limited to patients and pharmacy.  Si?</p>\n<p>How does (or should) FHIR in general handle this kind of thing?  Do various objects need, for instance, a WhatPatientsCallThis property, to be populated as discovered?</p>",
        "id": 176214987,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1569001444
    },
    {
        "content": "<p>well, it's not so much 'what patient's call this' as difference between branding and legal names etc. For some entities, we have different kinds of names, for the different purposes, but only where we think there's value because of naming practices.</p>",
        "id": 176215195,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1569001575
    },
    {
        "content": "<p><a href=\"http://Organization.name\" target=\"_blank\" title=\"http://Organization.name\">Organization.name</a> is not on of those, though</p>",
        "id": 176215243,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1569001617
    },
    {
        "content": "<p>Thanks. So is there a canonical way in FHIR / HL7 for resolving such things, or do we simply notice them and add fields or properties as needed?</p>",
        "id": 176215260,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1569001625
    },
    {
        "content": "<p>well, it's a standard question whereever we see a name - should we have space for more than one name? what kind of names are there? would systems know which name to use? is the cost worth it. I don't know what the specific analysis for org name was</p>",
        "id": 176215381,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1569001725
    },
    {
        "content": "<p>Just added this Friday Funny (true!!) to the Social thread:</p>\n<blockquote>\n<p>HA HA HA HA HA HA<br>\nHA HA HA HA HA HA , oh, Friday ROFL!</p>\n<p>The refill clerk just called and asked: \"Is RightSource also called Humana??\"</p>\n<p>SHE doesn't know what RightSource is, either.</p>\n</blockquote>",
        "id": 176217239,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1569003030
    },
    {
        "content": "<p>yeah well, IT systems can't make up for human stupidity</p>",
        "id": 176218161,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1569003771
    },
    {
        "content": "<p>True, but there is the slogan: \"Garbage in, miracle out\" which has been used by our interoperability team in the past.</p>",
        "id": 176219434,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1569004663
    },
    {
        "content": "<p>Dare we make that a FHIR tagline?  An aspirational goal of all solvers of messy problems??  Love it.</p>",
        "id": 176220849,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1569005758
    },
    {
        "content": "<p>Feel free to start a confluence page as a holding area to capture principles/recommendations like this.  When we have enough of them, we can worry about how/where to organize/publish/distribute</p>",
        "id": 176225103,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569009093
    },
    {
        "content": "<p>Added the Dear Janie stuff to the confluence reference page: Janie Appleseed Resources</p>\n<p><a href=\"https://janieappleseed.org/index.php/stories/\" target=\"_blank\" title=\"https://janieappleseed.org/index.php/stories/\">https://janieappleseed.org/index.php/stories/</a></p>\n<p><a href=\"https://janieappleseed.org/index.php/patient-driven-use-cases/\" target=\"_blank\" title=\"https://janieappleseed.org/index.php/patient-driven-use-cases/\">https://janieappleseed.org/index.php/patient-driven-use-cases/</a></p>\n<p>Gonna add the DAM data song next...</p>",
        "id": 176284673,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1569107651
    }
]