[
    {
        "content": "<p>There is probably a better place for this but I'll start it here, for reference in  the <a href=\"#narrow/stream/179262-patient-empowerment/topic/The.20patient.20at.20DevDays\" title=\"#narrow/stream/179262-patient-empowerment/topic/The.20patient.20at.20DevDays\">patients at DevDays</a> thread.  </p>\n<p>Note: not all \"Superpatient\" innovators would be users of FHIR data - the aspect I discuss here is the social change, enabled by all forms of tech. Social resistance and skepticism will be a factor in the success of our advocacy so it's useful to have plenty of evidence that skeptics are wrong.:-)</p>\n<p><strong>von Hippel <a href=\"https://sloanreview.mit.edu/article/when-patients-become-innovators/\" target=\"_blank\" title=\"https://sloanreview.mit.edu/article/when-patients-become-innovators/\">\"When Patients Become Innovators\"</a></strong><br>\nThis is von Hippel's Sloan Management Review article, featuring Dana Lewis and Crohn's patient/innovator Sean Ahrens.  Importantly for some business readers, it includes a graphic from his book <em>Free Innovation</em> that explains the significant difference in motivation and process when patients are driving the process. (Actually, von Hippel asserts that patients are a special case of the general category of consumer home innovations.)</p>\n<p><strong><a href=\"https://www.bmj.com/content/364/bmj.l1474.full\" target=\"_blank\" title=\"https://www.bmj.com/content/364/bmj.l1474.full\">BMJ \"When Patients Innovate\" (March 2019)</a></strong><br>\nDescribes Tal Golesworthy, inventor of a surgery that radically improves life for Marfan Syndrome patients. Numerous other names, some familiar to me, some new. Look at the range of conditions!</p>\n<ul>\n<li>insomnia - online CBT</li>\n<li>juvenile RA - violinist invents hand exercise device</li>\n<li>thermal bra for mastectomy / reconstruction patients</li>\n<li>medication adherence (evidently more than just a reminder app)</li>\n</ul>\n<p><strong>Patient-Innovation.com</strong><br>\nThe BMJ piece includes this:</p>\n<blockquote>\n<p>The Patient Innovation website (<a href=\"https://patient-innovation.com\" target=\"_blank\" title=\"https://patient-innovation.com\">https://patient-innovation.com</a>) is a non-profit platform for patients and carers to share solutions to cope with their diseases, jointly led by Pedro Oliveira, a professor at Copenhagen Business School, and Helena Canhão, a professor at NOVA Medical School in Lisbon.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span>, it sounds like Oliveira and Canhão might be speaker candidates as well?</p>\n<p>The BMJ article also cites the <a href=\"https://nhsaccelerator.com/\" target=\"_blank\" title=\"https://nhsaccelerator.com/\">NHS Innovation Accelerator</a> as having supported some patient innovations.</p>",
        "id": 169223825,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561728104
    },
    {
        "content": "<p>The BMJ article ends with this boxed advice, worth noting, though again it's cultural, not specific to FHIR:</p>\n<blockquote>\n<p><strong>Advice for doctors from patient innovators</strong></p>\n<ul>\n<li>Don’t assume your profession has a monopoly on medical knowledge and solutions for diseases. Open your mind</li>\n<li>Consider the downsides to the existing therapy that is being questioned and revised by the patient innovator, and exercise a little vision and imagination</li>\n<li>Work towards a logical plan that assesses the technical and medical problems in sequence: don’t try to approach and solve all the questions at once</li>\n<li>If there is a real unmet need for this innovation then become its champion inside your trust. Without that, it is hard to scale</li>\n<li>The natural instinct is to say no because it requires extra time and effort to start a project. Saying yes and then being engaged is key. Doctors have to be willing to partner patients</li>\n</ul>\n</blockquote>\n<p>Important distinction: this advice seems oriented toward a goal of product commercialization, in distinct contrast with von Hippel discussing free innovation developed just for its own end-user value and often given away.</p>",
        "id": 169224221,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561728389
    }
]