[
    {
        "content": "<p>I'm trying to pre-populate my calendar with as much as possible that's relevant to my interest in the patient side of things.  My challenge looking at the <a href=\"https://confluence.hl7.org/display/WGB/WGM+Information+-+September+14-20%2C+2019%2C+Atlanta#WGMInformation-September14-20,2019,Atlanta-Connect-a-Thon\" target=\"_blank\" title=\"https://confluence.hl7.org/display/WGB/WGM+Information+-+September+14-20%2C+2019%2C+Atlanta#WGMInformation-September14-20,2019,Atlanta-Connect-a-Thon\">conference agenda</a> is that not everything with \"patient\" in the title is relevant either to the consumer him/herself nor to our \"patient innovators\" concept.  Help!  </p>\n<p>It's especially important to me since this isn't my day job so I'll need to continue to work, have remote meetings, etc, but important not to miss things relevant to why I'm even THERE. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 175349364,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568129892
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> i'll</p>",
        "id": 175360222,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568137066
    },
    {
        "content": "<p>be pulling together a combined agenda of all FHIR-related topics happening in all of the work groups during the week.  I recognize that you may occasionally be interested in things non-FHIR, but hopefully this will be a good start.  Hope to get it out either Fri. or Sat.</p>",
        "id": 175360354,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568137137
    },
    {
        "content": "<blockquote>\n<p>I'm trying to pre-populate my calendar with as much as possible that's relevant to my interest in the patient side of things.  My challenge looking at the <a href=\"https://confluence.hl7.org/display/WGB/WGM+Information+-+September+14-20%2C+2019%2C+Atlanta#WGMInformation-September14-20,2019,Atlanta-Connect-a-Thon\" target=\"_blank\" title=\"https://confluence.hl7.org/display/WGB/WGM+Information+-+September+14-20%2C+2019%2C+Atlanta#WGMInformation-September14-20,2019,Atlanta-Connect-a-Thon\">conference agenda</a> is that not everything with \"patient\" in the title is relevant either to the consumer him/herself nor to our \"patient innovators\" concept.  Help!  </p>\n<p>It's especially important to me since this isn't my day job so I'll need to continue to work, have remote meetings, etc, but important not to miss things relevant to why I'm even THERE. :)</p>\n</blockquote>\n<p>Dave - what days will you be there - I will help you navigate</p>",
        "id": 175404712,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1568183202
    },
    {
        "content": "<blockquote>\n<p>be pulling together a combined agenda of all FHIR-related topics happening in all of the work groups during the week.  I recognize that you may occasionally be interested in things non-FHIR, but hopefully this will be a good start.  Hope to get it out either Fri. or Sat.</p>\n</blockquote>\n<p>But Lloyd most is FHIR - he will need a subset of that, right?</p>",
        "id": 175404786,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1568183289
    },
    {
        "content": "<p>It's only physically possible to <em>do</em> a subset of that :)  As I go, I'll try to flag things I expect will be of particular interest</p>",
        "id": 175428135,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568206676
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> I arrive Saturday afternoon and leave Thursday. Thanks for the offer!</p>",
        "id": 175428642,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568207023
    },
    {
        "content": "<p>i will be in tsc meeting on saturday but we will meet up.  free saturday<br>\nevening.</p>",
        "id": 175683004,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1568434687
    },
    {
        "content": "<p>I'm also free on Sat. evening and by that time I'll have the FHIR cross-WG agenda put together.  A group of us can sit down and help build your dance card.</p>\n<p>Side note - as I'm combining the agendas and wearing my \"what would Dave find interesting?\" hat, it's obvious to me that our specifications aren't the <em>only</em> thing that needs to be friendlier to patients.  Most of the WG agendas are extremely opaque.  They're full of acronyms that even someone like me - who's been living &amp; breathing HL7 for years - don't recognize.</p>\n<p><span class=\"user-mention\" data-user-id=\"191808\">@Wayne Kubick</span>, what do you think of shifting the WG quality criteria from \"Must post a WGM agenda by X date\" to \"Must post an externally understandable agenda by X date\"?  When Anne goes through and checks that the agenda is present, she should do a quick skim to see if she either understands it or that at least all of the acronyms are hyperlinked so that someone who's new to the process or WG can dig deeper to better understand what's going on.</p>",
        "id": 175695031,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568458212
    },
    {
        "content": "<p>I think that would be a fabulous requirement :-)</p>",
        "id": 175695246,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568458585
    },
    {
        "content": "<p>Sure.  We're discussing work group health at TSC today, so I'll bring it up.</p>",
        "id": 175696323,
        "sender_full_name": "Wayne Kubick",
        "timestamp": 1568460409
    },
    {
        "content": "<blockquote>\n<p>I think that [\"human readable agenda entries\"] would be a fabulous requirement :-)</p>\n</blockquote>\n<p>I'll be devil's advocate here: I know <em>I</em> want human readable, but I'm a newbie whose interests only overlap a little bit with the people who are getting work done.  How do we provide what I need (ability to detect what might interest me) without bogging down everyone else?</p>\n<p>(I've long wanted a browser plugin that would let me hover over certain phrases and get a definition but as far as I know it doesn't exist yet)</p>",
        "id": 175705103,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568473035
    },
    {
        "content": "<p>I've long wanted a browser extension that just tells me which parts of a page I am going to be interested in ;-)</p>",
        "id": 175705141,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568473083
    },
    {
        "content": "<blockquote>\n<p>I'm also free on Sat. evening and by that time I'll have the FHIR cross-WG agenda put together.  A group of us can sit down and help build your dance card.</p>\n</blockquote>\n<p>Should we open a Google Doc or Confluence page or something to collect names &amp; thoughts for our proposed Saturday evening GOTI?  <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> everyone note.  </p>\n<p>I'm boarding in a few - no idea whether we'll have viable in-flight wifi. Landing at 2:22</p>",
        "id": 175705249,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568473274
    },
    {
        "content": "<p>Human-readable is necessary for the techies and insiders too.  One of the problems with the success of FHIR is that the community is too broad and the projects are moving too fast for any one person to keep tabs on things.  If we don't mandate \"human-readable\" then it'll be far too easy for silos to form and conflicting/contradictory work to happen which won't benefit what we're trying to do.  Plus, one of the main strengths of FHIR has been our ability to welcome newcomers and make them productive \"fast\".  If we lose that, we lose a significant part of what makes FHIR \"F H I R\".  Human-readable (and discoverable) agendas is part of that.</p>",
        "id": 175706880,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568475884
    },
    {
        "content": "<p>There’s a few different ways to make HL7 specs more human readable and accessible.  Acronym dictionary.  Acronym ban.  Product branding.  </p>\n<p>Not to pick on Josh, but take SMART on FHIR... outside of HL7, it’s opaque and not very helpful.  We could a) require people to spell it out... Substitutable Medical Apps, Reusable Technology on Fast Healthcare Interoperability Resources, b) provide a PDF of acronyms that explains what SMART and and FHIR are, or we could rebrand and just call it ‘HealthRecords’.  </p>\n<p>An outright ban would be safe and workable, but inefficient and burdensome.  A rebranding strategy could be great, but needs thoughtful consideration of how it effects culture.  An acronym dictionary (PDF format?) could be a useful artifact, and maybe encourage fewer acronyms and help guide towards rebranded and concise terms.</p>\n<p>Also, an anecdotal point of data:  we had a hell of a time trying to explain the value proposition of SMART on FHIR apps, but when we started talking about MACRA (Medicare Reimbursement) we got a lot more interest, but talking about “21st Century Cures Apps” has been even better.  Branding matters.</p>",
        "id": 175707638,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1568477227
    },
    {
        "content": "<blockquote>\n<p>we had a hell of a time trying to explain the value proposition of SMART on FHIR apps, but when we started talking about MACRA (Medicare Reimbursement) we got a lot more interest, but talking about “21st Century Cures Apps” has been even better.  Branding matters.</p>\n</blockquote>\n<p>Caveat (in agreement): depends a lot on your audience!  \"Cures Act\" has ZERO meaning to most e-patients, I can tell you from first-hand experience.</p>\n<p>I'm not disagreeing with any of this but very much pointing to the need to bear audience in mind, and quite likely have a whole different \"greeting zone\" for ordinary health consumers who until now have had no useful access to health data and thus no use for any acronyms, with rare exceptions.</p>\n<p>(Have we thread-drifted enough for a new thread?  At what point does an HL7 community move something like this to Confluence?  In any case this needs to be on the \"Patient WTF's\" topic list going forward: \"How we present ourselves to the hoped-for flood of newcomers\"</p>",
        "id": 175709446,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568480335
    },
    {
        "content": "<p>My preferred approach is for the first use of an acronym to by a hyperlink - at least in \"entry-point\" material (whether it's the initial description of an IG or an agenda)</p>",
        "id": 175712984,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568486374
    },
    {
        "content": "<p>Where do the links go to? We are planning to offer an acronyms and terms explained page for first timers at DevDays.</p>",
        "id": 175713278,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1568486792
    },
    {
        "content": "<p>Preferably to a page that starts with nube-friendly intro to whatever it is.</p>",
        "id": 175713572,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568487346
    },
    {
        "content": "<p>There is not such thing currently that you know of, is there?</p>",
        "id": 175713698,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1568487483
    },
    {
        "content": "<p>I'll add for the future that FHIR's consumer participants are a different species than normal HL7 nubes!</p>",
        "id": 175714187,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568488246
    },
    {
        "content": "<p>(Should we refer to early orientation as going through puberty?)</p>",
        "id": 175714189,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568488250
    },
    {
        "content": "<p>NUBERTY. Not puberty. </p>\n<p>Stupid Zulip app has no Edit button.</p>",
        "id": 175714211,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568488307
    }
]