[
    {
        "content": "<p>Yes, important!  (I'm renaming <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span>'s thread to be legit clickbait)   It's from Aug 26 but didn't get attention here, and <strong>deadline for comment is Friday</strong></p>\n<p><a href=\"https://cdt.org/press/cdt-and-ehi-release-draft-consumer-privacy-framework-for-health-data/\">\"Collaborative Group Proposes Self-Regulatory Model &amp; Standards Focused on Non-HIPAA Health Data\"</a></p>\n<blockquote>\n<p>... eHI and CDT released <a href=\"https://cdt.org/insights/cdt-ehi-release-draft-consumer-privacy-framework-for-health-data/\">A Draft Consumer Privacy Framework for Health Data</a> ... a description of health data that warrant protection, as well as the standards and rules that should govern them.  ... also includes a self-regulatory model...</p>\n</blockquote>\n<p>Specifically, from that link:  (emphasis added)</p>\n<blockquote>\n<p>... with the rise of wearable devices, health and wellness apps, online services, and the Internet of Things (IoT), extraordinary amounts of information reflecting mental and physical wellbeing are created and held by entities who are <strong>not bound by HIPAA obligations.</strong> This issue has only gained importance in the last several months, as <strong>new regulations will also be moving HIPAA-covered medical records</strong> into this commercially-facing and unregulated space. </p>\n</blockquote>\n<p>?!  I did not know that new regs will be moving <em>covered</em> data into this <em>unregulated</em> space. What's up with that?</p>\n<p>From the main document again:</p>\n<blockquote>\n<p>The public is invited to review the draft framework and offer constructive feedback by Friday, September 25, 2020. ...  Alice Leiter at eHI (<a href=\"mailto:alice@ehi.org\">alice@ehi.org</a>) or Andy Crawford at CDT (<a href=\"mailto:acrawford@cdt.org\">acrawford@cdt.org</a>), or visit <a href=\"https://www.ehidc.org/resources/draft-consumer-privacy-framework-health-data\">https://www.ehidc.org/resources/draft-consumer-privacy-framework-health-data</a>.</p>\n</blockquote>",
        "id": 210813279,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600731176
    },
    {
        "content": "<p>I just learned in the PAC that they will extend for them.  So feedback would be good.</p>",
        "id": 210816779,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600734364
    },
    {
        "content": "<p>You mean they'll allow feedback beyond this Friday 9/25?</p>",
        "id": 210820691,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600738793
    },
    {
        "content": "<blockquote>\n<p>I did not know that new regs will be moving <em>covered</em> data into this <em>unregulated</em> space. What's up with that?</p>\n</blockquote>\n<p>This is misleading.</p>\n<ol>\n<li>\n<p>New regulations give patients the right to share their data -- the regulations by themselves don't move data; patients do.</p>\n</li>\n<li>\n<p>Some parties (e.g., hospitals) receiving patient-shared data have obligations under HIPAA as they always have; other parties receiving data have obligations under FTC jurisdiction. In both cases there is <em>some</em> regulatory scheme that applies.</p>\n</li>\n</ol>",
        "id": 210823101,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600742187
    },
    {
        "content": "<p>(I shared this feedback during a previous round of edits, but it looks like the published recommendations did not incorporate.)</p>",
        "id": 210823119,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600742277
    },
    {
        "content": "<p>The bottom line for me, and the point on which these recommendation all fall flat, is the idea that we can somehow carve out certain data as \"health data\". The truth is that any PII-level consumer data may be relevant to health.</p>\n<p>Furthermore, creating new obligations for non-HIPAA-covered-entites would tilt the playing field significantly, basically giving hospitals, health systems, and insurers much more room to maneuver (e.g., because they still get to share data under HIPAA TPO, or bundle up \"deidentified\" data to sell -- and their competitors wouldn't be allowed to).</p>",
        "id": 210823306,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600742617
    },
    {
        "content": "<p>Yes, beyond Friday</p>",
        "id": 210836173,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600760157
    }
]