[
    {
        "content": "<p>Allow me a minor anecdotal \"mea culpa\" which reminded me of how important it is to make things practical:</p>",
        "id": 197412273,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589376533
    },
    {
        "content": "<p>I'm currently working with immunization and product traceability - frankly all of that is trivial technically - every vaccine has a barcode, so we can know the product number, lot, expiry, etc.<br>\nAdditionally, I'm personally trying to maintain a record of our immunizations using FHIR. <br>\nI have everything I need.</p>",
        "id": 197412303,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589376545
    },
    {
        "content": "<p>So, last week we had some vaccinations in the family, and, of course, during an actual episode of care, I did not even think of asking \"hold on, let me take a photo of the barcode\". I didn't even check what information is taken by the nurse to the national repository.</p>",
        "id": 197412550,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589376637
    },
    {
        "content": "<p>I know I had some immunizations a few years ago and was very excited (in a nerdish sort of way) to see what the data entry workflow was but the nurse just walked out without documenting anything (presumably that was done later). I was very disappointed.</p>",
        "id": 197412818,
        "sender_full_name": "Craig Newman",
        "timestamp": 1589376766
    },
    {
        "content": "<p>It shows how easy it is to keep it cool in the office or make things thorough in a design, but reality brings so much more, and my focus on complete faced a much bigger beast - it's the reality and the tension and all of that that counts</p>",
        "id": 197412826,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589376770
    },
    {
        "content": "<p>I do this all the time - as engaged as I try to be, I completely space out when the moment comes.  </p>\n<p><strong>THIS IS WHY CHECKLISTS ARE SO USEFUL.</strong>  There's no reason not to have one even for this simple encounter.</p>\n<p>Here's the latest example of a related thing, brand new: a pre-visit questionnaire that then guides the appointment.  It was drafted for the latest extension of OpenNotes, called OurNotes, but they decided to open-source it for use in making telemedicine visits more efficient. I blogged about it yesterday. <a href=\"https://participatorymedicine.org/epatients/2020/05/nejm-opennotes-ournotes-releases-its-innovative-pre-visit-questionnaire-for-covid-19-televisits.html\">NEJM: OpenNotes/”OurNotes” releases its innovative pre-visit questionnaire for COVID-19 televisits</a></p>\n<p>I hope everyone's familiar with Atul Gawande's wonderful book <a href=\"https://www.amazon.com/The-Checklist-Manifesto-audiobook/dp/B0031Q9ZWY/\">The Checklist Manifesto</a>, which among other things documents the rationale for doing what aviation learned long ago. Aviation had the added incentive that mistakes often had very immediate consequences.</p>",
        "id": 197414133,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1589377418
    },
    {
        "content": "<p>I am a bad self advocate... I so fully trust my doctors and nurses. 99% success and openness in my region. But I did have a total loss of immunization details when I got laid off from GE, where I had received many immunizations for the travel they sent me on to India.  Wish I had thought of the simple act of taking a picture of the barcode... Of course I was far more worried about fainting, I am a bad patient that way too -- whitecoat syndrom.</p>",
        "id": 197422474,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589380988
    },
    {
        "content": "<p>I have the yellow International Certificate of Vaccination. Originally got it for yellow fewer, but it has space for all vaccinations. Around 80 % of my vaccinations since are in there - I also have a hard time remembering to take it with me when I get vaccinated.</p>\n<p>A cool thing, though, is that most of the vaccinations in there are actually stickers peeled off the vaccine packaging. No need to take a pic, no need to enter text manually. :) The nurse administering the shot just peels off the sticker and sets it to my yellow cert paper. And stamps it.</p>",
        "id": 197429175,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1589383666
    },
    {
        "content": "<p>You will find that I tend to be a pest about patients knowing their identity of their implanted devices.  I myself have a clavicle implant with 12 screws.  I know the material, size, and model/version of the plate and screws because I specifically asked for my Unique Device Identifiers to be recorded in my health record during my pre-surgical checklist.  Of course, they didn't record the UDI so while I was recovering I went to the basement and copied my operative notes (this was in 2013) and then wrote the manufacturer for the exact implant specifications.    I say all of this because I have been trying for YEARS to get UDI on a patient checklist.  For example - if you are having a  hip implant, ask what will be the UDIs of the implanted devices.  My campaign is \"KNOW YOUR UDI\".  I'd love to read the Checklist Manifesto.  Thanks Dave.</p>",
        "id": 197429668,
        "sender_full_name": "Terrie Reed",
        "timestamp": 1589383883
    },
    {
        "content": "<p>I have the immunization card. index card sized thing with hand written immunization. My doctor said he couldn't use it.  (which given that I am a Provenance advocate, I can totally understand the Dr position).</p>",
        "id": 197431685,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589384596
    },
    {
        "content": "<p>Sooooo, geniuses (I say that with love and admiration), shouldn't there be apps and tools and things to help with this??  Are there?  I imagine some of you may have already created some.  Let's hear about (or create) solutions that are worth their effort, maybe?</p>",
        "id": 197451172,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1589392412
    },
    {
        "content": "<p>well, that is why we participate in HL7... because the world is still broken, and we are here to fix it</p>",
        "id": 197451411,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589392516
    },
    {
        "content": "<p>device ID are relatively new. There are many HL7 based discussions about how to embed these details in CDA and FHIR where appropriate. There are registries of these too</p>",
        "id": 197451606,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589392584
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> just ported this \"OurNotes\" pre-visit questionnaire topic into the <a href=\"#narrow/stream/179255-questionnaire/topic/Use-case/near/197443414\">connectathon Questionnaire stream.</a>  </p>\n<p>I am largely unable to participate so I hope someone can pursue it!  I'll see if any of the OpenNotes people are interested.</p>",
        "id": 197452012,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1589392715
    }
]