[
    {
        "content": "<p>I think that these use-cases are all necessary and we do need to do them. But they are not the kind of thing that will inspire action by Patients or Providers that are not as excited as Dave. I think the killer resource for patient empowerment is CarePlan. This is an active resource, not one where the data is just thrown from one location to another. The careplan connectathon track is exciting. It has privacy and security integrated, with consent and even break-glass. But most important it has the consumer engaged, as they use an app that tracks what they should be doing. It also has a way to engage the provider in that it enables apps to keep track of progress and only callupon the human practitioner when things are not going well.</p>",
        "id": 154020724,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543167461
    },
    {
        "content": "<p>see <a href=\"http://wiki.hl7.org/index.php?title=201901_Care_Planning\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201901_Care_Planning\">http://wiki.hl7.org/index.php?title=201901_Care_Planning</a></p>",
        "id": 154020725,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543167561
    },
    {
        "content": "<p>I will be speaking about this use of FHIR at AMSUS this coming week</p>",
        "id": 154020726,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543167589
    },
    {
        "content": "<blockquote>\n<p>I think that these use-cases are all necessary and we do need to do them. But they are not the kind of thing that will inspire action by Patients or Providers that are not as excited as Dave. </p>\n</blockquote>\n<p>Hi <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> !   </p>\n<p>I'm going to call a scope violation :-), at least relative to MY request in Amsterdam.  </p>\n<p>I called for us to  <strong>enable </strong> a patient-side app ecosystem.  This is infinitely less ambitious than \"inspiring action\" - especially by people who aren't particularly excited. <span class=\"emoji emoji-1f642\" title=\"slight smile\">:slight_smile:</span> </p>\n<p>The reality for the vast majority of patients today is that we CAN'T get at our data (without FHIR).  That's the scope of my own request.</p>\n<p>(Having said that, I'll be THRILLED when free-flowing data means that our primary remaining obstacle is getting people to WANT to.)</p>\n<p>p.s. Besides, none of us (IMO) can tell people what they SHOULD do ... that's paternalistic and kinda removes the individual's autonomy.  I do want the public to know what's <em>available</em> from being engaged in their data. But we can't any more tell them to want it than my brother the car technician could tell me to think like him ...</p>",
        "id": 154020740,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1543197615
    },
    {
        "content": "<p>I think that <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> is right though - CarePlan is the killer app here. Getting data is good. But care plans are way better</p>",
        "id": 154020755,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543204569
    },
    {
        "content": "<p>I'm not disagreeing - just noting that it's a whole different issue than I was talking about. </p>\n<p>If we're also going for that, \"we're gonna need a bigger boat,\" as the capstone said in Jaws! <span class=\"emoji emoji-1f603\" title=\"smiley\">:smiley:</span>. I'm all for it.</p>",
        "id": 154020808,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1543230998
    },
    {
        "content": "<p>I think we are all in agreement, even on the stepping-stones. I was putting CarePlan out there as a goal, not as a short-term-step. The short-term steps need to be basic accessibility. I am just not all that convinced that making the data available will cause fantastic apps to appear. I think we need a goal that is a bit further out to inspire apps, patients, and providers.</p>",
        "id": 154020847,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543240275
    },
    {
        "content": "<p>Assuming that FHIR is explicitly interested in adoption, then cultural issues are totally in scope, and patient awareness / awakening is a worthy topic for discussion. Among other things, the differences in awareness between segments (due to use cases) may inform priorities. </p>\n<p>For instance, a tangible need which will surely grow more rapidly than most is the family caring for an elder. Outreach to the unaware in that community would likely find more receptive ears than what we might call \"ordinary no particular problem\" people. </p>\n<p>Aside from our DTC (direct to consumer) outreach, these thoughts may be useful cues to potential app developers.</p>",
        "id": 154021108,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1543340310
    },
    {
        "content": "<p>yes</p>",
        "id": 154021119,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543341488
    },
    {
        "content": "<p>FWIW, we had the CarePlan resource working with the Caremap app (<a href=\"http://caremap.io\" target=\"_blank\" title=\"http://caremap.io\">http://caremap.io</a>, Boston Children's and Duke Health) but it's not currently pulling from an API (and I don't think it has been updated since 2016). May be worth reaching out to Michael Docktor if somebody is interested.</p>",
        "id": 154021142,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1543347362
    },
    {
        "content": "<p>Thanks for this, and I hope someone will, but I’m hardly the one to do it… Who should?</p>",
        "id": 154022527,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1543852539
    },
    {
        "content": "<p>I think that CarePlan is a good horizon to keep in mind, while we work on getting US Core more well implemented. That is to say that today it is important for people to understand that US-Core is not the end-goal, that something more useful and compelling is over that horizon.  Keeping this as a horizon goal will give cover to those that are working on implementing CarePlan. There is much work to be done to get it implemented, involving many different apps for the various persona, templates made from care guidelines, services implemented to instantiate a template into a CarePlan, smart agents to watch a cohort of patients for compliance, etc... All of this work is going to take time, and need further development in the standard and profiles of the standard. This work needs the benefit of people recognizing that on the horizon, out there 5 years, is a worthwhile goal.</p>",
        "id": 154022539,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543854355
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <span class=\"user-mention\" data-user-id=\"191339\">@Pascal Pfiffner</span>  I need one hella explanation of \"the CarePlan resource\".  (Like, so far I don't even really understand rigorously the definition of \"resource,\" though I imagine it's not far off of other contexts)</p>\n<p>Also on the marketing side it's widely considered bad form in healthcare to use \"killer\" as a positive adjective <span class=\"emoji emoji-1f642\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 154023347,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1544055274
    },
    {
        "content": "<p>lol killer app is not always a good thing. </p>\n<p>So there's a set of resources that allow you to describe the record of your care:<br>\n- diagnostic results, vital signs<br>\n- problem list, medication list, medication record<br>\n- documents, bills, whatever.</p>",
        "id": 154023362,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544061028
    },
    {
        "content": "<p>but there's also a set of resource that allow us to describe your care plan - what your overall treatment is, and why, what your goals are. So you could get different parts of the healthcare system to tell each other about that.</p>",
        "id": 154023363,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544061092
    },
    {
        "content": "<p>but even better, you could have your own care plan, and then if any provider wants to change it, the can propose a change on your care plan, which your other providers can comment and and debate etc.</p>",
        "id": 154023364,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544061126
    },
    {
        "content": "<p>this is a BIG deal for mental health patients, in particular</p>",
        "id": 154023365,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544061140
    },
    {
        "content": "<p>Where can I learn about what constitutes a \"care plan\"? Is it free text or does it have parameters?</p>\n<p>User-defined / patient-defined goals of care are increasingly important on the leading edge of patient thought, and the goals often don't align with anything typically measured by clinicians. For instance, a fellow kidney cancer patient was struck with a relapse, and this time around by far the most important factor in choosing among treatment options was his fatigue level - because at the same time his wife was struck with breast cancer, and he would be her primary caregiver. </p>\n<p>The prospect of getting an ICD-like organisation to encode these (after much argument) is crazy-making. But if we here can tolerate a case where ANYTHING is acceptable as \"THIS ONE PERSON's goal of care,\" we will win easily. But I have no clue whether that's even imaginable. So, see opening question above.</p>",
        "id": 154023379,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1544062849
    },
    {
        "content": "<p>In this domain (patient-defined factors) I also urge people to see the case of Kristina and Kate Sheridan, which I spoke about in Amsterdam (and they spoke at HIMSS 2018). The two of them realised that Kate had 26 symptoms that came and went at various times. No system could handle it; mother Kristina tracked them in spreadsheets,. which (if I understand correctly) played a role in eventually beating the disease. </p>\n<p>I hasten to add that no commercial entity would try to create a product for such an exotic case, and the cost (and feasibility) of clinical trials would be prohibitive.</p>",
        "id": 154023380,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1544063024
    },
    {
        "content": "<p>care plan - yes, that's the sort of things it does. And why. Can be free text but the more coded it is, the better it drives outcomes</p>",
        "id": 154023383,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544063289
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  You can see a short explaination on the CarePlan -- FHIR Connectathon -- page. Look at the last two sections starting with \"Clinical Scenarios\"  <a href=\"http://wiki.hl7.org/index.php?title=201809_Care_Plan\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201809_Care_Plan\">http://wiki.hl7.org/index.php?title=201809_Care_Plan</a></p>",
        "id": 154023512,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544111673
    },
    {
        "content": "<p>I think they have a reportout that they have available on youtube. I will ask around, it is not easy to find</p>",
        "id": 154023513,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544111782
    },
    {
        "content": "<p>I have a slide deck that I gave last week at AMSUS. It is high level intended for clinicians and administration. The slides are available, but might not be easy to read. <a href=\"https://healthcaresecprivacy.blogspot.com/2018/11/amsus-talk-on-fhir-careplan-as-goal-app.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2018/11/amsus-talk-on-fhir-careplan-as-goal-app.html\">https://healthcaresecprivacy.blogspot.com/2018/11/amsus-talk-on-fhir-careplan-as-goal-app.html</a>    I am trying to find other places to give this talk.</p>",
        "id": 154023515,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544111947
    },
    {
        "content": "<p>IHE has worked closely with HL7 on this space. There are IHE profiles in addition to FHIR resources that are used. Thus IHE Connectathon is a good focal point too. This kind of larger use-cases that coordinate many standards are the kind of thing that is seen as IHE focal point.</p>",
        "id": 154023525,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544116441
    },
    {
        "content": "<p>Here is the video from the reportout at the last FHIR Connectathon -- <a href=\"https://youtu.be/1Fk6sagQRXg\" target=\"_blank\" title=\"https://youtu.be/1Fk6sagQRXg\">https://youtu.be/1Fk6sagQRXg</a></p>",
        "id": 154023526,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544116463
    },
    {
        "content": "<p>The success of the HL7 connectathon for care planning has led to creation of a use case in the 2019 HIMSS interoperability showcase with many of the same participants and same clinical use case. Use case name is \"Consumer Centered Care Planning\".  Includes creation of a FHIR CarePlan with structured content from a clinical practice guideline represented using PlanDefintion and ActivityDefinition. Scope also includes subscription for changes to the CarePlan resource to coordinate care with referrals and with active patient engagement.</p>",
        "id": 154023551,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1544121903
    },
    {
        "content": "<blockquote>\n<p>care plan - yes, that's the sort of things it does. And why. Can be free text but the more coded it is, the better it drives outcomes</p>\n</blockquote>\n<p>So, quickly the question becomes what's involved in coding it: for exotic (or even unusual) cases, can it be fully user-defined? e.g. could Kristina encode all 26 of Kate's symptoms, even if none had ever been heard of before?</p>\n<p>(Personally, outside of FHIR, I have a suspicion that someday we'll see that lots of conditions that resist treatment have been prey to obnoxious modeling errors - shoehorning exotic symptoms into some bucket for which a code already exists, thus befuddling attempts to really make sense of them.)</p>",
        "id": 154023750,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1544196009
    },
    {
        "content": "<p>Here's the (truly fascinating) hour-long speech the Sheridans gave at HIMSS last year. <a href=\"https://www.facebook.com/HIMSSpage/videos/10156113497658334/\" target=\"_blank\" title=\"https://www.facebook.com/HIMSSpage/videos/10156113497658334/\">https://www.facebook.com/HIMSSpage/videos/10156113497658334/</a>  </p>\n<p>And <a href=\"https://dave.pt/DaveXMed2018\" target=\"_blank\" title=\"https://dave.pt/DaveXMed2018\">here's the 25 minute long talk</a> I did at Exponential Medicine a week before DevDays, mentioning (in far less detail) the Sheridans and Michael Morris. It has about 50% overlap with my Amsterdam talk. (The XMed talk was primarily aimed at disruptor / investors.)</p>",
        "id": 154023751,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1544196009
    },
    {
        "content": "<p>actually, that's a question about the condition resource, and whether the right code to describe the condition exists. So a question for Snomed CT, really. (which probably means, no)</p>",
        "id": 154023780,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544214706
    },
    {
        "content": "<p>Actually, SNOMED probably does have a code, but probably not specific enough.  So what you do is code as closely as the code system will let you, but specify the fullly qualified value as text.  The code is what decision support and a lot of searching will work with, but the free text lets you get the full nuance in front of clinicians and other care partners.</p>",
        "id": 154024286,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544485148
    }
]