[
    {
        "content": "<p><a href=\"https://twitter.com/carinalliance/status/1236010834251468800?s=21\" target=\"_blank\" title=\"https://twitter.com/carinalliance/status/1236010834251468800?s=21\">https://twitter.com/carinalliance/status/1236010834251468800?s=21</a></p>\n<p>Get pumped</p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/carinalliance/status/1236010834251468800?s=21\" target=\"_blank\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/850373746556891141/VlEDnWug_normal.jpg\"></a><p><span aria-label=\"siren\" class=\"emoji emoji-1f6a8\" role=\"img\" title=\"siren\">:siren:</span><span aria-label=\"siren\" class=\"emoji emoji-1f6a8\" role=\"img\" title=\"siren\">:siren:</span><span aria-label=\"megaphone\" class=\"emoji emoji-1f4e3\" role=\"img\" title=\"megaphone\">:megaphone:</span>BIG announcement <span aria-label=\"megaphone\" class=\"emoji emoji-1f4e3\" role=\"img\" title=\"megaphone\">:megaphone:</span><span aria-label=\"siren\" class=\"emoji emoji-1f6a8\" role=\"img\" title=\"siren\">:siren:</span><span aria-label=\"siren\" class=\"emoji emoji-1f6a8\" role=\"img\" title=\"siren\">:siren:</span> Read our latest blog post about how <a href=\"https://twitter.com/CarequalityNet\" target=\"_blank\" title=\"https://twitter.com/CarequalityNet\">@CarequalityNet</a> and <a href=\"https://twitter.com/carinalliance\" target=\"_blank\" title=\"https://twitter.com/carinalliance\">@carinalliance</a> are working together to provide a volunteer, trusted, transparent pathway to consumer-directed exchange. \n<a href=\"https://t.co/jU4QrBVnI3\" target=\"_blank\" title=\"https://t.co/jU4QrBVnI3\">https://www.carinalliance.com/wp-content/uploads/2020/03/Consumer-Directed-Exchange-An-Approach-for-a-Volunteer-Trusted-Private-Sector-Led-Pathway-FINAL.pdf</a></p><span>- The CARIN Alliance (@carinalliance)</span></div></div>",
        "id": 189933991,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583528658
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> <span aria-label=\"clap\" class=\"emoji emoji-1f44f\" role=\"img\" title=\"clap\">:clap:</span> <span aria-label=\"clap\" class=\"emoji emoji-1f44f\" role=\"img\" title=\"clap\">:clap:</span> <span aria-label=\"clap\" class=\"emoji emoji-1f44f\" role=\"img\" title=\"clap\">:clap:</span></p>",
        "id": 189934072,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583528704
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 189943090,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583535549
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> , I gotta say this announcement may be great in geekworld, but it's completely over the head of my friends and family. Can there be an \"ordinary people\" version of this please?  (It's over MY head.  The announcement is clearly impressed with itself, but <em>je n'ai pas de clue</em> WHY it's impressed with itself.)</p>\n<p>Or, maybe it's not relevant yet - maybe it'll be years before it touches them or affects anything.  But I find that as I show excitement about the <em>data liberación</em> FHIR will bring, they're starting to get curious about how it will affect them. </p>\n<p>I suspect it wants at very least a \"Why it matters\" link, or some such.</p>\n<p>Also, if this will have ANY effect on consumer ability to create their own solutions e.g. for the <a href=\"https://www.epatientdave.com/2020/01/22/announcing-the-inaugural-american-patient-innovator-track-at-fhir-devdays/\" target=\"_blank\" title=\"https://www.epatientdave.com/2020/01/22/announcing-the-inaugural-american-patient-innovator-track-at-fhir-devdays/\">Patient Innovator</a> fiesta at DevDays, those of us involved in that need to understand.  cc <span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span> </p>\n<p>What do you think?</p>",
        "id": 189972662,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583591675
    },
    {
        "content": "<p>Yes <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> it’s a bit geeky. Let me try and simplify.</p>\n<p>As a result of this announcement, here are the options for patients to get their health info (and obviously these could be combined such as manual + digital):<br>\n1) Manual - Use right of access to access paper copies just like we do today. <br>\n2) Digital (Use any app) - Individual selects an app who have connected using FHIR to access their Argonaut + USCDI data. Privacy, Security, and Data sharing is governed by the apps terms and conditions. <br>\n3) <em>NEW</em> Digital (App contractual pathway) - App signs the Carequality framework which is a legally binding contract and must abide by their data sharing, privacy, and security requirements which will be built off the CARIN code of conduct. Apps who violate these provisions will be kicked off the Carequality network and may have other legal repercussions.</p>\n<p>Does that help? Keep in mind all of these paths are voluntary. <span class=\"user-mention\" data-user-id=\"200498\">@Brendan Keeler</span> anything you’d like to add? Or others?</p>",
        "id": 189973246,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1583592814
    },
    {
        "content": "<p>My concern with number three is it puts an unreasonably high level of trust in these apps -- basically saying that an app has the technical ability to query for data about any patient it can think of (even if the appw doesn't have the legal right to do so).</p>",
        "id": 189973758,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583593742
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/189973758\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/189973758\">said</a>:</p>\n<blockquote>\n<p>My concern with number three is it puts an unreasonably high level of trust in these apps -- basically saying that an app has the technical ability to query for data about any patient it can think of (even if the appw doesn't have the legal right to do so).</p>\n</blockquote>\n<p>Tentatively (since I'm not smart enough to assess actual risk) that would be a major showstopper, if it is what it sounds like. But I might be misinterpreting.  </p>\n<p>It SOUNDS like the whole thing depends on obedience to the Code of Conduct, which some patient activists have been \"snort-skeptical\" about, because without an actual enforcement squad, there's still no protection against bad actors who say \"SURE I'll be good!\"</p>\n<p>But as I say, for me that's an uninformed worry - what do others say?</p>",
        "id": 189974027,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583594177
    },
    {
        "content": "<p>To be clear, this will all blow up in our faces at the first sign of Facebook-like malarkey.</p>",
        "id": 189974032,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583594220
    },
    {
        "content": "<p>To be clear, full trust in model number two also requires some belief in an app's code of conduct. It's just that individual patients need to make this decision for themselves (no data can flow without an individual patient \"at the keyboard\") -- but once a patient is there and says yes, of course an app could always still be lying about how it is going to use that patient's date.</p>",
        "id": 189974100,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583594394
    },
    {
        "content": "<p>On number three, the \"idea\" is that apps will be contractually required to use a third party \"identity proofing\" service, and only after the app is satisfied about the patient's identity should the app issue a query request to a care quality network.</p>",
        "id": 189974163,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583594498
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> - that's exactly the kind of \"one step up from clueless\" guidance I need. </p>\n<p>So what <em>is</em> your concern, \"puts an unreasonably high level of trust in these apps\"?</p>",
        "id": 189974164,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583594505
    },
    {
        "content": "<p>My concern about number three is the flow of trust: it's not enough to contractually obligate the app developers to verify a patient's identity. The (carequality compatible) network allowing the app to connect should have some technical skin in the game so it can verify the patient's identity directly.</p>",
        "id": 189974212,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583594594
    },
    {
        "content": "<p>And Ryan, you say the code of conduct is a \"legally binding contract\" - that reminds me too painfully of the HIPAA Right of Access, <em>which is unenforceable by an individual.</em>  What enforcement of the contract (i.e. surveillance and punishment) can patient activists expect to see? That's gotta be costly to CARIN.</p>",
        "id": 189974213,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583594594
    },
    {
        "content": "<p>And my concerns are definitely solvable in a technical fashion (For example, passing along \"verifiable claims\" from an identity proofing service to an app user and then having the user present those claims  to the network for verification. Or as another example, through a properly stacked arrangement of open ID connect interactions -- though obviously in this forum I'm trying to wave my hands technically without getting into any details.)</p>",
        "id": 189974348,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583594842
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/189974212\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/189974212\">said</a>:</p>\n<blockquote>\n<p>The (carequality compatible) network allowing the app to connect should have some technical skin in the game so it can verify the patient's identity directly.</p>\n</blockquote>\n<p>Is there a consumer-level example of what form \"verify the patient's identity directly\" might take?</p>\n<p>And what \"have some technical skin in the game\" might look like, or just mean, as a metaphor?  </p>\n<p>(Note, that's an \"is there\" question - \"Not really\" is a valid answer, if depressing :-))</p>",
        "id": 189975295,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583596376
    },
    {
        "content": "<p>Regarding the consumer experience of identity verification: sure, today there are basically services that rely on in-person proofing (like passing your driver's license to the clerk at a clinic), and online services that rely on some combination of knowledge based authentication or uploading photos or videos of yourself alongside an existing credential, or verification of known facts about you like a phone number or an email address by making sure you can respond at those endpoints -- all kinds of interesting approaches.</p>",
        "id": 189975505,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583596754
    },
    {
        "content": "<p>Some of these in my opinion don't do a great job from the privacy perspective (For example I think the knowledge based authentication services wind up incentivizing data hoarding, because the more obscure facts that a company knows about you, the \"better\" they can quiz you to confirm your identity)</p>",
        "id": 189975567,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583596837
    },
    {
        "content": "<p>When I talk about the network having some skin in the game, what I mean is that the network should not take a consumer app's word when it comes to identity verification. The network or the organizations releasing data should be directly (automatically, seamlessly) reviewing identity claims and determining whether they meet requirements.</p>",
        "id": 189975632,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583596931
    },
    {
        "content": "<p>Josh has fully articulated \"the three paths\". </p>\n<p>Smart on FHIR patient authorized exchange is the safest but a non ideal experience for consumers who struggle with many portals.</p>\n<p>For trusted exchange networks:</p>\n<p>Simple Code of Conduct can and will be abused (or \"misunderstood\"). Commonwell does a good job with this model by requiring certain identity vendors like Experian, though.</p>\n<p>Network with full or partial trust infrastructure \"skin in the game\" (i.e. centralized identity infrastructure) is ultimately good so they can easily audit. But more work for CARIN and Carequality</p>",
        "id": 189975998,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583597594
    },
    {
        "content": "<p>For Commonwell <span class=\"user-mention\" data-user-id=\"200498\">@Brendan Keeler</span> , when an app uses a specific service like Experian, does Commonwell get to see the Experian results directly, or does it trust the app to vouch for the fact that it used Experian?</p>",
        "id": 189976186,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583597960
    },
    {
        "content": "<p>(this is leaving aside for the moment my general queasiness about knowledge-based identity proofing... I just want to understand the flow of trust)</p>",
        "id": 189976191,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583597983
    },
    {
        "content": "<p>They're model 2 to my knowledge. Commonwell's access is only through certification up front and regular audits I believe but I can check.</p>",
        "id": 189976247,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583598036
    },
    {
        "content": "<p>Yeah knowledge based proofing sucks but at least it's another path</p>",
        "id": 189976253,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583598065
    },
    {
        "content": "<p>Biometrics still not a viable path so it's either patient auth or knowledge based proofing</p>",
        "id": 189976297,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583598131
    },
    {
        "content": "<p>Or blind trust/legally blind trust</p>",
        "id": 189976302,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583598143
    },
    {
        "content": "<p>Given that there already are consistently some really iffy edge cases on Carequality with today's single use case, a signed agreement and potential legal repercussions alone isn't enough IMO. So interested to see the exact agreement and structure.</p>",
        "id": 189976360,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583598249
    },
    {
        "content": "<p>But ultimately like this collaboration bringing together a lot of the best people on one of the biggest industry problems.</p>",
        "id": 189976364,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583598270
    },
    {
        "content": "<p>Yeah I am all for discussion but I'm also wary of announcements and a lot of public promotion before there is a clear technical path in place and piloted in the real world.</p>",
        "id": 189976374,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583598309
    },
    {
        "content": "<p>This line in particular is promising: \"individual users who voluntarily create a person-centric digital identity credential to use that credential across all Carequality Framework participants.\"</p>",
        "id": 189976444,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583598470
    },
    {
        "content": "<p>If I'm reading that correctly, it is about sign in (authentication) Rather than about identity. It's very possible I'm not reading it correctly :-)</p>",
        "id": 189976559,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583598606
    },
    {
        "content": "<p>Where might I go today to create such a credential?</p>\n<p>Do I understand correctly that this is analogous to the things I see that ask which of the following addresses I’ve had in the past?</p>",
        "id": 189976617,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583598724
    },
    {
        "content": "<p>I assume they are just talking about public keys that you can generate on your PC or phone (For example, Android and iOS both have hardware security modules that let you generate credentials within apps, including even the web browser) or on a dedicated hardware device like <a href=\"https://www.yubico.com/\" target=\"_blank\" title=\"https://www.yubico.com/\">https://www.yubico.com/</a> that connects to your PC or phone</p>",
        "id": 189976646,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583598828
    },
    {
        "content": "<p><a href=\"https://webauthn.io/\" target=\"_blank\" title=\"https://webauthn.io/\">https://webauthn.io/</a> has a demonstration of the APIs built into web browsers today, and will probably work from any recent device you try it on</p>",
        "id": 189976699,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583598866
    },
    {
        "content": "<p>But this is just about how you sign in -- not about how you tie your account back to some real world identity that an organization can use to decide which records to show you</p>",
        "id": 189976704,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583598885
    },
    {
        "content": "<p>Yeah generation of a token is trivial. Generation of an identity proofed token and full use across the network, though...</p>",
        "id": 189977227,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583599687
    },
    {
        "content": "<p>But what is the proofing mechanism being proposed?</p>",
        "id": 189977238,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583599718
    },
    {
        "content": "<p>A salient question</p>",
        "id": 189977999,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583600883
    },
    {
        "content": "<p>How do you connect an app to the carequality network? Are there specs somewhere??</p>",
        "id": 190031784,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583708668
    },
    {
        "content": "<p>A sandbox?</p>",
        "id": 190031790,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583708705
    },
    {
        "content": "<p>The first thing you have to do is sign up at <a href=\"https://carequality.org/\" target=\"_blank\" title=\"https://carequality.org/\">https://carequality.org/</a></p>",
        "id": 190032306,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1583709816
    },
    {
        "content": "<p>Sorry - how do I signup? Don't see anything obvious there</p>",
        "id": 190033259,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583711883
    },
    {
        "content": "<p>Michele, Go to <a href=\"https://carequality.org/contact-us/\" target=\"_blank\" title=\"https://carequality.org/contact-us/\">https://carequality.org/contact-us/</a> and complete the form and put in a note in the comments field about what you would like.  Someone will get back with you.</p>",
        "id": 190040262,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1583726844
    },
    {
        "content": "<p>carequality is not an enduser organization. It is a coordination organization of organzations. Each organization is strongly vetted before it is allowed into the network. There are rules of engagement...   But once in, a SAML assertion from your organization is a token that is trustable as backed by that organization.   I think they were looking to add a PHR as a participant, but don't know the status.  <span class=\"user-mention\" data-user-id=\"191860\">@Didi Davis</span> ? <span class=\"user-mention\" data-user-id=\"234848\">@Bill Mehegan</span> ?</p>",
        "id": 190062892,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583756624
    },
    {
        "content": "<p>OK, thanks, posted</p>",
        "id": 190063120,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583756854
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> so consumer apps CANNOT connect and get data from Carequality ?</p>",
        "id": 190063211,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583756937
    },
    {
        "content": "<p>not that I know. but that is why I added Didi to the list. She will have an authorative answer.</p>",
        "id": 190063396,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583757120
    },
    {
        "content": "<p>PHRs can participate</p>",
        "id": 190143405,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583818124
    },
    {
        "content": "<p>Implementers are not required to respond to any queries except Treatment, so currently less than 100% of sites respond. But that should change with TEFCA and with this new collaboration</p>",
        "id": 190143462,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583818207
    },
    {
        "content": "<p>(To be clear: today a <em>lot</em> less than 100% of sites respond. My understanding is that within some of the largest Carequality-compliant networks, zero percent of sites respond to consumer access requests.)</p>",
        "id": 190183824,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583853258
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190183824\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190183824\">said</a>:</p>\n<blockquote>\n<p>(To be clear: today a <em>lot</em> less than 100% of sites respond. My understanding is that within some of the largest Carequality-compliant networks, zero percent of sites respond to consumer access requests.)</p>\n</blockquote>\n<p>HOLY W-T-H???</p>\n<p>Do you agree with Brendan that with TEFCA and this new collaboration, that should change??</p>\n<p>I mean, there's a lot at stake here!  I'll say it again - these stories of patient impact are real and will continue to be!  And we have more such stories coming soon.  This is real, people.</p>\n<p><a href=\"https://www.youtube.com/watch?v=9SqohvPiCgY\" target=\"_blank\" title=\"https://www.youtube.com/watch?v=9SqohvPiCgY\">https://www.youtube.com/watch?v=9SqohvPiCgY</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"9SqohvPiCgY\" href=\"https://www.youtube.com/watch?v=9SqohvPiCgY\" target=\"_blank\" title=\"https://www.youtube.com/watch?v=9SqohvPiCgY\"><img src=\"https://i.ytimg.com/vi/9SqohvPiCgY/default.jpg\"></a></div>",
        "id": 190220627,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583872103
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190063396\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190063396\">said</a>:</p>\n<blockquote>\n<p>not that I know. but that is why I added Didi to the list. She will have an authorative answer.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191860\">@Didi Davis</span> help please? \"What is reality,\" as Firesign Theater famously asked?</p>",
        "id": 190220847,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583872228
    },
    {
        "content": "<p>Based on our experience using the Carequality-compliant networks to date, the response for purposes of \"treatment\" access has been excellent!  However, when it comes to queries for purposes of \"patient\" access, then Josh is absolutely correct.  In some cases certain EHR vendors response rate for patient queries is zero percent.  However, there are other EHR vendors who have health providers who are responding on a limited basis for patient queries.  Obviously, we are hoping all of this will be changing in the oncoming months with the announcements yesterday by CMS and ONC.</p>",
        "id": 190224568,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1583874259
    },
    {
        "content": "<p>As an app developer I do not understand what any of this means</p>",
        "id": 190225422,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583874734
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> which parts? I'm happy to share my take on things, but don't want to \"talk down\" to you. In any case, I've just posted <a href=\"https://gist.github.com/jmandel/f7a28b48f70f8c89317c19ad4e2ddc2d\" target=\"_blank\" title=\"https://gist.github.com/jmandel/f7a28b48f70f8c89317c19ad4e2ddc2d\">https://gist.github.com/jmandel/f7a28b48f70f8c89317c19ad4e2ddc2d</a> with my own perspective / explanation, if it helps.</p>",
        "id": 190232484,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583878712
    },
    {
        "content": "<p>Bottom line though: the query networks today send out demographics <em>and</em> a \"purpose of use\", asking \"does anybody have data on a patient named Michele Mottini, gender male, from zip code _____? I'm asking for purposes of {treatment, individual-access, public-health, ...}\"</p>",
        "id": 190232553,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583878776
    },
    {
        "content": "<p>And then nodes respond to the query based on the demographics provided <em>and</em> the information about purpose of use. Some nodes decline to answer any queries if the purpose of use is anything other than \"treatment\".</p>",
        "id": 190232627,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583878807
    },
    {
        "content": "<p>Will that be illegal under the new rules ?</p>",
        "id": 190232757,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583878911
    },
    {
        "content": "<p>It's complicated. A blanked refusal would probably be information blocking, but setting a higher threshold for confidence in the user's identity might be OK...</p>",
        "id": 190233036,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583879088
    },
    {
        "content": "<p>And to be clear, \"some nodes decline to answer\" is code for \"have been programmed to disregard,\" right?</p>",
        "id": 190233106,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583879137
    },
    {
        "content": "<p>To be clear, uncertainty about identity is a <em>real</em> problem, unlike a lot of other excuses for not sharing data. The query network has no relationship with the individual, and providers haven't authenticated the individual, but they're still being asked to attain some level of certainty and then send out PHI.</p>",
        "id": 190233107,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583879138
    },
    {
        "content": "<p>Honestly from my perspective, the query networks just aren't a good architecture for disclosing PHI.</p>",
        "id": 190233206,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583879185
    },
    {
        "content": "<p>I don't see how providers are going to be confident enough to do it.</p>",
        "id": 190233234,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583879211
    },
    {
        "content": "<p>Not without some shared approach to identity management (that's part of my attraction to the DID + Verifiable Claims world).</p>",
        "id": 190233266,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583879229
    },
    {
        "content": "<p>Thank you. <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> this will be a big issue for us, it seems</p>",
        "id": 190233445,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583879360
    },
    {
        "content": "<p>Thanks @josh - that text help. So patient facing app could get data from the Carequality network but they have to become member of it first, correct? How does that happen? ..then once you become a member you 'send queries to the network' - how? and maybe you get an answer or maybe not ...how? ...and then according to the announcement there is (or there is going to be) some central authentication system (??) ... how does that work / will work? Isn't there docs somewhere where this is explained? Would seem pretty basic</p>",
        "id": 190234058,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583879979
    },
    {
        "content": "<p>I'm getting out of my depth here, but <a href=\"https://carequality.org/resources/\" target=\"_blank\" title=\"https://carequality.org/resources/\">https://carequality.org/resources/</a> is the source of truth -- and for technical details about how queries are sent, <a href=\"https://s3.amazonaws.com/ceq-project/wp-content/uploads/2018/09/30162842/Implementation-Guide-v1.1-Effective-3-27-18.pdf\" target=\"_blank\" title=\"https://s3.amazonaws.com/ceq-project/wp-content/uploads/2018/09/30162842/Implementation-Guide-v1.1-Effective-3-27-18.pdf\">https://s3.amazonaws.com/ceq-project/wp-content/uploads/2018/09/30162842/Implementation-Guide-v1.1-Effective-3-27-18.pdf</a> (short answer: IHE XDS.b).</p>",
        "id": 190234648,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583880490
    },
    {
        "content": "<p>Thank you. <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> this will be a big issue for us, it seems</p>",
        "id": 190234652,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583880496
    },
    {
        "content": "<p>I think the goal of the announcement here is to try to do something better with respect to identity proofing; I'm not sure yet what is being proposed.</p>",
        "id": 190234678,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583880539
    },
    {
        "content": "<p>This article may help: “Trust in healthcare integration” <a href=\"https://link.medium.com/0EAmquuQK4\" target=\"_blank\" title=\"https://link.medium.com/0EAmquuQK4\">https://link.medium.com/0EAmquuQK4</a></p>",
        "id": 190241160,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583887468
    },
    {
        "content": "<p>FHIR is very prevalent in patient authorization and a bit in edge interfacing but not in enterprise interoperability networks yet (nor does TEFCA encourage FHIR currently)</p>",
        "id": 190241205,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583887560
    },
    {
        "content": "<p>This has been a great discussion. Based on some statements from <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> (please weigh in!), my understanding is that the goal here is primarily to leverage the trust framework and agreements that Carequality has worked to put into place, but that the actual patient-centric access would continue via direct connections to health systems, i.e., it would <strong>not</strong> leverage the existing (primarily C-CDA-based) query network. The theoretical benefit would be that an app could register once and be accepted by everyone within the ecosystem. Same for identity - the same SMART auth would be used for each connection, but the possibility exists of a single trusted credential accepted by anyone in the network. I think there is a dearth of details here, and I'm reserving judgment, but that's my current (possibly uninformed) understanding.</p>",
        "id": 190241270,
        "sender_full_name": "Ricky Bloomfield",
        "timestamp": 1583887600
    },
    {
        "content": "<p>If that's the path forward, I'm digging it <span class=\"user-mention\" data-user-id=\"193764\">@Ricky Bloomfield</span></p>",
        "id": 190241292,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583887648
    },
    {
        "content": "<p>Huh. You're saying the agreement with Carequality wouldn't be using any of the Carequality framework network services or API capabilities?</p>",
        "id": 190241359,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583887739
    },
    {
        "content": "<p>Yeah, that's my understanding. But hopefully <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> will jump in here.</p>",
        "id": 190241382,
        "sender_full_name": "Ricky Bloomfield",
        "timestamp": 1583887778
    },
    {
        "content": "<p>I have a strong feeling that Ryan is a bit overwhelmed with prep for tomorrow's \"explain it all\" day.</p>",
        "id": 190244923,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583892768
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190245649\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190245649\">said</a>:</p>\n<blockquote>\n<p>I don't think the #CuresRuleONC has anything to say about the project CARIN and Carequality are undertaking together.</p>\n</blockquote>\n<p>I agree - I got sloppy so I'll go back and edit out the Keith inquiry. Bad dog.</p>",
        "id": 190245839,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583894503
    },
    {
        "content": "<p>Now you've got me editing my history too. By the end, we'll have deleted everything ;-)</p>",
        "id": 190245888,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583894544
    },
    {
        "content": "<p>Hello all, please bear with any Zulip faux pas, as I’m new to the app and this forum.  I know many of the folks weighing in here, but for those who don’t know me, I’m Carequality’s Executive Director and collaborated with Ryan on the blog post that originated this thread.  </p>\n<p>I’ve proposed to Ryan that a webinar on Carequality and consumer-driven health information access would probably be helpful.  I won’t be able to address every question raised here briefly, but I can confirm that <span class=\"user-mention\" data-user-id=\"193764\">@Ricky Bloomfield</span>  does have it basically right.</p>\n<p>To (sort of) address the question from <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  about the role for Carequality’s existing support for query-based document exchange via SOAP-based IHE profiles, we do plan to leverage our existing services and processes, while also adapting to the different environment involved with FHIR-based exchange.  I recognize that might sound wishy-washy.  Operating in a FHIR-based, app-driven environment realistically will require some differences from our existing operations, but we’ll nonetheless try to reinvent the wheel as few times as possible.</p>",
        "id": 190317538,
        "sender_full_name": "Dave Cassel",
        "timestamp": 1583952584
    },
    {
        "content": "<p>What about a specs document instead?</p>",
        "id": 190318265,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583953021
    },
    {
        "content": "<p>Our FHIR-based exchange guide is still in draft form, and in two parts.  You can find the technically-oriented portion here: <a href=\"https://docs.google.com/document/d/1iOour1orfMpYS30L2AU2wajZRXl7p6YWlk5F61TcZ1M/edit?ts=5d920fe0\" target=\"_blank\" title=\"https://docs.google.com/document/d/1iOour1orfMpYS30L2AU2wajZRXl7p6YWlk5F61TcZ1M/edit?ts=5d920fe0\">https://docs.google.com/document/d/1iOour1orfMpYS30L2AU2wajZRXl7p6YWlk5F61TcZ1M/edit?ts=5d920fe0</a> (not quite sure of protocol for hyperlinks here so putting it in as plain text).</p>\n<p>The policy-oriented portion is here:  <a href=\"https://docs.google.com/document/d/1e-6sjXxze0kIndJ-ZRYQw0sY6LYa8KxlhPc1Ao71OpQ/edit\" target=\"_blank\" title=\"https://docs.google.com/document/d/1e-6sjXxze0kIndJ-ZRYQw0sY6LYa8KxlhPc1Ao71OpQ/edit\">https://docs.google.com/document/d/1e-6sjXxze0kIndJ-ZRYQw0sY6LYa8KxlhPc1Ao71OpQ/edit</a></p>\n<p>We have workgroups meeting to fully flesh out these drafts, generally on a weekly basis.  They are open to anyone who wishes to participate, and to join you can email us at <a href=\"mailto:admin@carequality.org\" title=\"mailto:admin@carequality.org\">admin@carequality.org</a>.  </p>\n<p>You will see that the technical portion is not a \"FHIR spec\".  For the actual resources being accessed, we will point to existing specs developed by FHIR accelerators (or anyone else who develops a useful and cogent spec for a resource that is needed).</p>",
        "id": 190318894,
        "sender_full_name": "Dave Cassel",
        "timestamp": 1583953423
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 190320869,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583954483
    },
    {
        "content": "<p>It appears not to be finished yet, am I right?</p>",
        "id": 190320897,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1583954510
    },
    {
        "content": "<p>That's right, definitely still a draft and incomplete.  There are technical and policy workgroups that are meeting to flesh it out fully, and they are open to all who are interested in participating.  </p>\n<p>Note that you can also check out our existing Query-Based Document Exchange Implementation Guide, which is complete and has been in production use for a long time.  As the discussion above noted, however, there are some challenges for consumer access in that model, that we're addressing in the FHIR context.  I'm happy to talk with anyone on the consumer side about participating in the doc exchange model, but if you're new to Carequality, it will probably make sense in most cases to focus on FHIR.  We are aiming to have the FHIR guide complete and formally adopted for production use by the end of this year.</p>",
        "id": 190323050,
        "sender_full_name": "Dave Cassel",
        "timestamp": 1583955843
    },
    {
        "content": "<p>But looking at the following, it seems like Carequality might actually offer a consumer-facing \"sign in and authorize apps\" feature?</p>\n<p><a href=\"/user_uploads/10155/LgcmgLFDaBf_2D8v0WMJK-pz/image.png\" target=\"_blank\" title=\"image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/LgcmgLFDaBf_2D8v0WMJK-pz/image.png\" target=\"_blank\" title=\"image.png\"><img src=\"/user_uploads/10155/LgcmgLFDaBf_2D8v0WMJK-pz/image.png\"></a></div>",
        "id": 190324822,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583956833
    },
    {
        "content": "<p>In this diagram, is Carequality playing the role of \"EHR Auth Server\"? So apps would be issuing queries <em>not</em> in \"god mode,\" but rather using tokens scoped to one specific patient?</p>",
        "id": 190324842,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583956856
    },
    {
        "content": "<p>For this to work, I think it means Carequality taking on the identity-matching problem centrally... or somehow establishing how identity attributes would be tied back to the signed-in user, when a query gets sent.</p>",
        "id": 190324924,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583956903
    },
    {
        "content": "<p>Or would apps be working per:<br>\n<a href=\"/user_uploads/10155/pNHUBAH-uudv497bDN8QE9ku/image.png\" target=\"_blank\" title=\"image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/pNHUBAH-uudv497bDN8QE9ku/image.png\" target=\"_blank\" title=\"image.png\"><img src=\"/user_uploads/10155/pNHUBAH-uudv497bDN8QE9ku/image.png\"></a></div><p>... where they just get \"god-mode\" system-level access? I'm unclear from the doc, which presents a few different paradigms of connectivity.</p>",
        "id": 190325051,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583956979
    },
    {
        "content": "<p>Yes, <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> is right. Between preparing for today and reading/summarizing the rules, there's a lot going on!</p>\n<p>I would agree with <span class=\"user-mention\" data-user-id=\"193764\">@Ricky Bloomfield</span> and <span class=\"user-mention\" data-user-id=\"270627\">@Dave Cassel</span> on what they've said. I would also add it's still a work in progress. It's one of the reasons we tried to be very careful in our wording when we said \"will work to develop\". Our goal (like we did with Blue Button) is to notify the industry early who is working on these issues and where they can go to dive in (e.g., HL7, CARIN, Carequality, etc.). </p>\n<p>It's important to note the approach that is in the current Carequality documentation may or may not be what we finalize together over the next few months for the consumer app side. As with Carequality's work, our identity work is also open to anyone who would like to join. Please email me at <a href=\"mailto:ryan.howells@leavittpartners.com\" title=\"mailto:ryan.howells@leavittpartners.com\">ryan.howells@leavittpartners.com</a> and we'll get you inserted in our workgroups.</p>",
        "id": 190325790,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1583957423
    },
    {
        "content": "<p>From an ID federation perspective, we've had to go outside of health care and often outside of the U.S. to look for policy and technical models that work. Here are a few we are looking at in terms of models we think we can leverage (likely parts of these, not all):<br>\nEU - <a href=\"https://ec.europa.eu/cefdigital/wiki/display/CEFDIGITAL/Legislation+in+a+nutshell\" target=\"_blank\" title=\"https://ec.europa.eu/cefdigital/wiki/display/CEFDIGITAL/Legislation+in+a+nutshell\">https://ec.europa.eu/cefdigital/wiki/display/CEFDIGITAL/Legislation+in+a+nutshell</a> <br>\nCanada - <a href=\"https://diacc.ca/\" target=\"_blank\" title=\"https://diacc.ca/\">https://diacc.ca/</a><br>\nGA Tech trustmark (not currently operational) - <a href=\"https://trustmark.gtri.gatech.edu/\" target=\"_blank\" title=\"https://trustmark.gtri.gatech.edu/\">https://trustmark.gtri.gatech.edu/</a><br>\nKantara - <a href=\"https://kantarainitiative.org/trustoperations/800-63-3/\" target=\"_blank\" title=\"https://kantarainitiative.org/trustoperations/800-63-3/\">https://kantarainitiative.org/trustoperations/800-63-3/</a><br>\nSafe Identity - <a href=\"https://makeidentitysafe.com/\" target=\"_blank\" title=\"https://makeidentitysafe.com/\">https://makeidentitysafe.com/</a></p>",
        "id": 190326337,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1583957798
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <br>\nThe diagrams you are referencing, at this point, are sets of ideas we're still kicking the tires on with respect how to approach authorization/authentication. Especially on the (patient facing) app side. That is why you see multiple paradigms of connectivity. In addition to those diagrams in the Google doc, there's comments/discussions on the different approaches being proposed. These discussions are ongoing and as we continue to meet &amp; have Connectathons, we're getting closer to having definitive language on how to approach these workflows.</p>\n<p>Adding <span class=\"user-mention\" data-user-id=\"195299\">@Luis Maas</span> <span class=\"user-mention\" data-user-id=\"191358\">@Dennis Patterson</span>, who are members of the Carequality FHIR Workgroup(s), and may offer additional technical insights to the thread. </p>\n<p>In either case, as <span class=\"user-mention\" data-user-id=\"270627\">@Dave Cassel</span> noted above - the FHIR Workgroups are still active and definitely open to anyone who wishes to participate. Please reach out to me directly if you're interested.</p>",
        "id": 190378505,
        "sender_full_name": "Bill Mehegan",
        "timestamp": 1584012125
    },
    {
        "content": "<p>For any CARIN / Carequality workgroup conversations, please do add me to the list <span class=\"user-mention\" data-user-id=\"234848\">@Bill Mehegan</span> .</p>",
        "id": 190389568,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584020116
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190062892\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190062892\">said</a>:</p>\n<blockquote>\n<p>carequality is not an enduser organization. It is a coordination organization of organzations. Each organization is strongly vetted before it is allowed into the network. There are rules of engagement...   But once in, a SAML assertion from your organization is a token that is trustable as backed by that organization.   I think they were looking to add a PHR as a participant, but don't know the status.  <span class=\"user-mention silent\" data-user-id=\"191860\">Didi Davis</span> ? <span class=\"user-mention silent\" data-user-id=\"234848\">Bill Mehegan</span> ?<br>\n```Thank you for reaching out <span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> and <span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span>.   <span class=\"user-mention silent\" data-user-id=\"270627\">Dave Cassel</span> and <span class=\"user-mention silent\" data-user-id=\"234848\">Bill Mehegan</span> are the \"Authoritative\" best persons to reply to Carequality related discussions since they are Carequality staff.  While I am a subject matter expert that supports Carequality, I am happy to see their responses.  Great discussion and we look forward to seeing this deployed in the \"Real World\" so patients and their caregivers can benefit!</p>\n</blockquote>",
        "id": 190409783,
        "sender_full_name": "Didi Davis",
        "timestamp": 1584029893
    },
    {
        "content": "<p>Glad some discussions have helped get people up-to-speed. The main problem is as <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> said is that user-as-the-patient is new to the network, and thus the trust chain has not yet been woven. There is a real concern that adding user-as-the-patient might be maliciously abused, thus we need to be very careful to assure that security and privacy are designed into the system at the start.   This could initially be modeled after the provider organizations, in that an organization vouches for the tenacity of the identity provisioning, and as such takes responsibility for any false claims that THEY issue (SAML Assertion). These organizations would likely be PHR organizations, but could be proxy bridges eventually.</p>",
        "id": 190410591,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584030262
    },
    {
        "content": "<p>And this could also be modeled as a system that passes verified identity claims on into (and through) the network, so relying parties could review for themselves (rather than having to take the app at its word; If you have to take a consumer app at its word, <a href=\"https://gist.github.com/jmandel/f7a28b48f70f8c89317c19ad4e2ddc2d#background-b2b-networks\" target=\"_blank\" title=\"https://gist.github.com/jmandel/f7a28b48f70f8c89317c19ad4e2ddc2d#background-b2b-networks\">that's what I call \"god mode\"</a>)</p>",
        "id": 190419121,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584034285
    },
    {
        "content": "<p>YES. exactly</p>",
        "id": 190419180,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584034312
    },
    {
        "content": "<p>but first the PHR organizations need to be recongnized as authorative at patient identity claims as users... and building that trust is hard</p>",
        "id": 190419284,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584034346
    },
    {
        "content": "<p>I think PHR organizations <em>don't</em> and shouldn't need to be authoritative -- they can let patients bring in claims from elsewhere. For example in <a href=\"http://github.com/microsoft-healthcare-madison/did-spike/\" target=\"_blank\" title=\"http://github.com/microsoft-healthcare-madison/did-spike/\">http://github.com/microsoft-healthcare-madison/did-spike/</a> we showed how a patient can prove that they have access to an existing EHR portal somewhere (i.e., verify FHIR API access + verify phone number, all automatically) and then turn <em>that</em> into a verifiable credential that can be presented to other providers, or to a network.</p>",
        "id": 190419437,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584034424
    },
    {
        "content": "<p>(To be clear, that was a one-week proof of concept, but we validated the approach, and thought it was a promising direction.)</p>",
        "id": 190419533,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584034453
    },
    {
        "content": "<p>That's vaguely what we were doing with the FhirBlocks project, but without blockchain.  The project was also exploring Yubikey, 2FA, and some other authentication schemes.  The stumbling block we ran into was the assumption (not mine) that Epic would simply update its servers to accept a sovereign ID (or DID in Josh's example) just because our pilot project asked them to.  Since Meteor on FHIR (now Node on FHIR) can work as a proxy server, we implemented some basic sovereign/DID key signature generation on our own servers to prove the concept.  But yeah... I would also lean toward the notion that distributed algorithms (with or without blockchain) can solve the problem in an ad-hoc manner.</p>",
        "id": 190421332,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1584035224
    },
    {
        "content": "<p>The neat thing is that a trusted third party can generate the sovreign ID for now, and if/when the EHR vendors see value, they can start doing so directly</p>",
        "id": 190421501,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584035285
    },
    {
        "content": "<p>trusted third part is what I was refering to.. just simplified it into the PHR vendor scope. The important part is that the identity provisioning must be fully trustable. The session authentication (2FA, etc) is secondary. Both are important, but one can have a wonderful strong session authentication while having zero trustable identity provisioning. Hence why NIST 800-63 has broken these out into two different vectors, with a third vector on federation claims. --- again, we do not need to invent standards, NIST has already defined these.</p>",
        "id": 190421897,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584035460
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190419121\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190419121\">said</a>:</p>\n<blockquote>\n<p>If you have to take a consumer app at its word, <a href=\"https://gist.github.com/jmandel/f7a28b48f70f8c89317c19ad4e2ddc2d#background-b2b-networks\" target=\"_blank\" title=\"https://gist.github.com/jmandel/f7a28b48f70f8c89317c19ad4e2ddc2d#background-b2b-networks\">that's what I call \"god mode\"</a>)</p>\n</blockquote>\n<p>I have a feeling I need to understand this very well (where \"I\" is a proxy for \"anyone who thinks like me and cares but doesn't thoroughly understand this trust stuff\".)  Your linked page makes my antennas say \"Uh-oh there's something important here and I don't really get it yet.\"</p>",
        "id": 190427298,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584038008
    },
    {
        "content": "<p>iddqd -- had to go look that up after seeing all this talk of god mode</p>",
        "id": 190439740,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1584044333
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190062892\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190062892\">said</a>:</p>\n<blockquote>\n<p>carequality is not an enduser organization. It is a coordination organization of organzations. Each organization is strongly vetted before it is allowed into the network. There are rules of engagement...   But once in, a SAML assertion from your organization is a token that is trustable as backed by that organization.   I think they were looking to add a PHR as a participant, but don't know the status.  <span class=\"user-mention silent\" data-user-id=\"191860\">Didi Davis</span> ? <span class=\"user-mention silent\" data-user-id=\"234848\">Bill Mehegan</span> ?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"270627\">@Dave Cassel</span> and <span class=\"user-mention\" data-user-id=\"234848\">@Bill Mehegan</span> are the most qualified to answer Carequality related questions on this forum.  But yes, Carequality provides a trust framework to interconnect networks.  Carequality provides the essential elements to enable exchange of health related information.  Carequality has defined the common rules of the road (policy and governance framework to empower trust); well-defined technical specifications (can point to existing standards from Argonaut, DaVinci, etc but are well defined in one implementation guide) and Operational support for a directory of participants, technical security tokens and other required services. The current use case in production is the Query Based Document Exchange Implementation Guide (exchanging 90+ Million documents per month), but there are Push Notifications and FHIR Implementation Guides in development.  Lastly, there are PHR implementers on Carequality today.  For instance, OneRecord <a href=\"http://onerecord.com/\" target=\"_blank\" title=\"http://onerecord.com/\">http://onerecord.com/</a> is one such PHR network.  All workgroups are open to all to participate, just send an email to <a href=\"mailto:admin@carequality.org\" title=\"mailto:admin@carequality.org\">admin@carequality.org</a>. Hope this helps.</p>",
        "id": 190537821,
        "sender_full_name": "Didi Davis",
        "timestamp": 1584123511
    },
    {
        "content": "<p>I talk about OneRecord and PHRs generally in my \"god mode\" post. It doesn't seem like the right integration model to me, because consumer apps aren't generally trustworthy and accountable the way providers and other converted entities are.</p>",
        "id": 190647837,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584280138
    },
    {
        "content": "<p>From a Security/Privacy perspective, the fundamental difference between an EHR and a PHR with regards to \"god mode\" is that a PHR is accessing a patient record onbehalf of that patient, with the data accessible on that PHR only by that patient. Yes the patient can then provide access to others, but it is a assignment action by that patient. Where as an EHR or clinical application requesting access to data is going to incorporate the results into the EHR (or clinical application) where role-based-access-control will allow others to access it for Treatment, Payment, and Operations. Under the treatment purposeOfUse the hope is that it is constrained to legitimate relationship (care Team) with appropriate 'safety' exceptions, etc. The reason is that once data has been used by a practicing clinician within an organization, then that data is part of the legal medical record of that organization. That organization has obligations they must uphold around medical records retention and health safety. Thus when a Treatment PurposeOfUse is asserted, it is not going to be limited to the USER making the request, it is a request on behalf of the ORGANIZATION, and the retention expectation would be for the life of the medical record retention at that organization and the future access controlled by that organization policies. Thus a access control decision to release for Treatment (which should explicitly include Payment and Operations; but often these are implied), must be made based on the ORGANIZATION requesting, not the USER. The USER should be recorded in audit logs, as the triggering user.   These are NOT bright lines, they should be more bright than they are. But this is how I get to an understanding that an authorized Treatment PurposeOfUse is onBehalf of the organization requesting; where a Patient Request is onBehalf of THAT patient, not the PHR agent. Yes the PHR agent does need to be trusted, but that trust should be in the hands of the Patient, not in the hands of the custodian making the access control decision to release data.  (Note Research and PublicHealth PurposeOfUse are closer to EHR than they are PHR; but I expect them to be project specific within that broad purposeOfUse)</p>",
        "id": 190716382,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584362614
    },
    {
        "content": "<blockquote>\n<p>Yes the PHR agent does need to be trusted, but that trust should be in the hands of the Patient, not in the hands of the custodian making the access control decision to release data. </p>\n</blockquote>\n<p>Agreed 100%, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> . For me this is the key point.</p>",
        "id": 190741803,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584373983
    },
    {
        "content": "<p>I totally agree with Josh's point.</p>",
        "id": 190744044,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1584374987
    },
    {
        "content": "<p>This may be the central point of ALL discussions about trust, yes?</p>\n<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190741803\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190741803\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Yes the PHR agent does need to be trusted, but that trust should be in the hands of the Patient, not in the hands of the custodian making the access control decision to release data. </p>\n</blockquote>\n<p>Agreed 100%, <span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> . For me this is the key point.</p>\n</blockquote>\n<p>And a key point of argument arises when paternalists say (as they always do) \"But patients don't know what they're getting themselves into,\" \"Patients can be talked into things that they don't understand,\" etc.  Yes?</p>\n<p>(Obviously my view is \"If that's a problem let's fix it - don't keep everyone tied up in the back in car seats.\")</p>",
        "id": 190782828,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584394365
    },
    {
        "content": "<p>There's a twist though: usually when we talk about making sure these decisions are \"not in the hands of the custodian making the access control decision\" the goal is to ensure these custodians can't <em>prevent</em> patient access. Here, the angle is to ensure that these custodians don't <em>enable</em> access on just the app's say-so.</p>",
        "id": 190784042,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584395179
    },
    {
        "content": "<p>Totally agree, Josh!  But how on earth could an app (a potential violator) be considered a custodian?  Maybe I missed important things in the mega-paragraphs back there.  </p>\n<p>To be clear, given Facebook's transgressions in privacy in their Groups feature, and their being \"too big to discipline,\" I consider it a certainty that someday some app will try to do that.  The gray market for scurrilously acquired data, for use by scurrilous resellers, is too likely to be attractive. So though I'm no expert on security, this is a big deal to me.</p>",
        "id": 190784412,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584395417
    },
    {
        "content": "<p>Current assumption is that Carequality will define a trust framework that treats apps sort of like hospitals. So a custodian would say something like...</p>\n<ul>\n<li>\"If  Fakename Hospital issues a query, about Dave deB, I'll trust it and respond with his data.\"</li>\n<li>\"If the Fakename PHR issues a query, about Dave deB, I'll trust it and respond with his data.\"</li>\n</ul>",
        "id": 190784542,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584395518
    },
    {
        "content": "<p>The custodian here is the data holder that says \"I'll trust it and respond\" (e.g., a health system participating in the a Carequality-compliant network)</p>",
        "id": 190784635,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584395565
    },
    {
        "content": "<blockquote>\n<p>I consider it a certainty that someday some app will try to do that</p>\n</blockquote>\n<p>Not much that can be done about that</p>",
        "id": 190785485,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1584396062
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190785485\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190785485\">said</a>:</p>\n<blockquote>\n<p>Not much that can be done about that</p>\n</blockquote>\n<p>You mean about preventing it? That's my point.  But if you mean not much can be done to DEAL with it, that's what we're talking about, right? What CAN be done about it?</p>",
        "id": 190786006,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584396380
    },
    {
        "content": "<p>No, it is not what we are talking about here, what Josh is saying (and everyone agrees I think) is that app should not be trusted to do queries for data about anyone, but only for a specific patient at a time based on authorization granted by that specific person (that is the model currently used to connect  to individual providers using SMART-on-FHIR)</p>",
        "id": 190786475,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1584396713
    },
    {
        "content": "<p>This model does nothing to prevent malicious apps - once they convince a patient to grant access they have the data, that's the unavoidable trade off of trusting the patients</p>",
        "id": 190786748,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1584396859
    },
    {
        "content": "<p>Ultimately a custodian has the duty to deny access unless there is a reason to release information. The role of access control decision is to consider all the context (user, app, consent, business rules, etc). This all starts with the prime vector of the Purpose for which data are being asked for. A patient user can't ask for data under Treatment, that should be denied. But a Patient must be allowed access if they ask under Patient Requested purpose. A payer can't ask for data under Patient Requested. etc...  This purpose vector not the ONLY factor, but is the prime differentiator. The important part is that data must not be exposed unless there is authorized access, AND that same rule is used by the patient to get their own damn data. <br>\nTwo articles I have written yesterday and today<br>\nPatient vs Treatment purposeOfUse -- <a href=\"https://healthcaresecprivacy.blogspot.com/2020/03/custodian-access-control-decision.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2020/03/custodian-access-control-decision.html\">https://healthcaresecprivacy.blogspot.com/2020/03/custodian-access-control-decision.html</a><br>\nPublic Health -- <a href=\"https://healthcaresecprivacy.blogspot.com/2020/03/public-health-is-purposeofuse-pubhlth.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2020/03/public-health-is-purposeofuse-pubhlth.html\">https://healthcaresecprivacy.blogspot.com/2020/03/public-health-is-purposeofuse-pubhlth.html</a></p>",
        "id": 190856863,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584456114
    },
    {
        "content": "<p>I think the underlying question is - What prevents bad actors from lying about those attributes when querying?</p>",
        "id": 190857398,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1584456326
    },
    {
        "content": "<p>reality is ... trust fabric, which is usually a chain... and we all know the weakest link in a chain is the problem...   Which a well designed access control decision will consider the veracity of each security token.  Which is the point of NIST 800-63 three types of Level Of Assurance.</p>",
        "id": 190866549,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584459650
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"200498\">Brendan Keeler</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190857398\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190857398\">said</a>:</p>\n<blockquote>\n<p>I think the underlying question is - What prevents bad actors from lying about those attributes when querying?</p>\n</blockquote>\n<p>And that's trust in a nutshell, ain't it!</p>",
        "id": 190866565,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584459659
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190866549\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190866549\">said</a>:</p>\n<blockquote>\n<p>reality is ... trust fabric, which is usually a chain... and we all know the weakest link in a chain is the problem...   Which a well designed access control decision will consider the veracity of each security token.  Which is the point of NIST 800-63 three types of Level Of Assurance.</p>\n</blockquote>\n<p>Agree <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> and great discussion. It's why NIST 800-63 and digital identity is so important to this discussion. We need to know for sure the request is coming from the unique individual (using FIDO2 could help tie it to a unique carbon life form) rather than a rogue app, a service, or someone acting on the individual's behalf without their permission. </p>\n<p>Again, we see the goal as creating a set of contractual provisions that could be built into Carequality that also require technical certification from trusted third-parties (e.g., Kantara, SAFE, etc.). The combination of both could be the foundation for building contractual and technical trust in the ecosystem so a patient could voluntarily use their own credential to authenticate across multiple orgs.</p>",
        "id": 190867843,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1584460120
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190866565\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190866565\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"200498\">Brendan Keeler</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190857398\" title=\"#narrow/stream/179262-patient-empowerment/topic/Carequality.20-.20CARIN/near/190857398\">said</a>:</p>\n<blockquote>\n<p>I think the underlying question is - What prevents bad actors from lying about those attributes when querying?</p>\n</blockquote>\n<p>And that's trust in a nutshell, ain't it!</p>\n</blockquote>\n<p>Trust, yes... but not blind trust. Well designed security will enable appropriate and authorized access while forbidding inappropriate unauthorized access.</p>",
        "id": 190868816,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584460458
    },
    {
        "content": "<p>Very good; trust should never be blind. Can we make that an axiom? Must trust always be earned, with eyes kept wide open (aka not blind)?</p>",
        "id": 190872868,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584461989
    },
    {
        "content": "<p>As one of the authors working on the Draft Carequality FHIR technical IG linked above by <span class=\"user-mention\" data-user-id=\"270627\">@Dave Cassel</span> , I have found this thread very interesting and have a few comments to add for feedback.</p>\n<ol>\n<li>The patient access use case goes well beyond simple federation of identity, because each digital identity also needs to be accurately matched to an actual patient in medical records. This is implicit in the issuance of patient portal credentials at a particular site, but not when the identity provider function is performed by a different party. There is also an interplay between identity proofing practices and patient matching. If patient matching is based upon trusted identity attributes linked to a credential (and nothing else), then the assurance level of the initial identity proofing sets an upper bound on the certainty that the user holding the credential is actually the subject of the matching patient record.</li>\n<li>\"God\" mode is not the only approach being considered by Carequality. Authorization code flow is also part of the current draft. <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  mentioned bringing in identity claims from elsewhere. This powerful concept expands access and obviates the need for site-by-site patient portal credentials. To this end, we are also considering <a href=\"http://www.udap.org/udap-user-auth.html\" target=\"_blank\" title=\"http://www.udap.org/udap-user-auth.html\">UDAP Tiered OAuth</a>, a workflow that is also included in the current draft of the CARIN BB IG. Tiered OAuth allows the user/app to indicate its preferred, trusted OIDC identity provider as part of OAuth 2.0 authorization code flow. Back-channel communication of verified identity attributes is used to increase security. The data holder can request only the information it needs to achieve the required matching confidence and the user/patient gets greater control over what attributes may be shared. If it makes sense for the use case, validation of identity attributes could also leverage privacy-preserving techniques to further enhance privacy. Since it builds on the authorization code flow, it also provides an opportunity for the data holder to interact with the user directly, not just for authorization purposes, but also when the identity cannot be resolved to a specific patient based on the available attributes.</li>\n<li>Note that the trusted identity providers could be other data holders (e.g. providers or payers) on the network or standalone entities, as long as they follow the network policy. For example, a patient could use credentials from Hospital A and the client app of their choice to request data from Hospital C. They can even do this without sharing any identity information with the client app.</li>\n<li>I agree that making any of these approaches (especially \"god\" mode) work for patient access use cases is dependent on, among other things, being able to trust the identity claims regarding the patient to be matched and the authority of the app to request the patient's data. Creating this trust requires both a policy framework that provides sufficient assurance that operational practices of the participants follow the rules and the technical capabilities to communicate the necessary identity attributes. Carequality is working on both.</li>\n</ol>",
        "id": 191167837,
        "sender_full_name": "Luis Maas",
        "timestamp": 1584648159
    },
    {
        "content": "<p>Thanks Luis for the detailed and thoughtful response!</p>",
        "id": 191169497,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1584649031
    },
    {
        "content": "<p>Man, that's a webinar in a single Zulip message.  Thanks.</p>\n<p>In fact it would be fascinating to see all those words represented in illustrations. Brilliantly CLEAR illustrations, not contorted spaghetti. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 191195463,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584668308
    },
    {
        "content": "<p>excellent clarity by Lois, as I always find to be true... There is an augmentation of ( 2 ) where provisioning flows happen to bind a user provided identity to a healthcare organization patient identity. The common method of using postal mail with a secret code is likely to continue to be dominant, and has the advantage of being able to leverage postal mail fraud against any malicious use of the contents of the letter.  postal fraud is one of the strongest fraud mechanisms USA has.  The advantage of this is that the binding strength can be much higher than hoping to match personal traits, especially since personal traits are leaked all over the place.</p>",
        "id": 191236463,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584707924
    },
    {
        "content": "<p>I am not sure I would agree with the clause in ( 2 ) where the identity holder can choose which subset of their personal traits are shared for identity verification. a malicious individual could use this to get as weak of a binding as possible.</p>\n<blockquote>\n<p>The data holder can request only the information it needs to achieve the required matching confidence and the user/patient gets greater control over what attributes may be shared. If it makes sense for the use case, validation of identity attributes could also leverage privacy-preserving techniques to further enhance privacy. <br>\nI guess a data holder could set the bar very high, but then that defeats the feature being described as privacy preserving... privacy preserving seems unnecessary in light of the request for highly sensitive medical data that the data holder already has (presumably).</p>\n</blockquote>",
        "id": 191236896,
        "sender_full_name": "John Moehrke",
        "timestamp": 1584708175
    },
    {
        "content": "<p>Wow <span aria-label=\"clap\" class=\"emoji emoji-1f44f\" role=\"img\" title=\"clap\">:clap:</span><span aria-label=\"clap\" class=\"emoji emoji-1f44f\" role=\"img\" title=\"clap\">:clap:</span><span aria-label=\"clap\" class=\"emoji emoji-1f44f\" role=\"img\" title=\"clap\">:clap:</span></p>",
        "id": 191563166,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1585019381
    }
]