[
    {
        "content": "<p>I notice that <a href=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=491\" target=\"_blank\" title=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=491\">the FHIR button on the HL7 home page</a> leads directly to this:</p>\n<blockquote>\n<p><strong>DESCRIPTION</strong><br>\nFHIR is an interoperability standard intended to facilitate the exchange of healthcare information between organizations. </p>\n</blockquote>\n<p>In his closing talk I think I heard <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> say that the <strong>purpose</strong> of exchange between organizations was for patient benefit; and I know we're discussing (in the #Work-Group-Proposal thread) adding items to the spec that explicitly state the patient value of various things. </p>\n<p>Should we edit that description, adding \"for patient benefit\"?  Whatever wording is chosen should make it difficult for weasels to weasel out :-) e.g. by claiming \"I made this decision FOR you, for your benefit\" :-)   (But don't laugh; it's an ongoing argument.)</p>\n<p>The \"first time here?\" block at the top of <a href=\"http://hl7.org/fhir\" target=\"_blank\" title=\"http://hl7.org/fhir\">hl7.org/fhir</a> will also need a patient summary, to go along with the Executive Summary, Architect's Introduction, etc. </p>\n<p>Is this work for the nascent Patient Perspectives Work Group, or whatever it will be called?</p>",
        "id": 168346744,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560805023
    },
    {
        "content": "<p>writing a patient cover sheet is definitely for the patient group to do.</p>",
        "id": 168350230,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560807786
    },
    {
        "content": "<p>I'll chase down the 'between organizations' thing - that's wording for HQ and it's never actually been true</p>",
        "id": 168350248,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560807808
    }
]