[
    {
        "content": "<p>Hi,<br>\nHere are the revised edits I'd propose for the Charter.  Add some examples, cleaned up how some of the language flowed, added some stuff about PHRs and curating a directory of apps and endpoints.  $0.02<br>\n-aw</p>\n<ul>\n<li>Ensure that (appropriate) impacts on patients (positive and negative) are a consideration of the standards development process and are appropriately documented in as part of all relevant HL7 standards.</li>\n<li>Provide an entry-point and give support to patients, caregivers and their advocates with respect to both influencing and leveraging HL7 standards.</li>\n<li>Assist in the standards development process by providing patient subject matter expertise.</li>\n<li>\n<p>Provide patient centric guidelines for standards developers and implementers.<br>\n-- Example: Patient-centric checklist for FHIR apps<br>\n-- Example: Patient-centric use cases and scenarios.<br>\n-- Example: Patient-centric education materials regarding using interoperability protocols.</p>\n</li>\n<li>\n<p>Define, assist and/or coordinate standards and implementation guides related to interoperability with patient-facing systems. <br>\n-- Example:  Providing patient-centric feedback to EHRs regarding patient corrections, patient consents, patient generated data (including health concerns, device data, notes, questionnaire responses), initiated scheduling requests, etc.<br>\n-- Example:  Providing patient-centric feedback to insurers and the government regarding Payer Query APIs used in BlueButton initiative.</p>\n</li>\n<li>\n<p>Define, assist and/or coordinate standards and implementation guides related to interoperability between Personal Health Record Systems (PHR-S) <br>\n-- Example:  Promoting CCDA on FHIR adoption.<br>\n-- Example:  Import/export of social histories using a SocialHistory or SocialPost resource.<br>\n-- Example:  Accessibility guidelines for narrative statements in FHIR resources.</p>\n</li>\n<li>\n<p>Work with the Security and CBPP work groups to provide the patient voice to the interoperability security and privacy conversation.</p>\n</li>\n<li>Curate a directory of patient accessible health apps and FHIR endpoints.</li>\n</ul>",
        "id": 185848257,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1579201748
    },
    {
        "content": "<p>For your second-to-last bullet, suggest revising to \"Work with the Security and CBPP work groups to provide the patient voice...\" (always best to acknowledge who we'll be playing nicely with)</p>",
        "id": 185850518,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579203034
    },
    {
        "content": "<p>Updated.  <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 185851032,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1579203365
    },
    {
        "content": "<p>FYI <span class=\"user-mention\" data-user-id=\"214364\">@Ryan Howells</span> re: curated directory of consumer apps.</p>",
        "id": 185854829,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1579205637
    },
    {
        "content": "<p>Great draft.  My only suggestion would be to revise example in bullet 5 to include both claims data (e.g. BlueButton) and clinical data.<br>\nExample:  Providing patient-centric feedback to insurers and the government regarding Payer Query APIs used for claims data (e.g. BlueButton) and other APIs used for clinical data initiatives.</p>",
        "id": 185868555,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1579213598
    },
    {
        "content": "<p>Yea <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span>, as <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> mentions we (CARIN) are doing some work this year on curating a directory of consumer-facing apps. Let's chat to see where we might be able to work together and where we should host the website. We've been working on problem of \"listing the FHIR end points in a central place\" for more than two years now. We even had ONC support and it never went anywhere. It's a great idea (and sorely needed!) but we're a LONG way from having something built. The big reason is most of the EHR vendor systems are not architecturally set-up to provide individual client end points yet and none of the health plans have production-ready API servers (yet). In addition, some EHR vendors believe language in their client contracts would prohibit them from publishing their client's end points. The ONC proposed rule will help a TON once it goes final assuming the proposed language regarding the need for providers to publish their end points is included. The CMS rule has similar language.</p>",
        "id": 185868724,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1579213708
    },
    {
        "content": "<p>The topic has come up repeatedly in the patient empowerment group.  It's not quite the first question people ask, but it's certainly worthy of being included in a FAQ.  </p>\n<p>My thinking is that the Patient Empowerment workgroup can lend some help in this regard, by making sure requests are coming from registered patient advocacy groups and/or just developing some lists ourselves.  It's one thing when an industry group gets together to ask how to leverage laws that allow direct-to-consumer business models; it's another when patients simply start researching and trading lists of apps and endpoints amongst themselves.  </p>\n<p>Also, I'm thinking of just building a registry next month.  We have to connect Node on FHIR up with Touchstone to get our rebuild working through the testing pipelines again; so we have to start with some FHIR resource.  And Endpoint seems like it would be a great place to start.  We have need for this, and I'd rather have a microservice than no service at all.</p>",
        "id": 185873658,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1579217590
    },
    {
        "content": "<p>Update to the working group: A final draft proposal is now available in the Word doc.<br>\n<a href=\"https://docs.google.com/document/d/1HsCFPRi-zKYdz0O4-XKS_2Rk5QkWjkPg7Gb-TBh0ksg/edit\" target=\"_blank\" title=\"https://docs.google.com/document/d/1HsCFPRi-zKYdz0O4-XKS_2Rk5QkWjkPg7Gb-TBh0ksg/edit\">https://docs.google.com/document/d/1HsCFPRi-zKYdz0O4-XKS_2Rk5QkWjkPg7Gb-TBh0ksg/edit#</a></p>",
        "id": 187482108,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1580928281
    },
    {
        "content": "<p>She means the Google Doc: <a href=\"https://docs.google.com/document/d/1HsCFPRi-zKYdz0O4-XKS_2Rk5QkWjkPg7Gb-TBh0ksg/edit\" target=\"_blank\" title=\"https://docs.google.com/document/d/1HsCFPRi-zKYdz0O4-XKS_2Rk5QkWjkPg7Gb-TBh0ksg/edit\">https://docs.google.com/document/d/1HsCFPRi-zKYdz0O4-XKS_2Rk5QkWjkPg7Gb-TBh0ksg/edit#</a></p>\n<p>THANK YOU ABS!!  (You may not want to be called that but I heard it somewhere and in this moment of happiness, it's what you get from me)</p>",
        "id": 187482304,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1580928403
    }
]