[
    {
        "content": "<p>I'm doing a little side-research for the patient corrections thing to try to determine what systems are used to track chart correction cases.  I think the assumption in the patient corrections project is that the EHR is the system where chart correction tracking is managed.  However I've heard some organizations use external ticketing systems, since the EHR is only one of many systems that needs to be reviewed and updated (our Chart Correction module can also track tasks to update external systems, like DMS and PACS systems).</p>\n<p>I'm working on getting some data from health systems using Epic (we have a Chart Correction module, which is commonly, but maybe not universally used).  I'm curious if anyone knows about non-Epic health systems, and how common it is to have a system other than the EHR managing chart correction case tracking.</p>",
        "id": 220012192,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1608052949
    },
    {
        "content": "<p>(Thanks Cooper -- this research is super important, and understanding the prevalence of in-EHR vs externally-managed tracking will be a big help.)</p>",
        "id": 220026209,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1608059065
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191764\">Cooper Thompson</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Chart.20Correction.20tracking.20systems/near/220012192\">said</a>:</p>\n<blockquote>\n<p>I think the assumption in the patient corrections project is that the EHR is the system where chart correction tracking is managed.  However I've heard some organizations use external ticketing systems...</p>\n</blockquote>\n<p>I'm only one guy but I'm not aware of any assumptions about (or even mention of) where chart correction tracking will happen ... as far as I know we're agnostic about it, since the very beginning.  All we're doing is defining how the messaging goes back and forth. </p>\n<p>And yes, thanks much for that research, <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> !</p>",
        "id": 220067224,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1608081629
    },
    {
        "content": "<p>Of interest - From the web: <a href=\"https://www.albertahealthservices.ca/assets/info/hp/edu/if-hp-edu-meditech-mri-release-of-information-feature.pdf\">https://www.albertahealthservices.ca/assets/info/hp/edu/if-hp-edu-meditech-mri-release-of-information-feature.pdf</a> however they seem not to use the provided amendment tracking feature.</p>",
        "id": 220080499,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1608098205
    },
    {
        "content": "<p>It sounds like I incorrectly imputed an assumption to the patient corrections group.  What I was getting at is that the idea of re-using the existing EHR FHIR APIs may not always fit with existing organizational systems and processes.</p>",
        "id": 220123003,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1608129618
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> you are in the right place.  The patient request for correction connectathon track  uses the draft IG we developed that uses Task for this reason.  (affectionately know are the CORRECTATHON)  </p>\n<p>Details here: <a href=\"https://confluence.hl7.org/display/FHIR/2021-01+Patient+Empowerment%3A+Patient+Request+for+Corrections+to+their+Record\">https://confluence.hl7.org/display/FHIR/2021-01+Patient+Empowerment%3A+Patient+Request+for+Corrections+to+their+Record</a></p>\n<p>Alternatively and in addition, Abbie is interested in testing using the existing EHR FHIR APIs' new PUT functionality to see what can be accomplished there and we are excited to see what she uncovers.  </p>\n<p>And most importantly your research directly relates.  Thank you.</p>",
        "id": 220183576,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1608158362
    }
]