[
    {
        "content": "<p>Hello all and I hope this is the right group to post my question :)</p>\n<p>I would like to know if anybody has experiences/insights related to collecting experience measures (PREMs) or conducting any type of patient satisfaction surveys through FHIR Questionnaire.</p>\n<p>While I can find implementation guides and LOINC panels on PROMs, I couldn't find any guidance on PREMs and I wonder if I would need to implement such a questionnaire from scratch (hopefully not).</p>\n<p>Thanks in advance for your help!</p>",
        "id": 209504250,
        "sender_full_name": "Eduardo Ferreira",
        "timestamp": 1599654874
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192017\">@Nagesh Bashyam</span></p>",
        "id": 209506356,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599656198
    },
    {
        "content": "<p>Most of the projects that I have been involved were with PROMs , so not much experience in Patient empowerment, but would love to learn about them.</p>",
        "id": 209663991,
        "sender_full_name": "Nagesh Bashyam",
        "timestamp": 1599751810
    },
    {
        "content": "<p>I came to the realization that PREMs collection through Questionnaires may not be the best way, because Experience / Satisfaction reports are by nature anonymous, therefore no Patient should be associated to a given response. I will keep exploring possibilities for anonymous collection of such information and post here as I make progress</p>",
        "id": 210104191,
        "sender_full_name": "Eduardo Ferreira",
        "timestamp": 1600159475
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"247500\">Eduardo Ferreira</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Collecting.20Experience.20Measures/near/210104191\">said</a>:</p>\n<blockquote>\n<p>I came to the realization that PREMs collection through Questionnaires may not be the best way... </p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"247500\">@Eduardo Ferreira</span> godspeed to you.  I'm not trained enough to name these design principles but I'm sure a skilled sociologist or statistician will be able to.  I speak from personal experience on this as a recipient of such questionnaires:</p>\n<p>A significantly deeper issue is that by their nature, questionnaires too often gather a few data points, whose results are then <em>assumed by readers to accurately represent reality.</em>  This leads to bad (ill-informed) policy decisions downstream.</p>",
        "id": 210118055,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600170401
    },
    {
        "content": "<p>There's no easy answer to this - it requires opening the mindset of questionnaire designers AND downstream results-readers, few of whom are compensated based on how accurately their work serves the purpose.  So it's noble and absolutely appropriate for you and all of us to tune into this issue.  I mean, statistics produce models of reality, whose goal is to serve some result, and in this case we ought to make a point of checking in with the patient population in general (somehow) to ask \"How's it working out?  Are we getting the job done?\"</p>",
        "id": 210118333,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600170596
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Collecting.20Experience.20Measures/near/210118055\">said</a>:</p>\n<blockquote>\n<p>A significantly deeper issue is that by their nature, questionnaires too often gather a few data points, whose results are then <em>assumed by readers to accurately represent reality.</em>  This leads to bad (ill-informed) policy decisions downstream.</p>\n</blockquote>\n<p>I came across <a href=\"https://www.researchgate.net/publication/259462711_An_Alternative_to_Satisfaction_Surveys_Let_the_Patients_Talk\">this paper</a> a while ago which proposes an open-ended inquiry as an alternative to structured questionnaires as a way to improve the granularity of topics covered, response rates, delays, etc. while keeping the ability to compare across institution or time points.</p>\n<p>I am starting to think that this could be a feasible option for me since I am more interested in identifying pain-points for improvement of services/products than benchmarking across providers. It does create more burden on interpreting the responses from the implementer/provider side, but it could reduce the burden for patients especially those with limited education.</p>",
        "id": 210138637,
        "sender_full_name": "Eduardo Ferreira",
        "timestamp": 1600180901
    },
    {
        "content": "<p>QuestionnaireResponse.subject is optional.  As well, QuestionnaireResponse.subject can point to a resource that captures basic information but is still 'anonymous'.</p>",
        "id": 210140831,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600181807
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"247500\">Eduardo Ferreira</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Collecting.20Experience.20Measures/near/210138637\">said</a>:</p>\n<blockquote>\n<p>I came across <a href=\"https://www.researchgate.net/publication/259462711_An_Alternative_to_Satisfaction_Surveys_Let_the_Patients_Talk\">this paper</a> a while ago which proposes an open-ended inquiry as an alternative to structured questionnaires as a way to improve the granularity of topics covered, response rates, delays, etc. while keeping the ability to compare across institution or time points.</p>\n</blockquote>\n<p>Excellent!  I love love LOVE this, and I've never seen it before - it's a great find!  </p>\n<p>From the abstract (emphasis added):</p>\n<blockquote>\n<p>We propose to replace the standardized 27-item hospital version of the Consumer Assessment of Healthcare Providers and Systems (CAHPS) survey with 1-item questionnaire that asks <strong>\"What worked well and what needs improvement?\" </strong></p>\n<p>Sentiment analysis can take the responses to this single question and reconstruct a report on frequency of dissatisfied customers and <strong>reasons</strong> for dissatisfaction similar to reports received from longer surveys.  ... The CAHPS survey asks more leading questions, is less granular in its feedback, has lower response rate, has costly repeated reminders, and may not be as timely as sentiment analysis of a single, open-ended question. </p>\n</blockquote>\n<p>From personal experience, I'll shout HELL YES re \"less timely.\"  At one point during my multi-stay cancer I received a mailed CAHPS survey asking me about my recent visit with no clue WHICH visit they were even talking about.  </p>\n<p>I'm sure the objections would be \"But it's HARD to analyze unstructured responses,\" which amounts to \"Can't we please just run algorithms to generate less-useful information? It'd be so much easier.\" </p>\n<p>I love this. Thanks.</p>",
        "id": 210146507,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600184220
    },
    {
        "content": "<p>This is an example of my point around Questionnaire being overly used. Not all Questionnaires are bad. But, as this example shows, sometimes an IG would be better to define the patient input in terms of what is desired outcome , and a Questionnaire is provided as a reference implementation. Thus enabling applications to adjust to the patient, yet capturing the needed information.</p>",
        "id": 210147905,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600184884
    },
    {
        "content": "<p>That's always the best way to set a path.  Decide what information you need and then let the group collecting the information determine the best way to collect it (preferably in combination with someone that knows the design requirements)</p>",
        "id": 210148869,
        "sender_full_name": "David Pyke",
        "timestamp": 1600185381
    },
    {
        "content": "<p>Yes, indicate this is the data we're after, and the Questionnaire that can assist in capturing it.</p>",
        "id": 210191860,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1600204621
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Collecting.20Experience.20Measures/near/210147905\">said</a>:</p>\n<blockquote>\n<p>This is an example of my point around Questionnaire being overly used.</p>\n</blockquote>\n<p>Hi John, I'm not sure if I understand what you mean here, could you please elaborate a bit on why this is an over-use of the Questionnaire resource? PREMs collect information related to several dimensions of the Patient's experience of care, such as perception of provider culture, innovation and care provision itself, wouldn't a Questionnaire be a valid means of capturing this kind of information regardless of channel(s) used to collect the input itself?</p>\n<p>I am a newcomer so I'd appreciate your explanation :)</p>",
        "id": 210247162,
        "sender_full_name": "Eduardo Ferreira",
        "timestamp": 1600254809
    }
]