[
    {
        "content": "<p>Ah, what a task it is for a newcomer to HL7 FHIR to browse through all the tracks and find out what they are about! I just did that.</p>\n<p>I wanted to share my notes with the Patient Empowerment Work Group, as some of you may be in a similar situation as I was in, and appreciate something like this being available. Take a look at <a href=\"https://docs.google.com/document/d/16M5OdFmde_9IUPRneCGwcrpzEuPyl3yqyJszyUONIGA/edit?usp=sharing\" title=\"https://docs.google.com/document/d/16M5OdFmde_9IUPRneCGwcrpzEuPyl3yqyJszyUONIGA/edit?usp=sharing\">https://docs.google.com/document/d/16M5OdFmde_9IUPRneCGwcrpzEuPyl3yqyJszyUONIGA/edit?usp=sharing</a>. The document lists the Connectathon tracks and my views and guesses on how the Patient Empowerment Work Group could potentially get involved.</p>",
        "id": 195857038,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1588260837
    },
    {
        "content": "<p>Please note that I did this first for myself, and from my own perspective. Most notably, due to lack of time, I did not get into details of the tracks that seemed too US specific for me. I would still find it really valuable if someone could outline the contents of (some of) those tracks in \"plain English\".</p>",
        "id": 195857331,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1588260941
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194993\">@Sandra Vance</span> Something for us to perhaps consider for next round - a high-level \"newbie\" description of the purpose and objectives of the track before we jump into the gnarly details of the scenarios?</p>",
        "id": 195858418,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588261372
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Connectathon.2024/near/195858418\" title=\"#narrow/stream/179262-patient-empowerment/topic/Connectathon.2024/near/195858418\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"194993\">Sandra Vance</span> Something for us to perhaps consider for next round - a high-level \"newbie\" description of the purpose and objectives of the track before we jump into the gnarly details of the scenarios?</p>\n</blockquote>\n<p>DO you mean for the track orientation template??</p>",
        "id": 195860550,
        "sender_full_name": "Sandy Vance",
        "timestamp": 1588262230
    },
    {
        "content": "<p>I would have appreciated a separate page from the Connectathon main page, including a short, newbie-friendly description of what each track is about.</p>",
        "id": 195860834,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1588262332
    },
    {
        "content": "<p>Right now some of the tracks were quite well documented, some others less so (at least from the newbie point-of-view, and it took a while to dig though to get an idea of the contents.</p>",
        "id": 195861066,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1588262405
    },
    {
        "content": "<p>Even for the well documented tracks, there was quite a bit of clicking to go through them.</p>",
        "id": 195861160,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1588262448
    },
    {
        "content": "<p>I do understand it might be difficult to describe each track from each possible perspective. :) But a paragraph in the template \"Short description for outsiders\", which could then potentially extracted to a separate page?</p>",
        "id": 195861378,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1588262525
    },
    {
        "content": "<p>Zoom Info for each track: <a href=\"https://confluence.hl7.org/display/FHIR/2020-05+Zoom+Info+for+Each+Track\">https://confluence.hl7.org/display/FHIR/2020-05+Zoom+Info+for+Each+Track</a></p>\n<p>I know several were interested in this: SDOHCC and Care Coordination Connectathon 24 Schedule:<br>\n<a href=\"https://docs.google.com/spreadsheets/d/1hFmq2jvEwxLabb0dy3B09dZkwkDirfxH7XpYcR15Qpc/edit#gid=0\">https://docs.google.com/spreadsheets/d/1hFmq2jvEwxLabb0dy3B09dZkwkDirfxH7XpYcR15Qpc/edit#gid=0</a></p>",
        "id": 197346112,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1589321122
    },
    {
        "content": "<p>Checking in with the group to say that I've reached out to leadership of Bulk Data, SANER and Collaboration for Ophthalmic Care Tracks.  I would like to spend time with Collaboration group but they will be woking mostly in Australia.  I am anticipating I will spend most of my time with SANER.  Should we be reporting in here to this stream as we learn of something interesting or have questions during a track?</p>",
        "id": 197413674,
        "sender_full_name": "Terrie Reed",
        "timestamp": 1589377175
    },
    {
        "content": "<p>I too am working inside SANER. although my role is as testing, so might not always take that hat off and put the patient hat on.. so good to have another set of eyes.   Note that SANER is got no patient interaction, doesn't mean there is no patient impact.</p>",
        "id": 197422169,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589380849
    },
    {
        "content": "<p>Thanks John.  It's good you will be there to test.  Maybe I can sneak you questions on the side!  I will be looking for indirect patient impact.  I am an expert on medical device reporting so I would like it to be included in the response.  We certainly have seen the gaps in device tracking and the impact on patient care in the last few months.</p>",
        "id": 197429981,
        "sender_full_name": "Terrie Reed",
        "timestamp": 1589384011
    },
    {
        "content": "<p>device tracking is not part of the use-cases SANER is addressing.</p>",
        "id": 197431359,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589384508
    },
    {
        "content": "<p>John, <br>\nI know but I want to understand what you are doing for future work.  <br>\nAre you counting ventilators or beds as part of the reporting?<br>\nAlso, is there a SANER confluence page or Zulip Stream?</p>",
        "id": 197431641,
        "sender_full_name": "Terrie Reed",
        "timestamp": 1589384589
    },
    {
        "content": "<p>yes the supply of ventilators and beds is in scope</p>",
        "id": 197431801,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589384632
    },
    {
        "content": "<p>the scope is the COVID-19 reports to the CDC and also FMEA</p>",
        "id": 197431857,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589384646
    },
    {
        "content": "<p>all summary data about the location capability</p>",
        "id": 197431891,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589384665
    },
    {
        "content": "<p>ok.  Great.  Ventilators have UDIs that could be scanned for the reporting.  Future use case !</p>",
        "id": 197439352,
        "sender_full_name": "Terrie Reed",
        "timestamp": 1589387589
    },
    {
        "content": "<p>the reports are just counts. Not inventory</p>",
        "id": 197440493,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589388104
    },
    {
        "content": "<p>I know.</p>",
        "id": 197443876,
        "sender_full_name": "Terrie Reed",
        "timestamp": 1589389430
    },
    {
        "content": "<p>Yes please report  here!  Good!</p>",
        "id": 197479911,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1589405131
    },
    {
        "content": "<p>I am starting out on questionaire track and Mikael is here as well.  Things I learned (perhaps relearned because I am old):<br>\n-there is a Patient Reported Outcomes implementation guide that uses the FHIR resources questionaire and questionaire response:  <a href=\"http://hl7.org/fhir/us/patient-reported-outcomes/2018Sep/index.html\">http://hl7.org/fhir/us/patient-reported-outcomes/2018Sep/index.html</a></p>\n<ul>\n<li>questionaires have pretty fancy capabilities like conditional questions, etc.</li>\n<li>key implementation guide is SDC - structured data capture</li>\n<li>there will be specific presentations on the questionaire zoom onhttps://zoom.us/j/6192821589<br>\nPlanned Break-out sessions so far    (from  <a href=\"https://docs.google.com/spreadsheets/d/1YhFovZNNTABeNeBCKH8JUc5CKAnRp7Mo9mlZzH2D8UQ/edit#gid=0\">https://docs.google.com/spreadsheets/d/1YhFovZNNTABeNeBCKH8JUc5CKAnRp7Mo9mlZzH2D8UQ/edit#gid=0</a>)<br>\nTime    URL Description<br>\nWed: 5:30pm Eastern     Compositional Questionnaires<br>\nThur: 10:30-12 Eastern      Intro to SDC<br>\nFri: 10:30-12 Eastern       Overview of various form builders &amp; renderers<br>\nThur: 5:00pm Eastern        Regular SDC call</li>\n</ul>",
        "id": 197481043,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1589405859
    },
    {
        "content": "<p>In the main kickoff session, learned that the gotowebinar will be open the whole time, has some general education and announcements scheduled to take place there as well as track report outs Tracks are signing up for track report out times  not all have yet.<br>\nHere is the main gotowebinar schedule: <a href=\"https://docs.google.com/spreadsheets/d/1P4EPT2Hi3PI9eB-TYPj5xYHzInZS4ixd/edit#gid=1512697744\">https://docs.google.com/spreadsheets/d/1P4EPT2Hi3PI9eB-TYPj5xYHzInZS4ixd/edit#gid=1512697744</a></p>",
        "id": 197481552,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1589406179
    },
    {
        "content": "<p>We will be holding our regular conference call but postponing one hour:   May 14th, 2020, 2PM Eastern.   <br>\n Web Meeting Info<br>\n<a href=\"https://global.gotomeeting.com/join/322275573\">https://global.gotomeeting.com/join/322275573</a> </p>\n<p>You can also dial in using your phone. <br>\nUnited States: +1 (872) 240-3212 </p>\n<p>Access Code: 322-275-573 </p>\n<p>New to GoToMeeting? Get the app now and be ready when your first meeting starts: <br>\n<a href=\"https://global.gotomeeting.com/install/322275573\">https://global.gotomeeting.com/install/322275573</a></p>",
        "id": 197481798,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1589406359
    },
    {
        "content": "<p>Wanted to share with the group that the SANER Virtual Tour that happened at 3pm today (right after our patient empowerment call) was really helpful to make their goals clear.  My take on it is that they are trying to get together as many IT partners as possible to collaborate on collecting and transmitting the data coming from various internal applications so that this can be reported once (via FHIR?) to many public health agencies.  I know requirements to report the same information multiple times has  been a burden on hospitals for a long time so I'm glad to see this is happening.  As I mentioned on the call, hospital procurement/supply chain is missing from the connectathon but, one of my takeaways is to reach out and advocate for them to join this work.  Patient perspective is what Virginia mentioned on our call - if the numbers generated here are accurate, then it will help supply chain, biomedical engineering and clinical teams to have the resources needed to treat patients more effectively.</p>",
        "id": 197619330,
        "sender_full_name": "Terrie Reed",
        "timestamp": 1589491006
    },
    {
        "content": "<p>Thanks! Would this be of value for certain of us to listen to, if it was recorded, or did you pretty much sum it up?</p>",
        "id": 197619466,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1589491083
    },
    {
        "content": "<p><a class=\"stream\" data-stream-id=\"235632\" href=\"/#narrow/stream/235632-Vital-Signs\">#Vital Signs</a>  I think this track is interesting to patient empowerment.  Their scenario includes patient obtained vital sign measurements being sent from patient to clinician.    In addition, I think that app developers have expressed frustration in the different ways each ehr vendor  represents vital sign details.</p>",
        "id": 197623386,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1589493307
    },
    {
        "content": "<p>amen. but it's also institutionally dependent which is a bigger mountain to climb. Since what hospital is going to change the way they record vital signs to make patients happy?</p>",
        "id": 197624099,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1589493809
    },
    {
        "content": "<p>I'm surprised to hear that FHIR doesn't have a normalized way to express vital signs. Wouldn't that be a show-stopper?  I don't know any details but in my ignorance I'd hope there could at LEAST be some sort of transform to a norm for incoming data. </p>\n<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> by app developers, do you mean the developers of personal health apps and device apps, like Apple heart rate data vs the HR data from an Omron blood pressure cuff or a Fitbit?</p>",
        "id": 197672515,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1589538345
    },
    {
        "content": "<p>Going back two weeks ago:   (Maybe you will require that I post this in a Confluence document or blog post)</p>\n<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Connectathon.2024/near/195858418\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"194993\">Sandra Vance</span> Something for us to perhaps consider for next round - a high-level \"newbie\" description of the purpose and objectives of the track before we jump into the gnarly details of the scenarios?</p>\n</blockquote>\n<p><em>YES!</em></p>\n<p>Having said that, though, we'd have to think it through, because while \"orientation for newbies\" is good for growing participation (\"democratizing\"), the last thing I'd want to do is get in the way of people who are working hard to get things done. My impression is that HL7 is very much about getting things done. </p>\n<p>Perhaps we'll develop some method or template a track can apply when it gets to a point where it wants to invite the world, or when the world comes knocking - but I wouldn't mandate that every track must do this. (Except, I do firmly believe there's no excuse to not have at LEAST a one-sentence description so that earnest browsers have SOME clue whether they should be interested.)</p>\n<p>Socialization / explaining is real work (I've made a career out of it), so it must be budgeted for,  with time or funds. My opinion is that in cases where HL7 wants strategically to broaden the public usefulness and usability of its work products, then this is something worth talking about.  The discussion will require thinking thoughtfully (if you know what I mean), for some time.</p>",
        "id": 197673194,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1589538888
    },
    {
        "content": "<p>dave, there are implementation guides that do nail down vital signs. It is in implementation guides where these kind of constraints properly exist. US-Core is the usa example of this. And basic vital signs are already regulated in this US-Core form.</p>",
        "id": 197684005,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589546304
    },
    {
        "content": "<p>on the readability of implementation guides... as we learn of good templating, we impose it. This was done by the security workgroup two years ago, when we required a Security Considerations section. I have recommended other sections, but mandates are hard to ( a ) get agreement on what the mandate means, ( b ) get agreement that it is needed in all cases, and ( c ) policing that it happens.  Everyone should already be required to explain the \"problem this specification is addressing\", but often times even that is not said at all, as there are often specificaitons that just define their solution to an unmentioned problem... the method for stopping this, is your power as an HL7 member to submit ballot comments demanding that they explain the patient perspective. Then socialize that ballot comment to the others in the patient empowerment workgroup, they will likely agree  and add their own constructive comment (vote = negative). And change happens</p>",
        "id": 197684659,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589546651
    },
    {
        "content": "<p>emphasis:  the method for changing this, is your power as an HL7 member to submit ballot comments demanding (vote=negative) that they explain the patient perspective. Then socialize that ballot comment to the others in the patient empowerment workgroup, they will likely agree and add their own constructive comment (vote = negative).  And change happens</p>",
        "id": 197684938,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589546818
    },
    {
        "content": "<p>FHIR <em>does</em> have a normalized way to express vital signs - at least the basic information.  It's one of the few places in the spec where we mandate specific codes and the only place where we mandate units of measure at the 'international' level.  - So it would be best to ask what was meant by 'normalized'.  (We don't try to standardize things like cuff size, sitting or standing, type of thermometer, etc.)</p>",
        "id": 197689379,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589549000
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Connectathon.2024/near/197684005\">said</a>:</p>\n<blockquote>\n<p>dave, there are implementation guides that do nail down vital signs. It is in implementation guides where these kind of constraints properly exist. </p>\n</blockquote>\n<p>Well then I'm puzzled because <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> said \" I think that app developers have expressed frustration in the different ways each ehr vendor represents vital sign details\" and  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  said \" Since what hospital is going to change the way they record vital signs to make patients happy?\"</p>",
        "id": 197716336,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1589559906
    },
    {
        "content": "<p>There's a difference between FHIR defining a standard and systems using it?</p>",
        "id": 197719102,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589560958
    },
    {
        "content": "<p>what lloyd said....</p>",
        "id": 197720610,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589561631
    },
    {
        "content": "<p>AND, many device vendors and app developers are not yet looking to FHIR or US-Core. Many statements you see like that are from their historic experience (and from some providers that have not yet rolled out FHIR based api.)</p>",
        "id": 197720749,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589561694
    },
    {
        "content": "<p>in theory, there is no difference between theory and reality, in reality there is</p>",
        "id": 197720821,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589561733
    },
    {
        "content": "<p>standards development tends to take a few years to come to the definition of a standard (US-Core took 8 years to be published for FHIR R4). It takes minimum of 5 years for a standard to be widely implemented in the real-world.</p>",
        "id": 197721079,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589561858
    },
    {
        "content": "<p>Right? Give us the statistics on PostScript standard?</p>",
        "id": 197721236,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589561935
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Connectathon.2024/near/197721236\">said</a>:</p>\n<blockquote>\n<p>Right? Give us the statistics on PostScript standard?</p>\n</blockquote>\n<p>Funny you should mention that.  It was a real can of worms, complicated by the fact that Adobe (sole author of the standard) put hidden secret stuff in its own implementation that it wouldn't disclose, some of which didn't conform to the spec but became the de facto standard.  </p>\n<p>The power dynamic there, btw, is that Adobe / Apple / Aldus (Pagemaker) became what people used, and thus became the behavior that people expected clones to replicate. There was a black art in conforming to Adobe RIP behavior which was not just the spec.</p>",
        "id": 197723244,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1589562833
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Connectathon.2024/near/197721079\">said</a>:</p>\n<blockquote>\n<p>standards development tends to take a few years to come to the definition of a standard (US-Core took 8 years to be published for FHIR R4). It takes minimum of 5 years for a standard to be widely implemented in the real-world.</p>\n</blockquote>\n<p>Perhaps my disconnect in this sub-thread is that \"app developers expressed frustration\" shows that those app developers aren't savvy about what it takes to transform those different formats into a normalized one?</p>",
        "id": 197723579,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1589562973
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Connectathon.2024/near/197723244\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Connectathon.2024/near/197721236\">said</a>:</p>\n<blockquote>\n<p>Right? Give us the statistics on PostScript standard?</p>\n</blockquote>\n<p>Funny you should mention that.  It was a real can of worms, complicated by the fact that Adobe (sole author of the standard) put hidden secret stuff in its own implementation that it wouldn't disclose, some of which didn't conform to the spec but became the de facto standard.  </p>\n</blockquote>\n<p>And BOY am I sparing y'all a PILE of stories.  There were some mighty frustrated people trying to conform to all that \"warts and all\" stuff, culminating in 1991 with Apple &amp; Microsoft ganging up on Adobe over the \"Type 3\" vs \"Type 1\" font format (they created Royal, which went on to become TrueType), ultimately leading to the spectacle of John Warnock in tears on stage about the tragedy of his (secret) beautiful format not being adopted regardless of price.  From <a href=\"https://outsideinnovation.blogs.com/pseybold/2010/04/jon-seybold-father-of-desktop-publishing-comments-on-the-appleadobe-feud.html\">this 2010 interview</a>:</p>\n<blockquote>\n<p>at the last minute, Apple proposed that Microsoft adopt its TrueType format and font library. By itself, Apple would have a hard time establishing a standard. But, together Apple and MS could establish an alternative standard. Common fonts and font technology on Macs and PCs. Adobe frozen out. That made sense to Microsoft.</p>\n<p>Bill announced the deal at Seybold Seminars San Francisco. Adobe was completely blind-sided. This was devastating. Not only did the Apple/Microsoft deal threaten Adobe’s business model, it meant that typography—something very precious to John Warnock—would be in the hands of people he considered to be philistines.</p>\n</blockquote>\n<p>Okay, enough... I told you I'm sparing tons of dirty details about graphic arts standards...</p>",
        "id": 197724780,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1589563575
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Connectathon.2024/near/197719102\">said</a>:</p>\n<blockquote>\n<p>There's a difference between FHIR defining a standard and systems using it?</p>\n</blockquote>\n<p>Yeahbut I figured perhaps naively that people who come to a connectathon about standard X would be wanting to USE standard X</p>\n<p>Or maybe that is true but they still grumble about what it takes. (In essence, THEY may grumble about \"You mean other people aren't already doing this?? It would make it SO much easier for ME to adopt, if everyone else already had\")</p>",
        "id": 197725067,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1589563717
    },
    {
        "content": "<p>I didn't hear the grumbling, so I can't say for sure :)</p>",
        "id": 197729410,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589565630
    },
    {
        "content": "<p>I was specifically talking about the fhir experience.  In fhir implementations, I see this as an issue.</p>",
        "id": 197759773,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1589581884
    },
    {
        "content": "<p>Some other patient facing stuff I got out of these two days: PACIO included patient reported outcomes - questionaire.  Gravity had numerous patient actors.  Had need for a more person centered care plan.  Virtual connectathon more attainable for patient participants and less intimidating to lurk. - lurking more effective too.  Need a bit more help getting around but I think we figured it out OK.   Was also nice to have presence on track(s).</p>",
        "id": 197760061,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1589582116
    },
    {
        "content": "<p>Some quick feedback that I will put in the survey.  I enjoyed participating virtually.  I thought the organizers and team leaders did  a great job having a Central ongoing webinar and individual zoom meetings for track leads.  I was also grateful for this Zulip stream and the Zulip streams for Bulk Data and COVID-19 response.  As an observer,  I could check Zulip and the main schedule to know check in times for the two groups I was following (Bulk Data and SANER), could lurk and comment on conversations and could take educational sessions and see group presentations as needed.  I think I got more value from this meeting than I would have in a physical experience given how dizzying it can be to attend any conference with multiple tracks.</p>\n<p>Bulk Data - agree in need to monitor this group for impacts on consent and patient privacy - how to monitor groups that create implementation guides for specific use cases?<br>\nSANER - would be interested in debriefing on our patient empowerment call.  I know that the specific case is for today's emergent situation.  Seems like more discussion needed an opportunity for applying FHIR to systems within the hospitals that are not  EHRs (e.g. ERP systems, internal monitoring) but have significant impact on information to ensure patient safety.</p>",
        "id": 197951916,
        "sender_full_name": "Terrie Reed",
        "timestamp": 1589815987
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Connectathon.2024/near/197624099\">said</a>:</p>\n<blockquote>\n<p>amen. but it's also institutionally dependent which is a bigger mountain to climb. Since what hospital is going to change the way they record vital signs to make patients happy?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span>  <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> have you guys seen provider variances?  I thought it was just the EHRs.  Thinking US with Argonaut/US Core</p>",
        "id": 198122807,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1589920362
    },
    {
        "content": "<p>Note that the vital signs profiles go well beyond the international profile that is in FHIR Core. EG: the core international profile allows for weight in kg, lb, g (and eventually oz) and the vitals profile restricts that further to kg. It also requires some specialized extensions and breaking up of a pre coordinated code to post coordinated.</p>",
        "id": 198128436,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1589923265
    },
    {
        "content": "<p>Would be interested in the provider variance as well.</p>",
        "id": 198128463,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1589923280
    },
    {
        "content": "<p>Don't have an easy way to analyze all the data we have - and we most definitely do not try to validate it against the vital signs profile when we import it.</p>",
        "id": 198137486,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589929085
    },
    {
        "content": "<p>Eyeballing some cases I can see respiratory rate with a unit <code>br/min</code> (instead of <code>/min</code>)</p>",
        "id": 198137546,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589929153
    },
    {
        "content": "<p>Blood pressure without a unit (not 100% that this is due to the data though)</p>",
        "id": 198137693,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589929221
    },
    {
        "content": "<p>(^ these two are from EAMC - Cerner)</p>",
        "id": 198138161,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589929509
    },
    {
        "content": "<p>Looked at one each of MEDITECH, NextGen, eCW, did not see anything out of line</p>",
        "id": 198138971,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589930038
    },
    {
        "content": "<p>..and one Epic, same</p>",
        "id": 198139015,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589930055
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>  for the br/min is it that or {br}/min? Which is another question... are the annotations allowed since those don't affect computation in ucum?</p>",
        "id": 198196336,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1589980614
    },
    {
        "content": "<p>If you can send me some x-request-ids in PM or email I can log something to investigate</p>",
        "id": 198197632,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1589981225
    },
    {
        "content": "<p>or whatever info you can provide/if you have other info to try to pin down some of the source data :)</p>",
        "id": 198197695,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1589981253
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> : the unit code is <code>{Breaths}/min</code>, the unit name is <code>br/min</code></p>",
        "id": 198200936,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589982695
    },
    {
        "content": "<p>Ok, I may get clarification on if the annotations are allowed or not...</p>",
        "id": 198201629,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1589982991
    },
    {
        "content": "<p>My \"pure\" take is that they should be allowed. They don't change the meaning... I think we don't have an easy way to express this in a FHIR valueset though :-)</p>",
        "id": 198201715,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1589983035
    },
    {
        "content": "<p>That's what I would expect as well but it's not called out either way that I can see - asked over here since we already had an ongoing vitals unit conversation: <a href=\"#narrow/stream/179166-implementers/topic/Core.20vitals.20Units\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Core.20vitals.20Units</a></p>",
        "id": 198205943,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1589984709
    },
    {
        "content": "<p>It's very hard to express a value set that allows arbitrary bracketed content.  It also makes life harder for the apps trying to match on the units.  Given that the 'code' is for computation, not display, why are we injecting that complexity?</p>",
        "id": 198211085,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589986890
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> . I am coming to the conversation late so not sure if i completely understand the question. I do know some EHRs have multiple choice on which units to use and the provider makes that choice when they enter the data. Where it becomes really confusing for a patient is when they are pulling their data from multiple sources and those sources use different units. For example, if one provider gives me my weight in pounds and another gives me my weight in kilograms, it is really difficult to view trends. I was also really surprised to see how many systems use kilograms for weight in the US.</p>",
        "id": 198211278,
        "sender_full_name": "Debi Willis",
        "timestamp": 1589986963
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  the argument I usually get from my terminologists is that you should try to be as precise as you can to still be accurate with codes</p>",
        "id": 198211977,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1589987280
    },
    {
        "content": "<p>ucum is a bit different than most terminologies though with the annotation concept</p>",
        "id": 198212114,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1589987331
    },
    {
        "content": "<p>Annotations have no meaning - so there's no increased \"accuracy\" when you specify them.</p>",
        "id": 198214482,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589988237
    },
    {
        "content": "<p>They're there to make the humans happy - but we have Quantity.unit for that purpose.</p>",
        "id": 198214595,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589988263
    },
    {
        "content": "<p>When we talk about the idiosyncrasies of the data across all the different EHR systems used by different providers and the challenges this presents to patients who are trying to aggregate and understand their clinical data via a variety of apps and/or desktops/laptops aren't we really talking about the need to normalize the data?</p>",
        "id": 198216610,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1589989059
    }
]