[
    {
        "content": "<p>Someone asked on the call about the location of clinFHIR - take a look at <a href=\"http://gb2.clinfhir.com/#id1609884201264\">http://gb2.clinfhir.com/#id1609884201264</a> for an example of a graph I created for scenario 1.</p>\n<p>To download it into your browser, click the 'Show download screen' and either 'clone' or 'copy' (clone creates new resource id's so probably the best for now).</p>\n<p>It's the first scenario and has 3 views representing the stages of the scenario- should be self explanatory (I hope :) )</p>\n<p>Perhaps the best overall view is the 'Show project summary' link in the left pane - this shows all the resources in the project broken down by view. If you click on the resource you will see the FSH for that resource in each view</p>\n<p>Once downloaded, you can make any changes you like. If you save back to the library it will be a new library entry (You will update the original project if you selected 'copy' during download.</p>\n<p>I also saved it to the hapi R4 server - patient id is cfsb16098876468130 . I saved each view in turn so that the Task versions would update appropriately.</p>\n<p>If you load <a href=\"http://clinfhir.com/\">clinFHIR</a> with the data server set to hapi4,  then the Patient viewer module, then select by id you'll see the resources. </p>\n<p>If you check out the task, you'll see the versions there as well...</p>",
        "id": 222669787,
        "sender_full_name": "David Hay",
        "timestamp": 1610586365
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> I wish clinfhir let me edit json directly as well as fsh</p>",
        "id": 222806012,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1610671621
    },
    {
        "content": "<p>Well, once the mitre team have got an API for goFSH it may be possible, but why? FSH is much easier to understand. What are you trying to do that  would be easier in json?</p>",
        "id": 222888914,
        "sender_full_name": "David Hay",
        "timestamp": 1610730092
    },
    {
        "content": "<p>Well I want to use part of a json sample in my editing.  I wanted to grab stuff from HAPI or patientviewer and then in Clinfhir (resources not created via clinfhir)</p>",
        "id": 222906084,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1610736715
    },
    {
        "content": "<p>Can I use Clinfhir to create a document that includes a specific pdf file I have?  Like create a DocumentReference but include an actual referenced document?</p>",
        "id": 222906252,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1610736777
    },
    {
        "content": "<p>I know I am greedy :)</p>",
        "id": 222906290,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1610736792
    }
]