[
    {
        "content": "<p>Everyone who's talked to me about this at (and since) last June's DevDays, I know you may have already said \"I do that!\"  At the time I didn't have context for it to sink in, nor a place to catalog it. Repeat it please!</p>\n<hr>\n<p><span class=\"user-mention\" data-user-id=\"251396\">@John Keyes</span> <span class=\"user-mention\" data-user-id=\"251190\">@Kristina Sheridan</span>  I saw the announcement post today about <a href=\"http://developer.commure.com\" target=\"_blank\" title=\"http://developer.commure.com\">developer.commure.com</a>, \"The FHIR-native open Platform for healthcare developers.\"</p>\n<p>I'm clueless enough to be intensely curious about what steps lie between an interface like this (or perhaps 1upHealth) and someone like me being able to create my own set of \"datums\" that I want to track, to pull down into my own dashboard, a la Sheridans or Mike Morris.  </p>\n<p>That may be a hopelessly vague desire but let's talk about it.  I speculate that functions like this would be needed:</p>\n<ul>\n<li>What stuff do you want to retrieve?  (Specify, or browse a generic list, or browse what's available at your specific providers)</li>\n<li>What do you want to do with it?  (Track its value over time (e.g. my A1c), graph it with other variables, just capture in a diary...)</li>\n<li>Offer some standard packages that normal people want to do - perhaps in a free / lite version</li>\n<li>But also (perhaps in paid version) enable someone like y'all to create their own dashboard</li>\n</ul>\n<p>I could go on and on but the real question is - okay, things like Commure handle a first step, but it's not ready for use by (e.g.) my sister who's tracking Mom's stuff.</p>",
        "id": 187610882,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1581046836
    },
    {
        "content": "<p>The Commure \"about\" page says </p>\n<blockquote>\n<p>**Built by doctors and developers <br>\nfor doctors  and developers.**</p>\n<p>We built this platform to support the work of software engineers and teams who are looking to move the needle in healthcare. We built it for doctors who code and who are intimately acquainted with the challenges their profession faces in the day to day. ...</p>\n</blockquote>\n<p>This is fine with me. I'm asking, what sort of layer would need to be bolted on to enable one particular use case - the consumer/patient with a significant need unanswered by mass market apps?</p>",
        "id": 187611054,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1581047075
    },
    {
        "content": "<p>Could be wrong but quick read suggests it's not patient app focused (HCO and provider apps) and that 1up, Apple, HumanAPI all still better for patient use case, if youre not DIY</p>",
        "id": 187613565,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1581051200
    },
    {
        "content": "<p>Some light reading about the three trust paradigms of healthcare for you, Dave: <a href=\"https://link.medium.com/wv9nouzmS3\" target=\"_blank\" title=\"https://link.medium.com/wv9nouzmS3\">https://link.medium.com/wv9nouzmS3</a></p>",
        "id": 187613615,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1581051284
    },
    {
        "content": "<p>This is fascinating: <a href=\"https://medium.com/@gcvp/announcing-commure-a-system-of-innovation-for-healthcare-5539d82989f\" target=\"_blank\" title=\"https://medium.com/@gcvp/announcing-commure-a-system-of-innovation-for-healthcare-5539d82989f\">\"We built it for doctors who code \"</a>. Doesn't seem like patients (who code) are also part of their target market (which is fine, of course; it's just interesting to note).</p>\n<p>Dave, it may well be that this platform could be used to build useful patient-focused web applications. I need to take a little more time to understand what added value their APIs and platform provide.</p>\n<p>Also, as an independent app developer, I tend to be leery of two things: </p>\n<ol>\n<li><a href=\"https://developer.commure.com/docs/platform/pricing\" target=\"_blank\" title=\"https://developer.commure.com/docs/platform/pricing\">Enterprise-style pricing models</a> (\"contact us for pricing\"), rather than transparent published pricing. </li>\n<li>Adding too many third-party dependencies to my app. Platform services have a history of changing or going away.</li>\n</ol>\n<p>That said, this still looks quite interesting, and I'll be watching what they do.</p>",
        "id": 187639768,
        "sender_full_name": "John Keyes",
        "timestamp": 1581083028
    },
    {
        "content": "<p>Brendan, Great overview article on where  interoperability is today!</p>",
        "id": 187658585,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1581095593
    },
    {
        "content": "<p>Thanks Bart!</p>",
        "id": 187724271,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1581182277
    }
]