[
    {
        "content": "<p>I'm going to float an idea here without being sure what it might be.  I have many sub-questions but I'll just ask this:</p>\n<p>Are we (FHIR) at a stage where it would make sense - or maybe even be important - to seek consumer/patient/citizen/individual perspectives, ongoingly (within projects or workgroups) or overall?</p>\n<p>I'm chatting with <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> who thinks maybe so, particularly in certain topics; earlier today <span class=\"user-mention\" data-user-id=\"214364\">@Ryan Howells</span> talked about CARIN's trust framework, which echoed something else Mark mentioned. </p>\n<p>One reason I wonder about this is that out of all the things I hear discussed at DevDays, the only worrying things are stuff that the world of \"sophisticated patients\" (if I can call them that) would be appalled at - for instance the idea of a chatbot that runs on Facebook to discuss extremely sensitive personal health issues.  Sophisticated patients know Facebook is an absolutely NOT TO BE TRUSTED data steward, end of story, get lost.  Our point would be not that FB is to be banned, but to ensure that the developer community is aware of such issues. </p>\n<p>Another item is exemplified by a direction I think is essential: enable ANYTHING patients might want to do, not just what current doctors and hospitals are telling them to do. This is brilliantly exemplified by both Greg Simon's and Dana Lewis's keynotes today.  Each clearly saw how the system was (is!) utterly failing them.   </p>\n<p>I would assert that our true north ought to be helping PATIENTS pursue and achieve their own goals.  For many patients and families that means doing exactly what the doctors propose - but let us not being limited to that. </p>\n<p>What do you think, all?</p>",
        "id": 167904940,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560300986
    },
    {
        "content": "<blockquote>\n<p>I'm going to float an idea here without being sure what it might be.  I have many sub-questions but I'll just ask this:</p>\n<p>Are we (FHIR) at a stage where it would make sense - or maybe even be important - to seek consumer/patient/citizen/individual perspectives, ongoingly (within projects or workgroups) or overall?</p>\n<p>I'm chatting with <span class=\"user-mention silent\" data-user-id=\"192609\">Mark Scrimshire</span> who thinks maybe so, particularly in certain topics; earlier today <span class=\"user-mention silent\" data-user-id=\"214364\">Ryan Howells</span> talked about CARIN's trust framework, which echoed something else Mark mentioned. </p>\n<p>One reason I wonder about this is that out of all the things I hear discussed at DevDays, the only worrying things are stuff that the world of \"sophisticated patients\" (if I can call them that) would be appalled at - for instance the idea of a chatbot that runs on Facebook to discuss extremely sensitive personal health issues.  Sophisticated patients know Facebook is an absolutely NOT TO BE TRUSTED data steward, end of story, get lost.  Our point would be not that FB is to be banned, but to ensure that the developer community is aware of such issues. </p>\n<p>Another item is exemplified by a direction I think is essential: enable ANYTHING patients might want to do, not just what current doctors and hospitals are telling them to do. This is brilliantly exemplified by both Greg Simon's and Dana Lewis's keynotes today.  Each clearly saw how the system was (is!) utterly failing them.   </p>\n<p>I would assert that our true north ought to be helping PATIENTS pursue and achieve their own goals.  For many patients and families that means doing exactly what the doctors propose - but let us not being limited to that. </p>\n<p>What do you think, all?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  I think there is an opportunity in the Open world of FHIR standards for patients to engage with the folks shaping the standard. As regulations push for Consumer access to their health data we need to make sure Patients have the tools to manage (or direct) how their data is used and curated. For example, Are security labels supported to enable patients to decide what data they deem as sensitive and have those preferences recognized and supported through their journey their data takes...</p>",
        "id": 167905356,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1560301505
    },
    {
        "content": "<p>Engagement is always useful.  Though to be really effective, those advocating for patient viewpoints will need to be able to understand the business levers of the other stakeholders to  better influence /convince them.</p>",
        "id": 167905901,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560302205
    },
    {
        "content": "<blockquote>\n<p>Are we (FHIR) at a stage where it would make sense - or maybe even be important - to seek consumer/patient/citizen/individual perspectives, ongoingly (within projects or workgroups) or overall?</p>\n</blockquote>\n<p>I don't think so. To translate what HL7 does in things that patients can use:<br>\n1 Vendors have to implement what HL7 design<br>\n2 Providers have to deploy / configure / enable  what the vendors developed<br>\n3 Apps developers have to write apps that use what vendors and providers made available<br>\nAnd the bottle neck now is in 1 and 2</p>",
        "id": 167909473,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560307005
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> thanks for your note expressing an interesting aspect of what I was trying to say: as regulations push for consumer access to the data, we need to make sure they have useful tools.  That begs the gigantic field of questions \"What do you mean by 'useful'?\"  </p>\n<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> thanks too for pointing out where you see the bottleneck.  I think my instinct is that we want to form some sort of patient \"capacity\" that can get itself organized and oriented before someone asks a show-stopper question that needs a timely response!</p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Precisely! \"Those advocating for patient POV need to understand the business levers of other stakeholders.\"</p>",
        "id": 167956680,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560352477
    },
    {
        "content": "<p>I completely agree. Our true north should always be helping PATIENTS (and their care givers) pursue and achieve their own goals. I’m looking forward to being part of the group that is focused on looking at this in a more broad sense from the patient’s perspective. We are in a position to make a tremendous impact on millions of lives. We need to make sure we are listening and asking the right questions of the users.</p>",
        "id": 168073922,
        "sender_full_name": "Debi Willis",
        "timestamp": 1560451650
    },
    {
        "content": "<p>well, we can write a consumer declaration for companies to sign on to</p>",
        "id": 168087911,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560462405
    }
]