[
    {
        "content": "<p>ALERT: We will likely drift off the declared scope ... anything \"patient driven\" is fair game.</p>\n<p>Declared opic:  Patient USE CASES??  Why not a patient TRACK?</p>\n<p>Declared description: </p>\n<div class=\"codehilite\"><pre><span></span>Isn&#39;t it ridiculous that DevDays doesn&#39;t have a track for patient-driven use cases or workflows?\nIs it time to add one? If not, what are we still waiting for?\nWhat else can we do to advance patient interests?\n</pre></div>",
        "id": 167975892,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560365360
    },
    {
        "content": "<p>My notes from lunch:<br>\n- We need a \"Patient Advocate/Support\" work group at HL7 (name to be determined).  Mission to include:<br>\n-- vetting content produced by HL7 work groups for appropriateness of their content for solving actual patient and caregiver requirements<br>\n-- providing an on-ramp for patients/advocates/caregivers who are interested in either using our standards or influencing our standards to help enable them to do so<br>\n- Grahame will look at where we might get sponsorship to help enable advocates to attend/participate at face-to-face meetings<br>\n- We (TSC and/or FMG) need to change our project/implementation guide 'proposal' process to specifically highlight how the project will alter/enhance patient experience (should be reviewed by above work group).  It's ok if some projects don't expect any patient impact<br>\n- IG quality guidelines should change to mandate the inclusion of a section in each IG that is specifically addressed to the patient community that explains what the purpose of the IG is, how it will influence the care they will receive and how, when relevant, they can take advantage of it directly.</p>",
        "id": 167988317,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560373711
    },
    {
        "content": "<p>Others, feel free to supplement with whatever I missed.</p>",
        "id": 167988331,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560373724
    },
    {
        "content": "<p>Sorry I missed this. Ran to the airport. We (CARIN) are supportive of these ideas. There was some earlier dialogue on making the consumer-facing apps available in a single, vendor-neutral location. The SMART team has agreed to work with us to do that. They also plan to indicate which apps are connected to which data sources and to have a reportable location where the apps attest to our code. Progress is slow but the project is underway.</p>",
        "id": 167989147,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1560374350
    },
    {
        "content": "<p>Here are my additional notes FWIW from the lunch session</p>\n<p>Attending: <br>\nGrahame<br>\nLloyd McKenzie<br>\nSherry <br>\nDave deB<br>\nDavid Hay<br>\nRob who?<br>\nAndrew Torres?<br>\nKelly Watson<br>\nVadim Perotokin<br>\nMelanie Yeung</p>\n<p>Adopt #PatientsIncluded?</p>\n<p>Grahame:<br>\n2 groups have no commercial reason to be here<br>\nAnyone who wants to do things in Africa<br>\nPatients<br>\nLisa Nelson is a long-termer at HL7. (She's personally responsible for pts being able to author CDA documents.)<br>\n\"Here's the problem; what structural things should we build into the standard?; that turns into advocacy at the govt level...\"  He meets with Rucker 3-4x/year; what's the regulatory agenda, what's the FHIR agenda.<br>\nOther<br>\nKelly Watson of Tidepool talks about them wanting to do lots of things with real-time data, surrounding medical records data, going with FDA</p>\n<p>-- </p>\n<p>Dave deBronkart / \"e-Patient Dave\"      <br>\nMobile: +1-603-459-5119 <br>\nInternational keynote speaker, author and health policy adviser</p>\n<p>Let Patients Help! A patient engagement handbook<br>\n\"Will unquestionably help many individuals become more active and <br>\nfully engaged in their health care.” - from the introduction by Eric Topol</p>",
        "id": 167990853,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560375537
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191570\">@Lisa Nelson</span> since you are mentioned here.</p>",
        "id": 168087698,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560462239
    }
]