[
    {
        "content": "<p>Hello,</p>\n<p>I am currently workshopping a technical correction that may be of interest to the Patient Empowerment community. The technical correction will help ensure advanced patient access and that patients are always included during health data exchanges. </p>\n<p>Despite CMS's comments to the contrary, this approach reduces patient engagement requirements while allowing for HIPAA protections to stay in place. This approach relies upon industry standards and existing capabilities, unlike the current proposal.</p>\n<p>I am maintaining a narrative and a series of infographics to help illustrate this concept on my LinkedIn: <a href=\"https://www.linkedin.com/posts/josh-lamb-686238149_the-following-infographics-illustrate-an-activity-6756850035817771008-D-Ma\">https://www.linkedin.com/posts/josh-lamb-686238149_the-following-infographics-illustrate-an-activity-6756850035817771008-D-Ma</a></p>\n<p>Let me know if this is interesting for this group. </p>\n<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> and <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> FYI, this relates to a comment made by CMS to coordinate with Patient Empowerment on this issue: <a href=\"https://www.cms.gov/files/document/11521-provider-burden-promoting-patients-electronic-access-health-information-e-prior.pdf\">https://www.cms.gov/files/document/11521-provider-burden-promoting-patients-electronic-access-health-information-e-prior.pdf</a></p>\n<p>Thanks, </p>\n<p>Josh</p>",
        "id": 223067697,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1610923449
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"246928\">@Josh Lamb</span> I love that CMS directed readers to come work with us!  Pretty good for a rookie WG, huh people??  cc <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> and all <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> </p>\n<p>Seriously, though, I / we / the patient community out there ... to advocate on this as informed citizens, I / we-all need to understand what the problem is that you're solving, and why you (apparently?) assert that CMS is doing it wrong.  Doing what wrong?  What ARE they doing that you think is wrong?</p>\n<p>Don't get me wrong - I'm thrilled that we find ourselves at this amazing intersection of policy, technology, industry interests (including finance) and consumer empowerment.  Who out there can help us unpack this?</p>",
        "id": 223071822,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1610929995
    },
    {
        "content": "<p>Update: working back through messages, I now see <a href=\"#narrow/stream/179160-social/topic/CMS-9123-P.20Comment.20-.20Community.20Feedback.20Requested/near/222985055\">your post yesterday</a> explaining what this is about.  I apologize but I for one don't even know enough to understand what you're even talking about.  </p>\n<p>Help, policy wizards!  I'm starting now to appreciate the value of \"consumeristas\" in HHS like Lygeia Ricciardi and Deven McGraw and Sherry Reynolds.</p>\n<p><span class=\"user-mention\" data-user-id=\"197115\">@Steve Posnack</span> HELP!  Who can de-Greek this for us??  <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> do you have unpacker / de-Greekers?  Should we bring in Ian Morrison to enlighten us with futurist wisecracks?</p>\n<p>Again, <span class=\"user-mention\" data-user-id=\"246928\">@Josh Lamb</span> ,  I'm grateful for this but I really need help.</p>",
        "id": 223072084,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1610930460
    },
    {
        "content": "<p>Thanks for raising alarm bells <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>!</p>\n<p>We will soon build out new infrastructure to support business-to-business health exchanges. CMS has required that implementers use a specific technical guide to perform these exchanges. I am attempting to highlight a better approach that will reduce costs, improve quality, and empower patients. This alternative utilizes current capabilities and existing Patient Access to fuel inbound business-to-business communications. This step is important for aligning interest across healthcare. Currently, contention exists between patient-directed exchanges and business-to-business exchanges. If we can reduce the number of outbound mechanisms used to communicate patient information, we can improve our existing Patient Access API quality.  Using the Patient Access API to support business-to-business needs will eliminate this contention. </p>\n<p>Perhaps I can join a WG session to introduce the issue? Unfortunately, the issue is complex and will be difficult to digest for the folks who have not been in the DaVinci PDex workgroups.</p>\n<p>The LinkedIn post I referenced above is currently my best attempt at summarizing the issue in an \"easy\" to digest format. I realize I have more work before this is a reality.</p>\n<p>The Patient Empowerment community may assist with aspects of this proposal affecting engagement, data quality, and establishing best practices.</p>",
        "id": 223080983,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1610945662
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"246928\">Josh Lamb</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Coordinate.20HIE.20Efforts.20With.20Patient.20Empowerment.20Group/near/223067697\">said</a>:</p>\n<blockquote>\n<p>Let me know if this is interesting for this group. </p>\n<p><span class=\"user-mention silent\" data-user-id=\"225094\">Debi Willis</span> and <span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> FYI, this relates to a comment made by CMS to coordinate with Patient Empowerment on this issue: <a href=\"https://www.cms.gov/files/document/11521-provider-burden-promoting-patients-electronic-access-health-information-e-prior.pdf\">https://www.cms.gov/files/document/11521-provider-burden-promoting-patients-electronic-access-health-information-e-prior.pdf</a></p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"246928\">@Josh Lamb</span> Thank you Josh. Anything that impacts patients is always interesting to us! I read your LinkedIn article and have questions. I imagine others in the Patient Empowerment Workgroup would also have questions. It would be good to get you on our calendar for February to have you present and let the group ask questions. Would you like to do that?</p>\n<p>I am thrilled CMS is recommending connecting with our workgroup when building data collection workflows. That was a nice surprise. That is what we are here for...to help brainstorm and give feedback from the patient perspective.</p>",
        "id": 223137074,
        "sender_full_name": "Debi Willis",
        "timestamp": 1610985315
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span>, thanks for offering to discuss these important issues. I have already learned a lot by observing the Patient Empowerment community. I would love to dig deeper into the various ways that Patients can engage with care delivery and health data. Today's \"E\" patient can help establish best practices and pilot new technologies. </p>\n<p>There is limited time to address the technical change I am requesting. I will need to gain an audience with Chairs on the Financial Management Workgroup and implementers within the DaVinci PDex workgroup. I will also attempt to leave a formal ballot comment (Jira Ticket) requesting this change. A minor technical change will allow the PDex Implementation Guide to support Patient Access for authorized data releases. The leading proposal requires that we develop new mechanisms to deliver patient data. Creating new Payer and Provider Access APIs will result in redundant work, low-quality/segmented data, reduced patient access, and this work competes with the existing Patient Access API.  </p>\n<p>This change ties into Patient Empowerment for several reasons. </p>\n<p>Rather than workshop this on my LinkedIn, I will place updates on a Google doc, maintained here: <br>\n<a href=\"https://docs.google.com/document/d/1yU-4ur5TBxU1RQXwCJi19xNk6LAahTVOTM2Ap4068PU\">https://docs.google.com/document/d/1yU-4ur5TBxU1RQXwCJi19xNk6LAahTVOTM2Ap4068PU</a></p>\n<p>Thanks again.</p>",
        "id": 223147278,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1610991056
    },
    {
        "content": "<p>While I may not understand all the subtleties in your diagrams without further discussion, I do believe many of the ideas you have included in your diagrams have merit.  For example, when we were designing our new enterprise-based Lifetime Clinical Records Platform, we became convinced that standardizing the backend infrastructure and streamlining the processes of retrieving, storing, and/or distributing clinical data from/to multiple endpoints would expedite adoption and empower Payers, Providers and Patients.  We also believed it could help empower 100s if not 1,000s of life saving health apps fulfill their end-goals for Patients by reducing the access burden for clinical data to a single click.</p>\n<p>I would like to learn more about your vision.  And, please let me know if I can help in anyway.</p>",
        "id": 223184577,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1611027728
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"216345\">@Bart Carlson</span> , </p>\n<p>Thanks for reviewing the diagrams! I agree that a complete medical picture, connected to all data producers, will allow applications to fulfill many powerful roles.  </p>\n<p>Using existing Patient Access API sources to receive data is trivial (compared to new APIs). The resistance to this suggestion occurs because of two reasons: <br>\n    1.) A Misconception that the Patient Access API will cause HIPAA protections to be lost (Payer and Provider applications will register with each other and can directly query other sources).<br>\n    2.) A Misconception that the Patient Access API will require additional consumer engagement. The work needed to enable free-flow exchanges between data holders have not yet begun and will compete with the Patient Access API. Instead of building out new APIs , we can reduce patient engagement requirements to connect to Patient Access API sources. </p>\n<p>A payer/provider application can use consumer opt-in preferences to perform exchanges without engagement/internet access. This only requires that a consumer activate a portal account and opt-in (can be automatic). </p>\n<p>The following diagram illustrates how connections to the patient access API can be added (using current technology):<br>\n<a href=\"/user_uploads/10155/pXwJNi5_xw-e8RPkbbjkH1t6/Accumulate-Consumer-Connections.png\">Accumulate-Consumer-Connections.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/pXwJNi5_xw-e8RPkbbjkH1t6/Accumulate-Consumer-Connections.png\" title=\"Accumulate-Consumer-Connections.png\"><img src=\"/user_uploads/10155/pXwJNi5_xw-e8RPkbbjkH1t6/Accumulate-Consumer-Connections.png\"></a></div>",
        "id": 223331873,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611117760
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  and <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span>   and <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> and <span class=\"user-mention\" data-user-id=\"216345\">@Bart Carlson</span> <br>\n and <span class=\"user-mention\" data-user-id=\"197115\">@Steve Posnack</span> , Is the below punchy enough for everyone? </p>\n<p>As a community of healthcare data producers, we have an important decision to make: Do we improve patient access and reduce costs (while helping businesses), or do we build out expensive new infrastructure that is only usable by businesses? </p>\n<p>A national healthcare policy, CMS-9123-F, requires the use of DaVinci PDex (a FHIR Implementation Guide). PDex defines allowed interactions between CMS impacted data producers (payers and providers). But PDex does not specify the exact exchange mechanism. PDex IG also does not prevent using the Patient Access API to perform trusted B2B exchanges (we will have a registration process in place that will allow us to understand who is a trusted B2B connection, protected by a BAA).  </p>\n<p>With ZERO changes to CMS policy or to the PDex Implementation guide, we can decide to use the existing Patient Access API or to create new Payer/Provider-specific APIs.</p>\n<p><strong>In other words:</strong> <br>\nPayer Access API: This is when a Payer uses the Patient Access API<br>\nProvider Access API: This is when a provider uses the Patient Access API</p>\n<p>We do not need to create new B2B only APIs. </p>\n<p>Healthcare data producers (payers and providers) are free to choose which API they use to exchange data. If we encourage the implementer community to focus on the Patient Access API instead of new APIs, everyone will benefit.</p>\n<p>Healthcare data producers have an important opportunity to help consumers accumulate a collection of connections (that they can interface with through a consumer application or a payer/provider application). </p>\n<p>Focus on patient access API also ensures that development work, testing, and enhancements remain on the Patient Access API (all improvements and testing will benefit everyone). </p>\n<p>The Patient Access API, powered by seamless data transfers, is potent when placed into a consumer's hands. The work to enable seamless transmissions of data between Payers and Providers will not allow seamless access to the Patient Access API for consumers. Suppose we use the patient access API instead. In that case, we can enable a consumer to take advantage of the payer and provider trusted connections to deliver all information from a single source (this could be any node in the healthcare network).  </p>\n<p>Payer/provider applications can mediate transfers, even for consumers without a device or internet access (with opt-in).<br>\nWe cannot require communication, on a national scale, with identities we do not recognize. The only entity in healthcare that everyone can communicate with is the consumer, making the Patient Access API a great choice to fuel data exchanges. </p>\n<p>Focus on Patient Access API (instead of new APIs) will:<br>\n      •      reduce redundancy: one API, one registration process, one connection<br>\n      •      improve data quality: one model instead of three<br>\n      •      reduce costs: 1/3 the effort<br>\n      •      align interests: everyone focuses on Patient Access API<br>\n      •      Promote economy of scale: One model and one data exchange</p>\n<p>All payers and providers will be creating FHIR applications and registering these FHIR applications with all other Payers and Providers. We will use an independent service to inform the status of other data producer endpoints (CAQH endpoint discovery is an example of the work to create a payer endpoint directory). An endpoint directory of trusted b2b connections is required, regardless of approach. </p>\n<p>A payer application can interface with the Patient Access API to receive data if the consumer has opted for this exchange. The opt-in process can be automatic due to CMS-9123-F. The data exchanged will never leave control of the two business associates who are performing the exchange. </p>\n<p>Steps to summon a complete medical picture, on-demand:<br>\n    1.) Find approved B2B endpoints (CAQH endpoint directory, already in progress)<br>\n    2.) Send the requested FHIR search to each endpoint: e.g., [base]/Patient?_identifier={some identity proofed id}/Patient-everything<br>\n    3.) Use the B2B application to perform meaningful interactions (application handles inbound data from other data producers only, and data never leaves HIPAA protections)</p>\n<p>The full narrative is maintained here (best viewed in print mode):<br>\n<a href=\"https://docs.google.com/document/d/1yU-4ur5TBxU1RQXwCJi19xNk6LAahTVOTM2Ap4068PU\">https://docs.google.com/document/d/1yU-4ur5TBxU1RQXwCJi19xNk6LAahTVOTM2Ap4068PU</a></p>",
        "id": 223427401,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611173017
    },
    {
        "content": "<p>Thanks for sharing.  I look forward to learning more about your thinking on the diagram.</p>",
        "id": 223468377,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1611202687
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192054\">@Viet Nguyen</span> FYI, the discussion is occurring here. I want to be sure we capture the patient empowerment communities feedback too.</p>",
        "id": 223528036,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611244519
    },
    {
        "content": "<p><strong>Goal: </strong><br>\nTo raise awareness within the implementer community, we can use the Patient Access API to support B2B use cases and consumer-facing use cases. We can use the Patient Access API without any changes to CMS policy or to the PDex IG. I have been preparing for some complex argument, but I am finding that this issue is not contentious once we can develop a shared understanding of what I am proposing. </p>\n<p><strong>Benefits: </strong><br>\nB2B enhancements to the Patient Access API also improve the consumer-facing patient access API. B2B exchanges are developing a network that will allow a complete medical picture to be summoned for all connected sources without a portal account/a device when applied to the patient. Connections to the Patient Access API can be shared by all connected sources, which creates a substantial benefit for the patient and businesses. </p>\n<p><strong>Focus on Patient Access API (instead of new APIs) will:</strong><br>\n• Reduce redundancy: one API, one registration process, one connection<br>\n• Improve data quality: one model instead of three<br>\n• Reduce costs: 1/3 the effort<br>\n• Align interests: everyone focuses on Patient Access API<br>\n• Promote economy of scale: One model and one data exchange</p>\n<p>If all data producers took this approach, many powerful opportunities are created.</p>\n<p><strong>Point against Patient Access API:</strong> <br>\nFocus on Patient Access API will not work. Payers and Providers must expose three APIs due to the CMS policy. </p>\n<p><strong>Counterpoint for Patient Access API:</strong> <br>\nCMS does not define a Payer Access API or a Payer Access API. CMS only defines Payer Access and Provider Access functionality. PDex IG does not cover the exchange mechanism between data holders (this is addressed under ONC Fast initiatives). </p>\n<p>As both the rules are currently written, we can leverage one API for all data exchanges: Patient Access, Provider Access, and Payer Access. This only requires that appropriate permissions are in place, and we can determine who is calling our API. The act of one data producer registering with another data producer as a BAA will let us know who is a payer or who is a provider (and determine access rights). </p>\n<p><strong>In other words:</strong><br>\n<strong>Payer Access:</strong> This is when a Payer uses the Patient Access API </p>\n<p><strong>Provider Access:</strong> This is when a provider uses the Patient Access API</p>",
        "id": 223534714,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611246997
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"216345\">@Bart Carlson</span>, would you like to jump on a call? It seems to be easier than trying to digest this mountain of information directly.</p>",
        "id": 223535306,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611247217
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197108\">@Jason Teeple</span> <span class=\"user-mention\" data-user-id=\"260046\">@Cille Kissel Watkins</span> <span class=\"user-mention\" data-user-id=\"243554\">@Pat Taylor</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span> <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span>:</p>\n<p>Can we discuss this at the implementer forum? It seems that this discussion is an implementation decision that can fall under several IGs.</p>",
        "id": 223536636,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611247749
    },
    {
        "content": "<p>Hopefully, this makes it clear how we can perform data exchanges, even for low engagement patients, using current technology. <br>\n<a href=\"/user_uploads/10155/4rqadjXeYp07oixS_IdWz2eq/Data-Exchanges-Without-User-Engagement.PNG\">Data-Exchanges-Without-User-Engagement.PNG</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/4rqadjXeYp07oixS_IdWz2eq/Data-Exchanges-Without-User-Engagement.PNG\" title=\"Data-Exchanges-Without-User-Engagement.PNG\"><img src=\"/user_uploads/10155/4rqadjXeYp07oixS_IdWz2eq/Data-Exchanges-Without-User-Engagement.PNG\"></a></div><p>And this image details why it is important to create connections around patient access: <br>\n<a href=\"/user_uploads/10155/mTFtrhQh1bKR2wsMqjpJFSyK/Accumulate-Consumer-Connections.png\">Accumulate-Consumer-Connections.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/mTFtrhQh1bKR2wsMqjpJFSyK/Accumulate-Consumer-Connections.png\" title=\"Accumulate-Consumer-Connections.png\"><img src=\"/user_uploads/10155/mTFtrhQh1bKR2wsMqjpJFSyK/Accumulate-Consumer-Connections.png\"></a></div>",
        "id": 223568566,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611262277
    },
    {
        "content": "<p>DO we have a decision to made, or has the rule already been whelped, for better or worse?</p>",
        "id": 223595805,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1611281068
    },
    {
        "content": "<p>Hi again <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> , </p>\n<p>I believe you mentioned that there would be an opportunity to bring this in for WG discussion in February? We can probably slow the text discussions until then. </p>\n<p><strong>Regarding a decision</strong><br>\nPayers and Providers will decide how they implement the B2B requirements in the CMS policy. We can enhance the work we have already done for the Patient Access API (to accept B2B requests, too) or separate them into new APIs. Implementers are free to use Patient Access now, without any policy changes, with excellent consumer benefits. The decision to use Patient Access or B2B access only connections will be opaque to consumers.</p>\n<p><strong>How does this relate to patient empowerment?</strong><br>\nPatient empowerment is relevant because this decision impacts a patient's ability to interact with data. Payers and providers who exchange data using Payer/Provider Access will make it impossible for patients to interact with the exchanged data. The most a patient can request is a consumer-facing version of B2B data (it is not always the same). Converting data from multiple formats may introduce errors that patients will be unable to help fix.</p>\n<p>A patient-centric model is preferable for highly engaged patients. Patient-centered connections will allow the patient a chance to verify the accuracy of all health data.</p>\n<p>As <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span>  mentioned, patients would like to have an opportunity to suggest corrections before data is shared. A patient-centric model will allow the \"E\" patient maximum control because they will be mediating all transactions (automatically or manually), and they will always have access to the same data used by businesses (their healthcare providers and insurers).</p>",
        "id": 223602919,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611289863
    },
    {
        "content": "<p>the vision I have for the patient corrections is NOT limited to EHRs. It is just as applicable to the data held by a payer.</p>",
        "id": 223634501,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611318517
    },
    {
        "content": "<p>The data flowing along a b2b exchange really needs to be visible (accounting of use) to the patient. That is to say the patient not only needs the ability to enable/disable ALL communications (including B2B between care and payer), but also needs the ability to see and accounting of ALL communications. Today these exchanges with payers are excluded from Accounting of Disclosures, they should NOT be excluded. Knowing the fact that these communications are happening is important to the Privacy Principles. The FHIR AuditEvent fits this need. It is ready and able. Transparency is important.  An AuditEvent holds who, what, where, when, and why. Each of these are FHIR References, so the patient (given they have ability to read-their-own-records) can pull a copy based on those references and see exactly what was communicated (AuditEvent.entity.what). This is not a replacement for having the ability to read-their-own-records at the Payer, this is needed too as we all know that what was communicated is not always what gets imported/persisted.  The AuditEvent enables these.</p>",
        "id": 223635036,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611318889
    },
    {
        "content": "<p>IHE has for 20 years included in their Implementation Guides (IHE Profiles) mandatory audit logging, HL7 has not included this in their Implementation Guides.  The IHE Document Sharing implementation guides (XCPD/XCA, PDQ/XDS, PDQm/MHD, etc) all have well defined audit log events into the schema of the FHIR AuditEvent.  The technology and standards exist... what does not is that many networks have removed this from their requirements, or moved the requirement to a \"you should keep your own logs\". both of which means that there is no way to get a unified view of all the communications that-have-happened, or more likely no possibility at all. This will only change with regulated \"access log reporting\" requirements.  The standards are ready, use AuditEvent.</p>",
        "id": 223635578,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611319285
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"246928\">@Josh Lamb</span> Thank you for explaining a bit more. This is all very foggy because I have not been involved in any of the discussions before, but one sentence in your last post got my attention and helped me understand an important impact of what you are trying to do: \"A patient-centric model is preferable for highly engaged patients. Patient-centered connections will allow the patient a chance to verify the accuracy of all health data.\" </p>\n<p>There is such a high percentage of errors in EHRs and as interoperability removes barriers, incorrect data will flow more quickly and become harder to manage. Incorrect data is not just an annoyance on the patient. It can be life threatening. </p>\n<p>If you need anything from our group or have time to talk to us more about this, please let us know.</p>",
        "id": 223647568,
        "sender_full_name": "Debi Willis",
        "timestamp": 1611325675
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>, great points. Long term, we want to allow consumers, who are engaged, to keep the ability to facilitate B2B transactions. We cannot do this if we use b2b specific outflows of data. </p>\n<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span>, would you like to jump on a call? I believe that <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> mentioned a chance in February to bring this to a WG session.</p>",
        "id": 223666743,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611333905
    },
    {
        "content": "<p>I don't think you understood... the B2B transactions are good... they just should create AuditEvent instances at both ends of the communication, AND the patient should have access to those AuditEvent instances... so that they can see that data did flow, for what reason it flowed, who initiated it, who was involved, and when.</p>",
        "id": 223667327,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611334195
    },
    {
        "content": "<p>this can be done with a single audit event repository, a bunch of them, or even a patient directed one (patient preference is registered that all accesses should be recorded using an AuditEvent create to XYZ FHIR repository)</p>",
        "id": 223667544,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611334288
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  I agree that B2B flows and audit events are good. My point is specific to using the same patient data to support B2B and B2C.</p>\n<p>The audit event will still be needed against access requests against the Patient Access API too. </p>\n<p>All data exchanged must be available to the patient, as per CMS policy. If a data producer begins to convert data to new formats and exchange data using an outflow the patient cannot access, we have violated the policy's intent. B2B only outflows (not using patient access API data) will contain data the patient can never interact with or see.</p>",
        "id": 223669909,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611335383
    },
    {
        "content": "<p>good. yes, data often gets transformed between clinical and payer. note this is true even FHIR--&gt;FHIR there will be transforms...I agree that the patient should always be able to get all data in what ever format it exists in.   the AuditEvent supports ALL kinds of data, it holds a Reference or Identifier. Thus AuditEvent is good with FHIR resources, but also good with anything else that has a unique identifier... but agree that accessibility is critical. AuditEvent might tell you that something happened, but knowing an identifier without being allowed (acccessibility) to see the content is only half the story. It still is useful to know that something happened, but better to be able to see the data communicated.   To me, getting the AuditEvent(s) is more important, as it shows patters of data-use that the patient can be aware of, can question, and can have comfort that an appropriate communication did indeed happen.</p>",
        "id": 223672995,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611336834
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , Despite all of the infographics and my best attempts, I am finding that I agree with everyone. It just takes me a long time to realize we are saying the same thing (in most cases). <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 223673676,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611337196
    },
    {
        "content": "<p>making incremental improvements is the key to success. Huge leaps are rarely successful. A common goal, however distant in the future, is important to set direction of these incremental steps.</p>",
        "id": 223674199,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611337411
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"246928\">Josh Lamb</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Coordinate.20HIE.20Efforts.20With.20Patient.20Empowerment.20Group/near/223666743\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span>, great points. Long term, we want to allow consumers, who are engaged, to keep the ability to facilitate B2B transactions. We cannot do this if we use b2b specific outflows of data. </p>\n<p><span class=\"user-mention silent\" data-user-id=\"225094\">Debi Willis</span>, would you like to jump on a call? I believe that <span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> mentioned a chance in February to bring this to a WG session.</p>\n</blockquote>\n<p>Yes, we would love to give you an opportunity to present to the Patient Empowerment group in February. We meet on Thursdays at 1 ET. You can PM us with your open dates.</p>",
        "id": 223711195,
        "sender_full_name": "Debi Willis",
        "timestamp": 1611355104
    },
    {
        "content": "<p>I have sent messages already! Talk to you then. </p>\n<p>This group is amazing, BTW. I do not think many other sectors have such dedicated consumer protections (this group) in place!</p>",
        "id": 223715587,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611358128
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 223728705,
        "sender_full_name": "Debi Willis",
        "timestamp": 1611372196
    }
]