[
    {
        "content": "<p>I just saw the following post from the Distance Resistance group on Facebook.<br>\n<a href=\"https://www.facebook.com/groups/distanceresistance\" target=\"_blank\" title=\"https://www.facebook.com/groups/distanceresistance\">https://www.facebook.com/groups/distanceresistance</a></p>\n<blockquote>\n<p>A friend has the virus and she’s too sick to sit in front of a computer to track her symptoms, fever, etc., so she needs a quick chart - something she can print/can fill in manually - one sheet per day (24hrs Data points she wants to track by the hour:<br>\nTemperature<br>\nBlood oxygen<br>\nHeart rate<br>\nBlood pressure<br>\nEmotional state -scale 1-10<br>\nPain/Discomfort-scale 1-10<br>\nCough - scale 1-10<br>\nNew symptoms<br>\nDaily weight<br>\nFood intake<br>\nI looked online but haven’t seen a chart contenting all these field. Are you aware of anything that she can use?<br>\nThquote</p>\n</blockquote>\n<p>I suspect there are a lot of people out in the world wanting to track these sorts of things right now, and there might be some utility in providing a reference Questionnaire and mappings to the associated Observations and LOINC/SNOMED codes.   It's a nice little patient story and insight in how people are responding and thinking about self tracking from non-medical professionals.  </p>\n<p>Kvetch:  I wish we could spend Thursday conference call meetings talking about topics like this, instead of rehashing the charter (yet again).</p>",
        "id": 191210629,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1584691251
    },
    {
        "content": "<p>Yes! Use the calls to work on patient enabling profiles.</p>",
        "id": 191211179,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584691634
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> Thank you for that! I knew people would start coming up with things they can do with or without institutional support.  I've just joined that group. <a href=\"https://www.facebook.com/groups/distanceresistance/permalink/2825006364201358/\" target=\"_blank\" title=\"https://www.facebook.com/groups/distanceresistance/permalink/2825006364201358/\">Here's that thread.</a>  Somebody did post a COVID-19 health diary in response - it's a PDF!!  Someone more technical than me should look into whether it can be made online (for those who want to) and (optionally) aggregated for the epidemiologists.</p>",
        "id": 191239989,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584709848
    },
    {
        "content": "<p>Dave, the Facebook link seems to be broken. Can you check it?</p>\n<p>We will have our symptom tracker out very soon. We’re just finishing up the COVID-19 self assessment and already working on the symptom tracker. Several engineers head down focused.</p>\n<p>Debi Willis</p>",
        "id": 191241754,
        "sender_full_name": "Debi Willis",
        "timestamp": 1584710773
    },
    {
        "content": "<p>Glad to hear about your symptom tracker!</p>\n<p>The FB link works for me - I'm guessing since it's a private group you may need to join the group first. <a href=\"https://www.facebook.com/groups/distanceresistance/\" target=\"_blank\" title=\"https://www.facebook.com/groups/distanceresistance/\">https://www.facebook.com/groups/distanceresistance/</a></p>",
        "id": 191262279,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584719809
    },
    {
        "content": "<p>Distance Resistance was the group that created and registered the StayHome,SaveLives #QuaranTeam Frame on Facebook.   </p>\n<p>If you click 'Update' on your photo, go to Frames, you can select the #QuaranTeam frame, and literally set a timer for 2 weeks.  And your profile pic will let everybody know you're quarantining and will remind you when you're 14 days are done.  It's a workaround using a feature that wasn't intended for quarantining, but Distance Resistance managed to figure out a $0.02 hack on the Facebook infrastructure that lets 2 billion people have a quarantine timer. </p>\n<p><a href=\"/user_uploads/10155/wJC9I3w9tUVBA5vQM3XUYc4V/Screen-Shot-2020-03-20-at-5.22.13-AM.png\" target=\"_blank\" title=\"Screen-Shot-2020-03-20-at-5.22.13-AM.png\">Screen-Shot-2020-03-20-at-5.22.13-AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/wJC9I3w9tUVBA5vQM3XUYc4V/Screen-Shot-2020-03-20-at-5.22.13-AM.png\" target=\"_blank\" title=\"Screen-Shot-2020-03-20-at-5.22.13-AM.png\"><img src=\"/user_uploads/10155/wJC9I3w9tUVBA5vQM3XUYc4V/Screen-Shot-2020-03-20-at-5.22.13-AM.png\"></a></div>",
        "id": 191269705,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1584722911
    }
]