[
    {
        "content": "<p>I think this is important, and I've pinged leaders of both groups - </p>\n<p><a href=\"https://www.leapfroggroup.org/news-events/patient-safety-watchdog-leapfrog-group-funded-national-initiative-preventing-harm\">https://www.leapfroggroup.org/news-events/patient-safety-watchdog-leapfrog-group-funded-national-initiative-preventing-harm</a></p>\n<blockquote>\n<p>Today, The Leapfrog Group announced <strong>Recognizing Excellence in Diagnosis</strong>, a new national initiative to publicly report and recognize hospitals for preventing patient harm due to diagnostic errors. Developed in collaboration with <br>\n<a href=\"http://improvediagnosis.org\">Society to Improve Diagnosis in Medicine</a> (SIDM) and key experts, the project is funded with a two-year grant of $1.2 million by the Gordon and Betty Moore Foundation.</p>\n<p>Diagnostic errors are among the top 10 causes of death nationally, accounting for nearly 40,000 to 80,000 deaths per year. This project will identify best practices in diagnosis, develop a roadmap for hospitals and health systems to achieve excellence, and measure progress though a national pilot survey. Other key partners on the initiative include Hardeep Singh, MD, MPH, Mark Graber, MD, FACP, and Matt Austin, PhD.</p>\n</blockquote>\n<p>I'm not sure what \"nearly 40,000 to 80,000\" means :-) but I replied, asking if they have data on the role of chart errors in these fatalities.</p>",
        "id": 224320664,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1611838133
    },
    {
        "content": "<p>I also understand that if you broaden the scope to include all medical/clinical errors of any type (e.g. not just diagnostic errors) the annual total number of deaths in the USA is around 300,000 death per year.  And, if correct, then it would make it the 3rd leading cause of medical related deaths in the USA  and only behind deaths from heart disease (659,000+) and cancer (599,00+).</p>",
        "id": 224394719,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1611869072
    },
    {
        "content": "<p>Yes, <span class=\"user-mention\" data-user-id=\"216345\">@Bart Carlson</span>. The original study was published by the IHI in 1999, <a href=\"https://www.nap.edu/read/9728/chapter/2\">To Err is Human</a>. It was widely disputed and nit-picked, but as we now know, more careful estimates have tripled the number, not reduced it.  </p>\n<p>Predictably, some have argued about the new numbers ... some have gone so far as to say that since medical errors are not a <em>disease</em>, it's an unfair comparison!  And nothing could be a better example of how NOT to think from the patient's perspective: I have a disease, I go in for treatment, and the <em>treater</em> accidentally kills me.  And they don't want to count that as a cause of death??  </p>\n<p>To my knowledge. <a href=\"https://participatorymedicine.org/journal/opinion/commentary/2013/04/24/it%E2%80%99s-time-to-account-for-medical-error-in-%E2%80%9Ctop-ten-causes-of-death-charts/\">this 2012 article</a> in our Journal of Participatory Medicine was the first to suggest counting errors among the top causes of death.</p>\n<p>Anyway, that broader cultural issue is generally relevant, because this WG is tasked with bringing the patient POV to HL7, and the prevalence of medical errors does raise the question of how many are caused by chart errors.</p>",
        "id": 224665387,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1612128174
    },
    {
        "content": "<p>@Dave deBronkart The original study was published by the IHI in 1999, To Err is Human. It was widely disputed and nit-picked, but as we now know, more careful estimates have tripled the number, not reduced it.</p>\n<p>Thanks for sharing the links.  I've seen a report with more current numbers in 2016 or 2017.  I will look for it and share a copy if I can find it.</p>",
        "id": 224680930,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1612148149
    }
]