[
    {
        "content": "<p>This is such a tiresome question in the medical establishment - something new came up this week worth capturing for future reference.  </p>\n<p>I'm sure sociologists have a name for this logical fallacy: you see that someone's naive, and instead of helping them learn, you conclude that current reality is the full expression of their POTENTIAL, which  keeps them uninformed. (In my 2013 book  <em>Let Patients Help</em> I said \"It's perverse to keep someone in the dark and then call them ignorant.\")</p>\n<p>This same thinking affects many clinicians whose lives are oriented around \"I'm doing this to you - don't interfere\" workflows. When pushed on the question, they commonly say \"Patients wouldn't understand anyway.\"  Sometimes this is said by truly arrogant people, sometimes by people who don't know HOW to explain, but sometimes by people who honestly don't get it.</p>\n<p>Yale cardiologist &amp; journal editor Harlan Krumholz @HMKYale, rabidly pro-patient-access, tweeted <a href=\"https://twitter.com/hmkyale/status/1141135165844070401\" target=\"_blank\" title=\"https://twitter.com/hmkyale/status/1141135165844070401\">a short thread with many replies</a>: </p>\n<blockquote>\n<p>Real story. Patient to nurse: \"I would like to see my test results.\" <br>\nNurse: \"We don’t usually show them to patients because they don’t understand them.\" <br>\nPatients can understand. Really they can.</p>\n<p>We can’t keep saying we want patient engagement if we are not willing to allow people who want their health data to have it - and help them understand it. It is about respect. And moving from paternalism to partnership. Paternalism should not be the default setting on healthcare.</p>\n</blockquote>\n<p>I replied that for some of us, the ultimate goal is NOT specifically partnership - that's a step along the way to true autonomy, true self-determination. I doubt any of us will ever be equivalent to oncologists(!!!), but we WILL be autonomous in the sense of being free to choose and pursue our own goals ... or \"primary endpoints,\" as the researchers put it. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>\n<p>Sherry Reynolds (Twitter @Cascadia), who joined us at MoPop and Weds afternoon, <a href=\"https://twitter.com/Cascadia/status/1141351027603431425\" target=\"_blank\" title=\"https://twitter.com/Cascadia/status/1141351027603431425\">replied with her own story</a></p>\n<blockquote>\n<p>During recent ultarsound - can you turn the screen so I can see it?</p>\n<p>Tech - no I am not allowed to do that only a doctor can share results - besides it would just slow me down because people ask too many questions )</p>\n</blockquote>\n<p>Of course HL7 is not responsible for changing the whole culture, of course (try standardizing THAT one), but as we think about outreach it will behoove us to be aware of current views.</p>\n<p>Harlan <a href=\"https://twitter.com/hmkyale/status/1141135579217723393\" target=\"_blank\" title=\"https://twitter.com/hmkyale/status/1141135579217723393\">added important perspective</a> on what we (all) need to do ... this will be useful to cite: </p>\n<blockquote>\n<p>And I don’t mean to diminish that nurse… I am sure she was well intentioned...it is about what is normative…it is about training… it is about culture…and it is about what we need to change. </p>\n<p>If people want paternalism, then that should require opt-in. Not the default setting.</p>\n</blockquote>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/hmkyale/status/1141135165844070401\" target=\"_blank\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/1077789607947919360/97H1cHts_normal.jpg\"></a><p>Real story. Patient to nurse: \"I would like to see my test results.\" Nurse: \"We don’t usually show them to patients because they don’t understand them.\" #whatneedstochange\nPatients can understand. Really they can. <a href=\"https://twitter.com/S4PM\" target=\"_blank\" title=\"https://twitter.com/S4PM\">@S4PM</a> <a href=\"https://twitter.com/MarilynMann\" target=\"_blank\" title=\"https://twitter.com/MarilynMann\">@MarilynMann</a> <a href=\"https://twitter.com/ePatientDave\" target=\"_blank\" title=\"https://twitter.com/ePatientDave\">@ePatientDave</a> <a href=\"https://twitter.com/BraveBosom\" target=\"_blank\" title=\"https://twitter.com/BraveBosom\">@BraveBosom</a> <a href=\"https://twitter.com/HugoOC\" target=\"_blank\" title=\"https://twitter.com/HugoOC\">@HugoOC</a></p><span>- Harlan Krumholz (@hmkyale)</span></div></div><div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/Cascadia/status/1141351027603431425\" target=\"_blank\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/1011275953031397377/Ze3AiDDU_normal.jpg\"></a><p><a href=\"https://twitter.com/hmkyale\" target=\"_blank\" title=\"https://twitter.com/hmkyale\">@hmkyale</a> <a href=\"https://twitter.com/S4PM\" target=\"_blank\" title=\"https://twitter.com/S4PM\">@S4PM</a> <a href=\"https://twitter.com/MarilynMann\" target=\"_blank\" title=\"https://twitter.com/MarilynMann\">@MarilynMann</a> <a href=\"https://twitter.com/ePatientDave\" target=\"_blank\" title=\"https://twitter.com/ePatientDave\">@ePatientDave</a> <a href=\"https://twitter.com/BraveBosom\" target=\"_blank\" title=\"https://twitter.com/BraveBosom\">@BraveBosom</a> <a href=\"https://twitter.com/HugoOC\" target=\"_blank\" title=\"https://twitter.com/HugoOC\">@HugoOC</a> During recent ultasound - can you turn the screen so I can see it?\n\nTech - no I am not allowed to do that only a doctor can share results - besides it would just slow me down because people ask too many questions  \n\n<a href=\"https://twitter.com/S4PM\" target=\"_blank\" title=\"https://twitter.com/S4PM\">@S4PM</a> <a href=\"https://twitter.com/HealthPrivacy\" target=\"_blank\" title=\"https://twitter.com/HealthPrivacy\">@HealthPrivacy</a> <a href=\"https://twitter.com/ePatientDave\" target=\"_blank\" title=\"https://twitter.com/ePatientDave\">@ePatientDave</a></p><span>- Sherry Reynolds 🌟 (@Cascadia)</span></div></div><div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/hmkyale/status/1141135579217723393\" target=\"_blank\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/1077789607947919360/97H1cHts_normal.jpg\"></a><p><a href=\"https://twitter.com/S4PM\" target=\"_blank\" title=\"https://twitter.com/S4PM\">@S4PM</a> <a href=\"https://twitter.com/MarilynMann\" target=\"_blank\" title=\"https://twitter.com/MarilynMann\">@MarilynMann</a> <a href=\"https://twitter.com/ePatientDave\" target=\"_blank\" title=\"https://twitter.com/ePatientDave\">@ePatientDave</a> <a href=\"https://twitter.com/BraveBosom\" target=\"_blank\" title=\"https://twitter.com/BraveBosom\">@BraveBosom</a> <a href=\"https://twitter.com/HugoOC\" target=\"_blank\" title=\"https://twitter.com/HugoOC\">@HugoOC</a> We can’t keep saying we want patient engagement if we are not willing to allow people who want their health data to have it - and help them understand it. It is about respect. And moving from paternalism to partnership. Paternalism should not be the default setting on healthcare.</p><span>- Harlan Krumholz (@hmkyale)</span></div></div>",
        "id": 168630339,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561061472
    },
    {
        "content": "<p>speaking as a lab guy, the clinicians often don't understand the results and shouldn't be allowed to see them <span aria-label=\"frowning\" class=\"emoji emoji-1f626\" role=\"img\" title=\"frowning\">:frowning:</span></p>",
        "id": 168630457,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561061564
    },
    {
        "content": "<p>Funny you should mention that, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - in email I was just discussing with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> something he sent me after my Amsterdam DevDays talk: :-)</p>\n<blockquote>\n<p>Medicine is changing very rapidly and few providers have received detailed training in all areas.  Furthermore, they don't have the time to learn such information given the speed the areas evolve.  </p>\n<p>Therefore - it doesn't make sense to share genomics data and other specialized data with GPs because they don't have the training to properly understand it, nor the time to get that training.</p>\n<p>Not too many GPs would be happy with the above assertion.  <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>\n<p>You can point out further that the argument that the GPs don't have the time to get the training is pretty valid, and not all of them have the incentive either.  However, a resource that patients (and caregivers) have in spades is both the time and incentive to learn whatever they don't already know.</p>\n</blockquote>",
        "id": 168630621,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561061712
    },
    {
        "content": "<p>and while there are attitude problems here, there are also genuine concerns around this. I think that DiagnosticReport should always include 2 things: an email address for seeking advice/comfort, and a cds-hooks end-point for allowing comment on the report when viewed by a patient. </p>\n<p>Because labs are stuck here: they really need to prepare a special version of the report for an uneducated person not steeped in the culture in which they are provided (efficiency of communication, instead of clarify of meaning). But patients get access to what clinicians get</p>",
        "id": 168630632,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561061726
    },
    {
        "content": "<p>but I haven't any luck getting that idea to stick :-(</p>",
        "id": 168630705,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561061772
    },
    {
        "content": "<p>I personally wouldn't assert that \"labs need to prepare\" a special version. Honestly I'm not sure I want to force Quest Labs (for instance) to try to get good at speaking plain language ... I'd rather see a marketplace for mash-ups that take my data from ANY clueless-but-excellent lab source and explain it in MY language. </p>\n<p>Implicit in that is my sense that there's no single best explanation.  It's quite likely that my marathon-running daughter the CRISPR-using science teacher wants something very different from my home-builder kid brother ... whose health objectives are surely quite different from hers.</p>",
        "id": 168630861,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561061934
    },
    {
        "content": "<p>yes that's true. On the other hand, the labs understand quite a lot about this and do have a useful contribution to make. I'll be speaking about this to the pathology industry at <a href=\"https://www.cirdan.com/whats-happening/pathology-horizons-2/\" target=\"_blank\" title=\"https://www.cirdan.com/whats-happening/pathology-horizons-2/\">https://www.cirdan.com/whats-happening/pathology-horizons-2/</a></p>",
        "id": 168631034,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561062079
    },
    {
        "content": "<p>For anyone who hasn't seen it yet, this superb 2010 TED Talk by Thomas Goetz (former <em>Wired</em> editor in chief) is eye-opening.  </p>\n<p><a href=\"https://www.ted.com/talks/thomas_goetz_it_s_time_to_redesign_medical_data?language=en\" target=\"_blank\" title=\"https://www.ted.com/talks/thomas_goetz_it_s_time_to_redesign_medical_data?language=en\">It's Time to Redesign Medical Data</a></p>\n<p>Here's a nutshell summary showing what a difference a presentation layer makes, massaging the raw numbers into a format that lets the user's attention be drawn to what's out of bounds. Green for good levels, red for bad; \"results at a glance\" at top right. (Sorry for the blurry screen capture.)<br>\n<a href=\"/user_uploads/10155/0aDisEUU4s6UGYnLMHst06BE/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/0aDisEUU4s6UGYnLMHst06BE/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/0aDisEUU4s6UGYnLMHst06BE/pasted_image.png\"></a></div>",
        "id": 168631662,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561062566
    },
    {
        "content": "<p>but that's my point - are you focusing on efficiency of communication, or on clarity of meaning? Because the clinicians very very much want the first (though the case in point is still paper orientated so it could certainly be improved for efficiency)</p>",
        "id": 168631801,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561062668
    },
    {
        "content": "<p>Also:</p>\n<blockquote>\n<p>lets the user's attention be drawn to what's out of bounds</p>\n</blockquote>\n<p>Lab guys (like me) are passionately opposed to that because it totally mis-understands what's going on here. The 'reference ranges' are an indication of what is normal for 95% of the healthy population - a basis of comparison to understand how measurement issues play.  So 5% of all healthy patients will get results outside that range. (except for a few analytes where the reference range is done differently).</p>\n<p>So what matters is the overall pattern, as compared to the patient's clinical status. I've seen 'normal' results that were urgent indications of impending disaster for a patient. What needs to be drawn attention to is unexpected results for the particular patient. But the lab can't know what they are. </p>\n<p>So flagging abnormal results and focusing on that increases the likelihood of bad outcomes for the patient</p>",
        "id": 168632132,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561062925
    },
    {
        "content": "<p>(or, if you work harder to make the lab report more informative than just reference ranges, you quickly get into sci-fi territory, though maybe AI will get us there one day)</p>",
        "id": 168632499,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561063184
    },
    {
        "content": "<p>GOOD GOOD GOOD!  I can't help but return to the airline cockpit analogy ... perhaps someone here knows reality better than I - great - but:</p>\n<p>I've long heard there was a phase where it was believed that bringing more and more data to the dashboard would let pilots make better real-time decisions.  Instead, after a point, it led to overwhelm, crashes, deaths.  </p>\n<p>Ultimately they learned - and I think this gets to your point? - that the precious commodity is attention, not floods of more and more data.  So a layer (plural?) of interpretation was added, with \"wisdom\" embedded. </p>\n<p>btw I love that this discussion is happening this early in the process ...</p>",
        "id": 168632513,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561063198
    },
    {
        "content": "<p>which is why i think that every diagnostic report should include a link back to the source for providing such interpretation, because the single report is getting more and more overloaded.</p>",
        "id": 168632620,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561063261
    },
    {
        "content": "<blockquote>\n<p>(or, if you work harder to make the lab report more informative than just reference ranges, you quickly get into sci-fi territory, though maybe AI will get us there one day)</p>\n</blockquote>\n<p>Another possibility - one which I see all the time among e-patients (empowered, engaged etc) - is that it becomes NORMAL for ordinary consumer-patients to say \"Huh: okay, I do understand this creatinine, up to a point - let's see what the doc thinks about it.\"</p>",
        "id": 168632667,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561063297
    },
    {
        "content": "<p>anyway, I accepted the request to the pathology conference so I could appeal to them to care about communicating with the patient</p>",
        "id": 168632743,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561063344
    },
    {
        "content": "<p>Do we have any aviation buffs in this rowdy crowd, to address my dashboard mumbles above?</p>",
        "id": 168632744,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561063345
    },
    {
        "content": "<p>Reminds of my brother, an intensive care specialist, who was talking to an old friend of his, an airline pilot. They decided to both observe the others job for a day - and one of the conclusions was that yes, dealing with multitudes of information was a shared issue, as was dealing with emergencies (the really important data). I heard that in jet fighters they'll use a recording of the voice of the mother of the pilot as a last resort - just before they zone out, in case of emergency - use that voice, for that's the only thing that'll still be processed by the most primitive parts of our brain. </p>\n<p>AI is the name of the game, not just to condense the multitudes of data (growing exponentially, and increasingly available at our fingertips) into a summary for a clinician, but also for other audiences (e.g. patients). But we'll have to learn to accept the fact that AI is being used, and that we don't have the capability to process all of the data ourselves. In a fighter jet, nowadays unstable by the very nature of their design, you'd not be able to fly at all unless you rely on a multitude of AI which summarizes, summarizes and summarizes again.</p>",
        "id": 169018203,
        "sender_full_name": "René Spronk",
        "timestamp": 1561546881
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> fascinating stuff - is the pilot story literally true, not just a handy fable? Not that I doubt you - it's just potent, and worth developing with related research if true.</p>\n<p>I'll add a vital aspect about AI: full transparency and iterative improvement are essential, to optimize on accuracy, but AI vendors may have a strong incentive not to want that. Sounds like a good job for open source!</p>",
        "id": 169067713,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561574556
    },
    {
        "content": "<p>The need for full transparency, enabling iterations toward accuracy, is established potently IMO by \"Weapons of Math Destruction,\" the book by an analytics geek about analytics engines run amok in the hands of purchasers with no clue, perverse incentives, or both. She has created such tools, knows how to make them work, and is appalled at their misuse. </p>\n<p>Weapons of Math Destruction: How Big Data Increases Inequality and Threatens Democracy <a href=\"https://www.amazon.com/dp/0553418831/ref=cm_sw_r_cp_api_i_kZ7eDbN2WJT9M\" target=\"_blank\" title=\"https://www.amazon.com/dp/0553418831/ref=cm_sw_r_cp_api_i_kZ7eDbN2WJT9M\">https://www.amazon.com/dp/0553418831/ref=cm_sw_r_cp_api_i_kZ7eDbN2WJT9M</a></p>",
        "id": 169068325,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561574880
    },
    {
        "content": "<p>Maybe she should speak at some future HL7 forum.</p>",
        "id": 169068459,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561574940
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191472\">@Calvin Beebe</span> <span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span>  - for your consideration</p>",
        "id": 169083827,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561585851
    },
    {
        "content": "<p>Something I picked up on Discovery channel (or a channel akin to that), so likely reliable (at least as an option the defense industry studied at some point in time), but I don't have a source for it (google doesn't give me anything useful when searching). Irrespective of whether true or not, the tale fits rather well.</p>",
        "id": 169108839,
        "sender_full_name": "René Spronk",
        "timestamp": 1561618625
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191472\">Calvin Beebe</span> <span class=\"user-mention silent\" data-user-id=\"191354\">Rien Wertheim</span>  - for your consideration</p>\n</blockquote>\n<p>Interesting, thanks for suggesting. I'll add her to our list.</p>",
        "id": 169124765,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1561634093
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> yeah but it's easy to get discredited as a well informed thought leader if one spreads a fable about mama's voice in a tough fighter pilot's ear and it turns out apocryphal <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>\n<p>I too failed at Googling it so I'm going to set this aside for now...</p>",
        "id": 169163379,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561661305
    }
]