[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nHello everyone, do you know FHIR educational pieces out there that specifically address allowing patients and providers to work together more closely?  </p>\n<p>I would like to try existing educational material  to spread FHIR  in Africa.</p>",
        "id": 216608898,
        "sender_full_name": "Olivier Karasira",
        "timestamp": 1605273760
    },
    {
        "content": "<p>Unfortunately, no.  I'm sure there are some, but probably not from HL7 that are standards focused.  That's a bit outside our usual area</p>",
        "id": 216614614,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605276310
    },
    {
        "content": "<p>There is some that I have seen focusing on the specific way in which FHIR CarePlan can enable better and interactive engagement between Patient, and the care givers involved in that plan. I have given that talk twice, but I think others have better versions.</p>",
        "id": 216654623,
        "sender_full_name": "John Moehrke",
        "timestamp": 1605293072
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  Please , how can i look at that  video ?</p>",
        "id": 216683466,
        "sender_full_name": "Olivier Karasira",
        "timestamp": 1605307085
    },
    {
        "content": "<p>my presentation was not recorded.. sorry.   I would recommend <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> likely has a bunch</p>",
        "id": 216690993,
        "sender_full_name": "John Moehrke",
        "timestamp": 1605311974
    },
    {
        "content": "<p>Thanks for tagging me on this, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> </p>\n<p>I don’t have such things but <span class=\"user-mention\" data-user-id=\"308467\">@olivierkarasira</span> let’s discuss what you seek. Say more? Who’s your audience?</p>",
        "id": 216691791,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1605312690
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <span class=\"user-mention\" data-user-id=\"297690\">@Hamish MacDonald</span> <span class=\"user-mention\" data-user-id=\"197704\">@Roheeni Bhana</span> <span class=\"user-mention\" data-user-id=\"363641\">@Pamela IZERE</span> <span class=\"user-mention\" data-user-id=\"363620\">@Leona ISHIMWE</span> <span class=\"user-mention\" data-user-id=\"363704\">@Joanna Usifo</span> </p>\n<p>The audience is the patient in general, students and parents in particular. I need a video to educate patients, they need to visualize the advantages of accessing their medical records whenever and wherever their need to improve the communication between the patients and the care provider. <br>\n They need to understand that owning their medical records can save their life, save money and even earn money. Again, “let the patients help” to raise the awareness of FHIR worldwide by collecting testimonials. I believe we can have a bigger impact by spreading a series of videos with different themes showcasing advantages of accessing your medical records thus turning our patients into active ambassadors of the concept. Subsequently, that wave will eventually create a community of patients that have experienced the benefits of owning their medical records. Thus use their experience for a video content in different African local languages.</p>",
        "id": 216713205,
        "sender_full_name": "Olivier Karasira",
        "timestamp": 1605339069
    },
    {
        "content": "<p>High level, simple introductions, that teach patients why they should ask \"Is your clinic/hospital on FHIR?\" will not only get the attention of the clinician or administrator if you are literally speaking that sentence out loud ( <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span> ), but also it can exert positive pressure on said institution to get on FHIR. And in Africa, the majority of clinicians I have spoken to welcome the thought of their patients carrying around clear, machine-readable healthcare data on their phone. It makes their job much simpler. </p>\n<p>This of course is a vastly different environment to the Americas, Asia or Europe where patient data access is often considered a tiresome chore that pulls a clinician away from one's centralized medical records system and away from their \"clinical / business flow\". In Africa it is different, adequate data about most patients is severely lacking. Patient Education on FHIR  is an opportunity in Africa.</p>",
        "id": 216715025,
        "sender_full_name": "Hamish MacDonald",
        "timestamp": 1605341436
    },
    {
        "content": "<p>So, <span class=\"user-mention\" data-user-id=\"308467\">@olivierkarasira</span>, I think this comes at a good time.  HL7's #PatientEmpowerment workgroup has several projects underway, and the US \"Cures Act Final Rule\" mandates that EMR data must be made available via FHIR. What's missing is \"consumer pull,\" as it's known in business.  For that, yes, we need consumer-friendly messaging information.</p>\n<p>For your award-winning talk at DevDays you had a high quality video produced by your team. Can those same resources (people, brains, technical skills) participate in this?</p>\n<p>My whole career has been in tech marketing, and ever since I first met with HL7 people, I've been thinking we need something like this. Maybe we can work together.  Meanwhile, you can look through <a href=\"https://www.epatientdave.com/category/fhir/\">my blog's FHIR posts</a> but they're not written for your audience.</p>\n<p>Director of Education <span class=\"user-mention\" data-user-id=\"196134\">@Sadhana Alangar</span> does HL7 have anything of this sort? I wonder if <a href=\"http://www.hl7.org/events/webinar/fhir/clinicians-managers-and-executives/2019/\">this March 2019 webinar for non-technicians</a> might have some content that we could adapt.</p>",
        "id": 216745031,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1605381501
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"196134\">@Sadhana Alangar</span> <span class=\"user-mention\" data-user-id=\"297690\">@Hamish MacDonald</span> <span class=\"user-mention\" data-user-id=\"363620\">@Leona ISHIMWE</span> <span class=\"user-mention\" data-user-id=\"363641\">@Pamela IZERE</span> <span class=\"user-mention\" data-user-id=\"363704\">@Joanna Usifo</span>   Yes  my team is ready to contribute a few  concepts of their own. A sample here below : </p>\n<p>The concept we are proposing is to create a digital mascot that would represent the power of FHIR’s services based on patients’ testimonials. Simultaneously grow our impact through our data champions by creating heroic characters that represents their ability to connect the patients and FHIR services.<br>\nThe concept is to visualize the patient’s experience illustrated through an animated version of the story told by the patient. The message concept should target the children as the first beneficiaries because if you can grab a children’s heart through these insightful illustrations, the parents will follow.</p>",
        "id": 216793280,
        "sender_full_name": "Olivier Karasira",
        "timestamp": 1605447872
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"308467\">@olivierkarasira</span> This is a good idea especially with the patient participating, and we could also include how that eases the job of the Health care professional/ Physicians. With regards to children most times, some parents protect their children especially when it comes to health.  So, I think we can put that into consideration and create a solution especially by emphasizing -\"The benefits of owning your health records or your Child's health records.\"</p>",
        "id": 216806981,
        "sender_full_name": "Joanna Usifo",
        "timestamp": 1605465584
    },
    {
        "content": "<p>@olivierkarasira <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  We discussed creating such a course at our EAC meeting a couple of weeks ago. It is on the agenda for this week today. There is a definitely a need for such non-technical courses. Olivier, I like your idea of making the videos interesting through animations.  I will let  you know what comes out of our EAC discussion. Dave, the class that we offered and you linked is an Introduction to FHIR course. While we market it as a non-technical course, i don't think it would appeal to the audience Olivier is targeting.</p>",
        "id": 216930260,
        "sender_full_name": "Sadhana Alangar",
        "timestamp": 1605559985
    },
    {
        "content": "<p>EAC = Educational Advisory Committee</p>",
        "id": 216932470,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1605560962
    },
    {
        "content": "<p>We have compiled a list of videos and other resources from ONC and private sector entities related to patient education on our CARIN website. <a href=\"https://www.carinalliance.com/who-we-help/consumers-caregivers/\">https://www.carinalliance.com/who-we-help/consumers-caregivers/</a></p>",
        "id": 218371393,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1606786931
    }
]