[
    {
        "content": "<p>Hi folks, I'm looking for guidance re a use case for enrolling patients to mHealth / wellness programs as well as research studies. My real-world requirement is for an EMR to be able to tell our ePRO platform (patient reported outcome) to add a patient to a predefined project (e.g. Hip Replacement) so that a series of questionnaires and educational material can be sent to patients. To clarify, the actual content and scheduling of these touch-points are defined in the projects so there is no additional information needed during the enrollment - just the project ID of the program the patient is being admitted to. One exception is the ability to set a baseline data collection date (probably can be others but for future). </p>\n<p>I reckon this sort of enrollment process should be a pretty common scenario so hopefully a solution exists!</p>\n<p>I've been advised to use the Task resource in some former discussions.</p>\n<p>Comments/Feedback/Advice welcome<br>\nCC <span class=\"user-mention\" data-user-id=\"195365\">@Daniel Thomson</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 218275077,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1606735512
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191420\">@Koray Atalag</span>  This is the info we store <br>\n<a href=\"/user_uploads/10155/2KS59NiieMp--qS9VpTYauOD/enrolment.JPG\">enrolment.JPG</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/2KS59NiieMp--qS9VpTYauOD/enrolment.JPG\" title=\"enrolment.JPG\"><img src=\"/user_uploads/10155/2KS59NiieMp--qS9VpTYauOD/enrolment.JPG\"></a></div><p>Initially this service was created to store GP enrolments for funding in NZ (so it's essentially storing the relationship between a patient (NHI ID) and the enrolling organization (Practice as Org ID)), + some metadata. We also store info on enrolments for entitlement programs (e.g. a Community services card, prescription subsidy card etc). </p>\n<p>Both types of enrolment were designed to be general enough to be extensible/re-usable for any kind of health program enrolment. It's not on our immediate workplan though to re-do this in FHIR, so all I've been doing is keeping an eye on the FHIR resources / others wanting to do similar things so far to see if there's any progress on how we might do it in FHIR once we get there.</p>",
        "id": 218634211,
        "sender_full_name": "Daniel Thomson",
        "timestamp": 1606951001
    },
    {
        "content": "<p>I think we'd discussed possibly expanding the scope of EnrollmentRequest/EnrollmentResponse and/or using List to manage your list of enrollemd members.  Task would be how you'd ask someone to complete a Questionnaire.</p>",
        "id": 218639275,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606954702
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"195365\">@Daniel Thomson</span> cool stuff! I agree it is an extensible model that could cater for a wide range of similar use cases.<br>\nToday I had a chat with <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span>  and he suggested to go with R5 and help rescope EnrollmentRequest and EnrollmentResponse. I'll get in touch with the relevant Work Group (Financial Management) to help develop an FMM Level 0 resource that could be usable in jurisdictions outside US.</p>",
        "id": 218674984,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1606991150
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/enrollment.20to.20a.20health.2Fresearch.20program/near/218639275\">said</a>:</p>\n<blockquote>\n<p>I think we'd discussed possibly expanding the scope of EnrollmentRequest/EnrollmentResponse and/or using List to manage your list of enrollemd members.  Task would be how you'd ask someone to complete a Questionnaire.</p>\n</blockquote>\n<p>Yes we did and thanks for the advice. As per above I think I'll go down this path. Can you point out to the right guy(s) in that WG - otherwise I'll just contact the co-chairs / post in their stream here</p>",
        "id": 218675290,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1606991326
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 218711656,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607010261
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191420\">Koray Atalag</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/enrollment.20to.20a.20health.2Fresearch.20program/near/218674984\">said</a>:</p>\n<blockquote>\n<p>Thanks <span class=\"user-mention silent\" data-user-id=\"195365\">Daniel Thomson</span> cool stuff! I agree it is an extensible model that could cater for a wide range of similar use cases.<br>\nToday I had a chat with <span class=\"user-mention silent\" data-user-id=\"191364\">Peter Jordan</span>  and he suggested to go with R5 and help rescope EnrollmentRequest and EnrollmentResponse. I'll get in touch with the relevant Work Group (Financial Management) to help develop an FMM Level 0 resource that could be usable in jurisdictions outside US.</p>\n</blockquote>\n<p>Sounds good. Happy to contribute or share more detail of any of the NZ Ministry of Health's experience / use cases with enrolment. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 218751599,
        "sender_full_name": "Daniel Thomson",
        "timestamp": 1607028133
    }
]