[
    {
        "content": "<p>I am looking at the latest version of the Patient Corrections IG (<a href=\"https://build.fhir.org/ig/HL7/fhir-patient-correction/examples.html\">https://build.fhir.org/ig/HL7/fhir-patient-correction/examples.html</a>) to use for a Dutch use case. </p>\n<p>We want to use the Communication only scenario, and also use a reference to a Patient (as sender) and Practitioner (as recepient). However, the IG does not state anything about resolving those references, for instance in a transaction bundle. My expectation is that when a client sends the Communication resource to a server, the client includes the Patient and Practitioner resource in the bundle. Because we can not expect the client to expose an endpoint where the server can resolve the references.</p>\n<p>I am wondering what your thoughts on this subject are.</p>",
        "id": 252774765,
        "sender_full_name": "Niek van Galen",
        "timestamp": 1631275176
    },
    {
        "content": "<p>In general, the expectation is you point to specific Patient and Practitioner instances that already exist on a server somewhere.  If you use a transaction bundle with all 3, then you're asking to create the Patient and Practitioner as well as the Communication - and that typically isn't what you want to do.</p>",
        "id": 252796106,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631284406
    },
    {
        "content": "<p>The work is very early, so has not addressed everything. As Lloyd has mentioned a simplifying assumption, that we have made so as to focus on the meat of the problem,  is these kind of details. </p>\n<p>In an early version I had Patient and Practitioner nailed down; but it was felt that using two profiles for the two different directions could be made more general into one communication where it was left to the reader to understand the to/from details.</p>",
        "id": 252799266,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631285676
    },
    {
        "content": "<p>Communication.subject is always the Patient.  Did you look at the definition of sender and recipient in the latest Communication profile?  <a href=\"https://build.fhir.org/ig/HL7/fhir-patient-correction/StructureDefinition-patient-correction-communication.html\">https://build.fhir.org/ig/HL7/fhir-patient-correction/StructureDefinition-patient-correction-communication.html</a>.  FYI we have veered away from Communication alone for now and are focusing on Communication spawns Task, but the guide still allows for a Task not to be spawned.</p>",
        "id": 253010629,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1631479217
    },
    {
        "content": "<p>What I would expect in the bundle for a Communication resource representing a request for correction would be any resources referred to from Communication.payload.  If there are referenced resources from payload that would be expected to be included in a bundle, how do we describe that in an IG - are there examples of that in another IG I can look at?</p>",
        "id": 253010830,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1631479451
    },
    {
        "content": "<p>Typically you'd either just have the Reference and the recipient would go query for them or you'd wrap both in a transaction and ask for both to be created.  A third option would be to base64 encode the payload resource and send it as an attachment.</p>",
        "id": 253011152,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631479848
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Expectations.20on.20.28bundle.29.20references/near/252796106\">said</a>:</p>\n<blockquote>\n<p>In general, the expectation is you point to specific Patient and Practitioner instances that already exist on a server somewhere.  If you use a transaction bundle with all 3, then you're asking to create the Patient and Practitioner as well as the Communication - and that typically isn't what you want to do.</p>\n</blockquote>\n<p>In this particular use case we do not know if there is a Patient and/or Practitioner resource present on the server, but we also do not want to enforce using the ones we send in the bundle. Would there be a way to send both resources along with communication but make it optional to create them?</p>",
        "id": 253045766,
        "sender_full_name": "Niek van Galen",
        "timestamp": 1631516345
    },
    {
        "content": "<blockquote>\n<p>In general, the expectation is you point to specific Patient and Practitioner instances that already exist on a server somewhere.</p>\n</blockquote>\n<p>Would it be common to first perform queries to find matching resources on the server and use those ids in the references for the resources you want to create?</p>",
        "id": 253047981,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1631517807
    },
    {
        "content": "<p>Since you are requesting corrections to a record you already have, you should already have the id of the patient resource and the organization or provider.  The provider is not required necessarily.  At my hospital, I expect that who will work on the correction will be refined there.</p>",
        "id": 253104675,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1631545355
    },
    {
        "content": "<p>So you have a correction request for a patient that you are sending to a provider, but do not already have the patient resource?  Interesting.  Explain.</p>",
        "id": 253104975,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1631545450
    },
    {
        "content": "<p>I would expect most of the time you (the patient + their app) would know the patient id and the id of the FHIR resource that needs correcting (or the CDA document that needs correcting).   This assumption is based on the fact the provider is providing a communication method for registering correction requests... presumably at that point the patient has already engaged with taht provider using FHIR.</p>",
        "id": 253105488,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631545636
    },
    {
        "content": "<p>the alternative is a patient -&gt; provider relationship that allows FHIR Communications, but does not have any other FHIR api? That seems unusual... One example would be where provider offers a web-browser user experience, but in that case that app (the web browser backend) is internal to the provider.</p>",
        "id": 253105730,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631545726
    },
    {
        "content": "<p>Looking up/figuring out what the patient id is pretty much always a pre-requisite to doing anything.  It's possible to use a messaging approach and say \"here's a bunch of stuff, you figure it out - good luck\", but that's generally a last resort option.</p>",
        "id": 253111130,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631547591
    },
    {
        "content": "<p>Coincidentally we discussed bundles at the track kickoff today and I believe decided we should try an operation on Communication bundled with resources referenced by Communication.payload</p>",
        "id": 253195813,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1631593135
    },
    {
        "content": "<p>And pretty much implemented in the the server I'm building - will discuss tomorrow at the catch up. Interestingly, it actually made it much easier to include other resources  - eg referenced from the communication.payload, or the Patient resource itself if the id on the server is not known. Be interesting to see what others make of it...</p>",
        "id": 253197048,
        "sender_full_name": "David Hay",
        "timestamp": 1631594235
    },
    {
        "content": "<p>Thank you all for your valuable comments on this topic. Indeed it would make sense that the PHR already \"knows\" the patient (and possibly) other resource id's, but in the MedMij / Dutch context this is not always the case or possible. We are however going to strongly advice on this, and keep the messaging option <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> posted as a last resort.</p>\n<p>I am also looking forward to seeing option on Communication bundled with resources that <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> mentioned.</p>",
        "id": 253219525,
        "sender_full_name": "Niek van Galen",
        "timestamp": 1631610298
    }
]