[
    {
        "content": "<p>SDWG just (Wed 1/28 Q1) had a very interesting discussion about whether or not, for the use case of allowing patients to view their records, data's provenance information needs to be exposed. This view use case is specifically a \"Patient view\" use case.  By data provenance information in the context of this discussion, the focus was on \"who?\" which is mostly about the author of the information. </p>\n<p>Participants debated if patients want to see who authored the information in their record or not.  Several developers mentioned that their customers (I'm assuming they are talking about providers) complain about getting too much information in their CCD documents, so these developers felt including provenance information would be too much information and that patient's would not want to see it.</p>\n<p>I argued from a personal point of view and said I was concerned because I know that we are building systems that are about to start auto generating health concerns and conditions and observations that are going to be added into my record.  (1. Gravity will be autogenerating Conditions and Observations based on questionnaireResults, 2. PDex is defining how Payers can use claims data to automatically populate clinical data (conditions and procedures) into my record, 3. HIE's also use various methods of \"concocting\" CCDs from all different information sources which brings up the question of authorship for this type of data.)  If I log into my physician's patient portal and see conditions in my record I don't recognize as being issues I am actually diagnosed to have, I want to be able to see who documented them into my record and who made the diagnosis.  </p>\n<p>As PE looks at the Medical Record Correction Use Case, it would help to clarify what types of information a person might want to see and reference as they request to have their information corrected.  I the patient sees a diagnosis in their record and its provenance is claims data,  and the person says this is not a condition they have, seeing and referencing the data's provenance information may be very important to determining if and how to correct the problem in the record.</p>\n<p>I wanted to bring PE into this discussion, so I would appreciate some additional points of view on this.</p>\n<p>I suggested that the developers might want to ASK PATIENTS about this use case and find out more about why patients may want to be able to see data provenance information.</p>",
        "id": 224370434,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1611858301
    },
    {
        "content": "<p>I certainly don't think HL7 should have a position on this. That would be a position to limit policy. That would be well beyond the charge of an SDO.</p>",
        "id": 224375778,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611860504
    },
    {
        "content": "<p>At the same time, I argue that they should be given Provenance... and more important in my view is that they should be given AuditEvent too.</p>",
        "id": 224375872,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611860534
    },
    {
        "content": "<p>patients, just like anyone, can choose to pull data. It should not be the position of HL7 to say that any kind of person or organization can not be allowed to pull data.</p>",
        "id": 224375934,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611860573
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span>  for bringing Patient empowerment into the loop. Personally, I would love to see the provenance information. If something in my chart is wrong, it will help me to know where that data came from so I can also contact the organization who sent it to my doctor.  That data is already in the EHR. It should be shared. That might even be considered as part of the \"all data\" that is eventually required to be shared. I think that argument for making \"all data\" available should also cover the provenance of the data.</p>",
        "id": 224387631,
        "sender_full_name": "Debi Willis",
        "timestamp": 1611865536
    },
    {
        "content": "<p>From my perspective, creating a health record for patients whereby they can only see their health data, but can’t see the source of their respective health data (e.g. without data provenance) would be analogous to a patient reviewing their bank checking account statement and only being able to see the dates and the amounts of each transaction, but without being able to see the name on the check (e.g. no payee shown).  In other words, I would be very concerned, and frankly very disappointed, if we designed a solution without data provenance as the foundation for all clinical data used within the system.</p>",
        "id": 224392983,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1611868161
    },
    {
        "content": "<p>Customers complaining about getting too much info in their CCD doc sounds like a problem that can be fixed by FHIR and well-written apps. A good UI can make it possible to drill down into provenance on any item when desired without overloading the user the rest of the time.</p>",
        "id": 224393669,
        "sender_full_name": "Paul Church",
        "timestamp": 1611868514
    },
    {
        "content": "<p>those complaining about information overload are using BAD SOFTWARE... it is not the fault of the interop layer, it is the fault of the app they are using to view the data.</p>",
        "id": 224395002,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611869211
    },
    {
        "content": "<p>CCDs are produced to address a specific set of data needs about a patient. They are not easily transferable.</p>",
        "id": 224396871,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611870324
    },
    {
        "content": "<p>I'll make sure I bring up provenance as a need for CARIN BB claims data too.</p>",
        "id": 224397038,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611870426
    },
    {
        "content": "<p>I think there's a difference between \"how much should patients have access to\" and \"how should information generally be presented\".  If you expose the whole dump of information and expect the patient to wade through all of it, that's overwhelming.  That doesn't mean that they don't have the right to all of it and should be able to navigate to it through an interface that exposes the data in more consumable chunks.</p>",
        "id": 224400775,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611871818
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192274\">@Joe Lamy</span> FYI in case you are interested a provenance thread</p>",
        "id": 224530598,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1611953181
    },
    {
        "content": "<p>Thanks, <strong>Virginia Lorenzi</strong>. I agree that patients should be able to view provenance information along with the clinical artifacts they retrieve. Patient Correction is a very interesting case though, as the resources are collaboratively updated. I could see a Task having a few authors, and to narrow down which one added what to it, you could look at <a href=\"http://Task.note.author\">Task.note.author</a>, or perhaps the Provenance resource pointing to a specific version of the Task.</p>",
        "id": 224545113,
        "sender_full_name": "Joe Lamy",
        "timestamp": 1611959671
    },
    {
        "content": "<p>How much provenance info? Would HL7 Basic Provenance (author, org, timestamp) be sufficient for patients? We'd have to walk the use cases.</p>",
        "id": 224545391,
        "sender_full_name": "Joe Lamy",
        "timestamp": 1611959857
    },
    {
        "content": "<p>There is a substantial amount of information in this thread. Provenance can become complex. I remember using provenance heavily during measure calculations. If we can at least have the creator of data provide provenance that would be ideal. It is too dicey when you assign it later on. </p>\n<p>There seems to be a common understanding that applications cannot effectively interact with data unless the use case is known. This is not true. It is also not true that a data producer who receives inbound data has to take any action on that data. This work can be done by an application. An application only needs to know the specifics of a use case when interacting with a different app. A payer, provider, and patient can use the same app. If an app controls the task, we can allow a lot more freedom to develop use cases. We can use must support flags to indicate what fields must be saved/retrieved/searched.</p>",
        "id": 224548846,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611961991
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 224555341,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611967358
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192205\">Lisa Nelson</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Expectations.20for.20viewing.20Provenance.20information/near/224370434\">said</a>:</p>\n<blockquote>\n<p>Participants debated if patients want to see who authored the information in their record or not. </p>\n</blockquote>\n<p>ARG!  You're precisely right:</p>\n<blockquote>\n<p>I suggested that the developers might want to ASK PATIENTS about this use case and find out more about why patients may want to be able to see data provenance information.</p>\n</blockquote>\n<p>Thank you for speaking clearly the (to me) obvious truth that needs to be heard.   Should we co-author a blog post about this (or you author it) for the <a href=\"https://confluence.hl7.org/pages/viewrecentblogposts.action?key=PE\">PE WG blog</a>?</p>\n<p>This reinforces for me an idea I had last week: perhaps our WG ought to convene a patient/advocate advisory council of some sort. This would not be a casual undertaking; it would need to be thoughtfully managed, with members being as savvy as we could manage, but without losing touch with real-world patients who are non-geeks. (Know what I mean?)</p>\n<p>In our Connectathon expert panel on Patient Requests for Corrections, Dianne Chappell of NYPresbyterian said outright she's alarmed about the volume of correction requests to be expected when patients start accessing all their data. A legitimate part of some disputes will be the question <em>\"Who said this?\"</em>  Without answering that we'll collectively have no way to assess its validity. </p>\n<p>In the case of an assertion that a patient considers derogatory, this bumps up against the judicial right to face one's accuser. And in the case of any error, there's still the question of who made the error ... especially since some docs through the decades have turned out to be \"frequent flyers\" for certain mistakes, which will never be distinguished if the source is hidden.</p>",
        "id": 224666109,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1612129132
    },
    {
        "content": "<p>Besides, as they say, Nothing About Me Without Me.  <em>It is not for you to decide whether I need to know something you think about me.</em> </p>\n<p>See the numerous cultural precedents (including the source of \"Nothing about us without us\") in this 2015 blog post: <a href=\"https://participatorymedicine.org/epatients/2015/10/when-someone-else-speaks-for-you-you-lose-patient-empowerment-as-a-civil-rights-movement.html\">“When someone else speaks for you, you lose”: patient empowerment as a civil rights movement</a>.</p>",
        "id": 224666110,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1612129140
    }
]