[
    {
        "content": "<p><a href=\"/user_uploads/10155/AQ_AuWlCZ9Yg04-P2-mTSvtN/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/AQ_AuWlCZ9Yg04-P2-mTSvtN/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/AQ_AuWlCZ9Yg04-P2-mTSvtN/pasted_image.png\"></a></div>",
        "id": 168052816,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560437852
    },
    {
        "content": "<p>What's this about, <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> ? Did I miss some earlier message with context?</p>",
        "id": 168059842,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560442390
    },
    {
        "content": "<p>It is an example of the bottleneck I wrote about: providers considering FHIR end point a chore to be done as late as possible + installation requiring a lot of work</p>",
        "id": 168066181,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560446805
    },
    {
        "content": "<p>Resulting in no FHIR end point available</p>",
        "id": 168066194,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560446818
    },
    {
        "content": "<p>And then even when it is available you have to go through the process of enabling the apps to use it - for each app</p>",
        "id": 168066244,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560446850
    },
    {
        "content": "<p>[Quoting…]<br>\nOkay - for other readers that was in a different thread, Consumer advice to HL7, in this message <a href=\"#narrow/stream/179262-patient-empowerment/topic/Consumer.20ADVICE.20to.20HL7.3F/near/167909473\" title=\"#narrow/stream/179262-patient-empowerment/topic/Consumer.20ADVICE.20to.20HL7.3F/near/167909473\">https://chat.fhir.org/#narrow/stream/179262-patient-empowerment/topic/Consumer.20ADVICE.20to.20HL7.3F/near/167909473</a></p>",
        "id": 168068577,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560448390
    },
    {
        "content": "<p>Just to clarify that thread, it sounds like the client in question has chosen to delay their FHIR go live behind a very large upgrade to their core EHR.</p>",
        "id": 168142503,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560524489
    },
    {
        "content": "<p>And right now, I would agree that many see this as secondary to the primary function of their EHR. Hopefully that will change as time goes on - there's a lot of impression still that there's too much \"hype\" around FHIR</p>",
        "id": 168142673,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560524618
    },
    {
        "content": "<p>Eventually I would hope most would view it as a core part of their EHR functionality</p>",
        "id": 168142790,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560524697
    },
    {
        "content": "<p>Hope so.. the situation now is that we have been technically able to connect to Cerner and Allscripts systems since early 2017 and we have no production connection after 2+ years (the xxx provider in my screen shot is our best shot at getting a production connection with a Cerner system - in October 2019)</p>",
        "id": 168143267,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560525008
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>  is your primary challenge on getting clients  to whitelist, getting patients  to use it (eg: marketing), or something else?</p>",
        "id": 168143467,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560525158
    },
    {
        "content": "<p>clients to whitelist</p>",
        "id": 168143515,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560525201
    },
    {
        "content": "<p>But if they whitelist it, there are patients waiting to use it?</p>",
        "id": 168143536,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560525221
    },
    {
        "content": "<p>If so, that seems like a misunderstanding by them around the regulations getting ready to go into effect...</p>",
        "id": 168143561,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560525241
    },
    {
        "content": "<p>IE: if they are resisting the whitelist request/not passing it on to us</p>",
        "id": 168143620,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560525271
    },
    {
        "content": "<blockquote>\n<p>But if they whitelist it, there are patients waiting to use it?</p>\n</blockquote>\n<p>Don't know - we are not marketing the app now - we immediately got a 1 star review in the app store 'I cannot connect to any of my providers'</p>",
        "id": 168143807,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560525415
    },
    {
        "content": "<p>If it's the install delays, that's also very useful to know.</p>",
        "id": 168143809,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560525415
    },
    {
        "content": "<p>Install delay - the FHIR end point is not up yet and they put it at the bottom of their priorities - hence October</p>",
        "id": 168143845,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560525446
    },
    {
        "content": "<p>Out of curiosity, when you connect, how does the patient identify which FHIR server/provider they use?</p>",
        "id": 168145177,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560526288
    },
    {
        "content": "<p>I know Apple does a very deep engagement to build this out with every client</p>",
        "id": 168145202,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560526306
    },
    {
        "content": "<p>One of the challenges we have concerns about is, even if the app is whitelisted, and the FHIR server is there, a patient may not know that \"Dr. Bob's Family Practice\" is affiliated with a larger health system</p>",
        "id": 168145363,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560526386
    },
    {
        "content": "<p>IE: the provider directory that is missing</p>",
        "id": 168145379,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560526397
    },
    {
        "content": "<blockquote>\n<p>how does the patient identify which FHIR server/provider they use</p>\n</blockquote>\n<p>We look up the providers and we add descriptive name and meta-data - like addresses, state(s), zip codes - to make search easier for the patient<br>\nNot perfect and quite time-consuming but the best we could come up with</p>",
        "id": 168145605,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560526524
    },
    {
        "content": "<p>(you can see the data we added at <a href=\"https://fhirendpoints.github.io/\" target=\"_blank\" title=\"https://fhirendpoints.github.io/\">https://fhirendpoints.github.io/</a>)</p>",
        "id": 168145694,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560526569
    },
    {
        "content": "<p>ok, so Dr Bob's Family Practice would be a \"keyword\" in that list</p>",
        "id": 168145953,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560526732
    },
    {
        "content": "<p>but not necessarily the address for that specific site, just larger health system</p>",
        "id": 168145982,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560526750
    },
    {
        "content": "<p>well, states :)</p>",
        "id": 168145998,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560526760
    },
    {
        "content": "<p>If Dr. Bob's Family Practice has its own FHIR end point (that seems to be the case with Cerner's) it will show up as a separate entry in the list - but hopefully with a more descriptive name including the health system and address / location data</p>",
        "id": 168146196,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560526875
    },
    {
        "content": "<p>It depends :)</p>",
        "id": 168146251,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560526913
    },
    {
        "content": "<p>But yes, sometimes</p>",
        "id": 168146324,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560526946
    },
    {
        "content": "<p>Hey y'all, I'm lost - why is this thread \"FHIR Adoption\" in the patient empowerment stream?</p>",
        "id": 168148637,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560528588
    },
    {
        "content": "<p>Because FHIR adoption is necessary for patient empowerment - if FHIR end points are not actually available patient cannot get data, no matter how good the standard is</p>",
        "id": 168148871,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560528727
    },
    {
        "content": "<p>Essentially: many providers are trying to push it off as late as they can per the rule b/c they don't yet see the benefit it provides</p>",
        "id": 168148908,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560528760
    },
    {
        "content": "<p>(also: patients have to be able to _find_ their provider to connect to - that is the last point Jenni was making)</p>",
        "id": 168148934,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560528790
    },
    {
        "content": "<p>Also <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>  isn't there also a challenge that some systems didn't choose to use FHIR to meet the CCDS requirement?</p>",
        "id": 168148961,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1560528810
    },
    {
        "content": "<p>Well, the same could be said about the availability of electricity and internet, no? :-)   </p>\n<p>From the POV of a patient/consumer, that reasoning seems to be a stretch - it would be better as a separate stream.   (I won't start a fight about it - just observing.)</p>",
        "id": 168148981,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560528826
    },
    {
        "content": "<p>Oh sure - there is that as well</p>",
        "id": 168149005,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560528841
    },
    {
        "content": "<p>Electricity and the internet are widely available, FHIR end points are not</p>",
        "id": 168149068,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560528867
    },
    {
        "content": "<blockquote>\n<p>(also: patients have to be able to _find_ their provider to connect to - that is the last point Jenni was making)</p>\n</blockquote>\n<p>Again, I hope we can separate the issue of \"FHIR availability to consumers\" from the issue of \"how to empower consumers via data.\"</p>\n<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> and anyone else, your thoughts?</p>",
        "id": 168149133,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560528926
    },
    {
        "content": "<p>To empower consumers via data you must have the data - that's currently mostly not the case - so I'd say that's the first problem to (try to) solve</p>",
        "id": 168149252,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560528991
    },
    {
        "content": "<p>The topics are connected but are two different issues. We need to focus on patients’ current needs and future needs so we can get a better understanding of where there might be holes in the standards. For instance, as a patient I want to be able to not only use an application to download my data but I want to be able to notify my provider that they have errors in my chart. Statistics are that over 80% of patients have errors in their charts with some of them being pretty significant. Right now, I have to go to the clinic website, find a specific document and print it out, indicate what is wrong in my chart and sign it, then mail it to the clinic. HIPAA gives me the right to request that errors be corrected. But we need to find an easy technical standard to make that happen. This is just a single example. There are many many other things that patients want to do. It’s important that we listen to those requests so we can present these types of issues to HL7.</p>",
        "id": 168150223,
        "sender_full_name": "Debi Willis",
        "timestamp": 1560529697
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> ... would you suggest going forward that this topic (adoption of FHIR by providers) continue in the Patient Empowerment stream, or would it make more sense elsewhere, in your view?  (For those who don't know, I'm particularly asking Debi since her name is listed on the work group proposal as a co-chair)</p>",
        "id": 168150436,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560529850
    },
    {
        "content": "<p>I disagree: the main problem we have is adoption and deployment of the current standard - adding more stuff to the standard will actually hinder that (even more)</p>",
        "id": 168150439,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560529852
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> what message or item are you disagreeing with?</p>",
        "id": 168150467,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560529882
    },
    {
        "content": "<p>With:</p>\n<blockquote>\n<p>It’s important that we listen to those requests so we can present these types of issues to HL7.</p>\n</blockquote>",
        "id": 168150545,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560529928
    },
    {
        "content": "<p>To be starker: the idea of deploying APIs and give patient app access and let 1000 flowers bloom is currently failing (like 'let each state build their HIE and all the data will flow' failed before) - we should try to make it not fail before worrying about anything else</p>",
        "id": 168150913,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560530205
    },
    {
        "content": "<p>(talking about the US)</p>",
        "id": 168150967,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560530254
    },
    {
        "content": "<p>If there are no groups addressing FHIR adoption within clinics, it does make sense to consider it part of patient empowerment. Patient empowerment is much more than technical standards. That’s one of the things we discussed in the meeting at DevDays. We need to get a broad understanding of patient needs. Perhaps we can later then segment them into technical issues, business issues, and workflow issues (and any other sub topic that makes sense) in the work group. So if FHIR adoption is not being discussed anywhere else, it makes sense to have it part of patient empowerment because it does impact a patient’s ability to BE empowered. Does anyone know if this topic is listed anywhere else?</p>",
        "id": 168151197,
        "sender_full_name": "Debi Willis",
        "timestamp": 1560530425
    },
    {
        "content": "<p>If anyone's going to beat up on care providers and get them exposing their interfaces to patient apps sooner, it's probably going to be patient empowerment folks, so I think discussing the challenges around that here makes sense.  (Frankly, the more people we have paying attention to this stream and the more 'interesting' conversations we have here, the better :&gt;)  It is possible to mute a topic within a stream if it's not of interest.</p>",
        "id": 168153711,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560532286
    },
    {
        "content": "<p>I agree. Patients will be the driving force to make all of the hard work of the FHIR community successful. Patients have the law standing with them and a choice to switch to a provider who does have a FHIR endpoint. I talked to a large health system who said they did not want their patients downloading their data because they were “already in enough trouble with the insurance companies about all the errors in patient charts” and they didn’t want their patients to also be upset when they saw all the errors in their charts. Only patients can break down this barrier.</p>",
        "id": 168155017,
        "sender_full_name": "Debi Willis",
        "timestamp": 1560533367
    },
    {
        "content": "<p>Hope you were able to reframe their thinking to \"Errors in the charts are obviously a problem for your ability to deliver quality and efficient care.  Making patients a part of the loop will help you to identify and address error sources more quickly.  Just set an expectation about what they should expect and how they can help.\"</p>",
        "id": 168156035,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560534129
    },
    {
        "content": "<p>I did discuss that with them. They were happier keeping the patients from seeing their data. I don’t think they understand the law. Another issue that needs to be addressed....Patient and provider education.</p>",
        "id": 168165126,
        "sender_full_name": "Debi Willis",
        "timestamp": 1560541073
    },
    {
        "content": "<blockquote>\n<p>I did discuss that with them. They were happier keeping the patients from seeing their data [because of all the errors]</p>\n</blockquote>\n<p>An essential thing to be understood by anyone involved in outreach (particularly advocating for change) is the issue of \"loss aversion.\" The field of behavioral economics has documented (yes with peer reviewed research) that a potential risk is TWICE as motivating as a potential gain. </p>\n<p>Many change activists respond to this by getting angry that people aren't more rational. This is not a useful perspective, as any failed sales person will attest (if honest).  Whether I like it or not, the useful perspective is to have empathy for the people we're asking to TAKE a risk for us. </p>\n<p>And I know of cases in hospitals where people have gotten seriously pounded over errors in the chart (or in billing data), merely because the people upstairs were  looking for someone to take the hit.  </p>\n<p>So - as we here all know - the most potent motivator is to appeal to people's desire to save lives, or help a sick kid, etc.  I think this is why (as several people said this week) patient stories are so important in shining the light onto the path we want to travel.</p>",
        "id": 168167803,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560543000
    },
    {
        "content": "<p>btw, we do have a powerful partner in this phase of the work: <a href=\"http://OpenNotes.org\" target=\"_blank\" title=\"http://OpenNotes.org\">The OpenNotes movement</a> has years of experience and dozens of published articles on the benefits letting patients see the full text of their visit notes. If others here want, I can say more in another thread. (I was close to Patient Zero in the original OpenNotes trial and am still on their advisory board.)</p>",
        "id": 168168084,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560543194
    },
    {
        "content": "<p>some takeaways from this for me:</p>\n<ul>\n<li>our patient cover sheets should clearly identify what the standard doesn't do </li>\n<li>how do we get a better relationship with open notes?</li>\n<li>I really wish we could get argonaut to at least strat specifying a \"correct this\" api, but since institutions are fiercely opposed (even though i think that's self-harming) I see why they haven't. I'd be interested in some discussion somewhere on what that would look like</li>\n</ul>",
        "id": 168174185,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560548735
    },
    {
        "content": "<p>(btw, I do very much think that this discussion lies in the realm of patient empowerment. And in the media)</p>",
        "id": 168174244,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560548770
    },
    {
        "content": "<p>As I said, I'm on the OpenNotes advisory board, so if we put together an approach letter (or whatever), I'm happy to introduce.</p>\n<p>They sometimes seem to have their own agenda so I can't guarantee anything but at very least we can point to their well funded research [e.g. <a href=\"https://www.opennotes.org/research/blue-button/\" target=\"_blank\" title=\"https://www.opennotes.org/research/blue-button/\">Your Patient Is Now Reading Your Note: Opportunities, Problems, and Prospects</a>], as I said.</p>",
        "id": 168174379,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560548930
    },
    {
        "content": "<p>joint event somewhere? that's a very useful way to get things going....</p>",
        "id": 168174808,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560549370
    },
    {
        "content": "<p>I'm pretty sure they some of my Providers don't even<em>know</em> that my notes are available through their API -- which is kind of awesome.</p>",
        "id": 168175186,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1560549750
    },
    {
        "content": "<p>Statistics are that 80%+ patients have errors in their chart. Medical errors are the third leading cause of death in the US. A lot of those errors can be traced back to incorrect or missing data. HIPAA gives us the right to request that our medical information is corrected. The covered entity has 60 days to act on the request for an amendment. As more patients begin downloading their data via FHIR applications, I anticipate a growing need to automate the process. I would also like to see us start those discussions now.</p>",
        "id": 168175613,
        "sender_full_name": "Debi Willis",
        "timestamp": 1560550189
    },
    {
        "content": "<p>see <a href=\"#narrow/stream/179175-argonaut/topic/Correcting.20Errors.20in.20Argonaut.20data\" title=\"#narrow/stream/179175-argonaut/topic/Correcting.20Errors.20in.20Argonaut.20data\">https://chat.fhir.org/#narrow/stream/179175-argonaut/topic/Correcting.20Errors.20in.20Argonaut.20data</a></p>",
        "id": 168175792,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560550346
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> although of course all the points you cite are true, in reality (from everything I've heard for years) there are no teeth to the \"right\" to have errors corrected.   So I think we need to be careful about assuming there will be cops pointing guns at error holders. </p>\n<p>But that doesn't mean we can't express interest in finding ways to help people do the right thing!</p>\n<p>Re the Geisinger study on 80% of charts containing errors: the great majority of them were obsolete medication info, often \"I stopped taking that two years ago, you idiots.\" But that info can be important to fix, and could be true \"low-hanging fruit,\" because it's so simple to correct.  (It's not like asking a hospital to correct a disputed diagnosis.)  </p>\n<p>So I wonder if this could be an easy first use case: \"Find and fix (or verify) obsolete medication lists!\"</p>",
        "id": 168185259,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560563308
    },
    {
        "content": "<blockquote>\n<p>I'm pretty sure they some of my Providers don't even <em>know</em> that my notes are available through their API -- which is kind of awesome.</p>\n</blockquote>\n<p>Are visit notes available via API??</p>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> as far as I know, OpenNotes is not a technology (e.g. with a standard API) - it's merely a policy / business practice of making notes available through whatever patient portal.  But maybe I'm out of date!  I'd love to hear otherwise.</p>",
        "id": 168185336,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560563416
    },
    {
        "content": "<blockquote>\n<p>it's a policy / business practice of making notes available through whatever patient portal</p>\n</blockquote>\n<p>right. So it's a policy thing. We're a standard for actually doing that. So our overlap: they want it (by portal?), we can do it (by API) - which is better, per Dana Lewis - are we actually doing it? they can advocate for hospitals to actually make the API available - which (per Jenni), they are not prioritising</p>",
        "id": 168185562,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560563851
    },
    {
        "content": "<blockquote>\n<p>We're a standard for actually doing that</p>\n</blockquote>\n<p>I can easily see that!  I still don't get what a \"joint event\" would be.</p>",
        "id": 168187224,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560566528
    },
    {
        "content": "<p>typically, one of the leads of FHIR speaking at an OpenNotes event or vice versa.</p>",
        "id": 168187595,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560567239
    },
    {
        "content": "<p>Ah, grasshopper, the delusion is revealed: “OpenNotes” event does not exist as a Thing. :-) Because there has never been a discussion of how to do it - only whether. </p>\n<p>It might conceivably, though. We could propose our burgeoning standard as The Obvious Right Way.</p>",
        "id": 168188133,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560568189
    },
    {
        "content": "<p>One ring to bind them all....</p>",
        "id": 168188259,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560568431
    },
    {
        "content": "<p>Regarding provider organization interest - patient generated data is of value.  I agree its tricky getting it in but its a valuable data source yet to be tapped.  When I talk to clinicians about patient facing technology there is always some datapoint that would like to receive from the patients.  As far as patient found errors we spend time and effort to do that manually.</p>",
        "id": 168192888,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1560576796
    },
    {
        "content": "<p>I agree that a published list of endpoints is needed.</p>",
        "id": 168192945,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1560576891
    },
    {
        "content": "<p>There are numerous patient focused events which we could have a fhir speaker.  Anyway I love this topic  so just chiming in :)</p>",
        "id": 168193068,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1560577112
    },
    {
        "content": "<p>If you let me / us know I can see whether we find speakers</p>",
        "id": 168193913,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560578741
    },
    {
        "content": "<p>Letting the doctor know (via use of FHIR standards) that they have errors/missing items in my medicbation list is a great start. Letting them know about undocumented allergies would be a good second use case.</p>",
        "id": 168208829,
        "sender_full_name": "Debi Willis",
        "timestamp": 1560607110
    },
    {
        "content": "<blockquote>\n<p>I agree that a published list of endpoints is needed.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> : there is a published list at <a href=\"https://fhirendpoints.github.io\" target=\"_blank\" title=\"https://fhirendpoints.github.io\">https://fhirendpoints.github.io</a> - can we have the New York Presbyterian end points to add to it?</p>",
        "id": 168307179,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560775982
    },
    {
        "content": "<p>Who maintains this? The repository appears anonymous.</p>",
        "id": 168308775,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1560777125
    },
    {
        "content": "<p>I also do not see any policies about what should the included or help people can add new items to the list or how it is maintained with respect to existing lists.</p>",
        "id": 168308850,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1560777162
    },
    {
        "content": "<p>To be clear, I love the initiative behind this but I also know other projects that are combining similar lists on the fly from existing vendor publications, and it would be nice to have clear expectations.  (FYI <span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> )</p>",
        "id": 168308983,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1560777221
    },
    {
        "content": "<blockquote>\n<p>Who maintains this? The repository appears anonymous.</p>\n</blockquote>\n<p>Us (CareEvolution). The repo is separate from all the rest of our stuff and linked to a new stand-alone email address so we can transfer ownership to some other better suited organization - if one shows up</p>",
        "id": 168309453,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560777585
    },
    {
        "content": "<blockquote>\n<p>I also do not see any policies about what should the included or help people can add new items to the list or how it is maintained with respect to existing lists.</p>\n</blockquote>\n<p>There is no policy - email at the address listed there and we'll do our best to add the end point (the list is an export of the list we maintain internally for our myFHR  / myDataHelps app)</p>",
        "id": 168309573,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560777680
    },
    {
        "content": "<p>Currently we periodically add what Epic publishes, and we'll try to add some of the end point Cerner publishes - the ones we can identify</p>",
        "id": 168309941,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560777968
    },
    {
        "content": "<p>If you have something better we are happy to drop this and give you our data</p>",
        "id": 168309990,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560778013
    },
    {
        "content": "<p>Thanks! would be great to add this information to a read me and link to that read me from the webpage. Knowing that this is the database behind your commercial product gives me a lot more faith in it :-)</p>",
        "id": 168315086,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1560781775
    },
    {
        "content": "<blockquote>\n<p>would be great to add this information</p>\n</blockquote>\n<p>Done</p>",
        "id": 168446709,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1560885688
    },
    {
        "content": "<p>Hi everyone, I'm realizing FHIR Dev Days is next week and I'm diving deep to learn all the things, especially the security / privacy part so that I can help patients understand and trust this new world.  Being a nerd I'm trying to wrap start to learn the technical side, and may even work to get certification.  Thankful to <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> for connecting me to this group.  Does anyone know if there are ePatient scholarships for FHIR Dev days?</p>",
        "id": 241437956,
        "sender_full_name": "Andrea Downing",
        "timestamp": 1622747293
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span></p>",
        "id": 241486146,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622776201
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"379458\">@Andrea Downing</span> , we don't have patient scholarships for devdays. In fact, you're the first to ask! Patients participating in the patient track (presenters) have free access to the event.</p>",
        "id": 241498994,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1622791196
    },
    {
        "content": "<p>In fact as a patient track presenter at a previous DevDays (Fall 2019), I highly recommend doing this! It was worthwhile in so many ways.</p>",
        "id": 241547926,
        "sender_full_name": "John Keyes",
        "timestamp": 1622818717
    },
    {
        "content": "<p>If I'm the first to ask and hope <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> would be proud as he's the one who helped me get connected to this amazing community  ( ;  If it's not too late I'd love to join the patient track.  I kind of live in both worlds - as an ePatient in BRCA Community and someone w/ background in tech.  I'm learning and starting to see use cases for what I'm doing with The Light Collective (<a href=\"https://lightcollective.org\">https://lightcollective.org</a>).</p>",
        "id": 241557534,
        "sender_full_name": "Andrea Downing",
        "timestamp": 1622822831
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191354\">Rien Wertheim</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/FHIR.20adoption/near/241498994\">said</a>:</p>\n<blockquote>\n<p>Hi <span class=\"user-mention silent\" data-user-id=\"379458\">Andrea Downing</span> , we don't have patient scholarships for devdays. In fact, you're the first to ask! </p>\n</blockquote>\n<p>LOL maybe the first one you've heard about but certainly not the first time this has been discussed. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>   In previous years the point has been made that there are definite per-person costs to the events and this is not a huge HIMSS-style or HDP-style event, and I believe that even in the virtual era there are per-person Whova costs.  But I'm not involved in that side of the movement.</p>",
        "id": 241559387,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1622823669
    },
    {
        "content": "<p>DevDays is a joint venture between Firely and HL7.  For HL7 events in general (WGM,  Connectathon) there have been numerous requests from non-employee members of the Patient Empowerment WG for scholarships but HL7 is under financial stress and that's always been a no.</p>\n<p>OTOH, patient involvement in FHIR first showed up at DevDays and first expanded at DevDays!  So perhaps this might be another innovation.</p>\n<p>Next week's patient plenary talks (by <span class=\"user-mention\" data-user-id=\"302249\">@Chris Brancato</span> and Katie McCurdy) are eye-openers, which will expand everyone's horizons on what patient participation can be.  (I can say that because as Patient Track moderator I know what they're doing. :-))</p>",
        "id": 241559672,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1622823796
    },
    {
        "content": "<p>Ah HA!! <br>\nKatie is a wonderful speaker and definitely can say this is expanding my horizons.  <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>",
        "id": 241562365,
        "sender_full_name": "Andrea Downing",
        "timestamp": 1622825007
    },
    {
        "content": "<p>Thanks for answering <span class=\"user-mention\" data-user-id=\"379458\">@Andrea Downing</span> 's question adequately, <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> .</p>",
        "id": 241837639,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1623098438
    }
]