[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> <a href=\"#narrow/stream/179166-implementers/topic/Are.20search.20parameters.20like.20filters.3F/near/165989765\">said</a>:</p>\n<blockquote>\n<p>[Does this branch need to get renamed?]   </p>\n</blockquote>\n<p>Yes. It was (May 2019) \"Are search parameters like filters?\" in Implementers. (The Patient Empowerment stream and WG didn't exist back then!)</p>\n<p>Last week's unanimous addition (during the WGM) of <a href=\"http://pacioproject.org\">PACIO</a>  to the Patient Empowerment WG's \"portfolio.\"  We're hearing right now from them in our weekly call. </p>\n<p>Although post-acute care (the PAC in PACIO) is not limited to geriatrics, many of their interests are heavily oriented to elder care (e.g. frailty, speech pathology, and Advance Directives), I realized I've never heard geriatrics mentioned at HL7.  In fact the following (from that 2019 thread) is the only mention on Zulip.</p>\n<blockquote>\n<p>To really handle issues like this well, we should recruit <em>seriously experienced</em> care coordinators (e.g. years-long care managers for elder family members) who have the scars and savvy to help us consider real-world hazards. Names that come to mind are Janice McCallum and Maryanne Sterling. And I bet they'll say they want at LEAST a read-only \"view window\" to check on the daily chatter ... people like those two could absolutely qualify as competent for that.</p>\n<p>In fact, what a hot idea - enrolling \"atrics\" caregivers (pediatrics and geriatrics).  At the other end of the lifespan there are numerous parents of seriously sick kids who have all too much experience with the need for bedside vigilance, having repeatedly rescued their sick kids from accidental harm.  Tyson Ortiz is one of these.  </p>\n</blockquote>",
        "id": 211947730,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601574463
    },
    {
        "content": "<p>I think it's appropriate here to note that this issue of \"handoffs\" (discharge) is too often overlooked, resulting in harm and cost, and it's a BIG issue to family and caregivers .... which makes the problem squarely within our WG's mission:</p>\n<blockquote>\n<p>The Patient Empowerment Work Group promotes and amplifies the viewpoint of patients and their caregivers in HL7’s standards work, in support of the HL7 mission.</p>\n</blockquote>\n<p>.... and charter as approved by the board:</p>\n<blockquote>\n<p>The recipients of care inevitably have a different perspective than those creating and working in the healthcare system, and that perspective needs to be included by direct participation of patients and caregivers in the standards process.</p>\n</blockquote>",
        "id": 211947976,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601574580
    }
]