[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"312496\">@Hamza Salem</span> thank you again for your presentation today.  </p>\n<p>I confess that I didn't fully capture your response to the judges' question so I'll repeat it here. Could you repeat your answer?</p>\n<blockquote>\n<p>You said you're looking for help. How much of what you've described is completed, and what kind of help are you looking for? Developers to complete the app?  People to develop the FHIR connectors?  And have you connected the app yet to any provider systems, or is it one of the things you intend will be possible with FHIR?</p>\n</blockquote>",
        "id": 201184025,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592419517
    },
    {
        "content": "<p>The app is ready to use. However, this is version one; what I am aiming to is creating an opensource community around the app and such apps providing the same features for patients (Export using FHIR), and maybe some developers with experience in connectors for the app. The app is not connected to any system now. However, the functionality has been built locally to secure the patient information for now.</p>",
        "id": 201185780,
        "sender_full_name": "Hamza Salem",
        "timestamp": 1592420351
    },
    {
        "content": "<p>Where can we find more details about the app?</p>",
        "id": 201201403,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1592428441
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> we are in private beta and will be for a while yet. So many systems and processes to ensure are working as they need to before releasing to the wild. I am onboarding people personally to it.</p>",
        "id": 201202018,
        "sender_full_name": "Hamish MacDonald",
        "timestamp": 1592428753
    },
    {
        "content": "<p>and of course, onboarding personally means you get to see how people ACTUALLY use your app, rather than what you think they do.</p>",
        "id": 201202425,
        "sender_full_name": "Hamish MacDonald",
        "timestamp": 1592428992
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"297690\">@Hamish MacDonald</span> , I assumed that there would be even some general details on a website somewhere, especially given the desire for help and an open source community.</p>",
        "id": 201203250,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1592429410
    }
]