[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Let's make a point, then, of finding a competent media contact among us. Your impression of my contacts probably exceeds reality but it should be possible to assemble a modest but effective plan. </p>\n<p>Has HL7 and/or FHIR specifically ever done any coordinated outreach to reporters?</p>\n<p>I can certainly leverage my past reputation by waving this flag and crying \"This is it! This is it!\"</p>",
        "id": 154023344,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1544054342
    },
    {
        "content": "<p>my US list: Andy Oram, Dan Munro, Joe Conn  (retired now, I think). HL7 has a media person we can call on. And <span class=\"user-mention\" data-user-id=\"193946\">@Stan Huff</span> and <span class=\"user-mention\" data-user-id=\"194480\">@Mark Braunstein</span> both have extensive contacts</p>",
        "id": 154023369,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544061681
    },
    {
        "content": "<p>I'm friends with Neil Versel, and have been written about in <a href=\"https://www.epatientdave.com/media/\" target=\"_blank\" title=\"https://www.epatientdave.com/media/\">lots of places</a>, but I'd need someone to sit down for a couple hours with a brew or three to plow through them. (It could be virtual.)</p>\n<p>Actually in a call tonight about coordinating SPM with FHIR at HIMSS, the idea came up of developing a health IT reporter list. Hm.  </p>\n<p>My original post about \"health data spigots\" is <a href=\"http://dave.pt/healthspigot\" target=\"_blank\" title=\"http://dave.pt/healthspigot\">here</a>. A real question is how close we really are to that vision, or if we're just \"definitely on the right track.\" Help, someone?</p>",
        "id": 154023752,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1544196009
    },
    {
        "content": "<p>right track. not there for a few years yet. But the problems are not lack of standards, or vendor will, but at the provider intention level now. They can turn it on. If they want to (at least, in USA)</p>",
        "id": 154023781,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544214769
    },
    {
        "content": "<p>There's still the challenge that the spigots will spit out different things - both the types of data and how it's encoded.  Argonaut is working toward fixing some parts of that, but there are lots of other pieces that will be harder to drive consistency with.  That said, if you're dying of thirst, you're not going to grumble too much about what comes out of the spiggots - at least not initially.</p>",
        "id": 154024287,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544485354
    },
    {
        "content": "<p>Evidently my understanding of Zulip is woefully bad because I only now saw that <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> had replied to this. Living and learning.  </p>\n<p>I'm fully aware, yes, that provider will is the main challenge.</p>",
        "id": 158043301,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1549902536
    }
]