[
    {
        "content": "<p>We should review the HL7 defined PHR-S FM -- Personal Health Record System Functional Model -- <a href=\"https://www.hl7.org/implement/standards/product_brief.cfm?product_id=88\" target=\"_blank\" title=\"https://www.hl7.org/implement/standards/product_brief.cfm?product_id=88\">https://www.hl7.org/implement/standards/product_brief.cfm?product_id=88</a></p>",
        "id": 185535713,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578948407
    },
    {
        "content": "<p>Heh... this is like 200+ pages of PHR specs.  Amazing.    And wow... really, really interesting to see the names credited on this documents.   And how many people were digging into this issue 5 years ago.  Ah, this is perfect.</p>",
        "id": 185540226,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1578951254
    },
    {
        "content": "<p>So, my first thought is that we ought to clone the Functions tab in the excel spreadsheet, and create separate tables for the SHALL functions and the SHOULD functions.  My second thought is to ask the following question:  how much of the SHALL functionality is currently supported by the FHIR spec?  What's the surface area overlap?  And what's the differential that's missing?  Sort of driving towards the idea of a 'PHR-S FM on FHIR' interpretation of this document.</p>",
        "id": 185541300,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1578952025
    },
    {
        "content": "<p>I think we need to test the PHR-S FM first among ourselves... as it is unclear to me who was involved in reviewing this work when it was ballotted. It might be perfect, slightly-off, or totally missing.</p>",
        "id": 185541961,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578952463
    },
    {
        "content": "<p>I agree that there are functionality that are built into FHIR.. but wouldn't the PHR product still need to expose that before it gets a passing grade? Or is your thinking that we use these gaps as opportunities to improve the FHIR spec?</p>",
        "id": 185542047,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578952529
    },
    {
        "content": "<p>Was the functional model built based on existing PHR implementations?</p>",
        "id": 185542181,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1578952623
    },
    {
        "content": "<p>this Functional Model concept was first designed to drive standard functions into EHR... but people then realized it could be used for PHR.  Here is the whole list of types of systems derived from the same model <a href=\"https://www.hl7.org/implement/standards/product_brief.cfm?product_id=269\" target=\"_blank\" title=\"https://www.hl7.org/implement/standards/product_brief.cfm?product_id=269\">https://www.hl7.org/implement/standards/product_brief.cfm?product_id=269</a></p>",
        "id": 185542199,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578952637
    },
    {
        "content": "<blockquote>\n<p>Was the functional model built based on existing PHR implementations?</p>\n</blockquote>\n<p>Good question... I wonder if we could get <span class=\"user-mention\" data-user-id=\"192546\">@Gary Dickinson</span> to comment. He drove most of this. (I added him to this stream)</p>",
        "id": 185542313,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578952701
    },
    {
        "content": "<p>I see a list of target system types, but I was interested in whether the model itself reflects real-world system design</p>",
        "id": 185542314,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1578952702
    },
    {
        "content": "<p>I think it was intended to represent 'best case'</p>",
        "id": 185542340,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578952720
    },
    {
        "content": "<p>Ok. I just want to call out that this sounds a bit different than how we drive most design in FHIR.</p>",
        "id": 185542383,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1578952769
    },
    {
        "content": "<p>yes, this is a Functional-Model</p>",
        "id": 185542566,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578952878
    },
    {
        "content": "<p>and yes that is a different kind of standard...</p>",
        "id": 185542588,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578952901
    },
    {
        "content": "<p>Because of that different approach, the functional models haven't necessarily seen as much daylight (or had as much influence) as some of the other specifications we've put out.  There's actually an IG that maps a bunch of the EHR functional model stuff to Provenance and AuditEvent, but few if anyone has looked at it, and I don't know of anyone who's implemented it.</p>",
        "id": 185543415,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578953436
    },
    {
        "content": "<p>Yes, I'm thinking the gaps are opportunities to improve the FHIR spec.  Or rather, I suspect the differential will result in a concrete bit of functionality that's similar in scope to SMART on FHIR... but focused around PHRs.</p>",
        "id": 185544202,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1578953969
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 185544237,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1578953992
    },
    {
        "content": "<p>No, the PHR System Functional Model was not intended to represent the \"best case\". Rather, it was intended to envision (and accommodate) \"all cases\" -- both functionally, and architecturally (that is, irrespective of any given architecture -- past, present, or future) .</p>",
        "id": 185670755,
        "sender_full_name": "John Ritter",
        "timestamp": 1579067459
    },
    {
        "content": "<p>The PHR System Functional Model authors examined all types of PHR systems (and approaches) worldwide and generalized (and normalized) the various approaches. Those functions that appeared in all systems were deemed to be at the \"SHALL\" level of necessity. Those functions that appeared in some systems were either deemed to be at the \"SHOULD\" or \"MAY\" level of necessity. To be specific as to the question, a conformance criteria could only be designated as a \"SHALL\" if it was capable of being implemented \"now\"; and there is at least one SHALL in the PHR-S FM. For example, the statement: \"The PHR-S SHALL capture the PHR Account Holder's demographic information\" conveyed the notion that at least one PHR system in the world was already capable of capturing demographic data -- and that any system that hoped to claim to be a PHR system needed to be able to capture demographic data about the PHR-Account-Holder.</p>",
        "id": 185671582,
        "sender_full_name": "John Ritter",
        "timestamp": 1579068701
    },
    {
        "content": "<p>The PHR System Functional Model was designed to accommodate the capture, use, and export of ANY type of data and in ANY type of format (even data types yet-to-be-created). For example, a PHR-Account-Holder could be identified (or distinguished) via a Social-Security-Number, GUID, photograph, eye-print, voice print, facial scan, fingerprint, implanted RFID chip, random number, medical-record-number, et cetera. And the method of conveying the data could be via paper, keyboard, mouse, diskette, facsimile, Bluetooth, telephone wire, hard disk, microwave, audio file, electronic packet, et cetera. And the envelope could be via JPEG, CCR, CDA, C-CDA, an electronic form, a spreadsheet, an ad hoc message, a proprietary format, a TEXT message, FHIR, et cetera.</p>",
        "id": 185672030,
        "sender_full_name": "John Ritter",
        "timestamp": 1579069379
    },
    {
        "content": "<p>The PHR System Functional Model is a different kind of standard. It envisions and anticipates the use of both archaic and advanced functionality for managing information about a PHR-Account-Holder. For example, it accommodates the possible need for an entire document to be covered by a single, given consent -- or for portions of the document to be covered by \"mini-consents\" (so that certain parts of the document would not be disclosed to people or systems without proper authorization). The PHR-S FM also envisions the possibility of certain protections \"accompanying\" PHR data after it has been exported from the PHR system (though this feature is not yet common).</p>",
        "id": 185672425,
        "sender_full_name": "John Ritter",
        "timestamp": 1579069973
    },
    {
        "content": "<p>The PHR System Functional Model was balloted by folks from HL7, CEN, and ISO TC215.</p>",
        "id": 185672495,
        "sender_full_name": "John Ritter",
        "timestamp": 1579070090
    },
    {
        "content": "<p>The PHR System Functional Model was envisioned circa 2005 -- and followed closely behind the EHR System Functional Model. One standard targeted the needs of clinical professionals; the other targeted the needs of the citizen.</p>",
        "id": 185672638,
        "sender_full_name": "John Ritter",
        "timestamp": 1579070316
    },
    {
        "content": "<p>Yeah, it's fascinating how mature the industry is on some of these things.  I feel like there were apps for Windows 95 that were floating around in the 90s that would qualify as a PHR nowdays.  And they were just PC commercial rewrites of the VAX/MUMPS stuff being used in laboratories and clinics.  But neither of those generations had mobile smart devices, nor the government giving any guidance to a standardized API or interoperability protocol.  The industry has oscillated between centralized to distributed to centralized and now back to distributed again.  Lots of opportunity to revisit some of that work, and see where things lead in this new regulatory environment and EHR ecosystem.</p>",
        "id": 185672862,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1579070724
    },
    {
        "content": "<p>Regarding the SHOULD/SHALL, I'm sort of interpreting it as a venn diagram...  SHALL are the overlapping shared features that most all systems need to support if they claim to be a PHR; and SHOULD features are the leaves of the diagram that have been observed in the wild as best practices but aren't seen as standard.  And to your point...  it's probably worth mapping the FHIR spec to the SHOULD features also!</p>",
        "id": 185673002,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1579070969
    },
    {
        "content": "<p>With respect to the question of \"seeing daylight\" or \"having influence\", I ask which is more important: the data -- or the system that houses the data. That is, which one can we do without: the data -- or the system that handles the data? And to the underlying point of the question, which is more important: standards that support data -- or standards that support systems that house data?</p>",
        "id": 185673011,
        "sender_full_name": "John Ritter",
        "timestamp": 1579070988
    },
    {
        "content": "<p>Abigail: Hmmmm... For the amount of extra time that it might take the FHIR experts to review the \"MAY\" -level conformance criteria, I would recommend that the experts do so. For an item to be designated a \"MAY\", it was sometimes viewed as future-looking. Perhaps some of the newer FHIR resources might be able to envision or accommodate the types of PHR System functionality that was only being dreamed about in the past.</p>",
        "id": 185673232,
        "sender_full_name": "John Ritter",
        "timestamp": 1579071347
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 185673285,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1579071416
    },
    {
        "content": "<p>I'll just note here that I bet &lt;0.1% of the patient activist population has never heard of this model, or they/we might be pounding drums in the street wanting to know more. </p>\n<p>Is there a tech-ish-consumer-friendly introduction to what this is?  Has anything become of it in reality?</p>",
        "id": 185700203,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1579097289
    },
    {
        "content": "<p>Good topic to put on a joint meeting with the EHR workgroup. They are likely willing to open it up given our input. But I think we do need to come up with a set of questions to open the discussion... <span class=\"user-mention\" data-user-id=\"258412\">@John Ritter</span> is a co-chair of that EHR workgroup.</p>",
        "id": 185706016,
        "sender_full_name": "John Moehrke",
        "timestamp": 1579100813
    },
    {
        "content": "<p>Well, just for the record, I'd have no clue where to start.   Does any tool let someone ask a question that starts a VERY big discussion, in a way that's not just a flood of threads, but iteratively evolves an increasingly rich picture?</p>",
        "id": 185748434,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1579125258
    },
    {
        "content": "<p>There's <a href=\"http://community.fhir.org/\" target=\"_blank\" title=\"http://community.fhir.org/\">http://community.fhir.org/</a> which lets threads hang around longer than in the chat stream, and has better functionality for searching historical posts and retaining community conversations.  We use the same forum software over in the Meteor.js community at <a href=\"https://forums.meteor.com/\" target=\"_blank\" title=\"https://forums.meteor.com/\">https://forums.meteor.com/</a>, and have countless threads that are hundreds of posts long, with links, images, supporting evidence, code snippets, etc.  It's maybe the best place to start a very big conversation while keeping it public so patient advocates 'out in the wild' can find it.  Also allows outbound linking to social media and blogs.</p>",
        "id": 185752003,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1579127844
    },
    {
        "content": "<p>So, I went and broke down the PHR-S FM SHALL criteria into FHIR resources.   By my count, there are 187 criterion with the word SHALL in them, incorporating the following three dozen resources.    </p>\n<p>AuditEvents<br>\nAllergyIntolerance<br>\nAppointment<br>\nBundle<br>\nCapabilityStatement<br>\nCarePlan<br>\nClaim<br>\nClinicalImpression<br>\nConsent<br>\nContract<br>\nCommunication<br>\nComposition<br>\nDevice<br>\nDiagnosticReport<br>\nDomainResource<br>\nEncounter<br>\nExplanationOfBenefit<br>\nFamilyMemberHistory<br>\nImmunization<br>\nLibrary<br>\nMedia<br>\nMedication<br>\nMedicationOrder<br>\nMedicationStatement<br>\nNutritionOrder<br>\nObservation<br>\nOrganization<br>\nPatient<br>\nPerson<br>\nPractitioner<br>\nPractitionerRole<br>\nProvenance<br>\nRelatedPerson<br>\nSchedule<br>\nSlot<br>\nSequence<br>\nValueSet</p>",
        "id": 185840239,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1579196904
    },
    {
        "content": "<p>Of these, many of them are already part of the Argonaut project (which now includes the Scheduling resources, as I understand).  For the purposes of the Patient Empowerment group, I removed the Argonaut + Scheduling resources, since they're generally more normative and already have other people working on them.  That leaves the following 15 or 16 resources which are relevant to PHRs, but which generally have a lower normative status and fewer users and need guidance and work input.  </p>\n<p>AuditEvents<br>\nClaim<br>\nClinicalImpression<br>\nConsent<br>\nContract<br>\nCommunication<br>\nExplanationOfBenefit<br>\nFamilyMemberHistory<br>\nLibrary<br>\nMedia<br>\nNutritionOrder<br>\nPerson<br>\nProvenance<br>\nRelatedPerson<br>\nSequence<br>\nValueSet</p>\n<p>We have some BlueButton functionality in there, proxy accounts and family member in general, how communications and audit events are managed on the patient side, consent and management, and there's nutrition orders.  Also, numerous PHR items around data provenance.  And I don't think anybody has a clear idea on data heavy resources like ImagingStudy and Sequence.</p>",
        "id": 185840788,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1579197272
    },
    {
        "content": "<p>Architecturally, I found criterion for probably 4 large system queues...</p>\n<p>InboundQueue (Bundle)<br>\nOutboundQueue (Bundle)<br>\nNotificationsQueue (Communications)<br>\nAuditLog (AuditEvents)</p>\n<p>References to probably two different directory services of some sort.  Lets just call them Provider and Patient Directory. </p>\n<p>ProviderDirectory<br>\nPatientDirectory</p>\n<p>As a software engineer, I'd loosely describe a dozen APIs somewhat references throughout the 187 criteria. These aren't necessarily interoperability APIs, but recurring functionality.  </p>\n<p>AccountsServer<br>\nAccountsClient<br>\nAnonymization<br>\nEncryption<br>\nFilters<br>\nMongo (Document DB)<br>\nMoment<br>\nMoment Timezone<br>\nPdfRendering<br>\nPdfViewing<br>\nRandom<br>\nRulesEngine<br>\nTheme</p>",
        "id": 185841747,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1579197810
    },
    {
        "content": "<p>I'd also identify the following software modules which these criteria reference or describe in some manner.</p>\n<p>ADT<br>\nArgonaut <br>\nBlueButton<br>\nBlob Storage<br>\nCCDA on FHIR<br>\nFhirBlocks / Blockchain?<br>\nHIPAA, <br>\nIPFS<br>\nOperationalTransform<br>\nOAuth<br>\nOAuth Scopes<br>\nOpenID<br>\nPluginArchitecture<br>\nSMART on FHIR</p>",
        "id": 185842603,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1579198382
    },
    {
        "content": "<p>Also, there are some specific user interfaces that are described throughout; two of which I feel might warrant having discussions around in the Patient Empowerment group.  Specifically around how patients query terminology servers, and the problem list that they manage.  </p>\n<p>TerminologyQueryPanel<br>\nProblemList</p>",
        "id": 185842976,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1579198614
    },
    {
        "content": "<p>And lastly, there's references to SocialHistory, which in my opinion is a new resource that we may want to advocate for.   Something to encapsulate anything on Facebook, Twitter, Instagram, etc.  But also to model social worker interactions, community discussions, social determinants of health, mental health, patient diaries, etc.</p>\n<p>SocialHistory<br>\nSocialPost</p>",
        "id": 185843129,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1579198711
    },
    {
        "content": "<p>We've talked about social history before.  Thus far the consensus seems to be \"use Observation\" (reflecting how existing systems already manage such data)</p>",
        "id": 185850590,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579203092
    },
    {
        "content": "<p>In terms of Audit and Provenance, there already is a guide aligned with the EHR record lifecycle events functional model: <a href=\"https://build.fhir.org/ehrsrle/ehrsrle.html\" target=\"_blank\" title=\"https://build.fhir.org/ehrsrle/ehrsrle.html\">https://build.fhir.org/ehrsrle/ehrsrle.html</a></p>",
        "id": 185850754,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579203173
    },
    {
        "content": "<p>As you can see, it hasn't had a lot of love and attention, but it's been around since DSTU2.</p>",
        "id": 185850775,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579203194
    }
]