[
    {
        "content": "<p>It's stimulating to know that work is afoot on capturing patient contributed data (the project in our WG, and more) but perplexing to ponder the needs of patients whose symptoms may not fit into any existing lexicon.  How does one do that? </p>\n<p>Example: how would something like \"brain fog\" get handled in FHIR?</p>\n<p>At DevDays we heard from <a href=\"https://www.epatientdave.com/2020/11/23/longcovid-patient-researcher-hannah-wei-kicks-off-fhir-devdays/\">15 min video</a> the LongCOVID community, particularly re the patient-led research team. Capturing their symptoms <em>as experienced by them</em> is essential to them; shoehorning reports into someone else's taxonomy is not useful.</p>\n<p>Fascinating short thread:<br>\n<a href=\"https://www.aapc.com/discuss/threads/diagnosis-code-what-dx-code.840/\">What dx code should be used for brain fog?</a></p>\n<blockquote>\n<ul>\n<li>maybe 348.8 or 348.9...</li>\n<li>I'd go with \"other\" symptoms - something with a code - was the patient dizzy? light headed? forgetful? headache? tingling?<br>\nsomething - some other symptom</li>\n</ul>\n</blockquote>",
        "id": 218313813,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606755423
    },
    {
        "content": "<p>For a patient to report? Likely this would be reported just using human narrative. And this is why all codes can be recorded just as free-text. Trying to nail down to a code something this nebulous is more likely to cause trouble than help.  For example the patient might choose ICD-10-PCS S06.2X0 (<a href=\"https://www.icd10data.com/ICD10CM/Codes/S00-T88/S00-S09/S06/S06.2-/S06.2X0\">https://www.icd10data.com/ICD10CM/Codes/S00-T88/S00-S09/S06/S06.2-/S06.2X0</a>) which might be right, but sure does imply some professional decision about a bunch of alternatives.</p>",
        "id": 218328950,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606762408
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> .  So I'm wondering - and I know this is vague: is there any way at all to use FHIR or anything else to collect and aggregate info about <em>recurring themes</em> in patient narratives, during the phase of a new condition where we don't yet know what \"things\" are worth turning into <em>named</em> \"things\"?</p>",
        "id": 218333992,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606764675
    },
    {
        "content": "<p>data mining??? Not very privacy friendly....   This is indeed the kind of \"normal operations\" that healthcare providers do under the conditions of HIPAA Treatment, Payment, and \"Normal Operations\".  A PHR product might include these kinds of carve-outs in their terms-and-conditions.  But would it be possible for this to be done on the scale of HL7 organization? No way.</p>",
        "id": 218334542,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606764941
    },
    {
        "content": "<p>one does tend to find that a vocabulary (e.g. LOINC, SNOMED, ICD, etc) do tend to know the common language terms that something specific is also-known-as. Where for any phrase there is likely a wide number of possibilities. Thus, given this, one could in their User-Interface suggest the alternatives in a pick-list. (I am doing this with a patient entered medication, lookup alternatives in RxNorm, and have the patient pick the best). The drawback is that the patient is just as likely to think the best is the right one, as to pick the best and have it be totally wrong. There is benefit to being vague, vs looking like you picked a specific value with intent.</p>",
        "id": 218335051,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606765200
    },
    {
        "content": "<p>this would be one use-case for CDS-Hooks (not the only one, and likely not a really good one)</p>",
        "id": 218335193,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606765258
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/How.20would.20pt.20defined.20symptoms.20work.3F/near/218334542\">said</a>:</p>\n<blockquote>\n<p>data mining??? Not very privacy friendly....   This is indeed the kind of \"normal operations\" that healthcare providers do under the conditions of HIPAA Treatment, Payment, and \"Normal Operations\".  A PHR product might include these kinds of carve-outs in their terms-and-conditions.  But would it be possible for this to be done on the scale of HL7 organization? No way.</p>\n</blockquote>\n<p>Ah, fascinating!  I  was in fact not thinking at ALL of any \"data mining\" being done by providers.  I was talking about some totally democratized workflow, not  necessarily involving any traditional providers.  Perhaps it could be among the BodyPolitic patient-led researchers ( <span class=\"user-mention\" data-user-id=\"361177\">@Hannah Wei</span> 's keynote)  to share data amongst themselves, in a format that can then easily be shared IF THEY WISH with other researchers globally, the CDC, whatever.</p>",
        "id": 218335552,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606765435
    },
    {
        "content": "<p>In that regard, it's not unlike what <span class=\"user-mention\" data-user-id=\"308467\">@Olivier Karasira</span> and <span class=\"user-mention\" data-user-id=\"297690\">@Hamish MacDonald</span> etc are doing, in creating data that's \"born free\" outside of any heath system.</p>",
        "id": 218335891,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606765597
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/How.20would.20pt.20defined.20symptoms.20work.3F/near/218335051\">said</a>:</p>\n<blockquote>\n<p>one does tend to find that a vocabulary (e.g. LOINC, SNOMED, ICD, etc) do tend to know the common language terms that something specific is also-known-as. Where for any phrase there is likely a wide number of possibilities. Thus, given this, one could in their User-Interface suggest the alternatives in a pick-list. (I am doing this with a patient entered medication, lookup alternatives in RxNorm, and have the patient pick the best). The drawback is that the patient is just as likely to think the best is the right one, as to pick the best and have it be totally wrong. There is benefit to being vague, vs looking like you picked a specific value with intent.</p>\n</blockquote>\n<p>Thanks for helping with my / our wandering on this, John.  I'll step back out of the weeds and \"genericize\" my question to this example:</p>\n<p>Let's say I have an odd symptom or syndrome that medical science has never seen, but I have absolutely established that it correlates with (or foretells) something else - diarrhea, premature ventricular contraction, leg cramps.  Is there anything in FHIR that would let me capture the occurrence of that symptom?  If I were as savvy as <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> or you, could I create my own FHIR extension? </p>\n<p>I find myself imagining a WITHIT resource: What In The Heck Is This.</p>",
        "id": 218336449,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606765868
    },
    {
        "content": "<p>Okay, very different mechanics to the same goal... I think... for your mechanics... I think a use of Condition would fit.  <a href=\"http://build.fhir.org/condition.html\">http://build.fhir.org/condition.html</a><br>\nIt would allow for the masses to submit how they perceive their conditions. The details can be vague or get linked tighter and tighter. The engine could then look for similarities, group them (affinitize). etc.<br>\nWhat you describe would require that submissions would need to be carefully watched to assure the data was always authentic (not scams), while not identifying (likely using a de-coupled pseudonymization mechanic).</p>",
        "id": 218337003,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606766158
    },
    {
        "content": "<p>this is not unlike what happens at google based solely on google search terms... it is why they are so good at what they do</p>",
        "id": 218337800,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606766511
    },
    {
        "content": "<p>You might choose to limit the data capture (on submission) to free-text perhaps with very high-level categorization codes to prevent misclassification by parents/care-givers who don't necessarily have a good grasp of the terminologies.  (Yes, some patients can probably code things better than the clinicians themselves, but those would be the minority.)</p>",
        "id": 218341554,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606768263
    },
    {
        "content": "<p>Thanks to both of you, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> and <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ... I'm starting to feel like I might get a grip on some part of FHIR reality. Time will tell.</p>\n<p>Really seems apt, though there's no chance I could have picked it out - </p>\n<blockquote>\n<p><strong>Condition</strong> is one of the event resources in the FHIR workflow specification.</p>\n<p>This resource is used to record detailed information about a condition, problem, diagnosis, or other event, situation, issue, or clinical concept that has risen to a level of concern. The condition could be a point in time diagnosis in context of an encounter, it could be an item on the practitioner’s Problem List, or it could be a concern that doesn’t exist on the practitioner’s Problem List. ...</p>\n</blockquote>",
        "id": 218379556,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606796624
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"361177\">@Hannah Wei</span> I'll tag you here in case you want to come find this later. LMK if the point isn't clear. Good comments especially from Lloyd and John.</p>",
        "id": 218379716,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606796827
    }
]