[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> or anyone, I worry when a call includes saying the same thing for the 47th time while 20 people sit through it again. (The specific was explaining the scope of Patient Request for Corrections. The questions were valid but have been gone over several times.)</p>\n<p>Is there a known-useful way to prevent this (e.g. posting a primer and stifling the question during the call) or is it just part of the process?</p>",
        "id": 238654538,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1620927631
    },
    {
        "content": "<p>the only way I have seen work is to have a good primer that you can direct the question off to. Most people are understandaing when they join a discussion that they are responsible for reading the primer.. but often they don't know what to read.</p>",
        "id": 238656441,
        "sender_full_name": "John Moehrke",
        "timestamp": 1620928596
    },
    {
        "content": "<p>Thanks!  So <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> and all of us involved (including me) maybe this ought to be a task.  Someone MIGHT assign it to me, since I brought it up ahem, and then lean on me to solve the problem.  (Sometimes I'm not ideally productive until leaned on)</p>",
        "id": 238656914,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1620928810
    },
    {
        "content": "<p>Having a primer is helpful - and would position you better than most work groups that encounter the same problem.  However, some degree of churn is inevitable.</p>",
        "id": 238658454,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620929479
    },
    {
        "content": "<p>We do have several slide decks that talk about the \"why\", \"what\", \"when\", \"who\", \"how\", and \"where\" of our project.  The question of scope that was brought up today is in several of the decks. </p>\n<p>But, I really don't mind having to answer questions again because it gives me an opportunity to hear a different angle that I might not have thought about in the past. I learn a lot from questions that are asked. </p>\n<p>I had a daughter who always asked me \"Why?\" when she was little. It seemed that no level of an answer was enough. I had to drill down and down into \"why\" and \"why\" (to the answer to the previous \"why\"). It was a good exercise to make me think about the real core of something. </p>\n<p>I also learn a lot when I hear other people answer questions. It brings me to another level of understanding (especially if I am new to the topic).</p>",
        "id": 238662829,
        "sender_full_name": "Debi Willis",
        "timestamp": 1620931623
    },
    {
        "content": "<p>Plus answering on the call will foster understanding amongst others who may be curious but won't be bothered to take the time to go read.  So long as the revisiting isn't taking too much time, I wouldn't worry about it much.</p>",
        "id": 238667029,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620933497
    },
    {
        "content": "<p>Glad I asked!</p>\n<p>Maybe we can do both - create a primer for those who want it, and still review for others who sort of \"stumble in\".  A good example in our case might be the people interested in Advance Directive Interop and haven't poked their noses into Patient Requests for Corrections yet.</p>\n<p>Done.</p>",
        "id": 238698399,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1620950198
    }
]