[
    {
        "content": "<p>Hi all - sorry for the extended holiday absence. My thoughts have been here but I've been tending the home fires.</p>\n<p>I've just been through a non-crisis but infuriating episode, all too familiar to American patients, and I wonder if in our optimal future world FHIR will help. </p>\n<p>I'm at the age where I need to get a routine screening exam.  My hospital and primary care are an hour away (at Beth Israel Deaconess in Boston), and I want to get it locally (at Dartmouth-Hitchcock, a mile from my home). But the bureaucracies at both places made it take WEEKS.  \"We can't schedule you until we have the documents we'll need, to ensure we'll get paid.\"</p>\n<p>The documents are (1) the pathology report from the previous exam 10 years ago, (2) the \"referral\" (my PCP's order for me to get the test done) - which, it turns out, is not simply his note to me in the portal - it's a separate page. </p>\n<p>Assuming both hospitals are fully FHIR-enabled someday (even without being clear on what that means), will I as a patient-side user be able  to  grab those documents from one hospital and transmit them?</p>\n<p>I imagine the answer involves whether \"referral\" is a document type FHIR knows about, and whether patient-side apps will be developed to (for instance) let me build my own library of documents by pulling things into it and then sending things out to others. </p>\n<p>Thoughts?</p>",
        "id": 154839838,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1547128463
    },
    {
        "content": "<p>Where business factors are getting in the way today... there is no Interop standard that can fix... The only way to fix this is to fix the business factors.</p>",
        "id": 154841396,
        "sender_full_name": "John Moehrke",
        "timestamp": 1547129868
    },
    {
        "content": "<p>where today you are not given the full fidelity of data... you will likely continue to not be given full fidelity data... even though FHIR makes it much easier to give it to you in full fidelity... so, positive is that FHIR does make it easier to encode everything, where as there is some data that exists in EHR proprietary format that \"might not\" be clear how to encode that in historic formats.  This said, this is only true if someone brings that internal data to FHIR for assessment on if it can be encoded. If they keep it proprietary, it will stay that way. --- light of day is important</p>",
        "id": 154841811,
        "sender_full_name": "John Moehrke",
        "timestamp": 1547130222
    },
    {
        "content": "<p>where today the new doctor refuses to schedule you because \"blah blah blah\"... that indicates some other business issue... Might truly payment based, might be behind-the-scene-business...</p>",
        "id": 154841939,
        "sender_full_name": "John Moehrke",
        "timestamp": 1547130309
    },
    {
        "content": "<p>If your old provider does indeed provide full fidelity, you could pull it yourself, and push it to your new provider...   but if your new provider doesn't trust that you have not altered the data (e.g. to make it look like you need narcotics), then they will be suspicious.   99% of all patients are acting in their best interests and not changing the data, but some are... whatever system is used to move data must protect against that 1%.  Or we accept that clinicians will always need to be suspicious of data that traveled through the patients hands.</p>",
        "id": 154842194,
        "sender_full_name": "John Moehrke",
        "timestamp": 1547130508
    },
    {
        "content": "<p>An alternative to having the data pass through patient hands is a workflow that allows a clinical system to query data directly.  If a patient can find the relevant data and then provide a pointer and authorization to the delivery organization, the delivery organization could then pull that data from the source system directly.  It might be useful for us to define the technical underpinnings of such a mechanism.  It wouldn't replace the need for patients to access data (you can't point to what you can't see), but it would eliminate the need for a potentially un-trusted pass-through and it would also eliminate the need for \"push\" of data which is more problematic in that it either requires agreement in advance about what data would need to be shared or requires a bunch of patient authorizations as the service provider decides they need \"just one more\" piece of data before taking action.</p>",
        "id": 154846810,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547134458
    },
    {
        "content": "<p>Of course, that doesn't eliminate the concern about business barriers.  However, if there's a standard technical solution, the business barriers can be surmounted with government legislation</p>",
        "id": 154846873,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547134513
    },
    {
        "content": "<blockquote>\n<p>If your old provider does indeed provide full fidelity, you could pull it yourself, and push it to your new provider... </p>\n</blockquote>\n<p>Here's a thought - all the geniuses wanted is an image of the referral; in fact they sent the sheets I gave them to the basement to be scanned into my EMR there.  </p>\n<p>So can we (all of humanity) somehow create an object RSCOSU (Random Screen Capture Of Something Unknown), for the patient to add to his/her record, and then provide a function to let ME (MY APP) BE THE ORIGINATOR of transmitting that to the receiving provider?</p>\n<p>Or am I really stretching things by using FHIR for this?</p>\n<p>(Disclosure: in the background I'm hoping that someday FHIR will just be \"the way everybody sends everything,\" as commonly as SMTP or HTTP, so wondering how we could tuck this obscure but real need into the FHIR talent suite.)</p>\n<p>If I'm being an abomination just say so.  But trust me, when/if consumers get their hands on FHIR tools, there will be no end to the number of things they'll want to do - just so that they don't need multiple other tools.</p>",
        "id": 154858117,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1547142726
    },
    {
        "content": "<p>FHIR has DocumentReference+Binary that can carry ANYTHING... so, no worry.</p>",
        "id": 154860848,
        "sender_full_name": "John Moehrke",
        "timestamp": 1547145064
    },
    {
        "content": "<p>yes we have the structures for this. the problems are business and policy.</p>",
        "id": 154986979,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1547305294
    }
]