[
    {
        "content": "<p>Interesting article on why patients won't embrace portals -- <a href=\"https://www.chilmarkresearch.com/why-wont-patients-embrace-portals/\" target=\"_blank\" title=\"https://www.chilmarkresearch.com/why-wont-patients-embrace-portals/\">https://www.chilmarkresearch.com/why-wont-patients-embrace-portals/</a></p>",
        "id": 185497736,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578925897
    },
    {
        "content": "<blockquote>\n<p>Interesting article on why patients won't embrace portals -- <a href=\"https://www.chilmarkresearch.com/why-wont-patients-embrace-portals/\" target=\"_blank\" title=\"https://www.chilmarkresearch.com/why-wont-patients-embrace-portals/\">https://www.chilmarkresearch.com/why-wont-patients-embrace-portals/</a></p>\n</blockquote>\n<p>John, could you edit the subject line, perhaps to say \"JAMA and Chilmark on portal usage\"?</p>\n<hr>\n<p>I'm so glad to see that Chilmark is pointing to solutions, because the original JAMA article was an offense against humanity!</p>\n<p>I'll be back later to discuss this, spitting some hellfire.  Some of us in the patient community are incensed that normally smart people in the medical community are so BLIND to the behavioral reality that if a portal contains very little info, consumers will have little reason to use it!  </p>\n<p>And what's really \"incensing\" about it is that ten years ago when this all started, those same forces (basically establishment medicine) insisted that portals be LIMITED to displaying very little information. </p>\n<p>This is a close parallel to the recent wars on social media about physicians hating EMR usability, and therefore hating the governments that mandated them (\"This is all Obama's fault\").  I was present in DC in 2010 when some EMR industry lobbyists were forcefully OBJECTING to the people in the Obama administration who wanted usability to be a criterion for an acceptable system.</p>",
        "id": 185498572,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1578926449
    },
    {
        "content": "<p>This retort on the subject just went live today, authored by five of us. <br>\n<a href=\"https://www.healthaffairs.org/do/10.1377/hblog20200108.82072/full/\" target=\"_blank\" title=\"https://www.healthaffairs.org/do/10.1377/hblog20200108.82072/full/\">Why Aren’t More Patients Electronically Accessing Their Medical Records? (Yet!)</a></p>",
        "id": 185498775,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1578926598
    },
    {
        "content": "<p>It's sort of like saying \"few people ask for their records from their accountants, so we shouldn't really worry about making those records accessible\".  Many people won't see a need or an interest.  But for those who have either, they should certainly have the right...</p>",
        "id": 185500825,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578927897
    },
    {
        "content": "<blockquote>\n<p>It's sort of like saying \"few people ask for their records from their accountants, so we shouldn't really worry about making those records accessible\".  Many people won't see a need or an interest.  But for those who have either, they should certainly have the right...</p>\n</blockquote>\n<p>Brilliant!  I've been waiting years for someone to come up with that analogy!</p>",
        "id": 185531799,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1578945917
    },
    {
        "content": "<p>The argument that I might well not understand the records I get from my accountant holds too - but if I care to, I can certainly find someone who can explain them to me, or find tools or people who can extract whatever I decide I need.</p>",
        "id": 185543080,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578953214
    }
]