[
    {
        "content": "<p>Hello All,<br>\nI'd like to take a moment to invite everyone attending the virtual ONC Interoperability Forum to attend the \"FHIR Endpoint Discovery and Monitoring\" Working session tomorrow from 11:00-12:00ET. We will be talking about the challenges involved in creating a centralized endpoint repository and will also be debuting the Lantern tool -- A tool for monitoring lists of endpoints for availability and conformance by regularly querying FHIR endpoint capability statements. If you can't make the presentation feel free to checkout the Lantern site here: <a href=\"https://lantern.healthit.gov/\">https://lantern.healthit.gov/</a>. If you have questions about Lantern, notice any data discrepancies or have a public list of FHIR endpoints that we are not yet indexing please reach out to us at <a href=\"mailto:LanternSupport@groups.mitre.org\">LanternSupport@groups.mitre.org</a></p>\n<p>Thanks!</p>",
        "id": 206493699,
        "sender_full_name": "Matt Mayer",
        "timestamp": 1597083284
    },
    {
        "content": "<p>This is great work, Matt.  I wanted to tune into the talk, but as a late registrant didn't get the videoconference links.</p>\n<p>Does Lantern support <code>GET /Endpoint</code> for the latest up-to-date endpoint collection?  Or is it only available via download right now?</p>",
        "id": 206838919,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1597336780
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191678\">Abigail Watson</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Lantern/near/206838919\">said</a>:</p>\n<blockquote>\n<p>This is great work, Matt.  I wanted to tune into the talk, but as a late registrant didn't get the videoconference links.</p>\n<p>Does Lantern support <code>GET /Endpoint</code> for the latest up-to-date endpoint collection?  Or is it only available via download right now?</p>\n</blockquote>\n<p>Hi Abigail,</p>\n<p>Right now, the endpoint collection is only available via the download link. We are considering making our data available RESTfully in the future.</p>\n<p>-Matt</p>",
        "id": 206921685,
        "sender_full_name": "Matt Mayer",
        "timestamp": 1597406349
    }
]