[
    {
        "content": "<p>Here is his obituary. Oddly (to me) it describes him as an attorney, not a developer, but it certainly seems to be him. <a href=\"https://www.legacy.com/obituaries/sfgate/obituary.aspx?n=michael-morris&amp;pid=190894039&amp;fhid=2782\" target=\"_blank\" title=\"https://www.legacy.com/obituaries/sfgate/obituary.aspx?n=michael-morris&amp;pid=190894039&amp;fhid=2782\">https://www.legacy.com/obituaries/sfgate/obituary.aspx?n=michael-morris&amp;pid=190894039&amp;fhid=2782</a> </p>\n<p>I hope the work he created will not be lost, so I posted an inquiry on the Curesoft site's contact form to see if anyone responds.  If not, the obituary lists numerous names to try.</p>\n<p>(If he was primarily an attorney it underscores that his work didn't require being a career developer.)</p>",
        "id": 158035850,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1549897134
    },
    {
        "content": "<p>Oh wow, so sad to see this (and only seeing this now), I thought we was doing better back in November! <span aria-label=\"sad\" class=\"emoji emoji-2639\" role=\"img\" title=\"sad\">:sad:</span></p>",
        "id": 158468096,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1550084976
    },
    {
        "content": "<p>All, FYI - last month I got this message from Mike's business partner Dan Fobes <a href=\"mailto:dan@curesoft.com\" title=\"mailto:dan@curesoft.com\">dan@curesoft.com</a>:</p>\n<blockquote>\n<p>Mike and I worked together deploying monitoring solutions for data centers then turned our focus to cancer patients which is how Curesoft came about. </p>\n<p>I’m working with Mike’s family to continue the mission of Curesoft. We all believe this could be the foundation for healthcare and how cancer patients are treated. Mike and I started this about 3 years ago after he was diagnosed, and my dad had just passed with an almost identical diagnosis as Mike. </p>\n<p>Hope to have updates soon. </p>\n</blockquote>",
        "id": 161190780,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1553030210
    }
]