[
    {
        "content": "<p>My Rx insurance plan sent my doctor a false notice that I'm non-compliant, and in 50 minutes on the phone NOBODY CAN FIGURE OUT WHERE IT CAME FROM. (I don't fault them - they were all intelligent &amp; caring &amp; working hard.)</p>\n<p><a href=\"https://threadreaderapp.com/thread/1300552222208651268.html\">Fistfight has begun on Twitter</a></p>",
        "id": 208620697,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1598911236
    },
    {
        "content": "<p>Are you Richard or Dave?</p>",
        "id": 208625564,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1598914486
    },
    {
        "content": "<p>If you have an Anthem member portal login you can get the myFHR app on your phone and download all the data they have about you</p>",
        "id": 208627216,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1598915650
    },
    {
        "content": "<p>I'll be updating this</p>",
        "id": 208994613,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1599150690
    },
    {
        "content": "<p>im bringing popcorn to the workgroup call today. <span aria-label=\"popcorn\" class=\"emoji emoji-1f37f\" role=\"img\" title=\"popcorn\">:popcorn:</span></p>",
        "id": 208996016,
        "sender_full_name": "John Moehrke",
        "timestamp": 1599151281
    },
    {
        "content": "<p>I won't spend workgroup time on it - it's a classic example of something best done in a chat app where people can skip it <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>  </p>\n<p>It turns out to be a War Of The Blind Robots story.  </p>\n<ol>\n<li>When I signed up with Anthem, they defaulted me into an MTM program - medication therapy management - without telling me what I was getting into.  </li>\n<li>When I tried to have my blood pressure med filled at CVS, with a minimal co-pay for 90 days, their computer couldn't reach Anthem's, so I said screw it and said never mind the insurance. </li>\n<li>Uh-oh: the robot said \"WE HAVEN'T SEEN HIM BILL US FOR THIS MEDICATION THAT WE WON'T PAY FOR ANYWAY!!!\"  Boom: non-compliance letter, generated (apparently) but an Anthem subsidiary, which <em>none of the phone customer service people have been told about.</em></li>\n<li>In parallel, btw, unrelated to Anthem, CVS's robot had a similar freak-out and kept robo-calling me, telling me it was time to order a refill, even while I had a 90 day supply in my medicine cabinet, <strong>from</strong> CVS. </li>\n</ol>\n<p>I firmly believe we need a rigorously defined term for artificial opposite-of-intelligence, with subtypes for false assumptions, e.g. \"If he didn't tell us, it must be that he's non-compliant.\"</p>\n<p>CVS has lost all my business, btw, because their nag-bot recording did not have a menu option for \"stop calling me.\"  Even the store personnel couldn't do that.  To shut it off they <em>required</em> me to call a different 800 number and talk to a human.</p>\n<p>Anthem has accepted all my info and says they're looking into it.</p>",
        "id": 208997699,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1599152035
    },
    {
        "content": "<p>This is why AI should be seen as assisting, not doing without oversight.  This was a lesson learned 20 years ago in the medical device industry with algorithms designed to do data analysis. EKG analysis, image analysis, etc....</p>",
        "id": 209004387,
        "sender_full_name": "John Moehrke",
        "timestamp": 1599154925
    },
    {
        "content": "<p>As a wise tweet once pointed out:::: If all your friends are jumping off a cliff, an AI / ML algorithm would push you off.</p>",
        "id": 209004471,
        "sender_full_name": "John Moehrke",
        "timestamp": 1599154977
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/My.20upcoming.20fistfight.20with.20Anthem.20for.20a.20correction/near/209004471\">said</a>:</p>\n<blockquote>\n<p>If all your friends are jumping off a cliff, an AI / ML algorithm would push you off.</p>\n</blockquote>\n<p>Which is EXACTLY the opposite outcome of how my mother taught that scenario.</p>",
        "id": 209007670,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1599156491
    },
    {
        "content": "<p>Why did your mother know about AI/ML?</p>",
        "id": 209008130,
        "sender_full_name": "David Pyke",
        "timestamp": 1599156696
    },
    {
        "content": "<p>She knew nothing of algorithms, except one: her only framework was (and is) CS.  (Common sense.)  Use case:</p>\n<p>Me: \"But all my FRIENDS are doing ____[fill in the blank]_____\"<br>\nMom: \"If all your friends were jumping off a cliff, would you??\"</p>",
        "id": 209008226,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1599156731
    },
    {
        "content": "<p>AI/ML algorithms need to a) be explainable, and b) have different 'gears' that they can shift between.  I.e. putting them in forward, reverse, neutral, etc.  With healthcare algorithms, that would probably be 'cost minimizing', 'life maximizing', 'comfort maximizing', 'risk reduction', etc.</p>",
        "id": 209008246,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1599156739
    }
]