[
    {
        "content": "<p>Trying to find a nice name.  How about patient experience council or group?  PXC PXG?  I like PXG better than PIG (ahem) and PIC is already taken.  Otherwise patient empowerment group or council but I think the X is there is kind of cute.</p>",
        "id": 176068406,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1568867735
    },
    {
        "content": "<p>Or, how about something like Patient Requirements Group (PRG), Patient Needs Group (PRG), Patient Review Group (RG), or Patient Specifications Group (PSG).  Or, a simpler form of what you suggested Patient Council (PC).</p>",
        "id": 176074104,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1568876447
    },
    {
        "content": "<p>I like Patient Council but how can it not be a TLA?</p>",
        "id": 176082062,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568885175
    },
    {
        "content": "<p>The formal name will be \"x Work Group\" (not 'council' or 'Group', etc.).  Traditionally, the \"WG\" piece is never part of the acronym because it applies everywhere.  The only exceptions are for bodies that <em>aren't</em> Work Groups.  (And we don't want to do anything that suggests we're not a normal work group.)</p>\n<p>Also, most work group names are actually two-letter acronyms - PA, PC, FM, OO, etc. </p>\n<p>I like \"Patient Empowerment\" because it seems more active and broader than \"Patient Experience\".  The latter seems similar to \"User Experience\" where the focus is on the front end look &amp; feel and not necessarily capability.  That said, I could live with PX if that's the preference of the group.  I'm not a huge fan of \"requirements/needs/review\" because that sounds like the patient group isn't going to create specifications itself - and I don't think that's true.</p>",
        "id": 176092715,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568895265
    },
    {
        "content": "<p>Good thread, thanks.   </p>\n<p>IMO we need to be conscious of how different terms are used by others.  <br>\n- <strong>Patient Experience</strong> (at least in the US) is commonly about utterly non-clinical things, from pretty lobbies to how good the food is (and some clinical things). <br>\n- <strong>Patient Empowerment</strong> is easy to support for our group, particularly in light of <a href=\"https://www.epatientdave.com/2016/01/07/its-time-to-adopt-a-good-working-definition-of-empowerment/\" target=\"_blank\" title=\"https://www.epatientdave.com/2016/01/07/its-time-to-adopt-a-good-working-definition-of-empowerment/\">my favorite definition of empowerment</a> (which this group may wish to formally adopt, in any event).<br>\n- <strong>Patient Advocacy</strong> may be good, though I caution against Patient <em>Advocate</em>, because (in the US) a \"patient advocate\" is generally someone at the patient's bedside who protects against errors and often fights back against omissions and errors, speaking up for the sick person who's unable. </p>\n<p>I know PC is taken (Patient Care), and so is PA (Administration). Is PE?</p>",
        "id": 176102954,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568902128
    },
    {
        "content": "<p>PE is not taken.</p>\n<p>I prefer \"empowerment\" over \"advocacy\" because the former deals with enabling, while the latter only involves \"speaking on behalf of\".  Obviously advocacy is one of the things needed to deliver empowerment, but you can be done 'advocating' but not actually delivered 'empowerment'.</p>",
        "id": 176107819,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568905138
    },
    {
        "content": "<p>Who will write an update memo (email?) to the others who volunteered in the GDoc, updating them? I'm happy to collaborate</p>",
        "id": 176108623,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568905587
    },
    {
        "content": "<p>Lets wait until we have a 'final' proposal, then we can send it out by email and make sure everyone who is listed is supportive of the final language.</p>",
        "id": 176116863,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568910716
    },
    {
        "content": "<p>Just a thought on the name - and maybe the name can evolve - but I have heard many patient advocate leaders that do not like the term 'patient'.   Especially as we move to health, not everyone is sick all the time, and many preventive services are offered/will be offered outside traditional health care settings.  I am not particularly sensitive about this myself, but I  wanted to note it.  We could use the word consumer to represent a broader set of stake holders.  What about Patient and Consumer Empowerment (PACE)?</p>",
        "id": 176117205,
        "sender_full_name": "Rachel Richesson",
        "timestamp": 1568910945
    },
    {
        "content": "<p>Agreed, Rachel - that's part of the ongoing evolution of roles.</p>",
        "id": 176119407,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568912466
    },
    {
        "content": "<p>The same happens with \"consumer.\"  Some hear it as \"pawn of the buy-buy-buy system\"; others hear it as \"empowered buyer who knows what s/he wants and seeks information and buys only out of choice.\"  (Guess which one I am :-))</p>\n<p>Personally I've come to see it as totally dependent on context.  When I'm shopping for a medicine, I'm acting as a consumer in a commercial transaction.  When I'm the one with a medical need, I'm the patient.</p>",
        "id": 176119577,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568912590
    },
    {
        "content": "<p>I'm open to discussion but I do want to caution us not to get wrapped around the axle on this one, because \"person\" (an often recommended word) also applies to the IT workers. So I vote for \"patient\" - and for saying why, because we do recognize the varying points of view.  As I say, to me those POVs are the contexts in which the words have meaning.</p>",
        "id": 176119674,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568912653
    },
    {
        "content": "<p>Patient has a strong meaning in HL7. So this is one area where Hl7 might be special.</p>",
        "id": 176129432,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568918708
    },
    {
        "content": "<p>Can you (perhaps briefly) say what that meaning is?  (Perhaps we should make that, too, clear.)</p>\n<p>As it happens, yesterday I sat in on the Vocabulary session, where the subject was terminology for sex and gender. Sex is less controversial but gender can get very sensitive, because it quickly becomes a question of \"who gets to say what I am?\"  Bingo: our same question. </p>\n<p>(FWIW, the WHO and LOINC (and someone else) have definitions that are not dissimilar but not at all identical.)</p>\n<p>If I recall correctly, one outcome of the meeting was to state clearly what we mean, and that we're fully aware of the importance of this issue to some parties.</p>",
        "id": 176130062,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568919137
    },
    {
        "content": "<p>yes. well, we don't have make policy, fortunately, just clearly state how you say what you mean given a policy</p>",
        "id": 176130441,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568919363
    },
    {
        "content": "<p>Sorry for the digression, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - again, can you say what HL7's strong meaning of \"patient\" is?</p>",
        "id": 176131214,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568919862
    },
    {
        "content": "<p>We've debated before that \"patient\" is just one part of a person's life experience. And so there was a proposal to change the \"Patient\" resource to \"Consumer\" or something. But after a long discussion, we chose to stick with \"Patient\" since that's our focus: the provision of care, across the spectrum. Hence, also, Patient Administration and Patient Care</p>",
        "id": 176135281,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568922634
    },
    {
        "content": "<p>In HL7, Patient is any actual or potential recipient of care.  A person can only play one of three roles: Patient (an actual or potential recipient of care), RelatedPerson (someone who acts on behalf of a Patient by nature of their personal relationship with the Patient) an Practitioner (someone who acts in their professional capacity - includes clinicians, but also receptionists, taxi drivers, etc.)</p>",
        "id": 176138725,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568924864
    },
    {
        "content": "<p>Thanks, guys! We (at least I) will need this background published somewhere as we start \"coming out\" to the more general public. Is there a standard place where HL7 groups post such things while they're fermenting? Confluence?</p>",
        "id": 176143524,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568928350
    },
    {
        "content": "<p>Starting a FAQ page on Confluence is probably the best path</p>",
        "id": 176144259,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568928837
    },
    {
        "content": "<p>Pretty soon I'm gonna be needing a confluence app for this phone...</p>",
        "id": 176144357,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568928890
    },
    {
        "content": "<p>There is one for iPhones...</p>",
        "id": 176144639,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568929098
    },
    {
        "content": "<p>Two, actually - Cloud and Server. The one I need is apparently Server.</p>\n<p>We have drifted off Name of  Group</p>",
        "id": 176144738,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568929199
    },
    {
        "content": "<p>TLA = two letter acronym?  or three? :) PC is good with me.  Or PE - all are fine.</p>",
        "id": 176156607,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1568942100
    },
    {
        "content": "<p>PC already exists - \"Patient Care\" work group</p>",
        "id": 176158198,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568944212
    },
    {
        "content": "<p>There are people who hate the word consumer too, so I think patient is the safest.</p>",
        "id": 176163450,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1568952304
    }
]