[
    {
        "content": "<p>I'm putting this in the patient empowerment stream because I don't know of a better place for it, but it will need visibility among FHIR's strategy thinkers.</p>\n<p>In yesterday's webinar for non-technicians  <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> said a principal goal of FHIR is to democratize health IT.  Two thoughts:</p>\n<ul>\n<li>Have we defined \"democratize\"? </li>\n<li>Presuming we mean to put power (access &amp; control of data) in the hands of the citizen, this chat page will need a home for newbies who aren't technicians.  I don't know exactly what \"a home\" means, but it includes:<ul>\n<li>A dedicated stream (or set of streams maybe)</li>\n<li>A community of folks who welcome and patiently support clueless newbies who truly want to learn.</li>\n<li>And probably some carefully evolved tutorial videos</li>\n</ul>\n</li>\n</ul>",
        "id": 161257006,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1553095086
    },
    {
        "content": "<p>Putting power in the hands of citizens is certainly part of it.  The other is making good healthcare analytics, data sharing, etc. available to lower income countries so that quality of care  starts to have less variability driven by where you are or how much money you have.</p>\n<p>The 'implementers' stream tends to be pretty welcoming and patient with newbies.  (To be honest, driven patients are often much less clueless than many of those who arrive here for help :))  However, we can certainly create a targeted stream if there's interest - and if this stream isn't the right one.)</p>",
        "id": 161269978,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553102553
    },
    {
        "content": "<p>Thank you, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> !  I have no  desire to create a stream if our current set has no unfilled needs. Perhaps we just keep an eye on it.</p>\n<p>It will be a great day when we have so many highly motivated people that we need a separate stream. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span>  Perhaps we'll find is that all we need is a \"start here\" orientation for non-coders.</p>",
        "id": 161270185,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1553102675
    },
    {
        "content": "<p>I would have thought the patient empowerment stream would be the best for now. I suspect the implementers stream could be a bit overwhelming for non-technical folk...  (both in terms of volume and content)</p>",
        "id": 161271786,
        "sender_full_name": "David Hay",
        "timestamp": 1553103544
    },
    {
        "content": "<blockquote>\n<p>And probably some carefully evolved tutorial videos<br>\nWe can certainly help to create those. However, this will have to be a cooperative effort between people like you who realise what FHIR value is for patients, and the (more technically minded) FHIR community. David is quite able to talk about FHIR from a clinician's perspective, which may be closer to what we need than a talk about FHIR from a software developer's perspective, or from a Health IT managers perspective. We have educational material geared to those audiences, but to create a good quality tutorial (video) we'd need to pick and choose. <br>\nWill you be attending the FHIR DevDays in  Redmond? I'd like to suggest some sort of brainstorm session between the current FHIR educators  and yourself to ensure we pick the right \"unique selling points\" for newbie (to FHIR) patients.<br>\nAFAIK you have also been asked to help in the creation of a \"FHIR Summary for patients\" page (to be included in the FHIR spec), that would tie in with this effort.</p>\n</blockquote>",
        "id": 161273274,
        "sender_full_name": "René Spronk",
        "timestamp": 1553104373
    },
    {
        "content": "<blockquote>\n<p>Will you be attending the FHIR DevDays in Redmond?</p>\n</blockquote>\n<p>I'd dearly love to but am on my own financially so would love to find a sponsor.  Amsterdam was entirely at my own expense and I don't think I can afford another.  So if anyone thinks of an interested sponsor, please connect us!</p>\n<blockquote>\n<p>cooperative effort</p>\n</blockquote>\n<p>Absolutely!  Happy to be as involved as my availability allows.</p>",
        "id": 161281666,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1553109327
    },
    {
        "content": "<p>A starter would be any ideas you'd have for the creation of a \"FHIR Summary for patients\" page (to be included in the FHIR spec)...</p>",
        "id": 161323564,
        "sender_full_name": "René Spronk",
        "timestamp": 1553153877
    },
    {
        "content": "<p>I think this stream is a good place to discuss high and medium level patient empowerment use-cases. When they move to technical implementer topics they would find a more helpful group in the <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a> stream. That said, both are good.</p>",
        "id": 161354118,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553180873
    },
    {
        "content": "<p>Good thought, John!</p>\n<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> I have been keen to start something like that since Amsterdam.  I need someone who can provide a fair amount support (to make sure I'm accurate and clear) with quick turnaround.  I wonder if <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> would be game, since he's been a fan of this consumer thing since as far back as I can remember. :-)</p>",
        "id": 161378602,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1553196486
    },
    {
        "content": "<p>I'd post your thoughts where they are accessible (like a google doc) and invite comments...</p>",
        "id": 161397812,
        "sender_full_name": "David Hay",
        "timestamp": 1553204249
    },
    {
        "content": "<p>Agreed, and would be happy to help with feedback! (The quick turnaround bit, well, this past week has been travel :/)</p>",
        "id": 161781668,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1553619567
    }
]