[
    {
        "content": "<p>Susannah Fox's always-insightful blog recently <a href=\"https://susannahfox.com/2020/01/17/why-i-finally-signed-up-for-health-data-access/\" target=\"_blank\" title=\"https://susannahfox.com/2020/01/17/why-i-finally-signed-up-for-health-data-access/\">posted a story</a> with a perfect anecdote, resonating with the stories we've heard from Mike Morris, the Sheridans, etc.  Excerpt:</p>\n<blockquote>\n<p>I was trying to decide how best to prepare for an upcoming appointment with a new allergist for my son. ...  I was able to get access to his basic test results through Epic’s MyChart system at Hopkins. </p>\n<p>But I noticed that there was not one comprehensive view of all the tests over time. I was going to have to create my own spreadsheet and laboriously cut and paste the 100 results (20 allergens X last 5 years) in order to give the new allergist a good overview of his progress. ...</p>\n<p>During our second visit to Hopkins the nurse turned her screen toward me and I saw that the industrial-strength Epic <strong>(what the clinicians use)</strong> had a beautiful longitudinal chart of all his results. I eagerly asked if she could print it for me and voila! I had something useful to share with the new clinical team (even if it was on paper and delivered by sneaker-net).</p>\n<p>We just got back from our appointment with the new allergist and it was 100% worth the six-month wait to get in to see him AND 100% worth the trouble to get all those test results in one document. We now have an excellent second opinion and new work plan. </p>\n<p>Sadly, the new allergist uses Cerner’s EMR system, so of course we can’t share records between their system and Hopkins. Sigh.</p>\n</blockquote>\n<p>Remember the World Bank's definition of empowerment - increasing people's capacity to make choices and take effective action. Clearly Susannah (and her son, as an adult) will be empowered when FHIR is in full bloom.</p>\n<p>Note too the cruelty of having the longitudinal info in the system and just plain refusing to show it to the people in need. Here's to the ecosystem that will bring this tyranny to the ground :-)</p>",
        "id": 187313206,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1580769743
    },
    {
        "content": "<p>It'd be useful to figured out what went wrong here, on two levels. 1) my understanding is that MyChart will draw longitudinal graphs for a given lab result, so I wonder why these allergens didn't count. 2) Johns Hopkins is live with the FHIR API, so maybe it's just that nobody has built a 3rd party app that does anything good with allergy results -- or possibly apps do exist but aren't widely known?</p>",
        "id": 187313636,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1580770069
    },
    {
        "content": "<p>IF the data was not showing up in myChart I doubt it would show up in the FHIR end point</p>",
        "id": 187314145,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1580770436
    },
    {
        "content": "<p>I thought the data were showing up but were not <em>visualized</em> in a helpful way</p>",
        "id": 187314213,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1580770460
    },
    {
        "content": "<p>Ah yes, I misread it</p>",
        "id": 187318419,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1580774308
    },
    {
        "content": "<p>The feature for pulling outside data into a longitudinal view is Happy Together. Some of the features are on by default but others rely on additional licensing by the healthcare organization, I believe. </p>\n<p>MyChart does have the ability to show data from outside organizations but i believe that's in the latter category.</p>",
        "id": 187330417,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1580791804
    },
    {
        "content": "<p>The issue here wasn't about viewing combined or outside data though, if I'm reading correctly: it was an issue viewing Hopkins data in the Hopkins MyChart.</p>",
        "id": 187330485,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1580791925
    },
    {
        "content": "<p>Specifically, all the expected data were there; it was the visualization that was missing.</p>",
        "id": 187330490,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1580791950
    },
    {
        "content": "<p>Thanks for engaging on this question. The issue was that there was no visible way for me to see ALL of my son's comprehensive, longitudinal test results, whether it was rendered as a visualization OR as a table. I could view just walnut, just cashew, etc. which is not useful when bringing an allergy patient's records to a new clinician who will want to scan all the results to look for patterns (mango is related to some tree nuts; peanut is related to some environmental allergies, etc.)</p>",
        "id": 190082283,
        "sender_full_name": "Susannah Fox",
        "timestamp": 1583768297
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"270008\">Susannah Fox</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Next.20user.20story.20-.20why.20we're.20doing.20this/near/190082283\" title=\"#narrow/stream/179262-patient-empowerment/topic/Next.20user.20story.20-.20why.20we're.20doing.20this/near/190082283\">said</a>:</p>\n<blockquote>\n<p>The issue was that there was no visible way for me to see ALL of my son's comprehensive, longitudinal test results, whether it was rendered as a visualization OR as a table. I could view just walnut, just cashew, etc. which is not useful when bringing an allergy patient's records to a new clinician who will want to scan all the results to look for patterns (mango is related to some tree nuts; peanut is related to some environmental allergies, etc.)</p>\n</blockquote>\n<p>First, <span class=\"user-mention\" data-user-id=\"270008\">@Susannah Fox</span>, sorry for misunderstanding - I totally didn't get that impression from the post. </p>\n<p>Everyone, does any such app exist, to let a user cobble together any set of metrics into their own custom view?  Or is this a great idea of what a Patient Innovator (like <span class=\"user-mention\" data-user-id=\"251396\">@John Keyes</span>) might do?  Or <span class=\"user-mention\" data-user-id=\"251190\">@Kristina Sheridan</span> ?</p>\n<p>And does anyone know whether under the newly released Final Rules, the data Susannah wants to aggregate would be addressable with existing FHIR stuff, or would this be an example of something user-defined?  (Not sure who \"user\" would be in this case...)</p>",
        "id": 190221628,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583872699
    },
    {
        "content": "<p>The new rule sets FHIR 4.0 as the standard.  And, unfortunately, only a very small portion of the market has implemented FHIR 4.0 at this time.  And, depending on which adoption forecaster you believe, it will probably take at least 3-5 years or more to get 80% or more of the health providers to implement FHIR 4.0 in production.</p>",
        "id": 190225498,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1583874791
    },
    {
        "content": "<p>Looks like we'll need to advocate for some sort of tracking project, then.  </p>\n<p>I have to say, I want everything now, but after 10 years of advocating for where we are, I'm heartened to see some progress.  </p>\n<p>Is there any way we could create some well deserved recognition for hospitals who are way out in front on this?  If, for instance, Mayo Clinic or Boston Children's Hospital or MD Anderson has it really working a year from now, and others don't, I'd sure want to know that when trouble hits.</p>",
        "id": 190227134,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1583875578
    }
]