[
    {
        "content": "<p>Hey everyone - Celebrating Thanksgiving here in the US.  One thing I am thankful for:<br>\nPatient Empowerment is now an HL7 Workgroup!  <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span> I believe in my heart that this is a wonderful thing.  We already have a home on confluence, a list server, a standing conference call on Thursdays at 1PM Eastern (canceled for this Thursday), and great participants.  Please feel free to join us! <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 182050447,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1574882487
    },
    {
        "content": "<p>I believe it is a wonderful thing also! Thank you to the HL7 members and organization for seeing the value in establishing this group. FHIR is a breakthrough for patient access to their data. I believe patients will be a driving force to highlight the success of all the hard work from so many people involved in the development of FHIR.</p>",
        "id": 182052467,
        "sender_full_name": "Debi Willis",
        "timestamp": 1574883882
    },
    {
        "content": "<p>will Patient Empowerment be meeting in Sydney?</p>",
        "id": 182054935,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574885732
    },
    {
        "content": "<p>[Raising hand eagerly, praying for grant support :-)]</p>",
        "id": 182056059,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1574886649
    },
    {
        "content": "<p>I won’t be able to make it to that one. It’s too close to Himss and we will be deep into our development and testing for our interoperability use case. 😒</p>",
        "id": 182058347,
        "sender_full_name": "Debi Willis",
        "timestamp": 1574888528
    },
    {
        "content": "<p>I can't go and we currently have no rooms booked.  But that being said it at least needs to be announced and it would probably be good for there to be some kind of gathering.  Need to figure out who is going.  In May I am thinking we should meet and have a BOF and maybe a track at Clinicians on FHIR (Patients on FHIR).  Anyway those are just my thoughts.  Austin suggested a write up in the newsletter which sounds smart to me as well.</p>",
        "id": 182061718,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1574891585
    },
    {
        "content": "<p>I will be in Sydney, so willing to meet.</p>",
        "id": 182066873,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574896420
    },
    {
        "content": "<p>I will be in Sydney but not sure I'll have much availability</p>",
        "id": 182071718,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574900990
    }
]