[
    {
        "content": "<p>Good read: Timothy Snyder:  \"What Ails America\" <a href=\"https://www.nybooks.com/daily/2020/09/03/what-ails-america/\">https://www.nybooks.com/daily/2020/09/03/what-ails-america/</a></p>",
        "id": 209235899,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1599416693
    },
    {
        "content": "<p>I will repeat what I first said in 2015 on PatientPower and repeated in 2018 on Tincture, in my series leading to the need for FHIR:<br>\n[American healthcare is a malignant tumor that can't stop killing its host.[(<a href=\"http://dave.pt/MalignantHC]\">http://dave.pt/MalignantHC]</a></p>\n<blockquote>\n<p>Did you know 42% of (U.S.) cancer patients exhaust their life savings within two years, and 38% are bankrupt after four years?</p>\n</blockquote>\n<p>As the post says, this is actually (no joke) referred to as \"financial toxicity.\"  I participated in workshop of that name at the National Academy of Medicine. The gone-mad US health system can't even figure out how to <em>talk</em>  about the subject unless it's framed as a medical issue: \"Oh!  You mean we're KILLING them!  Well THAT we know how to talk about.\"</p>\n<p>Except as far as I can tell not a single change came out of that workshop.  Another report, yes, but no change.</p>\n<p>I think (honestly) we have crossed a threshold akin to the \"vanishing point\" around a black hole. There's so much money at stake that it's no longer possible to convince enough people to give up their source of income. Truly like a malignancy, it will continue until the system collapses disastrously.</p>\n<p>I would of course be very happy to learn of ideas for any path to stop the trend - bring it on!</p>",
        "id": 209424427,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1599589160
    },
    {
        "content": "<p>It's a horrifying essay about medical ****-ups (even at an allegedly great university hospital) but then my point arrives:</p>\n<blockquote>\n<p>Our system of commercial medicine, dominated by private insurance, regional groups of private hospitals, and other powerful interests, looks more and more like a numbers racket. </p>\n<p>We would like to think we have health care that incidentally involves some wealth transfer; what we actually have is wealth transfer that incidentally involves some health care.</p>\n</blockquote>",
        "id": 209425656,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1599589777
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> I did not know the figures: \"42% of US cancer patients exhaust their life savings in 2 years, 38% are bankrupt after 4 year\".   Alternative revenue flows that benefit the patient as well as the system are necessary. It always comes down to the money...</p>",
        "id": 209576478,
        "sender_full_name": "Hamish MacDonald",
        "timestamp": 1599690606
    },
    {
        "content": "<p>These are powerful statistics!  Would you happen to know the source of the statistics?</p>",
        "id": 209598216,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1599716773
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"216345\">Bart Carlson</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/On.20health.20and.20freedom/near/209598216\">said</a>:</p>\n<blockquote>\n<p>These are powerful statistics!  Would you happen to know the source of the statistics?</p>\n</blockquote>\n<p>Dave's post links to this article: <a href=\"https://www.beckershospitalreview.com/finance/cancer-forces-42-of-patients-to-exhaust-life-savings-in-2-years-study-finds.html\">https://www.beckershospitalreview.com/finance/cancer-forces-42-of-patients-to-exhaust-life-savings-in-2-years-study-finds.html</a></p>",
        "id": 209606846,
        "sender_full_name": "Eduardo Ferreira",
        "timestamp": 1599725101
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"247500\">Eduardo Ferreira</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/On.20health.20and.20freedom/near/209606846\">said</a>:</p>\n<blockquote>\n<p>Dave's post links to this article: <a href=\"https://www.beckershospitalreview.com/finance/cancer-forces-42-of-patients-to-exhaust-life-savings-in-2-years-study-finds.html\">https://www.beckershospitalreview.com/finance/cancer-forces-42-of-patients-to-exhaust-life-savings-in-2-years-study-finds.html</a></p>\n</blockquote>\n<p>Thank you!  I was offline too long this weekend, in my earnest attempts to have a LIFE. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> </p>\n<p>For many Americans it's important to note that the article is not in some anti-establishment patient blog; it's in one of the leading magazines of the hospital industry.  (I say this because sometimes when an embarrassing statistic is pointed out, the embarrassed person jumps to the conclusion that it must have been published by an enemy, not an ally!)</p>\n<p>The reality is that the structure of US healthcare is built and ruthlessly optimized around the financial <em>needs</em> of every participant in the industry, not on the medical needs of the supposed beneficiary.  I first realized this in 2009 in <a href=\"http://patientdave.blogspot.com/2009/02/thousand-points-of-pain.html\">A thousand points of pain</a> and have seen countless additional evidence since then and not a single bit of evidence against.</p>\n<p>It's important to note that most people working in the system have not a clue about the devil-ship they're riding on - they're just doing their jobs in what they <em>thought</em> was a good company in a worthy profession. It's indeed a worthy profession but time after time I hear from workers who try their utmost to provide genuine care and are blocked, hurried, or pressured, or later discover their employer charged an absurd amount.</p>\n<p>From Sept 5: <br>\n<a href=\"https://www.propublica.org/article/a-doctor-went-to-his-own-employer-for-a-covid-19-antibody-test-it-cost-10-984\">A Doctor Went to His Own Employer for a COVID-19 Antibody Test. It Cost $10,984. The insurer paid in full.</a></p>",
        "id": 210042662,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600107115
    }
]