[
    {
        "content": "<p>There's a relevant thread in <a class=\"stream\" data-stream-id=\"179160\" href=\"/#narrow/stream/179160-social\">#social</a> on <a href=\"#narrow/stream/179160-social/topic/Organising.20your.20health.20record/near/178857378\" title=\"#narrow/stream/179160-social/topic/Organising.20your.20health.20record/near/178857378\">organizing your health record</a>, which has led not surprisingly to the need for the patient to be the curator and resolver of disputes.  As we here all know, some patients are ready and armed, eager to do that.  Others aren't, and I think it'd be great if we could draft a \"what you need to know\" helper document. </p>\n<p>It will need to be iterative, because we really don't know the whole catalog of challenges people will encounter, but that's not a problem, eh?</p>\n<p>Let's consider this in our list of possible projects.</p>",
        "id": 178862515,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1571842985
    },
    {
        "content": "<p>I'm not sure that's the outcome.  The patient is one of the possible curators.  They won't necessarily always be able to (or appropriate to) fill that role.</p>",
        "id": 178865971,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571844955
    },
    {
        "content": "<p>I'm going to agree with you that I'm off-target, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span>   I'm at a conference listening to Susannah Fox speak, and used half my brain to type this.</p>\n<p>I do think we should develop the tool I proposed, but now I also think we need to consider who else might play that role. The obvious related one is the family caregiver (which I consider synonymous with \"patient\" in this sense). Who else?</p>",
        "id": 178867258,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1571845662
    },
    {
        "content": "<p>Could be GP.  Could be a nurse practitioner or long term care staff.  For meds, can be a pharmacist.  We may see AI playing a role here too.  Challenge is that regardless of <em>who</em> does it, in some cases, they might be the wrong person (because of skills, bias or both)</p>",
        "id": 178867500,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571845792
    }
]