[
    {
        "content": "<p>Is there a Profile of how a patient entered medication record would be supported in FHIR R4? It seems a typical layout of information is not obvious how it falls into MedicationStatement, MedicationDispense, Organization (pharmacy), etc.</p>",
        "id": 217765744,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606230421
    },
    {
        "content": "<p>MedicationUsage (MedicationStatement) and MedicationAdministration would be the prime candidates, unless the patient happens to have a computable expression of the details one of the other Medication* resources, e.g. if they pulled that information from elsewhere.</p>",
        "id": 217855245,
        "sender_full_name": "René Spronk",
        "timestamp": 1606292349
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> give me a quick scenario where this will be used?   (I can imagine lots but I wonder how it lives in the FHIR world)</p>",
        "id": 217884105,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606311108
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  as with any data the patient enters (Patient Generated Health Data - PGHD) the intention is to engage the patient. Many patients choose to take over-the-counter, herbal, or 'other' medications. These medications might impact treatment. The other use-case is where the patient has received care at a different facility, thus their records are not known to their primary care doctor. This might be because of emergency care, urgent care, dental care, etc... thus the whole point of PGHD is to enable the patient to inform their caregivers.</p>",
        "id": 217888029,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606313058
    },
    {
        "content": "<p>Yes MedicationStatement is obvious to hold most of the information typically entered by the patient... but it is not for everything. </p>\n<ul>\n<li>prescription number, clinician who prescribed, pharmacy, and phone of the pharmacy</li>\n</ul>\n<p>Often the patient doesn't know more than these. As it stands it looks like I have to create a contained MedicationDispense just so that I can have a <a href=\"http://MedicationDispense.performer.actor\">MedicationDispense.performer.actor</a> to hold a contained Organization where I put the name of the pharmacy, and their phone number</p>\n<p>I am not sure where to put the prescription number, stuffing it in MedicationStatement.identifier for now</p>\n<p>Lastly, the dose strength and frequency is very confusing. Seems I can say the same thing in many many different ways. What is the right way to say: taking two pills three times a day?</p>",
        "id": 217888751,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606313395
    },
    {
        "content": "<p>If this is in the US note that MedicationStatement has been dropped from US Core - so it won't be usually supported</p>",
        "id": 217890163,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606314063
    },
    {
        "content": "<p>mandates related to US-Core are not relevant. If US-Core could guide, that would be relevant. I am looking for specification, not mandate.</p>",
        "id": 217892968,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606315423
    },
    {
        "content": "<p>I expect that the patient empowerment has other PHR implementors that have had to address what I am looking to do. <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span>  others?</p>",
        "id": 217893621,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606315764
    },
    {
        "content": "<p>wire diagram of a prototype UI  <a href=\"/user_uploads/10155/RyLJQiNJ2-MSNs08_T1HLjwC/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/RyLJQiNJ2-MSNs08_T1HLjwC/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/RyLJQiNJ2-MSNs08_T1HLjwC/image.png\"></a></div>",
        "id": 217893674,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606315797
    },
    {
        "content": "<p>The Pharmacy Work Group would recommend that patient reported medications be added using Medication Usage.</p>",
        "id": 217918687,
        "sender_full_name": "Melva Peters",
        "timestamp": 1606327067
    },
    {
        "content": "<p>I don't see a MedicationUsage in R4</p>",
        "id": 217920946,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606328348
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/patient.20entered.20medication/near/217890163\">said</a>:</p>\n<blockquote>\n<p>If this is in the US note that MedicationStatement has been dropped from US Core - so it won't be usually supported</p>\n</blockquote>\n<p>What was the thinking behind that decision? AFAIA, MedicationStatement is in the ONC Common Data Model and it's also used in Argonaut (although that's not R4, of course) and the IPS (not based on US Core, but  supported by ONC).</p>",
        "id": 217935646,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1606336284
    },
    {
        "content": "<blockquote>\n<p>What was the thinking behind that decision</p>\n</blockquote>\n<p>Not sure , but I think there was some overlap with MedicationOrder / MedicationRequest that caused problem (as a matter of fact we are getting lots of duplicate stuff now if we query for both MedicationOrder and MedicationStatement from existing Argonaut servers) (<span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>)</p>",
        "id": 217940390,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606338970
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/patient.20entered.20medication/near/217888029\">said</a>:</p>\n<blockquote>\n<p>Hi <span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span>  as with any data the patient enters (Patient Generated Health Data - PGHD) the intention is to engage the patient. Many patients choose to take over-the-counter, herbal, or 'other' medications. These medications might impact treatment. The other use-case is where the patient has received care at a different facility, thus their records are not known to their primary care doctor. This might be because of emergency care, urgent care, dental care, etc... thus the whole point of PGHD is to enable the patient to inform their caregivers.</p>\n</blockquote>\n<p>Sorry, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , I should have been more explicit about \"where this will be used.\"   I didn't say so but the question I was thinking about was - what's the situation where a patient <em>enters</em> something, vs it existing in some system?</p>\n<p>I think I got hung up by \"patient <strong>entered</strong>\".  But from context so far, I'm guessing you mean a patient has an app (or an Apple-style aggregation) that knows stuff (manually entered or e-collected from elsewhere) and wants to submit it to some EHR, yes? No?</p>",
        "id": 217944683,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606341888
    },
    {
        "content": "<p>all the above... Patients know more than any one EHR.</p>",
        "id": 217944775,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606341960
    },
    {
        "content": "<p>Is there any special meaning to patient \"entered\"?</p>",
        "id": 217944893,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606342049
    },
    {
        "content": "<p>I have no idea what meanings that might have that is not the obvious... \"The Patient enters the medication details\". I can you offer some alternatives that you are thinking are in vs out?</p>",
        "id": 217944982,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606342115
    },
    {
        "content": "<p>I am indeed working off of the HHS/ONC description under Patient Generated Health Data <a href=\"https://www.healthit.gov/topic/scientific-initiatives/patient-generated-health-data\">https://www.healthit.gov/topic/scientific-initiatives/patient-generated-health-data</a></p>\n<p>But I am not thinking something that is not global in need.</p>",
        "id": 217945211,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606342229
    },
    {
        "content": "<p>Well, I proposed (and you accepted in your \"all the above\" :-)) that an app might have medication data <em>from elsewhere</em>, e.g. perhaps downloaded from my pharmacy.  I wouldn't call that patient \"entered.\"</p>",
        "id": 217945219,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606342231
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/patient.20entered.20medication/near/217945211\">said</a>:</p>\n<blockquote>\n<p>I am indeed working off of the HHS/ONC description under Patient Generated Health Data <a href=\"https://www.healthit.gov/topic/scientific-initiatives/patient-generated-health-data\">https://www.healthit.gov/topic/scientific-initiatives/patient-generated-health-data</a></p>\n<p>But I am not thinking something that is not global in need.</p>\n</blockquote>\n<p>Aha!  So I get to refresh my ping of <span class=\"user-mention\" data-user-id=\"197115\">@Steve Posnack</span> <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 217945381,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606342315
    },
    {
        "content": "<p>You are concerning yourself with a workflow that is important, but well beyond just getting the format consistent.</p>",
        "id": 217945407,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606342324
    },
    {
        "content": "<p>This where Zulip needs the ability to fork a tangential conversation so   it doesn't clog the thread.  I'll clam up now.</p>",
        "id": 217945510,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606342397
    },
    {
        "content": "<p>I just want to have a medication entered by a patient to be reliably encoded.   If the patient uses an app to pull medications from somewhere in FHIR format, the I would like that pulled FHIR format to be compliant with some reliably encoded medication. If that app submits that data to some other organization, like their GP or outpatient or surgery center, I would like that medication to be in a reliably encoded medication form</p>",
        "id": 217945546,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606342430
    },
    {
        "content": "<p>thus, I am more interested in reliably encoding a medication... once that is had, then I would worry about higher level flows. but it does not do much good to worry about the higher level flows with data that is not useful (aka the definition of Interoperabilty is important)</p>",
        "id": 217945644,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606342483
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> in R4 it is called MedicationStatement - was renamed to MedicationUsage in R5</p>",
        "id": 217945888,
        "sender_full_name": "Melva Peters",
        "timestamp": 1606342644
    },
    {
        "content": "<p>that is an unfortunate rename... is it really necessary to rename and break everything?</p>",
        "id": 217945918,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606342674
    },
    {
        "content": "<p>We had lots of discussion about the name change before it was made including with the implementers who participate in Pharmacy</p>",
        "id": 217946022,
        "sender_full_name": "Melva Peters",
        "timestamp": 1606342762
    },
    {
        "content": "<p>If you're going to capture details about a prescription, you'll use MedicationRequest - even if you're not capturing much.  The resource allows that to be reported.  If you just want to say \"I'm taking this med\", you'll use MedicationStatement/MedicationUsage.  I expect that US Core will eventually get to the point of supporting both MedicationUsage and MedicationRequest.  There will be overlap in the data exposed, but it's at different granularity.</p>",
        "id": 217950554,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606346574
    },
    {
        "content": "<p>To generate a Medication Statement, the most useful information - if available - is the medication that the patient is actually taking (MedicationAdministration) and/or the medication given to a patient (MedicationDispense). As a practical example, whenever possible, downstream users of data from the NZ National e-Prescription Service look at the Dispense Records - partly because of generic prescribing v brand dispensing, but also because of the % of unfilled prescriptions. Other sources - in FHIR terms, MedicationRequest, Observation &amp; Claim - might be described (as in the Spec) as 'supporting information'.</p>",
        "id": 218046304,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1606435093
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> I am sorry to hear you are getting lots of duplicate stuff -- hopefully MedicationStatement.basedOn helps a little. <br>\nHistorical context on the change from MS--&gt;MR. <br>\nMedicationRequest allows an Order to still be active even though I am not taking it, which was a requirement the brought forward by several implementers. This isn't allowed in R4 MedicationStatement... This was allowed in R2/R3 (MedicationStatement.taken=N).</p>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Our work in Argonaut, and subsequently US Core, was developed in collaboration with the implementer community -- no regulators were at the table. I understand  this still doesn't solve your quest of 'patient-entered' medications. We do give some small amount of guidance in US Core on using <code>reported[x]</code> on the <a href=\"https://build.fhir.org/ig/HL7/US-Core/medication-list-guidance.html#fetching-all-medications-active-medications-and-all-medications-for-an-encounter\">MedicationList</a> page.   </p>\n<p>The Medication resource overlap is tricky -- we focused on how to make sure a client would get all the active meds. If FHIR core wanted to make a Patient reported profile, or add lots of examples, that would be great.</p>",
        "id": 218275708,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1606735940
    },
    {
        "content": "<p>often the patient only has the bottle in their hand... so there is not much information to fill out a MedicationRequest. It feels down right wrong for patient entered prescription to record this as a MedicationRequest. Somehow recording a MedicationDispense feels less wrong, but it also seems wrong. These two resources have a clearly described agent that is expected to create them, during  a clearly defined point in a workflow. The case where a patient is carrying a prescription bottle to their next health encounter is clearly not about either of these workflows. <br>\nIn a perfect world, all prescriptions are well communicted to everyone that should see them... but in the real-world patients get prescribed medications at various points that are not as well connected.</p>",
        "id": 218290397,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606745366
    },
    {
        "content": "<p>right now I have modeled a MedicationStatement with a contained MedicationRequest, MedicationDispense, and Organization. (FHIR R4)</p>",
        "id": 218290626,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606745478
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191759\">Melva Peters</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/patient.20entered.20medication/near/217946022\">said</a>:</p>\n<blockquote>\n<p>We had lots of discussion about the name change before it was made including with the implementers who participate in Pharmacy</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> as I continue learning about co-chair duties, it occurs to me to ask: are those discussions recorded somewhere so that an interested party can go back and review the thinking?</p>\n<p>It always seems to be a big question - how much detail to capture about each side of a debate.</p>",
        "id": 218311560,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606754505
    },
    {
        "content": "<p>the discussion is in the minutes of the Pharmacy WG.  <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span></p>",
        "id": 218311674,
        "sender_full_name": "Melva Peters",
        "timestamp": 1606754553
    }
]