[
    {
        "content": "<p>Perhaps this belongs in a different stream but I'll mention it here, anticipating it might get moved.</p>\n<p>This is not specific to FHIR but is relevant to the portion of the patient world that is beginning to act autonomously and define its own criteria of satisfaction.  As with all social revolutions this is a small percentage today but signs continue that it's growing and starting to be outspoken. I'll be brief here; interested parties can pursue links.</p>\n<hr>\n<p>There's something of a troubled rebellion happening in the world of patient communities on Facebook, due to the platform's many trust problems. I blogged about it Facebook, I’m out. Your irresponsibility with patient groups has gone too far <a href=\"https://www.epatientdave.com/2019/01/07/facebook-your-irresponsibility-with-patient-groups-has-gone-too-far-im-out/\" target=\"_blank\" title=\"https://www.epatientdave.com/2019/01/07/facebook-your-irresponsibility-with-patient-groups-has-gone-too-far-im-out/\">https://www.epatientdave.com/2019/01/07/facebook-your-irresponsibility-with-patient-groups-has-gone-too-far-im-out/</a>  </p>\n<p>In the Twitter patient community there have been hundreds of tweets about the issues it raises, which I think is significant not because of the \"noise level\" (I'm not an eyeball whore, I don't sell ads, etc) but because of the clear signs that the patient population is thinking out loud about its needs.  This is a social precursor to the actions people will need to take in assuming responsibility for their health data.</p>\n<p>An important related read (cited in those Twitter responses) came from an autism mom who's a NY Times editor. She wrote why \"I Can’t Jump Ship From Facebook Yet\" <a href=\"https://www.nytimes.com/2018/04/14/opinion/sunday/delete-facebook-parenting-special-needs.html\" target=\"_blank\" title=\"https://www.nytimes.com/2018/04/14/opinion/sunday/delete-facebook-parenting-special-needs.html\">https://www.nytimes.com/2018/04/14/opinion/sunday/delete-facebook-parenting-special-needs.html</a>, very clearly describing the value of online patient communities for round-the-clock support when real problems arise (and problems where medicine doesn't have answers.)</p>",
        "id": 154840825,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1547129383
    },
    {
        "content": "<p>right. where are patient's going instead? PatientsLikeMe?</p>",
        "id": 154987029,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1547305337
    }
]