[
    {
        "content": "<p>I am noticing that many IG that are being discussed are not fully empowering the patient. Where they want some input from the patient, they are defining that a FHIR Questionnaire / QuestionnaireResponse is used. This is not fundamentally wrong, but it does disempower the patient. There should be an active participating actor in the scenario where that active participating actor could be satisfied by Questionnaire; but could also be  portrayed by an active application (e.g. PHR). Please watch for Questionnaire as a proxy for patient; and question this approach. It a fine approach, but the formal action should be the activity behind the QuestionnaireResponse.</p>",
        "id": 209674028,
        "sender_full_name": "John Moehrke",
        "timestamp": 1599755888
    },
    {
        "content": "<p>For example, if I am participating in multiple CarePlan(s) that each want a blood-pressure measurement; if the requirement is to fill out a Questionnaire, then I as the patient must enter the same data multiple times. Where as the current blood-pressure measurement is really what they all want, and a Questionnaire is one possibility.</p>",
        "id": 209674323,
        "sender_full_name": "John Moehrke",
        "timestamp": 1599756008
    },
    {
        "content": "<p>I totally agree. How do we open up thinking about patient participation to include discrete data? </p>\n<p>Sent from my iPhone</p>",
        "id": 209680912,
        "sender_full_name": "Terrie Reed",
        "timestamp": 1599758977
    },
    {
        "content": "<p>I bring it up as a thing for patient empowerment advocates to watch for in a ballot or workgroup discussion. It is not bad to use Questionnaire, but we all should bring up the topic of if the use of Questionnaire is appropriate. Often times Questionnaire is used in these IG not maliciously against the patient, but because using it allows the team to get back to the clinical workflow side. Thus it is not bad, but  should be encouraged as a \"reference implementation might use this Questionnaire mechanism\", rather than mandating that this Questionnaire must be used. Thus the real requirement should be defined as the output of QuestionnaireResponse action. Such as \"Current Blood Pressure shall be recorded by the Patient\".</p>",
        "id": 209688587,
        "sender_full_name": "John Moehrke",
        "timestamp": 1599762332
    },
    {
        "content": "<p>There are a few drivers around using Questionnaires for patient data capture:</p>\n<ul>\n<li>It allows the set of data captured to be more easily changed.  If the software understand how to handle an arbitrary questionnaire, then adding or changing questions doesn't require any data manipulation</li>\n<li>It's much easier to write a client that knows how to present/capture information with the simple Questionnaire data model than to have software that knows how to population Patient, AllergyIntolerance, Observation, MedicationStatement, CareTeam, Encounter, ...</li>\n<li>Questionnaire gives very tight control over phrasing &amp; order of questions and available answer choices, which helps ensure consistent data capture</li>\n</ul>",
        "id": 209701009,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599767796
    },
    {
        "content": "<p>Can't many of these questions be resolved by putting a Lifetime Clinical Record (LCR) in the hands of the Patient?  And, empowering the Patient with the ability to share all or a portion of the LCR with whomever they choose?</p>",
        "id": 209704227,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1599769431
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> you have just emphasized my point. This is easier for the EHR, and disempowers the patient</p>",
        "id": 209706871,
        "sender_full_name": "John Moehrke",
        "timestamp": 1599770830
    },
    {
        "content": "<p>I'm not sure I understand your comment that it \"disempowers the patient.\"  If the patient is the only person in the world who has control of their Lifetime Clinical Record, and the Patient (or their Caregiver, e.g. parent) is the only one who decides if and what to report to the requester, then why and how does this disempower the patient?</p>",
        "id": 209710808,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1599772809
    },
    {
        "content": "<p>don't get me wrong. a Questionnaire is a powerful tool and likely useful everywhere it is used... but my point is that by an IG mandating the use of a Questionnaire they are forbidding the use of applications that might be more creative about getting the information that the questionnaire is prompting for.</p>",
        "id": 209712152,
        "sender_full_name": "John Moehrke",
        "timestamp": 1599773434
    },
    {
        "content": "<p>a simple example, that I have seen in some CarePlans... there is a need to get a fresh pain evaluation from the patient each day to track their pain control. Great requirement.. but the CarePlan mandates the capture of this pain evaluation with a Questionnaire. Thus the pain management app that I have can't be used to fulfil the overall need to capture a fresh pain evaluation.</p>",
        "id": 209712299,
        "sender_full_name": "John Moehrke",
        "timestamp": 1599773530
    },
    {
        "content": "<p>I simply ask that the task be defined in terms of what is needed, and that the Questionnaire pathway be given as one method of getting to that point. It may seem silly to state it this way, but this is what is needed to empower the patient.</p>",
        "id": 209712437,
        "sender_full_name": "John Moehrke",
        "timestamp": 1599773612
    },
    {
        "content": "<p>Not exactly true, the questionnaire can also have the pre-population sources embedded. We've used this to ease the transition from multiple systems, where the user is able to add in the stuff isn't available from the user's system before submitting.<br>\nSo if the patient does have an atomic data source, then they can prefill quickly.</p>",
        "id": 209951514,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1600034550
    },
    {
        "content": "<p>I just wanted to make a small comment: IMO we can/should dissociate the data model from the user experience in this case. Even though the resource is a Questionnaire, it does not mean that applications need to collect it through a form and/or enforce manual entries, especially for repetitive fields. I am not aware of any rule against pre-populating fields based on cache, patient database, 3rd party devices etc. or against having more intuitive/seamless input methods, such as voice input, gesture-based UI elements, and so on.</p>",
        "id": 210104496,
        "sender_full_name": "Eduardo Ferreira",
        "timestamp": 1600159711
    },
    {
        "content": "<p>I fully understand and agree with the power of Questionnaire. My point is not that Questionnaire are bad. My point is that when the Patient Empowerment workgroup members see the use of Questionnaire for Patient engagement, we should question this. It is not an objection to use of Questionnaire. It is simply an observation that I have seen multiple IG using Questionnaire as a method of modeling patient engagement, AND failing to express the desired outcome in the form of core FHIR resources. I do NOT discourage Questionnaire, I like it. I especially like it as a reference implementation of that interaction with the patient. But if the interaction is simply gathering an Observation, then please make the gathering of Observation XYZ the primary flow with the Questionnaire as a reference implementation.</p>",
        "id": 210147052,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600184463
    },
    {
        "content": "<p>so my message audience is not the Questionnaire elite. It is the poor patient empowerment workgroup members that are overwhelmed by all the techno babble that is FHIR. Questionnaire elite should continue to do what you do.  Hence why I posted this in Patient Empowerment, and not in Questionnaire stream.</p>",
        "id": 210147284,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600184581
    },
    {
        "content": "<p>I confess that I'm a little lost in this, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>, so thanks for sticking up for the little guy <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>   </p>\n<p>If you'd like to be the first to write something for <a href=\"https://confluence.hl7.org/pages/viewrecentblogposts.action?key=PE\">our nascent blog on Confluence</a> it'd be great.  I don't mean anything weighty - I just mean copy/pasting the essence of this thread or your points about it.</p>\n<p>As you wish -</p>",
        "id": 210147571,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600184741
    }
]