[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> - yesterday and today, in two different ONC Tech Forum sessions, you both, independently stated that either health system or EHR vendor approval was always or typically a requirement for a patient to authorize an app to access their common clinical data. John, you clarified in response to my question that there were exceptions to this. </p>\n<p>Around 2015, at Epic, we deployed the technology to allow an app developer to (manually) register an app and for a patient to use that app with no vetting, and automatically within 12 hours. Every organization using Epic to certify for MU3 has this functionality turned on; most for many years. Again, <a href=\"https://open.epic.com/MyApps/Endpoints\">here's the list</a>. Again, as designed there is no app store validation, nor health system review. </p>\n<p>Am I misinformed? Are health systems using Epic vetting patient apps? Is Epic alone in not vetting? If so, is it still accurate to state or imply that a vetting process is always required?</p>\n<p>I'm concerned that my point of view is out of touch with the state of patient apps -- it's definitely different from yours. Could you inform me, please?</p>",
        "id": 206624928,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1597176603
    },
    {
        "content": "<p>We (Cerner) currently have the provider ask us to enable the app at a site, but this is something we are changing. We do not require any \"vetting\" or \"validation\" of patient apps.</p>",
        "id": 206626491,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1597177477
    },
    {
        "content": "<p>We've also had app devs reach out about specific sites to be enabled themselves</p>",
        "id": 206626643,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1597177564
    },
    {
        "content": "<p>And here we discover that Zulip converts animated GIFs to PNGs.  Well, you know what an eager spectator looks like when munching popcorn...<br>\n<a href=\"/user_uploads/10155/wrxbSoYMhXkZidVjpHuy0jXn/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/wrxbSoYMhXkZidVjpHuy0jXn/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/wrxbSoYMhXkZidVjpHuy0jXn/image.png\"></a></div>",
        "id": 206626765,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1597177652
    },
    {
        "content": "<p>eClinicalWorks and NextGen have no provider vetting as well (they can have the API completely disabled though)</p>",
        "id": 206628885,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1597178684
    },
    {
        "content": "<p>Allscripts has no provider vetting as well (but you don't know the end points)</p>",
        "id": 206628974,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1597178731
    },
    {
        "content": "<p>I have no knowledge. I was just playing my role as a moderator... Allowing my panelists to shine...</p>",
        "id": 206629871,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597179206
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> I think you might be the best to answer the question. We have three EHR vendors that have said they fundimentally allow patients to bring ANY app to the patient specific API... so, what is the Patient Experience?</p>",
        "id": 206629992,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597179265
    },
    {
        "content": "<p>I presume that there was already broad support for patient provisioned apps, as regulation is now demanding it and regulation demands don't tend to kick in until there is some already able to be conformant.</p>",
        "id": 206630098,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597179324
    },
    {
        "content": "<p>You're reading my mind: I'll do a social media outreach and see what people say in response. After this meeting I'll draft a quick post.</p>",
        "id": 206630134,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1597179346
    },
    {
        "content": "<p>so now... I sit and munch popcorn awaiting the reality</p>",
        "id": 206630141,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597179349
    },
    {
        "content": "<p>My exprience has been in line with Michele's.</p>\n<p>Epic is no vetting (aside from out-of-band/non-dynamic app reg) and easily accessible endpoint list. </p>\n<p>Other EHR vendors either have a less accessible endpoint list and/or provider vetting.</p>\n<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> with the switch from <a href=\"http://open.epic.com\">open.epic.com</a> to <a href=\"http://fhir.epic.com\">fhir.epic.com</a>, is this still the case for patient apps? When there was <a href=\"http://uscdi.epic.com\">uscdi.epic.com</a> vs <a href=\"http://open.epic.com\">open.epic.com</a>, the divide in process was clear (open access for patient apps, lightweight approval for USCDI). Now, less so.</p>",
        "id": 206630758,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1597179658
    },
    {
        "content": "<p>First, John, Ryan -- I apologize for coming off as antagonistic -- that's really not my intent (although I did get a bit passionate, in my spare bedroom cum home office cum echo chamber of one, during your sessions!) Without expertise in this space, I'd have learned over the past two days that vetting is a requirement for a patient app. I absolutely, really, want to know if that's true! Similarly, I want you (and our community) to know if it's not.</p>",
        "id": 206631523,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1597180048
    },
    {
        "content": "<p>And to be clear: yes, we registered our app at <a href=\"http://open.epic.com\">open.epic.com</a>, it was never vetted and it can connect to all Epic listed providers</p>",
        "id": 206631609,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1597180108
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"200498\">@Brendan Keeler</span> - yeah, great question. The majority of feedback we got was that the different sites were confusing (especially when you throw in App Orchard). We're still working at unifying <a href=\"http://open.epic.com\">open.epic.com</a> and <a href=\"http://fhir.epic.com\">fhir.epic.com</a> to make it feel like they're the same thing. Note that DSTU2 CCDS patient app registration/<em>deployment</em>/management is <a href=\"https://open.epic.com/MyApps\">still occurring</a> on <a href=\"http://open.epic.com\">open.epic.com</a>. We do intend to migrate this to the <a href=\"http://fhir.epic.com\">fhir.epic.com</a> site, at which point all the same functionality will still be present (no vetting for patient apps).</p>",
        "id": 206633027,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1597180977
    },
    {
        "content": "<p>Yeah I saw the <a href=\"http://open.epic.com\">open.epic.com</a> stuff was still up but definitely points to <a href=\"http://FHIR.epic.com\">FHIR.epic.com</a> as the future. Given the latter is a bit light on patient app details (how registration will work, which APIs are available for patient apps, etc) I wasn't sure if it indicated a switch to more APIs available for patient apps, but a vetting process (or provider approval step)</p>",
        "id": 206637106,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1597183701
    },
    {
        "content": "<p>Thanks for the clarification</p>",
        "id": 206637111,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1597183707
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>. Thanks for the great set of questions! I didn't take it the wrong way at all. Vetting is not a 'requirement' for a patient app, but some apps do feel as though they are 'getting vetted' by some EHR vendors because of the difficulty they are still having in getting connected. Let me explain. . . </p>\n<p>First, as I mentioned to <span class=\"user-mention\" data-user-id=\"328167\">@Janet Campbell (Epic)</span> a year or two ago at an ONC event in some random hotel hallway, our app community has been united and effusive in our praise for Epic's app registration approach. We've made clear publicly, multiple times we wish more folks would follow a similar approach. In fact on our website, you can read our ONC comments which outlines on p.13 an app registration process that largely resembles what you guys are doing.  <a href=\"https://www.carinalliance.com/wp-content/uploads/2019/06/CARIN_ONC-CURES-Information-Blocking-Comment-FINAL.pdf\">https://www.carinalliance.com/wp-content/uploads/2019/06/CARIN_ONC-CURES-Information-Blocking-Comment-FINAL.pdf</a>  Maybe I can send a few payers your way so you can explain to them how you set-up your registration process. ;) As was discussed in the thread above, eCW and NextGen also deserve praise for their approaches. </p>\n<p>In my comments today, I was trying to explain (not well, obviously) there isn't a consistent approach for how consumer-facing apps register when you look across <em>all</em> of the EHR vendors. Meditech, Athena, and Allscripts are almost there but it's not a streamlined approach. As <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> mentioned Cerner isn't there yet, but they did provide a verbal commitment to us even before the final rule came out their desire to change. The challenge apps face with Cerner is the apps need to ask each provider their permission for Cerner to turn on their end point which is one of the reasons a FHIR SPOC would be helpful. I'm sure the ONC final rule will help in that discussion. GE is very hard. The app community feels like they are are using a very custom approach. For the other smaller EHRs, many of them don't yet have an online registration process and/or there are a few examples where the authentication flow isn't working well. Then, there's the issue of providers who don't have a portal. . . . which is still an issue that exists out there. </p>\n<p>Look, we know everyone is trying their best and wants to do the right thing. It will take some time and certainly won't happen overnight but I do believe the EHR vendors as a whole are actively moving in the right direction. Now, we need to explain to the 900+ CMS payers and 57 states and territories why they can't 'vet' a consumer-facing app. I'm expecting that to be a much more difficult conversation. . . we are always open to having some help!</p>",
        "id": 206646189,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1597190567
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> I felt no harm. I love it. I tried to get you on the panel.  I think the Payers are the newbe that needs advice.</p>",
        "id": 206646868,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597191164
    },
    {
        "content": "<p>We found many different flavors and workflows around how easy it is for patients to use any app of their choice. We work with all the big EHR players and the process spans from “very easy” for Epic, eCW, and NextGen to “very hard” with (formerly) GE  and impossible with Athena. The difficulty is mostly on the app developer side to jump through all the hoops and gather all the different types of information for the more difficult EHR vendors. It’s still very very difficult for patients to get access to their data  using the app of their choice if their app is not connected to the clinic. We try to help them by explaining how to request the health org connect with us. And we also reach out to the health org if we can figure out  who to contact. There’s a big black hole there.  Sometimes the health org simply doesn’t respond to the patient. Most of the time  they don’t  respond to us. Sometimes their response is “We are already connected to Apple and we don’t want to connect to any other application.” I think it’s getting better. Or maybe we are just getting better at doing back flips over multiple hurdles while trying to help the patients that reach out to us. It’s an Olympic exercise. And also a real labor of love. We know how important it is for patients to be able to gather and aggregate their data into one place where they can see and understand it all. Sometimes it’s a matter of life or death. And that’s worth the effort it takes to keep moving forward to make this an easier process. I really do think the EHR vendors are trying hard to make this happen. We are so much further today than we were two and three years ago. And two or three years from now, things will be much better also.</p>",
        "id": 206650229,
        "sender_full_name": "Debi Willis",
        "timestamp": 1597194573
    },
    {
        "content": "<p>Well!   After Debi's response, are the waters clearer, so that there's no need to send out a public appeal?</p>\n<p>Another possibility would be to summarize and blog the above (with plenty of verbatims), and ask people to respond with their experiences.  Shall we?  I'll need a fact-checker or some such, from this thread, to make sure I'm asking the right things. </p>\n<p>I'm hoping that whatever we end up learning, ONC buddy <span class=\"user-mention\" data-user-id=\"197115\">@Steve Posnack</span> will help spread the word as appropriate.</p>",
        "id": 206650601,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1597194998
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> , I’m happy to help in anyway I can. I sent a grid earlier to Ryan Howells to identify how the different EHRs handle onboarding an app and the hoops we sometimes need to jump through for some of them. I’ll send that to you and then we can schedule some time to chat on the phone. I would love to congratulate the ones that are doing a great job and encourage the laggers to work with the FHIR  community to come up with better workflows. I believe there are many patients who choose providers partially based on how easy it is to get their information from them. Solving this problem will be a win for everyone.</p>",
        "id": 206657103,
        "sender_full_name": "Debi Willis",
        "timestamp": 1597203533
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> ,</p>\n<p>Here is our general experience for open developer environments. The problem is essentially endpoint discovery and whitelisting. Please note that not all vendors are included below. However, OneRecord is patiently waiting for ALL endpoints to be published by ALL vendors with no whitelisting :)</p>\n<p>Epic: You get a single set of creds (client ID and secret) to connect to all Epic sites. All endpoints published. ( This is the easiest method for patient-facing apps.)</p>\n<p>Cerner: You get a single set of creds (client ID and secret) to connect to all Cerner sites (like Epic) BUT whitelisting is required.</p>\n<p>eCW: You get a single set of creds (client ID and secret) to connect to all eCW sites (Like Cerner) BUT whitelisting is required.</p>\n<p>Allscripts: You get different creds (client ID and secret) for each client to connect to Allscripts sites AND  whitelisting is required. </p>\n<p>Meditech: You get different creds (client ID and secret) for each client to connect to Meditech sites (like Allscripts) AND whitelisting is required.</p>\n<p>NextGen: You get different creds (client ID and secret) for each client to connect to NextGen sites AND whitelisting is required.</p>\n<p>Athena: To date does not support 3 Legged OAUTH</p>\n<p>Ultimately you are going to see some sort of configuration that follows the patterns above and as <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> said \"it’s an Olympic exercise\" to find the right stakeholder to get whitelisted...even at the patient request.</p>\n<p>cc:  <span class=\"user-mention\" data-user-id=\"197115\">@Steve Posnack</span> and <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span></p>",
        "id": 206695701,
        "sender_full_name": "Jennifer Blumenthal",
        "timestamp": 1597240167
    },
    {
        "content": "<p>I think this is clear to everyone here, but for the record: \"whitelisting\" presents basically an impossible barrier in its current form. At least if you are a developer with no specific relationship to the organizations that need to whitelist you. In most cases you can't even figure out the right point of contact. if you can find a point of contact, either it is a worthless administrative exercise because they have no choice but to add you to the whitelist; or the organization practices some kind of vetting by refusing to add you to the whitelist.</p>",
        "id": 206696251,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597240430
    },
    {
        "content": "<p>I second <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> comment above. This is the best description of production environments today.</p>",
        "id": 206696428,
        "sender_full_name": "Jennifer Blumenthal",
        "timestamp": 1597240510
    },
    {
        "content": "<p>so it is not a technical problem, it is a policy problem... which is why regulation is the tool to unlock that policy...   Hence why we now have clarification that the patient MUST be allowed to bring third party apps. It is no longer a policy choice the Provider and Payer organizations can chose.</p>",
        "id": 206699608,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597241792
    },
    {
        "content": "<p>Yes, we understand the challenges, and have been working over on doing a major overhaul of our ecosystem and sandbox this year in order to get to more of a denylist instead of an enablelist for patient apps.</p>",
        "id": 206699952,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1597241903
    },
    {
        "content": "<p>The interesting lesson-we-need-to-learn, is why has Providers using Epic more readily been open. There must be some lesson we can use. Some way they present this to their Provider organiations that makes it \"easy\" to have open arms.</p>",
        "id": 206699981,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597241921
    },
    {
        "content": "<p>is a Deny list available in all the platforms? (like the move to Permit/Deny terminology)</p>",
        "id": 206700035,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597241961
    },
    {
        "content": "<p>could someone look at the FHIR Security and Privacy page; and recommend some new text that would explain the current approach? I suspect that these pages are not leading the audience to the right understanding of openness. At least, I am looking for improvements.</p>",
        "id": 206707096,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597245199
    },
    {
        "content": "<p>Honestly, I don't think the folks that make policy decisions on open vs. not open spend any time at all looking at the FHIR spec. Let alone the Security and Privacy page.</p>",
        "id": 206708604,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1597245738
    },
    {
        "content": "<p>fair... but I am always looking to make it better</p>",
        "id": 206710296,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597246544
    },
    {
        "content": "<p>Just noticing <a href=\"https://www.hl7.org/events/fhir/implementation/2020/\">https://www.hl7.org/events/fhir/implementation/2020/</a>  <br>\nGood opportunity to channel this openness message.</p>",
        "id": 206710574,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597246655
    },
    {
        "content": "<p>I don't think it is entirely a policy problem. It is a workflow problem. Perhaps a better way might be to say it is a lack of enforcing the part of the policy that ensures there are no barriers to patients getting their data \"without special effort\".  We are moving in the right direction (and thrilled to hear from EHR vendors who are going to change the process to make it easier). When a patient uses a FHIR app to get their data, that app is representing the patient who wants access to their data. A barrier to the app developer is also a barrier to the patient. I don't think some EHR vendors really understood it that way. But, in a patient's view...that is the case.</p>",
        "id": 206720551,
        "sender_full_name": "Debi Willis",
        "timestamp": 1597251282
    },
    {
        "content": "<p>Agreed Debi; the right technical defaults make the (practical) policy problem disappear.</p>",
        "id": 206733545,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597257588
    },
    {
        "content": "<p>UCSF should refocus Interopselect around patient auth connectivity experiences</p>",
        "id": 206885575,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1597363110
    },
    {
        "content": "<p>For what it's worth, I imagine a variety of patient apps using a data aggregator like Apple, 1up or Human API in between for value add services, so we may be overstating the issue a bit, assuming those get whitelisted</p>",
        "id": 206885642,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1597363197
    }
]