[
    {
        "content": "<p>Calling all patient app vendors.  FHIR has a Safety checklist and a Security checklist.  If it had a patient-friendly checklist, what would it have on it? <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> suggested human readable descriptions in conjunction with any codes, for example.</p>\n<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> <span class=\"user-mention\" data-user-id=\"197054\">@Ricky Sahu</span> <span class=\"user-mention\" data-user-id=\"329403\">@Jennifer Blumenthal</span> <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> <span class=\"user-mention\" data-user-id=\"251396\">@John Keyes</span> <span class=\"user-mention\" data-user-id=\"191678\">@Abbie Watson</span> <span class=\"user-mention\" data-user-id=\"311963\">@Nancy Lush</span></p>",
        "id": 242158373,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1623299384
    },
    {
        "content": "<p>Seem a strange idea to me - patients would not see or consume FHIR, apps / clients do - and they can have very different requirements<br>\n(For example human readable descriptions are certainly good if FHIR is consumed by apps that then display the data directly to the user, but for example the SMART health card / VCI implementation guides has profiles that _forbid_ such descriptions, because the use of the data is different - albeit still for a patient in the end)</p>",
        "id": 242196683,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1623327620
    },
    {
        "content": "<p>Do you mean that when data is destined for a patient, and not for a practitioner (within the Organization) then there should be other checks to be done?<br>\nE.g. Only being able to access their own data, or data they are consented to access, via a patient smart token?</p>",
        "id": 242472561,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1623532028
    },
    {
        "content": "<p>Data destined for patient or their proxy.  @Michele an example would be on a PHR, if you got a SNOMED code without a description, the app would need to look up the code to provide the description.  This assumes the app has access to SNOMED and knows how to do that.  It doesn't preclude the lookup by the app - having the description helps not make it required.</p>",
        "id": 242473739,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1623533696
    },
    {
        "content": "<p>Another idea we heard at the WGM was patient friendly descriptions for terms.</p>",
        "id": 242473756,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1623533752
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> why are the descriptions forbidden in VCI - is it for privacy?</p>",
        "id": 242473825,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1623533853
    },
    {
        "content": "<p>In the SMART Health Cards case, we need very small payloads that can fit in QR codes; we omit any text that can be inferred from other values, so we omit display text for standardized codes like CVX</p>",
        "id": 242474695,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1623534852
    },
    {
        "content": "<p>Depends if the code is truly 'standardized' from the client perspective, even to the point where the system element is not required to interpret a code. Otherwise, certainly for the CVX COVID-19 vaccine codes, using CodeableConcept.text might have the fewest characters as, with codes from 5 different code systems and value sets in the SMART Health Cards Vaccination IG, the code system url will be required to interpret the code.</p>",
        "id": 242485692,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1623552241
    },
    {
        "content": "<p>More like what would a patient, or their app want so the patient can be most empowered?  Patient apps are usually created by small vendors and some patients are writing their own.  What are the qualities of a patient friendly FHIR server? <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 243283449,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1624159766
    },
    {
        "content": "<p>I think we need a better recollection of what was said at the time.  I know it sounded compelling during DevDays but I don't recall. Help, someone?</p>\n<p>As I recall the idea was at least to help patients know what was being exchanged but I don't recall the compelling aspect.</p>",
        "id": 243601544,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1624415764
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> Alrighty, I'll take a shot...</p>\n<p>Checklist, from the perspective of a patient</p>\n<p>I know... [^1]<br>\n[ ] The custodian of my health data<br>\n[ ] Who has access to my health data, and why</p>\n<p>I have the power to...<br>\n[ ] Grant my consent without special effort<br>\n[ ] Withdraw my consent without undue burden (e.g. if I consent easily online, I shouldn't need to fax or call to withdraw my consent)<br>\n[ ] Redress inaccuracies or violations of my HIPAA rights (e.g. who is the redress contact and what is the escalation path)</p>\n<p>I understand...<br>\n[ ] Because descriptions are in non-technical language [^2]<br>\n[ ] That my data will not be used outside the bounds/context of my consent</p>\n<p>[^1] Patient application of Privacy guidelines from Safety Checklist presentation (<a href=\"https://www.devdays.com/wp-content/uploads/2019/12/Diego-Kaminker-Safety-Check-List-_-DevDays-2019-Amsterdam.pdf\">https://www.devdays.com/wp-content/uploads/2019/12/Diego-Kaminker-Safety-Check-List-_-DevDays-2019-Amsterdam.pdf</a>)<br>\n[^2] To my mind, this would include access to any code sets used.</p>",
        "id": 245366339,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1625775482
    },
    {
        "content": "<p>Or \"I understand that, in entrusting the app with my most sensitive data, the app has a (fiduciary?) duty to act in my interest.\"<br>\nas a more expansive version of \"I understand that my data will not be used outside the bounds/context of my consent.\"</p>",
        "id": 245367055,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1625775804
    },
    {
        "content": "<p>Note entirely for APIs, but for privacy --&gt;  privacy focused interop document  \"Privacy Manifest\"  was proposed by BCH/SMARTHealthIT in a <a href=\"https://academic.oup.com/jamia/article/28/3/640/6031254?login=true\">paper</a></p>",
        "id": 255463158,
        "sender_full_name": "Raheel Sayeed",
        "timestamp": 1632945136
    },
    {
        "content": "<p>how does it compare with <a href=\"https://hl7.org/fhir/R4/safety.html\">https://hl7.org/fhir/R4/safety.html</a> <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> fyi</p>",
        "id": 256003553,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1633320350
    }
]