[
    {
        "content": "<p>ok, <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> - what would a patient's introduction to FHIR do?</p>",
        "id": 154020363,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1542857785
    },
    {
        "content": "<p>Just discovered this was waiting for me - yesterday was the big US family holiday Thanksgiving.  </p>\n<p>Great question, and rather than thinking it ALL out (which will be endless), I'll start with some thoughts.  </p>\n<p>The background for my interest is that in my advocacy for patient involvement in medicine (a background I can dig into more if anyone wants), I've repeatedly encountered the belief among many HCPs (healthcare providers) that there's no point offering data to patients, because (a) they wouldn't know what to do with it, (b) there's nothing they could do with it anyway.  Each of these arguments induces in me a migraine-like cascade of painful shocks.  </p>\n<p>The good news is that not ALL HCPs feel this way for benighted reasons. Many, though, are benighted; I have an ongoing disagreement with the CIO of my hospital, Dr. John Halamka, which is summarised in my exchange of blog posts with him a couple of years ago.  He had blogged, in flagrant ignorance (ironic for his expert reputation), that not one patient of our system's 2 million had ever requested a download of their full record.  Turns out that one factor might be that they don't HAVE a way to request it, which I uncovered in my series of posts responding to him. <a href=\"https://www.epatientdave.com/2016/11/07/dear-john-i-want-to-download-my-records/\" target=\"_blank\" title=\"https://www.epatientdave.com/2016/11/07/dear-john-i-want-to-download-my-records/\">https://www.epatientdave.com/2016/11/07/dear-john-i-want-to-download-my-records/</a></p>\n<p>Continued...</p>",
        "id": 154020609,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1542985958
    },
    {
        "content": "<p>This is unfortunately a chicken-and-egg argument, in which people like him say \"Why develop apps that no one will ever use??\" which had led people to not develop apps, which has led to no evidence of interest among patient/consumer users. </p>\n<p>Back in 2015 I wrote that we activists demand a health data spigot. <a href=\"http://dave.pt/healthspigot\" target=\"_blank\" title=\"http://dave.pt/healthspigot\">http://dave.pt/healthspigot</a>   Unfortunately - until FHIR - no such technology existed.  And then, wonderfully, at the October app roundtable, Michael Morris demonstrated EXACTLY the sort of hack I'd been arguing would be possible once we HAVE said spigots. </p>\n<p>Serendipitously, Morris's n-of-1 dashboard is a close parallel to what MITRE Corp's Kristina Sheridan PhD had done years earlier for her daughter Kate, who had been utterly incapacitated by Lyme disease - from football and academic star to disabled on the couch. She and Kate spoke at HIMSS 2018, relating how Kristina had (after 30 doctors and 15 diagnoses) taken matters into her own hands, manually pounding a 50cm pile of printouts into Excel, developing a dashboard of their own, creating a view of this difficult case that no doctor had, including a completely new summary of Kate's 26 symptoms. (My post about them at SPM's conference last month <a href=\"https://participatorymedicine.org/epatients/2018/09/spm2018-speaker-preview-kristina-sheridan-leveraging-the-data-of-patients-stories.html\" target=\"_blank\" title=\"https://participatorymedicine.org/epatients/2018/09/spm2018-speaker-preview-kristina-sheridan-leveraging-the-data-of-patients-stories.html\">https://participatorymedicine.org/epatients/2018/09/spm2018-speaker-preview-kristina-sheridan-leveraging-the-data-of-patients-stories.html</a> links to the video of their full hour-long HIMSS speech.)</p>\n<p>What Kristina did manually, with extreme labor by a PhD researcher mom, Morris did a million times faster (I imagine) with his programming skills.</p>\n<p>Each flies in the face of the esteemed Halamka's beliefs that patients would have no use for the data.</p>\n<p>Continued.</p>",
        "id": 154020611,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1542986824
    },
    {
        "content": "<p>If we fast-forward to the world we'd like - where patient's actually have the ability to get their raw record in FHIR form, the question is then \"what would patient's need to know to understand the FHIR spec?\"  It probably makes sense to acknowledge the three use-cases Dave had talked about earlier: <br>\nPatient as data mule - \"You can transport data in FHIR format and carry it to new providers who can't access your record directly so that they can import your data into their system\"<br>\nPatient as app user - \"You can expose your data to patient-facing applications to better understand your data  (or the data of those you're caring for)\"<br>\nPatient as data hacker - \"You can write your own software or leverage data querying tools to gain insight into your own data\"<br>\nIdeally with practical examples of how all of the above can be done in the real world.<br>\nAnd then follow it up with an overview of how FHIR works to represent their data - particularly the key pieces like observations, meds, procedures, conditions</p>",
        "id": 154020616,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542988039
    },
    {
        "content": "<p>I apologise for the length of the above; I hope though that it will explain why I'm both passionate and urgent about the importance of spreading the word. </p>\n<p>Behind it all is a mistaken belief that all work of any value will be done by specially educated professionals, NOT by the \"consumer,\" the recipient of services, and that thus it makes no sense during interop projects to add a \"spigot\" for consumer use of the same data. </p>\n<p>Grahame's question arises because as I prepared for Amsterdam I looked at the FHIR home page and saw this:<br>\n=========<br>\nFirst time here?<br>\nSee the <em>executive summary</em>, the <em>developer's introduction</em>, <em>clinical introduction</em>, or <em>architect's introduction</em>, and then the <em>FHIR overview / roadmap &amp; Timelines</em>. <br>\n=========</p>\n<p>And I thought \"Crap!  If the 2018 version of Kristina Sheridan showed up, with an URGENT need and desire to find out 'Is this for me???? Can this help me save my kid??',\" could there be a more consumer-centered introduction??</p>\n<p>So, what SHOULD such an introduction include?  Honestly I don't know enough to outline it with confidence, but some thoughts:</p>\n<ul>\n<li>A brief hello / welcome, recognising the visitor may be a Morris-level coder or completely tech-naive, explaining what FHIR is.<ul>\n<li>Note: with luck, word of FHIR will spread far and wide, so we must assume unknown knowledge levels.</li>\n</ul>\n</li>\n<li>A brief passage - sort of a disambiguation page - (pardon my imprecise wording)</li>\n<li>if you have no idea what this is about, and want to learn more, _start here_</li>\n<li>If you know what FHIR is about but are not technical, _start here_</li>\n<li>If you know how write software and want to get started, _start here_</li>\n</ul>\n<p>Again, those are naive examples.  My intent is that we want to be welcoming for the whole spectrum of people - consumers who have a need they want to voice, as well as the Kristina Sheridan level, as well as the Michael Morris level, and probably eleventeen sub-species that we'll discover once we get some traffic going. </p>\n<p>Some topics to include:  (All at a <em>very</em> simple level, at first; anyone interested in more can learn it, but we don't want to scare away people who might have a valid use case.)</p>\n<ul>\n<li>What is FHIR? (Consumer level)</li>\n<li>Why would anyone want to use it?</li>\n<li>How would I get started learning more?</li>\n</ul>\n<p>An important use case, btw, is the example from my Amsterdam talk that ultimately broke through the limits of traditional typesetting: the consumer's \"nephew\" who says \"Hey, I could code that FOR you.\"  IOW, don't be limited to thinking about the probable skill set of the sick person him/herself.</p>\n<p>Grahame, is this a sufficient starting answer (including explanation) to your question?  Is my context and intent clear?</p>",
        "id": 154020617,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1542988091
    },
    {
        "content": "<p>So, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , before I posted my final note in the chain (so far), you similarly proposed three use cases.  I want to suggest, though, that not all use cases require that patients understand the spec. </p>\n<p>I very much anticipate cases where someone says \"My dad has Parkinsons AND is allergic to XYZ\" (or any other combination), or even \"My dad has Parkinsons that is not responding to anything,\" leading to (for instance) a care proxy person who has the same desires Kristina and Morris had, but without the skills those two have. Particularly in diseases that have no known cures, the activist segment of the community will want to dive in and ask \"What might we do here, for starters? We have nothing to lose and perhaps everything to gain.\"</p>\n<p>My Amsterdam proposal of a \"patient-side ecosystem\" specifically anticipates that when a bunch of such people get together with a common interest, they may come up with explorations or dashboards that THEY AND THEY ALONE find interesting or useful.  One important implication is that self-organised studies may arise that would never happen in the traditional academic model where funding of a study requires demonstrating that it has some sane  rationale.</p>\n<p>In this domain there could be no more potent specimen than the #OpenAPS / #NightScout / #DIYPS community, of which <span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetm채ki</span> is a member - the first-ever DevDays MVP from Amsterdam. Mikael, what are your thoughts? Should our \"welcome page\" for patients have a goal of orienting them to the FHIR spec?  If not, what should its goal be?</p>",
        "id": 154020620,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1542990892
    },
    {
        "content": "<p>The patient / patient-advocate hackers will need an orientation to the spec, but we can point those to the developer viewpoint (because that's how they'll be behaving).  The non-developer patients/advocates don't necessarily need to understand the spec per se.  They need to understand what FHIR can do and how they might benefit from it.  In some cases they might care a little bit about what the different resources represent if they want to exercise control over information distribution, though ideally a proper constraint layer will protect them from needing that level of technical understanding.</p>",
        "id": 154020627,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542994781
    },
    {
        "content": "<p>I like the 3 perspectives Lloyd offered</p>",
        "id": 154020638,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543006982
    },
    {
        "content": "<blockquote>\n<p>I like the 3 perspectives</p>\n</blockquote>\n<p>Me too, I think :-) but I want to be sure what the \"three\" are.<br>\n1. the patient hackers <br>\n2. non-developer patients<br>\n3. And...? \"might care a little about what the different resources represent\"?</p>\n<p>I hope (assume?) we're eager to take an experimental / explorer approach to this and see who shows up and what they need, rather than wait until we think we have it all figured out!  Because heaven knows what those people will want.</p>\n<p>For that reason:<br>\nI'm also going to see if I can talk Kate &amp; Kristina Sheridan into diving in, to vote on what they would have liked in 2010-ish. And let's all hope Michael Morris will have the health &amp; energy to dive in and advise.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I know Kristina well enough to approach her, and I could approach Michael (thanks to your introduction) - is there a \"right\" way to invite, in this situation, or should I just be my usual cordial and klutzy self? <span class=\"emoji emoji-1f642\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 154020664,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1543088991
    },
    {
        "content": "<p>p.s. If we create a glossary for patient newbies, let's be sure \"data mule\" has a grin attached!</p>",
        "id": 154020665,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1543089032
    },
    {
        "content": "<p>\"Data mule\" is probably too pejorative.  \"Data transporter\" might be better.  I expect it's going to be the most common - people who use the existing interfaces to cust through the process and technical red tape of the information flowing automatically between separate systems/organizations.  The third category (in addition to \"data transporter\" and \"hacker\") is \"app user\" - someone who won't be writing their own software or looking at the raw data, but will be examining their own data and manipulating it/analyzing it using patient-centric apps.</p>",
        "id": 154020721,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1543164152
    },
    {
        "content": "<p>let us know how talking to SPM folks goes. thanks (<span class=\"user-mention\" data-user-id=\"196987\">@Michael Morris</span> )</p>",
        "id": 154020753,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543204240
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> in my experience patients who have played this role discuss it as being the data courier or messenger, because they literall do the job that would have been performed by a courier.</p>\n<p>Culture anecdote: In the patient world the most famous example is the tragic story of Regina Holliday, who then started three \"73 cents\" movement and tthe Waking Gallery of Healthcare (the painted jacket I wore at #devdays.</p>",
        "id": 154020807,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1543230792
    },
    {
        "content": "<blockquote>\n<p>Mikael, what are your thoughts? Should our \"welcome page\" for patients have a goal of orienting them to the FHIR spec? If not, what should its goal be?</p>\n</blockquote>\n<p>To be honest, I feel I'm very much in what <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> called the patient hacker audience. For that audience, I don't think much other needs to be done than what is already there. The spec itself is the key. In addition to the spec itself, the first things I'd look for are \"Who's using it?\" and \"For what?\". I think most of that info is already available, but it would perhaps be nice to have a listing of existing \"hacks\" once we have a collection of those. That would also cater for the \"app user\" audience. And if some of the implementations support the \"data courier\" use case, let's of course list those too.</p>\n<p>I do see the chicken-and-egg problem here... I'd personally find it more logical to list implementations once they emerge. I don't know what would be an effective way of communicating the opportunities the spec offers, without concrete examples.</p>\n<p>The other point I see is what <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> mentioned in Amsterdam. We could have a working group for patient advocates, or have more patient advocates participating in existing working groups, to make sure the spec itself takes into account the concerns of patients. So the Patient Intro page should probably mention that kind of an opportunity to get involved, once it exists.</p>",
        "id": 154020997,
        "sender_full_name": "Mikael Rinnetm채ki",
        "timestamp": 1543307618
    },
    {
        "content": "<p>Great response. Useful. </p>\n<p>I agree that you're a \"patient hacker.\"  does <span class=\"user-mention\" data-user-id=\"196987\">@Michael Morris</span> fit that class?. Are you a developer, like him, in your outside life?</p>",
        "id": 154021110,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1543340609
    },
    {
        "content": "<p>Bumping this up to get <span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetm채ki</span> 's attention again...</p>",
        "id": 154023381,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1544063071
    },
    {
        "content": "<p>Yes, software development is my profession</p>",
        "id": 154023608,
        "sender_full_name": "Mikael Rinnetm채ki",
        "timestamp": 1544138931
    },
    {
        "content": "<p>I'm wondering about creating a taxonomy of competencies for use in modeling which patients are likely to want to (and be able to) do what. What do others think?</p>\n<p>Clearly much of medicine thinks only people with medical training can do anything useful with such data.  Superpatients like OpenAPS and Mike Morris prove that false. But obviously that doesn't mean any reason person can. </p>\n<p>To establish the credibility of this effect we need to collect specimens and categorize them, eh?</p>\n<p>All the 7 patient stories in \"Beyond Impossible\" are another set - not so much driven by data but by patient initiative and effort and experimentation focused on self defined goals, and all producing real therapeutic results. I am not skiing healthcare to change the system to serve an infinite list of objectives - I'm just asking the FHIR community to accommodate self work toward that unlimited list, as well as the patient side app ecosystem cited in my speech.</p>",
        "id": 154025833,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1544891052
    },
    {
        "content": "<p>If we had such a system, what would it be used for? I fear it could be used for more damaging effect, then positive.</p>",
        "id": 154025925,
        "sender_full_name": "John Moehrke",
        "timestamp": 1545054847
    }
]