[
    {
        "content": "<p>So we're starting to have standards communities proposing to create \"patient focused APIs\"</p>",
        "id": 162210540,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554096638
    },
    {
        "content": "<p>That is, an APi that is expected to implemented by patient apps running in hand-held devices owned by the patient.</p>",
        "id": 162210561,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554096670
    },
    {
        "content": "<p>There's a set of different functionalities this might entail:</p>\n<ul>\n<li>accessing patient summary data (e.g. USCDI by Us-core - argonaut)</li>\n<li>Gathering patient reported outcomes measures </li>\n<li>collecting wearable sourced data</li>\n<li>letting patient's make appointments  + request / order services or supplies</li>\n<li>extending care into the home</li>\n<li>medications management at home</li>\n</ul>",
        "id": 162210633,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554096792
    },
    {
        "content": "<p>By default, we're going to start having a lot of different IGs that make rules about this software (published by multiple different organizations). Should we trying and coalesce them so we only have one (or a few)?</p>",
        "id": 162210763,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554096995
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span>  <span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span>  MedMij ?</p>",
        "id": 162213199,
        "sender_full_name": "René Spronk",
        "timestamp": 1554100632
    },
    {
        "content": "<p>is one of a number of related specs</p>",
        "id": 162213588,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554101247
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> who is the \"we\" starting to have these discussions?</p>",
        "id": 162220791,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554109532
    },
    {
        "content": "<p>HL7 committees mainly, though I expect that overlapping discussions are also happening in IHE (<span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ) Carequality (<span class=\"user-mention\" data-user-id=\"191860\">@Didi Davis</span> ) CarinHealth (<span class=\"user-mention\" data-user-id=\"214364\">@Ryan Howells</span> ). and I know that some affiliaites are having them (a la MedMij in Netherlands as above) and Argonaut in Australia and nordic countries. Also, SPM and QS would be interested though I'm sure not discussing stuff yet</p>",
        "id": 162221016,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554109750
    },
    {
        "content": "<p>SPM seriously needs to spin up a health IT team!</p>",
        "id": 162222127,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554110749
    },
    {
        "content": "<p>I think so. That could be our patient representatives... but what would it look like?</p>",
        "id": 162222326,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554110922
    },
    {
        "content": "<p>Is this something that would be a weekly call basis? Do 'we' issue an IG? Do we require USCDI/MedMij and what not to conform to this IG? Are 'we' if only a little in IHEs backyard with this. Tradtionally IHE does not really include patients, but the notion of producing an IG for a world wide felt 'problem' sure feels like IHE territory</p>",
        "id": 162222957,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554111486
    },
    {
        "content": "<p>all very good questions. I don't know the answer to any of them.</p>",
        "id": 162223183,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554111690
    },
    {
        "content": "<p>obviously it's easier if we just all go ahead and produce chaos. Not producing chaos will take work - how much and is it worth it?</p>",
        "id": 162223206,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554111717
    },
    {
        "content": "<p>I don't think it has to be IHE that produces a world wide implementation guide. It's well positioned in some ways to do it, and I wouldn't object - but it would require different thinking on the part of IHE</p>",
        "id": 162223282,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554111756
    },
    {
        "content": "<p>for both jurisdictional and patient perspective reasons</p>",
        "id": 162223294,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554111776
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/k-nOD4hgoW181nOqtvHoPMTZ/IMG_0490.PNG\" target=\"_blank\" title=\"IMG_0490.PNG\">IMG_0490.PNG</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/k-nOD4hgoW181nOqtvHoPMTZ/IMG_0490.PNG\" target=\"_blank\" title=\"IMG_0490.PNG\"><img src=\"/user_uploads/10155/k-nOD4hgoW181nOqtvHoPMTZ/IMG_0490.PNG\"></a></div>",
        "id": 162227655,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554116330
    },
    {
        "content": "<p>Not being familiar with IHE, I googled it, and how amusing.</p>",
        "id": 162227660,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554116336
    },
    {
        "content": "<p>Re SPM and a health IT team - SPM have always suffered from a void of middle management with rare exceptions. Let's not count on that unless we can come up with such a leader - someone who knows technically what needs to be done. </p>\n<p>Focusing on care coordination, for kids and or elders, may strike paydirt. </p>\n<p>Can someone spit out 2-5 sentences on what we hope to do, as what work is needed?</p>",
        "id": 162227914,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554116572
    },
    {
        "content": "<p>for which? care coordination, or standards coordination?</p>",
        "id": 162231287,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554119995
    },
    {
        "content": "<p>Yes, CARIN is developing IGs for patient focused IGs along with other groups. Accessing patient summary data is the responsibility of Argonaut. They will be developing an R4 version of their IG which will include all of USCDI v1 as described in the ONC proposed rule. They are also developing an appointment IG. CARIN is developing IGs so patients can access all of their claims information from health plans so plans can be compliant with the CMS proposed rule. We are also developing a consumer-facing real time pharmacy benefit check capability for consumers to see their OOP pharmacy costs, and we are working with CMS on making the post-acute care assessment information available to consumers. We would welcome others thoughts in making more data available to patients.</p>",
        "id": 162233529,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1554121713
    },
    {
        "content": "<p>Hi Ryan! Hadn't seen you here in my limited rummaging. </p>\n<p>Grahame, has anyone identified what-all needs to be included in  care coordination? I imagine it would be limitless, but has anyone identified some worthy subsets?</p>",
        "id": 162234174,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554122246
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> my 2-5 sentences question was about the possible SPM topic, likely care coordination</p>",
        "id": 162234766,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554122643
    },
    {
        "content": "<p>... will get back to this tomorrow....</p>",
        "id": 162235892,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554123469
    },
    {
        "content": "<p>Good initiative, and I agree that the outcome is unclear. IHE (<a href=\"http://www.ihe.net\" target=\"_blank\" title=\"http://www.ihe.net\">www.ihe.net</a>) has some IG that are intended to have the patient engaged with them, but there is not logical place in IHE for a focus on the patient. This is not for lack of trying, but patients are hard to herd, they are worse than cats.</p>",
        "id": 162242114,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554127782
    },
    {
        "content": "<p>I suspect that at best we can have a community of interest, made up of people that are participating in one or more of these initiatives. In this way we can share what is happening, and call upon our peers at specific points. As a community of interest it should be very approachable, far more approachable than any of those you mentioned.</p>",
        "id": 162242319,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554127904
    },
    {
        "content": "<p>seems fhir foundation might be a good coordinator of this community?</p>",
        "id": 162242412,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554127951
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> you may recall your talk with our Ministry of Health folks. I dropped this initiative with them and we agreed that being able to talk about this type of topic might just be the type of platform we need for scaling up  - in my mind within HL7 not the FHIR Foundation but hadn't put too much thought into that part yet - John says that IHE may not be a natural fit for this; I'm still convinced we'd need IHE input. Patient focused APIs should, I think, be as much as possible be the same as provider APIs.</p>\n<p>Sure enough there's stuff to flesh out, the questions I raised earlier for example, but probably more. Example: we have not yet decided whether or not we go to R4, so from where I currently stand I'm more interested in talking interaction patterns that work across FHIR versions than solutions that tie into \"the latest version only\". This may shift as internal R4 talks progress.</p>\n<p>I hope this can be the start of a new level of interaction between similar initiatives that currently live in different project realms.</p>",
        "id": 162373087,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554238254
    },
    {
        "content": "<p>As an implementer of patient-centric (or even citizen-centric) self-care apps, we (Sensotrend) have found the HL7 FHIR specification to include everything we need API-wise. We're doing everything on <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>'s list, except USCDI access. I don't see the need to create new APIs. There probably is a need for Implementation Guides, though.</p>",
        "id": 162398012,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1554266447
    },
    {
        "content": "<p>It's not so much a question of creating new APIs as it is of standardizing/profiling them so that there's consistent data exposed to and access by patient-facing apps.</p>",
        "id": 162399760,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554269137
    },
    {
        "content": "<p>I do agree that dominant work is just grouping existing profiles in a way that presents them around patient centric use-cases. Often the IG are very Provider, EHR, or Payer centric. This is simply a perspective shift, not a technical change. <br>\nI think the patient empowerment might uncover some APIs that are driven by patient desire to do something that Providers , EHR, and Payers are not interested in providing.</p>",
        "id": 162434162,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554301498
    },
    {
        "content": "<p>We (Symptomatic) are very much in this space also, and like <span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span>  have also found the FHIR spec in general to cover 80% of what we need.  The remaining 20% could be summarized in the following two challenges (imo):</p>\n<p>1. Coordination of test patients between EHR vendors.  We're finding that each EHR has a different set of test patients (Jason/Jessica Argonaut, Nancy SMART &amp; family, Candace Salinas, etc).  Which is nice, but doesn't help with use cases around patient matching, consolidating patient summary data, and otherwise.  This is ostensibly what the Ring of FHIR project is hoping to address (I think), although the Synthea project is also relevant.  It would be great to get an IG for a longitudinal patient record that encompases all the major EHR vendors.  Register that longitudinal patient in Synthea, have the folks running Ring of FHIR register the patient in each of the participating EHR instances, fetch that patient across the Ring of FHIR, and get that reference in place so these patient centered apps can compare their results with the benchmark.  <br>\n2. Secondly, it's the 'write data' use case.  And specifically...  how to track provenance?  How is quality control performed?  Are standards such as the Integrated Health Model Initiative (IHMI) and other evidence-based-medicine being supported?  What does the workflow for return data look like?  Is it fully automated or is it queued?  And so forth.  We have some ideas about how we want (hope) these processes to look like, but I suspect it's going to be cat-herding of different ideas.  My worry is that the major EHRs are going to try to influence these IGs, and they're going to default to an assumption of keyboards, mice, and laptops because of intrenched investments; and ignore advanced/consumer haptics use cases involving NFC, geolocation, voice, IoT, etc.</p>",
        "id": 162434397,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1554301639
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> thanks for starting this! Agree with <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> that provider and patient api's should be as much the same as possible. Would love to start bringing up all IG's already available and come to a first set of as much as possible (internationally) standardized api's.</p>",
        "id": 162451305,
        "sender_full_name": "Ron Roozendaal",
        "timestamp": 1554313685
    },
    {
        "content": "<p>I'm totally puzzled about why a patient API (whatever THAT means) would be any different from a provider API. Is there an example of what a patient API would need to do that is not possible with (or not well suited to) a provider API?</p>",
        "id": 162452243,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554314355
    },
    {
        "content": "<p>The things we found solutions for in MedMij that may or may not be the same as Argonaut and other initiatives, and where I would like to have a proper conversation:</p>\n<ul>\n<li>\n<p>We implemented the patient summary using queries on the individual building blocks. Push to the Patient is not supported in MedMij anywhere. No document, no compartment, no operation, no graph. This serves some things really well and complicates others.</p>\n</li>\n<li>\n<p>We looked at Argonaut for Appointments and found the method for canceling using PATCH too complicated. We used an operation instead</p>\n</li>\n<li>\n<p>We looked at SDC for Questionnaire(Response) and found it lacked provisioning the Q to the patient. We added a Task construct for that. That solution is going to be balloted locally soon. We were not ready for the operations in SDC and decided not to include those currently. We did not address how to find where the QR goes.</p>\n</li>\n</ul>\n<p>It's these and other things like it, where we might support each others basic FHIR resources, likely do not understand each others code systems and extensions, but we might not be able get the basic flows running because we don't support the same interaction patterns.</p>\n<p>I don't know at this point what a patient focused API is, but my interpretation would be that we try to harmonize how we leverage the existing FHIR API spec for certain use cases. So it is not so much the invention of something new, but rather how to constrain similarly.</p>",
        "id": 162452780,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554314686
    },
    {
        "content": "<blockquote>\n<p>I'm totally puzzled about why a patient API (whatever THAT means) would be any different from a provider API. Is there an example of what a patient API would need to do that is not possible with (or not well suited to) a provider API?</p>\n</blockquote>\n<p>Where are you getting the impression that it is fundamentally different? I read every message here as fully supportive. So I am puzzled at your puzzlement.  I presume the puzzlement is from other communities, it would be good for us to understand where divergence is coming from too.</p>",
        "id": 162457754,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554317693
    },
    {
        "content": "<p>Ha! <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , the only reason I'm assuming it's different is because people are TALKING about a patient API, instead of just \"the API.\"  I ain't the one who added the modifier.  </p>\n<p>What IS, then, a patient API?  What are y'all talking about?</p>",
        "id": 162458432,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554318105
    },
    {
        "content": "<p>well, any specification of an API starts with use-cases... and there are some use-cases that are driving some FHIR API definitions that are not appropriate for a patient to be engaged in... like reporting on population health statistics... not that we are trying to hid something, just that an API has a defined use-case</p>",
        "id": 162458724,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554318293
    },
    {
        "content": "<p>I will now return to the top of this stream, in which Grahame said:</p>\n<div class=\"codehilite\"><pre><span></span>So we&#39;re starting to have standards communities proposing to create &quot;patient focused APIs&quot;\n\n**That is, an APi that is expected to implemented by patient apps running in hand-held devices owned by the patient.**\n\nThere&#39;s a set of different functionalities this might entail:\n* accessing patient summary data (e.g. USCDI by Us-core - argonaut)\n* Gathering patient reported outcomes measures\n* collecting wearable sourced data\n* letting patient&#39;s make appointments + request / order services or supplies\n* extending care into the home\n* medications management at home\n&#39;&#39;&#39;\n</pre></div>",
        "id": 162458967,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554318469
    },
    {
        "content": "<blockquote>\n<p>I'm totally puzzled about why a patient API (whatever THAT means) would be any different from a provider API. Is there an example of what a patient API would need to do that is not possible with (or not well suited to) a provider API?</p>\n</blockquote>\n<p>Think it through in terms of syntax and grammar.  In English, we have nouns, verbs, direct objects, possessives, propositions, etc.  The default FHIR API is pretty much just verbs (get/put/post/delete) acting on nouns (resources).  SMART on FHIR then extends that model by introducing direct-objects via the provider launch context.  No longer am I simply an abstract librarian fetching an abstract medical record; but now I'm a provider fetching the records of a specific somebody else.    </p>\n<p>The thing is... somewhere along the way, we began to assume that SMART on FHIR provider launch context is the default.  From a business perspective, traditional billable activities for providers (and ROI) is all within the provider launch context.  So implementors simply begin with the provider launch context, because that's where the money is.  Patient launch context is still not implemented on some of the major EHR vendor systems.  </p>\n<p>But back to the syntax and grammar model… a Patient API would have a few things…   a SMART on FHIR patient-launch context, at the very least.  That would involve using the launch context to describe a sense of ‘self’.  Basically a self-referential loopback, similar to 127.0.0.1, but at the application level.  I suspect that will involve putting the patientId in some standardized place along with the OAuth access token, as it seems to differ between EHR implementations right now.    </p>\n<p>Once we can get that sense of ‘self’, then the grammar and syntax of the API can have meaningful possessive attributes.  The most interesting of which is probably a <code>$my</code> operator, followed by <code>$near</code>,<code>$recent</code> and other prepositions.  <code>Get my procedures.  Get my medication orders.  Get providers near me.</code> and so forth. </p>\n<p>Compare that in contrast to the provider/EHR model of looking up a patient…  name, age/date of birth, sex/gender?  Why would any patient need or want to look up records in such a format?  How often does that change?  It's entirely premised on a many-to-one usecase, whereas the Patient API usecase is almost entirely one-to-one(self).  Also, what value would a <code>$my</code> operator be to a provider?  The patient doesn’t care about their doctor’s medical records.  But as a patient you know what would be useful?  <code>POST $my Medications _history $to Providers $near $me.</code>  I'm using pseudocode to illustrate the point; and how that gets sorted out to REST API I'm not sure.  But suffice it to say that there would be different usage patterns for Patient centric access.  </p>\n<p>tl;dr…  Anyhow... much of what would be needed to satisfy the needs for a Patient API will probably involve SMART on FHIR and query/search parameters.</p>",
        "id": 162459033,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1554318496
    },
    {
        "content": "<p>I have a feeling I'm not the right person to sort out (yet) what the heck you guys are saying - John seems to be saying patient API is a subset of BHAGAPIOE (big hairy audacious generic API of everything), whereas Abigail is talking about adding direct objects (love the grammar metaphor, Abigail). </p>\n<p>I'll let others decide when it's time to pursue this. For the moment I'm personally willing to step back to higher-order strategic topics.</p>",
        "id": 162459626,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554318859
    },
    {
        "content": "<p>The only addition I'd make is that a patient API will almost certainly also want to extend to accessing the records of children or other family members the user has care responsibility for (and permission to access).  So part of the API will be about how to manage such access requests</p>",
        "id": 162459722,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554318925
    },
    {
        "content": "<p>The patient API might also have a higher priority need for being able to review Provenance - who's looked at or changed 'my' record.  That tends to be a lower priority for sharing amongst providers.</p>",
        "id": 162459846,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554318993
    },
    {
        "content": "<p>patient and provider have very different use cases, so the API differs. Also, the eco-system around patient is very different than that around provider. And inherent in my question is the idea that patient is core and worth more effort not to fractionate. For instance, I know of no reason to think that provider focused software should not be different in different counties, but no <em>good</em> reason why patent focused software should be</p>",
        "id": 162460427,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554319369
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"216873\">@Ron Roozendaal</span> indeed I would like them to be much the same as possible. I'm just not sure how to work on that (particularly once multiple languages come into play). <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> I don't recall the MedMij issues being discussed with Argonaut / SDC?</p>",
        "id": 162460546,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554319447
    },
    {
        "content": "<p>The differences in different countries would come down to legislation and culture, same as always.  What providers are allowed/required to share may differ, expectations for proof of identity (and infrastructure to support it) will differ, rules around access to data for children will differ.   And, of course, the standards mandated on the data itself (e.g. codes for drugs) will also differ.  Can't insulate the patient API from those impacts.</p>",
        "id": 162461134,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554319893
    },
    {
        "content": "<p>no you can't. but there are lots of other things that differ that we can and should minimise the differences. Like the differences between Argonaut and IPS - some of them are requirements based, but most are not</p>",
        "id": 162461657,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554320271
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191375\">Alexander Henket</span> I don't recall the MedMij issues being discussed with Argonaut / SDC?</p>\n</blockquote>\n<p>They weren't to my knowledge. The Appointment stuff was produced in a pressure cooker situation, and we first took the outcome  to a local PoC type of setup. The feedback was minimal so far. Secondly the framework (Afsprakenstelsel) around it was lacking functionality to really move forward on the use case, so we're a bit in between stations with that work.</p>\n<p>Questionnaire(Response) is different. We are on the verge of a local ballot and the Task thing is no more than 2 months old so in between WGMs. I'm sure my colleagues meant to take that to SDC, but have not gotten to that yet.</p>",
        "id": 162462290,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554320760
    },
    {
        "content": "<p>So I'll punt to a yet-higher level: do we have, yet, a human-friendly article about what an API is and does (or allows), but with enough specifics that one could get a feel for the decisions that must be made in specifying one?</p>\n<p>I'd be quite happy with something that, instead of \"starts with use cases\" (which would scare away some family caregivers), says: (And I won't be surprised if some of these are stupid /impractical examples)</p>\n<div class=\"codehilite\"><pre><span></span>* I need to be able to check if there are interactions between Mom&#39;s new meds and the ones she&#39;s already taking\n* I need to be able to link Mom&#39;s WiFi scale&#39;s weight data (or step count data or...) so her HCPs can track it\n* I need to be able to fetch everything about Mom&#39;s knee history, for her new ortho to review\n* I need to pull up my notes about my random mild gout episodes, because it&#39;s getting annoying enough I finally want to talk to someone about it\n* I want to create an EMT Info sheet that summarizes what ambulance people will need to know,  so they can view it while racing to the scene (home, car crash, restaurant...) and so that it AUTOMATICALLY STAYS UP TO DATE\n&#39;&#39;&#39;\n\nOkay, y&#39;all, throw darts at THAT.\n\n(I generated that list by thinking of things that would be compelling value props for caregivers I personally know - things they worry about) (Plus my gout, which my doc says probably isn&#39;t gout)\n</pre></div>",
        "id": 162462579,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554320967
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> For some reason I have never been able to get the MedMij framework people in touch with the SMART on FHIR people. Secondly I've never quite grasped why SMART on FHIR was deemed unfit for the MedMij setup: I just know it has been. So for now your assumption that SMART on FHIR is the common starting point for any Patient centric app will not hold here.</p>",
        "id": 162462608,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554320997
    },
    {
        "content": "<p>Well, that's certainly interesting to know.  SMART on FHIR basically specifies FHIR and OAuth (and OpenID).  We might be able to refactor the patientId away from the OAuth scope and into a RESTful endpoint.  <code>/fetchMyPatientId</code> or <code>fetchMyIdentity</code> or similar.</p>",
        "id": 162463050,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1554321261
    },
    {
        "content": "<p>One REALLY compelling use case for caregivers, btw, is defending against flipping STUPID UNDERPAID IDIOTS who work in some doctors' offices these days.  </p>\n<p>I'll drop in this true scare-bomb:  when my mom saw a new eye doctor last year, an assistant interviewed her as usual (because of course her data couldn't flow in), and then in the doc's room he examined her and said \"It looks like we're going to need to do surgery.\"  She asked why (the symptom wasn't that bad) and he said \"It's the best thing to do, since you're diabetic.\" \"I am not,\" she said.  He pointed to the chart, created minutes earlier.</p>\n<p>It turns out the idiot assistant, reviewing meds, had seen one that's PRIMARILY for type 2 diabetes but has other indications. Stupid Idiot saw it and also wrote that Mom's diabetic!  Without asking or even noting that she did.</p>\n<p>Maybe this use case is dubbed SDAIMA - self-defense against idiot medical assistants. </p>\n<p>OTOH, in this case clearly the doc himself is culpable for handing a medically critical task to someone he hasn't trained to handle the responsibility! My point stands.</p>",
        "id": 162463263,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554321413
    },
    {
        "content": "<p>Sure from experience in various studies we found that very large percentages of patients found errors in their records after gaining access. They also became frustrated rapidly if the processes were not in place to correct them.<br>\nAnother area of fun is providers contradicting each others diagnoses. For example because you switched providers and data becomes outdated.</p>",
        "id": 162463734,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554321709
    },
    {
        "content": "<blockquote>\n<p>They also became frustrated rapidly if the processes were not in place to correct them.</p>\n</blockquote>\n<p>What processes do you have in place?</p>",
        "id": 162463908,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554321816
    },
    {
        "content": "<p>Yes, <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> , there are many reasons for the patient to become the \"single source of truth.\"   The complicating factor is patients who have truly ignorant beliefs, like my relative who honestly believes the government has poisoned the clouds so we must all dodge the raindrops.  (This is a just plain stupid person, not someone with a mental health diagnosis.)</p>",
        "id": 162463940,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554321839
    },
    {
        "content": "<p>Replying to self about SDAIMA: I know numerous vendors have for YEARS been stymied by lack of data streams, and it's wild to anticipate how many might blossom (and vary) when they finally have access to \"fuel.\"</p>",
        "id": 162464298,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554322061
    },
    {
        "content": "<p>In the studies there were some experiments with MedicationStatements. Most was face2face though. At the very least the PHR should be able to let a patient mark faulty data so he isn't presented in the interface with that every time.</p>\n<p>We intend to make MedicationStatements flow back electronically in general but aren't there yet. The patient did not appear to mind about  the exact measures at his disposal for correction, as long as he could.</p>",
        "id": 162464632,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554322267
    },
    {
        "content": "<p>We're seeing that general sentiment also.  As soon as we started pulling production records and showing them to people in a pilot, we had users identifying errors and corrections they wanted to make.  Right now, we're looking at providing a phone number to the hospital, printing out a reconciled record in PDF (possibly with compare/contrast), and allowing the user to download/export the reconciled/modified record.</p>\n<p>Once we have an updated Bundle (CCDA on FHIR) though... then what?  Serialize to v2?  POST to the <code>/Bundle</code> endpoint?  POST updated resources individually?  Post to some sort of other endpoint?  That's maybe registered in /metadata?  idk.</p>",
        "id": 162465391,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1554322743
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> We try to anticipate for patients with varying degrees of proficiency. The PHR is not to be a requirement for patients, but an option. We do not assume any singular app/platform for anything. Patient has choice. We are working on patient friendly terms for all common SNOMED CT concepts. We have talks with medication database owners so they can provide APIs for additional information, the PHR UIs shall comply with rules for vision impaired people.</p>\n<p>Things we could not solve: between age 12-16 there is a consent issue, health guardians are in an official registry without public access so there's no way to know who's in there and various other specialized cases (prisoners, mental unstable people, bastard off-the-record children mentioned in your EHR, ...). A thing we did not scope: if the patient has so much app choice: how does data portability work when he moves from appA to appB</p>\n<p>I for now would be happy if we could get harmonization on how to approach use cases without considering all aforementioned possible exceptions. I very much liked how <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> framed it using the pseudo code.</p>",
        "id": 162466091,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554323128
    },
    {
        "content": "<blockquote>\n<p>Once we have an updated Bundle though... then what?  Serialize to v2?  POST to the <code>/Bundle</code> endpoint?  POST updated resources individually?  Post to some sort of other endpoint?  That's maybe registered in /metadata?  idk.</p>\n</blockquote>\n<p>We didn't come far enough to know if a Bundle is useful, or maybe just upload each MedicationStatement. In any case it would be a FHIR solution from the patient perspective. It might get translated into something else to be entered in the EHR. From there, some reconciliation process would need to start, with an outcome that somehow makes it way back to the patient.</p>",
        "id": 162466567,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554323410
    },
    {
        "content": "<p>Maybe we just throw on a <code>_reconcile</code> parameter to the POST url to trigger the reconciliation process?  Also, the CapabilityStatement resource tracks <code>interaction</code> field.  This may be a significant enough use case to justify a new <a href=\"https://www.hl7.org/fhir/codesystem-restful-interaction.html#4.3.14.177.2\" target=\"_blank\" title=\"https://www.hl7.org/fhir/codesystem-restful-interaction.html#4.3.14.177.2\">top-level interaction</a>.  How about 'reconciliation' as a top level interaction?  A system can register that it supports reconciliation writes in the Capability Statements, and if they do, the patient can POST to the various endpoints using a _reconcile parameter (similar workflow to _history).  The receiving system can reconcile the receiving data however it wants.</p>",
        "id": 162468071,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1554324367
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> here's my list or what I want to see (for your human friendly article):</p>\n<p>I need to </p>\n<ul>\n<li>get medications sent to me so my own app has the list I'm supposed to be taking</li>\n<li>be able to check if there are interactions between Mom's new meds and the ones she's already taking</li>\n<li>share information from my wearables / scales / etc  with my healthcare providers when they want it </li>\n<li>get my health history etc from my providers and build a single complete history</li>\n<li>keep a copy of my referrals </li>\n<li>share my history with providers and automatically fill out (pre-)admission forms from it (+ my meds)</li>\n<li>keep track of my own issues and share notes when appropriate </li>\n<li>maintain a summary sheet for EMT usage</li>\n<li>have a copy of my care plans and give access to them to my care team </li>\n<li>send secure messages to my care providers when I have problems with my care plan</li>\n<li>be able to choose / switch patient focus across those I have access to (family etc)</li>\n<li>choose other systems to share my data with to get care support or to support research</li>\n</ul>",
        "id": 162483337,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554338431
    },
    {
        "content": "<blockquote>\n<p>patient and provider have very different use cases, so the API differs. Also, the eco-system around patient is very different than that around provider. And inherent in my question is the idea that patient is core and worth more effort not to fractionate. For instance, I know of no reason to think that provider focused software should not be different in different counties, but no <em>good</em> reason why patent focused software should be</p>\n</blockquote>\n<p>One reason patient focused software might be different from provider focused software in different countries ( assumed you meant countries, not counties) is the potential difference in laws across multiple countries.</p>",
        "id": 162490603,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1554347982
    },
    {
        "content": "<p>yes countries.</p>",
        "id": 162493386,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554351632
    },
    {
        "content": "<p>That last list seems like a fine starting point. It's easy to make that list grow fast but we also need some focus my tendency is towards smaller first.</p>\n<p>What's next? Presumably we can all get access to IGs around the world from here <a href=\"http://hl7.org/fhir/\" target=\"_blank\" title=\"http://hl7.org/fhir/\">http://hl7.org/fhir/</a>. I see I have a task on my list to make MedMij known in the \"Other\" section. that currently only lists IHE. This might give us a hint here who we might have missed.</p>\n<p>Organizationally: is this thread the best place until we've grown beyond practicality? We should probably have a Confluence page for note-keeping. For the short term this probably contains important fragments until we think we can have a stab at an IG? Somewhere a PSS is helpful to make us think about process/timelines/deliverables?</p>",
        "id": 162497358,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1554357701
    },
    {
        "content": "<p>I better change that link to point to here:</p>",
        "id": 162497497,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554357864
    },
    {
        "content": "<p><a href=\"http://www.fhir.org/guides/registry\" target=\"_blank\" title=\"http://www.fhir.org/guides/registry\">http://www.fhir.org/guides/registry</a></p>",
        "id": 162497531,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554357921
    },
    {
        "content": "<p>Would this (Patient APIs) be a topic for a popup session at DevDays in June?</p>",
        "id": 162815918,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1554729569
    },
    {
        "content": "<blockquote>\n<p>HL7 committees mainly, though I expect that overlapping discussions are also happening in IHE (<span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> ) Carequality (<span class=\"user-mention silent\" data-user-id=\"191860\">Didi Davis</span> ) CarinHealth (<span class=\"user-mention silent\" data-user-id=\"214364\">Ryan Howells</span> ). and I know that some affiliaites are having them (a la MedMij in Netherlands as above) and Argonaut in Australia and nordic countries. Also, SPM and QS would be interested though I'm sure not discussing stuff yet</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Carequality plans to point to work developed by other groups such as the CarinHealth Alliance, Argonaut, etc. with regards to patient focused APIs in general.  However, Carequality does have several Consumer App implementers who are discussing the requirements for Authentication, Trust and Authorization in the FHIR Technical Workgroup.  The Technical Workgroup is focused on creating an “implement once, connect<br>\nuniversally” ecosystem.  This slide shows the current Carequality Connected Agreement Signees where you can note the listing for all the planned networks and the three consumer focused networks.    <a href=\"/user_uploads/10155/rVHcIWJ3N8RMZYXUOFD3WjnX/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/rVHcIWJ3N8RMZYXUOFD3WjnX/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/rVHcIWJ3N8RMZYXUOFD3WjnX/pasted_image.png\"></a></div>",
        "id": 162843919,
        "sender_full_name": "Didi Davis",
        "timestamp": 1554748965
    },
    {
        "content": "<blockquote>\n<p>Would this (Patient APIs) be a topic for a popup session at DevDays in June?</p>\n</blockquote>\n<p>1. It would need to be led by someone who knows what's possible<br>\n2. Ideally it would involve people like Mike Morris and Kristina Sheridan who know in some detail what they want. <br>\n3. Or people who have a simpler (but valid &amp; valuable) use case, solvable on the spot.<br>\nThe following may be an insane statement, but it would be AWESOME (and I think genuinely worthy of attention) if a use case could be implemented on the spot.  My (uninformed) goal here would be for it to be easy for lay people to understand, so that press coverage of it would ignite interest where appropriate in the lay press.</p>\n<p>Do we have anywhere a list of existing smartphone apps that use FHIR, and the data objects (\"resources,\" I believe) each can fetch or put?</p>",
        "id": 162849415,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554753146
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191860\">@Didi Davis</span> this seems unconnected from , sat, this: <a href=\"#narrow/stream/179190-united-states/topic/Publishing.20FHIR.20end.20points\" title=\"#narrow/stream/179190-united-states/topic/Publishing.20FHIR.20end.20points\">https://chat.fhir.org/#narrow/stream/179190-united-states/topic/Publishing.20FHIR.20end.20points</a>. how do we align all this work better? I'm sure we only one want one approach here? (and not confined to USA)</p>",
        "id": 162857849,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554759814
    },
    {
        "content": "<blockquote>\n<p>Do we have anywhere a list of existing smartphone apps that use FHIR</p>\n</blockquote>\n<p>No. The EHR vendors (notably Cerner and Epic) have it - because the app have to register and specify the data they want, but it is not public</p>",
        "id": 162889540,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1554797057
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>Do we have anywhere a list of existing smartphone apps that use FHIR</p>\n</blockquote>\n<p>No. The EHR vendors (notably Cerner and Epic) have it - because the app have to register and specify the data they want, but it is not public</p>\n</blockquote>\n<p>??  Are there no FHIR apps yet that depend on connecting to EHRs??   Are there none that, for instance, merely connect to Apple and fetch / put data to/from there??  <span class=\"user-mention\" data-user-id=\"193764\">@Ricky Bloomfield</span> or anyone?</p>",
        "id": 162932964,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554832064
    },
    {
        "content": "<p>There are, there's an \"Apps That Work with Health Records\" collection in the US App Store under \"Medical\".</p>",
        "id": 162933125,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1554832144
    },
    {
        "content": "<p>The apps listed there connect to HealthKit to retrieve the FHIR data the Health App downloads.</p>",
        "id": 162933248,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1554832203
    },
    {
        "content": "<blockquote>\n<p>There are, there's an \"Apps That Work with Health Records\" collection in the US App Store under \"Medical\".</p>\n</blockquote>\n<p>Thanks, Pascal, but I can't find any such thing - anyone got a link?</p>",
        "id": 162935359,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554833563
    },
    {
        "content": "<p>Go to the App Store app -&gt; Apps tab -&gt; scroll to Top Categories and tap See All -&gt; scroll to Medical -&gt; See All.</p>\n<p>Not ideal, but it’s there and it gets updated from time to time. <br>\n<a href=\"/user_uploads/10155/smnsz9qhi8P0ThcxFDBC9mVZ/E64A9F26-B025-40E3-BF37-005B589FD112.png\" target=\"_blank\" title=\"E64A9F26-B025-40E3-BF37-005B589FD112.png\">E64A9F26-B025-40E3-BF37-005B589FD112.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/smnsz9qhi8P0ThcxFDBC9mVZ/E64A9F26-B025-40E3-BF37-005B589FD112.png\" target=\"_blank\" title=\"E64A9F26-B025-40E3-BF37-005B589FD112.png\"><img src=\"/user_uploads/10155/smnsz9qhi8P0ThcxFDBC9mVZ/E64A9F26-B025-40E3-BF37-005B589FD112.png\"></a></div>",
        "id": 162939264,
        "sender_full_name": "Ricky Bloomfield",
        "timestamp": 1554835963
    },
    {
        "content": "<p>Reviewing the thread here, I agree with everyone of the use cases Grahame included in the initial list. And given the discussion, I'm sure at all sure that bringing together a unified effort is possibly yet. That said, I'd be keen to support any efforts in this direction (whether formal or in-). Building guides or better, reference tools...</p>",
        "id": 162940042,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1554836405
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"193764\">@Ricky Bloomfield</span> .  I'm surprised to see only 7 apps there, but then I ain't at all clear on what would be the dividing line between in and out.  Is that an easy question to answer?</p>",
        "id": 162941276,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554837254
    },
    {
        "content": "<blockquote>\n<p>Are there no FHIR apps yet that depend on connecting to EHRs</p>\n</blockquote>\n<p>Don't understand what you mean - there sure are...?</p>",
        "id": 162941686,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1554837571
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> <span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span> FYI, we will be holding an interactive session at DevDays to review the Health Records API on iOS. We’ll have engineers there (including <span class=\"user-mention\" data-user-id=\"191339\">@Pascal Pfiffner</span>!!)  who can help you realize your patient empowerment dreams. It would totally be possible for someone to implement something “on the spot” if they so desired and have some iOS experience. Would also love to see that happen.</p>",
        "id": 162941984,
        "sender_full_name": "Ricky Bloomfield",
        "timestamp": 1554837828
    },
    {
        "content": "<blockquote>\n<p>We’ll have engineers there (including <span class=\"user-mention silent\" data-user-id=\"191339\">Pascal Pfiffner</span>!!)  who can help you realize your patient empowerment dreams. </p>\n</blockquote>\n<p>Oh dude, you don't know what you're getting into, when you say help ME realize my empowerment dreams ....</p>\n<blockquote>\n<div class=\"codehilite\"><pre><span></span>  It would totally be possible for someone to implement something \n  “on the spot” if they so desired and have some iOS experience. \n  Would also love to see that happen.\n</pre></div>\n\n\n</blockquote>\n<p>Hey, what a FABULOUS opportunity for Apple to sponsor an F-Prize!</p>\n<p>(When I say \"Careful what you wish for,\" and it's about MY desires, I mean really, be careful - or thrilled at the opportunity!)</p>",
        "id": 162943375,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1554838869
    },
    {
        "content": "<p>The EHRs do in fact list the apps that are available in their stores:</p>\n<p><a href=\"https://apporchard.epic.com/Gallery\" target=\"_blank\" title=\"https://apporchard.epic.com/Gallery\">https://apporchard.epic.com/Gallery</a><br>\n<a href=\"https://code.cerner.com/apps\" target=\"_blank\" title=\"https://code.cerner.com/apps\">https://code.cerner.com/apps</a><br>\n<a href=\"https://allscriptsstore.cloud.prod.iapps.com/category/fhir-apps\" target=\"_blank\" title=\"https://allscriptsstore.cloud.prod.iapps.com/category/fhir-apps\">https://allscriptsstore.cloud.prod.iapps.com/category/fhir-apps</a></p>\n<p>You may also want to keep track of the HSPC Marketplace, which is purported to be a vender-neutral app store, to be launched sometime this year.<br>\n<a href=\"https://www.hspconsortium.org/\" target=\"_blank\" title=\"https://www.hspconsortium.org/\">https://www.hspconsortium.org/</a></p>",
        "id": 162964745,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1554858412
    },
    {
        "content": "<p>Well, and <a href=\"http://apps.fhir.org\" target=\"_blank\" title=\"http://apps.fhir.org\">apps.fhir.org</a> for that matter</p>",
        "id": 162967735,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1554862657
    },
    {
        "content": "<p><a href=\"https://apporchard.epic.com/Gallery\" target=\"_blank\" title=\"https://apporchard.epic.com/Gallery\">https://apporchard.epic.com/Gallery</a> lists the app in Epic App orchard, not the ones that use the free API, I don't know how the Allscripts registry works but our app does not show up there as well</p>",
        "id": 162990718,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1554890994
    },
    {
        "content": "<p>A result of open client registration is that we get a TOOOOOON of junk registrations.  Without a vetting process, we have no idea which of the client registrations are  real apps and which are folks playing in our sandbox using Postman or Fiddler.  We have apps registrations with names like TestApp, Demo1, MyTestingApp, etc.  We could filter to those that have production API usage, but that doesn't tell the whole story because developers who are patients at organizations using Epic can create a client registration and use Postman/Fiddler to make production API calls using their personal accounts.    All this to say that one of the trade-offs of making client registration easier is that providing an accurate listing of real apps gets harder.</p>",
        "id": 163041208,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1554927173
    },
    {
        "content": "<p>I don't envy you all in that regard.  There's lots of folks who are quick to complain and criticize, but aren't thinking through the details of what all is involved.  (The Nov upgrade was a good move forward though, imho.)</p>",
        "id": 163043040,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1554928504
    },
    {
        "content": "<blockquote>\n<p>Well, and <a href=\"http://apps.fhir.org\" target=\"_blank\" title=\"http://apps.fhir.org\">apps.fhir.org</a> for that matter</p>\n</blockquote>\n<p>Thanks! Is there any significance to the fact that <a href=\"http://apps.fhir.org\" target=\"_blank\" title=\"http://apps.fhir.org\">apps.fhir.org</a> redirects to <a href=\"http://apps.smarthealthIT.org\" target=\"_blank\" title=\"http://apps.smarthealthIT.org\">apps.smarthealthIT.org</a>?  (Remember, I'm still very foggy on differences between any flavors of this stuff.)</p>\n<p>Man, that list is literally making me breathe heavy ... making me brain-horny. Somebody get me a day job where I get paid to explore that stuff. Thanks, <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  - this <em>is</em> what I was looking for.</p>",
        "id": 163152505,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1555033244
    },
    {
        "content": "<p>Has anyone published reviews of FHIR apps?</p>\n<p>Before long I'm going to need some guidance on what to tell Newbie-World out there about all of this. I'll need help.</p>",
        "id": 163153105,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1555034128
    },
    {
        "content": "<blockquote>\n<p>Is there any significance to the fact that <a href=\"http://apps.fhir.org\" target=\"_blank\" title=\"http://apps.fhir.org\">apps.fhir.org</a> redirects to <a href=\"http://apps.smarthealthIT.org\" target=\"_blank\" title=\"http://apps.smarthealthIT.org\">apps.smarthealthIT.org</a>? (Remember, I'm still very foggy on differences between any flavors of this stuff.)</p>\n</blockquote>\n<p>I think the main significance is that while ONC sponsored the work to put this SMART gallery together, there was strong interest in building it in a cross-community way (broader than just ONC stakeholders). As part of the proposal, the SMART team got buy-in from the FHIR Foundation  to use the <a href=\"http://apps.fhir.org\" target=\"_blank\" title=\"http://apps.fhir.org\">apps.fhir.org</a> URL.</p>",
        "id": 163223003,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1555100137
    },
    {
        "content": "<p>I think this thread has slowly derailed a little from its original intent, and I would like to get back to that intent or as far as I understood it to be. <br>\nSo DevDays US will be having a session on one example of what a patient API could look like. That's great, wish I could be there, but I'm not: please repeat that session in DevDays Amsterdam. Most importantly: it is good to explore different examples, but what we need is to find common ground for common use cases. This way, we would see more chances for vendor implementation to work across different countries with limited effort.<br>\nQuestion remains: how do we organize this? Could this be part of an existing WG? Do we need a new one? So far we have national projects operating in national rooms where national participants may or may not look outside their project for how other people did the same thing. <br>\nProblem:  interoperability between national projects is currently by accident, not by design. FHIR Core for as far as content is concerned would be a given, but whether or not you can get to that content depends on the workflow/API design.</p>",
        "id": 163523957,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1555466532
    },
    {
        "content": "<p>thanks for bringing us  back to this. <span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span> note the call for DevDays Amsterdam.</p>",
        "id": 163530929,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555476256
    },
    {
        "content": "<p>I don't really know the answer, actually. I don't know if HL7 is the best place for it. Maybe it is, but what partnerships do we need? GDPR? IHE? Vendors?</p>",
        "id": 163530946,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555476287
    },
    {
        "content": "<p>We'd love to schedule a meeting for this at DevDays in the US and Europe, but I am still not sure if there is enough beef in this.</p>",
        "id": 163554547,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1555503202
    },
    {
        "content": "<p>If HL7 is not the right place for this I'll at least run into funding questions for F2F meetings.  I don't have that issue for WGM visits. You may still be right: I'm also in doubt. The whole notion of working on common ground for a broader use case really feels like IHE territory, even if the patient is not currently really in their scope.<br>\nTo give the whole thing some body I'd like to see commitment from at least Argonaut, and HL7 IPS. I'd happily contribute for MedMij (NL). I've seen more patient oriented groups in this thread that I didn't know of before like CARIN: broader is better at least in startup phase.<br>\nWhat I think our deliverables could be is to extend from the basic guidance given here <a href=\"http://hl7.org/fhir/usecases.html\" target=\"_blank\" title=\"http://hl7.org/fhir/usecases.html\">http://hl7.org/fhir/usecases.html</a> and work on IGs containing (workflow) patterns around such use cases. We could also find there's spinoff work in spotting harmonization potential in local profiling (e.g. because there is or should be a core extension where a local extension is). From that spinoff work we could also work on more localization guidance e.g. here <a href=\"http://hl7.org/fhir/profiling.html\" target=\"_blank\" title=\"http://hl7.org/fhir/profiling.html\">http://hl7.org/fhir/profiling.html</a>. That last page is specific on what you MAY do, but less specific on what you SHOULD do.</p>",
        "id": 163556988,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1555505529
    },
    {
        "content": "<blockquote>\n<p>[Rien]  I am still not sure if there is enough beef in this.</p>\n</blockquote>\n<p>Am I a chicken in search of an egg, or vice versa?</p>\n<p>More generally, are you saying that nobody has defined a patient use case yet that is at all interesting?  (Has anyone?)  Has anyone tried to gather a group of patient-centered apps from other universes, which should become interested in FHIR?  Should I shut up until someone says it's consumer-time?  ( <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I thought that's why you chased me up at #HIMSS18)</p>\n<p>I need to become unconfused or put myself to sleep for 18 months or something. Advice please (<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span> anyone)</p>",
        "id": 163563977,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1555510256
    },
    {
        "content": "<blockquote>\n<p>It is good to explore different examples, but what we need is to find common ground for common use cases. This way, we would see more chances for vendor implementation to work across different countries with limited effort.<br>\nQuestion remains: how do we organize this? Could this be part of an existing WG? Do we need a new one? So far we have national projects operating in national rooms where national participants may or may not look outside their project for how other people did the same thing. <br>\nProblem:  interoperability between national projects is currently by accident, not by design. FHIR Core for as far as content is concerned would be a given, but whether or not you can get to that content depends on the workflow/API design.</p>\n</blockquote>\n<p>As mentioned above, the Ring of FHIR and Clinicians on FHIR project are maybe relevant attempts at coordinating such efforts.  We could either set up a new group modeled after either of them, or we could submit Patient centric usecases to them, such as we (Symptomatic) did with the Clinician on FHIR and Blockchain on FHIR usecase PDFs.  </p>\n<p>I'm trying to be careful about marketing and soliciting, because our use case documentation is effectively also our product brochure... but we have documents that fairly clearly spell out use cases for Data Fetch, Longitudinal Timeline, Data Reconciliation, Medical Home Management, Remote Patient Monitoring, Health ID, and others.  We also have the blockchain usecases, such as Health Passport, Patient Index, Organ Donor Registry, Consent Management, etc.  </p>\n<p>In the near term, one immediate thing that needs to be harmonized are default test patients between EHR systems.  In effect, we need an IG that cross-pollinates some curated test patients across the different EHRs.  Something I'm hoping to discuss at the Montreal Working Group.</p>",
        "id": 163567561,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1555512574
    },
    {
        "content": "<p>Ring of FHIR: I can only find something at HIMSS Jan 2019, but apparently it's more than that?</p>\n<p>I like your notion of \"Patients on FHIR\" similar to \"Clinicians on FHIR\". Maybe what we do could be practical first rather than theoretical. When we have solid Connectathon scripts around one or more use cases, and find enough backing implementers that take those experiences 'home' to their local projects for input then that could fuel things in the right direction without becoming a new 'meeting club'. Those same scripts, advertised properly, could lead to patterns that people find useful without venturing into an arbitrary number of local projects which is what I do today.</p>",
        "id": 163573300,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1555516002
    },
    {
        "content": "<p>Best of all: we'd be tapping into the Connectathon community/schedule that already exists, hence less extra organizational overhead to be expected. Working on getting the right scripts with the right depth/breadth and eventually generalizing them into something of an IG would require additional effort, it just might work by starting small.</p>",
        "id": 163573642,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1555516208
    },
    {
        "content": "<p>It boils down to resources. We are all very busy with 'day-job' work. We would all love to carve out non-paid-for work, but there is not much time left in a day. I am not discouraged from working on patient centric use-cases, but there is only so much time left in a day. -- To be blunt, follow the money, there is money paying for all available resources to achieve business objectives, there is no money paying for patient objectives. Any movement you see on patient objectives is either influenced by business objectives (The VA has historically been a patient advocate), or is done out of the kindness of the individuals free-time.</p>",
        "id": 163580891,
        "sender_full_name": "John Moehrke",
        "timestamp": 1555521042
    },
    {
        "content": "<p>Understood. MedMij certainly has funding and it solely concerns patients. I would hope any project has its funding worked out. What could be missing here and there is a project description that includes investing time in the community and/or a simple lack of awareness. </p>\n<p>I certainly would not claim to know all projects around the world doing the same use cases we do. We look at things we know exist, use what we can, and adapt what we can't, work with the FHIR Core community on changes/additions to the core, but we don't normally go to Argonaut or SDC to ask for changes (tried once for SDC but SDC shifted to R4 and did not maintain STU3). We worked with you on MHD which was fruitful until (again) attention shifted to R4. Being a 'good local FHIR citizen' involves work with the international community. The less localization is needed, the better.</p>",
        "id": 163593756,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1555529447
    },
    {
        "content": "<p>Boy, it's been almost two months since this thread brewed up a storm, and now here we are, headed to Seattle.</p>\n<p>Given the seven-part blog series I've done (#8 tomorrow) leading into Seattle, and leading directly into patient needs for data access, is it time to stir this stewpot again, and see what all the chunks look like today?  </p>\n<p>For those who haven't seen, I'll come back in a moment with a link to the blog thread (in the \"Origin Story / blog posts\" stream).</p>",
        "id": 167631408,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1559964396
    },
    {
        "content": "<p>Here's the thread ... I'm not facile enough with Zulip to link to the lower post that has the whole set of blog URLs<br>\n<a href=\"#narrow/stream/179262-patient-empowerment/topic/e-Patient.20Dave's.20.22origin.20story.22.20-.20why.20patients.20need.20data\" title=\"#narrow/stream/179262-patient-empowerment/topic/e-Patient.20Dave's.20.22origin.20story.22.20-.20why.20patients.20need.20data\">https://chat.fhir.org/#narrow/stream/179262-patient-empowerment/topic/e-Patient.20Dave's.20.22origin.20story.22.20-.20why.20patients.20need.20data</a></p>",
        "id": 167631537,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1559964648
    }
]