[
    {
        "content": "<p>There has been discussion that there is a need in our Implementation Guides for a \"Impact on the Patient\" section. Here is a first draft by <span class=\"user-mention\" data-user-id=\"191990\">@Emma Jones</span> on the \"impact on the patient\" perspective guidance to be potentially inserted into the CarePlan Implementation Guide.</p>",
        "id": 169601723,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562187510
    },
    {
        "content": "<p>The patient is the central aspect of the IHE DCP Care Planning profile. The DCP FHIR implementation guide constrains the patient element as required (1..1) in the care plan structure definition.<br>\nThe DCP IG is meant to be for the patient’s use by providing the structures and transactions patients can use for participating in and for  planning their care. It can also be used for creating, updating and sharing their Care Plans.<br>\nDCP IG provides the ability to target appropriate services and to coordinate care over time, across multiple clinicians and sites of service, with the engagement of the patient (i.e., longitudinal coordination of care). This is essential to alleviating fragmented, duplicative and costly (direct and indirect) care.<br>\nWith the recent integration of the DCP IG with care team management, DCP enables the patient to coordinate, direct and participate in the provision of care as an integral care team member, including role as care team lead when needed.</p>",
        "id": 169601727,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562187513
    },
    {
        "content": "<p>additional comment by Dr Stephen Chu</p>",
        "id": 169601771,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562187581
    },
    {
        "content": "<p>I will add that Patient Care WG (and Learning Health System) is about enabling patient-centred care which has the following characteristics:<br>\n- planning, delivering, and evaluating health care that is grounded in mutually beneficial partnerships among health care providers, patients, families and communities\" (adapted from the Institute for Patient and family centered care)</p>\n<p>Central to this is:<br>\n- Patient as a unique person<br>\n    * characteristics<br>\n    * wishes<br>\n    * beliefs, values, wishes, preferences<br>\n- Care relationships characterised by</p>\n<p>* power and equality balance<br>\n   * partnership in decision and care processes</p>\n<p>The Care Plan, Care Team standards and dynamic care planning processes and their associated IGs are designed to facilitate Patient Centered Care.</p>",
        "id": 169601773,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562187583
    },
    {
        "content": "<p>I feel as though both still contain too much insider jargon</p>",
        "id": 171813655,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564178715
    },
    {
        "content": "<p>I couldn't agree more.</p>",
        "id": 171990168,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1564440092
    }
]