[
    {
        "content": "<p>On this week's Monday 3pm call on Patient Corrections IG team call, we kept coming up with real world anecdotes of errors that need to be corrected. We need a place to capture them, and for the moment, this is it.  <strong>You're welcome to add yours</strong> - stories where errors were found (or not), with clinical significance, and what happened (as consequence or patient action or whatever).</p>\n<p>I know some of these have been captured elsewhere, e.g.. <a href=\"https://www.unblock.health/patient-impact-stories/\">Unblock Health</a>, but I don't know of any collection.</p>\n<p>One possible outcome of this exercise will be to storyboard (in the IG, or perhaps just as \"appendix\" anecdotes) the flow of events and data in processing a correction request.</p>\n<p>I'll start with one from this call, in the next message.</p>",
        "id": 207890632,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1598299664
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span>  discovered (via MyChart) that her mother's hospital in a distant city had a completely obsolete list of conditions and meds, and was already giving her dangerously wrong meds. She sent a correction request in MyChart.</p>",
        "id": 207890696,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1598299692
    },
    {
        "content": "<p>Yes, <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  I was surprised to see that after I confirmed what medications my mom was really taking BEFORE her surgery, they pulled old data from a hospital in another state and started giving her old medications while she was in the hospital that were discontinued in the past because of adverse side effects. I had to talk to three different people at the hospital and send a message via MyChart to plead with them to take her off the old medications. It took several days, but it finally was accomplished. I really don't know if it was the MyChart message or the pleading with the people on the phone that made it happen. We really need to push forward a better workflow (via FHIR) to allow patients and caregivers to send correction requests and get feedback from health orgs in a timely manner. This is a matter of patient safety. Patient corrections is a main project we are working on in the Patient Empowerment Workgroup.  We would love to work with clinicians, health orgs, and EHR vendors to make sure we are aware of all needs as we build this IG.</p>",
        "id": 208091886,
        "sender_full_name": "Debi Willis",
        "timestamp": 1598449237
    },
    {
        "content": "<p>Jeepers! This really ought to be a blog post. Or an essay in a journal like JAMIA. I'm at the eye doctor right now - remind me!</p>",
        "id": 208137496,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1598470472
    }
]