[
    {
        "content": "<p>Alow me to pick some ideas : <br>\nWhen I was working on apps, there were a few steps in our process where we had to look at the impact of our product, think \"what could go wrong here\" and it was impressive to see how some of the product decisions - or gaps - can have a serious impact, even if we were careful.<br>\nSome examples:</p>",
        "id": 190433570,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584041240
    },
    {
        "content": "<ol>\n<li>A few years ago, some pharmacists saw that when the CPOE sent codes that the pharmacy did not understand (because of master data not being in sync), there was simply no warning - if a patient had 3 medications and only 1 of them was accepted, nobody was notified, and the patient just got 1 medication... <br>\nThe interoperability specifications usually do not cover \"what systems should do in case of errors\" but in this case this was a potentially serious thing. <br>\nPerhaps nobody's at fault, but not good.</li>\n</ol>",
        "id": 190433814,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584041369
    },
    {
        "content": "<ol start=\"2\">\n<li>I asked the owners of a medication record how far back the central repository kept patients' medications, they said \"we keep the history over last 6 months\". I found that strange, asked why and they said \"because the one doctor that advised us on this matter said that in his opinion this was sufficient for most cases\". This is a concerning thing - the tech guys even asked for clinical input and they did the right thing, but they did not do all the right things...</li>\n</ol>",
        "id": 190434089,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584041504
    },
    {
        "content": "<p>It's not hard to imagine in both cases some unacceptable risk scenarios.</p>",
        "id": 190434182,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584041536
    },
    {
        "content": "<p>How do we bring this impact to our work?</p>",
        "id": 190434298,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584041608
    },
    {
        "content": "<p>The steps I was happy to follow were Design Validation and Risk Analysis, not sure if anyone has recommendations in terms of methodology or any ideas.</p>",
        "id": 190434450,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584041666
    },
    {
        "content": "<p>I'm disappointed to see no discussion of this!  <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> PM'd me about it and I suggested this open discussion. These are real issues - what do y'all think?</p>\n<p>Should  I say \"Don't make me drag this over to <a class=\"stream\" data-stream-id=\"179160\" href=\"/#narrow/stream/179160-social\">#social</a> \"? :-)   (Or, even more fun, <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a> )</p>",
        "id": 190541297,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584125451
    },
    {
        "content": "<p>Participating in NCPDP would be the path to solving 1</p>",
        "id": 190541448,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1584125531
    },
    {
        "content": "<p>Getting hired at the company at fault and helping them iterate their product would be a path for number 2. Some companies just make bad products?</p>",
        "id": 190541512,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1584125587
    },
    {
        "content": "<p>I don't see what this discussion is driving at, to be honest. Extrapolating out, it definitely feels like this \"how do we help all products execute perfectly\" discussion could be a  \"boiling the ocean\" situation quickly. Can we refine the problem statement here?</p>",
        "id": 190542006,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1584125896
    },
    {
        "content": "<p>I don't mean that \"others are doing worse\" or \"those guys are doing good\" - quite the opposite, my worry is \"how many decisions have I made that will negatively affect patient outcome\"?</p>",
        "id": 190543866,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584127046
    },
    {
        "content": "<p>I don't see how NCPDP would help solve 1.</p>",
        "id": 190543889,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584127064
    },
    {
        "content": "<p>For example, I'm not aware of a formal risk assessment in any SDO.</p>",
        "id": 190543981,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584127108
    },
    {
        "content": "<p>and that is the point - what mechanisms would we have in place that allow us to make better, safer standards?</p>",
        "id": 190544035,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584127143
    },
    {
        "content": "<p>I'll note that the full subject line got truncated - I suspect it was \"the role of pt empowerment,\" and I'm not sure what that has to do with the 1-2-3.  <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>?</p>",
        "id": 190544249,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584127261
    },
    {
        "content": "<p>Also I don't understand why \"getting hired at the company at fault would be a path\" - who getting hired? me? I'd probably make a different set of wrong decisions</p>",
        "id": 190544257,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584127266
    },
    {
        "content": "<p>Standards are products of consensus. The hope and idea is that bringing together diverse viewpoints and backgrounds leads to safe, secure standards. We can process-ize this in an HL7 / FHIR context. I don't think we can fully control how every vendor implements.</p>",
        "id": 190544305,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1584127295
    },
    {
        "content": "<p>You're assuming that \"consensus\" means \"safe\"?</p>",
        "id": 190544426,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584127342
    },
    {
        "content": "<p>how safe?</p>",
        "id": 190544436,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584127348
    },
    {
        "content": "<p>The decisions I mentioned were also consensual. And they were flawed. I don't think consensus makes us immune to issues</p>",
        "id": 190544469,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584127370
    },
    {
        "content": "<p>I think the Patient empowerment group should keep us all in check. I don't know how this would be done - advocating for risk assessment and design validation? Any other methods?</p>",
        "id": 190544521,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584127399
    },
    {
        "content": "<p>They were bad product decisions by external vendors.</p>",
        "id": 190544835,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1584127591
    },
    {
        "content": "<p>Are you asking for regulation to enforce safety features?</p>",
        "id": 190544918,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1584127631
    },
    {
        "content": "<p>so we don't have that issue (bad decisions)? Our standards are risk-free?</p>",
        "id": 190544926,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584127635
    },
    {
        "content": "<p>(sorry for provoking, but I know there are only 2 ways of having no errors in software - not developing or not testing)</p>",
        "id": 190545046,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584127708
    },
    {
        "content": "<p>not \"regulation\", we have enough of those.</p>",
        "id": 190545167,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584127784
    },
    {
        "content": "<p>that is my question - how do we find those hidden opportunities to improve (that we surely have)?</p>",
        "id": 190545248,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584127816
    },
    {
        "content": "<p>I think the key in lowering risks is to make sure all parties that touch a product/workflow are involved early in the process. Each party will have a unique perspective and help guide the path around potholes in the road. Bad decisions are often made because either the story was not presented in a way to help listeners understand the problem and suggest solutions/point out barriers and dangers... or the proper parties were not asked for their insight. (this does not cover bad coding or testing...just bad design of a solution) I am really pleased that HL7 understands the value of the patient perspective. I think this will help limit risks of going down a path that ultimately does not meet the need of patients. The Patient Empowerment Workgroup is just getting started and learning the best way to help this community. Please feel free any time to join a meeting or shoot us an email on ways we can help.</p>",
        "id": 190552287,
        "sender_full_name": "Debi Willis",
        "timestamp": 1584132006
    },
    {
        "content": "<blockquote>\n<p>make sure all parties that touch a product/workflow are involved early in the process</p>\n</blockquote>\n<p>A year after my cancer (i.e. more than a decade ago), my then-employer gave its first sign of impending doom. The engineers had a great idea for a new product, and saw no need to engage with the end users, because as they proudly said, they thoroughly understood the requirements.  It was a web-based calendar thingie.  They were ready to go out for external test when the new CEO declared we'd have an all-hands evening of testing, free pizza and all that. </p>\n<p>But the evening ended 15 minutes in, before pizza was ordered, when I tried to zoom in to see detail.  The layout fell apart.  (I'm not making this up.) The #2 developer said \"Oh ... we didn't design for zoom.\"</p>\n<p>Not making this up. </p>\n<p>The point isn't precisely HOW silly these trained-in-the-1990s developers were (though that's a tale of its own) - I just couldn't resist my favorite story of what happens when ANYone thinks they know what people will do with a tool. :-)</p>",
        "id": 190552996,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1584132514
    },
    {
        "content": "<p>I take the challenge to join the calls (i have missed them lately), and I think patient advocates will raise awareness. <br>\nYes, I think early involvement is good - my challenge is how can we do it in a lean and agile way.</p>",
        "id": 190554567,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584133449
    },
    {
        "content": "<p>in my experience, some \"bad\" decisions are not even bad decisions. They are just implementation details that end up having unintended effects.</p>",
        "id": 190554665,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584133507
    },
    {
        "content": "<p>even when requirements are clear, implementation can go wrong.<br>\n(I am just thinking of the infamous Xerox bug)</p>",
        "id": 190554936,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584133665
    }
]