[
    {
        "content": "<p>today Dave DeBronkart and I visited the HL7 board. After a brief discussion with Dave, the board moved to ask the TSC to investigate setting up a Patient Advocacy group within HL7, and to ask HQ to create a communication strategy around it.</p>",
        "id": 175967413,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568776488
    },
    {
        "content": "<p>This is encouraging news - well done <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span></p>",
        "id": 175967415,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568776500
    },
    {
        "content": "<p>Thanks to both of you for getting this moving!</p>",
        "id": 175973187,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1568786440
    },
    {
        "content": "<p>LOL well done ME?? I'm grateful for the preparation of the moment you all did, and grateful for the board's ability to hear this unorthodox proposal <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 175990708,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568802508
    },
    {
        "content": "<p>I just wanted to note my interest in this stream and activity. Thanks to Virginia and Lloyd for connecting me in.  I advocate the use of data standards (mostly terminology) in various research networks (PCORI, diabetes trial net, sickle Cell, others) and have experience with patient advocacy groups from the NIH Rare Diseases Network. I have some ideas on how to bring them into discussions and leverage them to advance the use of clinical data for research.  Slightly different perspective than what you have proposed in your docs but very complementary!  I look forward to talking more.</p>",
        "id": 176000886,
        "sender_full_name": "Rachel Richesson",
        "timestamp": 1568810794
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"240723\">@Rachel Richesson</span> Are you currently a registered HL7 member?  (If so we can add your name to the formal request to start our new work group.)</p>",
        "id": 176001041,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568810896
    },
    {
        "content": "<p>Great news!</p>",
        "id": 176003575,
        "sender_full_name": "Debi Willis",
        "timestamp": 1568812570
    },
    {
        "content": "<p>I am with Duke University  (a benefactor) so I think I am a member by association.  I get ballot emails, etc.</p>",
        "id": 176004312,
        "sender_full_name": "Rachel Richesson",
        "timestamp": 1568813098
    },
    {
        "content": "<p>Awesome.  Do you mind if I add you as an endorser on the proposal?  (You can PM me the email and phone number you'd like listed)</p>",
        "id": 176007207,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568815080
    },
    {
        "content": "<p>Congratulations!  Mozel tov!  Looking forward to participating as this develops.</p>",
        "id": 176018659,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1568822398
    }
]