[
    {
        "content": "<p>Hey FHIR architects - what is a good way to represent that data has been amended using FHIR?</p>",
        "id": 210581804,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600468203
    },
    {
        "content": "<p>Provenance?</p>",
        "id": 210581872,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600468248
    },
    {
        "content": "<p>Like this. My understanding is -  A patient requests that their smoking status is corrected - I DON\"T SMOKE!  The clinician is not able to update the smoking status directly but instead amends the field with a corrected note.</p>",
        "id": 210583331,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600469719
    },
    {
        "content": "<p>Have you ever seen a system that had the ability to capture correction notes on a per-field basis?  (Or even a per record basis?)</p>",
        "id": 210584080,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600470334
    },
    {
        "content": "<p>Perhaps - I am trying to figure that out.</p>",
        "id": 210584714,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600470886
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 210589892,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1600477376
    },
    {
        "content": "<p>Provenance is the right solution. Given that the old and new version of the target resource exist (provided versioning FHIR), one can always see the DIFF. Thus the Provenance covers the DIFF made between old and new.<br>\nThe Provenance would point at the old, and new as normal; but would also have an .entity that points at the patient request to change.  Thus it is clear WHY.<br>\nI might argue that it is even appropriate to record a Provenance for a requested change that resulted in no change.</p>",
        "id": 210620309,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600528933
    },
    {
        "content": "<p>Thanks guys for advice on provenance.</p>",
        "id": 210641241,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600560052
    },
    {
        "content": "<p>The requested change would be a Task.  If there was a Provenance it would be on the status change of the Task.</p>",
        "id": 210646430,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600570944
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>   I have checked with medical records departments of two hospitals and I know certain data fields do not have the same formal process for correction.  For example - demographics changes do not require the same formal process.  I checked my patient portal to see what it would allow me to update (and then it auto-flows back to EHR) - I could update all demographics, emergency contact information, and insurance.  I have a feeling I might be able to update my own med list as well but lets ignore that for now.  Clinical correction requests fall into the formal process.</p>",
        "id": 210965243,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600844584
    },
    {
        "content": "<p>Another question.  There is a formal paper process in which a patient requests a change to a clinical part of their record.  The provider sends correspondence saying request received and status.  Clearly the response to the request will not be synchronous.  And the actual change is not the indicator the change happened - a formal communication saying the change occurred.  Lets say I use Task.  Do I do an API PUT Task to the EHR?</p>",
        "id": 210967503,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600846470
    },
    {
        "content": "<p>First step would be a POST of the Task to the EHR (to create it).   Then the patient app would either poll the Task (query on a semi-regular basis) to see  if it had changed or subscribe to the Task to receive a notification of when it had changed.  (Because patient apps wouldn't likely have reliability availability or location, polling would presumably be most common.)  The EHR would update the Task to change status &amp; business status.</p>",
        "id": 210997921,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600866058
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> if you want to see a visual representation of how to handle exchanges using Task between initiator and recipient, you can look at this part of <a href=\"http://hl7.org/fhir/us/dme-orders/2020Sep/restful_fhir_exchanges.html\">a current ballot</a></p>",
        "id": 211017037,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1600873830
    },
    {
        "content": "<p>And those formal processes differ by state.  Not drastically, but to some degree.</p>",
        "id": 211033204,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1600880990
    },
    {
        "content": "<p>Abigail - yes I stumbled across NY state's ones and they are detailed.  Can't wait to show <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span></p>",
        "id": 211035782,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600882164
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> Thank You!  If you are free come to our meeting at 2 today.  We are getting geeky.</p>",
        "id": 211035846,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600882199
    },
    {
        "content": "<p>Oh great Lloyd that is what I thought!  Got my POST and PUT mixed up - smacking myself.  Ouch.</p>",
        "id": 211036044,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600882286
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I know you are busy but would love to have you at any of our patient corrections time slots.  Today at 2 and for 45 minutes tomorrow in 10-11:30 timeslot.  Also 2PM tomorrow. <span class=\"user-mention\" data-user-id=\"191859\">@Amit Popat</span> <span class=\"user-mention\" data-user-id=\"192825\">@Jeffrey Danford</span> <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> Having a FHIR architect type around would be good.  We will still bring FHIR-I questions to you at 4ET tomorrow.</p>",
        "id": 211036325,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600882410
    },
    {
        "content": "<p>Today, I <em>might</em> be able to make 3-3:30.  I can come tomorrow at at 10.  Can't do 2pm tomorrow</p>",
        "id": 211037679,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600883048
    },
    {
        "content": "<p>10AM works!</p>",
        "id": 211074588,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600903977
    },
    {
        "content": "<p>So Task.intent does not include event.  I thought you said we used Task for the event as well?</p>",
        "id": 211083736,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600914175
    },
    {
        "content": "<p>A Task links both worlds.  You can't <em>have</em> an 'event' Task.  A Task is always a request - but it captures information about the event.  So Task.intent captures the nature of the request.</p>",
        "id": 211084044,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600914573
    },
    {
        "content": "<p>Wait that makes sense - its always about the request whether the requestor or the owner is talking about it.  The actual correcting is outside of this.</p>",
        "id": 211088943,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600921130
    },
    {
        "content": "<p>I just want to capture a signal moment on this subject from 2009.  <br>\n<a href=\"https://participatorymedicine.org/epatients/2009/04/the-parable-of-the-wicked-emr-guest-post-by-david-kibbe.html\">The Parable of the Wicked EMR</a></p>\n<p>After my Google Health / billing codes fiasco, HIT consultant David Kibbe drew a parallel with \"the wicked Bible,\" a story from the early days of printing, in which every print shop did its own typesetting. In one edition, the printer omitted the word \"not\" from the 7th commandment, so that it read \"Thou shalt commit adultery,\" and printed many copies.</p>\n<p>Needless to say, the bishop was not pleased.  The lesson is that once an error exists, it's all too easy for it to propagate. And the existence of a single source of truth does not guarantee that all copies derived from it will be accurate.</p>",
        "id": 211192386,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600983065
    },
    {
        "content": "<p>hey Lloyd where were you last night?  We went to FHIR I and they said use Communication and Composition with Tasks inside .</p>",
        "id": 211220974,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1601013222
    },
    {
        "content": "<p>Who did??</p>",
        "id": 211221169,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601013495
    },
    {
        "content": "<p>Composition makes no sense at all, and Communication is also inappropriate based on current best practices.</p>",
        "id": 211221182,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601013545
    },
    {
        "content": "<p>Game on! Where and how do we work this out?</p>",
        "id": 211259165,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601041534
    },
    {
        "content": "<p>First I need to understand who made the recommendation so I can understand where they were coming from.</p>",
        "id": 211259558,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601041697
    },
    {
        "content": "<p>Let's send it to the replay booth:)</p>",
        "id": 211271447,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601046970
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Debi get a great presentation of the use case.  You, Vassil, and Amit missed it.  I think we should do it again on one of our regular calls you guys can attend and you can tell others.  I think it will help give perspective and Debi can answer questions.  The people who suggested various things knew those things especially well as it were.  Example Rick said composition.  In all fairness the workflow guys (you, Vassil) said Task.  Others said do just Puts and posts of the resources and have business rules on server side behind the puts and posts.  And I am not sure who mentioned Communication.</p>",
        "id": 211332045,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1601080161
    },
    {
        "content": "<p>(Virginia meant Debi <em>did</em> a great presentation.)</p>\n<p>Why can we not start by getting the recording and finding the time-code for that spot?</p>",
        "id": 211357204,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1601122191
    },
    {
        "content": "<p>Do we know when the recordings will be available?</p>",
        "id": 211676529,
        "sender_full_name": "Debi Willis",
        "timestamp": 1601409784
    },
    {
        "content": "<p>Debi see your email</p>",
        "id": 212194713,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1601767384
    },
    {
        "content": "<p>Found this nice call to action on Morgan's blog: <a href=\"https://morgangleason.com/2018/02/17/medical-record-errors/\">https://morgangleason.com/2018/02/17/medical-record-errors/</a></p>",
        "id": 212194862,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1601767566
    },
    {
        "content": "<p>There would also be provenance perhaps reflected in the actual data updated but not sure because it would have been updated by clinician as amendment.  Perhaps for demographics.</p>",
        "id": 212453250,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1602002045
    },
    {
        "content": "<p>There would be an instance of Provenance for each update to the targeted data. Thus in the history on an updated resource would be many Provenance, one of which would be indicating the details of the patient request.</p>",
        "id": 212455104,
        "sender_full_name": "John Moehrke",
        "timestamp": 1602003109
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191531\">Virginia Lorenzi</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/212194862\">said</a>:</p>\n<blockquote>\n<p>Found this nice call to action on Morgan's blog: <a href=\"https://morgangleason.com/2018/02/17/medical-record-errors/\">https://morgangleason.com/2018/02/17/medical-record-errors/</a></p>\n</blockquote>\n<p>Read this!!   She was 19 when she wrote this!!</p>\n<blockquote>\n<p>Other issues, however, are more significant. </p>\n<p>Several years ago, a doctor accidentally marked Diabetes on an MRI order form, and somehow that added the problem to my health condition list. When that specialist sent the notes to my primary doctor and my rheumatologist, then they added Diabetes to my health conditions and suddenly people were asking me what my glucose levels were. They seemed very concerned when I told them I had no idea!</p>\n</blockquote>\n<p>We need to create a way to solve this!  </p>\n<p>One factor is that evidently when clinicians see a new problem on the problem list, THEY ASSUME IT'S CORRECT without evaluating it.  Is that a valid practice??   </p>\n<p>Would the erring provider feel embarrassed to know they had totally caused an important mistake in the patient's chart that could cause harm??</p>\n<p>And this, in that post, </p>\n<blockquote>\n<p>The office staff said that “the patient must have told us that if it is in the record.”</p>\n</blockquote>\n<p>This is grotesque: \"If it's in the chart it must be true,\" mixed with \"If it's wrong in the chart, it's the patient's fault.\"   No HL7 standard can fix that - it's not my point - but it sure does affect the challenges of getting people interested in implementing whatever we do.</p>",
        "id": 212486449,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1602018718
    },
    {
        "content": "<p>It's always instructive to learn more details about <em>how</em> this problem came to be incorporated from an MRI order form into a problem list.</p>\n<p>But managing problem lists is hard, often based on sketchy data, often for patients much less knowledgeable and engaged that Morgan -- and it's often a cross-organizational challenge where nobody is really responsible for the holistic result. <a href=\"https://library.ahima.org/doc?oid=104997#.X3zfCXWYVhE\">https://library.ahima.org/doc?oid=104997#.X3zfCXWYVhE</a> has some nice context -- e.g., \"most organizations struggle to define content, responsibilities, and accountability for maintaining an accurate, updated problem list.\").</p>\n<p>(Add to this the fact that we have incentive systems that often pay more for higher-complexity cases, determined in part by problems documented in a problem list, so there's not always super-clear motivation to proactively clean things up.)</p>\n<p>So my guess would be: yes, a clinician would probably be embarrassed to know they had done this, but at the same time, the problems are more <em>systemic</em>, and the erring clinician is only one piece of the story.</p>",
        "id": 212487230,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602019124
    },
    {
        "content": "<p>(To be clear, I'm in no way defending the system. What a total mess of a story, and the \"office staff\" quote, which came through on Zulip after I'd already drafted my initial response, is entirely inappropriate.)</p>",
        "id": 212487472,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602019261
    },
    {
        "content": "<p>Do we need to start a \"Stupidest Medical Data Error\" award, naming the offending providers?  \"The Meddies,\" \"The Derries\", \"The Derrierrors\"?</p>\n<hr>\n<p>\"And the 2021 Mederrieres go to:   (These are totally fictional - just insert your provider's name)</p>\n<ul>\n<li>The Mederriere for Biologically Impossible Condition goes to Cleveland Clinic, for asserting that Dave deBronkart is experiencing menopause</li>\n<li>The Mederriere for False Sense of Perfection goes to UCSF Radiology, for asserting ...</li>\n<li>The Mederriere for ...</li>\n</ul>",
        "id": 212487496,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1602019272
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/212487230\">said</a>:</p>\n<blockquote>\n<p>it's often a cross-organizational challenge where nobody is really responsible for the holistic result. <a href=\"https://library.ahima.org/doc?oid=104997#.X3zfCXWYVhE\">https://library.ahima.org/doc?oid=104997#.X3zfCXWYVhE</a> has some nice context -- e.g., \"most organizations struggle to define content, responsibilities, and accountability for maintaining an accurate, updated problem list.\").</p>\n</blockquote>\n<p>Does the PE WG need to start advocating about the scope and complexity of the issue, to raise awareness?</p>\n<p>Sometimes it's a granularity problem.  My problem list includes MIGRAINES, a condition I do not have, in the usual sense.  I get <a href=\"http://www.leeeyecenter.com/ocular-migraine.htm\">*ocular* migraines</a>, which are a whole different thing - but \"MIGRAINES\" almost got me excluded from the drug that saved my life.</p>\n<p>Would cleaning up problem lists be a worthy use case for a first implementation of a corrections IG?</p>",
        "id": 212488606,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1602019907
    },
    {
        "content": "<p>Seriously - it would take years (because articles always do) but should we start a project to get an article published in a journal? What journal? JAMIA? Other?</p>",
        "id": 212488769,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1602020001
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> <span class=\"user-mention\" data-user-id=\"270306\">@Maria D Moen</span> <span class=\"user-mention\" data-user-id=\"251396\">@John Keyes</span> I'm tagging y'all on this thread, as people working on the project ... perhaps we should, separate from the IG and in parallel, create a white paper on the subject.  It's something I'd be willing to work on.</p>",
        "id": 212488961,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1602020126
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/212487230\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://library.ahima.org/doc?oid=104997#.X3zfCXWYVhE\">https://library.ahima.org/doc?oid=104997#.X3zfCXWYVhE</a> has some nice context -- e.g., \"most organizations struggle to define content, responsibilities, and accountability for maintaining an accurate, updated problem list.\").</p>\n</blockquote>\n<p>Does this pretty much say most organizations struggle to be competent at managing provenance?</p>",
        "id": 212489215,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1602020265
    },
    {
        "content": "<p>I think a perspective piece in JAMIA would be an excellent place to start</p>",
        "id": 212489234,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602020281
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/212487472\">said</a>:</p>\n<blockquote>\n<p>(To be clear, I'm in no way defending the system. What a total mess of a story, and the \"office staff\" quote, which came through on Zulip after I'd already drafted my initial response, is entirely inappropriate.)</p>\n</blockquote>\n<p>But very, very common.</p>\n<p>I keep telling this story - it PISSES ME OFF but it's true. </p>\n<ul>\n<li>My mom's eye doctor retires. She's referred to a new one. This is 2019 so interop doesn't exist.</li>\n<li>New eye doc's staff does the usual stupid \"tell me your whole history\" intake interview including med list</li>\n<li>Mom mentions a med that's <em>usually</em> prescribed for Type 2 diabetes, but not so in her case. </li>\n<li>Stupid clerk adds T2D to problem list without asking.</li>\n<li>An hour later, discussing her conditions, doc says \"So I'm going to schedule you for surgery.\"</li>\n</ul>\n<p>My mom, being my mom, asks why. He says \"Ordinarily we'd use Drug X, but we can't because you have diabetes.\"</p>\n<p>AND he said \"Well you must have told her that, or it wouldn't be in the chart.\"</p>\n<p>This is a real problem, folks.  We out here have many such stories. </p>\n<p>So please let's find a way to EXPRESS a needed correction, in a way that's feasible to implement - let's not come up with six years of study and 14 years of analysis.</p>",
        "id": 212489848,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1602020618
    },
    {
        "content": "<p>Mapping Task resource for Patient Correction Workflow and have some questions:<br>\nWhat's the difference between Task.for and Task.restrictions.recipient?<br>\nIf a request is denied, that would show in Task.status.  However, how do we provide an explanation for the denial?<br>\nCan you do conditional cardinality?  (considering this because on fulfiller side, owner should be supported but requester might not know it)<br>\nWhere in Task do you specify the Encounter this correction is in reference to?  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  said its not Task.encounter.</p>",
        "id": 215416279,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1604384420
    },
    {
        "content": "<blockquote>\n<p>What's the difference between Task.for and Task.restrictions.recipient?</p>\n</blockquote>\n<p>Task.for can be for a group, and in that case you may need Task.restrictions.recipient to specify one particular member of the group. For patient corrections, I don't think you need anything in Task.restrictions</p>\n<blockquote>\n<p>If a request is denied, that would show in Task.status. However, how do we provide an explanation for the denial?</p>\n</blockquote>\n<p>Task.statusReason can contain an explanation for the denial</p>\n<blockquote>\n<p>Can you do conditional cardinality? (considering this because on fulfiller side, owner should be supported but requester might not know it)</p>\n</blockquote>\n<p>The initial owner is the healthcare organization. It can then be updated to become more specific, but you probably don't need conditional cardinality.</p>\n<blockquote>\n<p>Where in Task do you specify the Encounter this correction is in reference to? @Lloyd McKenzie said its not Task.encounter.</p>\n</blockquote>\n<p>This is likely one of the Task.inputs - task.input.type is a code indicating \"relevant encounter\" and task.input.valueReference is a reference to the Ecnounter (or encounter identifier).</p>",
        "id": 215462454,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1604414839
    },
    {
        "content": "<p>Task.for is the 'record' the Task is associated with.  Task.restrictions.recipient has different meaning depending on the type of Task.  If the Task is \"please fulfill\", then it would be as Vassil said.  If it said \"please share with\", then that would indicate who to communicate the information to.</p>\n<p>If the owner is not known when the Task is created (e.g. posting somewhere for central dispatch), then you'd mark it 'mustSupport' but optional.  In your case, the original owner should be known - though it may change as the Task gets punted around within an organization as they try to figure out who should actually ask on it.</p>\n<p>Agree with Task.input to indicate relevant encounter or other filters</p>",
        "id": 215479965,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604422141
    },
    {
        "content": "<p>A design  best practice question.  If there's a field in Task that we think is irrelevant and its cardinality is 0..something should we set it to 0..0 or leave it be?</p>",
        "id": 215547306,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1604473581
    },
    {
        "content": "<p>If we have a bunch of values in Task.input, how is the receiver going to know what to do with them?  I guess we would need to define codes?   For example, lets say I send text with a description of the desired correction, a picture of the error on the patient portal and an encounter reference of the encounter in which the error occurred.  How will the receiver know how to process that?  <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> had also suggested we send other resources to give context, like send the Condition resource if the condition was in error...</p>\n<p>What about Task.focus?  Could Encounter go there?  Or another resource?</p>",
        "id": 215547918,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1604474337
    },
    {
        "content": "<p>Leave the irrelevant fields be - system might be generating or using them for their own purposes and you do not want to make those resources invalid</p>",
        "id": 215595946,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1604503553
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>  - any chance you guys want to participate in our corrections track in January?</p>",
        "id": 215747188,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1604597781
    },
    {
        "content": "<p>We are interested, I am not sure we have the time - we'll try</p>",
        "id": 215754801,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1604601063
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 215975494,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1604786337
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  How do we fill out the FHIR IG Proposal item: FHIR Core version(s)?<br>\nR4?  R5?  Both?</p>",
        "id": 216263304,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605037177
    },
    {
        "content": "<p>Presume we'd be targeting R4.  R5 won't be available until spring 2022</p>",
        "id": 216263986,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605037484
    },
    {
        "content": "<p>Great - thanks.  Then we publish a new version if we want R5 when its time I guess.</p>",
        "id": 216264232,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605037618
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>    We are balloting first time in Spring (hopefully), I assume again in Fall, earliest we would have guide is end of 2021. Considering that, R4 makes sense, right?</p>",
        "id": 216264455,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605037763
    },
    {
        "content": "<p>Ideally you'd only ballot in the spring.  Our usual target for FHIR IGs is one ballot and done (because the content is tested and pretty solid before it's balloted) and because some degree of substantive change between ballot and publication is acceptable).  Certainly the first release timeframe would only let you build against R4.  Also, R4 is all you'll see in production for the next 3 or so years.</p>",
        "id": 216271567,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605041026
    },
    {
        "content": "<p>Interesting.  I was not aware of that.  Thanks.</p>",
        "id": 216272475,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605041469
    },
    {
        "content": "<p>How do we implement partial accept and partial reject?  Imagine the med rec dept gets a request for a correction from a patient - it is pros and refers to two errors.  The med rec department, after working with clinicians determines that the first request is valid and accepts it, but that the second is not and rejects it.   WOuld the request fulfiller system then spawn one or two subtasks with task.partof pointing to the master task and with one having status of accept and the other having status of reject?  Or is there another way you would recommend?  I do not think we have a failsafe way to ensure that the requester provides discrete atom level items for correction for each request so I think this problem will happen.  <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 216273905,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605042166
    },
    {
        "content": "<p>Ideally, they're handled as two different requests - as each may be independently routed and independently resolved.  The other option is that the receiving systems spawns subtasks for each issue and managers and resolves them each.  The overall Task gets marked as 'completed' when all of the child tasks are dealt with.</p>",
        "id": 216274747,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605042545
    },
    {
        "content": "<p>Just text 'we did this but not that'</p>",
        "id": 216278254,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1605044255
    },
    {
        "content": "<p>The problem with \"we did this but that\" is as follows:  HIM can agree to do the correction, but it doesn't mean they've done it yet.  If HIM (medical records) rejects a particular part, there is a disagreement process the patient could then initiate.  </p>\n<p>However, I do think there is merit in a way to do this inform low code as you suggest <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> and maybe that is the best approach for now. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> <span class=\"user-mention\" data-user-id=\"192825\">@Jeffrey Danford</span></p>",
        "id": 216908978,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605550032
    },
    {
        "content": "<p>Should we use Task.description as a place for patients to express the correction they want in free text? <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>  Also, should the patient's request  task be separate from the fulfiller's fulfillment consideration task.  Like the fulfiller spawns a  task for its work and incudes a basedon relationship to the requestor task?  Like the concept of lab order from doctor perspective (placer) and lab perspective (filler)?  I see that the mechanism for that is there.</p>",
        "id": 216909612,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605550322
    },
    {
        "content": "<p>Reminder that we have a call on Mondays at 3PM Eastern <a href=\"https://global.gotomeeting.com/join/322275573\">https://global.gotomeeting.com/join/322275573</a></p>",
        "id": 216910068,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605550523
    },
    {
        "content": "<p>Yes, though I'd also include a 0..* Task.input that points to the specific data that's wrong - either as a FHIR reference or as a URL</p>",
        "id": 216911934,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605551347
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Yes to the description?  I asked you too many questions and I'm confused</p>",
        "id": 216914698,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605552591
    },
    {
        "content": "<p>Yes to Task.description.  There's generally only one Task - it is shared by placer and filler and both can edit it.  (It's one of the few FHIR resources where that's typically the case)</p>",
        "id": 216938289,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605563883
    },
    {
        "content": "<p>If the Task points to a Request, the filler might well clone the Request to create a 'filler' version that reflects their specific intention.</p>",
        "id": 216938369,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605563915
    },
    {
        "content": "<p>However, I don't think that would be relevant in the \"patient correction\" situation as there wouldn't be anything other than the Task</p>",
        "id": 216938431,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605563955
    },
    {
        "content": "<p>Note that the filler could spawn 'child' Tasks that tackle different parts of the request.</p>",
        "id": 216938462,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605563977
    },
    {
        "content": "<p>OK <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , so then when the Requester does polling of the Fulfiller, in the representation of Task sent back to the Requester, would the intent be set to Filler-Order or stay as Proposal?  Personally I am not sure it matters much</p>",
        "id": 217037109,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605635122
    },
    {
        "content": "<p>The Task would generally have an intent of 'order' and wouldn't distinguish placer vs. filler as it's used by both.  Once 'intent' is set, it's generally not changed.</p>",
        "id": 217046179,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605639232
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192825\">@Jeffrey Danford</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>  <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span>   When we began our thinking on how to communicate requests for corrections with providers, Jeff had suggested we use CommunicationRequest.  Looking at that resource, it appears to be a request to communicate with someone.  That was not our intent.  We actually wanted to communicate right then.  More like, we want to message the provider.  Currently, portals have secure message capability and through a patient portal you can send a message to your provider.  However, in the fhir apis provided by EHRs, there is no way for a patient app to get a message into that provider inbox using fhir.  Patients may have many different insights they would like to share with their doctor and there is no way to just send a basic message.  The Communication resource seems the most like that.  The Communication resource is not a request but represents the actual communication. I read in the definition: \"A communication is a conveyance of information from one entity, a sender, to another entity, a receiver. The sender and receivers may be patients, practitioners, related persons, organizations, or devices.\"  So I got excited <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span> and thought wow this could be that message.  But the Communication resource went on to say: \"This resource is a record of a communication that has occurred. It does not represent the actual flow of communication.\" <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span> Kind of like I called the doctor on the phone and then a communication resource was sent to document that.  So what resource would be used to just send a free text message to a fhir enabled inbox?    This is not to detract from all our work from Task, but it seems having a basic patient/provider messaging capability between patient apps and ehrs using FHIR and NOT direct protocol would be really useful.</p>",
        "id": 217291774,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605802322
    },
    {
        "content": "<p>CommunicationRequest is not really appropriate here.  CommunicationRequest is an authorization for data to be shared.  What we're looking at here isn't an authorization to share, it's a request to make a change.  CommunicationRequest is not the appropriate resource. </p>\n<p>Keep in mind that we're <em>always</em> communicating information with FHIR.  That doesn't mean that we're always using Communication or CommunicationRequest.</p>\n<p>If your sole objective was to just represent \"secure email\" over FHIR, then you might use Communication to convey the text blobs from one place to another.  You could use that to do pretty much anything - request an appointment, ask for a referral, ask a question about a lab result, request a correction.  But it wouldn't accomplish anything more than an email would.  No computability, no control over behavior, no searchability, etc.</p>",
        "id": 217294265,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605803303
    },
    {
        "content": "<p>We have an is/ought dilemma, between how people ought to implement the APIs in an ideal situation and what's formally defined and semantically consistent and ideal, versus what's currently available.  Having a CommunicationRequest to discuss a Task might be a perfectly valid workflow for a file room somewhere that's operating a help desk and call log, and completely invalid elsewhere.  </p>\n<p>Before presuming what the provider workflow ought to be, maybe lets leverage the CapabilityStatement on <code>/metadata</code>, check to see if their system supports Task, CommunicationRequest, ServiceRequest, etc; send over whatever structured data that is available, and default to a workflow that mimics paper and phonecalls and faxes when more automated options aren't available.</p>",
        "id": 217306413,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1605808412
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I am not backing away from Task to support correction workflow and definitely not recommending CommunicationRequest as an alternative.  My point is patient portals allow patients to send free form messages to their doctors for a multitude of reasons using the Secure Messaging Function (it was required in Meaningful Use).  However, someone who uses a PHR which has data downloaded from many EHRs would need to go onto each portal to send such a message because the EHR vendors do not provide this simple communication mechanism through FHIR.  As I have been looking at corrections, its make me think of that.  So I want to know what resource or resources would be the best to send a message - like a secure email - from the patient app to the EHR - using FHIR - one that posts in that same inbox that already review from the patient portal.  My daughter constantly using this feature to send questions about weird symptoms, is she doing something wrong in her self-care, questions about directions, etc.   <span class=\"user-mention\" data-user-id=\"192825\">@Jeffrey Danford</span> <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span>  (Dave I am proud of my daughter for that).</p>",
        "id": 217316537,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605813257
    },
    {
        "content": "<p>Additional Patient Corrections IG Meeting Tomorrow 5-6PM Eastern to review our work on profiling Task for the upcoming connectathon:</p>\n<p>We will be \"in the weeds\".  Anyone who is interested please join us from 5-6PM Eastern:</p>\n<p>Join Zoom Meeting<br>\n<a href=\"https://columbiacuimc.zoom.us/j/5505166080\">https://columbiacuimc.zoom.us/j/5505166080</a></p>\n<p>Meeting ID: 550 516 6080<br>\nOne tap mobile<br>\n+16465588656,,5505166080# US (New York)<br>\n+13017158592,,5505166080# US (Washington D.C)</p>\n<p>Dial by your location<br>\n        +1 646 558 8656 US (New York)<br>\n        +1 301 715 8592 US (Washington D.C)<br>\n        +1 312 626 6799 US (Chicago)<br>\n        +1 253 215 8782 US (Tacoma)<br>\n        +1 346 248 7799 US (Houston)<br>\n        +1 669 900 9128 US (San Jose)<br>\nMeeting ID: 550 516 6080<br>\nFind your local number: <a href=\"https://columbiacuimc.zoom.us/u/acHbDuY35\">https://columbiacuimc.zoom.us/u/acHbDuY35</a></p>\n<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> <span class=\"user-mention\" data-user-id=\"191859\">@Amit Popat</span> <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span></p>",
        "id": 217319958,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605814757
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"191357\">@Drew Torres</span></p>",
        "id": 217325444,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1605817377
    },
    {
        "content": "<p>If the use-case we're talking about is 'send a secure message using FHIR', then yes, Communication is appropriate.  (Whether FHIR is the appropriate way to handle the 'send a secure message' use-case is a question I'll leave to the EHR vendors - I know that some environments are using it.)</p>",
        "id": 217346079,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605829458
    },
    {
        "content": "<p>Yes Lloyd, that was the question.  And I would say the definition of Communication is then misleading because it says \"This resource is a record of a communication that has occurred. It does not represent the actual flow of communication.\"  What other ways could a patient communicate with their doctors outside of fhir that works in their patient app workflow?  I know direct messaging is one way but that requires patients to purchase a direct address.</p>",
        "id": 217434887,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605894204
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span>  FYI You missed the slicing convo!   <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> said with Task, its real important that you do slicing on input and output (because thats sort of how you provide additional fields).</p>",
        "id": 217474185,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605917236
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> <span class=\"user-mention\" data-user-id=\"191357\">@Drew Torres</span> <span class=\"user-mention\" data-user-id=\"191859\">@Amit Popat</span> <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> Any chance you guys would be interested in participating in the Patient Corrections track in January?  I know you are all quite busy but would love to have your insights and support.</p>",
        "id": 217487034,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605938226
    },
    {
        "content": "<p>Question for this group: would there be interest in proposing Patient Corrections as a project for Argonaut 2021? I think this would be a great fit, to get a certain set of the community to \"make more room on their calendar\" for discussing, testing, and iterating on specs for this use case. (On the other hand, you might decide it's a crowd or an imprimatur that you don't want.) Generally we start the project selection process toward the end of the calendar year, and if there is interest I'll be happy to include Patient Corrections on our list for review.</p>",
        "id": 217501829,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1605965283
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192088\">@Micky Tripathi</span> FYI</p>",
        "id": 217501864,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1605965300
    },
    {
        "content": "<p>Heck yes!</p>\n<p>I feel safe saying that without polling our project leads <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> and <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> and IG author <span class=\"user-mention\" data-user-id=\"251396\">@John Keyes</span>  :-)    But we'll need support in understanding Argonaut and continuing support in our discussions of resources.</p>",
        "id": 217502115,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1605965871
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> can you convert that spreadsheet you were using yesterday in a Google sheet, so we can see and work on it together?</p>",
        "id": 217507889,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1605975640
    },
    {
        "content": "<p>I'd actually love Argonaut to take on Task generally - it's manifesting in quite a few IGs - a few Da Vinci ones, Gravity, SDC.</p>",
        "id": 217509782,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605978488
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> I echo <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> to say we would love to have this support. This is a really important project because as patients begin to gather their data, there is going to be more visibility of all the errors in their charts. These errors could impact patient safety, health care choices, and insurance premiums. We really want to enable correction requests directly within the consumer apps instead of the patient printing out a form and mailing correction requests to the clinic. I also agree with Lloyd that Task will likely be used more in a variety of future use cases. Is there anything we need to do on our side to get this moving forward with Argonaut?</p>",
        "id": 217510490,
        "sender_full_name": "Debi Willis",
        "timestamp": 1605979688
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>    as the US pivots toward greater data sharing with the information blocking rules, patients will be seeing more information and will see it more real-time, and have more to respond to.  And I would assume that one important response will be that's not correct.    I think providing patients will the ability to respond electronically in real-time would be empowering for patients as well as help with workflow management of incoming requests on provider side.</p>",
        "id": 217510796,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605980205
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> yes I am supposed to do that conversion - will do.</p>",
        "id": 217510816,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1605980262
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>    <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>   I love where Virginia is going with this question.This capability would bring so many benefits to patients. I have had several people ask me if they could use FHIR for secure communication between patients and organizations. They specifically referenced FHIR paralleling the Direct communication between a patient and a provider but using FHIR as an easier and cheaper way for patients to communicate with them within apps. This is even more important now with Covid causing patients to communicate remotely with their healthcare providers, social workers, and researchers.</p>",
        "id": 217513443,
        "sender_full_name": "Debi Willis",
        "timestamp": 1605984444
    },
    {
        "content": "<p>I'll repeat (just to keep it in-thread) a small part of the litany of errors to be fixed, because everywhere this comes up, there are earnest skeptical people who haven't yet discovered how many errors there are.  (Everyone tends to believe that all people who put stuff in a chart are careful and not in a rush and that there's proofreading.)</p>\n<ol>\n<li>Screen capture attached: my 2003 x-ray identifying me as a woman.<br>\n<a href=\"/user_uploads/10155/aep5KR7DfM2Uj6YWGpv3uuD7/image.png\">image.png</a> <div class=\"message_inline_image\"><a href=\"/user_uploads/10155/aep5KR7DfM2Uj6YWGpv3uuD7/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/aep5KR7DfM2Uj6YWGpv3uuD7/image.png\"></a></div></li>\n</ol>\n<p>2.My mother's hyper/hypothyroid mixup, which could have killed her.</p>\n<p>3.My mother's wrong Problem List entry - a dumb clerk misinterpreted one medication and wrongly added DIABETES to her problem list, which caused her PCP to think something valid had been discovered elsewhere</p>\n<ol start=\"4\">\n<li>\n<p>Morgan Gleason's chart (at age 20) suddenly saying she'd had two pregnancies, one at age 13. Office clerk said \"If it's in the chart, you must have said it.\"</p>\n</li>\n<li>\n<p>@Grace Cordovano's <a href=\"https://www.unblock.health/patient-impact-stories/\">Patient Impact Stories</a> at Unblock Health, including Pat Sheridan dying after his dx was lost, and Grace's own anaphylactic morphine reaction, which she finds is often missing from a new provider's chart.</p>\n</li>\n</ol>\n<p>These are just off the top of my head.  (Anyone, please add yours.)  I want every reader to understand - this is not about outing the bad guys. This is about upgrading the accuracy of the data in EMRs that are about to become increasingly mobile.</p>",
        "id": 217524059,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606000642
    },
    {
        "content": "<p>Thanks for the feedback! I'll probably rope folks into proofreading (and of course if you like, re-writing entirely) a short project description for the Argonaut planning process. (Re: Task, I'll advocate for a bottom-up approach: let's use it in a project we care about and refine it through use, rather than trying to somehow tackle Task \"in general\".)</p>",
        "id": 217525366,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606003039
    },
    {
        "content": "<p>I think we all agree here that being able to send correction is a good thing, the issue is how to make that a reality: we'll figure out the technical part, it is not hard, the hard part is to have providers actually deploy it - I would love to see ideas about how to achieve that (because frankly, implementing things that would never be used  is not that fun)</p>",
        "id": 217526562,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606005179
    },
    {
        "content": "<p>Agreed -- including even a small set of clinical provider orgs who <em>want</em> to make this work will be key.</p>",
        "id": 217526639,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606005292
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> An easy way for apps to initiate direct communications to providers isn't necessarily going to be seen as a positive for a lot of providers.  Right now there are a lot of gatekeepers - and a lot of clinicians are quite happy for things to stay that way.  Also, there aren't necessarily billing codes for reading and responding to patient queries.  I'm not saying that providing a secure email-like functionality over FHIR would be a bad thing, but we'll need to think carefully about the business case from both sides of the exchange if we want it to be adopted.</p>",
        "id": 217531631,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606015079
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>              <br>\nI love where Virginia is going with this question. This capability would bring so many benefits to patients￼. ￼I have had several people ask me if they could use FHIR for secure communication between patients and organizations.￼ They specifically referenced ￼FHIR paralleling the Direct communication between a patient and a provider but using FHIR as￼ an easier and cheaper way for patients to communicate with them within apps. This is even more important now with Covid causing patients to communicate remotely with their healthcare providers, social workers, and researchers.</p>",
        "id": 217555657,
        "sender_full_name": "Debi Willis",
        "timestamp": 1606057868
    },
    {
        "content": "<p>I'm thrilled at the idea of Argonaut engagement.  I don't know enough about how things work in the famed Argonaut world so I feel the need to bring myself up to speed, to be useful and not clueless.  <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"192088\">@Micky Tripathi</span>  or anyone, any suggestions?</p>\n<p>To be clear, this opportunity zooms instantly to the top of my interest list :-)   </p>\n<p>And I agree, it would be terrific to find both a use case that providers agree is indisputably legit and worth doing, and some provider orgs who are game to take it on.  Although I often sound rabble-rousey, there is much value to be had by providers. </p>\n<p>Would \"missing allergy\" be seen as undeniably valuable to providers?  Would it need to be more specific?</p>",
        "id": 217575253,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606086448
    },
    {
        "content": "<p>Fixing allergy, med, and problem lists is an easy story and feels like a great start; I think we'd still want to keep something \"less strucured\" front and center as well, so we don't over-fit the workflow.</p>",
        "id": 217579552,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606092862
    },
    {
        "content": "<p>LOL, okay chief, you’ve exceeded my vocabulary. Overfit? </p>\n<p>I’ll take a guess. Are you concerned that we might make it trivially easy so people don’t have to flex their thinking?</p>\n<p>There are LOTS of not very structured ones, but it’s easy to get into very debatable territory. </p>\n<p>But how about this: remember <span class=\"user-mention\" data-user-id=\"311763\">@Morgan Gleason</span> ‘s winning talk at DevDays June? It included discovering that her chart suddenly said she’d had two pregnancies, and she shared the documents she had used to precisely do what HIPAA requires. Is that an example of “less structured”?</p>",
        "id": 217581538,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606095753
    },
    {
        "content": "<p>I think an example of less structured is just being able to use simple text:<br>\n\"My chart states that I am taking Lopressor. I have never taken any beta-blockers of any kind, please remove the entry for Lopressor from my chart.\"</p>",
        "id": 217795225,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1606242708
    },
    {
        "content": "<p>(Yes, this is great -- and anticipating inevitable misuses like \"I've been taking a half pill a day, but not sure if I should switch to a full pill\"; having a Task based workflow here provides a good point for human review and, when needed, redirecting or rejecting a request.)</p>",
        "id": 217797153,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606243587
    },
    {
        "content": "<p>Let us know if we (CARIN) can help in anyway advance this project. I agree it's great Argonaut is considering this for 2021 and feel it's definitely the right place for this project to live. We'd be happy to work with <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"192088\">@Micky Tripathi</span> to bring our consumer-facing app community to the table to help test/refine the approach.</p>",
        "id": 218369839,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1606785380
    },
    {
        "content": "<p>I fully support Argonaut engaging with this project, but I do not agree that it should be owned by Argonaut. This project has been a hard fought victory of the Patient Empowerment family, who made an HL7 Workgroup that never existed before, so that they could OWN patient empowerment projects and HOST other workgroups.</p>",
        "id": 218421859,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606829697
    },
    {
        "content": "<p>by Argonaut stomping in and taking this over, we just prove why the Patient Empowerment workgroup needs to exist.</p>",
        "id": 218422005,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606829766
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  , would love to talk about how (or whether) Argonaut can be helpful in supporting the WG's work. Definitely don't want to stomp on anything. Pls DM me so we can connect. Thx!</p>",
        "id": 218439582,
        "sender_full_name": "Micky Tripathi",
        "timestamp": 1606837756
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> . We're just at the beginning of deciding on our 2021 projects, so just exploring whether this would be helpful to the community and aligned with the WG's efforts. Really appreciate all of the feedback!</p>",
        "id": 218441031,
        "sender_full_name": "Micky Tripathi",
        "timestamp": 1606838273
    },
    {
        "content": "<p>I would see the PE work-group's work as being the international spec.  Argonaut would localize it for US use.  If they're working together, side-by-side, they can coordinate.  I think that would be appropriate and useful.</p>",
        "id": 218449423,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606841385
    },
    {
        "content": "<p>(Though it would be a somewhat new model for Argonaut to follow.)</p>",
        "id": 218449510,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606841406
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192088\">@Micky Tripathi</span>, we would love Argonaut to help. Thank you for your interest and offer. </p>\n<p>We are trying to press forward quickly in the next two weeks to be ready for the connectathon.  ANY interested parties are invited to please join us to complete the specifications draft on the following dates:<br>\nThursday December 3 @ 1 PM ET<br>\nMonday December 7 @ 3 ET<br>\nTuesday December 8 @ 2 ET<br>\nThursday December 10 @ 1 ET<br>\nGoToMeeting information for the sessions:<br>\n<a href=\"https://global.gotomeeting.com/join/322275573\">https://global.gotomeeting.com/join/322275573</a> <br>\n    You can also dial in using your phone. <br>\n    United States: +1 (872) 240-3212 <br>\n    Access Code: 322-275-573</p>",
        "id": 218488972,
        "sender_full_name": "Debi Willis",
        "timestamp": 1606860433
    },
    {
        "content": "<p>In preparation for those calls can we circulate a document with what need to be discussed / decided?</p>",
        "id": 218492050,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606862120
    },
    {
        "content": "<p>...and have a shared Google sheet with the Task elements must support / required?</p>",
        "id": 218492154,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606862174
    },
    {
        "content": "<p>I think we decided that Task.requester is required - this means that the servers must support openid and fhirUser, so that the client can know what to put in requester (that must be the current user)</p>",
        "id": 218492361,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606862316
    },
    {
        "content": "<p>Clients will need to query for pending tasks, so server must implement the requester search parameter (and/or patient? seems more difficult to use though)</p>",
        "id": 218492549,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606862442
    },
    {
        "content": "<p>Task.requester could theoretically just be 'display'.  Certainly mandating openid and fhirUser doesn't necessarily flow from saying that Task.requester is required.</p>",
        "id": 218492893,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606862700
    },
    {
        "content": "<p>Mhh, so each app can put just a piece of text there, like 'John Smith', so the server ends up with a bunch of Task with requester John Smith from different apps, and then how does it knows which is which? how do the apps query for the tasks of 'their' john smith ?</p>",
        "id": 218493418,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606863056
    },
    {
        "content": "<p>Or the user has access only to the task it created (that seems reasonable?), so the search is 'give me all tasks' - and there is no need for requester search parameter, nor to fill requester with anything unique - works from the app point of view</p>",
        "id": 218494487,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606863755
    },
    {
        "content": "<p>I'm not saying it's ideal or desirable, just saying that there'll need to be some discussion if we want to make it tighter.  Even if we assert a specific resource reference, that doesn't necessarily mean that openid is the only way.  It should be a conscious choice that that's what we want.  (I'm fine if it is.)</p>",
        "id": 218494517,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606863787
    },
    {
        "content": "<p>Discussing it is what I am doing - see another alternative above</p>",
        "id": 218494785,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606863924
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/217525366\">said</a>:</p>\n<blockquote>\n<p>I'll probably rope folks into proofreading (and of course if you like, re-writing entirely) a short project description for the Argonaut planning process.</p>\n</blockquote>\n<p>Thanks, <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> - I have to say, for the record, that while I know you and absolutely  trust your skillz and judgment, patient activists around the world are wary of others \"taking over\" a project they started, once the establishment discovers it has merit, then discovering the objectives and priorities had drifted.  </p>\n<p>So please yes do what needs to be done to move things along, and keep our WG and its intent actively involved! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>\n<p>And yes, absolutely happy to have expert advice on wordsmithing to fit the flow and accelerate adoption.</p>",
        "id": 218507581,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606874871
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218492050\">said</a>:</p>\n<blockquote>\n<p>In preparation for those calls can we circulate a document with what need to be discussed / decided?</p>\n</blockquote>\n<p>This is the Profile spreadsheet we have been working on: <a href=\"https://docs.google.com/spreadsheets/d/1kPMzWTA8iXRzcra6SMehgIQDb6VxpNp6B_BQpCN3VRQ/edit#gid=114961663\">https://docs.google.com/spreadsheets/d/1kPMzWTA8iXRzcra6SMehgIQDb6VxpNp6B_BQpCN3VRQ/edit#gid=114961663</a></p>",
        "id": 218523525,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1606895411
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span>  - I cannot access it though, you have to share it</p>",
        "id": 218564919,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606920028
    },
    {
        "content": "<p>Got access now, thanks. Adding some notes</p>",
        "id": 218566283,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606920574
    },
    {
        "content": "<p>and I added a sheet for searches and search parameters</p>",
        "id": 218569316,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606921745
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> I can't access the Profile spreadsheet.</p>",
        "id": 218575856,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1606924289
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"251396\">@John Keyes</span> <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  John can you change access to the google sheet so that anyone with link can see it?</p>",
        "id": 218587891,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1606928983
    },
    {
        "content": "<p>Done</p>",
        "id": 218588188,
        "sender_full_name": "John Keyes",
        "timestamp": 1606929082
    },
    {
        "content": "<p>If you are interested in signing up as part of our track, you can do that right on our track proposal under Expected Participants:  <a href=\"https://confluence.hl7.org/display/FHIR/2021-01+-+Patient+Corrections\">https://confluence.hl7.org/display/FHIR/2021-01+-+Patient+Corrections</a></p>",
        "id": 218588220,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1606929096
    },
    {
        "content": "<blockquote>\n<p>patient activists around the world are wary of others \"taking over\" a project they started, </p>\n</blockquote>\n<p>100% agreed! (The proposals process hasn't begun but I'll keep this group involved from the start when it does.)</p>",
        "id": 218597625,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606933171
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> as I'm sure you're aware, this is at least as much a practical matter of perception as anyone's alleged reality <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 218610122,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606938935
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>   <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>   The ability to correct your data is considered an important empowerment lever - a chance to have control. In the new EHI Draft Consumer Privacy Framework: <a href=\"https://www.ehidc.org/resources/draft-consumer-privacy-framework-health-data#:~:text=August%2026%2C%202020%20%E2%80%93%20Today%20the,rules%20that%20should%20govern%20them\">https://www.ehidc.org/resources/draft-consumer-privacy-framework-health-data#:~:text=August%2026%2C%202020%20%E2%80%93%20Today%20the,rules%20that%20should%20govern%20them</a>., it describes the first right with respect to a consumer's health information as their right to \"Access, Correct, and Delete Consumer Health Information\".  Through Argonaut and CARIN's efforts there has been focus on access.  Our purpose is to address the other parts.  Also, WHO did a study on Legal Frameworks for eHealth in 2012.  It surveyed countries around the world about \"rights that were granted to individuals, asking<br>\nif patients had a right to seek correction and deletion elements of the record\".  Sadly, this right seemed to be reserved more for individuals in wealthier countries.  The study can be found here: <a href=\"https://www.who.int/goe/publications/legal_framework_web.pdf\">https://www.who.int/goe/publications/legal_framework_web.pdf</a>  In the upcoming Patient Corrections Track at the January Connectathon, we are hoping to have representatives from countries other than the US.</p>",
        "id": 218622298,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1606944512
    },
    {
        "content": "<p>note that even in the USA the right is not equally distributed... those with more wealth can navigate the boundaries and  pathways necessary, where those less well off can't. Our goal is to define a more automatable process based on interoperability, so that many applications can be developed that can leverage our specification, thus more likely that the functionality is available to everyone that has the legitimate right and/or authorization.</p>",
        "id": 218623057,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606944868
    },
    {
        "content": "<p>Note that at <a href=\"http://build.fhir.org/ig/HL7/fhir-patient-correction/specification.html#patient-correction-rebuttal-flow\">http://build.fhir.org/ig/HL7/fhir-patient-correction/specification.html#patient-correction-rebuttal-flow</a> I see \"Received/Disagreed\" as a status/businessStatus, but I think this should say \"Rejected/Disagreed\".  In general, it would be good to pull  these details about state transitions out of the diagrams, or ensure they're not <em>just</em> in diagrams, since this makes it hard to search.</p>",
        "id": 218628659,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606947744
    },
    {
        "content": "<p>I'm also expecting to see details in the spec about when/how parties update fields on the Task <em>other</em> than statuses. What fields is each party allowed/expected to update, and when (with respect to status changes? Where are how are rationales/reasons captured (e.g., \"Bob sends a statement disagreeing with the denial\"?)</p>",
        "id": 218628802,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606947838
    },
    {
        "content": "<p>Where and how are requests to send downstream notifications tracked (e.g., \"Bob then requests that Southside Clinic notify his insurance company (<a href=\"http://MyLifeInsurance.com\">MyLifeInsurance.com</a>) that his record has now been corrected.\")?</p>",
        "id": 218628877,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606947859
    },
    {
        "content": "<p>(I expect the answers to some of these are \"use <code>.notes</code> Annotations\"; but it's worth spelling this out.)</p>",
        "id": 218628989,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606947927
    },
    {
        "content": "<p>It's also not clear to me why distinct profiles are provided for Task[request] and Task[disagreement].  Is the idea that one Task will fit (at least?) one of these profiles at any point in time, but it could switch between them when statuses change? It's hard to follow this kind of logic just from the profiles themselves.</p>",
        "id": 218629119,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606947998
    },
    {
        "content": "<blockquote>\n<p>I'm also expecting to see details in the spec about when/how parties update fields on the Task other than statuses.</p>\n</blockquote>\n<p>I would _not_ specify those things - keep it simply</p>",
        "id": 218629137,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606948010
    },
    {
        "content": "<blockquote>\n<p>Where and how are requests to send downstream notifications tracked</p>\n</blockquote>\n<p>Not supported / out of scope</p>",
        "id": 218629170,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606948030
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> you don't even want to say \"Bob's client adds an annotation to the end of the .notes array\"?</p>",
        "id": 218629200,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606948037
    },
    {
        "content": "<p>Nope</p>",
        "id": 218629235,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606948060
    },
    {
        "content": "<p>I'm assuming the use cases at <a href=\"http://build.fhir.org/ig/HL7/fhir-patient-correction/#use-cases\">http://build.fhir.org/ig/HL7/fhir-patient-correction/#use-cases</a> <em>define</em> the scope! All of my questions are based on looking at these.</p>",
        "id": 218629238,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606948061
    },
    {
        "content": "<p>If you think the use cases are wrong, we should back up and discuss <em>those</em>. I was just taking those on faith, not trying to express an opinion one way or the other.</p>",
        "id": 218629263,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606948077
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> being new to both IGs and Connectathons, I wonder how much of this stuff you anticipate being at this event (and thus specified before then). </p>\n<p>(Could you help, at least by outlining what needs to be fleshed out??)</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> <span class=\"user-mention\" data-user-id=\"251396\">@John Keyes</span></p>",
        "id": 218629343,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606948102
    },
    {
        "content": "<p>The more <em>essential bits</em> we specify ahead of time, the less time we'll spend at connectathon scratching our heads. You need \"good enough guesses\" before the event, in order to drive the harder-to-reach questions/insights at the event.</p>",
        "id": 218629442,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606948170
    },
    {
        "content": "<p>Like... does the conversation happen through annotations? Or inputs/outputs? It can't be... just totally unspecified if we think the conversation matters.</p>",
        "id": 218629621,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606948259
    },
    {
        "content": "<p>Yeah, I would definitely remove 'Bob then requests that Southside Clinic notify his insurance company '</p>",
        "id": 218629625,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606948261
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218629442\">said</a>:</p>\n<blockquote>\n<p>The more <em>essential bits</em> we specify ahead of time, the less time we'll spend at connectathon scratching our heads. You need \"good enough guesses\" before the event, in order to drive the harder-to-reach questions/insights at the event.</p>\n</blockquote>\n<p>That makes sense!  We're just managing a desire to do a solid job in preparing for something we've never seen (some of us) so this dialog is useful.</p>",
        "id": 218629716,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606948322
    },
    {
        "content": "<p>What we discussed was using <code>statusReason</code> to explain why the status has been changed</p>",
        "id": 218629881,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606948390
    },
    {
        "content": "<p>Interesting, re: <code>statusReason</code>. That's yet another option -- highlights the point that it'll be important to say something about this!</p>",
        "id": 218630005,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606948454
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/2PoJvvNHlj-UpF09BUGY4z_Y/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/2PoJvvNHlj-UpF09BUGY4z_Y/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/2PoJvvNHlj-UpF09BUGY4z_Y/image.png\"></a></div>",
        "id": 218630083,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606948517
    },
    {
        "content": "<p>I'm aiming to join tomorrow's call, BTW (thanks for the invite <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span>). I have no specific agenda, just happy this is underway.</p>",
        "id": 218630098,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606948532
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> cool, where's that screenshot from? I have only been seeing/reviewing what's at <a href=\"http://build.fhir.org/ig/HL7/fhir-patient-correction\">http://build.fhir.org/ig/HL7/fhir-patient-correction</a></p>",
        "id": 218630115,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606948545
    },
    {
        "content": "<p><a href=\"https://docs.google.com/spreadsheets/d/1kPMzWTA8iXRzcra6SMehgIQDb6VxpNp6B_BQpCN3VRQ/edit#gid=114961663\">https://docs.google.com/spreadsheets/d/1kPMzWTA8iXRzcra6SMehgIQDb6VxpNp6B_BQpCN3VRQ/edit#gid=114961663</a></p>",
        "id": 218630216,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606948592
    },
    {
        "content": "<p>Thanks. Looking at the spreadsheet, one thing I worry about is \"clobbering\" the <code>Task.description</code> if it's being used to support a back-and-forth conversation as a Task changes states. It feels a bit odd, since the description (unlike status reason) seems designed to be more stable through the lifecycle of a Task.</p>",
        "id": 218630397,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606948712
    },
    {
        "content": "<p>(May be good to link to the spreadsheet from the IG if this is where the latest design is happening.)</p>",
        "id": 218630459,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606948766
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218630459\">said</a>:</p>\n<blockquote>\n<p>(May be good to link to the spreadsheet from the IG if this is where the latest design is happening.)</p>\n</blockquote>\n<p>IG author <span class=\"user-mention\" data-user-id=\"251396\">@John Keyes</span> note the suggestion</p>",
        "id": 218630558,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606948806
    },
    {
        "content": "<p>Each task will have only one status transition, there is really no back and forth. 'Bob sends a statement disagreeing' is a new task</p>",
        "id": 218630693,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606948900
    },
    {
        "content": "<p>btw <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> I believe that document is days old (not weeks/months) so you haven't been de-looped ... I also believe <span class=\"user-mention\" data-user-id=\"251396\">@John Keyes</span> is in the process of transcribing it to a more appropriate home or format, as we speak.</p>",
        "id": 218630826,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606948967
    },
    {
        "content": "<p>I'm a day late posting this -  from this week's agenda - schedule for four calls between now and our self-imposed deadline Friday 12/11: <br>\n<a href=\"/user_uploads/10155/9_8w81jgimiDDc8g4GAIe03a/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/9_8w81jgimiDDc8g4GAIe03a/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/9_8w81jgimiDDc8g4GAIe03a/image.png\"></a></div>",
        "id": 218631030,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606949097
    },
    {
        "content": "<p>The spreadsheet is at <a href=\"https://docs.google.com/spreadsheets/d/1kPMzWTA8iXRzcra6SMehgIQDb6VxpNp6B_BQpCN3VRQ/edit?usp=sharing\">https://docs.google.com/spreadsheets/d/1kPMzWTA8iXRzcra6SMehgIQDb6VxpNp6B_BQpCN3VRQ/edit?usp=sharing</a> ...this is where the work is happening, but my intent is to update the FSH in the IG to match it as we go.  <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> , the official home of the draft IG is <a href=\"http://build.fhir.org/ig/HL7/fhir-patient-correction\">http://build.fhir.org/ig/HL7/fhir-patient-correction</a></p>",
        "id": 218631219,
        "sender_full_name": "John Keyes",
        "timestamp": 1606949195
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"251396\">John Keyes</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218631219\">said</a>:</p>\n<blockquote>\n<p>the official home of the draft IG is <a href=\"http://build.fhir.org/ig/HL7/fhir-patient-correction\">http://build.fhir.org/ig/HL7/fhir-patient-correction</a></p>\n</blockquote>\n<p>Yes, that's what Josh linked to above. He hadn't seen the Google Sheet because it's not mentioned in the IG, he sez. So I pinged you <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 218631409,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1606949298
    },
    {
        "content": "<p>Part of a patient's rights (at least in the US) is to instruct the organization about who needs to be contacted concerning a correction in the chart. This is an important part of corrections so we want to address how to do that also. If I was denied insurance because of an error in my chart, I definitely want the org or notify the insurance company to set the record straight.</p>",
        "id": 218636621,
        "sender_full_name": "Debi Willis",
        "timestamp": 1606952785
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> I disagree that each Task will only have one state transition.  There'll only be one Task instance through to completion or rejection.  You only get a new Task if you move from rejection to a request for logging of a disagreement.</p>",
        "id": 218638946,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606954381
    },
    {
        "content": "<p>The Task will be stored in the EHR and will be updated by multiple parties through its lifecycle.</p>",
        "id": 218638959,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606954403
    },
    {
        "content": "<p>In general, the Task.description shouldn't change.</p>",
        "id": 218638963,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606954411
    },
    {
        "content": "<p>(Though it could potentially be refined with additional detail if that could be done safely without losing the patient's original intention)</p>",
        "id": 218639017,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606954448
    },
    {
        "content": "<p>Mhh, the task can go received -&gt; accepted, or received -&gt; rejected - which other transitions there are? </p>\n<p>What happens _internally_ to the provider system can be anything and everything of course, but not something that is interesting for the client to see or for the implementation guide to specify - the implementation guide is about client - server communication</p>",
        "id": 218640057,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606955489
    },
    {
        "content": "<blockquote>\n<p>This is an important part of corrections so we want to address how to do that also.</p>\n</blockquote>\n<p>Leave it for version 2.0</p>",
        "id": 218640313,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606955687
    },
    {
        "content": "<p>I thought the write-up taking a single task into a rejected, disputed, and finally resolved state was compelling -- if you use a whole new Task, then you have the challenge of linking/referencing across them.</p>",
        "id": 218640604,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606955999
    },
    {
        "content": "<p>The decision was to use a separate task, referencing the original one using Task.input</p>",
        "id": 218641078,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606956375
    },
    {
        "content": "<p>Ok. Sounds like I should wait a bit until the spec incorporates these decisions, and will review then!</p>",
        "id": 218641323,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606956647
    },
    {
        "content": "<p>I think everything is still in the phase of discussion to make sure we are considering all possible impacts to a particular option.  We will dig deeper into the draft spec tomorrow. We value insight from each of you. We don't want to get bogged down, but we also don't want to miss important insight. Please show up and we can have some great minds working on this together. </p>\n<p>Here is the call in information for the meeting tomorrow at 1 PM ET:</p>\n<p><a href=\"https://global.gotomeeting.com/join/322275573\">https://global.gotomeeting.com/join/322275573</a> <br>\nYou can also dial in using your phone. <br>\nUnited States: +1 (872) 240-3212 <br>\nAccess Code: 322-275-573</p>",
        "id": 218643581,
        "sender_full_name": "Debi Willis",
        "timestamp": 1606958693
    },
    {
        "content": "<p>Received -&gt; accepted -&gt; completed.  Received -&gt; Accepted -&gt; in-progress -&gt; on-hold -&gt; in-progress -&gt; completed</p>",
        "id": 218652180,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606968993
    },
    {
        "content": "<p>And various other paths</p>",
        "id": 218652182,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606969000
    },
    {
        "content": "<p>Logic for a distinct task is that the patient is actually asking for something different - and the wording the patient wants to be recorded in the record might be different once they see the initial rejection.  As well, the data being submitted might be different.</p>",
        "id": 218652211,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606969073
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218640057\">said</a>:</p>\n<blockquote>\n<p>Mhh, the task can go received -&gt; accepted, or received -&gt; rejected - which other transitions there are? </p>\n<p>What happens _internally_ to the provider system can be anything and everything of course, but not something that is interesting for the client to see or for the implementation guide to specify - the implementation guide is about client - server communication</p>\n</blockquote>\n<p>You can go from received to accepted to completed.  You can go from received to received - extended to accepted to completed.  You can go from received to received-extended to rejected.  For disagreement, rebuttal adds a shade to the state transition as well.  Also, while the task is in a state, the requester could send an update.  I need to update the state machine based on our last meeting and then will repost it.</p>",
        "id": 218653209,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1606970395
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218630397\">said</a>:</p>\n<blockquote>\n<p>Thanks. Looking at the spreadsheet, one thing I worry about is \"clobbering\" the <code>Task.description</code> if it's being used to support a back-and-forth conversation as a Task changes states. It feels a bit odd, since the description (unlike status reason) seems designed to be more stable through the lifecycle of a Task.</p>\n</blockquote>\n<p>We plan to give up the spreadsheet soon and just update the IG.  Its our training wheels.  <span class=\"user-mention\" data-user-id=\"251396\">@John Keyes</span> in he meantime, see what Josh is suggesting - to link to the spreadsheet as the latest until we give it up.  Sorry for the confusion!</p>",
        "id": 218653566,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1606970843
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191531\">Virginia Lorenzi</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218588220\">said</a>:</p>\n<blockquote>\n<p>If you are interested in signing up as part of our track, you can do that right on our track proposal under Expected Participants:  <a href=\"https://confluence.hl7.org/display/FHIR/2021-01+-+Patient+Corrections\">https://confluence.hl7.org/display/FHIR/2021-01+-+Patient+Corrections</a></p>\n</blockquote>\n<p>SORRY CHANGED NAME OF DOCUMENT: New link: <a href=\"https://confluence.hl7.org/display/FHIR/2021-01+-+Patient+Empowerment%3A+Patient+Corrections\">https://confluence.hl7.org/display/FHIR/2021-01+-+Patient+Empowerment%3A+Patient+Corrections</a></p>",
        "id": 218653708,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1606971075
    },
    {
        "content": "<p>About the statuses and state diagram - we met last week and decided that the \"received\" status was not needed - requested was enough.  I reviewed our original state diagram (which is in the draft spec now) and updated it in this powerpoint to reflect that as well as to fix an error on the Disagreement Flow.  Rebuttal is an optional state.  <a href=\"https://docs.google.com/presentation/d/1t1X4jn_8DTgaumaTN9hzQvVkB0LF7zFu/edit#slide=id.p4\">https://docs.google.com/presentation/d/1t1X4jn_8DTgaumaTN9hzQvVkB0LF7zFu/edit#slide=id.p4</a>  We are currently using business status but perhaps its not needed - something to think about.  Also, it is possible for a patient to cancel a correction request.  A patient could also update a correction request.  For example, when they learn their request is accepted, they might update their request to include who to notify with the corrections when they are completed (this example is from the HIPAA workflow guide).</p>",
        "id": 218654555,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1606972300
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218641323\">said</a>:</p>\n<blockquote>\n<p>Ok. Sounds like I should wait a bit until the spec incorporates these decisions, and will review then!</p>\n</blockquote>\n<p>Its in the profile for the disagreement - see the google sheet: <a href=\"https://docs.google.com/spreadsheets/d/1kPMzWTA8iXRzcra6SMehgIQDb6VxpNp6B_BQpCN3VRQ/edit#gid=114961663\">https://docs.google.com/spreadsheets/d/1kPMzWTA8iXRzcra6SMehgIQDb6VxpNp6B_BQpCN3VRQ/edit#gid=114961663</a></p>",
        "id": 218660366,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1606980305
    },
    {
        "content": "<p>I've added a note to the beginning of the draft IG with a link to the Task spreadsheet.<br>\n<a href=\"https://build.fhir.org/ig/HL7/fhir-patient-correction/\">https://build.fhir.org/ig/HL7/fhir-patient-correction/</a></p>",
        "id": 218714859,
        "sender_full_name": "John Keyes",
        "timestamp": 1607011518
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"251396\">John Keyes</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218714859\">said</a>:</p>\n<blockquote>\n<p>I've added a note to the beginning of the draft IG with a link to the Task spreadsheet.<br>\n<a href=\"https://build.fhir.org/ig/HL7/fhir-patient-correction/\">https://build.fhir.org/ig/HL7/fhir-patient-correction/</a></p>\n</blockquote>\n<p>You are so collaborative!!  Such a team player!</p>",
        "id": 218716954,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1607012309
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"225094\">Debi Willis</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218636621\">said</a>:</p>\n<blockquote>\n<p>Part of a patient's rights (at least in the US) is to instruct the organization about who needs to be contacted concerning a correction in the chart. This is an important part of corrections so we want to address how to do that also. If I was denied insurance because of an error in my chart, I definitely want the org or notify the insurance company to set the record straight.</p>\n</blockquote>\n<p>This is an argument that we need to add Communication and CommunicationRequest to the IG.  Or at least, add a CommunicationRequest within a transaction bundle within Task.input.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218629625\">said</a>:</p>\n<blockquote>\n<p>Yeah, I would definitely remove 'Bob then requests that Southside Clinic notify his insurance company '</p>\n</blockquote>\n<p>Michele has a point, to the extent that Communication and CommunicationRequests are lower priority. Yet, if we're going to model the downstream communications mandated by HIPAA, then we need to include them.</p>",
        "id": 218733022,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1607019201
    },
    {
        "content": "<p>would seem this communication, which I agree is important, but I was expecting this to be patient-app side functionality. It does not seem to be critical to the workflow between the two actors we have.    At least it should be considered an optional flow, as I do expect most patient-app that chose to implement this IG will already have a mechanism for this communication with the patient.</p>",
        "id": 218734030,
        "sender_full_name": "John Moehrke",
        "timestamp": 1607019682
    },
    {
        "content": "<p>CommunicationRequest might be a little heavy - depends how much information we need to convey.  In terms of whether it should be the app or the provider that does the communication, it sort of depends who will have the mechanism to connect to the target and deliver it.  It could be either side.  For those situations where the provider can do it and the app can't, including that in the request is reasonable.</p>",
        "id": 218743365,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607024059
    },
    {
        "content": "<p>Also, whether we like it or not, data coming from the EHR is likely to be more trusted than data coming from a patient app.</p>",
        "id": 218743413,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607024089
    },
    {
        "content": "<p>Okay, I just updated the sequence diagram with all the latest knowledge I have about what has been discussed by all the stakeholders.  I've created a separate Zulip thread, where we can discuss particulars rather than bogging down this thread.  </p>\n<p><a href=\"/user_uploads/10155/hKXpLpo9TERWh4CJ2PT6EnZm/Patient-Corrections-.png\">Patient-Corrections-.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/hKXpLpo9TERWh4CJ2PT6EnZm/Patient-Corrections-.png\" title=\"Patient-Corrections-.png\"><img src=\"/user_uploads/10155/hKXpLpo9TERWh4CJ2PT6EnZm/Patient-Corrections-.png\"></a></div>",
        "id": 218751718,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1607028188
    },
    {
        "content": "<p>The patient will be making the request to the provider to communicate with the people identified by the patient. The patient will not be communicating directly with the people on the list. An example might be: \"Please let Dr. Spock (123 main street, mytown, USA) and AviationInsurance (<a href=\"mailto:patientservices@avi.org\">patientservices@avi.org</a>) know that you have corrected my chart to remove \"substance use disorder\" from my chart.\"</p>",
        "id": 218765720,
        "sender_full_name": "Debi Willis",
        "timestamp": 1607035573
    },
    {
        "content": "<p>Sure.  And if I have that provider's address is in a vCard or I'm fetching it via FHIR from Salesforce or Outlook?  Or have extracted it from my Apple HealthRecords?</p>\n<p>The patient may not be communicating directly with the downstream providers, but they may have the structured data on who to contact, and be sending that info along via a FHIR Person resource (rather than a text string or narrative text).</p>",
        "id": 218876584,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1607108248
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218734030\">said</a>:</p>\n<blockquote>\n<p>would seem this communication, which I agree is important, but I was expecting this to be patient-app side functionality. It does not seem to be critical to the workflow between the two actors we have.    At least it should be considered an optional flow, as I do expect most patient-app that chose to implement this IG will already have a mechanism for this communication with the patient.</p>\n</blockquote>\n<p>Just to clarify - this is not about communication with patient.  Its a request by the patient that the provider communicate the corrected record to others that the patient designates.</p>",
        "id": 219126991,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1607369582
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191678\">Abigail Watson</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218733022\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"225094\">Debi Willis</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218636621\">said</a>:</p>\n<blockquote>\n<p>Part of a patient's rights (at least in the US) is to instruct the organization about who needs to be contacted concerning a correction in the chart. This is an important part of corrections so we want to address how to do that also. If I was denied insurance because of an error in my chart, I definitely want the org or notify the insurance company to set the record straight.</p>\n</blockquote>\n<p>This is an argument that we need to add Communication and CommunicationRequest to the IG.  Or at least, add a CommunicationRequest within a transaction bundle within Task.input.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218629625\">said</a>:</p>\n<blockquote>\n<p>Yeah, I would definitely remove 'Bob then requests that Southside Clinic notify his insurance company '</p>\n</blockquote>\n<p>Michele has a point, to the extent that Communication and CommunicationRequests are lower priority. Yet, if we're going to model the downstream communications mandated by HIPAA, then we need to include them.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span>  I am confused when you say \"a transaction bundle within task.input\".  I thought is would just be an array of task.input values - no need for a transaction since its in task and no need for a bundle.  Also transaction is an operation so how would you put that in the task?  Could be a limit on my FHIR knowledge here - thanks.  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 219127346,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1607369736
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/project.20-.20patient.20corrections/near/218743365\">said</a>:</p>\n<blockquote>\n<p>CommunicationRequest might be a little heavy - depends how much information we need to convey.  In terms of whether it should be the app or the provider that does the communication, it sort of depends who will have the mechanism to connect to the target and deliver it.  It could be either side.  For those situations where the provider can do it and the app can't, including that in the request is reasonable.</p>\n</blockquote>\n<p>I agree - that's why I had it as a free text.  However, CommunicationRequest is also an option but I think both need to be supported.</p>",
        "id": 219127980,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1607370012
    },
    {
        "content": "<p>Hi.  ‘Transaction bundle’ is totally up for interpretation at this point and my shorthand for a few ideas.  So far, I’ve heard three main proposals... a) slicing the Task.input field, effectively making it typed, and adding resources or operation requests as an array; b) punting on the issue by putting a Bundle into Task.input, which is effectively a wildcard, or c) using Task.partOf and putting each operation request or resource into a sub-task.</p>",
        "id": 219127992,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1607370019
    },
    {
        "content": "<p>I’m open to any/all of the above, if somebody puts the effort into putting an implementation together to test it.</p>",
        "id": 219128101,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1607370089
    },
    {
        "content": "<p>Task.input is going to need to be sliced regardless - there are multiple inputs we'll need and the profile will need to distinguish them.  Going with sub-tasks would allow us to convey the status of each 'communication target' independently (e.g. I told Insurer A and Dr. Jones, but couldn't get hold of Insurer B and Dr. Smith isn't at that phone number any more).  Don't know if that's an essential thing to have sent discretely.  If a text blob in Task.note would suffice, then I'd avoid sub-tasks.  CommunicationRequest is tricky because if you're going to have a CommunicationRequest you need to be able to indicate what you want communicated - which is something that doesn't yet exist.  Also, technically, a CommunicationRequest is just an authorization for sharing, not a true 'request' to share.  So using it 'right' is probably going to be somewhat big and ugly.  That's why my leaning was to just use Task.input -either to list the individuals or to provide a text blob for that purpose.</p>",
        "id": 219151374,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607382431
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  there is still disagreement about the way to link disagreement to the initial request.  Vassil thinks it should go in Task.partof.  I think it should go in Task.partof or Task.basedon.  Lloyd says Task.input.  My logic - I think it is possible to do a bare bones unstructured request task with no inputs and that would be a feature for less sophisticated systems</p>",
        "id": 219442974,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1607588924
    },
    {
        "content": "<p>Also - do we need to look inside the DomainResource fields in task and profile those at all?</p>",
        "id": 219443013,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1607588957
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> The issue with putting it in Task.partOf is the state machine.  Once a Task is rejected, then defining something as 'part of' that Task or 'based on' that Task doesn't get you anywhere.  Also, 'based on' is about the chain of authorization, and we're not really talking about authorization when we say that Task B is a disagreement about information in the record that Task A was attempting to correct.  There's no 'standard' semantic in Task for that relationship, so I think you pretty much have to use either Task.input or an extension.</p>",
        "id": 219480518,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607611228
    },
    {
        "content": "<p>What is it in the state machine that prevents a secondary task to be partOf a previously rejected/completed Task? The main point is the \"disagreement\" step cannot take place without the previously rejected request, and a profile-required Task.partOf seems the obvious way to express that.</p>",
        "id": 219482598,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1607612159
    },
    {
        "content": "<p>My understanding is that if a Task is rejected, everything that's part of it is rejected.  That's not a 'hard' rule, but it's a pretty common expectation.  Also \"please flag my record as having a disagreement\" isn't really part of the action \"please fix this data\".</p>",
        "id": 219482868,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607612275
    },
    {
        "content": "<blockquote>\n<p>Also \"please flag my record as having a disagreement\" isn't really part of the action \"please fix this data\".</p>\n</blockquote>\n<p>\"please flag my record as having a disagreement\" is contingent on an existing rejected \"please fix this data\". It cannot exist on its  own.</p>",
        "id": 219483689,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1607612628
    },
    {
        "content": "<p>I'm not sure that's strictly true, but even if it is \"contingent on\" is not the same as \"part of\" or \"authorized by\".</p>",
        "id": 219484246,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607612856
    }
]