[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I wasn't confident during the meeting that I was correctly capturing your always-valuable perspective on this WG's place in the HL7 galaxy.  Please give feedback on what this should actually say in our minutes. I know I got this wrong:</p>\n<blockquote>\n<p>Part of the mandate of this WG is to let \"civilians\" engage in the standards process. A second part of the mandate is ... ... more meta? Making sure the right data gets to the right place, from the patient POV. \"Maximize the chances that the solution you come up with will be adopted and achieve the goal everyone wants\"</p>\n</blockquote>",
        "id": 198362105,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1590087752
    },
    {
        "content": "<p>One of our mandates is to help patients &amp; care-givers navigate the HL7 standards development world to engage with the piece of standards development they care most passionately about - even if that piece isn't necessarily something that's directly patient facing (e.g. device or drug approvals, public health reporting, insurer-to-insurer communications, etc).  Our second mandate is to specifically provide advice to (and sometimes lead) the development of standards where aspects of them <em>are</em> patient/care-giver facing.  Overall, what we're trying to do with standards the standards development process is maximize the set of diverse viewpoints that provide feedback during the development process to maximize the suitability, longevity, adoption and value that the resulting standard has.  Injecting the patient/caregiver perspective across the spectrum of the HL7 organization helps us do that.</p>",
        "id": 198363818,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590088589
    },
    {
        "content": "<p>Very clear!  Thanks.</p>",
        "id": 198367528,
        "sender_full_name": "Terrie Reed",
        "timestamp": 1590090581
    },
    {
        "content": "<p>Here's how I parsed and formatted that for the minutes. Same words, but easier to spot the concepts. Lloyd packs a lot in! <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> </p>\n<hr>\n<ul>\n<li>One of our mandates is to <strong>help patients &amp; care-givers navigate the HL7 standards development world </strong>to engage with the piece of standards development they care most passionately about - <em>even if that piece isn't necessarily something that's directly patient facing</em> (e.g. device or drug approvals, public health reporting, insurer-to-insurer communications, etc).</li>\n<li>Our second mandate is to specifically <strong>provide advice to (and sometimes lead) the development of standards</strong> <br>\nwhere aspects of them <strong>are</strong> patient/care-giver facing.</li>\n</ul>\n<p>Overall, what we're trying to do with the standards development process is</p>\n<ul>\n<li>maximize the set of diverse viewpoints that provide feedback during the development process...</li>\n<li>....to maximize the suitability, longevity, adoption and value that the resulting standard has.</li>\n</ul>\n<p>Injecting the patient/caregiver perspective across the spectrum of the HL7 organization helps us do that.</p>",
        "id": 198369428,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1590091379
    }
]