[
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> here's my list or what I want to see (for your human friendly article):</p>\n</blockquote>\n<p>Utterly innocent question, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> (or anyone):  how are these tasks not use cases?  Each is certainly \"something I need to do,\" hence a use case in one sense; but each of these seems to be tiny compared to use cases like \"Take care of my mother.\"</p>\n<p>Is there any conventional wisdom that has proven to be practically useful?</p>",
        "id": 166113840,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1558381458
    },
    {
        "content": "<p>Bump ... do these simple tasks qualify as \"use cases\" in any real sense, or would they be laughed out of the room?</p>",
        "id": 166736672,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1559062693
    },
    {
        "content": "<p>I'm not sure what the difference you are making is</p>",
        "id": 166756338,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559075445
    },
    {
        "content": "<p>as for being laughed out of the room... maybe some technical requirements people would want to argue about their exact description, but most people are pretty loose on this so no, not laughed on those grounds - only whether you think they make sense or not. Not everyone does</p>",
        "id": 166756399,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559075506
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , </p>\n<p>Re what qualifies as a 'use case' - </p>\n<blockquote>\n<p>maybe some technical requirements people would want to argue about their exact description, but most people are pretty loose on this</p>\n</blockquote>\n<p>Thanks! </p>\n<blockquote>\n<p>only whether you think they make sense or not. Not everyone does</p>\n</blockquote>\n<p>Do you mean whether it makes sense for patients to be collecting such data in the first place, or patients having any ability to do anything useful, or for HCPs to be involved with such folly, or ...?</p>",
        "id": 166760512,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1559078335
    },
    {
        "content": "<p>yes those kind of questions</p>",
        "id": 166760710,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559078484
    },
    {
        "content": "<p>Okay, so you're saying my use case may be \"well-formed\" and perhaps even \"valid\" in some sense, but some people will still think it's ludicrous? :-)</p>\n<p>Like, one might propose a ludicrous use case of \"Patient needs to escape with all known data within 3 hours after a dragon enters the room\"? :-)</p>",
        "id": 166760996,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1559078696
    },
    {
        "content": "<p>right. some people might not think they are a good idea. For various reasons. Do you think they are a good idea?</p>",
        "id": 166761122,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559078784
    },
    {
        "content": "<p>Oh, being provocative now, are we?  Hell YES it's a good idea - but I'd be happy to start wrestling about what \"good idea\" means!</p>\n<p>To me, a \"good idea\" is one that extends healthcare's ability to deliver results for the person who has a problem - including self-generated results.  Specimens include Kristina Sheridan's laborious pounding of an 18\" stack of PDF printouts into Excel, enabling new insights, and Larry Smarr's longitudinal analysis of his fecal microbiota (to which one doctor asked, \"Why are you doing this??\")   In each case the patient's contribution led to results the HCPs had not been able to achieve alone, and yes, I call that \"good,\" and would be happy to debate anyone who says it's not.</p>\n<p>Another specimen, from the opposite side of the patient&lt;-&gt;HCP membrane, is the late Michael Morris. He died last November, but that has nothing to do with it: per his talk at the apps event last summer, the dashboard he assembled by <em>combining data from his four different providers' Epics</em> created a useful new view that <em>had never before been available to ANY of them</em>.  I say that's good ... and note that it empowered <em>the physicians,</em> not just the patient. </p>\n<p>I could go on and on, but I'll just add one observation: note that if I understand correctly, FHIR enabled Morris to <em>solve his own problem</em> instead of whinging at the HCPs' IT staff to give him a custom feature nobody else might ever want. </p>\n<p>My message is always, per my TED Talk and my book, \"Let Patients Help.\" They cannot do that without access to the data, so yes, I say that well defined use cases for patient access are \"good.\"</p>\n<p>I know some people say \"Damn you patient, stay out of my way! I'm on a mission to do as I'm told!\" Yes, I understand. That mission is defective IMO and impeding the delivery of best possible care .... which is the only reason the system exists in the first place. \"Care\" like that has been corrupted by the parochial interests of their employers.</p>",
        "id": 166762130,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1559079507
    },
    {
        "content": "<p>I'll take that as a long 'yes' ;-)</p>",
        "id": 166765407,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559082212
    },
    {
        "content": "<p>Yeah, but seriously, we're both writing with the knowledge that others may read this later ... it ain't just our dialog, we hope it'll be part of the community.  </p>\n<p>And, seriously, some readers will be new to this whole subject of patient empowerment, so I opted to 'splain my thinking.</p>",
        "id": 166765748,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1559082472
    }
]