[
    {
        "content": "<p>\"Also, I've advocated in the past that we need reference patients with detailed medical histories that we can register in each of the EHR test systems, and I think this dovetails with that concern. If you actually go look at each of the test sandboxes, we'll see the Jason and Jessica Argonaut in Epic, we'll see Nancy SMART and family in Cerner; the Society of Imaging Informatics in Medicine has the Siim family, and so forth.\" - said by <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> </p>\n<p><span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span> <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span>  <span class=\"user-mention\" data-user-id=\"192825\">@Jeffrey Danford</span> <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> @kevin - This doesn't sound that hard to do and would be really useful for the patient apps that are aggregating data - could the EHRs create this?  The idea is for all of the EHR Sandboxes to have information about the same set of patients, emulating a realworld scenario where a patient has visits at multiple providers which use different EHRs.  Would be good for Argonaut as well as for CARIN.</p>",
        "id": 204044420,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1594874508
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> All the CARIN sandboxes should have information on the same patient - see the thread,</p>",
        "id": 204044475,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1594874560
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 204044521,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1594874638
    },
    {
        "content": "<p>I think the way to make this work is to define the patients and their medical history in technology independent ways. To provide these histories as FHIR resources is \"leading the witness\". But if we define the medical history in human readable terms, making clear what facts are important to record, then we also prove that each system gets really close to the same results. Some variation need to be allowed for, but the interoperable aspects that there are standards implementation guides for (e.g. FHIR US-Core, C-CDA, IPS, etc) should come out of each of these the same.</p>",
        "id": 204075550,
        "sender_full_name": "John Moehrke",
        "timestamp": 1594902301
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193069\">@David Kreda</span> I'm mentioning you here because your work on the Sync for Science \"Discovery\" app touches on the same needs, using SMART on FHR. Involved creation of a simulated-fragmented-across-multiple-providers SMART on FHIR data set, and tools for viewing a reassembled view.</p>",
        "id": 204090851,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1594909703
    },
    {
        "content": "<p>One option to look at is using the test data used for 2015-era ONC certification.  Since most EHRs will go through certification, at least some of their environments probably have those patients and associated data already - just maybe not the public sandboxes.</p>",
        "id": 204103101,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1594914654
    },
    {
        "content": "<p>Will future Inferno-based certification include such sample patients? <span class=\"user-mention\" data-user-id=\"197651\">@Reece Adamson</span></p>",
        "id": 204103423,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1594914793
    },
    {
        "content": "<p>Ideally, we would want this to be computable though, so that utilities like Inferno and Touchstone can leverage it.  Maybe we don't specify the FHIR resources, but if we specify the LOINC and SNOMED codes, then we can reasonably expect Observations, Procedures, and other resources built around those codes in a consistent way.</p>",
        "id": 204121541,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1594923231
    },
    {
        "content": "<p>I can't speak to future certification efforts, but the current Inferno tests are designed to allow systems to bring their own data.  That being said we do offer a standard set of data, and scripts to create your own unique set, which systems can load to meet the certification criteria.</p>\n<ul>\n<li>The exact set loaded into the reference server is <a href=\"https://github.com/inferno-community/inferno-reference-server/tree/master/us-core-r4-resources\">here</a></li>\n<li>The script that runs Synthea, down selects to a minimal set, and makes sure all the must-supports are covered is <a href=\"https://github.com/inferno-community/uscore-data-script\">here</a></li>\n<li>And a separate reference set created from that script is <a href=\"https://github.com/inferno-community/uscore-data-sets\">here</a></li>\n</ul>\n<p>Based on the discussion I don't think these resources are the solution, but they might be useful.  I do think its a really cool idea and would be useful!  Particularly showing resources fragmented across systems would be really cool IMO.  <span class=\"user-mention\" data-user-id=\"191381\">@Jason Walonoski</span> would probably be interested in this thread based on his experience with Synthea.</p>",
        "id": 204126994,
        "sender_full_name": "Reece Adamson",
        "timestamp": 1594925773
    },
    {
        "content": "<p>The idea is good but the hard part is coming up with the data set. Sandboxes are usually populated with a template used to create new internal testing system and the data in them is usually quite sparse. We've been looking at loading Synthea data on all our public R4 sandboxes. Is there a better (defined as more comprehensive and more realistic) set of data we should be looking into?</p>",
        "id": 204203206,
        "sender_full_name": "Jeffrey Danford",
        "timestamp": 1594991174
    },
    {
        "content": "<p>I think the ONC Cures-era question is more for the ONC-ATLs that will be <em>using</em> Inferno to certify EHRs rather than Inferno itself.  I believe for the MU3-era, the ONC-ATLs had the pre-defined set of patient data to use.  It was probably different data across the ONC-ATLs though.  However that might be good, as it would mean we'd have a few different data sets.</p>",
        "id": 204208175,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1594994007
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span>  I think Abigail had some ideas on the data, and perhaps we can find people to resource this if there is a non-techie friendly template!</p>",
        "id": 204237676,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1595008572
    },
    {
        "content": "<p>While there’s a clear usecase for using Synthea, the one concern that I have with that approach is that the data is statistically generated; so it can be difficult to ensure that a specific reference patient exists with specific conditions.  </p>\n<p>My personal take is that the issue at hand is essentially an issue of patient matching and longitudinal records; but it then is applicable to a bunch of other tasks.  For what I’ve been advocating for, I’d be more inclined to do something like take something like the ONC-ATL reference patients, give them to the Clinicians on FHIR and Patent Empowerment groups to develop out a detailed master longitudinal record for one (or a few) of patient(s) involved; and then figure out some way to break the record up into parts so that different groups can load up some portion of the record.  </p>\n<p>On the other hand, Synthea uses seeds to generate patients, and can ensure a consistent cohort of patients is generated; even if specific resources or not.  We might get some mileage out of selecting a specific reference city and seed value.  R4 resources using ‘Washington DC’ location and a seed of ‘12345’, for example.  Then vendors could use whichever pipeline they want; and we might get some semblance of repeatability and consistent patients.  </p>\n<p><span class=\"user-mention\" data-user-id=\"191381\">@Jason Walonoski</span> - Does the above match up to your understanding of how Synthea works?  Is there a way to force Synthea to use a specific patient across pipelines, so as to generate a longitudinal record?</p>",
        "id": 204299436,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1595076578
    },
    {
        "content": "<p>100% agree <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> although it's unclear what the solution is. Hey <span class=\"user-mention\" data-user-id=\"194138\">@Aaron Seib</span> <span class=\"user-mention\" data-user-id=\"222957\">@Dave Hill</span> : Who at MITRE was working on this at one of our past connectathons? Any progress you'd like to bring the group up to speed on?</p>",
        "id": 204319711,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1595109514
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span>  - which of Virginia's posts were you giving a 100 to?   Top of thread or yesterday's note to Abbie?</p>",
        "id": 204321834,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1595113546
    },
    {
        "content": "<p>Top of thread. We have been in need of real synthetic data for quite some time. Unclear to me what else is being recommended. Hoping others can chime in.</p>",
        "id": 204324587,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1595119030
    },
    {
        "content": "<p>many have tried. It is mostly a momentum problem. see the google simulated hospital - <a href=\"https://github.com/google/simhospital\">https://github.com/google/simhospital</a></p>",
        "id": 204422647,
        "sender_full_name": "John Moehrke",
        "timestamp": 1595252251
    },
    {
        "content": "<p>I like <span class=\"user-mention\" data-user-id=\"192825\">@Jeffrey Danford</span> idea of using Synthea data. One of the issues we are seeing is that different EHRs give us data in different ways. I would like to pull data from the same patient in each EHR sandbox to see where the data are the same/different. One example is device data. We are getting data that is in different formats. We can't really tell whether the data was entered wrong in the EHR or whether it was incomplete. Recently, we received COVID results in formats that are not standard. We could not tell if the data was not entered correctly in the EHR or if for some weird reason a COVID test was handled differently than any other positive/negative test. Having the same data in all sand boxes would enable app developers to more quickly identify problems in conformity. </p>\n<p>I know Abigail's objection was because she wanted a longitudinal record. Are there any other objections to using Synthea?</p>",
        "id": 204588255,
        "sender_full_name": "Debi Willis",
        "timestamp": 1595357973
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"225094\">Debi Willis</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/reference.20patients.20in.20EHR.20Fhir.20sandboxes/near/204588255\">said</a>:</p>\n<blockquote>\n<p>I would like to pull data from the same patient in each EHR sandbox to see where the data are the same/different.</p>\n</blockquote>\n<p>Oo oo!</p>",
        "id": 204655027,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1595418253
    },
    {
        "content": "<p>My concerns aren't so much an objection.  Happy to use Synthea if we can.  I'm just concerned that default settings of Synthea will produce statistical data and we won't be able to guarantee a consistent cohort of patients.  When we've tried doing this before with HAPI and Node servers, we wound up having to write a whole extra dashboard to do data validation because the data turned out a lot fuzzier than we expected.  It's not as simple as just 'use Synthea'.  A pipeline and settings file has to be defined to make this all happen.  </p>\n<p>I suspect that we'll need to turn off some of the statistical functionality, and have a more deterministic pipeline for this particular task.  Doable, but not Synthea's default config.</p>",
        "id": 204669761,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1595426745
    },
    {
        "content": "<p>using syntha simply to produce THE dataset, where everyone uses the same dataset, might address that problem. We leverage the benefit of syntha to generate pseudo data, so that we don't get people worried about 'real patient data', but we have a single dataset so that we can prove data quality for we know what we asked them to record for patient Martha.</p>",
        "id": 204692310,
        "sender_full_name": "John Moehrke",
        "timestamp": 1595436832
    },
    {
        "content": "<p>So how do we go about making that happen? It seems like it would also help the EHR vendors...they would not have to come up with the dataset AND there would be many people able to pull data into their apps to test consistency of format among the EHR vendors. (Which is the whole idea of standardization and interoperability.) Any ideas on how to get that moving among the EHR vendors? <span class=\"user-mention\" data-user-id=\"192825\">@Jeffrey Danford</span> Thanks for making that suggestion. Would Allscripts be able to do that to start the momentum?</p>",
        "id": 204730456,
        "sender_full_name": "Debi Willis",
        "timestamp": 1595457216
    },
    {
        "content": "<p>I think the problem is not technical. This thread has uncovered plenty of historic efforts to do this. I think the problem is motivation for the EHR (and PHR and registries) to be compelled to spend the energy entering the data set given into their system. This might be forced by government (ONC) -- aka \"stick\". I might recommend that the patient empowerment group could produce a campaign that makes this something the EHR vendors want to do -- aka \"carrot\". I don't know what that carrot is, but we would be far more capable of doing carrot things.</p>",
        "id": 204794897,
        "sender_full_name": "John Moehrke",
        "timestamp": 1595510013
    },
    {
        "content": "<p>Could the carrot be that they would be able to really test their conformance with a large group of 3rd party apps pulling in the same data from multiple EHRs? It would seem that this would benefit everyone.</p>",
        "id": 205065803,
        "sender_full_name": "Debi Willis",
        "timestamp": 1595794781
    },
    {
        "content": "<p>Carequality is moving down this path in that Implementers will be required to set up test environments (and test patients). Seems to align with the ask here, especially as the FHIR based exchange implemention guide comes into use</p>",
        "id": 205122741,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1595859726
    }
]