[
    {
        "content": "<p>Hello All, I have just been chatting to <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  who suggested I post my work in this community. Essentially my team and I have been working on framework for patient experience, which links all digital solutions with all the specific capabilities that hospitals / health systems require to improve the patient experience. It is well received, tested and validated and we have companies like Deloitte and Salesforce that are interested in partnering with the use of it. I am considering open-sourcing the meta IP, as an accesible 'standard' for implementing patient engagement/experience/empowerment technology solutions for the benefit of all health and care organisations around the world. I'd be keen to hear feedback on the idea and in what format, such as methodology would be useful to providers, governments and vendors. Any questions welcome, thank you.</p>",
        "id": 245139679,
        "sender_full_name": "Avnesh Ratnanesan",
        "timestamp": 1625643037
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"425493\">@Avnesh Ratnanesan</span> - I'm sorry you haven't gotten feedback here, and perhaps my reply will bump this up for some fresh attention.</p>\n<p>I'm not a technical person, so I have to confess that I have no idea what you mean by \"framework for patient experience.\"  Are you talking about something conceptual or intellectual, or a technology platform for capturing patient experience data?</p>\n<p>Do you have a definition of patient experience?  </p>\n<p>Well received by whom?  Validated against what? </p>\n<p>I fear that without understanding these specifics, you may have had no response because nobody was sure what you're even talking about :-)</p>\n<p>Is there a website where any of this work is presented or discussed??</p>",
        "id": 245759961,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1626130222
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> , thanks for your reply. You may not recall, we did meet once a few years when you presented a talk at HISA in Sydney and I interviewed you briefly - I think I've got the video somewhere! </p>\n<p>With regards to your great questions, I've added more information here and website references. I was careful not to appear self-promoting, as that is not the intent of this discussion, and we are open to providing free licenses/open-sourcing the IP as part of this forum, and work out how to do it.  </p>\n<ol>\n<li>\n<p>The framework for patient experience is known as the 6e Methodology. It started off as a concept, which was well received then validated through education and training programs to healthcare managers in Australian hospitals since 2017. There's some high-level info on this methodology here <a href=\"https://energesse.com/training/\">https://energesse.com/training/</a></p>\n</li>\n<li>\n<p>Then since 2018/19, we began implementing the framework into an online technology platform, which can do a diagnostic of a hospitals capabilities in improving the patient experience and provide decision-support recommendations. 15 hospitals underwent trials using the product and we have some case studies recorded. We have a White Paper on this here (first button on the page for a free download) if anyone is interested. <a href=\"https://energesse.com/white-papers/\">https://energesse.com/white-papers/</a></p>\n</li>\n</ol>\n<p>The data hierarchy for the diagnostic uses the 6e's as the first tier of domains, and breaks this analysis into 21 sub-domains, based on evidence-based practices. More info on that here <a href=\"https://energesse.com/patient-experience-maturity-evaluation-pxme/\">https://energesse.com/patient-experience-maturity-evaluation-pxme/</a></p>\n<ol start=\"2\">\n<li>The definition of the patient experience that we typically refer to is the one from The Beryl Institute, i.e. \" we define the patient experience as the sum of all interactions shaped by an organization's culture that influence patient perceptions across the continuum of care \".</li>\n</ol>\n<p>I'd be happy to share more info on detailed case studies, etc in an off-line chat if anyone is interested in discussing this further. </p>\n<p>Hope this is helpful,</p>\n<p>Avi</p>",
        "id": 245929724,
        "sender_full_name": "Avnesh Ratnanesan",
        "timestamp": 1626249246
    },
    {
        "content": "<p>Hey there - that sounds interesting.  Our workgroup meets on Thursdays at 1PM - perhaps you would like to visit us: <a href=\"https://confluence.hl7.org/display/PE/Patient+Empowerment+Home\">https://confluence.hl7.org/display/PE/Patient+Empowerment+Home</a></p>",
        "id": 247778637,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1627695609
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"425493\">@Avnesh Ratnanesan</span> I have been absent from zulip for months, for a number of reasons, so I apologize for not further replying. </p>\n<p>Your subject is of great interest to me so I hope to read and respond this weekend when I’m off phone and back at computer. </p>\n<p>It’s great to know we connected at that event! My memory for people I’ve met is woefully inadequate.</p>",
        "id": 253890896,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1631995884
    },
    {
        "content": "<p>I clicked your link for the high level info and immediately I need info that not so high level:)</p>\n<p>What do you mean when you say it’s been validated?</p>",
        "id": 253891091,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1631996132
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191531\">Virginia Lorenzi</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Setting.20a.20standard.20for.20patient.20experience.2F.20engagement/near/247778637\">said</a>:</p>\n<blockquote>\n<p>Hey there - that sounds interesting.  Our workgroup meets on Thursdays at 1PM - perhaps you would like to visit us: <a href=\"https://confluence.hl7.org/display/PE/Patient+Empowerment+Home\">https://confluence.hl7.org/display/PE/Patient+Empowerment+Home</a></p>\n</blockquote>\n<p>HI <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> Thanks for the invite, I may join in a few weeks, I've got a couple of immediate deadlines and will revert in due course - really appreciate it!</p>",
        "id": 253908439,
        "sender_full_name": "Avnesh Ratnanesan",
        "timestamp": 1632016549
    },
    {
        "content": "<p>HI Dave</p>\n<p>I'm emailing you outside of Zulip as I also have not been in there for many<br>\nweeks, email is better for me. I found the video of our conversation from a<br>\nfew years ago, so am sharing that here also.<br>\n ePatient Dave &amp; Dr Avi on Internet Health Info.MOV<br>\n&lt;<a href=\"https://drive.google.com/file/d/1PImWWC435Kux4KMMuJGg_OQcTQ-ECd05/view?usp=drive_web\">https://drive.google.com/file/d/1PImWWC435Kux4KMMuJGg_OQcTQ-ECd05/view?usp=drive_web</a>&gt;</p>\n<p>It would be good to jump on a quick Zoom call if you're open to that, and<br>\ncan share more info, rather than a short Zulip message. If you're open to<br>\nthat, do let me know and Joanna can help us schedule a time, based on where<br>\nyou're located.</p>\n<p>Look forward to it!</p>\n<p>Be well, do good</p>\n<p><em>Dr. Avnesh Ratnanesan (Avi)</em>*Founder &amp; CEO, Energesse *\nT:   +61 2 8091 0918 (AUS)<br>\nT:   +1 213 814 4194 (USA)<br>\nM: +61 438 614 233<br>\nW: <a href=\"http://www.energesse.com\">www.energesse.com</a></p>\n<p>*Leading Digital Health Solutions *\nPandemic Preparedness &amp; Risk Management I Customer &amp; Patient Experience I<br>\nWellbeing</p>\n<p><em>___________________________________________</em><br>\nThis e-mail (and any attachments) is for the exclusive use of the person or<br>\ncorporation to which it is addressed and may contain information that is<br>\nprivileged, confidential or protected by copyright.  If you are not the<br>\nintended recipient of this e-mail kindly notify us immediately and then<br>\ndestroy the original transmission of this e-mail. You are notified that any<br>\nuse, disclosure, distribution, printing or copying is prohibited by law,<br>\nand that the contents must be kept confidential.</p>\n<p>Copyright © 2021 Energesse. All Rights Reserved</p>",
        "id": 253908761,
        "sender_full_name": "Avnesh Ratnanesan",
        "timestamp": 1632016900
    }
]