[
    {
        "content": "<p>for the devdays hackathon, our team explored some ideas around choosing new providers and providing them with medical history.<br>\none of the ideas we had is particularly simple technically but I personally think could make a suprisingly big difference (in the long run).  first, I wanted to get this community's opinion on whether its worth trying to bring this forward to someone that can do something about it...</p>\n<p>One aspect of the CMS rule for the 21s century cures act is that \"under this rule, MA organizations, Medicaid FFS programs, CHIP FFS programs, Medicaid managed care plans, and CHIP managed care entities are required to make provider directory information available via the Provider Directory API. This API must be accessible via a public-facing digital endpoint on the payer’s website. To facilitate this, we link to the DaVinci PDEX Plan Net IG\"</p>\n<p>So here is the idea:  what if, as part of these provider directories, insurers would provide not just the name, location, contactinfo, and \"accepting new patients\" status of each provider, but also \"whether they support electronic interchange of health information\"?  is anyone doing this yet?  has anyone considered it?  is it worth pursuing?</p>",
        "id": 201386660,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592572050
    },
    {
        "content": "<p>these kinds of connections are indeed very helpful, and they have been a regulatory focus. The DaVinci implementation guide you linked to includes information about fhir endpoints that provider might have: <a href=\"http://hl7.org/fhir/us/davinci-pdex-plan-net/2020Feb/StructureDefinition-plannet-Endpoint.html\">http://hl7.org/fhir/us/davinci-pdex-plan-net/2020Feb/StructureDefinition-plannet-Endpoint.html</a> (linked from Organization)-- would be good to understand what you see as the gaps.</p>",
        "id": 201387553,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592572483
    },
    {
        "content": "<p>thanks josh.  I havn't been much involved with provider directory stuff, just \"joined\" that community this last connectathon and so my knowledge is pretty limited.  i had seen the Endpoint profile but definitely havn't worked with it yet.  will check it out and come back.</p>",
        "id": 201387949,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592572651
    },
    {
        "content": "<p>for our hack project, we took the pdex plan-net reference implementation and added these fields so that when you search for providers, you see:</p>\n<ol>\n<li>are they accepting new patients (part of the spec already)</li>\n<li>do they support patient access apis</li>\n<li>do they support patient upload of information (which has the furthest to go it seems); and</li>\n<li>do they support receiving clinical information from the insurer</li>\n</ol>",
        "id": 201388077,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592572705
    },
    {
        "content": "<p>think its possible to get 2, 3, and 4 from this Endpoint profile?</p>",
        "id": 201388348,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592572854
    },
    {
        "content": "<p>i guess that might be <a href=\"https://build.fhir.org/ig/HL7/VhDir//StructureDefinition-endpoint-usecase.html\">https://build.fhir.org/ig/HL7/VhDir//StructureDefinition-endpoint-usecase.html</a></p>",
        "id": 201388384,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592572879
    },
    {
        "content": "<p>oh cool, in the latest draft they've made this an extensible binding to <a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/ValueSet-EndpointUsecaseVS.html\">https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/ValueSet-EndpointUsecaseVS.html</a></p>",
        "id": 201389789,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592573485
    },
    {
        "content": "<p>I'm very interested in the ability to see which providers actively practice interop!  </p>\n<p>At the Society for Participatory Medicine we've long envisioned enabling consumer choice by somehow letting participatory practices identify themselves.  If this info became available by API it could be mashed into things like HealthGrades listings.  See for instance their Patient Safety and Patient Experience awards, which leverage data published elsewhere. <a href=\"https://www.healthgrades.com/quality/patient-safety-patient-experience\">https://www.healthgrades.com/quality/patient-safety-patient-experience</a></p>\n<p>(HCAHPS is notoriously weak as a measure of reality; that's not my point - it's that when data becomes available, it can be used, and it enables consumer choice, <em>which rewards practices who do it.</em> And I think that's what we want to do.)</p>",
        "id": 201389808,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592573494
    },
    {
        "content": "<p>I'm pretty sure <span class=\"user-mention\" data-user-id=\"311763\">@Morgan Gleason</span> and <span class=\"user-mention\" data-user-id=\"311598\">@Bray Patrick-Lake</span> would shout \"HECK YES!\" (at least) to the idea of being able to search for providers based on whether they willingly accept existing health records. </p>\n<p>Of course for cases as complex as theirs it will take years before that vision is fully recognized. Doesn't matter.  For much simpler cases there will be an advertising advantage to providers who have some sort of \"No clipboard required!\" badge.</p>",
        "id": 201390432,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592573818
    },
    {
        "content": "<p>so, to me, the only potential \"gap\" in the current IG might be a patient-focus on the endpoint use case valueset.<br>\nI'm actually not actually sure how i'd express those 3 datapoints from above using the valueset</p>",
        "id": 201390437,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592573823
    },
    {
        "content": "<p>What do other countries think about this??  I know the world is different outside the perverse US money-based system, so I wonder if this would be attractive there.</p>",
        "id": 201390460,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592573837
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> <a href=\"https://dashboard.healthit.gov/datadashboard/documentation/ehr-products-mu-attestation-data-documentation.php\">https://dashboard.healthit.gov/datadashboard/documentation/ehr-products-mu-attestation-data-documentation.php</a> gives you another perspective on this information, showing you for each provider which electronic health record tool they have adopted, which in turn gives you a view onto their capabilities for sharing it with patients.</p>",
        "id": 201390490,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592573858
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  Can we prototype what sort of display could be created using that info?</p>",
        "id": 201390731,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592573953
    },
    {
        "content": "<blockquote>\n<p>so, to me, the only potential \"gap\" in the current IG might be a patient-focus on the endpoint use case valueset. I'm actually not actually sure how i'd express those 3 datapoints from above using the valueset</p>\n</blockquote>\n<p>I think (2) from your list is basically the presence of an endpoint with an appropriate code (it would be good to clarify whether the \"patient requested\" code is the right one for this, or a new code is needed, because it's not an obvious fit for me).</p>\n<p>(3) with respect to uploads, I suppose you could try to look at the capability statement you find for the endpoint you discovered in step 2. Of course in practice the answer is simply no they don't support it :-) there's currently no regulatory mandate for this. For (4) oh boy, I'm really not aware of an existing workflow that would even cause this information flow to happen without provider involvement; don't know that I would focus automated discovery for this piece yet, but maybe I'm missing something here.</p>",
        "id": 201390901,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592574036
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  I gotta run, but that looks like the kind of data someone like the NPWF would like to plunder, consistent with their excellent <a href=\"http://getmyhealthdata.org\">Get My Health Data</a> resource site.</p>",
        "id": 201390934,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592574055
    },
    {
        "content": "<p>That site btw is where I first blogged <a href=\"http://getmyhealthdata.org/2015/08/17/open-a-big-dam-spigot-data-about-me/\">I want a health data spigot</a>, which has become my social media avatar<br>\n<a href=\"user_uploads/10155/nA3Zs2l5HmLy2dB8i5H3PKd9/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"user_uploads/10155/nA3Zs2l5HmLy2dB8i5H3PKd9/image.png\" title=\"image.png\"><img src=\"user_uploads/10155/nA3Zs2l5HmLy2dB8i5H3PKd9/image.png\"></a></div>",
        "id": 201390992,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592574082
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span>  Can we prototype what sort of display could be created using that info?</p>\n</blockquote>\n<p>Someone could, sure. They have a bunch of CSV files. The last time I looked into this I had a very particular goal in mind, with respect to finding API documentation.</p>",
        "id": 201390998,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592574089
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Suggesting.20new.20extensions.20for.20provider.20directories/near/201390992\">said</a>:</p>\n<blockquote>\n<p>That site btw is where I first blogged <a href=\"http://getmyhealthdata.org/2015/08/17/open-a-big-dam-spigot-data-about-me/\">I want a health data spigot</a>, which has become my social media avatar</p>\n</blockquote>\n<p>Now I'm starting to wonder if the time has come to propose a future Golden Spigot award, for achievement in \"tapping into\" a patient's data sources and just letting it flow.</p>",
        "id": 201391406,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592574248
    },
    {
        "content": "<blockquote>\n<p>(3) with respect to uploads, I suppose you could try to look at the capability statement you find for the endpoint you discovered in step 2. Of course in practice the answer is simply no they don't support it :-) there's currently no regulatory mandate for this.</p>\n</blockquote>\n<p>yes, aware of this, but this is where we'd like to get to eventually, right?  like for \"consumer-directed data exchange\" we need to be able to actually share it back to the providers in a way it can be trusted, right?</p>",
        "id": 201391496,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592574300
    },
    {
        "content": "<p>Oh we totally need to make progress here, but I don't think <em>discovery</em> of which endpoints support this capability is the hard or important part. The important part is getting more endpoints to support it, and learning from that experience. when we've got something that actually works, mandating that providers publishe the endpoints becomes feasible.</p>",
        "id": 201392105,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592574543
    },
    {
        "content": "<p>i guess the \"idea\" here is what Dave was saying:  if we can make visible which providers DO support it, we can maybe help to drive the demand?</p>",
        "id": 201392332,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592574623
    },
    {
        "content": "<p>like it would be cool to get things to where we don't need a national mandate to deliver what people want</p>",
        "id": 201392454,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592574677
    },
    {
        "content": "<blockquote>\n<p>(4) oh boy, I'm really not aware of an existing workflow that would even cause this information flow to happen without provider involvement; don't know that I would focus automated discovery for this piece yet, but maybe I'm missing something here.</p>\n</blockquote>\n<p>not saying there would be no provider involvement and really not even sure if there's an appetite for this, was just thinking that with things like DaVinci PDEX / CDEX, it should be technically feasible.  perhaps in some use cases having a billing-centric history of the patient will be better than having no history at all?</p>",
        "id": 201392611,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592574755
    },
    {
        "content": "<p>But today does anyone? Has anybody had a good experience using some kind of automated API for this purpose? I think we're too early to put the emphasis on Discovery. But I'm happy to be proven wrong :-)</p>",
        "id": 201392668,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592574783
    },
    {
        "content": "<p>anyway, maybe the 3 I mention aren't the right ones to expose in the provider directory, but then what are the right ones?  i'm looking for what would make sense to the patient to say \"this provider can get your medical records from your other providers/you/somewhere else without you physically providing them or faxing them stuff\"</p>",
        "id": 201392689,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592574792
    },
    {
        "content": "<p>I would focus on patient access as the real win. Describing other business practices of providers is super hard; for one thing, you need to figure out how to describe practices that don't involve these endpoints at all, like looking update about you and commonwell or Care quality. I think it's a question of focus for us.</p>",
        "id": 201393069,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592574967
    },
    {
        "content": "<p>If we had a great way to figure out who's accepting new patients and who gives you your data through an API, that would feel like a win.</p>",
        "id": 201393138,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592575004
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Suggesting.20new.20extensions.20for.20provider.20directories/near/201392668\">said</a>:</p>\n<blockquote>\n<p>But today does anyone? Has anybody had a good experience using some kind of automated API for this purpose? I think we're too early to put the emphasis on Discovery. But I'm happy to be proven wrong :-)</p>\n</blockquote>\n<p>Chicken-egg error!  Information that drives consumer choice <em>is</em> used by some people, though I don't have time to go dig out specifics.  One source that's been funded by large employers for years is Leapfrog Group's <a href=\"http://hospitalsafetygrade.com/\">Hospital Safety Grade</a>, which munges and munches safety data reported to CMS.  I <a href=\"https://participatorymedicine.org/epatients/2012/11/new-hospital-safety-score-data-a-key-enabler-for-informed-choice.html\">dug into it and blogged</a> when they first started publishing in 2012.</p>",
        "id": 201393153,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592575010
    },
    {
        "content": "<p>It was amusing at first to see people with low grades complain about having no factual basis, until it was pointed out to them that it was a summary of their own data as reported to CMS. :-)</p>",
        "id": 201393283,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592575077
    },
    {
        "content": "<p>But I think you're missing my point. There is a chicken-and-egg problem is about <em>support</em>, not discovery. Support is about providers offering a service and patients using it (or for that matter, patients demanding a service and providers coming around). Scalable Discovery only matters later.</p>",
        "id": 201393380,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592575106
    },
    {
        "content": "<p>Importantly, these grades have driven real improvement.  If you want, I can dig that out.</p>",
        "id": 201393394,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592575116
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Suggesting.20new.20extensions.20for.20provider.20directories/near/201393380\">said</a>:</p>\n<blockquote>\n<p>But I think you're missing my point. There is a chicken-and-egg problem is about <em>support</em>, not discovery, it is about providers offering a service and patients using it. Scalable Discovery only matters later.</p>\n</blockquote>\n<p>I gotta run (as I said 20 minutes go :-)) but indeed I seem to not be understanding. Say more about support, please, and I'll be back later.  (Yell if I don't respond.)</p>",
        "id": 201393515,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592575177
    },
    {
        "content": "<blockquote>\n<p>If we had a great way to figure out who's accepting new patients and who gives you your data through an API, that would feel like a win.</p>\n</blockquote>\n<p>totally agree.  and i see it happening which is amazing (in no small part thanks to your amazing efforts).  not detracting from that.  just saying that I don't think that solves the \"how does a new provider get my medical history\" part of it.  i know there's tons of work done in that space with HIEs and whatnot, just wondering how we can expose \"does this provider support it\" level info so that patients can factor that in when they chose a provider</p>",
        "id": 201393526,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592575180
    },
    {
        "content": "<p>Yeah, we just need to be realistic about which methods are actually relevant for people making decisions. Today participating in some of these Nationwide exchanges is probably the most relevant way that information is flowing, even though there's plenty I don't love about it. Tell me another actual kind of information flow that is happening today that patients should care about, and we can talk about how to surface details about it.</p>",
        "id": 201394146,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592575429
    },
    {
        "content": "<p>I hate to get philosophical or negative here; I think this is super important and I just want to make sure we are putting in effort in places where it is going to pay off. I think we need to first show that the technology works, and then try to make it easy for people to learn who supports the technology. (Otherwise we risk requiring people to fill out a bunch of forms and publishing a bunch of checbox data that's going to be trivial or meaningless.)</p>",
        "id": 201394415,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592575556
    },
    {
        "content": "<p>That's roughly what I mean by support and then discovery.</p>",
        "id": 201394480,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592575573
    },
    {
        "content": "<blockquote>\n<p>Today participating in some of these Nationwide exchanges is probably the most relevant way that information is flowing</p>\n</blockquote>\n<p>how do we indicate that a provider pariticipates in an exchange and can pull your records from there?</p>",
        "id": 201394756,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592575692
    },
    {
        "content": "<p>note:  I'm <em>not</em> trying to define any Endpoint in this case.  just trying to indicate to the patient that this provider can [at least potentially] get your history</p>",
        "id": 201394896,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592575773
    },
    {
        "content": "<p>Fair enough; I just think that winds up being true for everyone. Once you put in all the caveats and qualifications.</p>",
        "id": 201395024,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592575818
    },
    {
        "content": "<p>that is an interesting comment...maybe my understanding of the problem is wrong.  i was under the impression that its pretty rare for someone to visit a provider and have that provider say \"we were able to pull your medical history from the exchange so no need for you to go get it from your previous providers and bring it to us\"</p>",
        "id": 201395607,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592576080
    },
    {
        "content": "<p>or i guess thats why you mean by \"caveats and qualifications\"</p>",
        "id": 201395690,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592576116
    },
    {
        "content": "<p>anyway, this has been a great convo, thanks!  I think we both agree on one thing which is that plan-net should be more clear about how to indicate whether a provider supports patient access apis...although hopefully soon that will be most if not all too :-)</p>",
        "id": 201395975,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592576261
    },
    {
        "content": "<p>my biggest concern on that one is that I have some concern with the payers' ability (and motivation) to meaningfully track that piece of info</p>",
        "id": 201396107,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592576318
    },
    {
        "content": "<p>any ideas there?</p>",
        "id": 201396137,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592576331
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191676\">Lee Surprenant</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Suggesting.20new.20extensions.20for.20provider.20directories/near/201396137\">said</a>:</p>\n<blockquote>\n<p>any ideas there?</p>\n</blockquote>\n<p>How would we approach a federated provider directory, where the information from, for example, <a href=\"https://carequality.org/active-sites-search/\">Careequality</a> is integrated and available in the payer's API? And yes, today, getting your existing medical history to a new provider is done by getting it from the previous providers who have treated you.</p>",
        "id": 201398264,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1592577370
    },
    {
        "content": "<blockquote>\n<p>how to indicate whether a provider supports patient access apis</p>\n</blockquote>\n<p>It is simple: if your provider is in <a href=\"https://open.epic.com/MyApps/Endpoints\">https://open.epic.com/MyApps/Endpoints</a> patient access APIs are accessible and usable, if the provider is not on that list they are unavailable or very very hard to connect to</p>",
        "id": 201399887,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1592578137
    },
    {
        "content": "<p>Cool link, wasn't aware of that one.  But no other vendors supported argonaut?</p>",
        "id": 201410941,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592583159
    },
    {
        "content": "<p>I did a quick analysis and I think this list has more than 100 providers that aren't on that one:  <a href=\"https://support.apple.com/en-us/HT208647\">https://support.apple.com/en-us/HT208647</a></p>",
        "id": 201411208,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592583277
    },
    {
        "content": "<p>Yes, but those are Apple-specific connections. Does not mean that any app can connect to those</p>",
        "id": 201412219,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1592583816
    },
    {
        "content": "<p>so yes, there are other available end points besides the ones in the Epic list - but you have to find them and then convince whoever controls them to give you access - both things that are very (very) hard</p>",
        "id": 201412412,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1592583917
    },
    {
        "content": "<p>These lists of Apple-only and Epic-only (and Fitbit-only) people are anathema. We are about interop!!!</p>\n<p>Or am I misunderstanding?</p>",
        "id": 201433306,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592596285
    },
    {
        "content": "<p>The Epic list is not Epic-only - those are end points of Epic systems that anyone can connect to</p>",
        "id": 201433853,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1592596657
    },
    {
        "content": "<p>The Apple list on the other had is what Apple can connect to - other cannot (in general)</p>",
        "id": 201433955,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1592596714
    },
    {
        "content": "<blockquote>\n<p>We are about interop!!</p>\n</blockquote>\n<p>Others aren't</p>",
        "id": 201433991,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1592596741
    },
    {
        "content": "<blockquote>\n<p>These lists of Apple-only and Epic-only (and Fitbit-only) people are anathema. We are about interop!!!</p>\n<p>Or am I misunderstanding?</p>\n</blockquote>\n<p>I think you are misunderstanding, or at least we disagree :-) Today the widest interoperability we have is through standardized, interoperable APIs where access control is partitioned by vendor. As such, those vendors are able to publish <strong>authoritative lists</strong> describing the endpoints in their network, allowing others to the discover, connect, and build on top. Indeed, anyone can take these independent endpoint lists and compile them into an  aggregated list, but the secret is that for this to be successful you need to actually add value (making sure it stays up to date with the sources with very little lag, reconciling any formatting difference is, annotating with additional data, etc). ONC is requiring more publication at the vendor level, and maybe once there's more than a few lists to scrape, aggregating content will become a more attractive proposition. But again, discovery is not the hard part. Today everyone who actually has a wide network has made it discoverable. The problem is that most have no network.</p>",
        "id": 201446762,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592605643
    },
    {
        "content": "<p>So, <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> , perhaps indeed I'm misunderstanding, which would be great!   As someone not steeped at all in the technology nor the commercial world, dialog with people like you is invaluable to me. </p>\n<p>I think I hear you saying that each vendor is publishing its own directory of <strong>things it knows about and/or has vetted,</strong> which is not at all an exclusive list of things it will talk to.  Am I hearing that correctly?</p>",
        "id": 201449744,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592608846
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Suggesting.20new.20extensions.20for.20provider.20directories/near/201393380\">said</a>:</p>\n<blockquote>\n<p>But I think you're missing my point. There is a chicken-and-egg problem is about <em>support</em>, not discovery. Support is about providers offering a service and patients using it (or for that matter, patients demanding a service and providers coming around). Scalable Discovery only matters later.</p>\n</blockquote>\n<p>Okay, I'm back as promised, but I'm done for today (for this week!) so for now I'm just saying I need more tutorial and maybe  we should take this off-list (or at rename it!).</p>",
        "id": 201449871,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592609004
    },
    {
        "content": "<p>Let's take off-list (happy to chat 1:1 next week)! Have a great weekend.</p>",
        "id": 201451426,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592610685
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> I would like to help make an interop \"badge\" happen as early as next year, rather than years from now. It is long overdue and institutions (not just practices) being formally branded as interop is a logical next step in the evolution of FHIR - as well as raising public awareness of the benefits to them of FHIR data that they can actually get at.  I really like <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> starting point of <em>\"If we had a great way to figure out who's accepting new patients and who gives you your data through an API, that would feel like a win.\"</em></p>",
        "id": 201452781,
        "sender_full_name": "Hamish MacDonald",
        "timestamp": 1592612270
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Suggesting.20new.20extensions.20for.20provider.20directories/near/201390460\">said</a>:</p>\n<blockquote>\n<p>What do other countries think about this??  I know the world is different outside the perverse US money-based system, so I wonder if this would be attractive there.</p>\n</blockquote>\n<p>Yes, needs to be global mark / badge / cert. I can speak for the APAC region that I know of no such effort (unsurprisingly).</p>",
        "id": 201454180,
        "sender_full_name": "Hamish MacDonald",
        "timestamp": 1592614031
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191676\">Lee Surprenant</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Suggesting.20new.20extensions.20for.20provider.20directories/near/201392689\">said</a>:</p>\n<blockquote>\n<p>anyway, maybe the 3 I mention aren't the right ones to expose in the provider directory, but then what are the right ones?  i'm looking for what would make sense to the patient to say \"this provider can get your medical records from your other providers/you/somewhere else without you physically providing them or faxing them stuff\"</p>\n</blockquote>\n<p>What you said here about \"<em>this provider can...without you...</em>\" sounds something like \"<strong>FHIR Smart</strong>\"    (Too close to SMART on FHIR?). In any case, something that is easy to riff and encapsulates what Provider X does for you regarding your data will be needed. This thingy is going to need patient adoption, so it needs to be \"adoptable\".</p>",
        "id": 201455313,
        "sender_full_name": "Hamish MacDonald",
        "timestamp": 1592615642
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"297690\">@Hamish MacDonald</span>, welcome <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 201455758,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592616465
    },
    {
        "content": "<p>Worth noting - Almost all providers already have a basic path to accept patient information via Direct messaging, given that technology was mandated by MU2</p>",
        "id": 201545484,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1592761985
    },
    {
        "content": "<p>Not the perfect solution but definitely a broadly available technology to accomplish the end goal (that very few PHRs are currently utilizing)</p>",
        "id": 201545500,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1592762030
    },
    {
        "content": "<p>FYI I raised the <code>how to properly represent patient access endpoints in PDEX-plan-net?</code> at <a href=\"#narrow/stream/229922-Da.2BVinci.2BPDex.2BPlan-Net/topic/Exposing.20patient.20access.20endpoints\">https://chat.fhir.org/#narrow/stream/229922-Da.2BVinci.2BPDex.2BPlan-Net/topic/Exposing.20patient.20access.20endpoints</a></p>",
        "id": 201614422,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1592837102
    }
]