[
    {
        "content": "<p>Apparently the board didn't get this on their agenda.  My leaning is to proceed with registering as a work group and see how the process goes.  So I guess we now do beat the bushes.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> is this an appropriate time to make a post on <a class=\"stream\" data-stream-id=\"179240\" href=\"/#narrow/stream/179240-Announcements\">#Announcements</a> and reach out to the co-chair list?  We're looking for several more members to sponsor and one more to act as a co-chair.</p>",
        "id": 172069984,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564516033
    },
    {
        "content": "<p>board discussion was relatively opposed to making it a WG, and rather it be a taskforce. I don't think it matters either way for what we're proposing. Austin suggested yesterday to make a TSC chartered task force, and we (Wayne, Austin and I) are looking into that</p>",
        "id": 172070100,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564516133
    },
    {
        "content": "<p>Task force has no ability to be responsible for content, has no authority to sponsor or co-sponsor projects.  I think that's problematic</p>",
        "id": 172070417,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564516406
    },
    {
        "content": "<p>what content is envisaged?</p>",
        "id": 172070556,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564516488
    },
    {
        "content": "<p>They would presumably have ownership of a few pages in the FHIR core specification.  They might also own informative specs governing behavior for patient-facing apps</p>",
        "id": 172071186,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564516878
    },
    {
        "content": "<p>US Realm is the only task force we have that can actually <em>do</em> anything - and the fact that it's a taskforce and not a WG often acts as handcuffs that get in the way.  That doesn't seem like a wise way to start out.</p>",
        "id": 172071294,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564516929
    },
    {
        "content": "<p>US Realm needs to have 'tight-ish' rules around who gets a say.  But it's not obvious that the same holds for Patient.</p>",
        "id": 172071347,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564516970
    },
    {
        "content": "<p>If we can find the members to qualify as an official work group, that seems the most useful thing to do/be</p>",
        "id": 172071387,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564517002
    },
    {
        "content": "<p>making it a task force doesn't preclude it becoming a WG in the long term but it does get things going quickly. Which is better than getting mired in counter-productive procedural arguments that don't relate to anything of interest to this group</p>",
        "id": 172071724,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564517246
    },
    {
        "content": "<p>If it starts as a task force, the hurdle to becoming a full work group becomes steeper.  Rather than just being evaluated on its merits as an application to form a new work group, there's now a question of transformation - and a need to answer questions around pressing needs for change.  I don't understand why we feel a task force is going to be faster.  And I don't really understand the push-back against it being a work group.</p>",
        "id": 172072601,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564517850
    },
    {
        "content": "<p>1) Workgroups under OSSD do not need to ballot.   2) I could easily see this group being added on PSSes for other WGs! <br>\n Great examples might include Privacy/Consent ballots, patient generated data.  3) , care planning (patient driven), symptom reporting...   3)  There are numerous developers and researchers that are working on solving their own health issue so its really not strange at all.  We have sick faculty at Columbia that are basically devoting their work to helping patients like them. I would expect that if you get patients together they will invent something to ballot .   4) Lloyd is right - we want this to work.  So whatever vehicle is able to connect that patient energy and leadership we should tap it.  The patient advocate community is a strong one that is full of energy and some group like this at HL7 can be the conduit to that community.  And may help us focus on our mission.  To build community we need to connect communities right?</p>",
        "id": 172134572,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1564584913
    },
    {
        "content": "<blockquote>\n<p>They would presumably have ownership of a few pages in the FHIR core specification.  They might also own informative specs governing behavior for patient-facing apps</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> don't mean to distract from your point but wanted to give a plug for the CARIN Code of Conduct - <a href=\"https://www.carinalliance.com/our-work/trust-framework-and-code-of-conduct/\" target=\"_blank\" title=\"https://www.carinalliance.com/our-work/trust-framework-and-code-of-conduct/\">https://www.carinalliance.com/our-work/trust-framework-and-code-of-conduct/</a> (which took a long time to develop with numerous stakeholders) - is addresses some recommended behavior for apps.  <br>\nalthough who knows maybe it will need a maintenance home in HL7 like many other great things created outside and maybe that will help in serve its purpose! (<span class=\"user-mention\" data-user-id=\"214364\">@Ryan Howells</span> ) (<span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> )  Could in fact be one of the first \"products\"</p>",
        "id": 172135241,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1564585324
    }
]