[
    {
        "content": "<p>I'm going to break this, too, into a separate thread, because of what I (naively?) believe is its significance.  I'm also going to break it into paragraphs to help people like me better understand the structure of what <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> is suggesting:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"191531\">Virginia Lorenzi</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Awkward.20Conversations.20with.20Task/near/223792536\">said</a>:</p>\n<blockquote>\n<p>I have been looking at the Task.notes field more.  I think that if there is conversation with patients, notes could also be used to log that.  </p>\n<p>It includes a place to specify author and it has a time stamp.  So in notes you could have </p>\n<ul>\n<li>\"Called Mrs. Allen to clarify request. No response.  Left message asking for call back\" (author Joe Smith date time 1/13/2021 9AM)  </li>\n<li>\" Mrs. Allen returned call.  She explained she quit smoking in June 2020.\" (author Joe Smith date time 1/13/2021 11AM).  </li>\n</ul>\n<p>If you are just logging phone calls, do you really need to use the Communication resource?  You can have any number of notes.  You could then have </p>\n<ul>\n<li>\"Reviewed record.  Contacted Dr. Jones and asked him to evaluate the request\" (Joe Smith 1/13/2021 12PM)  and later </li>\n<li>\"Reviewed correction task - reached out to Dr. Jones again\" (Mary Rodriguez 1/20/2021 9AM) and finally </li>\n<li>\"Dr. Jones reviewed and determined that the record shows Mrs. Allen as a smoker on visits after June 2020.  Record has been corrected and patient send amendment report by mail\" (1/26/2021 10AM Mary Rodriquez).  </li>\n</ul>\n<p>In the LAST case, there could also be an output with the amendment accepted report as an embedded document.  </p>\n<p>With this approach, you would only need to use Communication if we want to use it to represent an a secure text type conversation between the patient and the person fulfilling the request.</p>\n</blockquote>\n<p>=======<br>\nFor completeness I'll also capture this, which Virginia added just as I was doing this...</p>\n<p><span class=\"user-mention silent\" data-user-id=\"191531\">Virginia Lorenzi</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Awkward.20Conversations.20with.20Task/near/223792659\">said</a>:</p>\n<blockquote>\n<p>Maybe we should not allow the request for correction to be updated via the FHIR API - only canceled and resubmitted.  Alternatively, maybe we could allow a new task to be created that amends the request for amendment.  I think use of Communication and/or CommunicationRequest is certainly linkable nut not necessarily needed.</p>\n</blockquote>",
        "id": 223792803,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1611458488
    },
    {
        "content": "<p>What's the rationale for \"no updates\"? There is no danger of accidental overwriting if you use the FHIR machinery that exists to prevent that. (Do agree that notes could be used to capture conversation.)</p>",
        "id": 223793761,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611460115
    },
    {
        "content": "<p>explain machinery.  And like that you agree on using Task.note</p>",
        "id": 223796477,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1611464824
    },
    {
        "content": "<p>Every time an update happens, there's an element on the resource called 'meta.version' that changes.  That version comes in one of the HTTP headers as part of the update response as well as inside the instance.  It also shows up as part of the 'location' header when you perform a search.  Servers can mandate that when you send a request for an update (or delete or patch) that the client must indicate what the 'version' tag was for the last version they have a copy of.  If that's not the 'current' version, the server will reject the update request and the client will have to re-query, see what's changed and (if appropriate) re-submit their update accounting for the recent changes.</p>",
        "id": 223836026,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611523064
    },
    {
        "content": "<p>Full details are here: <a href=\"https://build.fhir.org/http.html#concurrency\">https://build.fhir.org/http.html#concurrency</a></p>",
        "id": 223836033,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611523080
    }
]