[
    {
        "content": "<p>One idea I am playing around with is a Patient Track at DevDays. We already have a Student Track and a Startup Track. The Patient Track could mean: patients taking control of their health by using apps/data, like Dana Lewis, and showing what they did at DevDays. Not necessarily FHIR releated. It could also mean a series of patient facing apps by app developers. Not sure what's in it for them. Let me know what you think.</p>",
        "id": 169125520,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1561634850
    },
    {
        "content": "<p>I like it. But do you have enough participants?</p>",
        "id": 169125536,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1561634879
    },
    {
        "content": "<p>That's exactly my concern. Patients like Dana (and Michael) seem to be \"just\" individuals. How do you find them? And what's in it for them?</p>",
        "id": 169128444,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1561637546
    },
    {
        "content": "<p>Do you mean a track FEATURING patients, or FOR patients? I think the latter is premature - we don't have enough to offer them and indeed they'd be hard pressed to spend time and money attending.  </p>\n<p>But if you mean a track for and about patient use cases and/or apps, I'm sure the patient WG has plenty of thoughts on what that track might contain.</p>",
        "id": 169162548,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561660792
    },
    {
        "content": "<p>One thought for a potential speaker, btw, could be Eric von Hippel, author of the book \"Free Innovation\" and the recent Sloan article \"When Patients Innovate\" both of which feature OpenAPS. He could be important to business managers who don't understand why this would or could happen.</p>",
        "id": 169162949,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561661032
    },
    {
        "content": "<p>i mean featuring patients. So, patients showing what they can do once they get their data. Could even be a contest, like the Startup Track and the Student Track. Would there be enough appetite? <span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> ?</p>",
        "id": 169202029,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1561703995
    },
    {
        "content": "<p>Sure, I'm in!</p>",
        "id": 169214350,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1561718625
    },
    {
        "content": "<p>Great, thanks. And do you think we can build the Patient Track into something meaningful and substantial, also in number of participants who have a story to tell?</p>",
        "id": 169216985,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1561721844
    },
    {
        "content": "<p>I would hope so. Perhaps include possible takeaways for vendors: this is what (some) patients really want, these are some patient-initiated projects where you could work with them and get all the goodwill and also proper feedback, these are some of the pain points in current implementations, ... To make it interesting for the wider audience.</p>",
        "id": 169218835,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1561723775
    },
    {
        "content": "<p>I can start thinking of potential storytellers / presenters from my networks.</p>",
        "id": 169218868,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1561723802
    },
    {
        "content": "<p>Could we work on this with the #WeAreNotWaiting community?</p>",
        "id": 169219237,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1561724084
    },
    {
        "content": "<p>I'm all for digging up these \"extreme patient innovator\" cases, not least because it might attract some coverage from the mass media, which could reach unknown people in the public who have a major medical problem and would not otherwise know they could pursue their own use of their own data.  This could be good for them and for the movement. </p>\n<p>At the same time, we need to watch out: we may trigger an initial public reaction of \"Those people are weirdos - the general public has no use for that.\"</p>\n<p>For ten years I've heard repeatedly from skeptics \"Dave, you're abnormal- my patients aren't like you.\" LOGICALLY it's easy to refute that - as I said in my Amsterdam speech, that's what they said about women who wanted to vote, women who wanted to run marathons, etc.  But the issue isn't logic - it's that some people (clinicians and patients) may reject the idea if they're too shocked by how eccentric it is. </p>\n<p>That's exactly why in every <a href=\"http://superpatients.health\" target=\"_blank\" title=\"http://superpatients.health\">Superpatient</a> case I talk about (a few are described at that link), I emphasize that these feats have been achieved by people who <strong>do not have the expected credentials or attributes.</strong>   So while we may rightly showcase the leading-edge wizards - technicians who illustrate what people without medical credentials can do - I hope we will strive to also show what \"ordinary people\" can do when motivated and when enabled / empowered by access to tools and data.</p>",
        "id": 169221628,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561726274
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> and I had a chat around the Patient Track at DevDays:<br>\n- Target audience: patients who can show how they have taken control over their health using their data. Should contain some sort of Do It Yourself<br>\n- FHIR is not a requirement to participate<br>\n- ~10 minutes presentations, preferably demos<br>\n- Benefits for participants: exposure, networking, raise interest<br>\n- Max 5 participants, after a preselection<br>\n- Competition between the participants. Prize: commitment in resources (time, tooling, funding etc.) to FHIR-enable their data/app</p>\n<p>We need sponsors to make this work, both for resources for the winner, and for reimbursement of travel costs. If someone has comments or additional ideas, or wants to support the track already, please reply here or privately.</p>",
        "id": 169634754,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1562234110
    },
    {
        "content": "<p>We at Azuba Health are in the final stages of testing our new Lifetime Medical Records app and network.  What are the dates for DevDays?  And, how much are you looking for in sponsorship?</p>",
        "id": 169657452,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1562255483
    },
    {
        "content": "<p>DevDays Europe is Nov 20-22.  (No dates set yet for U.S. next year to my knowledge.)</p>",
        "id": 169658048,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562256076
    },
    {
        "content": "<p>FWIW, video interviews with Grahame and Dave (recorded during the recent DevDays) about the patient perspective: <a href=\"https://blog.fire.ly/2019/07/05/focusing-on-health-outcomes-the-patient-perspective-using-fhir/\" target=\"_blank\" title=\"https://blog.fire.ly/2019/07/05/focusing-on-health-outcomes-the-patient-perspective-using-fhir/\">https://blog.fire.ly/2019/07/05/focusing-on-health-outcomes-the-patient-perspective-using-fhir/</a></p>",
        "id": 169691472,
        "sender_full_name": "René Spronk",
        "timestamp": 1562313538
    },
    {
        "content": "<p>Thank you for pre-answering part of what I was about to ask!</p>\n<p>Still being new to firely and everything else here, I need to ask: By target <em>audience,</em> do you mean the people you want to BRING as presenters?  In other words, the audience for some \"Call for Proposals\"? That's what your note sounds like.</p>\n<p>I suggest we articulate why we're doing this - the future state of the HL7 FHIR community or project which will not exist without this expansion.</p>",
        "id": 169748635,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1562382005
    },
    {
        "content": "<blockquote>\n<p>We need sponsors to make this work, both for resources for the winner, and for reimbursement of travel costs. If someone has comments or additional ideas, or wants to support the track already, please reply here or privately.</p>\n</blockquote>\n<p>I will humbly but boldly propose that we/you/the sponsors build in not just travel expenses but a stipend - modest but not a \"token\" amount. </p>\n<p>The symbolic significance of this will be large.  It would be what the #PatientsIncluded community have been calling for, for years, which has rarely been done.  It would be a buzzworthy further expression of how the FHIR community are different from all the rest of health IT, <em>truly meaning it</em> when we say \"Patients are really important.\"  (When everyone else says it, it's commonly followed with a thud: \"Really important people, whose time is worth exactly nothing to us.\")</p>\n<p>I will do what I can to help sponsors both see the logic of this and get significant recognition for their leadership. </p>\n<p>The best time to weave this into plans is at the outset.</p>",
        "id": 169748800,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1562382372
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span>  and <span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span>, for clarity I suggest naming this a Patient Innovator track.  (That is what you intend, yes?)</p>\n<p>Just calling it \"patient track\" invites thinking of it as an \"ordinary people\" track, which will lead to reporters and others being quite confused. (I already was confused, until I saw Rien's description of his intent!)</p>\n<hr>\n<p>From this moment forward, as we anticipate being exposed to the public, we must constantly be thinking of what all this will look like to every new set of eyes.</p>\n<p>If that's what you intend, then we can move into discussing what kinds of innovation we'd anticipate, for instance... </p>\n<ul>\n<li>extreme (openAPS)</li>\n<li>\"just apps\" (a custom dashboard combining data from four apps that won't other cooperate?)</li>\n<li>Morris Blue Button dashboards ...</li>\n</ul>",
        "id": 169749105,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1562383006
    },
    {
        "content": "<p>I like the Patient Innovator Track as a name, though it's kind of long. <span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> ? What is modest and what is token for a stipend? Depends on whether we can find a sponsor or multiple sponsors. Send me suggestions in a private message please.</p>",
        "id": 169801624,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1562486890
    },
    {
        "content": "<p>Yes, I like the Patient Innovator Track as a name.</p>",
        "id": 169879060,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1562599655
    },
    {
        "content": "<p>I think this is a fantastic idea.</p>",
        "id": 170415345,
        "sender_full_name": "Kelly Watson",
        "timestamp": 1562634340
    },
    {
        "content": "<blockquote>\n<p>I think this is a fantastic idea.</p>\n</blockquote>\n<p>Which, <span class=\"user-mention\" data-user-id=\"195979\">@Kelly Watson</span>  - the track idea, the name, the stipend, other, everything?</p>",
        "id": 170415408,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1562634438
    },
    {
        "content": "<p>All of the above :)</p>",
        "id": 170415413,
        "sender_full_name": "Kelly Watson",
        "timestamp": 1562634455
    },
    {
        "content": "<p>There's something to be said for thinking (soberly, not just excitedly) concretely WHY we think it's a good idea.  I say this because a whole lot of people in the industry don't see any point.  (<em>cough</em>HIMSS<em>cough</em>)   </p>\n<p>Personally I think it's important because, as people have said for decades, patients are the most underused resource in healthcare, a reality that's driven by their / our lack of access to information.  A second rationale - primal, to me - is that patients are the ultimate stakeholder, the ones with the most at stake in how well healthcare works out - and it's silly to withhold from the ability to solve their own problems as they define them.</p>\n<p>We must be aware that some people will see this as a threat to their income and will resist or discourage, covertly or overtly.</p>",
        "id": 170416410,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1562635711
    },
    {
        "content": "<p>Here's why. I almost added my thoughts, but decided I'd like to excitedly respond:</p>",
        "id": 170417090,
        "sender_full_name": "Kelly Watson",
        "timestamp": 1562636820
    },
    {
        "content": "<p>I think building a _community_ at devdays for patient innovators would be a great benefit for the devdays experience.  Patients could help spur creative uses of Apple Health Record API and SMART-on-FHIR. I do think it takes a community rather than a task group or a set of inspiring demos of DIY systems.</p>\n<p>One thing I would have enjoyed was having the time to see the student track or startup track or in this case a patient track. The overlap with sessions I know is needed but for this case I really would like to see it slightly more prioritized if I could vote for that.</p>\n<p>As to where to find communities, go where they are. #wearenotwaiting has 10s of 1000s. Nightscout for instance is the \"12th most forked Git repository in Github, right after Linux\" per <span class=\"user-mention\" data-user-id=\"199600\">@Sulka Haro</span> :)</p>\n<p>My hope is that we can see a cross section of patients that cover the spectrum, regardless of whether FHIR related– some considering improving patient access and coordination of care, others thinking about how to integrate critically useful patient generated health data into the clinical workflow, and others looking for ways to make data available and impactful to research. </p>\n<p>Re: <code>Threat to their income</code>. I hear you <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> . Aligning incentives seems daunting.</p>",
        "id": 170420006,
        "sender_full_name": "Kelly Watson",
        "timestamp": 1562641183
    },
    {
        "content": "<blockquote>\n<p>Nightscout for instance is the \"12th most forked Git repository in Github, right after Linux\" per <span class=\"user-mention silent\" data-user-id=\"199600\">Sulka Haro</span> <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>\n</blockquote>\n<p>Holy crap!  That's a quotable stat!</p>\n<p>For presentations to the clueless can you summarize the significance of \"most forked\"?  To me it means \"the widest variety of people have found their own unique use for this thing\", which implies a seriously wide range of end-user values.</p>\n<p>WHICH WERE NEVER IDENTIFIED OR SERVED BY THE BLEEPING INDUSTRY THAT THINKS IT KNOWS EVERYTHING, btw. </p>\n<p>:-) You're welcome.  Signed, the Passionate department.</p>",
        "id": 170420146,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1562641358
    },
    {
        "content": "<p>Most \"forked\" – we can theoretically extend that to the number of users that have taken the project, created a fork to maintain and create their own remote monitoring site for continuous glucose monitoring data either as-is or as a part of a DIY closed loop system like OpenAPS/Loop. Some \"fork\" without using of course. It's pretty amazing.</p>",
        "id": 170420389,
        "sender_full_name": "Kelly Watson",
        "timestamp": 1562641829
    },
    {
        "content": "<p>I sort of understand :-) ... from what you say, it may not be of significance to the ordinary citizen, then</p>",
        "id": 170445360,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1562672631
    },
    {
        "content": "<p>FYI: Presentations from Amsterdam 2018 DevDays are on Youtube... Janet Campbell - Keynote, The Patient Experience --- <a href=\"https://youtu.be/LGEhnB4th04\" target=\"_blank\" title=\"https://youtu.be/LGEhnB4th04\">https://youtu.be/LGEhnB4th04</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"LGEhnB4th04\" href=\"https://youtu.be/LGEhnB4th04\" target=\"_blank\" title=\"https://youtu.be/LGEhnB4th04\"><img src=\"https://i.ytimg.com/vi/LGEhnB4th04/default.jpg\"></a></div>",
        "id": 170722636,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562938772
    },
    {
        "content": "<p>Thanks!  Is there a blog post about this?  Something saying who-all out there should care?</p>",
        "id": 170753284,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1562963394
    },
    {
        "content": "<p>I was going to ask - should we submit a session proposal for Amsterdam about patient innovations? Pointing to whatever happens in the separate patient innovator track, which most members won't see?</p>\n<p>(I'm assuming the patient innovator track would be as separate and invisible as the startup track and the student track ... with the important IMO exception that we want ALL DevDays people to be conscious of the interests of patient innovators.)</p>",
        "id": 170753616,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1562963647
    },
    {
        "content": "<p>I agree about funding - I do want to point out we have the Woody Beeler scholarship which could be used as well</p>",
        "id": 172129794,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1564581640
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 172130245,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1564581965
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span>  Thanks for that - I had not heard about the scholarship. The <a href=\"https://www.hl7.org/about/beeler_scholarship.cfm\" target=\"_blank\" title=\"https://www.hl7.org/about/beeler_scholarship.cfm\">scholarship page</a> says applications are reviewed about six weeks before a WGM, which for Sept 14 would be this Saturday, August 3 - yikes!  Emailing them now.</p>",
        "id": 172162141,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1564604465
    },
    {
        "content": "<p>It's official: The Patient Innovator Track at DevDays Amsterdam 2019. Thank you <span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> @*<em>Grahame Grieve</em>. Know someone who might want to participate? Please forward this link: *  <a href=\"https://www.devdays.com/amsterdam/patient-track/\" target=\"_blank\" title=\"https://www.devdays.com/amsterdam/patient-track/\">https://www.devdays.com/amsterdam/patient-track/</a></p>",
        "id": 173789564,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1566391303
    },
    {
        "content": "<blockquote>\n<p>We at Azuba Health are in the final stages of testing our new Lifetime Medical Records app and network.  What are the dates for DevDays?  And, how much are you looking for in sponsorship?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"216345\">@Bart Carlson</span> did you ever get a response to this 8 weeks ago?  <span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span> did you see the question about sponsorship?</p>",
        "id": 174255056,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1566929867
    },
    {
        "content": "<p>I don't recall receiving any response to my question.</p>",
        "id": 174330622,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1566965341
    },
    {
        "content": "<p>DevDays in Amsterdam is Nov. 20-22.  <span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span>, can you answer <span class=\"user-mention\" data-user-id=\"216345\">@Bart Carlson</span>'s questions re: sponsorship?</p>",
        "id": 174383572,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567012954
    },
    {
        "content": "<p>Yes I did, thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 174429618,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1567062802
    },
    {
        "content": "<p>I posted a blog about the Patient Innovator Track. Spread the word please. <a href=\"https://blog.fire.ly/2019/08/29/the-patient-innovator-track-at-devdays/\" target=\"_blank\" title=\"https://blog.fire.ly/2019/08/29/the-patient-innovator-track-at-devdays/\">https://blog.fire.ly/2019/08/29/the-patient-innovator-track-at-devdays/</a></p>",
        "id": 174458136,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1567088345
    },
    {
        "content": "<p>And I retweeted it LOUDLY, poking HIMSS in the nose.  I'm <em>so tired</em> of waiting for that org to get around to caring about patient needs! <a href=\"https://twitter.com/ePatientDave/status/1167205012356788225\" target=\"_blank\" title=\"https://twitter.com/ePatientDave/status/1167205012356788225\">https://twitter.com/ePatientDave/status/1167205012356788225</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/ePatientDave/status/1167205012356788225\" target=\"_blank\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/1057089314515894275/F7-ETa3P_normal.jpg\"></a><p>THIS THIS THIS! It's happening! The #HL7 #FHIR project is so \"really for patients, no kidding\" that this November they/we are having a track for Patient Innovators!\n\nHey <a href=\"https://twitter.com/HIMSS\" target=\"_blank\" title=\"https://twitter.com/HIMSS\">@HIMSS</a> &amp; #Health2con - take note &amp; learn! Smile <a href=\"https://twitter.com/lucienengelen\" target=\"_blank\" title=\"https://twitter.com/lucienengelen\">@lucienengelen</a>! #PatientsIncluded\n\n#WeAreNotWaiting #PinkSocks <a href=\"https://t.co/SSQgFEnbdF\" target=\"_blank\" title=\"https://t.co/SSQgFEnbdF\">https://twitter.com/FirelyTeam/status/1167078625885282305</a></p><span>- Dave deBronkart (@ePatientDave)</span></div></div>",
        "id": 174499113,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1567118739
    },
    {
        "content": "<p>Here is the @FirelyTeam tweet that I RT'd <a href=\"https://twitter.com/FirelyTeam/status/1167078625885282305\" target=\"_blank\" title=\"https://twitter.com/FirelyTeam/status/1167078625885282305\">https://twitter.com/FirelyTeam/status/1167078625885282305</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/FirelyTeam/status/1167078625885282305\" target=\"_blank\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/961187594758492160/AIkFb5DC_normal.jpg\"></a><p>The patient perspective in FHIR. Tech-savvy patients and app developers with a patient-first approach are invited to apply for the Patient Innovator Track at FHIR DevDays Amsterdam 2019, November 20th. <a href=\"https://t.co/YGO3Xg01WD\" target=\"_blank\" title=\"https://t.co/YGO3Xg01WD\">https://blog.fire.ly/2019/08/29/the-patient-innovator-track-at-devdays/</a>\n#wearenotwaiting #pinksocks #fhir <a href=\"https://t.co/DcRgVahQIT\" target=\"_blank\" title=\"https://t.co/DcRgVahQIT\">https://twitter.com/FirelyTeam/status/1167078625885282305/photo/1</a></p><span>- Firely (@FirelyTeam)</span><div class=\"twitter-image\"><a href=\"https://t.co/DcRgVahQIT\" target=\"_blank\" title=\"https://t.co/DcRgVahQIT\"><img src=\"https://pbs.twimg.com/media/EDJL0jWWkAE_RZY.jpg:thumb\"></a></div></div></div>",
        "id": 174499183,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1567118772
    }
]