[
    {
        "content": "<p>The requester knows to send a request somewhere  but might not have a fhir resource to point to in owner.  The fulfiller might want to specify the organization, the owning individual, and their title.  I note this because at least for HIPAA the provider is required to record that.  They might also want to list multiple people who have worked on the task.  owner's cardinality is only 0..1  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span></p>",
        "id": 221610343,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1609818347
    },
    {
        "content": "<p>If you have an endpoint to send to, you should at minimum always know the 'organization' associated with that endpoint...  At least, I would hope that would be a viable assumption.</p>",
        "id": 221613871,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609823776
    },
    {
        "content": "<p>But what about the fulfiller?</p>",
        "id": 221617344,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1609828799
    },
    {
        "content": "<p>I'm not really understanding.  The fulfiller <em>is</em> the owner...</p>",
        "id": 221660209,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609861051
    },
    {
        "content": "<p>I think I see both <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> 's point, in light of some discussion I heard around here not long ago. (How's that for vague?) </p>\n<p>Lloyd says the fulfiller is by definition the owner of the (assigned) task.  (I'm recapping this thread, not asserting.)  Virginia is saying HIPAA requires recording the PERSON and their title; I think Lloyd is saying the ORGANIZATION is the owner. </p>\n<p>\"What is reality?,\" as Firesign Theater asked a half century ago.</p>",
        "id": 221728584,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1609901869
    },
    {
        "content": "<p>I expect that, initially, the patient may not know the specific person who'll make the decision.  (In fact, where the decision is made by the medical records department, that'll likely be 100% of the time.)  The owner of the Task can change over time.  I would assume that HIPAA's requirement only kicks in once a decision is actually made?  At that point, the owner could be more specific - presumably a PractitionerRole - which would give you both the person information and the organization information.</p>",
        "id": 221729269,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609902700
    },
    {
        "content": "<p>From the provider side, I would interpret the <code>owner</code> as being whomever has legal responsibility for resolving the request.  That could be the hospital itself, the physicians practice, the hospital's legal department if the patient is deceased, etc.  Owner has a legal liability that the fulfiller does not, in the same way that the Physician is on the hook for what the Physician Assistant does.  </p>\n<p>Typically we'd sort by owner when running end-of-year audits, JCOH audits, and our subpoena log.  Find out how many outstanding change requests there are in the system that didn't get completed, and whose bucket they belong to.  That sort of thing.   And yes, legal ownership can bounce around.  </p>\n<p>Personally, I think profiling <code>Task.owner</code> to an Organization or PractitionerRole resource would be perfectly reasonable.</p>",
        "id": 221729542,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1609902995
    },
    {
        "content": "<p>Fulfiller - so the organization is the fulfiller but then the task is assigned to a specific person with a specific title at the organization - that is what I mean.  And perhaps there might be multiple people who work on it.  But officially there is one person.  That person (or title) won't be known by the requester most likely.</p>",
        "id": 221740791,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1609918533
    },
    {
        "content": "<p>The owner is not the practitioner.  I would expect it would be HIM staff, Privacy Officer, something like that.</p>",
        "id": 221741408,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1609919306
    },
    {
        "content": "<p>PractitionerRole also covers HIM staff, Privacy Officer, anyone with a distinguishable role.</p>",
        "id": 221768990,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1609941249
    },
    {
        "content": "<p>The owner will change.  You start with the owner being an Organization (when you don't know who the proper person will be) and then will be updated to be a specific individual.  And Vassil is correct - a Practitioner is anyone acting in their professional capacity.  A janitor or taxi driver is a Practitioner in FHIR terms.</p>",
        "id": 221786354,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609949673
    }
]