[
    {
        "content": "<p>From the agenda:</p>\n<blockquote>\n<p>Security analyst Alissa Knight will present about her report, announced last week, on vulnerabilities she found in FHIR APIs, specifically related to data aggregators. </p>\n<p>Approx 15 min presentation, then discussion</p>\n</blockquote>\n<p>Please see the recommended pre-reading (from <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span>) and report excerpts, in the <a href=\"https://confluence.hl7.org/display/PE/2021-10-21+Patient+Empowerment+Preliminary+Agenda\">Confluence agenda</a>.</p>",
        "id": 258405932,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634749895
    },
    {
        "content": "<p>Attn: <span class=\"user-mention\" data-user-id=\"379458\">@Andrea Downing</span> <span class=\"user-mention\" data-user-id=\"191678\">@Abbie Watson</span> <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> <span class=\"user-mention\" data-user-id=\"408278\">@Brent Zenobia</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> <span class=\"user-mention\" data-user-id=\"301793\">@Jessica Skopac</span> </p>\n<p>During the meeting, <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> proposed that the Patient Empowerment Working Group write a letter to HL7/ONC, expressing our communities concern over common (OSWAP Top 10) vulnerabilities in patient-directed FHIR servers and clients.</p>\n<p>I took a stab. 8 recommendations to various actors.</p>\n<ul>\n<li><a href=\"/user_uploads/10155/edyqwdBRkzk1rBuLeoUBdZwz/2021-10-21-HL7-Patient-Empowerment-WG-meeting-DRAFT-proposed-response-to-Playing-with-FHIR-v1.docx\">2021-10-21-HL7-Patient-Empowerment-WG-meeting-DRAFT-proposed-response-to-Playing-with-FHIR-v1.docx</a></li>\n<li><a href=\"/user_uploads/10155/I5Oie9pY1LgkcfvKJEqmZ65m/2021-10-21-HL7-Patient-Empowerment-WG-meeting-DRAFT-proposed-response-to-Playing-with-FHIR-v1.odt\">2021-10-21-HL7-Patient-Empowerment-WG-meeting-DRAFT-proposed-response-to-Playing-with-FHIR-v1.odt</a></li>\n<li><a href=\"/user_uploads/10155/WNt8TWU1sKjd5NWNeKW9T8xx/2021-10-21-HL7-Patient-Empowerment-WG-meeting-DRAFT-proposed-response-to-Playing-with-FHIR-v1.pdf\">2021-10-21-HL7-Patient-Empowerment-WG-meeting-DRAFT-proposed-response-to-Playing-with-FHIR-v1.pdf</a><br>\n(ODT and PDF are identical)</li>\n</ul>\n<p>I'm intentionally keeping the Attn to the Patient Empowerment WG, because we haven't discussed internally.</p>\n<p><strong>Action items</strong><br>\nThe document needs reviews by...</p>\n<ul>\n<li>Patient / Patient advocate, to make sure the statement is clear and comports with your desire (the recommendations are somewhat technical; the statement isn't).</li>\n<li>Security person, that knows what security scanning and responsible disclosure guidance (from HL7 Security WG?) apply. <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> ?</li>\n<li>Policy person for the HHS OCR (to) and CMS (cc) recommendations. <span class=\"user-mention\" data-user-id=\"301793\">@Jessica Skopac</span>?</li>\n</ul>\n<p><strong>To Co-chairs (<span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> <span class=\"user-mention\" data-user-id=\"191678\">@Abbie Watson</span> )</strong><br>\nIf there isn't something more urgent, would you consider adding this to the agenda for next week? Maybe add as homework?<br>\nI do think a response should be timely.<br>\nI don't want the WG to be derailed by this. We've already spent two weeks on it, and IMO, the WGs IGs are more important (there are other people working on security; there are many fewer people working on FHIR advanced directives).</p>",
        "id": 258632514,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1634858226
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 258640164,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634863354
    },
    {
        "content": "<p>I'd suggest keeping sight of the pattern where HIPAA covered entities are making the decision (without patient input!) to ship patient data over to their business associates, who in turn implement poorly secured access. This is a \"worst of all worlds\" story where the services are insecure and patients don't have any say about whether their data is exposed as part of the mix, because patients didn't opt in.</p>\n<p>There's a \"next worst\" set of offenses where the apps are just as poorly secured, but at least patients have a say in whether their data gets hoovered up.</p>",
        "id": 258640641,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634863748
    },
    {
        "content": "<p>Thank you, <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> !   Can you do a diff on that pattern vs what we're discovering now through the Knight report?</p>",
        "id": 258641260,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634864209
    },
    {
        "content": "<p>All, the Zoom archive (screen video plus transcript) is now released. (Someone please confirm that this link works.) <br>\n<a href=\"https://hl7-org.zoom.us/rec/share/tYItyZVYjVIUsgQAhrLrIDMPLLv0rX2KF7gkUmuS7_1LGyuTUzBXZue8gToXopel.zPXQfzzgKNJT-BgP\">https://hl7-org.zoom.us/rec/share/tYItyZVYjVIUsgQAhrLrIDMPLLv0rX2KF7gkUmuS7_1LGyuTUzBXZue8gToXopel.zPXQfzzgKNJT-BgP</a></p>",
        "id": 258641309,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634864269
    },
    {
        "content": "<p>I couldn't tell for sure, since the parties aren't named, but from an email exchange with <span class=\"user-mention\" data-user-id=\"450754\">@Alissa Knight</span> at least some of the apps she tested (and found vulnerabilities in) were branded by healthcare providers as \"their\" apps, which is to say they were offered by or on behalf of HIPAA covered entities, which is to say they're governed by HIPAA.</p>",
        "id": 258641378,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634864309
    },
    {
        "content": "<p><a href=\"https://twitter.com/JoshCMandel/status/1449437825548554242\">https://twitter.com/JoshCMandel/status/1449437825548554242</a> was my quick take</p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/JoshCMandel/status/1449437825548554242\"><img class=\"twitter-avatar\" src=\"https://uploads.zulipusercontent.net/d860879bd8cc0394f2a05259be50222c3452d2c6/68747470733a2f2f7062732e7477696d672e636f6d2f70726f66696c655f696d616765732f323431363436383337342f6132363068617733307873786d6c6937333962755f6e6f726d616c2e6a706567\"></a><p><a href=\"https://twitter.com/aneeshchopra\">@aneeshchopra</a> <a href=\"https://twitter.com/amalec\">@amalec</a> My reading is the same as <a href=\"https://twitter.com/amalec\">@amalec</a>. The tragedy of the sound bite IMO would be a community concluding \"Patient Application APIs are dangerous\" when the truth is more like \"covered entities shipping data to incompetent business associates without pt approval is dangerous.\"</p><span>- Josh Mandel (@JoshCMandel)</span></div></div>",
        "id": 258641407,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634864337
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Thursday.20topic.3A.20presentation.20.26.20discussion.20w.20Alissa.20Knight/near/258641407\">said</a>:</p>\n<blockquote>\n<p>\"covered entities shipping data to incompetent business associates without pt approval\"</p>\n</blockquote>\n<p>So, now how does \"incompetent business associates\" compare to \"aggregators who have incompetent security (or none)\"?</p>\n<p>For starters I imagine one big difference, but someone please confirm - is this correct?</p>\n<ul>\n<li>A BA has a business relationship with the covered entity, so the provider (covered entity) has <em>chosen</em> to send them patient data.</li>\n<li>But (by law?) providers (aka covered entities) <em>have</em> to give patient data to anything/anyone that has the patient's credentials.</li>\n</ul>\n<p>Is that a correct &amp; meaningful distinction?  If not, please fix (or declare my whole concept invalid)</p>",
        "id": 258642053,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634864760
    },
    {
        "content": "<p>Yeah, that's pretty good. The term \"Aggregator\" isn't super well defined in this space, but assuming it means roughly \"any party that runs a business and collects clinical data from multiple sources\"...</p>\n<ul>\n<li>\n<p>One pathway for moving data from a provider to an aggregator would be under HIPAA, where provisions like treatment, payment, and operations support this kind of sharing without a patient's authorization as long as there's a Business Associate Agreement in place; this is all governed by HIPAA and Business Associates have obligations just like covered entities (to protect the data, to notify in the case of breaches, etc). The technical means of transfer could be a database export, or an HL7v2 message feed, or FHIR APIs, or anything else.</p>\n</li>\n<li>\n<p>Another pathway for moving data from a provider to an aggregator would be HIPAA's patient right of access, where a patient instructs a healthcare provider to share. This can involve technologies like FHIR APIs for patient access. (Note that not all patient facing apps should be considered \"aggregators\" -- e.g., using Common Health or Apple Health, you can bring your own data onto your own phone without it being \"aggregated\" with anyone else's)</p>\n</li>\n</ul>\n<p>When both rules \"could\" apply, the BAA route essentially \"wins\" -- if an app is offered by or on behalf of a covered entity, even if the technical route of data exchange is a FHIR patient access API, the app still needs to have a BAA in place and is still governed under HIPAA (see <a href=\"https://www.hhs.gov/hipaa/for-professionals/privacy/guidance/access-right-health-apps-apis/index.html\">Q5 from this FAQ</a>)</p>\n<p>^^ Folks please correct me if any of this off. I'm not a lawyer :-)</p>",
        "id": 258642771,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634865267
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Thursday.20topic.3A.20presentation.20.26.20discussion.20w.20Alissa.20Knight/near/258642771\">said</a>:</p>\n<blockquote>\n<p>The term \"Aggregator\" isn't super well defined in this space</p>\n</blockquote>\n<p>FWIW:  My intent, and the apparent understanding of others I've discussed this with, is that we're talking about anyone who connects to many providers' FHIR endpoints and pulls out all the data for a given patient, using their credentials.  This aggregated data can then be provided to apps, saving the app developers from having to deal with all the different provider endpoints.</p>\n<p>Is this what y'all out there think \"aggregator\" means, or whatever we call it, for this topic?</p>",
        "id": 258643434,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634865711
    },
    {
        "content": "<p>I <em>think</em> that the apps Alissa evaluated don't necessarily work this way.</p>",
        "id": 258643498,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634865745
    },
    {
        "content": "<p>Or maybe some of them do, but some don't.</p>",
        "id": 258643522,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634865764
    },
    {
        "content": "<p>Furthermore...</p>\n<blockquote>\n<p>using their credentials.</p>\n</blockquote>\n<p>Do you mean like \"enter your password and we'll use it\" (gah! bad! antipattern! but it does happen) or do you mean like \"use a SMART on FHIR flow to delegate a subset of access that you choose\"?</p>",
        "id": 258643597,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634865813
    },
    {
        "content": "<p>But it'd be really helpful to understand the different routes (in real life) by which patient data <em>came to arrive</em> in the poorly-secured backend systems that Alissa evaluated.</p>",
        "id": 258643725,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634865875
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Thursday.20topic.3A.20presentation.20.26.20discussion.20w.20Alissa.20Knight/near/258643597\">said</a>:</p>\n<blockquote>\n<p>Do you mean like \"enter your password and we'll use it\" ...</p>\n</blockquote>\n<p>I don't know enough to know what I mean.  I just have a generic impression that things outside a FHIR endpoint get to suck data out by saying \"Yo endpoint: I am here to get Dave's data. Here's his permission.\"</p>\n<p>In any case an aggregator thingie does that to lots of endpoints, e.g. mine at Beth Israel Deaconess and at Darmouth-Hitchcock and at Nashua Eye Associates and at OCB in Boston.</p>",
        "id": 258644024,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634866075
    },
    {
        "content": "<p>I expect it's a mix of:</p>\n<h3>HIPAA-governed aggregator (BAA in place with health system)</h3>\n<ul>\n<li>A. Direct sharing from health system to BA</li>\n<li>B. Consumer mediated sharing from health system to BA (via patient credentials)</li>\n<li>C. Consumer mediated sharing from health system to BA (via SMART on FHIR)</li>\n</ul>\n<h3>FTC-governed aggregator (no BAA in place with health system)</h3>\n<ul>\n<li>D.  Consumer mediated sharing from health system to non-BA (via patient credentials)</li>\n<li>E. Consumer mediated sharing from health system to non-BA (via SMART on FHIR)</li>\n</ul>\n<p>And I expect it's mostly (A), but I don't have any direct visibility into this.</p>",
        "id": 258644131,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634866136
    },
    {
        "content": "<p>For sanity and to get anywhere, we may need to stick first to the specific findings in the report.  But in parallel, I sure agree it makes sense to figure out IF anyone even TRIED to think this out.  For all I know there may be groundrules, or not ... hey <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> is this stuff well known to the Security WG?</p>",
        "id": 258644443,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634866390
    },
    {
        "content": "<p>Of all these, (A) is the thing to be most upset about IMHO. And (B), (C) are a close second.</p>",
        "id": 258644460,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634866408
    },
    {
        "content": "<p>I struggled to understand specifics from the repot, but the broad conclusion sure feels true to me: security requires careful work and systems often do a poor job, even on the things that are well understood and should be basic hygiene.</p>",
        "id": 258644656,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634866553
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Thursday.20topic.3A.20presentation.20.26.20discussion.20w.20Alissa.20Knight/near/258644460\">said</a>:</p>\n<blockquote>\n<p>Of all these, (A) is the thing to be most upset about IMHO. And (B), (C) are a close second.</p>\n</blockquote>\n<p>Josh, help me out. I need a little more specificity. :-)  </p>\n<p>\"Upset\" as in offended, annoyed?  Or as in worried, anxious, fearful about risks?   Or, the thing to focus most on, because it's a real and current live problem today?</p>\n<p>Also, Is a covered entity responsible for what a BA does with the data?  That is, is the covered entity required to be careful (like a fiduciary responsibility) who they choose as a BA?</p>",
        "id": 258644747,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634866610
    },
    {
        "content": "<p>I think \"offended\" best captures my personal take -- the idea that my health data might not only be shared without my awareness, but shared with an aggregator that has such lax security as to expose my data for unauthorized users to see.</p>",
        "id": 258644813,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634866678
    },
    {
        "content": "<p>I'll note in passing that patient advocates have for YEARS been pointing this out, and it has pretty much not gotten anyone's attention. Many people (including me) have complained about Knight's style, but she sure has gotten attention on this.</p>\n<p>(And with that, I must expire for the night - too little sleep lately for this old man!)</p>",
        "id": 258645053,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634866855
    },
    {
        "content": "<blockquote>\n<p>Also, Is a covered entity responsible for what a BA does with the data? That is, is the covered entity required to be careful (like a fiduciary responsibility) who they choose as a BA?</p>\n</blockquote>\n<p>Generally not, but in some specific details yes, and it depends on the specifics of the BAA contract; <a href=\"https://www.hhs.gov/hipaa/for-professionals/faq/236/covered-entity-liable-for-action/index.html\">https://www.hhs.gov/hipaa/for-professionals/faq/236/covered-entity-liable-for-action/index.html</a>  lays out the background.</p>\n<p>Perhaps the key point is that <strong>HIPAA enforcement can be directly against the Business Associate</strong> -- e.g., <a href=\"https://www.hhs.gov/hipaa/for-professionals/compliance-enforcement/agreements/chspsc/index.html\">https://www.hhs.gov/hipaa/for-professionals/compliance-enforcement/agreements/chspsc/index.html</a> (\"HIPAA Business Associate Pays $2.3 Million to Settle Breach Affecting Protected Health Information of Over 6 million Individuals\"), and if the covered entity has reason to be aware, they may be liable as well.</p>",
        "id": 258645232,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634867003
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"300914\">@Ryan Harrison</span>, in looking at your recommendations, I have some concerns:</p>\n<ol>\n<li>I don't think it's appropriate for a list of the vulnerable organizations to be provided to HL7.  HL7 is not an oversight authority and none of the organizations who produced these interfaces necessarily have any obligation to HL7.  It's entirely possible that some of them aren't even members.  There isn't much we could do with such a list.  If anyone is going to receive it, it should be the relevant government agencies - i.e. HHS and FTC.  They have the responsibility around enforcement.</li>\n</ol>\n<p>I'd be astounded if Touchstone picked up on any of these issues.  Its tests generally focus on \"happy-path\" and it's not really set up to be able to test things like this.  It's theoretically possible that Inferno or the ONC-ATLs might have caught some of this, but I'm not sure they're set up to test this sort of thing right now either.  I'd change this recommendation to be that Inferno and the ONC-ATL should be enhanced to ensure that basic security testing as well as explicitly asserting adherence to a checklist of best practices (e.g. \"None of this software has included hard-coded credentials\") be made part of the certifcation process.</p>\n<ol start=\"2\">\n<li>I'm kind of hoping that Alissa has already done this.  As a white-hat hacker, it's sort of an expectation...</li>\n<li>There was no disclosure here that was relevant to HL7.  Yes, the poorly secured interfaces happened to use FHIR APIs, but the FHIR APIs weren't the issue.  That said, ensuring that HL7 <em>has</em> a disclosure policy and that it's easy to find and understand is probably a good thing for us to do.  That doesn't make sense to include in a letter to government though.</li>\n<li>On board with this, but again, not something for regulators</li>\n<li>I'm not sure that privacy attestations would have helped much here.  I'm sure those who would have signed such attestations for the aggregator apps thought they were fully secure and adhered to all policies.  Establishing a voluntary testing and certification process and a trusted, verifiable mark for apps that have gone through the process isn't a bad idea</li>\n</ol>",
        "id": 258656577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634872690
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nFor (1) 2nd paragraph and (2)-(5), are you making the updates (my preference), or do you want me to?</p>\n<p>For (1) 1st paragraph, my intent for an identified list wasn't enforcement (though, a breach notification may be in order for the impacted patients). It was to classify the vulns by \"severity.\" Where severity is was how much attestation/testing/vetting the vendor/API received. A high severity example would be a production API that passed ONC-ATL and is self-certified as compliant under a trust framework such as CARIN. A  low severity example would be a student project intended for staging, that somehow ended up with prod data. The FHIR community has checks in place; the identification is required so you can pin-point where those existing checks have fallen short and could be improved.</p>\n<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> brings in a second aspect of \"severity\" (which also requires identifying the vendors/APIs). The severity in terms of regulatory oversight.</p>\n<blockquote>\n<p>HIPAA-governed aggregator (BAA in place with health system)<br>\nA. Direct sharing from health system to BA<br>\nB. Consumer mediated sharing from health system to BA (via patient credentials)<br>\nC. Consumer mediated sharing from health system to BA (via SMART on FHIR)</p>\n<p>FTC-governed aggregator (no BAA in place with health system)<br>\nD. Consumer mediated sharing from health system to non-BA (via patient credentials)<br>\nE. Consumer mediated sharing from health system to non-BA (via SMART on FHIR)</p>\n</blockquote>\n<p>Source: <a href=\"#narrow/stream/179262-patient-empowerment/topic/Thursday.20topic.3A.20presentation.20.26.20discussion.20w.20Alissa.20Knight/near/258644131\">https://chat.fhir.org/#narrow/stream/179262-patient-empowerment/topic/Thursday.20topic.3A.20presentation.20.26.20discussion.20w.20Alissa.20Knight/near/258644131</a></p>\n<p>I guess Ms. Knight could annotate both the attestation/testing/vetting severity and the regulatory severity, and share the sheet without vendor names. But then, HL7 couldn't replicate.</p>",
        "id": 258660316,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1634876225
    },
    {
        "content": "<p>This is nicely constructive, relative to some non-constructive other discussions... However I think there is wild speculation going on here based on trying to read-between-the-lines of the report. The report is what it is, it served the purpose it was written for. <br>\nWe can certainly discussion what kind of information might be needed to go beyond the report. But  this seems well outside the scope of HL7 organization. <br>\nTo presume that ONC (and friends) are not doing this work is also highly speculation.</p>",
        "id": 258703724,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634905447
    },
    {
        "content": "<p>Should we sit on our hands? No. But we should not try to divine details that don't exist, we will get only what we want to see.</p>",
        "id": 258703783,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634905479
    },
    {
        "content": "<p>The good news, is that the report did indicate that EHR vendors were part of the assessment and no issues were found. We should be very happy that the primary vendor that the Healthcare IT industry have been focusing their FHIR API attention to have done a good job. We don't know how deeply Alissa tested them. We don't know what the assessment would be \"this month\".  But this is a clear indication that FHIR as an API -- CAN BE IMPLEMENTED SECURELY!</p>",
        "id": 258704172,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634905691
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"300914\">@Ryan Harrison</span> <span class=\"user-mention\" data-user-id=\"379458\">@Andrea Downing</span> <span class=\"user-mention\" data-user-id=\"191678\">@Abbie Watson</span> <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> <span class=\"user-mention\" data-user-id=\"301793\">@Jessica Skopac</span> <br>\nSomeone needs to be taking an end-to-end approach to security. At present it seems like we are pursuing an \"arms and legs\" approach - individual pieces are looking at their own security needs, but no one (that I'm aware of) is looking at the problem end-to-end</p>",
        "id": 258729362,
        "sender_full_name": "Brent Zenobia",
        "timestamp": 1634917128
    },
    {
        "content": "<p>And we should be applying a multiple perspectives approach to the analysis. Consider organizational (e.g. policy) and personal (e.g. patient burden) perspectives as well as just narrow technical considerations. This needs a holistic approach.</p>",
        "id": 258730326,
        "sender_full_name": "Brent Zenobia",
        "timestamp": 1634917553
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"300914\">@Ryan Harrison</span> Not sure how to edit the file format you're using for authoring.  <br>\nHL7 doesn't do security testing.  We have zero expertise (or capacity) for doing that.  If there's a flaw in our specifications or any of the very limited amount of code we distribute (we've had issues with shared XSLTs once), then we absolutely need to fix those.  But we have no authority or capability to do anything more than say \"we think you should do X\".  (And at the international/base FHIR level, we have limitations even there, because we can't mandate what needs to be secured, nor how - those decisions are made much closer to implementation and aren't the kind of thing we can mandate across all FHIR implementations worldwide.</p>\n<p>What we <em>can</em> do is start to set expectations that implementation guides all have a section on \"Security &amp; Privacy\" that documents specific risks and mitigations that are relevant to that IG, including any mandatory security technologies that need to be employed and any constraints on how those are configured and used.  Some accelerators are already doing this.</p>\n<p>Part of the issue is that standards, are by definitions, building blocks used to define overall solutions.  They're built that way deliberately to allow re-use and reduce fragility/brittleness.  The second problem is that, for most standards, there are few resources available for basic testing, let alone penetration testing.  ONC may be able to fund some for US Core, but I don't know we can expect the same for Gravity, mCode or the other accelerators, much less for the plethora of IGs developed outside the accelerator space.</p>",
        "id": 258739161,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634921368
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"408278\">@Brent Zenobia</span> I think I get the spirit of what you say, but I will point out that we do define standards that support strictly speaking \"end-to-end security\". What we don't do, and have no authority to do, is define Access Control Policy. We do use a set of prototypical access control policies to as use-case input to the standards we define. This is certainly true of everything you find on the FHIR core security and privacy pages, and the security relevant implementation guides like SMART.</p>",
        "id": 258739202,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634921385
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> FAST FHIR might. If the ONC were to establish a minimum certification for attaching to the national infrastructure, the end-to-end problem could be attacked that way.</p>",
        "id": 258744145,
        "sender_full_name": "Brent Zenobia",
        "timestamp": 1634923414
    },
    {
        "content": "<p>possibly FAST could declare policies.. however the issues found may not be fully coverable by a policy that even FAST could declare. The actual problem is basic RESTful API security, hence why security workgroup and the FHIR core security pages point at general RESTful API security standards bodies and tools, like OWASP Mobile Security <a href=\"https://www.owasp.org/index.php/Mobile_Top_10_2016-Top_10\">https://www.owasp.org/index.php/Mobile_Top_10_2016-Top_10</a>.</p>",
        "id": 258746332,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634924360
    },
    {
        "content": "<p>Yeah I sure wouldn't tie this to FAST, which isn't an effort with production IGs in real-world use today (unless I'm missing something)</p>",
        "id": 258746697,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634924536
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Thursday.20topic.3A.20presentation.20.26.20discussion.20w.20Alissa.20Knight/near/258739161\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"300914\">Ryan Harrison</span> Not sure how to edit the file format you're using for authoring.  </p>\n</blockquote>\n<p>I uploaded a docx version of the file<br>\n<a href=\"/user_uploads/10155/edyqwdBRkzk1rBuLeoUBdZwz/2021-10-21-HL7-Patient-Empowerment-WG-meeting-DRAFT-proposed-response-to-Playing-with-FHIR-v1.docx\">2021-10-21-HL7-Patient-Empowerment-WG-meeting-DRAFT-proposed-response-to-Playing-with-FHIR-v1.docx</a></p>\n<p>Though, you should be able to edit the ODT (Open Document Format)  in Word as well.</p>",
        "id": 258748461,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1634925305
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Thursday.20topic.3A.20presentation.20.26.20discussion.20w.20Alissa.20Knight/near/258703724\">said</a>:</p>\n<blockquote>\n<p>Should we sit on our hands? No. But we should not try to divine details that don't exist, we will get only what we want to see.</p>\n</blockquote>\n<p>What is your recommendation for next steps for..</p>\n<ul>\n<li>HL7 Patient Empowerment</li>\n<li>HL7 Security</li>\n</ul>\n<p>Are you saying the Patient Empowerment WG should...</p>\n<ul>\n<li>Send a letter / make a statement, but with modifications to the draft? </li>\n<li>Toss the draft and respond in another way?</li>\n<li>Not respond / other actors \"got it\"?</li>\n</ul>\n<blockquote>\n<p>We can certainly discussion what kind of information might be needed to go beyond the report. But  this seems well outside the scope of HL7 organization. </p>\n</blockquote>\n<p>This is Recommendation 1 (asks from Ms. Knight). A spreadsheet with the vulns, and either i) the vendor/API (initial proposal), or ii) an annotation of severity (comments). Where severity is i) testing gap severity (e.g. ONC-ATL should have caught), and ii) regulatory severity (vulns in a BA vs vulns in a non-BA aggregator).</p>\n<p>Basically, all the vulns are not created equal. But the report doesn't have sufficient information to classify by severity.</p>",
        "id": 258749650,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1634925795
    },
    {
        "content": "<blockquote>\n<p>testing gap severity (e.g. ONC-ATL should have caught</p>\n</blockquote>\n<p>I'm confused about this classification; none of the vulnerabilities from the report were in systems subject to ONC's certification and testing requirements, right? So how could authorized testing labs have caught them?</p>",
        "id": 258750304,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634926064
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> </p>\n<blockquote>\n<p>none of the vulnerabilities from the report were in systems subject to ONC's certification and testing requirements</p>\n</blockquote>\n<p>To <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> 's point</p>\n<blockquote>\n<p>However I think there is wild speculation going on here based on trying to read-between-the-lines of the report. </p>\n</blockquote>\n<p>That's the known-unknown, and why it's why we need a spreadsheet.<br>\nThe EHRs are subject to certification, and they passed.<br>\nMaybe some of the other APIs were subject, but had vulns. I doubt it, but we don't know.</p>",
        "id": 258750672,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1634926241
    },
    {
        "content": "<p>I think that asking ONC to extend their certification process to include some fundamental security testing as well as self-certification of adherence to basic security principles is reasonable - and requiring that certification by business associates as well as EHRs would be useful.  Also establishing an optional certification (and labeling process) for patient apps that includes similar requirements would also be useful.  And of course, re-enforcing the message that \"The fact some systems have done lousy execution of security should NOT be used as an excuse to slowing or setting further barriers to patient access to data\"</p>",
        "id": 258750680,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634926246
    },
    {
        "content": "<p>I'm pretty sure that ONC's current testing is focused on \"can you interoperate\" not on \"are you secure\" - beyond the \"can you successfully connect with TLS, OAuth, etc.\"</p>",
        "id": 258750859,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634926331
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Thursday.20topic.3A.20presentation.20.26.20discussion.20w.20Alissa.20Knight/near/258750680\">said</a>:</p>\n<blockquote>\n<p>I think that asking ONC to extend their certification process to include some fundamental security testing as well as self-certification of adherence to basic security principles is reasonable - and requiring that certification by business associates as well as EHRs would be useful. </p>\n</blockquote>\n<p>Sounds like a concrete recommendation to ONC, add it?</p>\n<blockquote>\n<p>Also establishing an optional certification (and labeling process) for patient apps that includes similar requirements would also be useful.  </p>\n</blockquote>\n<p>Expand recommendation 6 [^1] to include, or split into new recommendation?</p>\n<blockquote>\n<p>And of course, re-enforcing the message that \"The fact some systems have done lousy execution of security should NOT be used as an excuse to slowing or setting further barriers to patient access to data\"</p>\n</blockquote>\n<p>Add to statement, or this a recommendation to ONC?</p>\n<p>[^1] </p>\n<blockquote>\n<p>Recommendation 6: Create guidance for Patient Access API 3rd-party app onboarding and consent screens<br>\nConsider including a requirement that Patient Access API Servers visually indicate the “safety” of a 3rd-party application. For example, showing positive badges for CARIN Trust Framework and ONC vetted application, and/or showing negative warnings for apps that have not voluntarily attested.</p>\n</blockquote>",
        "id": 258751542,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1634926645
    },
    {
        "content": "<p>I would say the \"re-enforcement\" should be in the intro.  The letter should be stripped to <em>only</em> what the government can do (not what HL7 can do and not what information might have been nice-to-have from this recent report).  What I've listed are the two concrete actions we're looking for from government.</p>",
        "id": 258752664,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634927128
    },
    {
        "content": "<p>feels alot like \"make work\". ONC already knows about the report, and likely far more than this report.  I am confident that they don't like patient data being exposed. <br>\nI think that the hysteria is not helpful. Actions are helpful.</p>\n<p>Many have implemented FHIR API securely!</p>\n<p>The security workgroup has always been watching the market place for issue that should be emphasized on the FHIR core security pages. You will find many things there that come from past articles that the Security WG and others in FHIR community knew about, but for which there was not as much drama.<br>\nWe are planning:</p>\n<ul>\n<li>updating the security core pages. We have found a few instances where we could have mentioned general REST API security more (We said it once, seems we need to say it 2 or 3 times)</li>\n<li>identifying some FHIR specific \"abuse cases\" to add to any products \"use cases\".  These would not duplicate the above general REST API security, but rather focus on FHIR specifics such as _revinclude query parameter</li>\n<li>identifying some common REST API security tools and possibly some hints on how to configure them to test FHIR based REST APIs.</li>\n</ul>",
        "id": 258757992,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634929402
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"300914\">@Ryan Harrison</span> just now catching up in Zulip...Thank you for fantastic feedback in our meeting.  I will be the reviewer as patient advocate and can get this back by Monday.</p>",
        "id": 258759799,
        "sender_full_name": "Andrea Downing",
        "timestamp": 1634930151
    },
    {
        "content": "<blockquote>\n<p>feels alot like \"make work\". ONC already knows about the report, and likely far more than this report. I am confident that they don't like patient data being exposed.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> I agree 100%</p>",
        "id": 258761282,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634930833
    },
    {
        "content": "<p>(I mean, if folks are excited to work on this, I'd say go for it, but it's not an obvious \"win\" from my perspective.)</p>",
        "id": 258761462,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634930892
    },
    {
        "content": "<p>Patient Empowerment WG should be mad that their Patient data are in Aggregators. Did you know that? And not just Aggregators, but Aggregators that have deployed that data behind FHIR APIs that were very badly flawed. This is my complaint to ONC as a Patient.</p>",
        "id": 258764506,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634932204
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"379458\">@Andrea Downing</span> <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <br>\nWhat I'm hearing is...</p>\n<ul>\n<li>Letter from Patient Empowerment WG to ONC</li>\n<li>\n<p>Stating...</p>\n<ol>\n<li>We're ~mad~ deeply concerned by these vulns (John's blurb above) </li>\n<li>We do not want this used as an excuse to block patient access or otherwise undermine the information blocking rules (as Ms. Knight calls for in some of her recommendations) [^1, ^2]</li>\n<li>All vulns aren't created equal (Josh's breakdown)</li>\n</ol>\n</li>\n<li>\n<p>Recommendations for, to quote Lloyd, \"what the government can do\". Definitely ONC. Probably HHS OCR. Maybe CMS and FTC. </p>\n</li>\n<li>Discuss and approve (or not) at 28 Oct WG meeting. Done and move on. </li>\n</ul>\n<p>I'd include the Recommendation to Ms. Knight to publish a spreadsheet (not identified) so we can aggregate the data by severity (gaps in testing, and regulatory severity), but I don't see support for this.</p>\n<p>-<br>\nFootnotes</p>\n<p>[^1] </p>\n<blockquote>\n<p>Report &gt; Recommendations: Clarify that the Security Exception to the Information Blocking Rule allows EHR vendors to require specific controls be implemented by any system that connects to their APIs.</p>\n</blockquote>\n<p>My 2-cents: Reasonable intent, but too easily abused. This would allows EHRs carte blanche to disallow connections based on any (potentially arbitrary) control they impose. This would end-run around 5 years of ONC work crafting the information blocking rule.</p>\n<p>[^2] </p>\n<blockquote>\n<p>Report &gt; Recommendations: Government mandated exposure of FHIR services creates a \"killing field\" of FHIR APIs when used by unaffiliated patient-facing app developers whom the EHR vendors have no influence over selecting.</p>\n</blockquote>\n<p>My 2-cents: Let's replace \"creates a killing field\" with the less loaded term \"enables an ecosystem,\" and you'll find the entire point of the ONC Information Blocking provisions. EHR vendors (ONC rule) and Payers (CMS rule) should not be able to unilaterally block access to a patients information.</p>",
        "id": 258773462,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1634936224
    },
    {
        "content": "<p>Love it <span class=\"user-mention\" data-user-id=\"300914\">@Ryan Harrison</span></p>",
        "id": 258773807,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634936397
    },
    {
        "content": "<p>I don't think it is right for us to ask Alissa to divulge information that she was asked to not divulge, and for which responsible-disclosure would have her continue to keep in confidence.</p>",
        "id": 258777012,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634937935
    },
    {
        "content": "<p>i think the communication may be initiated by Patient Empowerment, but I think the HL7 process would have the Policy Advisory Committee (PAC) actually do the communicating.</p>",
        "id": 258777105,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634937971
    },
    {
        "content": "<blockquote>\n<p>John Moehrke: I don't think it is right for us to ask Alissa to divulge information that she was asked to not divulge, and for which responsible-disclosure would have her continue to keep in confidence.</p>\n</blockquote>\n<p>I don't see where Ryan is asking for this.</p>",
        "id": 258777272,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634938075
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Thursday.20topic.3A.20presentation.20.26.20discussion.20w.20Alissa.20Knight/near/258761462\">said</a>:</p>\n<blockquote>\n<p>(I mean, if folks are excited to work on this, I'd say go for it, but it's not an obvious \"win\" from my perspective.)</p>\n</blockquote>\n<p>It would help to understand what would be most effective use of time.  Right now this is 10ish recommendations to 8 different regulatory bodies, and wondering how to prioritize where the most obvious wins would be.</p>",
        "id": 258777409,
        "sender_full_name": "Andrea Downing",
        "timestamp": 1634938141
    },
    {
        "content": "<p>I think the letter to ONC with Ryan's points (even leaving the recommendations aside) is roughly the efficient frontier.</p>",
        "id": 258778593,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634938843
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Thursday.20topic.3A.20presentation.20.26.20discussion.20w.20Alissa.20Knight/near/258777272\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>John Moehrke: I don't think it is right for us to ask Alissa to divulge information that she was asked to not divulge, and for which responsible-disclosure would have her continue to keep in confidence.</p>\n</blockquote>\n<p>I don't see where Ryan is asking for this.</p>\n</blockquote>\n<p>I read this as asking Alissa to do things beyond what she is authorized to do</p>\n<div class=\"codehilite\"><pre><span></span><code>I&#39;d include the Recommendation to Ms. Knight to publish a spreadsheet (not identified) so we can aggregate the data by severity (gaps in testing, and regulatory severity), but I don&#39;t see support for this.\n</code></pre></div>",
        "id": 258778898,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634939033
    },
    {
        "content": "<blockquote>\n<p>but I don't see support for this.</p>\n</blockquote>",
        "id": 258779920,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634939595
    },
    {
        "content": "<p>(Also: I wouldn't expect a list of vulnerability <em>types</em> / metadata / org types to violate any terms of anything.)</p>",
        "id": 258779970,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634939626
    },
    {
        "content": "<p>A desire for Alissa to do anything has no business in a letter to Government.  And, frankly, we're not in a position to do anything with information that Alissa might provide.  It's not HL7's role.  Someone who has a relationship with her might want to verify that she's informed the organizations with the vulnerabilities of their vulnerabilities and suggest that passing on what she feels she can to the relevant regulatory authorities would be helpful.  However, in the end that's her call and will be influenced by what her contract allows her to do.  HL7 shouldn't try to be in the middle.</p>",
        "id": 258782965,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634941261
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <span class=\"user-mention\" data-user-id=\"246928\">@Josh Lamb</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"379458\">@Andrea Downing</span> <br>\nLet's try this again; we're making progress...</p>\n<blockquote>\n<p>Letter from Patient Empowerment WG to <del>ONC</del> PAC</p>\n</blockquote>\n<p>HL7 policy dictates the letter is to PAC, not ONC. (Thanks <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> )</p>\n<blockquote>\n<ul>\n<li>\n<p>Stating...</p>\n<ol>\n<li>We're ~mad~ deeply concerned by these vulns (John's blurb above)</li>\n<li>We do not want this used as an excuse to block patient access or otherwise undermine the information blocking rules (as Ms. Knight calls for in some of her recommendations)</li>\n<li>All vulns aren't created equal (Josh's breakdown)</li>\n</ol>\n</li>\n</ul>\n</blockquote>\n<p>There seems to be consensus on the statement outline</p>\n<p><strong>Decision: Include recommendations to the govt or not</strong></p>\n<blockquote>\n<ul>\n<li>Recommendations for, to quote Lloyd, \"what the government can do\". Definitely ONC. Probably HHS OCR. Maybe CMS and FTC.</li>\n</ul>\n</blockquote>\n<p>Did I get this right folks?</p>\n<ul>\n<li><span class=\"user-mention\" data-user-id=\"300914\">@Ryan Harrison</span> Recommendations</li>\n<li><span class=\"user-mention\" data-user-id=\"379458\">@Andrea Downing</span> Recommendations, but fewer</li>\n<li><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Indifferent.</li>\n<li><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Recommendations, and has proposed at least two specific recommendations to ONC</li>\n</ul>",
        "id": 258793303,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1634949316
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"300914\">@Ryan Harrison</span> the only thing where I know for sure you're off base is that no WG writes to the government.  It's \"law\" in HL7 that policy communications come solely from PAC (policy action committee), to ensure squeaky-clean rule compliance, so Pt Empowerment or any other group sends thoughts to PAC, who does the massaging and sending.</p>\n<p>I'm sure more senior HL7 people will correct me if that's wrong.</p>",
        "id": 258793595,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634949668
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> Got it. Updated post.</p>",
        "id": 258793654,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1634949738
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"300914\">Ryan Harrison</span></p>\n<ul>\n<li><span class=\"user-mention\" data-user-id=\"379458\">@Andrea Downing</span> Recommendations, but fewer</li>\n</ul>\n<div class=\"codehilite\"><pre><span></span><code>Hi @**Ryan Harrison** !  I emailed you doc w/ specific redlines synthesizing some of the above, along with suggested recommendation to FTC.\n</code></pre></div>",
        "id": 258793998,
        "sender_full_name": "Andrea Downing",
        "timestamp": 1634950303
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"379458\">@Andrea Downing</span> Yep, I know. </p>\n<p><del>I'm in the document now.</del> <br>\nUpdate: I worked through all your redlines and incorporated the comments from the group. I think the document is ready for  v2 release to the group.</p>\n<p>Was paraphrasing stances for the group. Was my paraphrase inaccurate?</p>",
        "id": 258794254,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1634950595
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Thursday.20topic.3A.20presentation.20.26.20discussion.20w.20Alissa.20Knight/near/258793595\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"300914\">Ryan Harrison</span> the only thing where I know for sure you're off base is that no WG writes to the government.  It's \"law\" in HL7 that policy communications come solely from PAC (policy action committee), to ensure squeaky-clean rule compliance, so Pt Empowerment or any other group sends thoughts to PAC, who does the massaging and sending.</p>\n<p>I'm sure more senior HL7 people will correct me if that's wrong.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  I'm afraid that's incorrect.  The A in PAC stands for 'Advisory' and that describes its role. The only people authorized to represent HL7 International  to other organizations or entities, are the CEO, CTO( <span class=\"user-mention\" data-user-id=\"191808\">@Wayne Kubick</span>)  and Board Chair or anyone authorized by them to do so. This is stated in Section 8.04 of the GOM (Representing HL7 International).</p>",
        "id": 258800162,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1634959232
    },
    {
        "content": "<p>right. but in this case, the CEO and CTO have asked the PAC to draft such a letter</p>",
        "id": 258800254,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634959347
    },
    {
        "content": "<p>Sure - but who will actually sign that letter?</p>",
        "id": 258800268,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1634959391
    },
    {
        "content": "<p>CEO I expect. CTO remit covers technical issues, and this isn't one of them. So I would expect Chuck, but I don't think we've discussed it explicitly</p>",
        "id": 258800312,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634959443
    },
    {
        "content": "<p>Walter might co-sign this one, I suppose.</p>",
        "id": 258800397,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634959569
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> thank you for honing my impression! Apparently I was right in that individual WGs do NOT write directly - they write to PAC - but beyond that I was all foggy.</p>",
        "id": 258802232,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1634962475
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"379458\">@Andrea Downing</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"408278\">@Brent Zenobia</span> <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <br>\nv2 of the letter. There are comments in the docx for the suggestions from Josh, Brent, Lloyd, et al. contributed. Do double check your intent is captured.</p>\n<ul>\n<li><a href=\"/user_uploads/10155/SsX5OHK8CtlQAm_-IGFoZPAI/2021-10-22-HL7-Patient-Empowerment-WG-meeting-DRAFT-proposed-response-to-Playing-with-FHIR-v2.docx\">2021-10-22-HL7-Patient-Empowerment-WG-meeting-DRAFT-proposed-response-to-Playing-with-FHIR-v2.docx</a></li>\n<li><a href=\"/user_uploads/10155/Gab_831EdAP5K9ZLpqnHThoW/2021-10-22-HL7-Patient-Empowerment-WG-meeting-DRAFT-proposed-response-to-Playing-with-FHIR-v2.pdf\">2021-10-22-HL7-Patient-Empowerment-WG-meeting-DRAFT-proposed-response-to-Playing-with-FHIR-v2.pdf</a></li>\n</ul>",
        "id": 258804893,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1634967076
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  from reading the report it appears that at least some of the aggregators were used by providers who provided their patients with apps to access and manage their data.  Thus covered by HIPAA so the hacking would represent a HIPAA breach.</p>",
        "id": 258911826,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1635130075
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> as a patient wanting to use an app that I download as my PHR using individual right of access, and the new SMART on FHIR APIs, I would want to know that my data was safe.  Isn't that D.?  Isn't this one of the goals of having a \"nutrition label\" telling someone downloading their data about the app (which could also have APIs)?  This is where I thought CARIN Code of Conduct could help and is why I have been so interested in it.  Also more guidance for app and API developers (per Alissa's recommendations to app and API developers.</p>",
        "id": 258912046,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1635130419
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> CARIN alliance was working on the concept of app attestation I thought (attestations to CARIN code of conduct, gallery of those that attested to it).</p>",
        "id": 258913499,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1635132697
    },
    {
        "content": "<p>actually all policy communication goes through HL7 leadership and is first recommended by the policy advisory committee (PAC)</p>",
        "id": 258913775,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1635133169
    },
    {
        "content": "<p>I don't really see the CARIN Code of Conduct as a solution. If users learn to rely on attestation to the code of conduct, then an incompetent app developer is likely to attest to the code of conduct (in good faith, as their security issues are due to incompetence). The question then is who will test their security, who will pay for that testing across the many apps in the market, and what are the consequences when it is shown to be insecure?</p>",
        "id": 258913885,
        "sender_full_name": "Paul Church",
        "timestamp": 1635133331
    },
    {
        "content": "<p>the code of conduct is part of a solution, but it needs to buttressed by testing</p>",
        "id": 258915826,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635136479
    },
    {
        "content": "<p>Some info on ONC certification:<br>\nThe ONC Certification requirements are determined by the regulatory process.  The most recent ONC Certification Rule requires EHR vendors to upgrade their products in 2022 and we expect CMS to require adoption by many providers in 2023.  This is the 2015 Cures Update Edition Certification.  It actually includes enhanced requirements for APIs: <a href=\"https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#test_procedure\">https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#test_procedure</a>  I think that perhaps some of what is covered in the new certification might actually help with some of the issues but I am not sure.</p>\n<p>To upgrade the certification requirements beyond this is possible, but would require the full rulemaking process, EHR compliance, and provider implementation - this takes alot of effort and alot of time (create and release proposed rule, get feedback, review feedback, issue final rule, give time for vendors to update software and get certified, provider adoption)</p>\n<p>Also, there is NO requirement for an aggregator or any HIT vendor product to be ONC certified.  the EHRs tested were all certified and none of their APIs had a problem.  But many HIT products used by providers and by patients are not ONC certified.  My guess is the ones that were hacked were not certified.  The only motivation for a vendor to certify a product is so that providers are able to comply with a rule that requires they use a certified EHR (Promoting Interoperability, MIPS, etc).</p>",
        "id": 258919235,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1635141291
    },
    {
        "content": "<blockquote>\n<p>. If users learn to rely on attestation to the code of conduct, then an incompetent app developer is likely to attest to the code of conduct (in good faith, as their security issues are due to incompetence). The question then is who will test their security, who will pay for that testing across the many apps in the market, and what are the consequences when it is shown to be insecure?</p>\n</blockquote>\n<p>It's a solution to the \"is there enforcement\" problem (i.e., clear terms are then enforceable, meaning developers are at financial risk) more than it is to the \"are there security bugs\" problem. So it's policy that at least starts to line up incentives, because if there's enforcement there's (yet another) direct motivation to get the security right.</p>",
        "id": 258967150,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1635172324
    },
    {
        "content": "<p>Even if there isn't active enforcement, if there's well-advertised, easily available/useable testing tools, most will use them.  But I don't think we have those.</p>",
        "id": 258967630,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635172544
    },
    {
        "content": "<p>Not well-advertised, at any rate...</p>",
        "id": 258967676,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635172558
    },
    {
        "content": "<p>I would also advocate for Patient access to a full Access Report, not just the Accounting of Disclosures. This Access Report needs to be available from EVERYONE who has data with the Patient as the subject. The FHIR AuditEvent resource can support this. Where support means that when Security/Privacy relevant events are recorded in AuditEvent resources with a .entity indicating the affected subject (Patient); then a trusted service can appropriately filter out those relevant to a given Patient. This is the foundation of the <a href=\"https://profiles.ihe.net/ITI/TF/Volume1/ch-9.html\">IHE-ATNA</a> audit logging capability, all defined IHE Interoperability transactions define how the audit log \"should\" be filled out including identifying the patient whenever possible. This is also what I elaborate on in my <a href=\"http://build.fhir.org/ig/JohnMoehrke/BasicAudit/branches/main/index.html\">BasicAudit IG</a><br>\nAlso see my blog article on Access Log -- <a href=\"https://healthcaresecprivacy.blogspot.com/2019/06/patient-engagement-access-log.html\">https://healthcaresecprivacy.blogspot.com/2019/06/patient-engagement-access-log.html</a></p>\n<p>My point <strong>here in this topic</strong> is, that abuses of an API will still show up in an AuditEvent log. <strong>These should be detected internally during regular audits of the audit logs, and remediation started for failures.</strong>  But these could also benefit from Patients asking about accesses to their data that they don't think are justified or authorized.    This in addition to the benefit to a Patient of the Transparency of how their data are used - Privacy Principles.</p>",
        "id": 258968806,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635173038
    },
    {
        "content": "<p>A really stupid idea came to mind over the weekend.... is it possible that Alissa did not find Security failures? That she just uncovered the system working exactly as the system was intending, exactly as their Policies are defined? Thus this is not a technical failure. This is a case where we look at this Policy outcome, and are not quite understanding how anyone could have THAT KIND OF POLICY on medical data.... This might simply be a Policy, that we collectively are shocked about.</p>",
        "id": 258970155,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635173557
    },
    {
        "content": "<p>The issue with patient access to access logs is that there will be a whole lot of individuals and organizations with legitimate reasons to access the data, but the patient will have no clue who they are or why they have access - which will lead to a lot of churn.  I'm not saying it shouldn't happen, I'm saying that doing it in a way that conveys enough context that an outsider can distinguish \"legitimate\" from \"inappropriate\" is super hard.</p>",
        "id": 258971218,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635173961
    },
    {
        "content": "<p>I agree that will be the initial setting... BUT, that is a solveable problem. Ignoring Transparancy is not a good solution.  The automatic exceptions baked into Accounting of Disclosures are so vast that there is nothing that actually qualifies to go into an Accounting of Disclosures log.</p>",
        "id": 258973583,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635174755
    },
    {
        "content": "<p>quite possibly it would be beneficial to EVERYONE, including the CEs, for the Access Report to drive these kind of discussions.  Those discussions could then drive more accurate Privacy Policies.</p>",
        "id": 258973727,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635174834
    },
    {
        "content": "<p>step one is to record Security and Privacy relevant events.... Step two is to figure out how that informs a useful Access Log report. Without Step one, step two can't happen. Without Step one, the DevSecOpts can't detect when bad activity is happening.</p>",
        "id": 258973961,
        "sender_full_name": "John Moehrke",
        "timestamp": 1635174926
    },
    {
        "content": "<p>\"that is a solveable problem\" - how?  If exposure results in noise, then that's not beneficial.  How do we enable exposure while ensuring that - from day 1 - noise is minimal.  (Noise = issues raised because of a perceived problem that isn't really a problem.)</p>",
        "id": 259002207,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635187233
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> and <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  I'm getting input  from security community there needs to be separation between disclosure in this ecosystem vs. policy advocacy.   Those 2 go hand in hand but it's complicated.  Good wisdom here from Katie Moussouris <a href=\"https://csrc.nist.gov/CSRC/media/Presentations/industry-bug-bounty-implementations-lessons/images-media/Industry%20Bug%20Bounty%20Implementations%20Lessons.pdf\">https://csrc.nist.gov/CSRC/media/Presentations/industry-bug-bounty-implementations-lessons/images-media/Industry%20Bug%20Bounty%20Implementations%20Lessons.pdf</a></p>",
        "id": 259006536,
        "sender_full_name": "Andrea Downing",
        "timestamp": 1635189269
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Thursday.20topic.3A.20presentation.20.26.20discussion.20w.20Alissa.20Knight/near/258915826\">said</a>:</p>\n<blockquote>\n<p>the code of conduct is part of a solution, but it needs to buttressed by testing</p>\n</blockquote>\n<p>I agree, of course.  And  <span class=\"user-mention\" data-user-id=\"197072\">@Paul Church</span> asked the \"who will pay for that testing?\"  I don't have a clue - I'm just bumping the question.</p>",
        "id": 259020426,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1635195871
    },
    {
        "content": "<p>Part of the answer to that is dependent on how much testing gets done and how expensive it is.  The more expensive, the fewer the number of apps that can afford to do it on their own - particularly those that are either free or don't rely on an advertising or other not-so-ideal method of self-funding.</p>",
        "id": 259024962,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635198444
    }
]