[
    {
        "content": "<p>Let's use this thread to capture various horror stories or mundane stories about how important it is to get errors corrected.</p>\n<p>Remember, this is not just about \"patients' rights\" or something - <strong>no clinician</strong> can perform to the top of his/her training if the chart is wrong. We need to clean up the chart so future docs can do their work!</p>",
        "id": 224275693,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1611798884
    },
    {
        "content": "<p>From my friend S on LinkedIn:  (I'm pretty sure she'll let us name her, since it was public on LinkedIn)</p>\n<p>Tag: Doc had 2 charts open and dictated someone else's into mine.</p>\n<hr>\n<p>My claim to fame was an ER visit for an x-ray that got missed up with another patient (elderly man admitted to the ICU) in their EHR (yes it is Epic).  The doctor basically had both charts open and dictated his notes into my chart at a very modern suburban hospital. </p>\n<p>The labs and other orders were mostly correctly attributed to the right patient but there was a 3 day delay in calling me to report on a concern in the x-ray because they thought I was in the ICU. </p>\n<p>My PC doc was notified of my \"admission\" and she called and asked me when I became a 73 y/o man ?</p>\n<p>Not only did my insurance pay his bill but they didn't seem to mind and it took me multiple calls and 2 visits to the hospital to the hospital to get anyone to correct my chart which was now full of incorrect diagnosis and history. </p>\n<p>The only \"correction\" was a note in my chart that said \" the above note was dictated for the wrong patient\" and the problem list was corrected to show \"resolved.\"</p>",
        "id": 224275820,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1611799006
    },
    {
        "content": "<p>Yikes!  Yes, we need to solve this and others like it sooner than later!</p>",
        "id": 224280457,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1611804560
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/True.20stories.20from.20patients.20-.20errors.20.26.20corrections/near/224275820\">said</a>:</p>\n<blockquote>\n<p>The only \"correction\" was a note in my chart that said \" the above note was dictated for the wrong patient\" and the problem list was corrected to show \"resolved.\"</p>\n</blockquote>\n<p>Hey all - providers and vendors: I can imagine that it might be illegal to ERASE stuff that was wrong, but isn't there a better label than \"resolved,\" which is false?  The problem in the problem list was never correct.  Is this a system design issue, or a local configuration issue? </p>\n<p>Tagging some vendor friends - <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> <span class=\"user-mention\" data-user-id=\"191929\">@Jeff Danford</span> <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> anyone?</p>",
        "id": 224321979,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1611838973
    },
    {
        "content": "<p>I know some systems have a concept of in error or cancelled that can be used</p>",
        "id": 224379582,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1611861985
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191356\">Jenni Syed</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/True.20stories.20from.20patients.20-.20errors.20.26.20corrections/near/224379582\">said</a>:</p>\n<blockquote>\n<p>I know some systems have a concept of in error or cancelled that can be used</p>\n</blockquote>\n<p>Say more say more!</p>",
        "id": 224382656,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1611863250
    },
    {
        "content": "<p>Not sure what more to add :) We have the ability for a practitioner to mark a doc as an in error status. This means it's still in the system if someone made decisions on it/legally but it wouldn't be displayed to any physician unless they were looking for in error documents. Most other concepts in our system have similar capabilities, though sometimes I think it gets marked as \"cancelled\" and the reason is error - this results in the same functional flow</p>",
        "id": 224386638,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1611865018
    },
    {
        "content": "<p>...and I guess those become FHIR resource with an <code>entered-in-error</code> status, so that systems that get data via FHIR can fix their copies as well</p>",
        "id": 224386969,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1611865192
    },
    {
        "content": "<p>Yes, and this is one of the reasons apps and systems must handle statuses :) You wouldn't want another system making a decision on data you had actually fixed/corrected</p>",
        "id": 224387798,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1611865631
    },
    {
        "content": "<p>So today apps might be getting data that says entered in error and might not be paying attention to that status?  I bet money that is happening :(</p>",
        "id": 224530903,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1611953341
    },
    {
        "content": "<p>It's very hard to stop people from creating 'bad' systems.  With FHIR, we have the \"isModifier\" flag and the security checklist that both try to call attention to the importance of paying attention to status values, plus education that reinforces the same.  There's still the \"making the horse drink\" problem though...</p>",
        "id": 224533108,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611954242
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span>  I am curious if apps are processing that flag or if any data is marked as in-error.  Also, what if the data is corrected on your system - can you show that and can the API tell?</p>",
        "id": 224565437,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1611981786
    },
    {
        "content": "<p>I'd expect that data that is corrected will show up as the same resource with a newer lastUpdated value, so app can get it</p>",
        "id": 224658053,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1612118265
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>  is correct, any updated data would be visible through the API on the same resource</p>",
        "id": 224768724,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1612203631
    },
    {
        "content": "<p>Agree with Lloyd but in my experience this is what happens.  People ignore the flags.  I have a huge list of the bad things I have seen people do with V2. I just hope that isn't happening.  Any kind of guardrails that can be put in place with validation, testing requirements, etc.  would be good.</p>",
        "id": 224830004,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1612242879
    },
    {
        "content": "<p>When applications go through our validation, the processing of modifiers is one of the things we check. However, the prior MU3 and new 21st Century Cures regulation doesn't allow us to require that apps go through validation if all they use is the USCDI/CCDS set of read only APIs. Provider systems can validate provider apps (or delegate that to us), but patient facing applications can choose to bypass validation by either party.</p>",
        "id": 224885599,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1612279340
    },
    {
        "content": "<p>meant to put this in a different thread.....</p>",
        "id": 224961093,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612314620
    },
    {
        "content": "<p>When we were 'going digital' at our hospital, there were a lot of left/right errors, and then subsequent surgical or radiation dosage mishaps.  We had 150K cases a year, and something like a 3.6 sigma error rate when we began the installation, which still resulted in 50 to 100+ lawsuits that went to court each year due to medical errors.  We had a weekly subpoena list/report, in fact.  Left/right error is definitely up there in top-10 or top-5 most common, along with dictation on the wrong patient.</p>",
        "id": 225797055,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1612936221
    },
    {
        "content": "<p>Here's a mundane story of a miscommunication between my pharmacy (CVS) and my health insurance (Aetna). At my annual checkup with my doc, we discuss the shingles vaccine and that I should get it after my covid vaccine. I go to CVS this weekend, ask about the shingles vaccine, pharmacist looks up my record through Aetna and tells me \"Aetna says you already had the shingles vaccine\", I ask him when, he can't say - talk to Aetna. I don't recall ever getting this vaccine but maybe it was 10 years ago or more and I forgot? So that prompts me to check all my immunizations and I record all those electronically and on my yellow paper card. Then I call Aetna, a representative helps me, searching for any claims for a shingles vaccine - can't find any. She asks me, did you have an annual checkup? I say yes. She says that sometimes just having an annual checkup will give false flags about immunizations. So I ask again, are you saying that when the system thinks I have had the shingles vaccine, it is wrong. She confirmed. So I go back to CVS, armed with my full story of fact-checking. Same CVS, different pharmacist, I get the shingles vaccine, no questions asked. Wow! If I had just taken the word of the first pharmacist, I could have thought I must have gotten it years ago and forgot - great, it's a lifetime vaccine, no worries! We must be vigilant with our own records - I happened to have 10 years of historical Aetna statements on my computer with the skills to do global searches, so I was able to update my immunization records. My guess is most people would not have the data, skills or patience to do this. Not only must we make our health data correct, we must make it accessible.</p>",
        "id": 242536420,
        "sender_full_name": "Jay Gauthier",
        "timestamp": 1623626850
    },
    {
        "content": "<p>This is an example of how incorrect clinical information is  being pulled from insurance company.  Another reason for a way to request correct ion to payor's data.</p>",
        "id": 243113177,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1623987637
    },
    {
        "content": "<p>Jay, Thanks for sharing your story.  It reflects so our challenges throughout the health system.  Bart</p>",
        "id": 243603312,
        "sender_full_name": "Bart Carlson",
        "timestamp": 1624418364
    },
    {
        "content": "<blockquote>\n<p>sometimes just having an annual checkup will give false flags about immunizations</p>\n</blockquote>\n<p>!!!   This is appalling!  What professional incompetence - what malfeasance!</p>\n<p>Recently I've been reviewing my blogging over the past 12 years, and this is the sort of thing that used to trigger rightful incendiary blogging.  By now I'm just too tired to crank up the \"informative flamethrower\" motivation anymore.</p>\n<p>Good lord!</p>",
        "id": 243635635,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1624446476
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"415200\">@Jay Gauthier</span> could I paste that into a blog post?</p>",
        "id": 243635728,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1624446524
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> Absolutely. I haven't even begun my \"rightful incendiary blogging\" journey, so just add this one to yours.</p>",
        "id": 243731723,
        "sender_full_name": "Jay Gauthier",
        "timestamp": 1624496727
    }
]