[
    {
        "content": "<p>In both Morgan and Olivier's talk, I considered how much Morgan and the medical student in Olivier's presentation, must have learned about themselves through the data entry and manual aggregation of their data.  I learn alot and organize my thought process when I take notes, on manually aggregate data.  I agree that it should all be automated but maybe there is a way to retain some of that learning. with the web we all have so much data at our finger tips but we know so little.</p>",
        "id": 201056717,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1592332568
    },
    {
        "content": "<p>This is an interesting point. Ultimately I think people need the flexibility to skip over the manual difficult work and just access even a few \"canned\" insights about their own data -- by analogy, the kinds of things I might get out of a financial dashboard that helps me understand my monthly expenses by automatically applying categories, even if I don't go through the trouble of aggregating that spreadsheet of expenditures myself.</p>",
        "id": 201083413,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592347639
    },
    {
        "content": "<p>there's always something to be gained from exploring and doing the synthesis work at a low level by oneself, but this should be a choice rather than by necessity :-)</p>",
        "id": 201083454,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592347677
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Understanding.20your.20data/near/201083413\">said</a>:</p>\n<blockquote>\n<p>... by analogy, the kinds of things I might get out of a financial dashboard that helps me understand my monthly expenses by automatically applying categories, even if I don't go through the trouble of aggregating that spreadsheet of expenditures myself.</p>\n</blockquote>\n<p><span aria-label=\"up\" class=\"emoji emoji-2b06\" role=\"img\" title=\"up\">:up:</span> <span aria-label=\"up\" class=\"emoji emoji-2b06\" role=\"img\" title=\"up\">:up:</span> This!  Entirely apt analogy.  Most people go through life needing only enough to feel that things are going okay. But when trouble hits is NOT the time to start plowing through to discover what went wrong.</p>",
        "id": 201084684,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1592348620
    }
]