[
    {
        "content": "<p>In today's Patient Empowerment WG meeting, <span class=\"user-mention\" data-user-id=\"298778\">@Terrie Reed</span> presented what seems to be an important policy topic.  Our bottom line from the meeting was that those of us who are interested will volunteer to participate in whatever actions she organizes. (This is not  specific to HL7, but is certainly relevant to patient safety and patient empowerment in general.)</p>\n<p>Get in touch with her if you want to participate too.  Here's that block from today's minutes:</p>\n<hr>\n<p>Terrie has a request that we stand \"shoulder to shoulder\" with other patient-centric groups to assert that Device Data must/shall be inserted into the EMR. (This would have the effect of mandating that it be given to patients, because anything in the EMR must be available to patients.)</p>\n<p>Notes from the call:</p>\n<ul>\n<li>UDI (Unique Device Identifiers) was a new topic in 2013, when important certification criteria were being defined for EHRs. There were promises (FDA) that implant UDI would be on the label and would be in the EHR. UDI is analogous to a retail UPC on steroids - lot number, serial number, lots of clinically significant info etc etc.</li>\n<li>But ONC's 2014-2015 EHR certification criteria did not include a mandate to include UDI info, because the FDA policy hadn't kicked in yet.</li>\n<li>Today the FDA policy exists but has not been reflected yet in ONC policy.(!) This is what Terrie wants to fix.<ul>\n<li>btw, one way this shows up is in PPE. They're not implants, but still, without UDI being required, products are being introduced with no ability to track efficacy, failures, etc.</li>\n</ul>\n</li>\n<li>Side note: FDA just announced a postponement (??? of what, Terrie?) for Class 1 (low risk) products.</li>\n</ul>\n<p>Terrie wants to connect with other people &amp; groups to urge full implementation, for instance writing a letter about the Class 1 delay, and more.</p>\n<p>At stake is tracking efficacy, recalls, lots more. Also, for patient safety reasons, a needed MRI may be prevented if full info isn't available on a patient's implants.</p>\n<p>Debi sums up the situation: today there's a mandate to send UDI info <em>out</em> of the EHR if it's in there, but no mandate to put it <em>in</em> the EHR.  </p>\n<p>Abbie: Policies need to reflect the reality that this kind of device is entirely different from \"consumer level\" devices the FDA has dealt with, like fitness trackers.</p>\n<hr>\n<p>Again, if you want to participate in this advocacy (with the FDA, ONC, etc), get in touch with Terrie.</p>",
        "id": 206177304,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1596737624
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> <span class=\"user-mention\" data-user-id=\"298778\">@Terrie Reed</span> I fully support this. I was not aware of the \"mandated out, but not mandated in\" situation, as summed up well by <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> : \"Today there's a mandate to send UDI info out of the EHR if it's in there, but no mandate to put it in the EHR.\" </p>\n<p>If adding names (and a brief individual descriptor, such as \"Caregiver to my XXXX, LOCATION Y\", \"medical professional at XXXX, LOCATION Y\", \"Patient living with condition XXXX in LOCATION Y\" etc.) to letters (or any other medium used) are created in ways that make it that easy for public and stakeholders in the US to add their name and support to this very necessary policy upgrade/oversight, I will let every interested person I know in the US how to add their name to the initative(s).</p>",
        "id": 206213359,
        "sender_full_name": "Hamish MacDonald",
        "timestamp": 1596760272
    },
    {
        "content": "<p>In the EU, the Eudamed UDI medical device database was supposed to be online ages ago, but still isn't.<br>\nThe Medical Device Regulation (MDR) refers to it, though, and mandates the use of Eudamed UDI's for all medical devices. The transition period from Medical Device Directive (MDD) to MDR was extended by a year.<br>\nNone of this seems to be meeting the set timeframes in Europe.<br>\n<a href=\"https://www.medtecheurope.org/news-and-events/news/medical-device-coordination-group-clarifies-device-and-udi-registration-timelines-under-mdr-and-ivdr/\">https://www.medtecheurope.org/news-and-events/news/medical-device-coordination-group-clarifies-device-and-udi-registration-timelines-under-mdr-and-ivdr/</a></p>",
        "id": 206242493,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1596796132
    },
    {
        "content": "<p>I appreciate this being included in yesterday's Patient Empowerment WG and that there is interest in working together to highlight gaps in UDI implementation. The only addition I would make to the excellent notes is that although UDI was not on all implants when the 2015 ONC Certification criteria were put in place, it is now 2020 and implant manufacturers should have the vast majority of products marked with UDI.  They should also have submitted mandatory product information about the implant to AccessGUDID <a href=\"https://accessgudid.nlm.nih.gov\">https://accessgudid.nlm.nih.gov</a>.  The result - implants now have UDIs assigned and a robust regulatory source of device data is available,  but there is a lack of urgency to make sure that UDI is required in patient records.  FDA is also not requiring UDI for every recalled implant that has a UDI assigned to it.  Without UDI it is extremely difficult for patients with recalled devices to be notified or prevent them from being exposed to recalled products.  In fact we do a better job notifying customers that their onions have been recalled (e.g. I received a text messsage from my retailer about onions I purchased that had a certain  UPC) than we do for patients with implant.</p>",
        "id": 206275483,
        "sender_full_name": "Terrie Reed",
        "timestamp": 1596816235
    },
    {
        "content": "<p>UDI is a global standard.  While at FDA I worked on International efforts to harmonize across 12 regions.  The delays are unfortunate but the US can lead the way.  I don't have a lot of experience with patient advocacy so would appreciate finding an existing advocacy group or groups that would support making UDI more of a priority for patient safety.</p>",
        "id": 206276144,
        "sender_full_name": "Terrie Reed",
        "timestamp": 1596816576
    },
    {
        "content": "<p>Having helped in bar code supply rollouts, it's generally more of a question of healthcare organizations spending the time/effort and less a lack of EHR functionality. Takes a relatively large investment to integrate their ERP / inventory management system with the EHR (as well as other sources, like their pacemaker system). Beyond that, they have to have their shit together in terms of their inventory management and tracking.</p>",
        "id": 206361399,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1596915887
    }
]