[
    {
        "content": "<p>Patient API soup for the world: Is anyone aware of a plan afoot (even better, a roadmap with a timeline) to make US Core and the IPS easily cross referenceable, at least for the data points where they intersect? </p>\n<p>Background: My understanding is that the patient-facing IGs that are being developed in the US to meet the ONC/CMS regulations are all deriving from US Core, YET there is a push from ONC now via the GDHP to promote IPS. </p>\n<p>Issue: The IPS can’t/won’t replace the US Core IG as the latter contains all the US-specific identifiers, extensions, code systems, terminologies, etc. So for vendors working internationally including the US it sounds like there will be a real need for these to be cross-referenceable. </p>\n<p>Also, wondering whether Apple will implement the IPS at some stage or continue with the Argonaut FHIR DSTU2 API.</p>\n<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"365197\">@Matthew Valentine</span> <span class=\"user-mention\" data-user-id=\"197704\">@Roheeni Bhana</span></p>",
        "id": 220056527,
        "sender_full_name": "Hamish MacDonald",
        "timestamp": 1608073699
    },
    {
        "content": "<p>Take a look at <a href=\"https://build.fhir.org/ig/grahamegrieve/ipa-candidate/\">IPA (International Patient Access)</a>.  It's intended to be a non-US-specific equivalent to US Core and there's been work to harmonize it with IPS.  Grahame's been leading the work, though he's been sucked into other things lately.  The notion is that US-Core, AU-Core, CA-baseline and other international \"core\" IGs would themselves build on IPA.</p>",
        "id": 220057166,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1608074079
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/US.20Core.20IG.20vs.20IPS.20iG/near/220057166\">said</a>:</p>\n<blockquote>\n<p>The notion is that US-Core, AU-Core, CA-baseline and other international \"core\" IGs would themselves build on IPA.</p>\n</blockquote>\n<p>Oo, I like the sound of that!</p>",
        "id": 220067287,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1608081698
    }
]