[
    {
        "content": "<p>Hey USCDI gurus:  a question arose in email: This \"brings up the question of the continuing relevance of USCDI at all, since by the time any updates would be implemented “all EHI” would have to be provided by regulation.  Did the group discuss this aspect?\"</p>\n<p>Someone replied </p>\n<blockquote>\n<p>The “all EHI” in the mandate does not require the covered entity to provide the data in FHIR format. I believe USCDI is specific to FHIR format. So, identifying the most important elements we would like to be shared via FHIR is important and relevant.</p>\n</blockquote>\n<p>Reality check on all the above, anyone?</p>",
        "id": 210822670,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600741451
    },
    {
        "content": "<p>Yes, that reply is basically right. ONC has a path forward for standardized data (USCDI) and a path for all data whether standardized or not (EHI Export). The idea is that over time, USCDI chips away at the size of the \"dark\" (non-standardized) data -- though in practice health science keeps growing, so I doubt the gap will net shrink.</p>",
        "id": 210822737,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600741602
    },
    {
        "content": "<p>My personal take is that non-standardized data will be with us forever (we'll never standardize everything; the frontier keeps moving) and will be super damn useful, so I'm dismayed that ONC's EHI Export requirements include no concept of automation.</p>",
        "id": 210822793,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600741723
    },
    {
        "content": "<p><a href=\"https://smarthealthit.org/2019/05/final-smart-team-comments-on-the-21st-century-cures-act-interoperability-rule/\">https://smarthealthit.org/2019/05/final-smart-team-comments-on-the-21st-century-cures-act-interoperability-rule/</a> has a section called \"Provide API Access for Data Exports\" that captures my perspective, and some background.</p>",
        "id": 210822873,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600741821
    },
    {
        "content": "<p>Thanks Josh!</p>",
        "id": 210823711,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600743277
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> under HIPAA data can be shared for TPO without a patient moving it.  When you sign the HIPAA form you \"know\" that.  The way covered was used just meant covered entity provides an API (through which one could request data).  Also, while it is clear that all data, standardized, is desired, that is not what ONC is asking for sadly.</p>",
        "id": 210825008,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600745367
    },
    {
        "content": "<p>Josh said it best.</p>\n<p>Simply best, the EHI rule is so vague that it'll just come down to how EHRs implement it. </p>\n<p>USCDI's benefit is its uniformity. So it's relevant and powerful, assuming we get that ubiquitous uniformity.</p>",
        "id": 210827023,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1600748649
    },
    {
        "content": "<p>I disagree with Josh on the usefulness of non-standard data. Mainly because there will be no agreed upon context for the data, and without an understandable context the data will not be useful. </p>\n<p>We've seen that when claims data was <a href=\"https://www.healthimaging.com/topics/health-it/google-health-stumbles-over-insurance-claims-data\">attempted to be used for personal health information</a> it didn't work. I think even <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> had similar experience, and I believe that it is that lack understood context that will severely limit the usefulness of non-standard data.</p>\n<p>USCDI, on the other hand, can help provide a sustained expansion of standardized data sharing with the appropriate support of the US Core IG. I just hope that the effort expended for the required implementation of EHI export doesn't get in the way of the continued development of USCDI.</p>",
        "id": 210827158,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1600748905
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"200498\">@Brendan Keeler</span> We are working on submitting proposals for USCDI - You had some good ideas - would you be able to take a stab at the form?  Also, we wanted to try to be a bit more generic and use your ideas as examples.  Like a new class of Structured Clinical Observations with the different datasets as examples.  Not sure if it would fly.  Examples of filled out forms here <a href=\"https://confluence.hl7.org/rest/hotovo/amazon-s3/1.0/buckets/33/content/download?path=USCDI%20Proposals/TREED%20USCDI-ONDEC-Submission-Form-Prep-Sheetv2%20(1).docx&amp;targetId=86974077\">https://confluence.hl7.org/rest/hotovo/amazon-s3/1.0/buckets/33/content/download?path=USCDI%20Proposals/TREED%20USCDI-ONDEC-Submission-Form-Prep-Sheetv2%20(1).docx&amp;targetId=86974077</a> and here: <a href=\"https://confluence.hl7.org/rest/hotovo/amazon-s3/1.0/buckets/33/content/download?path=USCDI%20Proposals/USCDI-ONDEC-Submission-Form-Prep-Sheet-consents.docx&amp;targetId=86974077\">https://confluence.hl7.org/rest/hotovo/amazon-s3/1.0/buckets/33/content/download?path=USCDI%20Proposals/USCDI-ONDEC-Submission-Form-Prep-Sheet-consents.docx&amp;targetId=86974077</a></p>",
        "id": 210836048,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600760054
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/USCDI.20.3C.3D.3E.20FHIR.20reality.20check.20pls.3F/near/210827158\">said</a>:</p>\n<blockquote>\n<p>We've seen that when claims data was <a href=\"https://www.healthimaging.com/topics/health-it/google-health-stumbles-over-insurance-claims-data\">attempted to be used for personal health information</a> it didn't work. I think even <span class=\"user-mention silent\" data-user-id=\"197491\">Dave deBronkart</span> had similar experience, and I believe that it is that lack understood context that will severely limit the usefulness of non-standard data.</p>\n</blockquote>\n<p>Yes, <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>, your link is about my case. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>   It was what involuntarily launched me on this crusade 11 years ago, and was a core part of my ten part series last year on why FHIR is essential: <a href=\"https://tincture.io/an-information-quality-trainwreck-google-health-revealed-the-mess-in-my-hospitals-data-5f3eef4e2dc3\">An information quality trainwreck: Google Health revealed the mess in my hospital’s data</a></p>\n<p>BUT - and importantly - this very much does not mean there should be any limits on what data can be moved around, because creating those limits means we have decided <em>a priori</em> that there couldn't possibly be any value to that data being moved around.  We (all) are in no position to know what in that \"big fat file folder\" might be needed and why. </p>\n<p>It DOES mean, though, that while we should allow it all to get moved around, we shouldn't at all assume that it's valid.  History has taught us that it can contain lots of garbage as well as gold (and tin etc). </p>\n<p>In short, the usefulness <em>for automation</em> is severely limited by the unknown content of that blob of stuff - but to me that simply means that a blob is a blob and its <em>processing</em> cannot be automated.  But blobs cannot be disallowed.</p>\n<p>This may be worthy of further discussion &amp; documentation by this WG, if people feel that way.</p>",
        "id": 210856315,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600773723
    },
    {
        "content": "<blockquote>\n<p>I disagree with Josh on the usefulness of non-standard data. Mainly because there will be no agreed upon context for the data, and without an understandable context the data will not be useful.  We've seen that when claims data was <a href=\"https://www.healthimaging.com/topics/health-it/google-health-stumbles-over-insurance-claims-data\">attempted to be used for personal health information</a> it didn't work.</p>\n</blockquote>\n<p>I believe Dave's case was actually an example of creating a <em>standardized</em> data payload (CCR? CCD?) with the wrong data (clinical fields incorrectly populated with information from claims). Data quality is a persistent problem no matter how you write things down -- but the more pressure there is to write things down in a \"standard\" way, the easier it becomes for Dave's story to repeat itself (because sometimes when you are focused on strictly following a standard, you lose the ability to convey nuance and context).</p>\n<p>Don't get me wrong, I love standards, but it's unfair to say that non-standardized data (particularly) will lead to these kinds of misinterpretation issues.</p>",
        "id": 210863773,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600778458
    },
    {
        "content": "<p>I took a look at the form a few weeks ago and found the process a bit complex. I can take another look with the examples you put together.</p>",
        "id": 210872672,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1600782870
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/USCDI.20.3C.3D.3E.20FHIR.20reality.20check.20pls.3F/near/210863773\">said</a>:</p>\n<blockquote>\n<p>I believe Dave's case was actually an example of creating a <em>standardized</em> data payload (CCR? CCD?) with the wrong data (clinical fields incorrectly populated with information from claims). </p>\n</blockquote>\n<p>For what it's worth, here's Halamka's <a href=\"http://geekdoctor.blogspot.com/2008/05/launch-of-google-health.html\">May 2008 declaration of victory</a> saying that they'd finalized their Google Health interface.  It cites \"a proprietary form of CCR, CCR/G\" (for Google) and CCD, but I have no clue what reality was. I'd welcome any insights from anyone who was involved back then.</p>\n<p>Just for posterity, here are my blog posts from that 2009 episode.</p>\n<ul>\n<li>3/01/09: <a href=\"https://participatorymedicine.org/epatients/2009/03/im-putting-my-data-in-google-and-healthvault.html\">I’m putting my data in Google and HealthVault</a> - my post expressing interest in seeding an ecosystem of health apps</li>\n<li>4/01/09: <a href=\"https://participatorymedicine.org/epatients/2009/04/imagine-if-someone-had-been-managing-your-data-and-then-you-looked.html\">Imagine someone had been managing your data, and then you looked.</a> - the post that described what happened when I clicked the button</li>\n<li>4/09/09: <a href=\"https://participatorymedicine.org/epatients/2009/04/the-i-in-it-stands-for-information.html\">The I in IT stands for Information</a> - an attempt to explain (as an ordinary data jockey) what IT is about. (Jeeze, was it really necessary to explain this?? Yes, too many people in health IT were acting as if this was all a surprise.)</li>\n<li>4/12/09: <a href=\"https://participatorymedicine.org/epatients/2009/04/part-of-it-is-encoding-information.html\">Encoding information is part of IT</a> - ditto</li>\n<li>4/17/09: <a href=\"https://participatorymedicine.org/epatients/2009/04/quick-update-on-moving-my-data.html\">Quick update on moving my data</a> - the outcome of the call we had with Halamka, which ended with the decision to stop using billing codes as a proxy for reality (arg)</li>\n<li>4/18/09: <a href=\"https://participatorymedicine.org/epatients/2009/04/globe-follow-up-on-my-hospitals-decision-to-stop-transmitting-billing-data-as-clinical-history.html\">Globe follow-up on my hospital’s decision to stop transmitting billing data as clinical history</a></li>\n<li>4/19/09: <a href=\"https://participatorymedicine.org/epatients/2009/04/completing-my-list-of-billing-code-errors.html\">Completing my list of billing code errors</a> - a rather bone-chilling list of insanities</li>\n</ul>",
        "id": 210906715,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600796836
    },
    {
        "content": "<p>It is an unweildy form but I was able to throw one together with some stuff blank for advanced directives</p>",
        "id": 210963406,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600842660
    },
    {
        "content": "<p>I'd like to see us work on USCDI next week as a focused group, rather than with attendees who need to be enticed to stay with us and grow as we grow.  Can we backlog the USCDI discussion to next week?</p>",
        "id": 211136521,
        "sender_full_name": "Maria D Moen",
        "timestamp": 1600956673
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"270306\">@Maria D Moen</span> are you saying DON'T discuss this week, or continue next week?</p>",
        "id": 211141095,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600958577
    },
    {
        "content": "<p>I'm saying I'd like to dig into the USCDI topic next week, not this week.  We're spread pretty thin this week and I find value in working on items that draw people to our group instead of digging into more detailed, painstaking work.</p>",
        "id": 211142635,
        "sender_full_name": "Maria D Moen",
        "timestamp": 1600959185
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> I too am feeling like we have more than enough with our IG and WP projects; we're already bumping Pt Contributed Data out of the current session.  </p>\n<p>Co-chairs <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> and <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> what are your thoughts?</p>",
        "id": 211143504,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600959520
    },
    {
        "content": "<p>USCDI next week is fine with me.</p>",
        "id": 211146562,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1600960733
    },
    {
        "content": "<p>I agree about drawing people in.  I really just want to get suggestions for USCDI to PAC since they will be making final decisions anyway.  They are on a short timeline to pull it all together and we may run out of time.</p>",
        "id": 211150322,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600962393
    },
    {
        "content": "<p>what is their short timeline?  I wonder if we can collect the suggestions you seek in some format besides meeting time</p>",
        "id": 211150771,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600962603
    }
]