[
    {
        "content": "<p>ONC is asking for ideas for new data types to be added to the USCDI for their draft 2.  So the question is, what is missing from V1 that would be useful to patients?  <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> and I were thinking about this the other day.</p>\n<p>Here is V1: <a href=\"https://www.healthit.gov/isa/united-states-core-data-interoperability-uscdi\">https://www.healthit.gov/isa/united-states-core-data-interoperability-uscdi</a></p>\n<p>HL7 PAC will be asking our workgroup for suggestions so I figured I would be proactive.   What is not on that list that is a priority?</p>",
        "id": 206889201,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1597367285
    },
    {
        "content": "<p>I would love to propose an exercise for anyone who finds this interesting:</p>\n<p>1) retrieve your data through your provider's existing FHIR API (which isn't quite the USCDI but it's close, especially for Epic sites that include clinical notes), and </p>\n<p>2) also request a copy of your full designated record set via printer/mail/fax.</p>\n<p>Compare them and summarize the difference.</p>\n<p>Bonus points if you have multiple encounters or a \"complex\" history.</p>\n<p>Bonus points if you feel comfortable making both publicly available :-)</p>",
        "id": 206889603,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597367873
    },
    {
        "content": "<p>done... Im too boring, I avoid doctors. Nothing in medical record not found outside of USCDI (including clinical notes and images). I guess the one thing is images in all their dicom glory, rather than non processable jpeg. I hope we are okay with images following DICOM Web (the modern dicom). <br>\n However on my non-healthcare sites: (23andMe) Genetic markers, Genetic Conditions, (runKeeper) Exercise history including when, how long, heart rate during, pace, elevation delta, etc, and (fitbit) SPO2 deviations during sleep (wish it was a pulse ox), exercise history (max heart rate during exercise, recovery rate), daily step count achieved, sleeping pulse, etc. -- not sure I would recommend these be added as core, but would be good to get recommendation in an IG so that these are represented in my PHR consistently.</p>",
        "id": 206921656,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597406310
    },
    {
        "content": "<p>In terms of pure clinical data, my mind gravitates to specialty datasets, like oncology staging data, episodic obstetric information, cardiology discrete data or pathologic eCC data. Might be summarized in notes but ideally discrete which I don't think is covered today</p>",
        "id": 206925739,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1597409506
    },
    {
        "content": "<p>A PHR should ultimately be a organization agnostic patient portal. So the bigger outcome would be all the adminstrative data and functions. That's how you get the average healthy person interested. Insurance, eligibility, appointments, referrals, bills.</p>",
        "id": 206926022,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1597409750
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194096\">@Brendan Keeler</span> it's a good perspective, and may be worth stating more explicitly that a core <em>data</em> set will only get us so far in a world where we need <em>capabilities</em> and <em>workflows</em> standardized.</p>",
        "id": 206927183,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597410545
    },
    {
        "content": "<p>Re: discrete data, very quickly we get into the challenge that the USCDI is intended to be a target for standardization. But the kinds of discrete data Brendan describes are generally not standardized and honestly we're not all that close consensus about how to standardize them. So for me the low-hanging fruit is actually to make sure that a full data export, even if not standardized, is available through an API (and not just some out-of-band mechanism).</p>",
        "id": 206927379,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597410676
    },
    {
        "content": "<p>Obstetric discrete data like LMP and EDD, are fairly core to a woman who is pregnant and also quite standardized.</p>",
        "id": 206927705,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1597410924
    },
    {
        "content": "<p>If someone is pregnant, a PHR is significantly devalued without that data. Likewise, a PHR is significantly devalued for a cancer patient without staging data.</p>",
        "id": 206927857,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1597411020
    },
    {
        "content": "<p>Agree 100%!</p>",
        "id": 206932346,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597413835
    },
    {
        "content": "<p>I agree on the pregnancy/delivery information. We have FHIR IGs being developed for birth certification and for birth defect reporting that benefit greatly if information about the woman's pregnancy history and current pregnancy were accessible.</p>",
        "id": 206944493,
        "sender_full_name": "Craig Newman",
        "timestamp": 1597420532
    },
    {
        "content": "<p>Radiology and genomics, obviously.  So +1 for ImagingStudy and Sequence resources.  </p>\n<p>After that....  behavioral health.  A lot of that resides in somewhat subjective clinician notes, which may or may not be exempt from disclosure to the patient.  As such, there's a patient advocacy interest in the LGBT community to push back against psychiatric malpractice.   One way to do that is to be able to submit receipts into the health record.  Another way is through a health-diary or social media blogging.   So I'd advocate for ClinicalImpression and Evidence resources.</p>\n<p>Along with obstetrics, there's the related fields of fertility medicine and biobanking.  It's still a maturity level 0 resource, but if we're tracking implantable UDIs, I think there's an argument for BiologicallyDerivedProduct. </p>\n<p>From the PHR perspective, it's possible to record Dermatograms in a simple Media resource; but that approach doesn't store annotations and markups.   So a vote for a new Dermatogram resource to manage things like mole counts and tattoo planning/removal and so forth.  Also, when a patient has a PHR, baselining becomes a new activity.  So a vote for Baseline as a new resource, similar to Evidence, that rolls up a collection of Observations and defines a patient specific reference range.</p>",
        "id": 207040044,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1597526678
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/USCDI/near/206889603\">said</a>:</p>\n<blockquote>\n<p>1) retrieve your data through your provider's existing FHIR API (which isn't quite the USCDI but it's close, especially for Epic sites that include clinical notes), and </p>\n<p>2) also request a copy of your full designated record set via printer/mail/fax.</p>\n<p>Compare them and summarize the difference.</p>\n<p>Bonus points if you have multiple encounters or a \"complex\" history.</p>\n<p>Bonus points if you feel comfortable making both publicly available :-)</p>\n</blockquote>\n<p>Josh, as I imagine you'd guess, I'm entirely willing to do that, though I'm not sure the world wants to see ALL of it.:-)  I'd leave \"summarize the difference\"  to someone with more ambition...  (For those who don't know the back story, I published a large amount of garbage in <a href=\"https://participatorymedicine.org/epatients/2009/04/imagine-if-someone-had-been-managing-your-data-and-then-you-looked.html\">a 2009 blog post</a>.)</p>\n<p>Also, I'm pretty sure Beth Israel Deaconess doesn't have a FHIR API, though maybe I'm out of date on that. (Embarrassed to ask, but how do I find out?  Ask PatientSite tech support?)</p>\n<p>Do we include radiology reports, e.g. my famous \"bowel is grossly unremarkable\"?  Pathology?  Both of those can be important when urgently seeking a second opinion.</p>\n<p>At some point we might want to cast a wider net, inviting input from deeply savvy advocates and patients like Grace Cordovano, <span class=\"user-mention\" data-user-id=\"311598\">@Bray Patrick-Lake</span> , <span class=\"user-mention\" data-user-id=\"311763\">@Morgan Gleason</span> ... depending on whether we have time</p>",
        "id": 207040902,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1597528080
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191531\">Virginia Lorenzi</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/USCDI/near/206889201\">said</a>:</p>\n<blockquote>\n<p>ONC is asking for ideas for new data types to be added to the USCDI for their draft 2.  So the question is, what is missing from V1 that would be useful to patients?  <span class=\"user-mention silent\" data-user-id=\"225094\">Debi Willis</span> and I were thinking about this the other day.</p>\n<p>Here is V1: <a href=\"https://www.healthit.gov/isa/united-states-core-data-interoperability-uscdi\">https://www.healthit.gov/isa/united-states-core-data-interoperability-uscdi</a></p>\n<p>HL7 PAC will be asking our workgroup for suggestions so I figured I would be proactive.   What is not on that list that is a priority?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span>  what's the timeline?</p>",
        "id": 207040954,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1597528109
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"200498\">Brendan Keeler</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/USCDI/near/206926022\">said</a>:</p>\n<blockquote>\n<p>A PHR should ultimately be a organization agnostic patient portal. So the bigger outcome would be all the adminstrative data and functions. That's how you get the average healthy person interested. Insurance, eligibility, appointments, referrals, bills.</p>\n</blockquote>\n<p>Do we (collectively) have an agreed definition of \"PHR\"?  To some people it's a pretty light-weight app tool, while to others (including you, I speculate) it may or may not be an app, and stretches to be as robust any current situation requires.</p>\n<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> I'm sure you have substantial experience-based thoughts on this, as do other app develops!</p>",
        "id": 207041036,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1597528250
    },
    {
        "content": "<p>I would also encourage everyone to distinguish between \"here are some data elements in my record that I want to share with apps\" vs \"here are some data types that I wish the medical field did a better job collecting and representing in a consistent way\".</p>\n<p>Our experience/success to-date is almost entirely in the former camp, and I am very skeptical of HL7 ability to influence the latter. I am not trying to be a naysayer particularly, but more to focus effort on areas most likely to be successful, or to ensure we are setting up very new and different conversations if we are trying to influence clinical practice.</p>",
        "id": 207042116,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597529677
    },
    {
        "content": "<p>Another thing to consider is what is on the list but needs to be better defined or delineated. I’m with Dave - how do you find out whether your provider has a FHIR app. </p>\n<p>Sent from my iPhone</p>",
        "id": 207045931,
        "sender_full_name": "Terrie Reed",
        "timestamp": 1597536548
    },
    {
        "content": "<blockquote>\n<p>(Embarrassed to ask, but how do I find out? Ask PatientSite tech support?)</p>\n</blockquote>\n<p>There is no standard way to do that - you have to (try) to ask _someone_ at the hospital</p>",
        "id": 207076917,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1597593449
    },
    {
        "content": "<p>(if you know where your patient portal is, you can poke around there -- like, if it's an Epic MyChart portal then you probably have FHIR API access, and can confirm by looking at <a href=\"https://open.epic.com/MyApps/Endpoints\">https://open.epic.com/MyApps/Endpoints</a> ; an alternative way is to start from an app like Apple Health or MyFHR and use the directory built into that app to see if it is connected to your provider.)</p>",
        "id": 207077027,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597593613
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/USCDI/near/207042116\">said</a>:</p>\n<blockquote>\n<p>Our experience/success to-date is almost entirely in the former camp, and I am very skeptical of HL7 ability to influence the latter. I am not trying to be a naysayer particularly, but more to focus effort on areas most likely to be successful, or to ensure we are setting up very new and different conversations if we are trying to influence clinical practice.</p>\n</blockquote>\n<p>I'm going to provide a slight pushback on this, regarding what constitutes 'the medical field'.  The success-to-date has primarily involved medical businesses that have regulatory oversight, via HIPAA, FDA, etc, and already viewed themselves as being health or medical related.   But with new legal mandates and standardized APIs, the lift to implement one API schema versus another is much lower.  </p>\n<p>Take Facebook for example.  There's a huge amount of behavioral health data in Facebook, and the data _could_ be provided in FHIR format as easily as any other API.  And if there were an implementation guide and ClinicalImpression were part of USCDI, then it would be that much easier for Facebook or a 3rd party app to provide a bridge between Facebook and a PHR or EHR.  There would need to be a user interface for filtering which posts got converted into ClinicalImpression records.  But it's all fairly straightforward and doable.</p>\n<p>My point being is that there are data silos in the deep web that haven't considered themselves 'medical'  to date.  Microsoft Outlook and Salesforce are two good examples of this process in action.  Calendaring didn't necessarily consider itself 'medical', but when an API was made available, both businesses decided it made sense to implement Person, Organization, Appointment, Slot, etc.  </p>\n<p>Why can't Quickbooks or TurboTax export over-the-counter medical receipts as an Evidence or Claim?  If there was an API spec and implementation guide, that might be a great feature for them to implement.  </p>\n<p>As for new resource types, we have a right to represent our various users or constituents, and my offering Dermatogram and Baseline are based on discussion with many people about what _is_ in their medical records.  Ad nauseum, in fact.   I don't need to get into details, but  suffice it to say that the users I work and design product with have well established political structures in place to influence clinical practice.  I bring up Dermatogram and Baseline because those are things that are in some records, should be in others, and are appropriate for HL7 discussion.</p>\n<p>By comparison, I didn't bring up digital avatars at all.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span> <span aria-label=\"speechless\" class=\"emoji emoji-1f636\" role=\"img\" title=\"speechless\">:speechless:</span></p>",
        "id": 207084320,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1597604398
    },
    {
        "content": "<p>I don't disagree with any of your examples about where we might find \"FHIR data\" outside the conventional clinical realm. Does this make them good targets for USCDI though, given the scope of ONC's mandate (and the Cures act generally)?</p>",
        "id": 207085537,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597605670
    },
    {
        "content": "<p>Yes.  It does.</p>",
        "id": 207086226,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1597606888
    },
    {
        "content": "<p>Okay, so that's where we reach a different conclusion -- I don't think Facebook APIs fall under ONC's rules (or not obviously).</p>",
        "id": 207086804,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597607733
    },
    {
        "content": "<p>Indeed.  For what it's worth, I don't exactly think Facebook APIs fall under ONC rules either.  But I also don't think that USCDI is simply a matter of legal obligations and compliance.  </p>\n<p>Rather, USCDI is also defining the contents of what belongs in a longitudinal national healthrecord.  And to the extent that Medicare for All is politically viable, it's also defining what constitutes a medical history within the maybe-to-be national healthcare system.  Or at least what's shuffled across the health insurance exchanges and related systems.</p>\n<p>And my medical training has taught me not to simply look at these things from the utilitiarian, pragmatic aspect.  It's not simply about volume of network traffic and the 80/20 rule and do the majority of citizens have a particular set of data types in their records.  It's also about Do No Harm, and what harm is created if a data type or FHIR resource is left out.    And there's arguably real harm caused if the standardized interoperable healthrecord doesn't include things like behavioral or mental health.   Not to mention having (or not having) bio/tissue banking data in there makes an implied stance on family planning, which then becomes sketchy in terms of eugenics.  There's some real heavy hitting thorny ethic issues and implications about including or not including resources.  </p>\n<p>We have to keep in mind that the utilitarianists have already had their 80/20 moment in this discussion.  We're now talking about pushing towards the 95% of use.  Radiology and genetics are obstetrics are all obvious inclusions.  But after those, I think it's appropriate to ask which areas cause disproportional patient harm if they're _not_ included.</p>",
        "id": 207091054,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1597613789
    },
    {
        "content": "<p>I don't think HL7 can by ourselves make a difference in what data is better collected and represented in a consistent way, but the combination of efforts on FHIR, US Core, and USCDI can make that difference at this time.</p>\n<p>I think it is more impactful to put our efforts in helping USCDI extend in a meaningful way, than expect that non-standard EHI as currently prescribed will have any positive impact.</p>",
        "id": 207093045,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1597616997
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191678\">Abigail Watson</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/USCDI/near/207091054\">said</a>:</p>\n<blockquote>\n<p>It's also about Do No Harm, and what harm is created if a data type or FHIR resource is left out. </p>\n</blockquote>\n<p><span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span></p>",
        "id": 207096935,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597623793
    },
    {
        "content": "<p>(For me this is precisely the reason to ensure support for full data exports; there's plenty we don't agree about how to standardize, but that shouldn't stop patients from sharing their full records.)</p>",
        "id": 207097179,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597624176
    },
    {
        "content": "<p>I would like to see more health related data available and using FHIR.. but I think the current set of proposals are well outside \"Core\"... the \"C\" in USCDI. I would rather see the real core data represented well, than see the definition of core data be stretched to encompass everything and thus no longer have any meaning as \"core\"</p>",
        "id": 207138928,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597668729
    },
    {
        "content": "<p>I do think that there is some emerging non-traditional Legal Medical Record data that is becoming critical to care of our health, and the additional concern is when that data are created or consumed by many apps (need for standards). Such as diet, exercise, lifestyle, etc.</p>",
        "id": 207141470,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597669868
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/USCDI/near/207138928\">said</a>:</p>\n<blockquote>\n<p>I would like to see more health related data available and using FHIR.. but I think the current set of proposals are well outside \"Core\"... the \"C\" in USCDI. I would rather see the real core data represented well, than see the definition of core data be stretched to encompass everything and thus no longer have any meaning as \"core\"</p>\n</blockquote>\n<p>You don't think that veteran PTSD status and therapy notes should be included in a record?  We should just systemically ignore combat veterans?  And we should only concern ourselves with reproductive notes for heterosexuals, but not the LGBT community?  These things 'stretch' the definition of Core too much?</p>\n<p>Healthcare isn't simply the province of the physically fit and active.  I can get behind gym membership data being in core, but not before things like behavioral/mental health.</p>",
        "id": 207144536,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1597671457
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191678\">Abigail Watson</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/USCDI/near/207144536\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/USCDI/near/207138928\">said</a>:</p>\n<blockquote>\n<p>I would like to see more health related data available and using FHIR.. but I think the current set of proposals are well outside \"Core\"... the \"C\" in USCDI. I would rather see the real core data represented well, than see the definition of core data be stretched to encompass everything and thus no longer have any meaning as \"core\"</p>\n</blockquote>\n<p>You don't think that veteran PTSD status and therapy notes should be included in a record?  We should just systemically ignore combat veterans?  And we should only concern ourselves with reproductive notes for heterosexuals, but not the LGBT community?  These things 'stretch' the definition of Core too much?</p>\n<p>Healthcare isn't simply the province of the physically fit and active.  I can get behind gym membership data being in core, but not before things like behavioral/mental health.</p>\n</blockquote>\n<p>I can't follow the logic that I said anything against PTSD or gender status. It was not event mentioned in this whole thread. In fact I am fighting every day as part of my role on the MyHealtheVet project to enable Veterans to address many diverse topics, including and beyond those you pick on. To Veterans these are core, and unfortunately due to current events, PTSD is becoming core to non-Military. I did not reject these, and I did not reject anything specifically. What I did attempt to do is clarify core from all possible things to be profiled. We (HL7 and others) can profile everything possible, we don't need ONC to endorse it as \"Core\" for it to exist. I was simply trying to expose a critical word in USCDI that I think we should collectively be considering. Help me understand where I could have communicated the two sentences I did say in a better way?</p>",
        "id": 207154782,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597676713
    },
    {
        "content": "<p>Profiling it means it's possible EHRs vendors will make it available. Defining as USCDI means it must be made available if they're recording it. </p>\n<p>The history of healthcare data exchange is a graveyard of those possible standards, unused and unimplemented despite existing. </p>\n<p>If we have a lever for required, it should be used judiciously to expand access to <em>new</em> datasets. Right now, the USCDI is roughly a slightly needed up version of the downloadable C-CDA from 2012 VDT requirements or the CCDS from 2015.</p>",
        "id": 207158521,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1597678524
    },
    {
        "content": "<p>I'm not even talking about gender here (the value sets regarding race/sex/gender which are required in USCDI is a whole other topic of conversation).  </p>\n<p>Brendan has it right... this is a lever for required, and a USCDI v2 is precisely about what new datasets to pull into a national longitudinal record.  And Virginia asked about the patient perspective.  </p>\n<p>Some of them are easy...  radiology, genetics, and obstetrics.  But if people are pushing back at other working group participants, and saying that mental health, behavioral health, reproductive health, dermatology or surgical planning, etc.  'stretch' the definition of 'core' too much...  then we have some real ethical differences here.  </p>\n<p>What exactly is the value of fitness data?  Woohoo.  Somebody walked 4000 steps on June 4th, 2006, and walked 10,000 steps on October 12th, 2008.  So what?  Is that data ever actually going to be used?  The relative value of any particular datum of fitness activity isn't very great.  Which is why a Baseline resource is needed.... so we can rollup data into usable and relevant knowledge.</p>\n<p>But if somebody had a PTSD trauma event on June 4th... that history is more impactful years later in care planning, and can cause disproportionately harm if it's not included in the medical record.  Ooops, the mass shooter had a history of PTSD, but his primary care doctor didn't get those notes when he moved to a new city.  Hence the need for ClinicalImpression, Evidence, Claim, and related behavioral/mental health resources.</p>\n<p>Same thing with reproductive medicine.  Inclusion of obstetrics data is a must.  But so is fertility/infertility data.  Cryobanking performed on October 12th is a disproportionately more impactful piece of data than walking 10,000 steps on October 12th, and will have far more consequences to a person years down the road.  Which is why BiologicalDerivedProduct and similar fertility/infertility medicine data should be included along with obstetrics in a healthrecord.    </p>\n<p>Try to remember that just because these might not be your medical concerns doesn't mean they're not other people's medical concerns.   And for some populations, these are vastly more important topics than fitness data.</p>",
        "id": 207165673,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1597681947
    },
    {
        "content": "<p>Fitness data held in consumer-facing apps isn't really part of USCDI today either.</p>\n<p>The legislation applies to EHRs and health information networks to expose the USCDI resources, including future iterations. So asking Facebook for their data (as mentioned earlier in the thread) or Fitbit for fitness data requires new legislation/regulation. </p>\n<p>The scenario here is that we are on a path where the infrastructure (patient authorized exchange via SMART with minimal registration/vetting of patient apps) will be built out ubiquitously across EHRs in the next 2 years. With that in mind, the question is less \"what new consumer apps should we include\" and more \"how should we expand the data set that EHRs and other regulated parties expose\"</p>",
        "id": 207175388,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1597686723
    },
    {
        "content": "<p>I would like to see my DNR, my advance directive, and my statement on whether or not i want a transfusion. Those are important items that i should be able to review what is out there (to make sure it is my latest wish), and also pull down and share with others. I did not see those in any note. I would also like to see who they have listed as my current contacts and providers (to make sure they are current).</p>",
        "id": 207199650,
        "sender_full_name": "Debi Willis",
        "timestamp": 1597699952
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span>  Sorry for the late response concerning the definition of a PHR. Zulip is last on my long list to check because i do most of my communication via email. That way i know it is really to me instead of chatter between other people. </p>\n<p>There is no agreed upon definition of a PHR. There are many different flavors out there with some focused on a specific group of people or disease. Some are just meant to be platforms to share data with other apps. My goal is that a PHR will eventually be a \"mini EHR\" that is completely controlled by the patient. We are heading in that direction. As soon as \"ALL\" data is released, that will be what our PHR (MyLinks) will be.</p>",
        "id": 207200248,
        "sender_full_name": "Debi Willis",
        "timestamp": 1597700448
    },
    {
        "content": "<p><strong>Side note</strong>: under European GDPR, all patient self-measurement data (e.g. fitbit) and facebook data have to be made available (for access, for download, in some cases with a max 30 day delay) in a industry standard format. So at least the legal angle would be covered. Actually doing this may still be relatively hard at this point in time.</p>",
        "id": 207228818,
        "sender_full_name": "René Spronk",
        "timestamp": 1597733991
    },
    {
        "content": "<p>yes, this is a good forcing function. USCDI wants to go a bit further to profile the standards used for specific purpose. GDPR  leaves it wide open as to what is considered an acceptable encoding. This is better than PDF, but pushes the consistency, quality, and usability of the data to the consuming app.</p>",
        "id": 207262267,
        "sender_full_name": "John Moehrke",
        "timestamp": 1597759151
    },
    {
        "content": "<p>Has anyone begun looking at what additional data will be made available via the eHI export? I'm curious how or if the eHI 2023 export will or should map back to USCDI. <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span></p>",
        "id": 207482666,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1597889949
    },
    {
        "content": "<p>EHI is all data, not just standardized data; see my comments on this topic <a href=\"#narrow/stream/179262-patient-empowerment/topic/USCDI/near/206927379\">earlier in this thread</a>.</p>",
        "id": 207483560,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597891137
    },
    {
        "content": "<p>Right. I recognize eHI won't be standardized initially. I was just wondering if there were any implementers who have started to define the broad strokes of what 'all data' means beyond what's specified in the ONC rule.</p>",
        "id": 207511386,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1597922118
    },
    {
        "content": "<p>Perhaps I'm cynical but I was imagining they'd drop a CSV and call it a day</p>",
        "id": 207522479,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1597930463
    },
    {
        "content": "<p>Pile of CSV and column definitions</p>",
        "id": 207522846,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597930671
    },
    {
        "content": "<ul>\n<li>and vocab tables.</li>\n</ul>",
        "id": 207522904,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597930698
    },
    {
        "content": "<p>That's super powerful if it's automatic and complete</p>",
        "id": 207522934,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597930724
    },
    {
        "content": "<p>Currently ONC rules are for a manual process through :/</p>",
        "id": 207522960,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597930752
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> this is an absolutely great contribution. My notifications were failing and I missed this whole thread. I've been thinking we ought time start as \"Patients on FHIR\" blog and this would be a great first post.</p>\n<p>I'm typing on phone so not sure if the parent post will be clear. It's the one citing PTSD.</p>",
        "id": 207861177,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1598284738
    },
    {
        "content": "<p>Last call!   In <a href=\"https://global.gotomeeting.com/join/322275573\">our WG call this Thursday (1 pm ET)</a> we'll be discussing this, to submit to the Policy group per their request.</p>",
        "id": 210167531,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600193604
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"200498\">@Brendan Keeler</span> <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  You reminded me - we have a cancer risk app and not having Family History is a problem.</p>",
        "id": 210350385,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600321640
    },
    {
        "content": "<p>I was thinking orders, med adminstrations, flowsheet data.  Especially useful if you are caregiver and loved one is hospitalized and you get info to an app.</p>",
        "id": 210350454,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600321732
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> therapist notes currently not released due to law.   I am thinking about everything you have listed and Brendan.  I think we could bring it to a higher more abstract level and say any clinical observations or flowsheet item recorded on the patient.  I was already thinking flowsheet but now you guys got me thinking I think there is synergy</p>",
        "id": 210350870,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600322330
    },
    {
        "content": "<p>All - I think the uscdi is scoped to EHR data so fitbit, etc would not be in scope unless it is brought into ehr.</p>",
        "id": 210350960,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600322432
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> thinking about the ptsd event.  We already have the problem, an encounter, the progress note.  Claim doesn't come from provider I think that is payer dataset.  Evidence and clinicalimpression are fhir resources what is a data type that represents that what do you mean exactly?</p>",
        "id": 210351140,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600322650
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> USCDI contains the radiology narrative results so I think that is the imaging report you would want.  Why imaging study?  Also I think sequencing is part of genetic lab results which I also think are included in lab results part of uscdi.  But maybe I am wrong?</p>",
        "id": 210351554,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600323199
    },
    {
        "content": "<p>I think the Patient Empowerment workgroup should make a statement about the need to support Patient Generated Data. Meaning, this is not a new data element, it is a new target use-case for the existing data elements. Many of the existing data elements are very useful data elements for the patient to contribute, either directly or through some app. This will likely not change much in the USCDI space, but will keep reminding them that getting patients the clinical data is great, but not enough. To be truly empowered the patient must be able to participate by contributing to their own information. This is not easy, but it is done in some places (e.g. the VA - the project I work on). This brings up a strong need for Provenance, but achievable. This brings up custodian rules (patient can cut off access, data can only be used for patient authorized purpose, etc)</p>",
        "id": 210381006,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600345549
    },
    {
        "content": "<p>This is what is needed to participate in a CarePlan. It is great to be able to see a care plan, but in order to truly participate one must be able to contribute the patient assigned tasks (take blood pressure daily, medications, etc)</p>",
        "id": 210381272,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600345702
    },
    {
        "content": "<p>OH!!!!  John you just reminded me of something.  Implanted Devices in patients sometimes feed data into EHRs.  But the patients dont get the info.  This came up in our Patient Contributed Data meetings.</p>",
        "id": 210415142,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600360288
    },
    {
        "content": "<p>So I guess I am hearing that USCDI which is EHR to other (patient, etc) should have ability to send the data that was contributed by patients.  And we appear to have some use cases here.  Remember USCDI doesnt just go to patients but goes to others like on transition of care so I can see how it would also help with a record being more complete from patient perspective.  And Debbie's point is another use case - show me what you have that I sent you so I can be sure you have it and got it right.</p>",
        "id": 210415790,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600360624
    },
    {
        "content": "<p>agreed. My experience is that these data feed into a patient PHR or a patient accessible staging area. But I have heard of where these devices are issued BY the healthcare provider or by the insurance plan; and in that case the device is configured to feed directly to the EHR or Insurance; thus possibly not available to the patient, and even if accessible might not have full custodial requirements to control the use of that data or destruction.</p>",
        "id": 210462368,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600384119
    },
    {
        "content": "<p>OK <span class=\"user-mention\" data-user-id=\"200498\">@Brendan Keeler</span> <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> and anyone else, ONC wants this complicated form filled out for this. If you want us to look at proposing any of these fields please help by trying to fill out the form.  I have attached the form.  Filled it out for consents/advanced directives <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <a href=\"/user_uploads/10155/l4D3CK7r_jdNx3ZX1W4LrPCb/USCDI-ONDEC-Submission-Form-Prep-Sheet-consents.docx\">USCDI-ONDEC-Submission-Form-Prep-Sheet-consents.docx</a>   and <a href=\"https://www.healthit.gov/isa/sites/isa/files/2020-08/USCDI-ONDEC-Submission-Form-Prep-Sheet.docx\">https://www.healthit.gov/isa/sites/isa/files/2020-08/USCDI-ONDEC-Submission-Form-Prep-Sheet.docx</a></p>",
        "id": 210594376,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600485037
    },
    {
        "content": "<p>There is a tremendous amount of variability in the questions/responses found across the US in forms called advance directives and advance care plans.  My thought would be to undertake the work with PACIO that is about to commence, harmonize the feedback we'll gather from multiple stakeholders and \"actors\" into a single dataset, and once vetted and agreed to - take the end result to USCDI as part of the work to move to a FHIR IG.  To request data additions to USCDI before that thoughtful, collaborative project has gotten underway feels premature.</p>",
        "id": 210798270,
        "sender_full_name": "Maria D Moen",
        "timestamp": 1600721524
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"270306\">@Maria D Moen</span>  - based on our meeting today, do you still feel this way?  It seems that since PACIO is committed to the work, it might help PACIO's work effort if it is working on a recognized USCDI class.</p>",
        "id": 210802981,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600723961
    },
    {
        "content": "<p>It sounds like PACIO may have done a ton of work to collect info on current practices.  Is there anything our WG might do to enhance that knowledge base, or is it pretty well covered? </p>\n<p>I'm just wondering how we can bring extra value here. Our mission is to add the patient perspective.  Did the Post-Acute-Care group fundamentally <em>start</em> from that perspective?</p>",
        "id": 210812431,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600730498
    },
    {
        "content": "<p>Hey everyone!  USCDI Draft V2 has been published.  I did not see any patient empowerment inspired suggestions taken but maybe I didn't look carefully enough. <span class=\"user-mention\" data-user-id=\"298778\">@Terrie Reed</span> <span class=\"user-mention\" data-user-id=\"270306\">@Maria D Moen</span> sadly I did not see your detailed proposals for AD or UDI.   However, its still a move forward.  If feels more like cleanup work.  <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> there is this pretty section on imaging but it appears to be the report and the order which I think is already being at least on current uscdi apis (maybe not the order).  Take a look:  <a href=\"https://www.healthit.gov/isa/united-states-core-data-interoperability-uscdi\">https://www.healthit.gov/isa/united-states-core-data-interoperability-uscdi</a></p>",
        "id": 222744195,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1610642447
    },
    {
        "content": "<p><del>@_<strong>Virginia Lorenzi|191531</strong> <a href=\"#narrow/stream/179262-patient-empowerment/topic/USCDI/near/222744195\">said</a>:</del><br>\n<del>```quote</del><br>\n<del>Hey everyone!  USCDI Draft V2 has been published.  I did not see any patient empowerment inspired suggestions taken but maybe I didn't look carefully enough. </del></p>\n<p><del>There was lots of grousing on Twitter about the fact that 250 comments were received and \"theoretically\" absorbed yet the draft was published within 36 hours, raising strong suspicions that the comments were not in reality absorbed.  Make of that what you will.</del></p>\n<p><del>Given our proximity to the end of the current administration, and all the turmoil in DC, a conspiracy theorist <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> might propose that they decided to get the thing out the door one way or another, while the getting was good.  But that's not even a conspiracy theory that I've seen on Twitter!</del></p>\n<p><del>In any case I'm inclined to say: don't presume that your suggestions were considered and rejected as not worthy, and let's see what happens as the new administration gets rolling.  I personally am very happy that HHS has moved in such a patient-centered direction in the past few years, evidenced not least by the Final Rule requiring FHIR!</del></p>",
        "id": 222765200,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1610650715
    },
    {
        "content": "<p>That wasn't about USCDI I don't think, that was about the CMS proposed rule that dropped Dec 14th and comments closed Jan 4th.  So people worked over the holidays to develop those comments.  The rule primarily focused on Payor interoperability requirements - many FHIR specs mentioned.</p>",
        "id": 222772875,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1610653617
    },
    {
        "content": "<p>Virginia is right, that was CMS.</p>\n<p>There's ample criticism about this change too. Wayyyy too iterative. Nothing really new to move the ball forward</p>",
        "id": 222774702,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1610654318
    },
    {
        "content": "<p>I'll go back and strikethrough my comment, then <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 222781819,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1610657377
    },
    {
        "content": "<p>Yeah, the imaging orders/reports were always going to be the first step.  Those are the critical inputs/outputs from the RIS.  Give that a year or two, and then they'll start on the DICOM imaging.  </p>\n<p>This is a very surprising publication.  It's much smaller than I was expecting.  On the other hand, it appears that they're planning for annual updates.  So that could actually be a very promising development.</p>",
        "id": 222803832,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1610669712
    },
    {
        "content": "<p>It is not just annual updates - it is a development cycle that allows new items to flow in, be vetted, proposed items then get a US Core IG HL7 ballot, and get approved. This provides a much greater opportunity for feedback, and for proof of concept trials, helping avoid the gaps that I think were left unfilled with MU2 and MU3.</p>",
        "id": 222805281,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1610671011
    }
]