[
    {
        "content": "<p>I just ran across this 2016 post from the #OpenAPS movement. <br>\n<a href=\"https://participatorymedicine.org/epatients/2016/06/its-not-about-the-car-its-about-the-drive.html\" target=\"_blank\" title=\"https://participatorymedicine.org/epatients/2016/06/its-not-about-the-car-its-about-the-drive.html\">“It’s not about the car – it’s about the drive.” #OpenAPS standing ovation for Mark Wilson.</a></p>\n<p>It's a (sorry, but) <em>brilliant</em> description of patient experience. If you wonder about this \"patient experience\" stuff and you don't know what life is like with Type 1 diabetes, you gotta spend 31 minutes watching this. THEN you'll get why patient data access can be transformational.</p>\n<p>Check out this metaphor - each of us is chained to our \"car\" (our body) for live. and if you have T1D, you spend GOBS of time monitoring the dashboard - and SOMEtimes you get to look ahead and enjoy life. A multi-pane screen capture from the talk's video:<br>\n<a href=\"/user_uploads/10155/W8W1x1x6W0DbEiS-6SlDW6gR/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/W8W1x1x6W0DbEiS-6SlDW6gR/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/W8W1x1x6W0DbEiS-6SlDW6gR/pasted_image.png\"></a></div><p>Also the OpenAPS people are like TOTAL believers in open source, because of the \"all bugs are shallow\" thing, re the software that's managing their survival.</p>\n<p>Also they are totally fed up the irony of \"better trained\" \"better credentialed\" people thinking they know better than what the OpenAPS people are <em>actually doing.</em></p>\n<p>Autonomy is the ability to make one's own decisions about where to go in life. OpenAPS is the first massive transformation of this in a disease community.</p>\n<p>(<span class=\"user-mention\" data-user-id=\"195979\">@Kelly Watson</span> were you there for this?)</p>",
        "id": 168650338,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561083617
    },
    {
        "content": "<p>Similarly, the famed ICD (implanted cardioverter / defibrillator) patient Hugo Campos expressed it this way in 2016: \"I don't <em>want</em> to engage in my health. I want to engage in my <em>life</em>.\"  Just brilliant.</p>",
        "id": 168650425,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1561083740
    },
    {
        "content": "<p>Apologies for the late reply <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> – I've been getting catching up to all the great threads :)</p>\n<p>I started participating in the #wearenotwaiting community in 2016 but wasn't at that DData event. It was a wonderful video to watch.</p>",
        "id": 170416229,
        "sender_full_name": "Kelly Watson",
        "timestamp": 1562635540
    }
]