[
    {
        "content": "<p>1)So in the simplest form,  we have a request from a patient to a provider for their record to be requested<br>\n2)We then have a response, from the provider, to that request - a status which could be working on it, rejected, completed (I am glossing over some details here)<br>\n3)We then have the actual correction which happens async to the above (this is where provenance would help).<br>\nAlso the HIPAA workflow is very much request/response but clearly not synchronous days could go by until its completed.<br>\n<span class=\"user-mention\" data-user-id=\"192825\">@Jeffrey Danford</span> has suggested we use Comunication or CommunicationRequest to represent the patient's correspondence - we found that many of the fields we needed were there.  <br>\nBut then I wonder if it is ServiceRequest for the request.<br>\nAnd what would the response be?</p>\n<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> <span class=\"user-mention\" data-user-id=\"195798\">@John Keyes</span> <span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> <span class=\"user-mention\" data-user-id=\"332883\">@Adrienne Pichon</span>  FYI</p>",
        "id": 210789687,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600717136
    },
    {
        "content": "<p>Communication/CommunicationRequest would NOT be the preferred approach.  Task would be the right resource.  It handles the accept/reject/working on it and also allows linking to the result</p>",
        "id": 210790622,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600717689
    },
    {
        "content": "<p>We'd be happy to support ServiceRequest, Task, Communication(Request) in an implementation guide or connectathon.  I agree that Communication(Request) isn't the first choice preference; but I think it has slightly wider adoption and can be a workable solution.  Preference would be for ServiceRequest.</p>",
        "id": 210793310,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1600719119
    },
    {
        "content": "<p>ServiceRequest (and CommunicationRequest and any other type of 'Request') have no ability to say \"yes I will\" or \"no I won't\".  Task is the only structure that supports that.</p>",
        "id": 210809705,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600728391
    },
    {
        "content": "<p>(along with 'why not' if the answer is no, or \"where I'm at in the process\" if started but not yet done)</p>",
        "id": 210809742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600728418
    },
    {
        "content": "<p>There isn't broad support for Task yet because there isn't broad support for allowing an external system to ask something of users in another system.  (That's a tricky thing to get right.)  ServiceRequest represents an 'authorization', but can't be used on its own to request action or to manage fulfillment.</p>",
        "id": 210809857,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600728494
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Which.20resources.20for.20patient.20correction/near/210809857\">said</a>:</p>\n<blockquote>\n<p>There isn't broad support for Task yet because there isn't broad support for allowing an external system to ask something of users in another system.  (That's a tricky thing to get right.)  ServiceRequest represents an 'authorization', but can't be used on its own to request action or to manage fulfillment.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> and others this looks like it's the crux of the cultural work we face in this project, yes?</p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> any thoughts on realities of negotiating such an \"ask\" when there's no question it's wrong, like Morgan's non-existent pregnancies, vs when the line may not be so clear?  I'm keenly aware though that our job is not to define process (the \"tricky thing to get right\"?), it's to define what elements would/should be used to do the thing.</p>",
        "id": 210813698,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600731549
    },
    {
        "content": "<p>I don't think the process is going to look terribly different.  From the patient's perspective it's always going to be \"unquestionably wrong\" and the provider's perspective will be highly variable.  The providers will be concerned from a process perspective of it being easy to approve stuff and have the change 'happen' - whether automatically or from work done by someone other than them.  And if they reject, they don't want to have to deal with the same request the next day and the day after.  I.e. they don't want to be spammed.</p>",
        "id": 210814826,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600732575
    },
    {
        "content": "<p>I generally understand and agree - but in creating the IG, we are not accountable for that, right?  It's sensible to be AWARE of it (pragmatic, as I say), but it's not what we define in any sense, right?</p>\n<p>(btw I may be abnormal but sometimes I do <em>propose</em> a change to the record.  But now that I think of it, that's always in dialog with my doc in portal mail, not via \"FHIR bombs\" ha ha)</p>",
        "id": 210814999,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600732725
    },
    {
        "content": "<p>I keep thinking that the <em>process</em> will inevitably end up being like with credit cards: \"Dispute this charge,\" which triggers a well defined process. Am I right?</p>",
        "id": 210815060,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1600732783
    },
    {
        "content": "<p>The IG is going to have a technical piece that will, most likely, not deal with it at all.  The IG <em>may</em> also have some policy guidance to help guide implementers through the thought process of how to implement as painlessly as possible (and thus increase the odds of it being implemented at all).  That's where such topics would most likely be advisable.  That said, sometimes there can be technical solutions to policy type issues.</p>",
        "id": 210816396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600733961
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179262-patient-empowerment/topic/Which.20resources.20for.20patient.20correction/near/210809705\">said</a>:</p>\n<blockquote>\n<p>ServiceRequest (and CommunicationRequest and any other type of 'Request') have no ability to say \"yes I will\" or \"no I won't\".  Task is the only structure that supports that.</p>\n</blockquote>\n<p>But it does have the capacity to say whether the request status is active(yes, I will), revoked (no, I wont), or completed (yes, I did).  How does this not suffice?</p>",
        "id": 210816409,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1600733987
    },
    {
        "content": "<p>I don't know that our process will ever be as straight-forward as credit card statement challenges.  With those, data propagation is limited, and professional pride has zero role to play.</p>",
        "id": 210816459,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600734005
    },
    {
        "content": "<p>Request status being active means the authorization exists.  It has nothing to do with whether the person you've asked to do it agrees to do it or not.</p>",
        "id": 210816480,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600734036
    },
    {
        "content": "<p>A ServiceRequest might be activated and have 10 different tasks that get instantiated, some of which get accepted, others rejected because it takes multiple fulfillments to get to the point where all authorized actions are complete.</p>",
        "id": 210816506,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600734080
    },
    {
        "content": "<p>Also, in general, ServiceRequest should never be edited by anyone other then the authoring organization - the filler systems never touch it (though they might create their own filler version of it).</p>",
        "id": 210816573,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600734126
    },
    {
        "content": "<p>In practice, I suspect ServiceRequest is going to get used to kludge together all sorts of order lists and task lists.  ;)</p>\n<p>That being said, I'll concede the point that Task is probably the more appropriate resource (if its supported).</p>",
        "id": 210816984,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1600734583
    },
    {
        "content": "<p>Task is going to be pretty essential to any sort of workflow.  If an EHR doesn't have support for externally-influenced workflow, they're not super likely to be taking on patient-requested data changes anyhow...</p>",
        "id": 210820268,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600738187
    },
    {
        "content": "<p>The Patient Correction Process has a formality to it.  Both HIPAA and GDPR offer guidance.  Even NY does.  So we are using those types of workflows, especially the HIPAA one, as a template.  We started mapping our datatypes to CommunicationRequest, but I think Task would work well.  The body of the resource needs to contain what a patient wants changed in their record, which will most likely be unstructured, at least for now, with the possible exception of Patient.  Then there are several other data pieces that are needed like encounter perhaps, and who to notify of the correction and then the responder has several options.  Anyway those are the initial thoughts.  Definitely is workflow stuff but I didn't think of Task - thanks!</p>",
        "id": 210820667,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600738730
    },
    {
        "content": "<p>I will be giving a presentation of all this on Thursday in the FHIR-I 4 PM meeting. I will explain: our final goal (an implementation guide for patient corrections), what we have done so far, what we are looking at for next steps, and request for feedback and ideas for moving forward.</p>",
        "id": 210821511,
        "sender_full_name": "Debi Willis",
        "timestamp": 1600739935
    },
    {
        "content": "<p>We will also be introducing the project at our open house on Wednesday and working on the IG in several WGM sessions if anyone is interesting in coming to help!</p>",
        "id": 210836278,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1600760220
    }
]