[
    {
        "content": "<p>I've taken a first pass at filling out the paperwork for requesting a new patient-centric work group.  The key thing will be fleshing out the minimum number of co-chairs and HL7 members who want to be members.  However, we will also need agreement on the name, scope and justification.  Edit privileges are open, so make edits and/or add your names as you wish.  Note that the lines listed are minimums - it's good to have more co-chairs and initial members than the minimum.  However, everyone we write down has to have active membership either with HL7 International or with one of the HL7 affiliates.  It's totally ok to sign up as a member or co-chair even if you also wear other hats at HL7 (clinician, vendor, whatever), but your role on this work group should be tied to your experience/needs/intentions related to being a patient and/or support for one.</p>\n<p><a href=\"https://docs.google.com/document/d/1yUdlOp2E9ff_MNagPJYw5IH9i5wqZXZoWPF-7Sx09LE/edit?usp=sharing\" target=\"_blank\" title=\"https://docs.google.com/document/d/1yUdlOp2E9ff_MNagPJYw5IH9i5wqZXZoWPF-7Sx09LE/edit?usp=sharing\">https://docs.google.com/document/d/1yUdlOp2E9ff_MNagPJYw5IH9i5wqZXZoWPF-7Sx09LE/edit?usp=sharing</a></p>",
        "id": 168060824,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560443124
    },
    {
        "content": "<p>Thanks much, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> !   What's the best way for me to chime in?  Sidebar comments, or direct editing?</p>\n<p>If I want to write brief essays on a topic (e.g. name of the group), too much for an in-doc comment, what's the best way / place?</p>",
        "id": 168064736,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560445792
    },
    {
        "content": "<p>Comments or edits as you see fit.  For essays, just stick them at the bottom in a new section :)</p>",
        "id": 168067580,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560447748
    },
    {
        "content": "<p>(We'll strip them out when we copy this content back into the official form)</p>",
        "id": 168067610,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560447775
    },
    {
        "content": "<p>Okay, I've finished my edits / comments.</p>",
        "id": 168072757,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560450881
    },
    {
        "content": "<p>My current role is with VA on the Patient Portal... so I am very much in a Patient Advocate position.</p>",
        "id": 168074118,
        "sender_full_name": "John Moehrke",
        "timestamp": 1560451765
    },
    {
        "content": "<p>I'd like to explore how we can do something useful with this whole idea at DevDays too.</p>",
        "id": 168078143,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1560454510
    },
    {
        "content": "<p>Next devdays is Amsterdam? When?</p>",
        "id": 168078192,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560454557
    },
    {
        "content": "<p>November 20-22</p>",
        "id": 168078246,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1560454573
    },
    {
        "content": "<p>Thank you all for starting this work. Very much looking forward to participating.</p>",
        "id": 168101169,
        "sender_full_name": "Kelly Watson",
        "timestamp": 1560478355
    },
    {
        "content": "<blockquote>\n<p>I'd like to explore how we can do something useful with this whole idea at DevDays too.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span>  I'd love to know more about what you mean there...  e.g. define \"useful\" and \"this whole idea\" :-)</p>",
        "id": 168149458,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560529156
    },
    {
        "content": "<p>I'm interested in participating as a member. My company Sensotrend Oy is a vendor, and member of HL7 Finland, and I'm named as the participating individual (<a href=\"http://www.hl7.fi/jasenet/\" target=\"_blank\" title=\"http://www.hl7.fi/jasenet/\">http://www.hl7.fi/jasenet/</a>).</p>\n<p>Before committing, though, I'd like to understand any obligations better. I believe the membership in this group would, first of all, help get this group formed, and secondly give me the possibility to comment on any HL7 specs from the patient point-of-view. However, is there a requirement for me (or for the company) to comment on something we don't feel we have anything meaningful to say to, or to pay any fees in addition to our existing HL7 affiliate membership? Anything else worth noting?</p>",
        "id": 168196149,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1560582869
    },
    {
        "content": "<p>I too am interested in participating in this work group, however need to first check my HL7 membership status, and 2nd review the proposed mission/charter with my employer. I work for a pharmaceutical company focused on patient support programs we offer patients who take our medicines. I’m an enterprise architect in the organization and therefore heavily invested in the use of standards and feel that I could bring some value to the workgroup if I’m able to participate. I’ll submit the draft charter/mission and explanation of demonstrated need to my employer for further review on my participation.</p>\n<p>Also interested in the answers to Mikhale’s questions.</p>\n<p>Thanks.</p>",
        "id": 168204255,
        "sender_full_name": "Paul Le Roux",
        "timestamp": 1560597996
    },
    {
        "content": "<p>For membership, the only requirement is that you're a voting member of hl7 and that you'll try to participate in the WG.  (I.e. Joining the discussion here, attending calls if we schedule any, and if you come to  WGMs, trying to participate then too.</p>",
        "id": 168207443,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560604501
    },
    {
        "content": "<blockquote>\n<p>a voting member of HL7</p>\n</blockquote>\n<p>Oui, and that's where the cost seems to come in: I don't see any free / cheap membership levels that include voting. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 168345920,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560804399
    },
    {
        "content": "<p>It's going to be challenging to get there to be any.  Voting is the one thing that's still a reserved privilege for members (now that we give the standards away for free).  As a result, HL7 is going to be hyper-cautious about doing anything that could potentially bleed paying members.  If you can call yourself a patient and still vote, what's the point of paying for an individual membership as a consultant?  What's more likely is that we might be able to get HL7 to 'grant' membership to specific individuals if we need them to act as co-chairs and paying for an individual membership would pose an unreasonable burden.</p>",
        "id": 168351602,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560809004
    },
    {
        "content": "<p>in-kind contribution.... there's good reason why the patient WG would be special</p>",
        "id": 168351736,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560809130
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , I completely get this and don't want to be seen as whining for a free puppy or anything. Students pay $75.  </p>\n<p>I'll stick my neck out here and say that if anyone (truly speaking hypothetically here) wanted a waiver because of truly hard circumstances, they ought to have a defined responsibility.  (Oh - <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> just said \"in-kind contribution.\")  (And \"why the patient WG would be special.\")</p>\n<p>Still, even having said that, I know too well that not everyone is a good fit for every team.  <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> any preliminary thoughts on this?</p>",
        "id": 168351849,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560809238
    },
    {
        "content": "<p>All, at the bottom of <a href=\"https://docs.google.com/document/d/1yUdlOp2E9ff_MNagPJYw5IH9i5wqZXZoWPF-7Sx09LE/edit\" target=\"_blank\" title=\"https://docs.google.com/document/d/1yUdlOp2E9ff_MNagPJYw5IH9i5wqZXZoWPF-7Sx09LE/edit\">the proposal doc</a>, I've just added notes from last Monday's original GDoc when we first started discussing the idea of a PWG (pt workgroup).   The notes are my original thoughts on what tasks  a PWG might have. </p>\n<p>As I say in the doc, this list should get moved out to a separate document, but I'm not sure what's best for doing that, in HL7 protocols, so I'll leave it to a savvy person.</p>",
        "id": 168401625,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1560865310
    },
    {
        "content": "<p>As discussed at our pow-wow this evening, here is the draft proposal: <a href=\"https://docs.google.com/document/d/1yUdlOp2E9ff_MNagPJYw5IH9i5wqZXZoWPF-7Sx09LE/edit\" target=\"_blank\" title=\"https://docs.google.com/document/d/1yUdlOp2E9ff_MNagPJYw5IH9i5wqZXZoWPF-7Sx09LE/edit\">https://docs.google.com/document/d/1yUdlOp2E9ff_MNagPJYw5IH9i5wqZXZoWPF-7Sx09LE/edit#</a></p>\n<p>Warning - as time allows, I'm editing and tweaking it (so partial sentences aren't errors, they're just \"Lloyd got interrupted and will finish the sentence the next time he gets enough time this hits the top of the stack - which may not be until tomorrow\" :)</p>",
        "id": 176058514,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568852259
    },
    {
        "content": "<p>Thank you for everything you have done for, with, and perhaps to us!</p>",
        "id": 176062444,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568857682
    },
    {
        "content": "<p>All, I note that several members who've volunteered in that document aren't here in Atlanta. Sometime soon we need to let them know ... is there a traditional way in HL7 to let people know what happened at a WGM?   (That includes those not in on our conversations)</p>",
        "id": 176062505,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1568857771
    },
    {
        "content": "<p>This is the most immediate way.  Formal groups would record 'minutes' on Confluence - and we could certainly put notes of whatever discussions have happened here there.  They also get summarized on subsequent calls (which can be done once we have one :&gt;).  Grahame will also post a blog post of \"key happenings\" across the meeting.  Those are the typical models</p>",
        "id": 176062963,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568858393
    },
    {
        "content": "<p>I am posting all the notes of our meetings to our confluence site - not everything is there yet though :)</p>",
        "id": 176068191,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1568867376
    },
    {
        "content": "<p>Posted last nights notes: <a href=\"https://confluence.hl7.org/pages/resumedraft.action?draftId=66919662&amp;draftShareId=767b168b-5de1-4ca1-9e18-0226334de4ca&amp;\" target=\"_blank\" title=\"https://confluence.hl7.org/pages/resumedraft.action?draftId=66919662&amp;draftShareId=767b168b-5de1-4ca1-9e18-0226334de4ca&amp;\">https://confluence.hl7.org/pages/resumedraft.action?draftId=66919662&amp;draftShareId=767b168b-5de1-4ca1-9e18-0226334de4ca&amp;</a></p>\n<p>Moved notes from June out of google doc and onto confluence.</p>\n<p>Updated WG Proposal - I like it - do we need a mission statement? (I am having insomnia)</p>",
        "id": 176077639,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1568880606
    },
    {
        "content": "<p>Proposed mission is part of the proposal</p>",
        "id": 176092773,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568895325
    }
]