[
    {
        "content": "<p>Boa tarde, preciso de desenvolver um FHIR server com uma BD ElasticSearch, tenho experimentado a implementação do hapi mas não estou a conseguir connectar com o ElasticSearch. Alguma sugestão?<br>\nObrigada!</p>",
        "id": 153973413,
        "sender_full_name": "Inês Silva",
        "timestamp": 1530729002
    },
    {
        "content": "<p>Viva. Usar o ElastcSearch como armazenamento?</p>",
        "id": 153973420,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530731298
    },
    {
        "content": "<p>Sim, exatamente</p>",
        "id": 153973654,
        "sender_full_name": "Inês Silva",
        "timestamp": 1530779299
    },
    {
        "content": "<p>Desconhecia esse uso do ElasticSearch - é um motor de busca e não vejo que seja aconselhado para usar como BDados. <br>\nNão me lembro de alguém ter usado essa opção mas pode-se sempre perguntar na stream Implementers.</p>",
        "id": 153973655,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530779722
    },
    {
        "content": "<p>Sim, vou perguntar. Obrigada</p>",
        "id": 153973657,
        "sender_full_name": "Inês Silva",
        "timestamp": 1530781082
    },
    {
        "content": "<p>(estou curioso com o tipo de aplicação. É para Analytics? Se for transacional, há servidores que usam bdados de grafos (Vonk) ou documentos (acho que um dos servidores open source em .NET usa mongoDB).</p>",
        "id": 153973658,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530781216
    },
    {
        "content": "<p>Será transaccional sim, o requisito do ES é da minha empresa. Mas vou tentar ver se é possível alterar.<br>\nEu pesquisei vários servidores open source e o HAPI pareceu-me o melhor, consegue dizer se há outros tão completos?</p>\n<p>Parece-me que a melhor opção aqui seria o mongoDB uma vez que o pretendido é guardar a mensagem FHIR em JSON</p>",
        "id": 153973667,
        "sender_full_name": "Inês Silva",
        "timestamp": 1530788908
    },
    {
        "content": "<p>Qualquer servidor NoSql (document storage) pode armazenar os recursos FHIR. Há vários - MongoDB, orientDB, ArangoDB... No entanto os servidores tradicionais (PostgreSQL, MySQL) também ja começaram a permitir armazenamento json em vez de usar os modelos relacionais clássicos.</p>",
        "id": 153973719,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530800008
    },
    {
        "content": "<p>Quanto a servidores, respondo com a minha opinião numa discussão separada para ser mais acessível.</p>",
        "id": 153973722,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530800075
    },
    {
        "content": "<p>Estou a ler e parece que o hapi com JPA será uma boa opção.para fazer um frontend FHIR numa base de dados. Espero que o pessoal responda na discussão geral como isso se faz (eu gostaria de poder ajudar mas não sei)</p>",
        "id": 153973741,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530800959
    },
    {
        "content": "<p>Talvez fosse verdade nas versões originais do Elasticsearch mas actualmente é uma base de dados orientada a documentos com foco especial em análise de dados e indexação de documentos para pesquisa. Trabalho diariamente com produtos que usam o Elasticsearch como única base de dados das aplicações e não temos razões de queixa.</p>",
        "id": 153973773,
        "sender_full_name": "Duarte Ferreira",
        "timestamp": 1530802744
    },
    {
        "content": "<p>Como o Hapi já faz uso da framework Spring, pode ser possível utilizar <a href=\"https://projects.spring.io/spring-data-elasticsearch/\" target=\"_blank\" title=\"https://projects.spring.io/spring-data-elasticsearch/\">https://projects.spring.io/spring-data-elasticsearch/</a> para usar o Elasticsearch como base de dados.</p>",
        "id": 153973785,
        "sender_full_name": "Duarte Ferreira",
        "timestamp": 1530803142
    },
    {
        "content": "<p>Mais um portuga no canal <span class=\"user-mention\" data-user-id=\"196612\">@Alex Neiva</span>  :) bem vindo Alex</p>",
        "id": 153990744,
        "sender_full_name": "Pedro Almeida",
        "timestamp": 1535110119
    }
]