[
    {
        "content": "<p>Hi Everyone,</p>\n<p>I'm wondering if anyone knows of an existing extension to help specify appointment milestones for the Ontario Wait Time Information System.  Specifically, I'm looking for something that can specify whether an appointment meets the Wait 1 milestone (Time to initial consult) or Wait 2 milestone (Time to treatment).</p>\n<p>I did a scan of the HL7 registry and there doesn't seem like one exists, but curious if I missed one.</p>",
        "id": 254217234,
        "sender_full_name": "Jonathan Fishbein",
        "timestamp": 1632234896
    },
    {
        "content": "<p>What are you looking for an extension on? Is this for performance measurement, or a clinical use? This sounds like a Measure to me.</p>",
        "id": 254222840,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632236877
    },
    {
        "content": "<p>Yep, from what he wrote, he's looking for the Measure/MeasureReport resources.  Unless there is a need to specifically add these to another resource.</p>",
        "id": 254235695,
        "sender_full_name": "David Pyke",
        "timestamp": 1632241388
    },
    {
        "content": "<p>We'd be looking to add this to an appointment resource since we need to mark particular appointments as meeting one the two milestones to be able to calculate these set wait times.  It's mostly a performance metric, but does straddle into the clinical realm as it can inform where a doctor could send a patient for a referral.  But the key here is generating the data required for the these kinds of calculations by marking the appointments that meet the milestones for the calculation.</p>\n<p>Using a measure/measure report is an interesting idea, but it seems more like a definition/calculation of these metrics than marking the required the data needed in the places required.</p>",
        "id": 254239677,
        "sender_full_name": "Jonathan Fishbein",
        "timestamp": 1632242864
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"330946\">Jonathan Fishbein</span> <a href=\"#narrow/stream/179185-canada/topic/Ontario.20Surgical.20Wait.20Time.20Extension/near/254239677\">said</a>:</p>\n<blockquote>\n<p>But the key here is generating the data required for the these kinds of calculations by marking the appointments that meet the milestones for the calculation.</p>\n</blockquote>\n<p>Are you marking the appointment as being the \"initial consult\" appointment, or are you marking it as \"met milestone 1 performance goal\"? How are you figuring whether it meets the goal? Is this done at time of scheduling, or is there a later phase where the appointment is flagged? What happens if the appointment is edited to change the date? does the extension need to be removed? Does this need to be part of the appointment request?</p>\n<p>I don't see anything in what you wrote that suggests to me that Measure is not the best approach.</p>",
        "id": 254248842,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632246493
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191380\">Elliot Silver</span> <a href=\"#narrow/stream/179185-canada/topic/Ontario.20Surgical.20Wait.20Time.20Extension/near/254248842\">said</a>:</p>\n<blockquote>\n<p>Are you marking the appointment as being the \"initial consult\" appointment, or are you marking it as \"met milestone 1 performance goal\"? How are you figuring whether it meets the goal? Is this done at time of scheduling, or is there a later phase where the appointment is flagged? What happens if the appointment is edited to change the date? does the extension need to be removed? Does this need to be part of the appointment request?</p>\n</blockquote>\n<p>The appointments would be marked with a semantic \"met milestone 1 performance goal\" at the time of scheduling.  It really wouldn't matter if the appointment is edited or the date changed because it is the appointment itself (with the milestone marker) that determines when the milestone is achieved, so if the date is changed it will already be fed into the wait time calculation as long s the marker is present.</p>\n<p>I'm not married to an extension approach on the Appointment.  I could use the serviceCategory field within the appointment to add that kind of marker with a custom value set (although not 100% sure that would be appropriate) or some kind of other linked resource to the appointment that would capture the same information (not sure there is one that makes sense and can be referenced to an appointment.)  But the appointment itself does need someway of knowing whether it is one of these milestone appointments or not.</p>\n<p>The appointment is part of a FHIR messaging application so unfortunately I can't decorate a direct REST booking request with a parameter. I also can't change the message type to distinguish the type of appointment booked.</p>",
        "id": 254264822,
        "sender_full_name": "Jonathan Fishbein",
        "timestamp": 1632252920
    },
    {
        "content": "<p>Likely, because of the use case you've described, a custom extension is likely the best solution.  You could set it to have multiple milestones and a boolean value indicating if it has been met.</p>",
        "id": 254267310,
        "sender_full_name": "David Pyke",
        "timestamp": 1632253771
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"330946\">Jonathan Fishbein</span> <a href=\"#narrow/stream/179185-canada/topic/Ontario.20Surgical.20Wait.20Time.20Extension/near/254264822\">said</a>:</p>\n<blockquote>\n<p>It really wouldn't matter if the appointment is edited or the date changed because it is the appointment itself (with the milestone marker) that determines when the milestone is achieved, so if the date is changed it will already be fed into the wait time calculation as long s the marker is present.</p>\n</blockquote>\n<p>As long as the appointment was originally scheduled for within a certain date, for the point of meeting the metric, it doesn't matter if the appointment later gets put off by 6 months? </p>\n<p>That sounds <a href=\"https://www.nbcnews.com/storyline/va-hospital-scandal/performance-mismanagement-how-unrealistic-goal-fueled-va-scandal-n139906\">unfortunately familiar</a>:</p>\n<blockquote>\n<p>For example, a preliminary report by the VA’s Office of the Inspector General on May 28 focused on ground zero in the scheduling scandal – the Phoenix medical center -- found that many veterans seeking first appointments there were not entered into the “electronic waiting list” in scheduling software. Instead, according to whistleblower accounts that surfaced in March, paper records widely known as the “secret waiting list” were created, making it appear that the facility was sharply reducing its backlog.</p>\n</blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"330946\">Jonathan Fishbein</span> <a href=\"#narrow/stream/179185-canada/topic/Ontario.20Surgical.20Wait.20Time.20Extension/near/254264822\">said</a>:</p>\n<blockquote>\n<p>But the appointment <strong>itself does need someway of knowing</strong> whether it is one of these milestone appointments or not.</p>\n</blockquote>\n<p>Sounds like extension is the way to go then.</p>\n<p>I am not aware an existing extension to do this.</p>",
        "id": 254269946,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1632254888
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191380\">Elliot Silver</span> <a href=\"#narrow/stream/179185-canada/topic/Ontario.20Surgical.20Wait.20Time.20Extension/near/254269946\">said</a>:</p>\n<blockquote>\n<p>As long as the appointment was originally scheduled for within a certain date, for the point of meeting the metric, it doesn't matter if the appointment later gets put off by 6 months? </p>\n</blockquote>\n<p>Fair point.  Luckily in this case we're not evaluating or adjudicating whether people have met a certain performance metric.  Just calculating the real time wait time averages for particular service locations to inform referring doctors know where to send patients.</p>\n<p>Thanks for the help <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> and <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> !</p>",
        "id": 254275730,
        "sender_full_name": "Jonathan Fishbein",
        "timestamp": 1632257380
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"330946\">Jonathan Fishbein</span> has marked this topic as resolved.</p>",
        "id": 254275877,
        "sender_full_name": "Notification Bot",
        "timestamp": 1632257427
    }
]