[
    {
        "content": "<p>How can I use the Terminology Gateway to identify the appropriate reasonCodes to use on a MedicationRequest?<br>\n  Following the FHIR specs leads here -&gt; <a href=\"https://www.hl7.org/fhir/valueset-condition-code.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-condition-code.html\">https://www.hl7.org/fhir/valueset-condition-code.html</a>.  But I can't seem to search by the OID 2.16.840.1.113883.4.642.3.152 and also not sure if there is Canada specific OID.</p>",
        "id": 153897006,
        "sender_full_name": "David evans",
        "timestamp": 1500208304
    },
    {
        "content": "<p>Where are you getting that OID from?</p>",
        "id": 153897007,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500215967
    },
    {
        "content": "<p>In general, we try to avoid the use of OIDs with FHIR.</p>",
        "id": 153897008,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500215981
    },
    {
        "content": "<p>The value set pointed to by the spec is an \"example\" binding - meaning there's no expectation that systems will necessarily use that value set - it's just to give an idea of the types of codes that could be used.  In this case, the example binding is to a set of codes from SNOMED CT</p>",
        "id": 153897009,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500216039
    },
    {
        "content": "<p>Where are you implementing in Canada?  Who are you looking to interoperate with?</p>",
        "id": 153897010,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500216090
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - I got the OID from the FHIR link I included so good to know that is just an example.  I'm doing some work in the medication management space interoperating with prescribers and dispensers.  </p>\n<p>Can you suggest the best value set to use for MedicationRequest.reasonCode?</p>",
        "id": 153897063,
        "sender_full_name": "David evans",
        "timestamp": 1500295769
    },
    {
        "content": "<p>To the best of my knowledge, the Infoway terminology gateway is not yet hosting FHIR-defined terminology - and I'm not even sure if it's intending to.  FHIR support for the gateway is still pending.  Hopefully it will support searching by canonical URL rather than OID as OIDs won't even necessarily exist for all value sets and code systems used by FHIR.  Are you trying to look up the content in the gateway for a particular reason?  Are you trying to implement in alignment with a particular jurisdiction's project or are you pursuing FHIR support independently of any particular jurisdiction's efforts?</p>",
        "id": 153897080,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500302698
    },
    {
        "content": "<p>I want to be aligned with whatever Canada Health Info recommends for coding systems in Ontario for now.</p>",
        "id": 153897082,
        "sender_full_name": "David evans",
        "timestamp": 1500303998
    },
    {
        "content": "<p>I don't think Infoway is planning to recommend code systems yet (or maybe ever).  Rather, they're hosting value sets used by various projects.  And I'm not familiar with any Ontario projects that are leveraging the Condition resource yet, though it's always hard to keep tabs on everything that's going on.  I think you're probably safe with the example value set as it's most likely that Canadian implementations would use SNOMED for condition codes.</p>",
        "id": 153897091,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500305520
    },
    {
        "content": "<p>But you won't see the value set on the Gateway until a project asks for it.</p>",
        "id": 153897093,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500305537
    },
    {
        "content": "<p>As far as I know Health Canada and Infoway have been looking at the terminology for Prescription Indication for Use (an equivalent of MedicationRequest.reasonCode) for their Canadian Clinical Drug Data Set &amp; PrescribeIT projects, but I don't believe they have anything ready yet. <span class=\"user-mention\" data-user-id=\"194877\">@David Evans</span> , you can raise your questions at the Canadian Medication Management forum at <a href=\"https://infocentral.infoway-inforoute.ca/en/forum/344\" target=\"_blank\" title=\"https://infocentral.infoway-inforoute.ca/en/forum/344\">https://infocentral.infoway-inforoute.ca/en/forum/344</a> and/or join one of their weekly meetings on Tuesdays - the next meeting is tomorrow, July 18 at 11 am.</p>",
        "id": 153897096,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1500308407
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191393\">@Igor Sirkovich</span> .  I was able to find the following using the gateway. </p>\n<p>{<br>\n    \"id\": \"2.16.840.1.113883.2.20.3.401\",<br>\n    \"name\": \"PrescriptionIndicationForUse\",<br>\n    \"effectiveDate\": \"20170626\",<br>\n    \"description\": \"The clinical reason for which a medication is being ordered.\",<br>\n    \"status\": \"active\",<br>\n    \"category\": \"SNOMED CT\",<br>\n...</p>\n<p>I won't be able to make tomorrow's meeting but would like to in the future...thanks for pointer!</p>",
        "id": 153897118,
        "sender_full_name": "David evans",
        "timestamp": 1500317624
    },
    {
        "content": "<p>Right, this is the one for ePrescribe domain (PrescribeIT solution), though I suspect this might still be work in progress.</p>",
        "id": 153897120,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1500320534
    },
    {
        "content": "<p>...just to point out that while Lloyd is correct that OIDs may not exist for all code systems and value sets used by FHIR, FHIR does provide OIDs for the codesystems and value sets it defines itself</p>",
        "id": 153897762,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500707816
    },
    {
        "content": "<p>however there are already a number of code systems in new functional areas covered by FHIR but not v3/CDA that have URIs and have not been assigned OIDs</p>",
        "id": 153897763,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500707847
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153914470,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1508259726
    }
]