[
    {
        "content": "<p>Copying from Grahame's post to the committers stream:<br>\nGrahame Grieve: I've just fixed a significant bug in the IG generator. Here's the bug:</p>\n<p>as part of the publication process, the IG pubisher generates snapshots for any profiles that don't have snapshots<br>\nIt carefully checks the outcomes of the generation process and puts any exceptions/errors in the qa.html file<br>\nbut snapshots are generated earlier in the process under a variety of conditions<br>\nif that process fails there, errors are not trapped - and the partially generated snapshot remains in place<br>\nso when the IG publisher goes to check the snapshot, it already exists - and errors are not reported<br>\nGrahame Grieve: The first and most obvious fix is that partially generated snapshots should not be left in place - which I've fixed.</p>\n<p>Grahame Grieve: a deeper question is whether the IG publisher should accept snapshots at all.</p>\n<p>Grahame Grieve: but irrespective of that, as of the next release, the IG publisher will be making more checks on the profiles, and you may get more qa issues, or your build might fail. Once it's released, I'll do rebuild the current set of IGs on the ci-build to see if there's any problems</p>",
        "id": 161087196,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552936346
    },
    {
        "content": "<p>thx - meant to post a reference to that thread here</p>",
        "id": 161087290,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552936420
    },
    {
        "content": "<blockquote>\n<p>Grahame Grieve: a deeper question is whether the IG publisher should accept snapshots at all.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> -  Regardless of whether or not you <em>enforce</em> it, does this imply that you recommend that profiles <em>not</em> provide their own snapshots?</p>",
        "id": 161174631,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1553018110
    },
    {
        "content": "<p>indeed I recommend that.</p>",
        "id": 161180881,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553022466
    },
    {
        "content": "<p>More specifically, profiles that are input into the IG publication process should not have snapshots.  Those that are <em>produced</em> by the publication will have (and need to have).</p>",
        "id": 161181363,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553022799
    },
    {
        "content": "<p>Got it.  OK.  I'll need to update our tooling to suppress the snapshot then...  It will be interesting to compare the generated snapshot to the one we're producing.  I guess that's one way to confirm our differentials are right!</p>",
        "id": 161269065,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1553101974
    }
]