[
    {
        "content": "<p>I've just made a large set of chances that replaced all of our references to \"gForge\" and \"wiki\" in preparation for our move to Jira and Confluence which should be happening in the next couple of months.  All references to the generic \"submit a change proposal\" gForge link have been replaced with \"<a href=\"http://hl7.org/fhir-issues\" target=\"_blank\" title=\"http://hl7.org/fhir-issues\">http://hl7.org/fhir-issues</a>\".  Right now it points to the old gForge location, but as soon as our Jira landing page is set up and ready to go, we'll change it to redirect there instead.  All of the references to specific gForge items have been changed to use the Jira path instead (<a href=\"https://jira.hl7.org/projects/FHIR/issues/FHIR-[issue#]\" target=\"_blank\" title=\"https://jira.hl7.org/projects/FHIR/issues/FHIR-[issue#]\">https://jira.hl7.org/projects/FHIR/issues/FHIR-[issue#]</a>.  As well, I've created placeholders on Confluence for all of the places the spec used to point to the wiki.  That way, once our content is moved across, the links will resove to the right place.  </p>\n<p>Please don't make any references to gForge or the wiki.  If you're not sure how/where to point to the new Jira/Confluence locations, just ping me and I'll assist.</p>\n<p>Similarly, if any of my changes give you merge issues, I'll help out with that too.  (Be sure to pull a current copy of 'master' before starting any new work to minimize merging grief.)</p>",
        "id": 154017387,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541860099
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> you missed signatures.html</p>",
        "id": 154017465,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541955758
    },
    {
        "content": "<p>oh, never mind</p>",
        "id": 154017466,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541955781
    },
    {
        "content": "<p>does that mean that we've starting using Jira? If not, isn't it premature?</p>",
        "id": 154017479,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541975719
    },
    {
        "content": "<p>The change is to move the gForge reference to <a href=\"http://hl7.org/fhir-issues\" target=\"_blank\" title=\"http://hl7.org/fhir-issues\">http://hl7.org/fhir-issues</a></p>",
        "id": 154017494,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541977679
    },
    {
        "content": "<p>It redirects to gForge right now - we can redirect it to Jira when we're ready.  The only places we referenced specific tracker items in the sources was the notes sections of the spreadsheets.  I'm ok with them pointing to Jira prematurely.</p>",
        "id": 154017495,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541977725
    },
    {
        "content": "<p>what's the likely timing on the transition?</p>",
        "id": 154017498,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541978791
    },
    {
        "content": "<p>Late Dec/early Jan</p>",
        "id": 154017502,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541982346
    }
]