[
    {
        "content": "<p>Shortly I will commit a set of updates to The R3 Diff generation code. This code generates the content of the R3 Diff tab for each resource &amp; type in the spec. </p>\n<p>One of your tasks is to check that the display on this tab is correct. In all but two respects, it is auto-generated, and you are checking the correctness of the code that generates the diff. </p>\n<p>The two respects in which that code is not automatic is around renaming. <br>\n1. If the resource has been renamed (e.g. from A to B) the code won't pick that up. You need to put a note in the [r3-renames] section of fhir.ini:</p>\n<div class=\"codehilite\"><pre><span></span>A=B\n</pre></div>\n\n\n<p>If an element is renamed from A.b to A.c, the diff code will generate \"remove b\" and \"add c\". You need to make the following entry in the [r3-renames] section of fhir.ini:</p>\n<div class=\"codehilite\"><pre><span></span>A.b=A.c\n</pre></div>\n\n\n<p>Then the code will make a 'renamed from b' entry against c, and compare them otherwise. Note that the meaning could be changed a little / inverted, and it's ok to say that they've been renamed - this is about conceptual meaning, not executable mappings. </p>\n<p>There's no way to handle splitting an element. That's just remove + 2 adds</p>",
        "id": 154010068,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539815398
    },
    {
        "content": "<p>I've made a few of these renaming entries myself - please check</p>",
        "id": 154010076,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539815957
    },
    {
        "content": "<p>1. Given that there are substantive changes still being made, should this checking wait until after the substantive freeze deadline?<br>\n2. Do we want to formally track the review of the resources so we can poke WGs that haven't done it?</p>",
        "id": 154010126,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539828188
    },
    {
        "content": "<p>1. I intended for it to be done as part of the editorial process leading to the substantiative freeze. I've done it for all Normative resources which are already frozen </p>\n<p>2. Don't know.</p>",
        "id": 154010128,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539828454
    },
    {
        "content": "<p>I've never reviewed a version diff before. By \"R3 diff tab\"  are you referring to the \"R3 Conversions\" tab that is part of the individual resource pages? Or should we be reviewing comprehensive Differences from Release 3 page (<a href=\"http://build.fhir.org/diff.html\" target=\"_blank\" title=\"http://build.fhir.org/diff.html\">http://build.fhir.org/diff.html</a>)? Is there additional documentation explaining best practices for reviewing this data and providing more detailed instructions for providing feedback (I'm not that familiar with updating fhir.ini)?</p>",
        "id": 154010205,
        "sender_full_name": "Craig Newman",
        "timestamp": 1539877883
    },
    {
        "content": "<p>the differences to release 3 is that same content as found in the R3 Diff tab gathered. You can ignore that page, and just focus on the table in the R3 Diff tab, and ignore the R3 &lt;--&gt; R4 Conversion maps</p>",
        "id": 154010285,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539900541
    },
    {
        "content": "<p>I can help you with fhir.ini if you need it</p>",
        "id": 154010287,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539901790
    },
    {
        "content": "<p>Too many tabs on these pages....<br>\nI was looking at the tabs at the top of the Immunization page, not the tabs in the Resource Content section. That helps. Thank you.</p>",
        "id": 154010419,
        "sender_full_name": "Craig Newman",
        "timestamp": 1539957244
    }
]