[
    {
        "content": "<p>The FMG reviewed the commits made to date against the R4B branch thus far and discovered that no one has actually submitted any content yet.  In order to hit our Feb. 19 publication date, FMG would have to review the final content on Feb. 17th, which means that work groups would have to complete their QA and sign-off their content by Feb. 16 - 6 days from now.  That doesn't seem realistic.  There are also QA issues around the build including examples that updating and some questions around the inclusion of the CodeableReference data type.  Based on that, the FMG is adjusting the R4B cycle as follows:</p>\n<p>EOD Tuesday March 2nd - all work groups having changes for inclusion in R4B will have their changes made, QAed and minuted sign-off by the work group that the content is ready for ballot.  <br>\nMarch 3rd - FMG will review the publication for quality and will sign off to proceed to ballot<br>\nMarch 5-April 4 - ballot will run</p>\n<p>As a reminder, ballot scope is limited to:</p>\n<ul>\n<li>changes and net new resources in the medication regulation and EBM space</li>\n<li>new extensions</li>\n<li>adjusting the targets of references and/or canonicals</li>\n<li>technical corrections that affect tooling or are critical to navigation</li>\n</ul>\n<p>Everything except the first one should be represented in a Jira tracker item with the \"R4B\" grouping</p>\n<p>Please start migrating your changes into the branch ASAP so that if there are any issues or coordination that needs to happen, we figure that out sooner rather than later.</p>\n<p>Discussion on the <a class=\"stream\" data-stream-id=\"179165\" href=\"/#narrow/stream/179165-committers\">#committers</a> stream please.</p>",
        "id": 225925621,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612998289
    },
    {
        "content": "<p>If you have additional commits to make against R4B, that's still a possibility between now and Saturday (say 9am Eastern).  After that, please get permission from Grahame and give me a heads up.</p>",
        "id": 228684098,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614812326
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Is it possible to consider more R4B commits - or is that done now?</p>",
        "id": 277894905,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1649171969
    },
    {
        "content": "<p>A message was moved from this topic to <a class=\"stream-topic\" data-stream-id=\"179165\" href=\"/#narrow/stream/179165-committers/topic/R4B\">#committers &gt; R4B</a> by <span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span>.</p>",
        "id": 277895854,
        "sender_full_name": "Notification Bot",
        "timestamp": 1649172330
    }
]