[
    {
        "content": "<p>Michel,<br>\nI wonder if there is a semantic analog to slicing for a resource. For example, PHD devices send the following types of measurements which are mapped to an Observation resource in different ways. Right now I am trying to express all of them within the confines of a 'PhdObservation' profile.<br>\nA PHD sends either a numeric, a compound numeric, a waveform, a code, a list of codes as a BITs value, and a string.<br>\nThe numeric maps to a valueQuantity. The compound numeric maps to a set of component.valueQuantity elements. A waveform maps to valueSampledData, a code to valueCodeableConcept, and a BITs list of codes to a set of component.valueCodeableConcept elements.</p>\n<p>Of course there is no discriminator at the resource level that I know of. What is the best way to do this? Would it be to make five Observation profiles? The down side is that a lot of the material in each profile would be common. Right now I am still going with a single profile and trying to handle all the conditions internally.</p>",
        "id": 153882046,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1491996171
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> You could slice the Observation.value[x] element and define named slices for all the possible datatypes. Discriminator would be on type, or possibly profile. If necessary, you can also define custom profiles for specific datatypes and bind these to the Observation.value[x] named slices.</p>",
        "id": 153882048,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1491996891
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span>   you create a profile on Observation then you create a profiles on that profile which only constrains what you are interested in.  an example are the vital profiles in the spec <a href=\"http://hl7.org/fhir/STU3/slot-definitions.html#Slot.appointmentType\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/slot-definitions.html#Slot.appointmentType\">here</a>  where for example, the bodyweight profile is a profile on the vitals  profile  and only  constrains the code and value.</p>",
        "id": 153882058,
        "sender_full_name": "Eric Haas",
        "timestamp": 1491999573
    },
    {
        "content": "<p>Eric, In my case I think the slicing on the value[x] would be much more efficient since most of the other elements are duplicated.</p>",
        "id": 153882059,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1491999682
    }
]