[
    {
        "content": "<p>Hello there, looking for some clarification on how \"current\" in <a href=\"https://www.hl7.org/fhir/lifecycle.html#current\" target=\"_blank\" title=\"https://www.hl7.org/fhir/lifecycle.html#current\">https://www.hl7.org/fhir/lifecycle.html#current</a> is being interpreted<br>\nIs a \"current problem\" one which is affecting the patient at the moment? With \"past diagnoses\" being ones the patient no longer has (some of which will be \"relevant to the current care of the patient\" and some not)</p>\n<p>Is there room for a broader definition of \"current\"? We are aggregating problems across different sources and some we will mark as duplicates because they are in more than one source.  Could we say that these are \"not current\" (even though they represent a problem that the patient has at the present time)?</p>",
        "id": 153856817,
        "sender_full_name": "Amy Wilson",
        "timestamp": 1479093658
    },
    {
        "content": "<p>There is no generally agreed definition of 'current'. It means whatever the local system means (or it's users)  when things are put on the current list</p>",
        "id": 153856819,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479093982
    },
    {
        "content": "<p>Does it matter if the \"current\" list isn't a literal list? For example, if the \"current\" allergies are derived from all the aggregated content but with items removed if they have been manually dismissed by a clinician at different points in time, possibly by different clinicians (typically because there is a better representation already in the aggregated content). Using GET [base]/AllergyIntolerance?patient=42&amp;_list=$current-allergies</p>",
        "id": 153856828,
        "sender_full_name": "David Teirney",
        "timestamp": 1479103429
    },
    {
        "content": "<p>I think you just have to document clearly what 'current' means in your documentation. </p>",
        "id": 153856830,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479108122
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192890\">@Amy Wilson</span> It's perfectly appropriate to filter out duplicates.</p>",
        "id": 153856880,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479153569
    },
    {
        "content": "<p>Thank you, sounds like our proposed approach will be acceptable.</p>",
        "id": 153857022,
        "sender_full_name": "Amy Wilson",
        "timestamp": 1479246334
    }
]