[
    {
        "content": "<p>We're trying to figure out how to communicate the \"Current location at time of submitting a ServiceRequest\". (e.g., i sent the referral from WardY @ HospitalX). </p>\n<p>My current theory is to reference a Location resource from ServiceRequest.SupportingInfo ... However, I'm not sure how to designate this Location resource as \"The spot the patient is at the time of the referral\". What might be the best approach to this? Perhaps extend the SupportingInfo with a code to indicate the meaning of the supportingInfo is being referenced?</p>\n<p>(cc <span class=\"user-mention\" data-user-id=\"223465\">@Ion Moraru</span> )</p>",
        "id": 178502024,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1571425633
    },
    {
        "content": "<p>This sort of thing <em>should</em> be captured using Provenance</p>",
        "id": 178503024,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571426453
    },
    {
        "content": "<p>It lets you capture the location, the terminal, the software version, the supervisor and any other details of interest associated with <em>any</em> record manipulation (creation, update, deletion, transformation, etc.)</p>",
        "id": 178503087,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571426499
    },
    {
        "content": "<p>The current encounter?</p>",
        "id": 178513314,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1571435444
    },
    {
        "content": "<p>Ah, missed that it was the patient's location rather than the user's.  That could still go in Provenance, but perhaps not as a  standard element.  My leaning might actually be an extension on the ServiceRequest.  <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>?</p>",
        "id": 178549482,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571496632
    },
    {
        "content": "<p>I could be sold on an extension for patient's current location (at time of Referral) for ServiceRequest. Perhaps called something like \"Source Location\"</p>",
        "id": 178710391,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1571701903
    },
    {
        "content": "<p>Similarly, we want to communicate in a ServiceRequest a categorization of the SOURCE TYPE (from hospital inpatient, from ED,  from the community, from long term care, from primary care, from out of country/region, etc...)</p>\n<p>The proposal was to use Servicerequest.requester &gt; PractitionerRole.code or MessageHeader.author/enter/sender &gt; PracititionerRole.code with the above valueset. I'm not sure if I'm quite comfortable with this approach as these value don't feel like they 100% align with the concept of a PractitionerRole.code. </p>\n<p>Given this discussion, i'm feeling now like the best approach might similarly be to add an extension (called something like \"Referral Source Type\"). Thoughts?</p>",
        "id": 178814244,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1571792947
    },
    {
        "content": "<p>That's interesting, I suppose that similarly Task.basedOn could reference multiple ServiceRequests?</p>",
        "id": 178815425,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1571794371
    },
    {
        "content": "<p>Yes</p>",
        "id": 178815991,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571795291
    },
    {
        "content": "<p>Or you could have a parent task that groups a bunch of child tasks, each of which is basedOn a single Request.  (That model might be more typical as the fulfillment state of each might vary)</p>",
        "id": 178816005,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571795339
    },
    {
        "content": "<p>Any reason it's different to servicerequest.encounter.location?</p>",
        "id": 178837114,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1571823248
    },
    {
        "content": "<p>If you have a patient staying at a long term care facility, the encounter that leads to a request for them to be transferred could easily have happened at a clinic or hospital.</p>",
        "id": 178849108,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571834428
    },
    {
        "content": "<p>Then wouldn't that encounter be at the clinic?</p>",
        "id": 178929846,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1571904646
    },
    {
        "content": "<p>Yes, but the 'source' for the transfer would be the long-term care facility the patient currently resides in, not the clinic.</p>",
        "id": 178946481,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571920318
    }
]