[
    {
        "content": "<p>Wondering how best to implement a \"Common Law\" relationship in our FHIR API, for Patient.maritalStatus?</p>\n<p>I believe there's enough distinction between \"Domestic Partnership\" and \"Common Law\" to warrant a new value. </p>\n<p>My current thought it to create a value-set with code \"C\", and a display value of \"Common Law\". Does this seem appropriate?</p>",
        "id": 154868128,
        "sender_full_name": "Tristan Wilson",
        "timestamp": 1547151604
    },
    {
        "content": "<p>You are allowed to extend when you feel the existing vocabulary in the defined valueset is not appropriate(definition of Extensible). However when you create a new vocabulary you need to define it as a vocabulary value in a system. Sure you can use \"C\" in YOUR-SYSTEM... Managing a vocabulary is not trivial. However that would be your vocabulary system and thus not known to those that don't know your vocabulary system.. hence the good idea to use a defined vocabulary value when it fits. So, is it really different? <br>\nThen note that RelatedPerson.relationship has a much more complete list of possible relationships; but these are not marital relationships, which is what Patient.maritalStatus is defined to hold.<br>\nThere are other marital status values known in the HL7 v3 vocabulary <a href=\"http://build.fhir.org/v3/MaritalStatus/vs.html\" target=\"_blank\" title=\"http://build.fhir.org/v3/MaritalStatus/vs.html\">http://build.fhir.org/v3/MaritalStatus/vs.html</a><br>\nwhich brings up the good practice to look around at vocabulary standards for the value you are interested in.</p>",
        "id": 154871331,
        "sender_full_name": "John Moehrke",
        "timestamp": 1547154067
    },
    {
        "content": "<p>That's not quite accurate <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>.  You can extend only when the value set doesn't cover your concept at all.  If one of the defined codes applies, but you want a code with more nuance, you still have to use the code from the value set - though if it's a CodeableConcept, you're free to send a more nuanced code as well.</p>",
        "id": 154872591,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547155140
    },
    {
        "content": "<p>fair... I was being lose with the constraint...</p>",
        "id": 154872799,
        "sender_full_name": "John Moehrke",
        "timestamp": 1547155319
    },
    {
        "content": "<p>In this case, the definition of \"domestic partnership\" is next to useless.  Nothing in the definition would prohibit me from declaring a domestic partnership with my spouse or someone I've divorced or even someone I've never met.  Based on the current definition, introducing a new code might be reasonable.  But it's probably best to propose a change to the definition.  Something along the lines of \"a union recognized by the government that is not a marital relationship but which entails some or all of the rights and obligations of one\".</p>",
        "id": 154872930,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547155404
    },
    {
        "content": "<p>If we did that, then \"common-law\" would fall under that banner.</p>",
        "id": 154872955,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547155425
    },
    {
        "content": "<p>Would it be ok to use the Domestic Partner code, and put \"Common Law\" into the .text field of the codeableConcept?</p>",
        "id": 154875095,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1547157192
    },
    {
        "content": "<p>It is if you presume that Domestic Partner means what it should mean instead of what it declares itself to mean...</p>",
        "id": 154875475,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547157588
    },
    {
        "content": "<p>V2 introduced a code for common law in V2.4<br>\n<a href=\"http://hl7.org/fhir/v2/0002/index.html\" target=\"_blank\" title=\"http://hl7.org/fhir/v2/0002/index.html\">http://hl7.org/fhir/v2/0002/index.html</a></p>\n<p>I wonder why it didn’t make it into V3...</p>",
        "id": 154939244,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1547233982
    },
    {
        "content": "<p>Maybe someone from Terminology wants to weigh in? <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <br>\nor is this a PA thing <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 155097323,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1547484560
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  I'll chime in. Common Law Marriage is definitely a type of marriage and I don't understand why it was left out of the V3 code system. That is a mistake in my opinion. The FHIR <a href=\"http://build.fhir.org/v3/MaritalStatus/cs.html\" target=\"_blank\" title=\"http://build.fhir.org/v3/MaritalStatus/cs.html\">MartialStatus code system</a> is the one used in the value set cited above, is extensibly bound to Patient.MaritalStatus <strong>and is the code system we need to update.</strong> This means it should be added via <em>Harmonization</em>. PA owns the value set - which has the definition \"all the codes in the code system\" (Vocabulary owns the code system but that is less important here), and given that PA owns the resource that needs this I am willing to work with a PA harmonization request to add the code \"Common law\" to the code system. I'd be interested in what definition you all want to use.  Here is <a href=\"https://www.nolo.com/legal-encyclopedia/free-books/living-together-book/chapter2-4.html\" target=\"_blank\" title=\"https://www.nolo.com/legal-encyclopedia/free-books/living-together-book/chapter2-4.html\">found page</a> with some discussion on this</p>",
        "id": 155124076,
        "sender_full_name": "Robert McClure",
        "timestamp": 1547503927
    },
    {
        "content": "<p>One of the problems with this concept is that it really only exists in \"common law\" countries (loosely defined as Great Britain and its former colonies), i.e. its of little to no relevance in all countries with \"napoleontic law\". As such the concept would not be within the 80% if that were to be the main ground for deciding whether or not to include it. The definition seems to differ even between jurisdictions that have such a concept, that's probably why it should be left to a jurisdiction to define their own code in addition to the predefined HL7 concept codes.</p>",
        "id": 155152251,
        "sender_full_name": "René Spronk",
        "timestamp": 1547538927
    },
    {
        "content": "<p>I agree with Rob M. about how to add the code if it's decided to do that.  But Rene makes a good point about whether a new code for \"common law\" should be added.  And I wonder if some existing codes, particularly 'interlocutory' (I had to look that one up), may be similar in regard to the 80%?  If there's reasonable doubt, it may be best to leave the value set in the core spec as it is and deal with this in a jurisdiction-specific profile or, if necessary, adding a local code as Tristan was asking.</p>",
        "id": 155166831,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1547557092
    },
    {
        "content": "<p>we have never said that the 80% thing applies to defining codes</p>",
        "id": 155169730,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1547559897
    },
    {
        "content": "<p>I didn't claim that either - but it may make sense for an 'example' value set, to not have oodles of codes which will be irrelevant to most of the readers. Remember the HL7v3 value set for AlaskanNativeLanguages (tons of values) ? Good to have it, but also good not to include it into a global example value set.</p>",
        "id": 155171744,
        "sender_full_name": "René Spronk",
        "timestamp": 1547561545
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> Given the tight specification of this narrowly defined value set, I don't see a need to worry about using AlaskanNativeLanguage as the defining example - they are simply different situations. You don't need to use a concept that has no use for you, and if you need to profile a new value set so Common Law is not imposed on Napoleonic countries. Simply said, the \"80%\" rule has no bearing on adding this code to the code system.</p>\n<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  \"Interlocutory\" is a peculiar legal state in the process of obtaining a final divorce, in essence it means the plan is set but the ink is not dry. This has nothing to do with Common Law \"marriage\" - which btw are totally legal jurisdiction dependent (I cringe as I say that...)</p>",
        "id": 155176656,
        "sender_full_name": "Robert McClure",
        "timestamp": 1547565356
    },
    {
        "content": "<p>As I said, I looked up \"interlocutory\" as I wasn't clear on it before.</p>",
        "id": 155179078,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1547566907
    },
    {
        "content": "<p>PA is creating a Harmonization request to include the Common Law value in the marital status</p>",
        "id": 155208141,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1547589534
    }
]