[
    {
        "content": "<p>Hi everyone, <br>\nI'm working on setting up an EHR and I'm doing my best to be FHIR compatible, but I'm hitting a limitation in dealing with what I dubbed, for lack of a better term, \"negative knowledge\". What I mean by that is all information that roughly fits the pattern \"we know that the patient has never had X\", e.g. \"we know that there is no history of diabetes in the family\". <br>\nShould I structure it differently at all? My motive to do so is that when merging \"positive\" and \"negative\" information I'm flooding our medical practitioners with information that is not relevant or helpful in day to day patient care - and we're looking to hide that information by default but make it quickly accessible and searchable.<br>\nI'm sure this distinction is not new, but I'm having trouble finding related terms and/or articles and/or FHIR resources that would help in dealing with this.<br>\nBest,<br>\nThéo</p>",
        "id": 210922862,
        "sender_full_name": "Théo Matussière",
        "timestamp": 1600804472
    },
    {
        "content": "<p>Typically negative assertions show up as formal Observations only if they're specifically 'pertinent' to care.  So something like \"no family history of heart disease\" would be perfectly reasonable to have as an Observation.  Similarly negative findings of susceptibility tests would be captured as Observations.  However, if you had a questionnaire that asked people to check off all conditions that they had a family history of, you wouldn't typically extract an Observation of \"no family history of X\" for everything they didn't click on.  (You could, but as mentioned, it would be noisy for most clinical use.)  The short answer is that if you need to represent a negative finding, you use the same resource.  So \"no allergy to X\" would be an AllergyIntolerance with a status of refuted.  \"No family history of X\" would be an Observation.  \"Cancer free\" would be a Condition with a status of refuted, remission or resolved (depending on the clinical context), etc.</p>",
        "id": 210935451,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600811215
    },
    {
        "content": "<p>Great answer, super clear, thanks!</p>",
        "id": 210979305,
        "sender_full_name": "Théo Matussière",
        "timestamp": 1600853910
    },
    {
        "content": "<p>Coming back as I'm unable to disambiguate between two statements from the docs:</p>",
        "id": 211256770,
        "sender_full_name": "Théo Matussière",
        "timestamp": 1601040235
    },
    {
        "content": "<blockquote>\n<ol>\n<li>\"The Condition.code may also include such concepts as \"history of X\" and \"good health\", where it is useful or appropriate to make such assertions. It can also be used to capture \"risk of\" and \"fear of\", in addition to physical conditions, as well as \"no known problems\" or \"negated\" conditions (e.g., \"no X\" or \"no history of X\").\"</li>\n</ol>\n</blockquote>\n<p>And </p>\n<blockquote>\n<ol start=\"2\">\n<li>\"It is common as part of checklists prior to admission, surgery, enrollment in trials, etc. to ask questions such as \"are you pregnant\", \"do you have a history of hypertension\", etc. This information should NOT be captured using the Condition resource but should instead be captured using QuestionnaireResponse or Observation. In this case, the combination of the question and answer would convey that a particular condition was not present.\"</li>\n</ol>\n</blockquote>",
        "id": 211256862,
        "sender_full_name": "Théo Matussière",
        "timestamp": 1601040260
    },
    {
        "content": "<p>Therefore it is unclear for me how to properly use a Condition with \"refuted\" status - if we were to have made extensive testing for diabetes for a patient, would we use a diabetes condition with \"refuted\", because of the inquiries?</p>",
        "id": 211257017,
        "sender_full_name": "Théo Matussière",
        "timestamp": 1601040343
    }
]