[
    {
        "content": "<p>On the HTTP page, in the Response Summary table (<a href=\"http://www.hl7.org/fhir/http.html#summary\" target=\"_blank\" title=\"http://www.hl7.org/fhir/http.html#summary\">http://www.hl7.org/fhir/http.html#summary</a>), there are a few instances of Response Body: \"Resource (Prefer)\".  Does \"Resource\" mean the Resource Type for the Create? Could the response body (for a Successful Create) be:<br>\n1) a Bundle resource, with the created Resource and an OperationOutcome?<br>\n2) a Bundle resource with multiple OperationOutcome entries?<br>\n3) an OperationOutcome (severity=information)?</p>\n<p>Recognizing this would be unusual behaviour, and implementations may not be capable of handling this response, but curious about its conformance. I've looked at the rules around <a href=\"http://hl7.org/fhir/http.html#ops\" target=\"_blank\" title=\"http://hl7.org/fhir/http.html#ops\">Prefer headers</a>, and the conformance language regarding returning an OperationOutcome (information) for success is only \"should\" and not \"shall\". </p>\n<p>The use case is for a FHIR Create endpoint A Facade, with an underlying distributed system, which in turn initiates FHIR Create on Server X and FHIR Create on Server Y. We want the ability for the requester calling endpoint (A) to know that the results from Server X and Server Y, whether successful or failure. In the case that (X) is successful but (Y) fails, (A) is still considered successful as it has done its job to call the underlying systems (similar to FHIR batch rules).</p>",
        "id": 187879259,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1581389556
    },
    {
        "content": "<p>Bumping this question.</p>\n<p>On the HTTP page, in the Response Summary table (<a href=\"http://www.hl7.org/fhir/http.html#summary\" target=\"_blank\" title=\"http://www.hl7.org/fhir/http.html#summary\">http://www.hl7.org/fhir/http.html#summary</a>), there are a few instances of Response Body: \"Resource (Prefer)\". Does \"Resource\" mean the same Resource Type for the Create?  Could the response payload be a different resource type, e.g. Bundle with the original Resource Type from the Create?</p>",
        "id": 189125581,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1582731628
    },
    {
        "content": "<p>It means the same resource type</p>",
        "id": 189126774,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1582732333
    }
]