[
    {
        "content": "<p>I have <a href=\"/user_uploads/10155/BsTwPdikT4Qaeo-GLPnUf7JM/zib-HealthProfessional-PractitionerRole.xml\">this R4 profile</a> on PractitionerRole, which overrides the core ValueSet binding to c80-practice-codes on <code>PractionerRole.specialty</code>with a custom ValueSet. This base binding is \"preferred\", so it shouldn't be a problem to replace it.<br>\nHowever, when I try to validate an example instance with a code from my custom ValueSet, I still get the following message:</p>\n<div class=\"codehilite\"><pre><span></span><code>None of the codes provided are in the value set http://hl7.org/fhir/ValueSet/c80-practice-codes (http://hl7.org/fhir/ValueSet/c80-practice-codes), and a code is recommended to come from this value set)\n</code></pre></div>\n<p>This message is just of level \"information\" but still it bugs me. Shouldn't the derived profile override the base ValueSet? So why is it still recommended to use the base ValueSet?</p>",
        "id": 229319183,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1615218223
    },
    {
        "content": "<p>The validator validates against both the profile and the base resource - the warning stems from validation against the base resource.</p>",
        "id": 229319689,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615218371
    },
    {
        "content": "<p>Ho <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , I get that. I just wonder why. If I interpret the specs correctly, the base binding shouldn't be considered at all if the derived profile overrides this binding.</p>",
        "id": 229328101,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1615220532
    },
    {
        "content": "<p>Profiles can't 'override' the base bindings - the base bindings still hold.  So even if you're using a profile that declares a required binding, the preferred binding for the base resource is still applicable.  (And implementers should, ideally, satisfy both).  The only situation we might want to suppress a based binding is if the base is a preferred binding and is on a non-repeating Coding element.</p>",
        "id": 229329574,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615220870
    }
]