[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I am working on task <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13819\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13819\">GF#13819</a>. now that I come to do it I find the name strange - what's 'canonical' got to do with it? It's really $id-translate</p>",
        "id": 153938294,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518817496
    },
    {
        "content": "<p>It's not translating anything.  It's returning the current authoritative id for the system</p>",
        "id": 153938305,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518826421
    },
    {
        "content": "<p>or another one, if you ask for that. Ando nly if you have an authoritative one</p>",
        "id": 153938309,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518828412
    },
    {
        "content": "<p>As defined, it will return the authoritative id for a given system - if you pass in the authoritative id, you'll get the same thing back.  If you pass in something else, you'll get the authoritative id back.  If there is no authoritative id, you'll get nothing back.  That doesn't sound like translation to me...</p>",
        "id": 153938315,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518841667
    },
    {
        "content": "<p>\"It would take two arguments - an existing system string (OID, URL, etc.) and code indicating whether you're looking for an OID (CDA or v3), a URL (FHIR) or anything (v2)\" - that's different to what you're describing</p>",
        "id": 153938322,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518849481
    },
    {
        "content": "<p>The second parameter just indicates what \"type\" of canonical you want.</p>",
        "id": 153938334,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518880396
    },
    {
        "content": "<p>Do I want the preferred OID, the preferred URL or something else?</p>",
        "id": 153938335,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518880427
    },
    {
        "content": "<p>so if you give a preferred identifier, you can get a different kind of preferred identifier</p>",
        "id": 153938342,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518898264
    },
    {
        "content": "<p>Or you can get confirmation that the identifier you provided is indeed the preferred identifier.</p>",
        "id": 153938365,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518926672
    },
    {
        "content": "<p>so 'canonical' just doesn't seem right the word to me</p>",
        "id": 153938366,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518926857
    },
    {
        "content": "<p>preferred?</p>",
        "id": 153938370,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518926966
    },
    {
        "content": "<p>maybe. I'll try writing it up</p>",
        "id": 153938372,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518927009
    },
    {
        "content": "<p>A question which I think relates. What is the FHIR take on using a canonical URI to the abyss as system? E.g: <a href=\"http://ehelse.no/fhir/codesystem/ICD10\" target=\"_blank\" title=\"http://ehelse.no/fhir/codesystem/ICD10\">http://ehelse.no/fhir/codesystem/ICD10</a></p>",
        "id": 153967794,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528360604
    },
    {
        "content": "<p>I don't understand this question? abyss? is this a translation issue?</p>",
        "id": 153967801,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528362247
    },
    {
        "content": "<p>Oh, sorry. Hehe, I ment to a page that does not exist. Just a canonical URI to a 404</p>",
        "id": 153967812,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528363121
    },
    {
        "content": "<p>oh well, it's legal, but implementers won't like you for it</p>",
        "id": 153967814,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528363377
    },
    {
        "content": "<p>bit it's not legal if we already defined a different canonical url for the code system - which we did in this case</p>",
        "id": 153967815,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528363401
    },
    {
        "content": "<p>Hmm, I see. Yeah, the case for for your discussion, only related to the topic.</p>\n<p>Use case: We have a termonology server but we don't want to publish the URI to the public. We could define e.g a volven code for it but using an OID just to define an empty valueset makes no sense to me. Therefore we could define a canonical to a 404 just so the implementer knows the kind of system it is.</p>\n<p>The alternative is easier in my opinion, but I not sure of legality. Maybe you can answer this too. The real use of this is that a client asks us through a search for a code which can be in one or several value sets. The easiest would just to put e.g<br>\n{<br>\n  system: ATC,<br>\n  code: A001CQW<br>\n}</p>\n<p>Is this also legal? The IG would of course specify this. Why would you say implementers don't like this and how do you normally define this?</p>",
        "id": 153967818,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528364123
    },
    {
        "content": "<blockquote>\n<p>We have a termonology server but we don't want to publish the URI to the public.</p>\n</blockquote>\n<p>ok, no need to publish any URL to a Terminology server</p>\n<blockquote>\n<p>We could define e.g a volven code for it but using an OID just to define an empty valueset makes no sense to me. </p>\n</blockquote>\n<p>where does the empty value set fit in?</p>\n<blockquote>\n<p>Therefore we could define a canonical to a 404 just so the implementer knows the kind of system it is.</p>\n</blockquote>\n<p>but they won't know what it is because just get a 404....</p>",
        "id": 153967820,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528364705
    },
    {
        "content": "<p>1. Cool!</p>\n<p>2. Because for instance the system to a system could contain everything from 10 to 100 000 codes, so it's not really an option to provide this in a web page. The case would be to use a canonical URI as a system just to describe to the server and to the user what kind of system it is. The system and code will be provided from our termonology system</p>\n<p>3. The idea was that the URI would define it, like my example: <a href=\"http://ehelse.no/fhir/CodeSystem/ATC\" target=\"_blank\" title=\"http://ehelse.no/fhir/CodeSystem/ATC\">http://ehelse.no/fhir/CodeSystem/ATC</a></p>",
        "id": 153967828,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528370824
    },
    {
        "content": "<p>#2 well, consider  LOINc - we just refer to loinc home page... you don't have to list the codes..</p>",
        "id": 153967829,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528370962
    },
    {
        "content": "<p>#3 ok I understand. But it's better for users if it resolves to something informative, if they don't know the rules for, say, ATC.</p>",
        "id": 153967830,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528371017
    },
    {
        "content": "<p>doesn't have to.</p>",
        "id": 153967831,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528371024
    },
    {
        "content": "<p>#2 Yes, you are right. LOINC would be similar to e.g /ATC /ICD10 /snomed </p>\n<p>#3 I see your point. Well, the idea is really that they search a seperate server for the system and code and then uses our FHIR server to register the data. We except only the same system and codes we ourselves provide. So there is not really a place for the user to get the data from externally except from our server.</p>",
        "id": 153967833,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528371259
    },
    {
        "content": "<p>right. but some random chump somewhere in the world gets your data (via some patient method - it's not jurisdictionally bounded...) they've got no context, just the system URI... that's why we like the page to say something useful, because information is free and will travel...</p>",
        "id": 153967834,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528372265
    },
    {
        "content": "<p>Aha, I see your argument now. Okey, since this is not likely for our case, at least not for the moment we can go with this. Thanks a lot :)</p>",
        "id": 153967838,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528372749
    },
    {
        "content": "<p>well, you <em>think</em> it's not likely.... but the decision you make now will last... and last... and information will be free....</p>",
        "id": 153967839,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528372783
    },
    {
        "content": "<p>Valid point. There will in the future probably be open terminlogy servers and then they are free to choose from something that makes semanticly more sense. :)</p>",
        "id": 153967841,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528373033
    },
    {
        "content": "<p>Once the canonical URL has been established, terminology servers can't change it</p>",
        "id": 153967846,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528377825
    },
    {
        "content": "<p>Hehe, sounds like we have an issue then. How do people solve this? I mean, we can of course wait a year for the external term. server to go online, but not very handy when implementing new stuff.</p>",
        "id": 153967865,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528398482
    },
    {
        "content": "<p>it's not that the terminology needs to be available, but that you choose a URL where you can maintain something at the endpoint. are you familiar with the concept of a permalink?</p>",
        "id": 153967877,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528401130
    },
    {
        "content": "<p>Not through practice. </p>\n<p>When it comes to medications we have perhaps 4 - 5 coding systems that are being used. So could the endpoint just serve some text then? If your medication code system is ATC then we serve system: <a href=\"http://ehelse.no/fhir/CodeSystem/ATC\" target=\"_blank\" title=\"http://ehelse.no/fhir/CodeSystem/ATC\">http://ehelse.no/fhir/CodeSystem/ATC</a> which would contain nothing really relevant. What I struggle with here is what is the \"something\" and the endpoint? ATC has maybe 50 000 entries, I can't maintain that on a web page, and this would in a way render the term. server not of that much of use. </p>\n<p>It really boils down to that I need this { \"system\": \"ATC\", \"code\": \"A01etcetc\" } and the only this that knows about it from our clients perspective is the server from which you normally would do a search from first.</p>",
        "id": 153967996,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528432142
    },
    {
        "content": "<p>if I was looking in a resource, and I found a URL I didn't know, what I'd really like is if I put it in my browser, I'd get back<br>\n- name<br>\n- source where I could get it <br>\n- information about how versioning works<br>\n- how I could figure out correct displays</p>\n<p>in fact, precisely what happens with the URL <a href=\"http://hl7.org/fhir/ndfrt\" target=\"_blank\" title=\"http://hl7.org/fhir/ndfrt\">http://hl7.org/fhir/ndfrt</a></p>",
        "id": 153967997,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528432315
    },
    {
        "content": "<p>except, actually, completely not like that, because it's supposed to (and used to) redirect to <a href=\"http://hl7.org/fhir/ndfrt.html\" target=\"_blank\" title=\"http://hl7.org/fhir/ndfrt.html\">http://hl7.org/fhir/ndfrt.html</a></p>",
        "id": 153967998,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528432350
    },
    {
        "content": "<p>Erh, ah. So this would equal my /ATC case? I see. So basically the idea is to put the meta data explaining shortly what is the purpose, use etc. Good example</p>",
        "id": 153968002,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528432748
    },
    {
        "content": "<p>yes. just some information so people don't get left hanging.</p>",
        "id": 153968003,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528432813
    },
    {
        "content": "<p>Right. Okey, thanks a lot :)</p>",
        "id": 153968006,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528433020
    },
    {
        "content": "<p>And if a registry comes along later that lets people navigate the codes, you can update your page to include a link</p>",
        "id": 153968007,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528433023
    },
    {
        "content": "<p>That is true, it would be able to tell the client of several places the codes are available. Good point</p>",
        "id": 153968008,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528433075
    },
    {
        "content": "<p>for bonus points, it can recognise the fhir mime type, know that it's a fhir client, and redirect to the actual content - if available. but no one's got to that yet</p>",
        "id": 153968010,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528433137
    },
    {
        "content": "<p>(well, other than the base spec)</p>",
        "id": 153968011,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528433153
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195227\">@Thomas Johansen</span> Just to confirm, you don't mean the WHO ATC code system do you? <a href=\"https://www.whocc.no/atc/structure_and_principles/\" target=\"_blank\" title=\"https://www.whocc.no/atc/structure_and_principles/\">https://www.whocc.no/atc/structure_and_principles/</a> Certainly don't want you making up things for code systems you are not responsible for.</p>",
        "id": 153968235,
        "sender_full_name": "Robert McClure",
        "timestamp": 1528641677
    },
    {
        "content": "<p>Well, yes, it is. We have the entire thing downloaded, cause of various reasons having to with infrastructure. What is the problem with this? It is still ATC and can be found and searched through our system.</p>",
        "id": 153968240,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528646457
    },
    {
        "content": "<p>see <a href=\"http://build.fhir.org/terminologies-systems.html\" target=\"_blank\" title=\"http://build.fhir.org/terminologies-systems.html\">build.fhir.org/terminologies-systems.html</a>  - we already defined <a href=\"http://www.whocc.no/atc\" target=\"_blank\" title=\"http://www.whocc.no/atc\">http://www.whocc.no/atc</a> as te URI that you use for ATC. I should have asked this</p>",
        "id": 153968244,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528661232
    },
    {
        "content": "<p>Well, we have many code systems connected to these 'issues' we are having, so it is not only connected to ATC. We are mostly using codes from FEST, Norwegian systems for various medications, brands etc. This new information also gives me some kind of a challenge. Would you see this as appropriate? </p>\n<p>ATC<br>\n{<br>\n  \"system\": \"<a href=\"http://www.whocc.no/atc\" target=\"_blank\" title=\"http://www.whocc.no/atc\">http://www.whocc.no/atc</a>\",<br>\n  \"code\": \"A01\"<br>\n}</p>\n<p>Other, provided from us (random content)<br>\n{<br>\n  \"system\": \"ABSOLUTT\",<br>\n  \"code\": \"1_201AS24\"<br>\n}</p>\n<p>Meaning this is what we provide to the consumers, then if they register something in i.g Allergy Intolerance they would use the same info. Maybe I seem rigid about this, but there is also the \"issue\" of verifying that the codes and system we get is even correct. Therefore it is better for us to provide everything ourselves and they can use that. Of course, ATC is ATC so doesn't matter where you find the code for it. We need to recognize the system is all</p>",
        "id": 153968252,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528693218
    },
    {
        "content": "<p>so, yes, you should use the properly defined atc url as in the example you provided. For your other example, though, you need to provide a URI, not a code word. So something like <a href=\"http://hl7.no/fhir/CodeSystem/ABSOLUTT\" target=\"_blank\" title=\"http://hl7.no/fhir/CodeSystem/ABSOLUTT\">http://hl7.no/fhir/CodeSystem/ABSOLUTT</a>  (though it doesn't actually need to be a proper FHIR URL like that one)</p>",
        "id": 153968253,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528694520
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195227\">@Thomas Johansen</span> The bottom line here is that you should not take someone else's code system and define it as your own.  It really doesn’t matter if you think you are a top-notch source for it or not. This is important not only for IP issues, but for interoperability issues - the definitional url for a code system <strong>SHALL</strong> be the same everywhere and <strong><em>should</em></strong> be under the control of the code system steward.</p>",
        "id": 153968806,
        "sender_full_name": "Robert McClure",
        "timestamp": 1528848433
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> Ah, you are just talking about the system uri. Well, that makes sense.</p>",
        "id": 153968891,
        "sender_full_name": "Thomas Johansen",
        "timestamp": 1528873993
    }
]