[
    {
        "content": "<p>I'm looking at the /Task resource state machine, in the context of sending a referral (using /referralRequest). I notice that once in progress (or on hold) it does not have an arrow to the \"cancelled\" state. </p>\n<p>What is the philosophy behind this?</p>\n<p>In the context of referrals, it relates to when i put a referral into \"in-progress\" and when i leave it in \"ready/accepted\". I.e., if i can't get to \"cancelled\" from \"in-progress\", i have to wait until the patient is in my office to put it into the \"in-progress\" state (because otherwise i can't get back to cancelled, which could theoretically happen 1min before the appointment).</p>\n<p>Also, it's not hard to conceive of a \"hold\" state that gets moved to \"cancelled\". Would we philosophically say if a task on hold gets cancelled, it should be completed instead (with some kind of cancelled business status)?</p>",
        "id": 153921673,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1511804028
    },
    {
        "content": "<p>\"cancelled\" can only happen before in-progress occurs.  After that, you can only go to \"failed\".  It would however be reasonable to have a direct transition from \"held\" to \"failed\".</p>",
        "id": 153921675,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1511805466
    },
    {
        "content": "<p>Alright, so from a \"referral\" perspective, I wouldn't put a \"send referral\" task into \"in progress\" while i'm in the referral work-up stage (i.e., looking for additional documentation, triaging, etc..).  I would keep it in \"accepted/ready\" until the patient shows up.</p>\n<p>I will also enable going to \"cancelled\" from \"hold\" then in my workflow, thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 153921677,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1511805732
    },
    {
        "content": "<p>In other words what i mean is that by this state machine, a \"refer\" task is \"in progress\" when i'm doing the action requested in the referral, but NOT yet in progress when i am doing the preparation work to provide the service requested in the referral.</p>",
        "id": 153921678,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1511806029
    },
    {
        "content": "<p>Going from cancelled from \"hold\" would be a problem.  \"hold\" means \"I've started delivering care, but paused temporarily\".  \"cancelled\" means \"I ended the request before anything actually started - i.e. no care was delivered\".</p>",
        "id": 153921679,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1511806327
    },
    {
        "content": "<p>We could potentially add a \"preparation\" status between \"accepted\" and \"in-progress\" if that were useful</p>",
        "id": 153921680,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1511806389
    }
]