[
    {
        "content": "<p>When using $apply, does the order of actions as they appear in the PlanDefinition matter? For example, is it expected behaviour that if action 1 appears first followed by action 2 this will result in the same output as $apply acting on a PlanDefinition with action 2 appearing first followed by action 2?</p>",
        "id": 265607089,
        "sender_full_name": "Kyle Thompson",
        "timestamp": 1640029027
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 265611584,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1640031822
    },
    {
        "content": "<p>That is how most systems currently process them, however the spec doesn't really specify that. To create true ordering you need to state it explicitly using relatedAction elements. In the eCR IG, we enforce a subset of behaviors in this regard to make processing easier. Specifically, we only allow forward references: <a href=\"http://build.fhir.org/ig/HL7/case-reporting/electronic_reporting_and_surveillance_distribution_ersd_transaction_and_profiles.html#process\">http://build.fhir.org/ig/HL7/case-reporting/electronic_reporting_and_surveillance_distribution_ersd_transaction_and_profiles.html#process</a></p>",
        "id": 266714207,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1641231528
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"401577\">@Kyle Thompson</span></p>",
        "id": 266714218,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1641231535
    },
    {
        "content": "<p>Do you think it would be problematic for a system to assume that permutations of actions in PlanDefinitions should always result in the same output and that if ordering does matter that it should be stated explicitly (as you suggested)?</p>\n<p>To me, requiring the system to process actions assuming ordering is explicitly captured as relatedActions, and if it isn't, then to not behave as the ordering doesn't matter makes a lot of sense.</p>",
        "id": 267190502,
        "sender_full_name": "Kyle Thompson",
        "timestamp": 1641563278
    },
    {
        "content": "<p>Yes, the specification should be more clear about that, the PlanDefinition $apply behavior is vague right now, just saying \"processing is performed for each action element\". In the Workflow subworkgroup, we've been working through mapping PlanDefinition to and from BPMN, and that's helped clarify some of those semantics, and there is the <a href=\"https://github.com/cqframework/pd-apply\">pd-apply</a> that we're using for testing.</p>",
        "id": 267201137,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1641568921
    },
    {
        "content": "<p>That will result in some proposed changes to the specification to clarify the processing semantics.</p>",
        "id": 267201217,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1641568960
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"401577\">Kyle Thompson</span> has marked this topic as resolved.</p>",
        "id": 267204585,
        "sender_full_name": "Notification Bot",
        "timestamp": 1641570611
    }
]