[
    {
        "content": "<p>Does it make sense to set action.resource in a RequestGroup to a Goal or would it make sense to have action.reference point to a Task whose focus in a Goal?</p>",
        "id": 261028222,
        "sender_full_name": "Kyle Thompson",
        "timestamp": 1636566996
    },
    {
        "content": "<p>The action.resource should be pointing to a Request or Event resource that represents the activity being performed. In R5, we've added <code>goal</code> elements to the RequestGroup and RequestGroup.action, so you could use a pre-adoption extension to reference the goal directly in an R4 RequestGroup.</p>",
        "id": 261057347,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1636579719
    },
    {
        "content": "<p>OK, that makes sense to store the Goal on the Action in the RequestGroup.</p>\n<p>From what I understand, Task's can be used to both represent a Request and track the fulfillment of that request. Is that correct? If it is correct, could I reference a Task in a RequestGroup action where the Task references the Goal as its focus?</p>",
        "id": 261063853,
        "sender_full_name": "Kyle Thompson",
        "timestamp": 1636582973
    },
    {
        "content": "<p>Goal still doesn't feel like the right target for Task.focus to me. The definition for focus is \"The request being actioned or the resource being manipulated by this task.\", since the Goal isn't what's being acted on or manipulated, that doesn't seem right. Seems more like a \"reasonReference\", since the Goal is why the Task is being created, or at least what is trying to be accomplished.</p>",
        "id": 261073220,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1636588158
    },
    {
        "content": "<p>Focus would be something more like a ServiceRequest or a Procedure, or something like that.</p>",
        "id": 261073237,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1636588176
    },
    {
        "content": "<p>That makes perfect sense. Thanks so much for clarifying!</p>",
        "id": 261133480,
        "sender_full_name": "Kyle Thompson",
        "timestamp": 1636637339
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"401577\">Kyle Thompson</span> has marked this topic as unresolved.</p>",
        "id": 261133490,
        "sender_full_name": "Notification Bot",
        "timestamp": 1636637348
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"401577\">Kyle Thompson</span> has marked this topic as resolved.</p>",
        "id": 261133502,
        "sender_full_name": "Notification Bot",
        "timestamp": 1636637352
    },
    {
        "content": "<p>Task.focus could be a Goal if the objective of the Task is getting someone to manipulate the Goal (e.g. because the requester doesn't have authority to do so)</p>",
        "id": 261459435,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1636955041
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Oh, does this mean, for example, if we have a Task for some system or someone to update a property of the Goal, not related to the completion of the Goal, then it makes sense to have the Goal as the focus of the Task?</p>",
        "id": 261840711,
        "sender_full_name": "Kyle Thompson",
        "timestamp": 1637179488
    },
    {
        "content": "<p>Right.</p>",
        "id": 261870848,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637195391
    },
    {
        "content": "<p>Ah, yes. That makes perfect sense and further clarifies the when and how to use Task.focus. Thank you!</p>",
        "id": 261944483,
        "sender_full_name": "Kyle Thompson",
        "timestamp": 1637250217
    }
]