[
    {
        "content": "<p>We need to add a value to the Appointment resource that is an internal identifier.  This identifier is not unique per Appointment record.  Is it acceptable to use Appointment.identifier for this use case or should it be a custom extension?</p>",
        "id": 245959478,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1626269490
    },
    {
        "content": "<p>If it's not a unique value, then how do you use it as an identifier now, just internally?</p>",
        "id": 245968523,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1626273359
    },
    {
        "content": "<p>Yes.  It is a code that we use internally to signify an organization.</p>",
        "id": 245968978,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1626273560
    },
    {
        "content": "<p>If it's an identifier of an organization then it belongs on an Organization resource. Perhaps your appointment resource will reference the organization resource via the supportingInfo or indirectly via the <a href=\"http://participant.actor\">participant.actor</a>.</p>",
        "id": 245969393,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1626273773
    },
    {
        "content": "<p>Hi! IMHO, identifiers must be unique in a domain/context by nature or they are not an identifier at all (maybe an attribute or characteristic of the modelled element);  as described <a href=\"https://www.hl7.org/fhir/datatypes.html#Identifier\">https://www.hl7.org/fhir/datatypes.html#Identifier</a> , if this \"Identifier\" is not unique per appointment record, don't use an Identifier type. \"The value SHALL be unique within the defined system and have a consistent meaning wherever it appears.\"</p>",
        "id": 245969805,
        "sender_full_name": "Mario Villace",
        "timestamp": 1626273973
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"236436\">James Dinsmore</span> has marked this topic as resolved.</p>",
        "id": 245976614,
        "sender_full_name": "Notification Bot",
        "timestamp": 1626276728
    }
]