[
    {
        "content": "<p>I am a medical student, I have data in database  for the open source project <a href=\"http://covn.org\">covn.org</a> and and I have identified FHIR resources needed, also found that HAPI may suit well. I am just not finding an easy way or tutorial to begin ahead for using hapi to make first resource with fhir, and also not finding the right stream to post this message for help. please guide</p>",
        "id": 207696888,
        "sender_full_name": "avinash kumar gupta",
        "timestamp": 1598053742
    },
    {
        "content": "<p>Hi &amp; welcome! The stream #hapi is a dedicated (and very active) stream for questions about HAPI FHIR. The online documentation is quite good, e.g for resource manipulation you can start <a href=\"https://hapifhir.io/hapi-fhir/docs/model/working_with_resources.html\">here</a>. If you search \"FHIR DevDays\" on youtube, you will also find some introductory talks from the people behind HAPI. Another concrete starting point is the example projects in the HAPI GitHub repo, e.g. see <a href=\"https://hapifhir.io/hapi-fhir/docs/client/get_started.html\">here for an example project for a HAPI client</a>. Finally, it is always really helpful to play around with one of the public test servers, e.g. <a href=\"http://hapi.fhir.org/\">http://hapi.fhir.org/</a> .</p>",
        "id": 207718861,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1598093503
    },
    {
        "content": "<p>Hello Everyone,<br>\nI've been reading about FHIR and interoperability standards for a while now and I'm still feeling kinda lost.<br>\nI'm trying to understand the relation between FHIR official documnetation, the Implementation Guides (like US CORE) and the IHE profiles.</p>\n<p>Am I correct to assume the following use case of each document:<br>\ne.g. when building a device that sends weight to CDR, I could use IHE Device Enterprise Communication (DEC) profile to draw the logic, then implement this profile using FHIR and send weight data using Observation resource, which has profile defined in US Core?</p>\n<p>P.s.<br>\nIf I'm not limited by any local implementation guide, is it good practice to choose from any existing (like us core) or maybe its okay to skip IG?<br>\nAlso - If IHE profile for my case reffers only to HL7 V2 yet I need to use FHIR, is it okay to skip ihe profile as well?</p>\n<p>Thanks in advance!<br>\nFHIR Newbie :)</p>",
        "id": 251543536,
        "sender_full_name": "Łukasz Kułakowski",
        "timestamp": 1630496413
    },
    {
        "content": "<p>All of these specifications have one thing in common, they are attempting to define interoperability, or how to standardize the transmission of healthcare data. <br>\nHL7 FHIR defines a collection of resources, this is how an \"observation\" is defined. These are the attributes that go along with it etc.<br>\nHL7 FHIR also defines a restful API that defines how to query and push data around, using the above resources.</p>\n<p>IG's are meant for certain use cases.<br>\nUS Core, does your exchange of information have to comply with USCDI? If so you'll want to pay attention to this.<br>\nCARIN BB, does you exchange of information have to comply with CMS Patient Access API? If so this IG applies.<br>\nPDEX formulary, CMS Patient Access API.<br>\nPDEX Plannet, CMS Patient Access API.<br>\nYou are required to comply with an IG because a 3rd party requires its use.</p>\n<p>IHE is much like an HL7 IG (my experience with them, was IHE transactions and CDA documents), but most of it still applies. There are certain interactions that, if you follow them, allows you to connect (hopefully) seamlessly with other software applications with no direct testing effort. </p>\n<p>Much like how lightbulb manufacturers don't have to test with every lamp maker, both actors follow the standard and can prove they follow the standard, thus every lightbulb should work, out of the box, with every lamp. Every HL7 FHIR compliant server should work out of the box, with every HL7 FHIR compliant client application.</p>",
        "id": 251553407,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1630501258
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"434643\">Łukasz Kułakowski</span> has marked this topic as resolved.</p>",
        "id": 251573870,
        "sender_full_name": "Notification Bot",
        "timestamp": 1630508346
    },
    {
        "content": "<p>The base FHIR standard is quite wide open - almost all elements are optional and many have very loose expectations around what codes are used, etc.  Implementation guides tighten down that base specification for use in a particular space.  For example, in Patient, name is optional - because in some use-cases, name might not apply (Patient is a chicken) or not be allowed to be shared (anonymized public health reporting).  However, in other use-cases, having name is really important.  Implementation guides take the base standard and tighten it down to what's relevant in a narrower space - a particular country, a particular type of patient, a particular set of use-cases.  As a result, you get better interoperability within that space.</p>",
        "id": 251574299,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630508448
    },
    {
        "content": "<p>Correct, but different local constraints may end up with incompatible client/server combinations...</p>",
        "id": 251695921,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1630579512
    }
]