[
    {
        "content": "<p>I am working on a historical conversion of Claim data to the FHIR model. The data set can have claim header level errors, but this does not always mean that the outcome of the ClaimResponse is an error. In general, the header level errors are indicative of a problem matching a member, or the servicing provider not setup in the legacy system. In our attempt to not lose this historical data on conversion, we have discussed adding the claim header error in the ClaimResponse.error object while also filling out details of the claim line items in ClaimResponse.item. </p>\n<p>The question I have is around having both ClaimResponse.error and ClaimResponse.item in the final FHIR data structure. The comments on the ClaimResponse.error object point to not including the ClaimResponse.item details. \"<em>If the request contains errors then an error element should be provided and no adjudication related sections (item, addItem, or payment) should be present.</em>\" </p>\n<p>Is this a strict requirement? The issue with the historical data is that we have a final snapshot of the claim details, so most that had an claim header error to start, end up being paid claims.</p>",
        "id": 246847627,
        "sender_full_name": "Andy Devitt",
        "timestamp": 1626961160
    },
    {
        "content": "<p>Strictly speaking on the HL7 language, \"should\" is not mandatory but only recommended. Thus you are free to ignore that advice. Had the sentence said, \"If the request contains errors then an error element should be provided and <del>no</del> adjudication related sections (item, addItem, or payment) <strong>SHALL NOT</strong> be present.\" Then it would have been prohibited.</p>",
        "id": 246855688,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1626964584
    },
    {
        "content": "<p>Thanks Daniel! I was thinking the same thing about the language of should vs shall, but wanted to get someone outside our internal teams perspective.</p>",
        "id": 246860476,
        "sender_full_name": "Andy Devitt",
        "timestamp": 1626966510
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 246864133,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626968236
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"403656\">@Andy Devitt</span> <span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span> If the issues noted did not stop the payor from correctly adjudicating the claim then these are not 'errors' they are issues to advise the sender and should be documented in the .processNote not .error.</p>",
        "id": 246890293,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1626980006
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"403656\">Andy Devitt</span> has marked this topic as resolved.</p>",
        "id": 257426554,
        "sender_full_name": "Notification Bot",
        "timestamp": 1634154669
    }
]