[
    {
        "content": "<p>I'm trying to implement a name with the text modifier and have a question about the implementation<br>\nIf I have a querystring like name:text=Bob%20Smith, would I return entries like \"Bob Smith\", \"Bob X Smith\", \"Bobby Smith\" or only \"Bob Smith\" if there is no given[1]? <br>\nWhere if effectively combines all names into one string, then performs a contains? or takes the first word as given[0]name and second name as a family name and search them as an OR, or an AND?</p>\n<p>Also any suggestions on how to implement name:text=Bob AND Smith and _text=(bone OR liver) and metastases?</p>",
        "id": 248857873,
        "sender_full_name": "Brian Beatty",
        "timestamp": 1628520797
    },
    {
        "content": "<p>Based on the descriptions, you would get a 'contains' search looking for \"Bob Smith\" on the given, family, text and other elements of the name.  So, in general, you're not going to get what you want.  It would be better to do <code>name:text=Bob&amp;name:text=Smith</code>.</p>",
        "id": 248861508,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628522222
    },
    {
        "content": "<p>are each elements, searched on independently?, ex: name:text:Bob%20Smith would only match is family name contains \"Bob Smith\" or given[0]=\"Bob Smith\" or given[1] = \"Bob Smith\" <br>\nOr would it be given[0] + \" \"  + family = \"Bob Smith\" ?</p>",
        "id": 248862541,
        "sender_full_name": "Brian Beatty",
        "timestamp": 1628522603
    },
    {
        "content": "<p>The default expectation would be independent search.  That doesn't mean that systems <em>couldn't</em> implement differently, but I wouldn't expect that to be the norm.</p>",
        "id": 248863009,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628522785
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"400118\">Brian Beatty</span> has marked this topic as resolved.</p>",
        "id": 248863062,
        "sender_full_name": "Notification Bot",
        "timestamp": 1628522816
    }
]