[
    {
        "content": "<p>Hello everyone, apologies for the long post but I believe it's better to be thorough :)</p>\n<p>I'd like to solicit recommendations on the most suitable FHIR type for clinical decision support (CDS) \"Feedback\". The \"Feedback\" concept is outlined in the <a href=\"https://cds-hooks.org/specification/current/#feedback\">current draft of CDS-Hooks</a>. The FHIR R4 specification already includes recommendations to structure other CDS concepts within <a href=\"https://www.hl7.org/fhir/guidanceresponse.html\">GuidanceResponse</a> and <a href=\"https://www.hl7.org/fhir/requestgroup.html\">RequestGroup</a>. Full article: <a href=\"https://www.hl7.org/fhir/clinicalreasoning-cds-on-fhir.html\">14.5 Clinical Decision Support Services</a>.</p>\n<p>The purpose of CDS Feedback is for a user (e.g. Practitioner) to send feedback on a recommendation (e.g. GuidanceResponse) made by a CDS service (e.g. Device) back to said service. This positive/negative/neutral feedback can help the CDS service improve.</p>\n<p>I've thought of a few options for consideration but I'm also interested in other ideas I may have missed.</p>\n<p><strong>A) Use <a href=\"https://www.hl7.org/fhir/communication.html\">Communication</a> type (preferred)</strong>: This type can fit the desired properties nicely because it identifies a <code>sender - Ref(Patient|Practitioner|...)</code> sending info to a <code>recipient - Ref(Device|...))</code>.  It can also refer to the recommendation which the feedback is responding to using <code>about - Ref(Any)</code>. However, it does not have a great place to structure the CDS Feedback <code>outcome</code> which would need to be an extension.</p>\n<p><strong>B) Extend GuidanceResponse type</strong>: The feedback could be embedded within it's parent GuidanceResponse as an extension. I'm not a fan of this approach because I believe feedback should be structured as a separate type.</p>\n<p><strong>C) Extend <a href=\"https://www.hl7.org/fhir/basic.html\">Basic</a> type</strong>: The feedback would be structured as a new type by extending Basic. It can use the <code>subject - Ref(Any)</code> to identify the GuidanceResponse and the <code>author - Ref(Patient|Practitioner|...)</code> to identify the user providing feedback. Extensions would then be used to identify the CDS Feedback <code>outcome</code> and more (e.g. recipient device, send time).</p>\n<p>Appreciate all thoughts, ideas, and feedback. And wow you made it to the end, you deserve a treat! Maybe go grab a cappuccino, you deserve it!</p>",
        "id": 252458231,
        "sender_full_name": "Oliver Cardoza",
        "timestamp": 1631107398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 252461988,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631108786
    },
    {
        "content": "<p>We are currently discussing a new Resource (ArtifactComment) that could provide the structure for feedback (comments) on the CDS artifacts.</p>",
        "id": 252493197,
        "sender_full_name": "Brian Alper",
        "timestamp": 1631119347
    },
    {
        "content": "<p>Great topic, thank you for raising it. As Brian mentioned, an ArtifactComment resource would potentially be a really good fit for this type of feedback, that's effectively what it is (the provider making a comment on the artifact (the CDS Service or the knowledge artifact/recommendation it is running). That doesn't help for R4-space though, where I think extensions would be necessary no matter what because there isn't a great resource currently. And as long as we're in extension space, I think it would make more sense to extend the GuidanceResponse resource, rather than extending Communication. Interested in others thoughts as well. <span class=\"user-mention\" data-user-id=\"438523\">@Oliver Cardoza</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"192085\">@Brian Alper</span></p>",
        "id": 252511921,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1631126555
    },
    {
        "content": "<p>Thanks for the context, it's good to know that future versions beyond R4 may introduce a more applicable type!</p>\n<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> I'm curious why you think option B extending GuidanceResponse is the most preferrable from the options. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I know you expressed concern on my <a href=\"https://stackoverflow.com/questions/69094790/recommended-fhir-type-for-cds-feedback/69094791?noredirect=1#comment122119370_69094791\">SO question</a> stating that Communication is too general a concept. I'm think I'm still struggling to see why a Communication with <code>sender=Ref(Practitioner|Patient)</code> and <code>recipient=Ref(Device)</code> wouldn't fit nicely into intended usage.</p>",
        "id": 252516059,
        "sender_full_name": "Oliver Cardoza",
        "timestamp": 1631128349
    },
    {
        "content": "<p>It's mainly a question of \"where should this data be surfaced\".  A system that's managing and tracking Communications related to a patient (i.e. what data has been shared about them) would be somewhat surprised to see CDS Feedback entries showing in that space.  On the other hand, a system that's managing GuidanceResponses should be able to tolerate/understand that information better.</p>",
        "id": 252518500,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631129385
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192085\">@Brian Alper</span> \"ArtifactComment\" sounds super generic - it's going to need to be scoped carefully.</p>",
        "id": 252518612,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631129415
    },
    {
        "content": "<p>I may be naive in my thinking (new to healthcare) but I imagine Communication records normally being present in a framing context of sender/recipient. For example, a Practitioner inbox filters Communication down to <code>sender=PractitionerA</code> or <code>recipient=PractitionerA</code>. Given a record containing <code>recipient=DeviceB</code> I feel like any communication system <strong>could</strong> implement appropriate filters to remove these types of records if they aren't applicable.</p>",
        "id": 252631814,
        "sender_full_name": "Oliver Cardoza",
        "timestamp": 1631196512
    },
    {
        "content": "<p>Communication isn't really about 'transmission', it's about a record of what was shared.  If you hand the patient a pamphlet, that's Communication.  If you want to record that you faxed a lab result to the patient's GP because they weren't on the recipient list, that's a Communication.</p>",
        "id": 252642810,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631200300
    },
    {
        "content": "<p>Thanks Lloyd, your last comment helped it click. Now when I reread the Communication spec this comment stands out and reflects your point well:</p>\n<blockquote>\n<p>This resource is a record of a communication that has occurred. It does not represent the actual flow of communication.</p>\n</blockquote>\n<p>I appreciate all of the feedback in this topic! I'm happy to close/archive unless others want to continue the discussion.</p>",
        "id": 252728006,
        "sender_full_name": "Oliver Cardoza",
        "timestamp": 1631244915
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"438523\">Oliver Cardoza</span> has marked this topic as resolved.</p>",
        "id": 252728012,
        "sender_full_name": "Notification Bot",
        "timestamp": 1631244924
    }
]