[
    {
        "content": "<p>We are generating a list of appointments and those appointments are tied to both a patient and an encounter.  Encounter has a reference to Appointment but Appointment does not have a reference to Encounter.  How can/should we add an Encounter reference to Appointment?  Is using Appointment.identifier appropriate here?  Or maybe a custom extension?</p>",
        "id": 241083646,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1622586492
    },
    {
        "content": "<p>In FHIR, links are typically one-way, and usually from the later-created to the earlier-created resource. Rather than follow the a reference from Appointment to Encounter, you can search for Encounters that reference a given Appointment. Also see _include and _revinclude under <a href=\"https://www.hl7.org/fhir/search.html#revinclude\">FHIR search</a>.</p>",
        "id": 241087957,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1622589659
    },
    {
        "content": "<p>We don't want bidirectional links because that would require both resources to be updated simultaneously to ensure consistency across resources - and in REST, we generally can't count on the ability to do that - especially if the resources are stored on different servers.</p>",
        "id": 241101614,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622604167
    },
    {
        "content": "<p>We found within the Encounter resource spec (<a href=\"https://www.hl7.org/fhir/encounter.html#bnr\">https://www.hl7.org/fhir/encounter.html#bnr</a>) a standard extension called \"Associated Encounter\" that indicates that it \"should be used to reference an encounter where there is no property that already defines this association on the resource.\"  Is that saying it can be used outside of the Encounter resource for needs similar to the above?  <a href=\"https://www.hl7.org/fhir/extension-encounter-associatedencounter.html\">https://www.hl7.org/fhir/extension-encounter-associatedencounter.html</a></p>",
        "id": 241306618,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1622661613
    },
    {
        "content": "<p>The extension isn't terribly well defined.  It can <em>only</em> appear on an encounter.  It basically says that the referencing encounter occurs within the scope of the referenced encounter.  It won't link Appointments to an Encounter.  Encounters link to appointments.  Given the prohibition on bi-directional links, what other link(s) are you looking for?</p>",
        "id": 241321765,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622669036
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  we were just hoping we could use that extension outside of encounter.  I do understand the prohibition on bi-directional links.  We will look into _revinclude and searching for Encounters using an Appointment reference.  The goal was to provide as much data in the Appointment GET request as possible without needing to perform additional GET requests.  Our experience with _revinclude is limited to Provenance at this point so I'll research that more.  Thank you for your feedback.</p>",
        "id": 241326938,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1622672157
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"236436\">James Dinsmore</span> has marked this topic as resolved.</p>",
        "id": 245977351,
        "sender_full_name": "Notification Bot",
        "timestamp": 1626277050
    }
]