[
    {
        "content": "<p>We are trying to determine how to refer to multiple services at one target organization. We have two main options:</p>\n<p>1) Many ServiceRequets, one for each ServiceRequest.performer.reference(HealthcareService)<br>\n2) 1 ServiceRequests with many ServiceRequest.performer.reference(HealthcareService)</p>\n<p>ServiceRequests allows for * ServiceRequest.performer, but I feel like that's much less practical when referring to a HealthcareService vs referring to a Practitioner/PractitionerRole. The main problem with 2) is managing the subsequent workflow status (for example, what if one service gets cancelled and the other does not, how to set the status?) and tallying statistics for ServiceRequet volumes to different services.</p>\n<p>What is the prevailing philosophy out the regarding including multiple performer HealthcareServices in a ServiceRequest? I feel like I want to restrict it to one service per referral, but want to understand the rationale behind the 0..* allowance first.</p>",
        "id": 177576169,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1570497615
    },
    {
        "content": "<p>What's your intention with respect to suspending/cancelling part of the order?  Typically every individual thing ordered should be a separate ServiceRequest to allow them to be managed separately.</p>",
        "id": 177614566,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570541877
    },
    {
        "content": "<p>(and resulted separately)</p>",
        "id": 177614620,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570541885
    },
    {
        "content": "<p>The use case is mainly concerned with sending ONE rather than many updates back to the requester ... but at the same time wants to progress the status of each request at different rates, AND potentially wants to add additional services that were not part of the initial ServiceRequest (and let the requester i.e., family doc) know all of that at once.</p>\n<p>I'm puzzling trying to figure out how to put all these pieces together...</p>",
        "id": 178147756,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1571095878
    },
    {
        "content": "<p>The division across multiple resources should never be driven by how much you want to communicate at once.  If you need to communicate more than one thing at once and don't want to sue something like _include queries, you're pretty much stuck with messaging.  The division of content into one request vs. multiples is driven by what has independent state - and it sounds like in this case you have that.</p>",
        "id": 178148664,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571096926
    }
]