[
    {
        "content": "<p>In order to be compliant 21st Century Cures Act, API needs to support DocumentReference.  The US Core IG states that the response should be capable of returning all documents in a patient's chart.  Are there any exceptions such as psychotherapy notes which is specifically excluded from the definition of EHI?</p>",
        "id": 198472363,
        "sender_full_name": "SueAnn Svaby",
        "timestamp": 1590169552
    },
    {
        "content": "<p>This is a policy question that should be asked of legal  council.</p>",
        "id": 198473840,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590170279
    },
    {
        "content": "<p>Patients in general have \"Patient Right of Access\". which would certainly say that the patient gets access</p>",
        "id": 198473968,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590170315
    },
    {
        "content": "<p>However there is also well established \"safety\" considerations that might be appropriate to limit the data. For example it is common to restrict lab results that are indicators of life-changing results where the medical practice norms delays the access to the patient until their doctor can consult directly with them or some timeframe elapses.</p>",
        "id": 198474264,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590170485
    },
    {
        "content": "<p>These safety considerations apply to ALL medical data, they are not specific to documents.</p>",
        "id": 198474407,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590170540
    },
    {
        "content": "<p>you might want to look at the FAQ provided on HHS site. Here is one that seems to be relevant  <a href=\"https://www.hhs.gov/about/agencies/asl/testimony/2018-07/21st-century-cure-implementation-examining-mental-health-initiative.html\">https://www.hhs.gov/about/agencies/asl/testimony/2018-07/21st-century-cure-implementation-examining-mental-health-initiative.html</a></p>",
        "id": 198474634,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590170644
    },
    {
        "content": "<p>IANAL, but the <a href=\"https://www.federalregister.gov/d/2020-07419/p-1793\">EHI definitions in ONC's final rule</a> are aligned with the HIPAA Designated Record Set definitions:</p>\n<blockquote>\n<p>We have defined EHI (§ 171.102) to mean electronic protected health information (ePHI) as the term is defined for HIPAA in 45 CFR 160.103 to the extent that the ePHI would be included in a designated record set as defined in 45 CFR 164.501 (other than psychotherapy notes as defined in 45 CFR 164.501 or information compiled in reasonable anticipation of, or for use in, a civil, criminal, or administrative action or proceeding),</p>\n</blockquote>",
        "id": 198497506,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1590183307
    }
]