[
    {
        "content": "<p>Noticed some possible discrepancy in conformance language:</p>\n<p><a href=\"https://www.hl7.org/fhir/http.html#Status-Codes\" title=\"https://www.hl7.org/fhir/http.html#Status-Codes\">https://www.hl7.org/fhir/http.html#Status-Codes</a>:</p>\n<blockquote>\n<p>The OperationOutcome <strong>may be returned</strong> with any HTTP 4xx or 5xx response, but this is not required - many of these errors may be generated by generic server frameworks underlying a FHIR server.</p>\n</blockquote>\n<p><a href=\"https://www.hl7.org/fhir/http.html#search\" title=\"https://www.hl7.org/fhir/http.html#search\">https://www.hl7.org/fhir/http.html#search</a>:</p>\n<blockquote>\n<p>If the search fails (cannot be executed, not that there are no matches), the return value return value <strong>SHALL</strong> be a status code 4xx or 5xx <strong>with an OperationOutcome</strong>.<br>\nCommon HTTP Status codes returned on FHIR-related errors (in addition to normal HTTP errors related to security, header and content type negotiation issues): </p>\n<ul>\n<li>\n<p>400 Bad Request - search could not be processed or failed basic FHIR validation rules</p>\n</li>\n<li>\n<p>401 Not Authorized - authorization is required for the interaction that was attempted </p>\n</li>\n<li>\n<p>404 Not Found - resource type not supported, or not a FHIR end-point </p>\n</li>\n</ul>\n</blockquote>\n<p>Wondering if the \"SHALL\" in the latter quotation refers to simply 4xx/5xx, or also to the \"with an OperationOutcome\" -- which would be a strange constraint, especially paired with the subsequent line. It would imply that just for Searches, unauthorized searches must return an OO, but unauthorized anything-else does not need to return an OO.</p>\n<p>Could I get clarification on whether the OO SHALL be returned with a 4xx/5xx for Searches?</p>\n<p>Thank you!</p>",
        "id": 196691893,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1588796612
    },
    {
        "content": "<p>p.s.: also, there's a typo in the second quote \"the return value return value\" =)</p>",
        "id": 196692013,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1588796664
    },
    {
        "content": "<p>Please submit a change request for the typo and clarification as to whether or not the OperationOutcome is mandated for all error codes - personally, I don't see that OperationOutcome would be necessary for all possible codes, but it's certainly a SHOULD for a 400 and some of the others.</p>",
        "id": 196699465,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588800171
    },
    {
        "content": "<p>Thanks Lloyd - just so I understand the conformance language in the Search section: the \"SHALL be a status 4xx or 5xx\" is the target of the conformance, while \"with an OperationOutcome\" is optional?</p>",
        "id": 196699694,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1588800281
    },
    {
        "content": "<p>As written, it's causing some issues with interpretation, as it can be interpreted as \"status codes 4xx/5xx must also come with an OO\".</p>",
        "id": 196699909,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1588800370
    },
    {
        "content": "<p>I think it's unclear and needs to be clarified.  I can't swear as to the original intent, but my leaning is that it shouldn't be a SHALL.</p>",
        "id": 196699924,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588800380
    },
    {
        "content": "<p>Others may disagree though.</p>",
        "id": 196699940,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588800387
    },
    {
        "content": "<p>operation outcome is not a shall since 4xx and 5xx can be generated in the stack long before FHIR comes into relevance</p>",
        "id": 196700104,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1588800461
    },
    {
        "content": "<p>K.  That sounds like a clear answer.  <span class=\"user-mention\" data-user-id=\"192143\">@Ken Sinn</span> Please reference this thread when you submit the change request</p>",
        "id": 196700228,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588800515
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  and <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 196700356,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1588800586
    },
    {
        "content": "<p>Created: <a href=\"https://jira.hl7.org/browse/FHIR-27051\" title=\"https://jira.hl7.org/browse/FHIR-27051\">https://jira.hl7.org/browse/FHIR-27051</a></p>",
        "id": 196702969,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1588801897
    },
    {
        "content": "<p>I think the way this was written suggests that there are specific FHIR-related failures when trying to execute a search, where an OperationOutcome is required. Of the 3 examples given, the first seems to fit such a requirement, but I am not sure about the other two...</p>",
        "id": 196860520,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1588917836
    }
]