[
    {
        "content": "<p>Has anybody drafted out profiles for each of the 50 states in the US?  </p>\n<p>Looking for something similar to US Core, but for the states.... i.e. New York Core, Illinois Core, Texas Core, etc.  Doesn't need to be exhaustive.  Just some stub files that we can start adding encoded legislative content into, and looking at the resulting coding patterns.</p>",
        "id": 240658002,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1622234363
    },
    {
        "content": "<p>That's an interesting idea. Can you give examples that works be state specific?</p>",
        "id": 240667873,
        "sender_full_name": "David Pyke",
        "timestamp": 1622241279
    },
    {
        "content": "<p>Advanced directives (ADI) is the main item being discussed; but the general issue of state level jurisdictional differences extends to care around minors and child protective services, anything abortion relate, end-of-life hospice care, etc.</p>",
        "id": 240705109,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1622298850
    },
    {
        "content": "<p>profiles of what for example?</p>",
        "id": 240711055,
        "sender_full_name": "Eric Haas",
        "timestamp": 1622307681
    },
    {
        "content": "<p>Questionnaire, Contract, Consent, CommunicationRequest, etc.  US states have different state level laws concerning social work, abortion access, LGBT partner visitation rights, etc.  Some states require one signature for advanced directives, others require 2 signatures, some require a notary public.  Some states specify valuesets for things like domestic partners, and include or exclude categories that US Core specifies.  </p>\n<p>All of these things can be profiled, and it baffles me that this hasn’t been brought up before.</p>",
        "id": 240729048,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1622333361
    },
    {
        "content": "<p>If you're talking questionnaires, the content isn't profilable - because there's no way to know what questions mean.  CommunicationRequest can be used for pretty much any purpose, so it would be hard to know what the rules are.  Even for Consent and Contract, there are so many types (and no standard terminology to represent them), profiling would be hard, plus the challenges that in both resources the 'guts' might be a referenced PDF that's completely non-computable.  I just don't think we have sufficient interoperability to define general-purpose constraints.  If you had a tight national profile with a specific scope and thus knew exactly what it was representing and how  - then you could potentially create sub-profiles that were state-specific.  (Though even then, you'd need to worry about maintenance as the rules, regulations and even case law continue to evolve.)</p>",
        "id": 240731730,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622338678
    }
]