[
    {
        "content": "<p>I'm working to implement the _at parameter, and I'm trying to understand the intended behavior.  The spec says (<a href=\"http://build.fhir.org/http.html#history\" target=\"_blank\" title=\"http://build.fhir.org/http.html#history\">http://build.fhir.org/http.html#history</a>):</p>\n<p>_at : dateTime  single  Only include resource versions that were current at some point during the time period specified in the date time value (may be more than one)</p>\n<p>Is the intent of _at to enable a \"time machine\" type feature such that a client can get the then-current copy of the resource that would have been available at the supplied date and time?</p>\n<p>Example:  A Patient resource is created at 10 am, then there is an update to it at 11 am, then another update occurs at noon.</p>\n<p>If a client makes this request with _at set to 11:05 am:<br>\n   GET  [base]/Patient/_history?_at=[date]T11:05Z</p>\n<p>How many of the 3 history entries should be returned?  Would it be 2?  The first create at 10 am and also the update at 11 am?</p>",
        "id": 153920053,
        "sender_full_name": "Steve Munini",
        "timestamp": 1510847996
    },
    {
        "content": "<p>The specified dateTime would be treated as a range.  In your example, you'd only get the 11am version.  However, if you'd said <code>GET [base]/Patient/_history?_at=[date]</code> and not specified a time, you'd have gotten all 3</p>",
        "id": 153920112,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510871156
    },
    {
        "content": "<p>Thanks for the response Lloyd.  I think I get it now ..but I still have some questions. The dateTime is to be treated as a range - essentially the more precise the dateTime, the smaller the range?  For example, if _at=2017-11-16, then return all history entries on that day.  If that is true, then shouldn't my example return zero results?  Note - my example request asked for 11:05 and not 11:00 when the update occurred.  Taken to an extreme, if a request occurs with _at=2017-11-16T16:01:28Z, should clients expect to be returned only the history entries created on that second and not any that came before or after that second?</p>\n<p>I'm unsure how widely this is implemented if my understanding is correct.</p>\n<p>Grahame's server is returning all 3 history entries:<br>\n<a href=\"http://test.fhir.org/r3/Patient/262513/_history?_at=2017-11-16T16:01:28Z\" target=\"_blank\" title=\"http://test.fhir.org/r3/Patient/262513/_history?_at=2017-11-16T16:01:28Z\">http://test.fhir.org/r3/Patient/262513/_history?_at=2017-11-16T16:01:28Z</a></p>\n<p>James' is returning a single entry value (correctly), but the total count is incorrect at 2:<br>\n<a href=\"http://fhirtest.uhn.ca/baseDstu3/Patient/340644/_history?_at=2017-11-16T11:29:16.740-05:00\" target=\"_blank\" title=\"http://fhirtest.uhn.ca/baseDstu3/Patient/340644/_history?_at=2017-11-16T11:29:16.740-05:00\">http://fhirtest.uhn.ca/baseDstu3/Patient/340644/_history?_at=2017-11-16T11:29:16.740-05:00</a></p>\n<p>If _at is not really intended to be used with hours, minutes and seconds, it might make sense to change it to a date instead of a dateTime.  I do think, however that the _at parameter would be more useful as a way to ask a FHIR server to \"show me all your history at a point in time\" instead of as a range.  It would be super helpful in replicating FHIR servers - call using _at once, followed by _since periodically.  Also, having a single dateTime value as a range is a bit unusual (I didn't get it initially) Having two dateTimes (a from and a to) would make more sense as a range to me if that is the goal.</p>",
        "id": 153920127,
        "sender_full_name": "Steve Munini",
        "timestamp": 1510885631
    },
    {
        "content": "<p>Except that \"At\" says \"return the record as it would have been\", so even if you have a time down to the millisecond, at that millisecond, a version of the record would have existed</p>",
        "id": 153920134,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510904063
    },
    {
        "content": "<p>Thanks again Lloyd.  I get it now.</p>\n<p>On to some bug reports...<br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - The r3 server is returning 3 entries for _at requests with second precision.  See example above.</p>\n<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> - James, HAPI is correctly returning one entry for _at above, but the count is incorrect at 2.  (above)  Also, if one second is added to the request below (17th second), zero entries are returned (and the count is 1).<br>\n<a href=\"http://fhirtest.uhn.ca/baseDstu3/Patient/340644/_history?_at=2017-11-16T11:29:17.740-05:00\" target=\"_blank\" title=\"http://fhirtest.uhn.ca/baseDstu3/Patient/340644/_history?_at=2017-11-16T11:29:17.740-05:00\">http://fhirtest.uhn.ca/baseDstu3/Patient/340644/_history?_at=2017-11-16T11:29:17.740-05:00</a></p>",
        "id": 153920195,
        "sender_full_name": "Steve Munini",
        "timestamp": 1510921591
    }
]