[
    {
        "content": "<p>If a client app specifies a _count value higher than the server page size (say 75 vs. 50), the spec clearly allows the server to return 50, rather than 75. <em>But the spec also states: The server should repeat the original _count parameter in its returned page links so that subsequent paging requests honor the original _count.</em> </p>\n<p>I believe that the intent here is that the client can use the URL to get the next page without having to append the parameter in code for every subsequent request. In the use case where _count is greater than the server page size, should the server return a count reflecting its page size rather than repeating the original count (i.e., 50 rather than 75)? Either would technically work, but returning 50 seems more useful and aligned with the intent.</p>",
        "id": 209774299,
        "sender_full_name": "Doug Pratt",
        "timestamp": 1599827650
    },
    {
        "content": "<p>Can you submit a change request for us to clarify this?  (I think it would be up to the server whether to set the page size to the next page to 75 or 50)</p>",
        "id": 209780016,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599830743
    },
    {
        "content": "<p>The 'self' link reflects the parts of the search URL as understood /executed by the server. If the client indicated 'max 75 responses', then a server that uses 50 certainly meets that requirement. In that sense _count-75 is certainly true. _count is a max number, not a precise page size.</p>",
        "id": 209780042,
        "sender_full_name": "René Spronk",
        "timestamp": 1599830759
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> One could argue either way. The current wording as cited by Doug gives clear guidance, as such there's no ambiguity.</p>",
        "id": 209780195,
        "sender_full_name": "René Spronk",
        "timestamp": 1599830853
    },
    {
        "content": "<p>Thanks guys, it's great to hear from you! How would you feel about amending the paragraph as follows: <br>\n<em>The server should repeat the original _count parameter in its returned page links so that subsequent paging requests honor the original _count. However, if the server page size is smaller than the _count specified by the client app, the server may substitute its page size for the original value, such that subsequent paging requests do not exceed the server's page size.</em></p>",
        "id": 209822614,
        "sender_full_name": "Doug Pratt",
        "timestamp": 1599851472
    },
    {
        "content": "<p>I like it.  Can you submit a change request to that effect <span class=\"user-mention\" data-user-id=\"228784\">@Doug Pratt</span> ?</p>",
        "id": 209823979,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599852097
    },
    {
        "content": "<p>Yes, I will do that. Thanks!</p>",
        "id": 209839489,
        "sender_full_name": "Doug Pratt",
        "timestamp": 1599861025
    }
]