[
    {
        "content": "<p>When running a search that has _include, is there ever a scenario that users have come across where you would return a single resource twice because it met the base critieria and also the include criteria? For example, if you search for Locations and include partOf, which references a location, would you expect to get the part of locations twice, once because it matched the search and once because it was included, or just a single time? And if its just a single time, how do you decide on if it should be brought in due to the match or due to the include? FYI <span class=\"user-mention\" data-user-id=\"273190\">@Moira Dillon</span></p>",
        "id": 242618785,
        "sender_full_name": "Caitlin Voegele",
        "timestamp": 1623685987
    },
    {
        "content": "<p>It's definitely not allowed to have two copies of the same resource in a bundle. I assume it would have entry.search.mode=match in that case but I'm not aware of spec language saying that explicitly.</p>\n<p>This is something I want to nail down better by adding an extension to <a href=\"http://entry.search\">entry.search</a> that indicates where the include/revinclude connections are (which clause brought it in, and from which resource or resources). My proposed pattern will be that this case would have mode=match but also the extension showing the include.</p>",
        "id": 242620790,
        "sender_full_name": "Paul Church",
        "timestamp": 1623686747
    },
    {
        "content": "<p>We currently say: </p>\n<blockquote>\n<p>There is only one mode. In some corner cases, a resource may be included because it is both a match and an include. In these circumstances, 'match' takes precedence.</p>\n</blockquote>\n<p>From: <a href=\"http://build.fhir.org/bundle-definitions.html#Bundle.entry.search.mode\">http://build.fhir.org/bundle-definitions.html#Bundle.entry.search.mode</a></p>",
        "id": 242635019,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1623692878
    },
    {
        "content": "<p>Note that an _include might show up on multiple pages - so something might be referenced as a match on page 1 and an include on page 2 and 3.</p>",
        "id": 243976809,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624659096
    }
]