[
    {
        "content": "<p>Hi all,</p>\n<p>I'm looking at the syntax for _revinclude parameters on searches, and had a quick question for the group:</p>\n<p>The <a href=\"http://hl7.org/fhir/search.html#revinclude\">include/revinclude sections</a> mentions that there are three potential parts to a _revinclude parameter value:</p>\n<blockquote>\n<p>Parameter values for both _include and _revinclude have three parts, separated by a : character:</p>\n<p>The name of the source resource from which the join comes<br>\nThe name of the search parameter which must be of type reference<br>\n(Optional) A specific of type of target resource (for when the search parameter refers to multiple possible target types)</p>\n</blockquote>\n<p>The first two parts (name of source resource + search parameter) make perfect sense - <code>/MedicationRequest?_revinclude=Provenance:target</code> means I'm looking for Provenance where the target search parameter resolves to MedRequests found. I'm a little unsure about the third part (type of target resource) though - for non <code>:iterate</code> _revinclude searches, should type be <code>MedicationRequest</code> as that's what I want the <a href=\"http://Provenance.target\">Provenance.target</a> search parameter to be resolving to, or <code>Provenance</code> as that's the type of resource that I'm requesting to be included in the search bundle?</p>\n<p>I believe <code>MedicationRequest</code> is the right answer based on the spec, but wanted to confirm with the group since it seems a little redundant on a MedicationRequest search. (I definitely see how it would be useful in an <code>_revinclude:iterate</code> scenario)</p>\n<p>Thanks in advance!</p>",
        "id": 260348805,
        "sender_full_name": "Weiyu Zhang",
        "timestamp": 1636068630
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 260349286,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1636069014
    },
    {
        "content": "<p>In your specific context, without :iterate, and with just one focal resource of the search (MedicationRequest) the use of the third component of _revinclude doesn't make much sense. MedicationRequest would be the only useful value for the third component.</p>",
        "id": 260373944,
        "sender_full_name": "René Spronk",
        "timestamp": 1636098343
    },
    {
        "content": "<p>Got it - thanks for the clarification <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>!</p>",
        "id": 261086701,
        "sender_full_name": "Weiyu Zhang",
        "timestamp": 1636598826
    }
]