[
    {
        "content": "<p>If a system supports _summary but doesn't return exactly the subset defined as _summary items (maybe it returns a couple more elements or maybe it witholds a couple of elements that are supposed to be _summary elements but where it only returns them if _summary=false, would that be a conformant system?</p>",
        "id": 153864178,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1482210009
    },
    {
        "content": "<p>it would be if we were clear that _summary is a \"SHOULD\" and not a \"SHALL\". I would say that a server should be allowed to have local policy that might be different than the core specification. Another way to look at this, from an IHE experience, is that the must have a way to enforce exactly the policy, but in operational environment different configurations are allowed. This is how IHE tests that you can conform to the IHE Profile; while not inhibiting creativity in the wild.</p>",
        "id": 153864288,
        "sender_full_name": "John Moehrke",
        "timestamp": 1482246970
    },
    {
        "content": "<p>If we treat _summary as a \"SHOULD\" it means that systems can't necessarily rely on it.  And that would then create a requirement for profiles to document how _summary will actually behave, which means it may actually need to be declared/adjusted in profiles - which is something we currently prohibit.</p>",
        "id": 153864295,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1482249030
    },
    {
        "content": "<p>I think you (broader you) might be  trying to impose unrealisticly strict requirements on a platform (http REST) that is highly relaxed. Everyone really needs to adopt Postel's law. Which addresses your question by indicating that everyone should behave strictly according to the specification when sending content elsewhere; while also expressing that one must be very robust to the other guy sending you stuff that is not exactly in compliance.  This is not an answer to your original question; nor is it indicating your path is wrong. What it is is a statement of principle: We gain huge advance by standing on the shoulders of giants, it is not good to change the rules they stand upon.</p>",
        "id": 153864311,
        "sender_full_name": "John Moehrke",
        "timestamp": 1482251412
    },
    {
        "content": "<p>_summary is for efficiency. So not conforming doesn't break things, it just slows them down. So it can be a SHOULD</p>",
        "id": 153864348,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1482265297
    },
    {
        "content": "<p>Should systems be able to document what they're actually going to return in a summary?  If so, then _summary needs to be declarable in profiles - and overridable.</p>",
        "id": 153864363,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1482266120
    }
]