[
    {
        "content": "<p>Hi, can I get a clarification on how the new _type parameter on system level searches is supposed to work?  The spec seems to be inconsistent.  The Variant Searches section in the REST API spec gives an example with \"_type=Condition,Observation\" and then says \"In this case, the only parameters that can be used are those defined for both Condition and Observation (using SearchParameter.base - see Cross-resource Search Parameters), or the parameters defined for all resources.\" (<a href=\"http://hl7.org/fhir/STU3/http.html#vsearch\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/http.html#vsearch\">http://hl7.org/fhir/STU3/http.html#vsearch</a>)  So I would expect \"code\" to be a valid search parameter in this query, since it is common to both Condition and Observation.</p>\n<p>However in \"Specifying the type of resource\" in the search spec (<a href=\"http://hl7.org/fhir/STU3/search.html#_type\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/search.html#_type\">http://hl7.org/fhir/STU3/search.html#_type</a>), there is a similar example that contains \"_type=Observation,Condition\", followed by: \"Note that the only search parameters that be can be used in global search like this are the base parameters that apply to all resources.\"  Which seems to be saying that only search parameters common to all resource types can be used.  But then the next sentence seems to roll this back, sort of: \"In other contexts, searches on multiple types may allow resource specific search parameters, but implementation experience will be required to determine the correct behaviour in these cases.\"  (What are these \"other contexts\"?)</p>\n<p>So which is it? Can a system-level search with a _type parameter only contain search params common to all types, or can it also contain params common to the named types?</p>",
        "id": 153902528,
        "sender_full_name": "Jorge de la Garza",
        "timestamp": 1502811782
    },
    {
        "content": "<p>please add a task to fix the language ' the only search parameters that be can be used in global search like this are the base parameters that apply to all resources' - that's from before we had parameters common across multiple types</p>",
        "id": 153902567,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502849938
    },
    {
        "content": "<p>Done: <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13752&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13752&amp;start=0\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13752&amp;start=0</a><br>\nThanks, Grahame.</p>",
        "id": 153902645,
        "sender_full_name": "Jorge de la Garza",
        "timestamp": 1502911221
    }
]