[
    {
        "content": "<p>We have a use case to be able to from an ambulance post a triage/triage outcome so that it is visible at the A&amp;E before the patient comes in. </p>\n<p>It can have several observations in it, like BP, pulse, oxygen saturation etc, potentially also a score (NEWS or similar). This will be summarized with some type of priority category (1-5,  blue, green, yellow, orange, red...).</p>\n<p>What resource is suitable to capture the full context of the triage, including the observations and the outcome priority category? Would it be a Composition? Other suggestions?</p>\n<p>Thx!</p>",
        "id": 180663367,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1573673981
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195005\">@Ann Merete Duedal Jensen</span></p>",
        "id": 180663450,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1573674026
    },
    {
        "content": "<p>I have the same question regarding to send a Priority/Triage from a ambulance system to the A&amp;E. </p>\n<p>Could the resource RiskAssessment (<a href=\"https://www.hl7.org/fhir/riskassessment.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/riskassessment.html\">https://www.hl7.org/fhir/riskassessment.html</a>) be used to capture the several observation and priority?</p>",
        "id": 187631678,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1581075185
    },
    {
        "content": "<blockquote>\n<p>Could the resource RiskAssessment (<a href=\"https://www.hl7.org/fhir/riskassessment.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/riskassessment.html\">https://www.hl7.org/fhir/riskassessment.html</a>) be used to capture the several observation and priority?</p>\n</blockquote>\n<p>My understanding (admittedly from other systems) is that risk assessment is the output of a model that evaluates other data and indicates whether this patient is at elevated risk of a condition (eg, heart attack), rather than being raw observations. And I'm not sure \"priority\" is or should be a concept in FHIR...</p>",
        "id": 187666327,
        "sender_full_name": "Joe Kesselman",
        "timestamp": 1581100265
    },
    {
        "content": "<p>Priority would typically be a characteristic of a ServiceRequest or Encounter</p>",
        "id": 187683488,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581112137
    },
    {
        "content": "<p>An ambulance encounter would make sense.</p>",
        "id": 187689117,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1581117187
    },
    {
        "content": "<p>Will add that to the list of example scenarios PA is planning to document on the use of encounter.</p>",
        "id": 187689134,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1581117216
    },
    {
        "content": "<p>The triage is something done during an encounter, so I dont agree that the triage itself is an encounter. The stay within the ambulance, with a start and end time etc is the encounter during which several observations and assessments can be performed, one of those being one or several triages. </p>\n<p>As there are standardized methods of triage, MTS (<a href=\"https://www.triagenet.net/classroom/\" target=\"_blank\" title=\"https://www.triagenet.net/classroom/\">https://www.triagenet.net/classroom/</a>), RETTS (<a href=\"https://predicare.eu/about-retts/\" target=\"_blank\" title=\"https://predicare.eu/about-retts/\">https://predicare.eu/about-retts/</a>), SATS (<a href=\"https://emssa.org.za/special-interest-groups/the-south-african-triage-scale-sats/\" target=\"_blank\" title=\"https://emssa.org.za/special-interest-groups/the-south-african-triage-scale-sats/\">https://emssa.org.za/special-interest-groups/the-south-african-triage-scale-sats/</a>) etc I feel like a something which you can represent using a template that gets filled in is suitable, so to me it could map well to a Questionnaire and QuestionnaireResponse. You can see it as completing a \"triage form\".</p>",
        "id": 190404345,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1584027542
    },
    {
        "content": "<p>Observation resource with defined components representing the details?</p>",
        "id": 190412136,
        "sender_full_name": "Pétur Valdimarsson",
        "timestamp": 1584030983
    },
    {
        "content": "<p>QuestionnaireResponse for the raw form.  Observation if you want the data to be subsequently comparable/queriable</p>",
        "id": 190435921,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584042417
    },
    {
        "content": "<p>We have done another round of reviews of different resources. </p>\n<p>The issue with the Questionnaire and the QuestionnaireResponse is that a consumer needs to be aware and use the Questionnaire. We looked a bit at RiskAssessment, but we dont feel a triage is a risk assessment. And a risk assessment can often be completed using some type of form (ie Questionnaire), so what do you then use, RiskAssessment or Questionnaire/QuestionnaireResponse (that question we can raise for several use cases)?</p>\n<p>We then looked at ClinicalImpression, it seems to fit the use case. There are several key factors that we can use:</p>\n<p><strong>Clinical Assessment metadata</strong></p>\n<ul>\n<li>code 0..1    CodeableConcept Kind of assessment performed   ---&gt; Triage (procedure) SCTID: 225390008</li>\n<li>protocol  0..*    uri Clinical Protocol followed  ---&gt; Here we can bind to triage protocol followed which is good! Eg Manchester Triage System (assessment scale) SCTID: 713009001</li>\n</ul>\n<p><strong>Triage assessment common data</strong></p>\n<ul>\n<li>problem   0..*    Reference(Condition)    Relevant impressions of patient state  --&gt; Here we can put the actual problem, might have been easier with a codeableConcept. </li>\n</ul>\n<p><strong>Repeating Investigation level</strong></p>\n<ul>\n<li>investigation.code    1..1    CodeableConcept A name/code for the set ---&gt; Blood pressure (observable entity) SCTID: 75367002</li>\n<li>item  0..*    Reference(Observation)  Record of a specific investigation---&gt;Here we can include the actual Observation resource<br>\nWe can repeat this for all the necessary observations for one particular type of triage method.<br>\nWe can also slice the investigations needed for the triage method using the investigation.code as discriminator. </li>\n</ul>\n<p><strong>Triage outcome/patient prioritization/classification</strong><br>\nOnly question is where we would put the actual triage priority \"Urgent priority\", \"Color Yellow\" etc, but I think we could use the following:</p>\n<ul>\n<li>prognosisCodeableConcept  0..*    CodeableConcept Estimate of likely outcome Clinical Impression Prognosis (Example)<br>\nOr maybe add some type of extension. </li>\n</ul>\n<p><span class=\"user-mention\" data-user-id=\"193397\">@Pétur Valdimarsson</span> , as I see it we cant really use Observation as it doesnt support the overall triage assessment context. The triage assessment has several individual observations, and a prioritization/categorization of urgency. We need a resource that groups all that together. But we have gone through several resources for this use case, and changed our mind several times, so who knows where we end up :D</p>\n<p>Maybe we should only use Questionnaire if it is important to have the form structure and logic, e.g. the enableWhen feature and similar.</p>",
        "id": 190737136,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1584372178
    },
    {
        "content": "<p>Questionnaire/QuestionnaireResponse is useful as an initial data capture tool (for anything).  It gives tight control over user-interface and allows simple systems to capture data of any type.  It's also easy to change the data collected.  However, QuestionnaireResponse is not terribly useful for query/comparison/analysis.  So the usual workflow is capture using QuestionnaireResponse, then extract into other resources for subsequent use.</p>",
        "id": 190739812,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584373203
    }
]