[
    {
        "content": "<p>For encouraging international adoption of CQL, would the FHIR data model be a preferred one in place of the currently more US Realm specific QUICK data model?</p>",
        "id": 180306008,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1573293823
    },
    {
        "content": "<p>I think that it's always FHIR. I've never personally thought QUICK was very useful</p>",
        "id": 180309072,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573299355
    },
    {
        "content": "<p>That's comforting.  More complex but expressive/versatile.  Thanks, Grahame :)</p>",
        "id": 180315045,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1573309216
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 180321116,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573318188
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191703\">@Claude Nanjo</span> and colleagues at University of Utah are using QUICK as the data model in CQL in order to express CDS logic independent of FHIR version. They are also developing a runtime to execute CQL by mapping the QUICK data model to their current FHIR version data, which is still DSTU2 in Epic production systems.</p>",
        "id": 180444082,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1573494416
    },
    {
        "content": "<p>It really depends what you intend to do. If you are working in a FHIR environment with FHIR objects behind your service interface, then working with CQL and FHIR makes sense. In our case it doesn't because we do not wish to rewrite vast amounts of code and knowledge artifacts whenever FHIR changes. Instead, we write against a FHIR-version independent model and translate incoming messages to QUICK and outgoing messages from QUICK. When FHIR changes, we simply adjust our mappings to FHIR. So, I have to disagree respectfully with Grahame.</p>",
        "id": 185062426,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1578436570
    },
    {
        "content": "<p>Any version of FHIR can also act as your version-independent model (as we try hard to have transforms between the different versions.  If no transforms happen to be possible, transformations aren't likely to be any simpler converting to or from QUICK.  Obviously if you have investment in QUICK, you can keep using it.  If not, it's not obvious how it provides benefit.</p>",
        "id": 185127982,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578499771
    },
    {
        "content": "<p>Where can I find the latest version-independent FHIR model? Thanks, LIoyd.</p>",
        "id": 211364860,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1601133521
    },
    {
        "content": "<p>Can you explain what you mean by \"version-independent\"?</p>",
        "id": 211365146,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601133891
    }
]