[
    {
        "content": "<p>When making assertions over the absence of Family History<br>\ne.g. 249724011 | No FH: Cardiovascular disease |   (SNOMED)</p>\n<p>Is the correct approach just to use the code as per FamilyHistort.condition.code?<br>\nAs such there is no information model way in differentiating between \"Patient has FH of ...\" vs \"Patient has no FH of ...\"</p>",
        "id": 183152959,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1576068553
    },
    {
        "content": "<p>FamilyMemberHistory captures the conditions of a single family member.  To capture a generic \"family history of\" or \"no family history of\", use Observation.</p>",
        "id": 183154996,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576070107
    },
    {
        "content": "<p>Hmm OK - so the \"API user\" just needs to know to look in two places then?</p>",
        "id": 183158484,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1576072535
    },
    {
        "content": "<p>As a further example - what about \"No Family History of Cardiovascular disease for mother\"?</p>",
        "id": 183158581,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1576072594
    },
    {
        "content": "<p>That use-case hasn't been raised, to my knowledge.  Suggest submitting a change request</p>",
        "id": 183159958,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576073520
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span>  did you end up submitting a ticket? \"Suspicion of\" would be another usecase for expanding this resource. Maybe using ConditionVerificationStatus values could be suitable for capturing the negative/preliminary results?</p>",
        "id": 190284012,
        "sender_full_name": "Halina Labikova",
        "timestamp": 1583935346
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194075\">@Halina Labikova</span>  I don't think I did in the end as I did not see it as a means to address the issues I had.</p>\n<p>In an existing clinical system we have the following:</p>\n<ul>\n<li>Patient X reports family member Y had condition Z</li>\n<li>Patient X reports family member Y did not have condition Z</li>\n<li>Patient X reports a family history of condition Z</li>\n<li>Patient X reports no family history of condition Z</li>\n</ul>\n<p>For me the issues are:</p>\n<ul>\n<li>Inability to assert the absence of a condition </li>\n<li>\"Family History\" and \"Family Member History\" residing in two different resources</li>\n</ul>",
        "id": 190298429,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1583942359
    },
    {
        "content": "<p>FamilyHistory and FamilyMemberHistory are going to definitely end up in two different resources.  General assertions of \"family history of X\" or \"no family history of X\" are going to be in Observation, while tracking exactly what Uncle Joe vs. Aunt Sue had or did not have is what FamilyMemberHistory is for.  There should be a change request submitted to allow FamilyMemberHistory.condition to definitively capture conditions that are \"known absent\".  (You could do it now with a custom modifier extension, but that seems like something that should be in core, particularly given that it's a modifier.)</p>",
        "id": 190301778,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583944061
    }
]