[
    {
        "content": "<p>Have anybody looked at advanced ACL for FHIR servers, is it possible that there will be some standard way to express access control rules. I've gone trough security section and IHE access control whitepaper but it's generic. SMART on FHIR does not really go into complex scenarios.</p>\n<p>I'm interested in situations like:</p>\n<ul>\n<li>Controlling access of guardians acting on behalf of incapable persons</li>\n<li>Controlling access based on organization or location. This may be required for some distributed scenarios.</li>\n</ul>",
        "id": 153823714,
        "sender_full_name": "Krzysztof Suchomski",
        "timestamp": 1461918001
    },
    {
        "content": "<p>There's this article that I know of: <a href=\"https://medium.com/@niquola/access-control-model-for-fhir-generic-server-dd66deb7cae6#.nrwwpky8l\" target=\"_blank\" title=\"https://medium.com/@niquola/access-control-model-for-fhir-generic-server-dd66deb7cae6#.nrwwpky8l\">https://medium.com/@niquola/access-control-model-for-fhir-generic-server-dd66deb7cae6#.nrwwpky8l</a></p>\n<p>Might or might not be useful</p>",
        "id": 153823719,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1461918307
    },
    {
        "content": "<p>so far, no one has presented any argument that the details of access control (ABAC or RBAC) is something that should be shared and inteoperable. </p>",
        "id": 153823728,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461918669
    },
    {
        "content": "<p>of course, everyone needs to implement this in their server, but if we tried to make it interoperable, we'd also restrict people's choices greatly, and that's never seemed like a value proposition </p>",
        "id": 153823729,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461918704
    },
    {
        "content": "<p>note that SMART on FHIR is not doing access control rules - it's doing something slightly different, though it looks similar</p>",
        "id": 153823730,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461918732
    },
    {
        "content": "<p>Restricting choices around access control would be definitely not a good path to choose.  The article written by @<strong>nicola</strong> is interesting in this context because policy-based access control may give enough flexibility when it comes to expressing the access control rules and allowing interoperability in this case. It would be possible to extend the rule engine over time.</p>\n<p>If there are no guidelines or best practices around this topic implementers may use extensions or abuse certain fields in order to restrict access in certain scenarios and eventually create issues around interoperability or potential issues around proper data usage and sharing. </p>\n<p>The rule engine may be quite sophisticated and the rules in certain scenarios could be shared. Some standard and guidelines could help with implementation of the solutions using FHIR as a core part of the system.</p>",
        "id": 153823737,
        "sender_full_name": "Krzysztof Suchomski",
        "timestamp": 1461920884
    },
    {
        "content": "<p>have you read the security page and looked at security labels? that part we are standardizing</p>",
        "id": 153823738,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461921495
    },
    {
        "content": "<p>we could consider a white paper for best practices to post on <a href=\"http://FHIR.org\" target=\"_blank\" title=\"http://FHIR.org\">FHIR.org</a></p>",
        "id": 153823739,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461921515
    },
    {
        "content": "<p>Yes, we are using security labels at the moment for certain scenarios like break the glass but the rule engine would need to consider much more sophisticated scenarios.  </p>",
        "id": 153823760,
        "sender_full_name": "Krzysztof Suchomski",
        "timestamp": 1461924498
    },
    {
        "content": "<p>such as? anything that needs explicit marking in the resources? </p>",
        "id": 153823761,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461924542
    },
    {
        "content": "<p>Let's say that we have a distributed environment. Single Fhir serving multiple organizations. You have MDs which are part of a single organization, you have MDs who are part of multiple organizations. They should see data only from specific organization. You have patients who should have access only to their data across multiple organizations and you have guardians who can access the data of patient they are responsible for. In theory this can be achieved without any security labels because all of the resources are linked together. It's about restricting searches and read/write access based on user defined rules and references between resources. </p>\n<p>It gets more complicated with the patient data I think because of different regulations. I may be totally wrong here but what data is owned and visible to the patient may be totally different based on the location. The same applies to a search that different users can perform. Patient would be restricted to particular search queries to ensure that no data is being leaked. Even from the performance perspective it's much better to prevent access to a particular resources before even reading the meta data on the resource and fail as fast as possible. </p>",
        "id": 153823766,
        "sender_full_name": "Krzysztof Suchomski",
        "timestamp": 1461925845
    },
    {
        "content": "<p>so most of these are 'user' level restrictions. We've said that:<br>\n(a) we won't have a user resource<br>\n(b) you'll have some other layer where by you administer users, user rights, and mappings between the user and the Patient/Practitioner resources</p>",
        "id": 153823767,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461926186
    },
    {
        "content": "<p>I use SCIM for the other layer (<a href=\"http://www.simplecloud.info/\" target=\"_blank\" title=\"http://www.simplecloud.info/\">http://www.simplecloud.info/</a>)</p>",
        "id": 153823768,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461926222
    },
    {
        "content": "<p>the interesting question, which hasn't really been discussed since early on, is to what degree you derive rules from the FHIR content that is linked from the user administration layer, and whether this reflects into the resources or expected patterns of use. </p>",
        "id": 153823769,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461926285
    },
    {
        "content": "<p>In every project I've been involved in, this has all ended up being handled implicitly (from the perspective of the FHIR API) and surfaces during the OAuth process (e.g. there's a list of patients you have access to by way of being a guardian, and you can pick one), and then the intersection of the user's permissions and the authorizations that the user grants to the client are applied in the background</p>",
        "id": 153823770,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461926387
    },
    {
        "content": "<p>Lack of user resource and separating administration of it from FHIR is probably the best possible solution. In most of the scenarios user will be already existing in some place or authorization server like oAuth can handle that in a much better way. This would end up in duplication in most common scenarios as you would have auth server user, user in FHIR and a link to patient or practitioner.</p>\n<p>On the other hand if we have a way to express explicitly expected patterns of use in standard way it would allow to restrict access properly, share the rules in distributed environment to make sure that the patient record is protected properly and that it is easy to understand what can be done with it. </p>",
        "id": 153823778,
        "sender_full_name": "Krzysztof Suchomski",
        "timestamp": 1461928108
    },
    {
        "content": "<p>is there a 'standard' way in that space? I'm skeptical. If, on the other hand, you wanted to write a white paper describing what you've done, like niquola, I'd be happy to link to it from <a href=\"http://fhir.org\" target=\"_blank\" title=\"http://fhir.org\">fhir.org</a> in the whitepapers section I'm about to add</p>",
        "id": 153823780,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461931362
    },
    {
        "content": "<p>Please join the Security WG to discuss the various Access Control (and Audit Control) models, and CBCC wg for discussions on Patient Privacy Consent capture and encoding. We are trying to standardize the encoding of a privacy consent directive, need lots more active engagement from the implementer community. In Security we standardize just enough to enable reasonable policies without forcing any specific architecture, rules engine, or enforcement model.</p>",
        "id": 153826304,
        "sender_full_name": "John Moehrke",
        "timestamp": 1462888841
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191879\">@Krzysztof Kowalski</span> There has been some efforts for using external access control solutions in FHIR, including XACML and UMA. We, at the VHA's EHTAC lab, have demonstrated these in various past projects and also people at OpenID HEART WG are working on it. Please feel free to join the Security WG today or contact Duane or myself to have a chat if you're interested in any of this.</p>",
        "id": 153826319,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1462892471
    },
    {
        "content": "<p>Have you seen this: <a href=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Labeling.20Service\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Labeling.20Service\">https://chat.fhir.org/#narrow/stream/implementers/topic/Labeling.20Service</a> ?</p>",
        "id": 153828578,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1463651147
    }
]