[
    {
        "content": "<p>Hi,</p>\n<p>Our product (HealthDecision) can function with de-identified information, but the EHR-specific custom-integration needed for this approach can be quite burdensome for the institutional IT teams.  So, we have worked on our FHIR-based implementation only to learn that institutions now put up a lot of resistance because of the PHI access; even with proper HIPAA/processes in place.  Our team feels that addressing this can speed up our sales cycles significantly, but we also don't want to eliminate the ease that EHR-supported FHIR-based implementations bring.</p>\n<p>I have seen some conversations around de-identified patient information on here, but I couldn't conclude the current state.  Has anyone else here run into a similar situation?  If so, how did you address it?  Is there any standards-based/recommended approach to dealing with our situation where we would like to access FHIR-resources with only the de-identified data items?</p>\n<p>We have been envisioning a possible open-source application that can be hosted by the institutions within their networks which does this, but we are hoping not to reinvent the wheel if one already exists.  We see that products like Mulesoft support FHIR, so we are also wondering if maybe a middleware tool like that might be a good route.</p>\n<p>Thank you in advance for any insights!</p>",
        "id": 153930252,
        "sender_full_name": "Farhan Ahmad",
        "timestamp": 1516683341
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> can best explain the current state, but the gist is that \"standardized\" de-identification isn't possible because de-identification is too much tied into the nuances of the specific types of data, how it's captured, how much of it is exposed and how it's used.  As well, de-identification is a question of risk reduction, not risk elimination and it's difficult to standardize the tolerance of risk too.</p>",
        "id": 153930254,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516683944
    },
    {
        "content": "<p>As far as general approaches to de-identification go, there is the IHE cookbook. How and whether it may have been applied to FHIR, I don't know. <a href=\"http://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Handbook_De-Identification_Rev1.1_2014-06-06.pdf\" target=\"_blank\" title=\"http://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Handbook_De-Identification_Rev1.1_2014-06-06.pdf\">http://www.ihe.net/uploadedFiles/Documents/ITI/IHE_ITI_Handbook_De-Identification_Rev1.1_2014-06-06.pdf</a></p>",
        "id": 153930258,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1516685096
    },
    {
        "content": "<p>there's no canned answer - no one has particularly proposed an area where it would be applicable. I have added a deidentity=true parameter to the bulk data access API on <a href=\"http://test.fhir.org\" target=\"_blank\" title=\"http://test.fhir.org\">test.fhir.org</a>, but there are many many issues with it, some of which are FHIR bulk data API specific, and others that are explored in the IHE handbook.</p>",
        "id": 153930304,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516722591
    },
    {
        "content": "<p>at the policy level, have you read TEFCA?</p>",
        "id": 153930305,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516722601
    },
    {
        "content": "<p>Is there a link or non-abbreviated name for \"TEFCA\"? :)</p>",
        "id": 153930317,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516723208
    },
    {
        "content": "<p><a href=\"https://www.healthit.gov/sites/default/files/draft-trusted-exchange-framework.pdf\" target=\"_blank\" title=\"https://www.healthit.gov/sites/default/files/draft-trusted-exchange-framework.pdf\">https://www.healthit.gov/sites/default/files/draft-trusted-exchange-framework.pdf</a> - US policy thing about sharing health care information</p>",
        "id": 153930318,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516723371
    },
    {
        "content": "<p>The best approach is to get authorized access to full fidelity, thus no de-identification. But if that can't be achieved, the the 'process' of determining a de-identification scheme is the next step. De-Identification is a process used to lower the risk to privacy/security/identity. This, as Vassil points to the IHE handbook, is a multi-step process to determine what elements MUST stay, and what MUST be eliminated. Mostly you end up with a bunch of grey, that is elements that need to be kept but where some manipulation can happen.   There is a section in the FHIR Spec that covers this <a href=\"http://build.fhir.org/secpriv-module.html#deId\" target=\"_blank\" title=\"http://build.fhir.org/secpriv-module.html#deId\">http://build.fhir.org/secpriv-module.html#deId</a></p>",
        "id": 153930370,
        "sender_full_name": "John Moehrke",
        "timestamp": 1516732226
    },
    {
        "content": "<p>I have mused on my blog about a de-identification service <a href=\"https://healthcaresecprivacy.blogspot.com/2017/09/fhir-and-bulk-de-identification.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2017/09/fhir-and-bulk-de-identification.html\">https://healthcaresecprivacy.blogspot.com/2017/09/fhir-and-bulk-de-identification.html</a></p>",
        "id": 153930372,
        "sender_full_name": "John Moehrke",
        "timestamp": 1516732290
    },
    {
        "content": "<p>Thank you very much for all the insights!</p>\n<p>I had not heard of TEFCA and did a quick read of the linked doc about it.  It sounds interesting and I will read through it more to see what it specifically prescribes.  Maybe that will give us and the CIOs enough to continue with the standard SMART/FHIR route.</p>",
        "id": 153930641,
        "sender_full_name": "Farhan Ahmad",
        "timestamp": 1516848617
    }
]