[
    {
        "content": "<p>We have a SPA application (unsecured, runs on the browser), we are adding Authentication using OpenId Connect. We are trying to find a solution for the authorization and access problem:</p>\n<p>We have a couple of views where a practitioner can view a list of patients, now, depending on the practitioner he/she should only have access to a subset of the patients stored in the fhir server.</p>\n<p>We were considering implementing it as implicit filters on the server side, e.g: if the user gets the <code>/Patient</code> endpoint, the server would filter the resulting bundle to only list the allowed patients. This would cause the server to behave differently for different users, that is: same query would return different results depending on the user.</p>\n<p>We are wondering whether this is a good idea.</p>\n<p>Or should we just return <code>unauthorized</code> if the user (or the app) is asking for more data than it should and force it to always do the filtering and joining on the app side.</p>\n<p>We think the first solution (implicit filters on the server side) makes life easier for the app but we are not sure if it's going to bring issues along the way.</p>\n<p>What are the best practices for this kind of problem?</p>",
        "id": 154011938,
        "sender_full_name": "Yosbel Esper칩n Gonz치lez",
        "timestamp": 1540402119
    },
    {
        "content": "<p>yes what you are thinking of doing is typical. This is mentioned on the security pages, and is part of the SMART-on-FHIR specification.  Typically this is implemented, as you have indicated, as business rules on the API implementation of the server, and is based on the OAuth token and scopes.</p>",
        "id": 154011953,
        "sender_full_name": "John Moehrke",
        "timestamp": 1540403540
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 154011960,
        "sender_full_name": "Yosbel Esper칩n Gonz치lez",
        "timestamp": 1540406044
    }
]