[
    {
        "content": "<p>hello all, here my doubt is, if a patient has multiple Encounters and multiple accounts. so how to link them?<br>\nfor example a patient has  3 accounts and 4 Encounters then how do we know which account should i link to Encounter 1 and etc. any suggesions please? <br>\nThank you.</p>",
        "id": 153890371,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1495108159
    },
    {
        "content": "<p>That's an existing discussion within the Patient Administration work group.  There's debate about whether to add a similar structure as Patient.link or to use the Linkage resource</p>",
        "id": 153890385,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495119614
    },
    {
        "content": "<p>and one more doubt if a patient has 3 accounts how to differentiate them? and how to search for perticular account details?</p>",
        "id": 153890500,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1495178511
    },
    {
        "content": "<p>Differentiation could be by status, type or owner.  I don't understand your second question.  Can you explain further?</p>",
        "id": 153890524,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495202748
    },
    {
        "content": "<p>If you refer to the adminstrative module page showing the linkages between these resources <a href=\"http://hl7.org/fhir/administration-module.html#clinical-reg\" target=\"_blank\" title=\"http://hl7.org/fhir/administration-module.html#clinical-reg\">http://hl7.org/fhir/administration-module.html#clinical-reg</a><br>\nyou can see that the encounter can link to account(s), and that a patient can have multiple accounts.<br>\nIt is up to your business rules which accounts should be used, and who is going to cover the charges.<br>\nFor example some charges may go to a government program, others to an insurer, and others to the patient themselves.</p>",
        "id": 153892292,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1496666997
    }
]