[
    {
        "content": "<p>New user, so I hope this is in the right spot.</p>\n<p>We have Patient FHIR records that have several Identifiers. We generate the FHIR from a database of data.  There is a field in the database that indicates whether the identifier is active. But I not sure how to capture that info in FHIR.  We have considered using the period but we don't know anything about the period when it was active, we only know that it is now currently inactive.  Is there a way to say that the identifier is not active without saying some about the time when it was active?</p>",
        "id": 153838019,
        "sender_full_name": "Devin Fisher",
        "timestamp": 1468438424
    },
    {
        "content": "<p>There's no ability to say that right now.  You could submit a change request asking for a standard extension for this purpose.  (You could propose it as a core element, but given there's no equivalent in HL7 v2, v3 or CDA, you'd have a tough job selling that it's supported by 80% of systems that use identifiers.)  And of course, you're always free to define your own extension.  Most of the time when you care whether something is active or not, it's not the identifier you care about, but more the role the identifier is attached to.  So you might consider whether that's your use-case too.</p>",
        "id": 153838034,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1468440999
    },
    {
        "content": "<p>If its not to be used, then you could omit it from the content.</p>",
        "id": 153838053,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1468447005
    },
    {
        "content": "<p>Another example where we are doing the local (jurisdictional) extensions is this work in progress:<br>\n<a href=\"http://confluence.hl7australia.com/display/PA/IHI%3A+Individual+Health+Identifier\" target=\"_blank\" title=\"http://confluence.hl7australia.com/display/PA/IHI%3A+Individual+Health+Identifier\">http://confluence.hl7australia.com/display/PA/IHI%3A+Individual+Health+Identifier</a></p>",
        "id": 153838054,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1468447037
    }
]