[
    {
        "content": "<p>the Active boolean on Patient is given a usage of removing a patient that is added in error.  How is the different from the intention of a Delete?  Once deleted the Patient still exists for deep searches if needed (i.e. really a soft delete), so why add Active to Patient but not all resources?</p>",
        "id": 153851427,
        "sender_full_name": "Bob Barnard",
        "timestamp": 1475238807
    },
    {
        "content": "<p>Speculating this has to do with patient matching and record merging work flow.... Inactive patients might have linked resources that can be merged with a \"gold standard\" record... once everything is merged, all the inactive patient records can be deleted. Just a guess.</p>",
        "id": 153851429,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1475242201
    },
    {
        "content": "<p>both of those models are legitimate. The core standard supports many models, profiles mght constrain to a specific model, implementations really need to choose one model. So this the common situation that a standard needs to support a set of reasonable policies, where profiles constrain that  to a specific set of use-case needs.</p>",
        "id": 153851441,
        "sender_full_name": "John Moehrke",
        "timestamp": 1475246692
    },
    {
        "content": "<p>Sure, but why Patient?  Organization also has active, but many resources don't.  There must be some logic around the intended use of that field that's different than DELETE which is supported by all.</p>",
        "id": 153851445,
        "sender_full_name": "Bob Barnard",
        "timestamp": 1475248774
    },
    {
        "content": "<p>different organizations have different ways of managing record problems. HL7 cannot enforce a common model in this regard. (We've tried before) </p>",
        "id": 153851455,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475259895
    },
    {
        "content": "<p>some institutions delete records and merge everything else, while other institutions mark the record as no longer in use, but keep it around for reference</p>",
        "id": 153851456,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475259930
    },
    {
        "content": "<p>Ok, thanks all.  Sounds like there is no reason why Active is on some resources and not on others.  I'll take that message back to the group as well as the advice that we are free to use Active independent of DELETE depending on our own intents and use cases.</p>",
        "id": 153851459,
        "sender_full_name": "Bob Barnard",
        "timestamp": 1475260029
    },
    {
        "content": "<p>The rules is that every resource has to clearly document how the situation is handled when a record is created in error. </p>",
        "id": 153851460,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475260398
    },
    {
        "content": "<p>that's not done by all resources yet. but we're getting there. The committees that manage the resource content choose how this is handled based on the overall use cases tehy are aware of</p>",
        "id": 153851461,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475260460
    },
    {
        "content": "<p>Al records in the patient compartment should have a way of marking the resource is 'in-error' without simply deleting them, though this is still work in progress getting agreement to this across the board</p>",
        "id": 153851462,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475260520
    },
    {
        "content": "<p>Thanks, understood.</p>",
        "id": 153851463,
        "sender_full_name": "Bob Barnard",
        "timestamp": 1475260863
    }
]