[
    {
        "content": "<p>I notice that HealthcareService, Organization and HealthcareService have boolean \"Active\" fields.<br>\nLocation however, has a \"status\" field coded with \"active | suspended | inactive\"</p>\n<p>I see all three of these resources as conceptually similar from a status/active perspective. What is the rationale for the difference?</p>",
        "id": 153968595,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1528773144
    },
    {
        "content": "<p>Did you mean to list Patient in your initial list of artifacts?</p>\n<p>The notion of \"suspended\" doesn't really apply to Patient or Organization.  There's never a situation where they're temporarily unavailable.  That does happen with locations (undergoing renovations, temporarily closed due to licensing issues, etc.).  I would think HealthcareService would be more like Location in that sense.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 153968658,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528805574
    },
    {
        "content": "<p>Sorry,  I just meant HealthcareService + organization have \"active\".  (while location has status)</p>\n<p>It is true, an organization is extremely unlikely to be suspended. I do have experience though with \"locations\" going inactive. For example, a gentle exercise program has 40 sites, and it shots half of them down during the winter.</p>",
        "id": 153968743,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1528824343
    },
    {
        "content": "<p>Do I need to say anything here?<br>\nLooks like you've already answered the question, locations become inactive or are suspended, where org/healthcare service don't typically.</p>",
        "id": 153971418,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1529911608
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> I would have thought HealthCareService could be suspended.  E.g. \"MRI machine is down for two months, so that service gets 'suspended'\"</p>",
        "id": 153971436,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529918030
    },
    {
        "content": "<p>That is what the period would be used for, if a service is planned to be inactivated, this is usually planned, and will have set dates. (Location also has this too, but has the status as some uses don't have the dates in older systems)</p>",
        "id": 153971441,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1529918437
    },
    {
        "content": "<p>And we're confident that problem doesn't exist for HealthCareService?</p>",
        "id": 153971446,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529918957
    },
    {
        "content": "<p>Haven't had it brought up yet...</p>",
        "id": 153971448,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1529920378
    },
    {
        "content": "<p>I agree on \"organization\" that it doesn't get suspended very often, and conceptually has some fundamental differences from HealthcareService and Location.</p>\n<p>However, I think that the concept of a \"location\" vs a \"HealthcareService\" can be used quite interchangeably. For example, you can architect a service directory such that <br>\n1. each address actually has its own HealthcareService (and treat location cardinality as 1..1), <br>\n2. OR you can do one HealthcareService with multiple locations.<br>\n3. OR you can allow a combination of both.</p>\n<p>There's many reasons for going one way or the other a serviceDirectory architecture perspective, which are often legitimate whichever way you go ... but since either approach can be valid, might it be wise to treat the ability to \"suspend\" it similarly? CURRENTLY, my architecture is #1 and so I don't have an option to suspend my services built into FHIR (although migrating to an architecture that allows multiple locations).</p>",
        "id": 153971994,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1530062623
    },
    {
        "content": "<p>The joys of the complexity of representing the real world.<br>\nAll the things that you've described are valid, and different directories will have different mixes of the situation where it is good and not so elegant.</p>",
        "id": 153972462,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1530221829
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193959\">@Tim Berezny</span> Do you want to submit a change request?</p>",
        "id": 153972493,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530252122
    },
    {
        "content": "<p>I may submit a change request, i'm currently pondering if even in my case #1 (each address actually has its own HealthcareService (and treat location cardinality as 1..1), if I could essentially use the \"suspended\" in the location resource as the mechanism to suspend the \"service\". I just might make sense... I'll sleep on it.</p>",
        "id": 153974548,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1531279126
    },
    {
        "content": "<p>In my HealthcareService directory, there is definitely a concept of \"suspended\" (i.e., .active=0) that is different from \"deleted\". Suspended is typically used when a program goes say, on summer break.  The service eventually gets deleted when it's terminated forever. </p>\n<p>The reason i can't just \"delete\" the service is when other source sync with my directory, they would search for all services within a lastUpdate range. If the resource is deleted, it will simply not return and inform the other player that the service is gone, and to clear it from their list.</p>",
        "id": 154452962,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1546654350
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193959\">@Tim Berezny</span> are you coming to San Antonio?</p>",
        "id": 154620173,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1546916960
    },
    {
        "content": "<p>drats no, i haven't been paying close enough attention to the timetables for these things ... I really should have scheduled myself in for this one.</p>",
        "id": 154620370,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1546917257
    },
    {
        "content": "<p>You can find the schedule on the HL7 website through to the end of 2020 :)</p>",
        "id": 154621862,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546919959
    },
    {
        "content": "<p>For my local implementation of HealtcareService, I'm going to add an extension:</p>\n<p>status = active | suspended | inactive</p>\n<p>This is the same status set that is available for the Location resource, whereas HealthcareService.active is only a boolean. I need the full set of active | suspended | inactive states. </p>\n<p>At this point, would it be helpful for me to submit this as an update to HealthcareService resource to add a status field? Or should an extension be fine in the long run.</p>",
        "id": 277056119,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1648583262
    },
    {
        "content": "<p>Assuming that you didn't also consider the not available property too?<br>\nstatus isn't giving a lot more detail there... The suspension reason could be in the notAvailable property along with for how long?</p>",
        "id": 277831078,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1649138280
    },
    {
        "content": "<p>No I did not consider notAvailable, that's an interesting thought. </p>\n<p>If i'm reading this right, to indicate that a HealthcareService is \"suspended\" I could set HealthcareService.notAvailable.start as a date, and leave the end date blank, to indicate that it is indefinitely suspended. Does that sound right? (and, probably leave active as true, until it is permanently deleted.)</p>",
        "id": 277867548,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1649160758
    },
    {
        "content": "<p>That's a thought. Id be setting active to false if wanted it not usually picked up. It sounds like what you're intending on doing.</p>",
        "id": 277868007,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1649161000
    }
]