[
    {
        "content": "<p>The C-CDA R2.1 Companion Guide states: \"Most clinical statements designed for C-CDA have a completed status, but a select few include a state model expressed using the Act.statusCode.\"  The Companion Guide also acknowledges: \"Determination of the Act.statusCode depends on the interplay between an act’s various components including effectiveTime and other clinical status observations that may be pertinent for determining the status of the act within the available Act.statusCode state model.\" To me this indicates that the actStatus is generally something that can be determined based on the data present. <br>\nSo my question is (from a certification standpoint): If the actStatus always = 'completed' for a particular entry, does my software need to support the ability for the user to select any of the valid values in a specific actStatus value set.\"  For instance, the value set for ProblemAct statusCode = completed | aborted | active | suspended.  If we can determine that the problem is either 'active' or 'completed', do I need to give the user the ability to indicate 'aborted' or/and 'suspended' in addition?  I find it strange that the actClass is required but the clinical problem status is optional.  Any guidance is greatly appreciated.</p>",
        "id": 199162972,
        "sender_full_name": "SueAnn Svaby",
        "timestamp": 1590763311
    },
    {
        "content": "<p>Moving the response to the C-CDA Stream: <a class=\"stream\" data-stream-id=\"179311\" href=\"/#narrow/stream/179311-C-CDA\">#C-CDA</a><br>\n<a href=\"#narrow/stream/179311-C-CDA/topic/actStatus.20question/near/199163945\">https://chat.fhir.org/#narrow/stream/179311-C-CDA/topic/actStatus.20question/near/199163945</a></p>",
        "id": 199163694,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1590763613
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191942\">@Matt Rahn</span> <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> </p>\n<p>If the C-CDA R2.1 spec says that an actStatus is always either “active” or “completed”, is there still a need to allow the user to select any value from the value set?</p>\n<p>For instance, the value set for ProblemAct statusCode = completed | aborted | active | suspended. If we can determine that the problem is either 'active' or 'completed' based on the effectiveTime(s), must our software still support the ability to manually indicate 'aborted' or/and 'suspended'? </p>\n<p>The Companion Guide acknowledges: \"Determination of the Act.statusCode depends on the interplay between an act’s various components including effectiveTime and other clinical status observations that may be pertinent for determining the status of the act within the available Act.statusCode state model.\" </p>\n<p>I am interpreting this to mean that the actStatus is generally something that is determined based on the data present (i.e. effectiveTime) as opposed to user action/selection.   Is this correct?  If we don't support every value in the value set, would we be considered non-compliant? Thanks!</p>",
        "id": 199531528,
        "sender_full_name": "SueAnn Svaby",
        "timestamp": 1591121634
    }
]