[
    {
        "content": "<p>I'd like to have resource pages in the IG even if the IG doesn't profile them. I'm thinking it's a good way to communicate the resources in scope for the IG.  I'll also be adding IG specific *-intro page content to explain how these resources should be used by the community.  It's just a documentation and communication need.  Is there way to do this without having to copy the StructureDefinition files?  I tried a couple of different references in the ImplementationGuide but it didn't work.</p>\n<p>It works if I copy the base profiles and reference them the usual way. There is an exception thrown during the build but the site looks fine, and I don't need schematrons:</p>\n<p>Exception generating resource C:\\Users\\essaids\\git\\gh\\phenopackets\\core-ig\\ig-root\\input\\resources\\structuredefinition-Patient::StructureDefinition/Patient: not the right kind of structure to generate schematrons for (00:30.0227)<br>\norg.hl7.fhir.exceptions.DefinitionException: not the right kind of structure to generate schematrons for<br>\n        at org.hl7.fhir.r5.conformance.ProfileUtilities.generateSchematrons(ProfileUtilities.java:5278)<br>\n        at org.hl7.fhir.igtools.publisher.Publisher.generateOutputsStructureDefinition(Publisher.java:7709)<br>\n...</p>",
        "id": 216278235,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605044241
    },
    {
        "content": "<blockquote>\n<p>I'd like to have resource pages in the IG even if the IG doesn't profile them. </p>\n</blockquote>\n<p>I typically just reference the source that did profile them.</p>",
        "id": 216278479,
        "sender_full_name": "Eric Haas",
        "timestamp": 1605044382
    },
    {
        "content": "<p>A related question, if I need to declare the base spec as a dependency in the ImplementationGuide for this to work, how do I do that? I'm not sure the base spec is really an IG and I couldn't find the right URL for it. Also, I'm assuming there is no need to declare that dependency since it's always there.</p>",
        "id": 216278556,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605044418
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I need to point to <a href=\"http://hl7.org/fhir/StructureDefinition/Patient\">http://hl7.org/fhir/StructureDefinition/Patient</a>, the base profile. I tried a full URL but it didn't work</p>",
        "id": 216278663,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605044495
    },
    {
        "content": "<p>&lt;definition&gt;<br>\n    &lt;resource&gt;<br>\n      &lt;reference&gt;<br>\n        &lt;reference value=\"<a href=\"http://hl7.org/fhir/StructureDefinition/Patient\">http://hl7.org/fhir/StructureDefinition/Patient</a>\" /&gt;<br>\n      &lt;/reference&gt;<br>\n    &lt;/resource&gt;</p>\n<p>java.lang.Exception: Bad Resource Identity - should have the format [Type]/[id] where Type is a valid resource type:<a href=\"http://hl7.org/fhir/StructureDefinition/Patient\">http://hl7.org/fhir/StructureDefinition/Patient</a> ....</p>\n<p>&lt;definition&gt;<br>\n    &lt;resource&gt;<br>\n      &lt;reference&gt;<br>\n        &lt;reference value=\"StructureDefinition/Patient\" /&gt;<br>\n      &lt;/reference&gt;<br>\n    &lt;/resource&gt;</p>\n<p>java.lang.Exception: Unable to find the source file for StructureDefinition/Patient: not specified, ...</p>\n<p>But the second option above works if I copy the base profile to my IG. I'm assuming there is a way to do this without having to copy it.</p>",
        "id": 216279233,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605044816
    },
    {
        "content": "<p>The base spec is automatically a dependency.  When you declare your FHIRVersion, that sets the dependency</p>",
        "id": 216281178,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605045890
    },
    {
        "content": "<p>In general, rather than including the resource, I'd just include some documentation about it and include a link to the rendering in the core spec.  That way if there's a technical correction, people reading your IG will still see the authoritative source.</p>",
        "id": 216281256,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605045946
    },
    {
        "content": "<p>That works for my short term needs but I'd imagine that it might be useful to add those resources to the actual ImplementationGuide instance so they become visible to any custom tools doing any sort of processing of the IG's content (given that the IG instance is the entry point for tooling).  The IG's static site can be rebuilt to pull in any updates from the base spec as long as I only reference the base profiles, not copy them.</p>\n<p>Does this mean that with the current publisher tooling there is no way to add a remote reference to a base profile like Patient as a resource in my ImplementatinGuide instance?</p>",
        "id": 216284281,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605047721
    },
    {
        "content": "<p>I have reference to the base fhir spec all my guides as do other authors.   you can provide a direct link or use the url .  It is unclear why your readers can't or won't follow the links to the authoritative source.</p>\n<p>For example here is a page with a link to the patient resource....</p>\n<p><a href=\"/user_uploads/10155/Zash8b_0aLLS5BbgbFb16P31/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Zash8b_0aLLS5BbgbFb16P31/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/Zash8b_0aLLS5BbgbFb16P31/image.png\"></a></div><p><a href=\"/user_uploads/10155/CwPTbCLYddfLEljAJhz96hNg/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/CwPTbCLYddfLEljAJhz96hNg/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/CwPTbCLYddfLEljAJhz96hNg/image.png\"></a></div><p>The ig publisher also generate a link to the profile dependency as well...</p>",
        "id": 216290502,
        "sender_full_name": "Eric Haas",
        "timestamp": 1605051916
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I don't think you're following my specific use case. I want to point to a specific FHIR profile to be included in my ImplementationGuide. I want Patient to be in my IG, not my own profile of Patient. I want the same StructureDefinition that is released with R4 for Patient to be added to my IG.  I'm not profiling it!  I know that if I create a profile the tools will add a link to the base profile of my profile but in this case I don't have a profile, I just want Patient to appear in my IG as it is in R4.  Have you seen an example of that?  Also, I understand that I can add a page to my IG as <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  suggested, and that is useful for readers, but it is not accessible to tooling loading my ImplementationGuide instance and all the resources referenced from it.</p>\n<p>For now I'm copying these StructureDefinitions and adding them to my IG. This is just for internal use so far so it's more about documenting/asserting (for readers and tooling) that those resources, as is, are part of our IG. We can clean this up later if there is a better solution that works for human readers and tools.</p>",
        "id": 216291021,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605052296
    },
    {
        "content": "<blockquote>\n<p>I want Patient to be in my IG, not my own profile of Patient.</p>\n</blockquote>\n<p>A completely empty Patient would then be ok according to your implementation guide - is that really what you want?</p>",
        "id": 216292157,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1605053157
    },
    {
        "content": "<p>The IG tooling isn't designed to include a resource.  Resources are expected to only publish in the core specification.  If you try to copy the structure definition for a resource into an IG, it's possible they'll publish correctly, but it's entirely possible the publisher won't work - and it's unlikely we'd fix the issue.  Our intention is for there to be a single source of truth for the resources - and that's the core spec.  Even if you were to get the resources in your IG, all the references between them would resolve to the core spec, not the equivalent location in your IG.  Similarly, all the data types would resolve to the core spec.  There's no ability to publish an IG that <em>doesn't</em> include an expectation for online access to the core spec.  At least not with HL7-designed tools.</p>",
        "id": 216292313,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605053268
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 216292825,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1605053637
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  thanks for the clarifications. I also don't want to copy, and would want all references to point to the base spec, the tooling needing online access, etc.  I'm just trying to find a way to clearly capture (for readers and any custom tooling) that the base resource is part of the overall model being defined in my IG.</p>",
        "id": 216292873,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605053647
    },
    {
        "content": "<p>I'm not sure this covers your usecase either, but an option for when you want to declare a resource important and necessary but don't want to re-profile it at all is to just have a CapabilityStatement page calling out the base fhir resource as SHALL support etc. The narrative then can also have a link out to the resource in the base fhir spec so that any readers can follow those links and inspect the resource definitions themselves.</p>",
        "id": 216292899,
        "sender_full_name": "ryan moehrke",
        "timestamp": 1605053676
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192103\">@Lin Zhang</span>, I'm not sure what you're looking for<br>\n<span class=\"user-mention\" data-user-id=\"223326\">@Shahim Essaid</span> all IGs I've seen to date accomplish that objective with hyperlinks</p>",
        "id": 216293048,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605053830
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  hyperlinks work for readers but I'm also thinking about later custom tooling. Tools need to find that info in the conformance resources of my IG, not in the pages. <span class=\"user-mention\" data-user-id=\"237342\">@ryan moehrke</span>  suggestion is a good option to formally capture that. I was thinking about trying to do it in ImplementationGuide so far but the CapabilityStatement is another good option. I haven't worked with CS yet so I'll be looking into that soon.</p>\n<p>Thanks everyone for all the help and suggestions. Much appreciated!</p>",
        "id": 216293275,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605054016
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 216293430,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1605054215
    },
    {
        "content": "<p>note of clarification: you can include a capability statement inside of an implementation guide and this is what I was suggesting (i.e. <a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/CapabilityStatement-plan-net.html\">https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/CapabilityStatement-plan-net.html</a>), but if a standalone capabilitystatement can represent all the info you need then it may be a fine option too.</p>",
        "id": 216293659,
        "sender_full_name": "ryan moehrke",
        "timestamp": 1605054411
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 216294176,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1605054833
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"223326\">@Shahim Essaid</span> I don't understand what your concern is with the tools. The tools will see the IG through the NPM ecosystem, which will identify your IGs NPM dependencies, and those dependencies have to be resolved. So anything in the core will automatically be available to the tools</p>",
        "id": 216449511,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1605176204
    }
]