[
    {
        "content": "<p>When profiling a resource (e.g. Patient), is it possible to restrict elements in the resources parents (e.g. DomainResource or Resource)?</p>\n<p>Example, if creating a NhsPatient profile based on the Patient resource, could you add a slice to meta.profile and constrain the slice to be the URI of NhsPatient?</p>\n<p>I note that Forge doesn't allow you to \"see\" the parent resource elements, but I don't know if this is just something not supported in it yet.</p>\n<p>Many thanks.</p>",
        "id": 153814550,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457525802
    },
    {
        "content": "<p>Hi Jonny, yes FHIR allows constraints on elements inherited from Resource or DomainResource. However Forge currently does not yet display these elements. We are planning to implement support in a future release.</p>",
        "id": 153814551,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1457525874
    },
    {
        "content": "<p>Great, thanks.</p>",
        "id": 153814552,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457525917
    },
    {
        "content": "<p>BTW I am aware that the NHS needs this functionality. We'll try and prioritize this change.</p>",
        "id": 153814553,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1457526036
    },
    {
        "content": "<p>why is this useful? sounds like a recursive profile :)  Is this for profiles on other profiles? (ie where there is a subset of UK patient??)</p>",
        "id": 153814594,
        "sender_full_name": "David Hay",
        "timestamp": 1457544102
    },
    {
        "content": "<p>I'm not sure of Jonny's use case but we definitely have requirements in this area. In some places for example we may want to say \"always state a profile\"</p>",
        "id": 153814597,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1457545814
    },
    {
        "content": "<p>You want to be able to say \"instances of this profile must explicitly declare conformance with this profile\" or possibly \"must declare conformance with one of the following other profiles\" - it's a shortcut to \"including\" other profiles.</p>",
        "id": 153814600,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1457549144
    },
    {
        "content": "<p>@Jonny, coincidentally I managed to implement support in Forge for editing profile restrictions on common resource elements inherited from DomainResource and/or Resource (id, meta, implicitRules, language, text). This behavior is disabled by default and controlled by a new configuration setting in the Options menu (\"Expand Common Elements\"). If you toggle this setting the application requires a restart. You can download the new release from <a href=\"http://fhir.furore.com/forge\" target=\"_blank\" title=\"http://fhir.furore.com/forge\">http://fhir.furore.com/forge</a>. Please let me know if you have any questions or comments.</p>",
        "id": 153814755,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1457616598
    },
    {
        "content": "<p>Superb!  I will check it out now.</p>",
        "id": 153814764,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1457618812
    }
]