[
    {
        "content": "<p>In discussing <a href=\"http://jira.hl7.org/browse/FHIR-32011\">FHIR#32011</a>, FHIR-I is proposing adding an 'outcome' element to Bundle to capture information and warning messages related to the processing of a bundle or transaction, or even to capture information related to the processing of a message or creation of a document.  The proposals would also mean deprecating the Bundle.entry.search.mode of 'outcome', with the guidance to use the new element instead.  Feedback about the idea is welcome.</p>",
        "id": 254640884,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632450565
    },
    {
        "content": "<p>I like the idea. I've been considering adding outcome entries to our implementation for some searchset situations but it's a real concern that any clients not anticipating this possibility could be broken by it. It would fix a lot of fhirpath constraint issues.</p>",
        "id": 254645868,
        "sender_full_name": "Paul Church",
        "timestamp": 1632455054
    },
    {
        "content": "<p>Since a bundle can contain any resource, and when it comes to search, it's recommended to include the OperationOutcome resource. Why wouldn't you just include the OperationOutcome resource to capture those messages related to the outcome of the bundle processing?</p>",
        "id": 254693958,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1632485872
    },
    {
        "content": "<p>In a batch-response, the entries in the response must exactly correspond to the entries in the request.  You can't throw in another entry with an OperationOutcome without causing an error.  Same goes for 'transaction'.  You could throw an OperationOutcome into a document Bundle, but it would have to be navigable to from the Composition, which isn't necessarily what you want.  Same deal with messages.</p>",
        "id": 254717657,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632495473
    },
    {
        "content": "<p>After further discussion, we're leaning towards defining a standard header that could include an OperationOutcome as part of the result of an API invocation.  With Bundles, it would be used for batch-response, transaction-response and history.  In principle, it could also be used with POST, PUT and PATCH to return both the 'result' of a change (as the body) as well as the OperationOutcome.  (At the moment you can only do one or the other.)</p>",
        "id": 263923013,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638824057
    },
    {
        "content": "<p>FYI too: <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span> <span class=\"user-mention\" data-user-id=\"197072\">@Paul Church</span> <span class=\"user-mention\" data-user-id=\"191318\">@nicola (RIO/SS)</span> <span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span> <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 263937730,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638831974
    },
    {
        "content": "<p>My concern would be the size of the OpOutcome as a header (assuming you mean in json format - don't have that much space to mess with)<br>\nAnd then which to look for, the body (when it's a bad request) or the header if it's info messages.</p>",
        "id": 263937987,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1638832153
    },
    {
        "content": "<p>(and we already have the provenance header stuff too - not that I've used that yet)</p>",
        "id": 263938019,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1638832183
    },
    {
        "content": "<p>How about Bundle supporting contained, and including the outcome in there? (and would work for any resource too)</p>",
        "id": 263938159,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1638832236
    },
    {
        "content": "<blockquote>\n<p>which to look for,</p>\n</blockquote>\n<p>That's an issue either way</p>",
        "id": 263939508,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638833262
    },
    {
        "content": "<p>I really don't want to complicate bundle by allowing other kinds of resources</p>",
        "id": 263939596,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638833309
    },
    {
        "content": "<p>Yes an issue either way, but this is another location to add to that list of possible locations.</p>",
        "id": 263940873,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1638834306
    },
    {
        "content": "<p>Still didn't get problem clearly - is it about bundle in bundles or just add meta information to each entry of the bundle? -1 for header, especially with json/xml data - for me it is anti-pattern (HTTP is not the only interaction protocol). I really not a fan of idea sharing Bundle for everything - specialized  containers would be better. And for us it is not a problem to extend bundle.entry with new properties. Does name \"outcome\" reflect this semantic?- for me it is more like \"additional-info\" or \"metadata\", \"details\"</p>",
        "id": 263944149,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1638836827
    },
    {
        "content": "<p>This isn't for each entry, it's for the overall processing of the interaction.  Bundle.entry can already capture an outcome.  As an example, when invoking a history interaction, you might pass back a warning that says \"some history entries have been suppressed due to permission limitations\" or \"history between date X and Y is not available\" or something like that</p>",
        "id": 263953973,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638847018
    },
    {
        "content": "<p>I may be remembering incorrectly, but had thought that it was always valid to wrap a response in an OperationOutcome. Or is that only for \"operations\" and not for things like search?</p>",
        "id": 263964204,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1638859128
    },
    {
        "content": "<p>Putting a whole OO resource in a header might be trouble on some networks if the OO gets too big.</p>\n<p>I know we added an interceptor in HAPI server that added validation results to response headers, and we've had a lot of reports of this causing things to fail as the response passes through various bits of network infrastructure. Despite the RFC not claiming any size limits on headers, there definitely seem to be some practical ones.</p>",
        "id": 264001775,
        "sender_full_name": "James Agnew",
        "timestamp": 1638884301
    },
    {
        "content": "<p>Given the concerns about header size, would there be more support for the original proposal of adding an additional element to Bundle to support an overall OperationOutcome?</p>",
        "id": 264006530,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638886340
    },
    {
        "content": "<p>Would this would change the batch \"all or nothing' rules too?</p>",
        "id": 264021602,
        "sender_full_name": "Eric Haas",
        "timestamp": 1638892876
    },
    {
        "content": "<p>Not sure what you mean <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 264021918,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638893004
    },
    {
        "content": "<p>if a batch fails because #3 of 4 Post fails what would it look like under the changes?</p>",
        "id": 264022279,
        "sender_full_name": "Eric Haas",
        "timestamp": 1638893117
    },
    {
        "content": "<p>A batch wouldn't fail if 3 of 4 posts fail.  However, a transaction would fail.  This OperationOutcome wouldn't be for errors - those would be handled as they always were.  This would be for warnings and information messages that apply to the whole Bundle when the processing was 'successful'.</p>",
        "id": 264022734,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638893264
    },
    {
        "content": "<p>I remain in favour of this idea and I don't think an http response header is a good compromise due to header size issues.</p>",
        "id": 264041377,
        "sender_full_name": "Paul Church",
        "timestamp": 1638899407
    }
]