[
    {
        "content": "<p>I'm working through an exercise in modelling custom data for use in FHIR and I have a case where I'd like to add a new complex type  (it has three properties). I've created structure definitions for each of the properties. From here, would I create a new type by extending Basic? Or would it be best to just add each of these three extensions to a profile on the targetted resource (in this case, Encounter). I've looked through the FHIR documentation and can't find an example of creating a complex-type and then using it in a resource.</p>",
        "id": 153895571,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1498691200
    },
    {
        "content": "<p>do you mean adding a complex extension with thee subextensions.  That is  the only way I know how to add a complex element to an existing resource?</p>",
        "id": 153895580,
        "sender_full_name": "Eric Haas",
        "timestamp": 1498696189
    },
    {
        "content": "<p>That's right, Eric. That's the idea. Do you know of an example of this that I can reference?</p>",
        "id": 153895581,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1498697177
    },
    {
        "content": "<p>Just search for \"complex\" in the <a href=\"http://hl7.org/fhir/extensibility-registry.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extensibility-registry.html\">extension registry</a></p>",
        "id": 153895582,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1498697680
    },
    {
        "content": "<p>thanks</p>",
        "id": 153895584,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1498697765
    },
    {
        "content": "<p>or <a href=\"http://build.fhir.org/ig/Healthedata1/IG-Template/StructureDefinition-template-complex.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/Healthedata1/IG-Template/StructureDefinition-template-complex.html\">here</a> where I use the ig-pub to create....</p>",
        "id": 153895586,
        "sender_full_name": "Eric Haas",
        "timestamp": 1498697825
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thanks again. After reviewing the resources you referenced, I used the Forge tool to create the extension and profile on Encounter that will use it. I published both to Furore's FHIR registry (e.g. <a href=\"https://simplifier.net/PerformanceAnalytics/pa-tumor-registry\" target=\"_blank\" title=\"https://simplifier.net/PerformanceAnalytics/pa-tumor-registry\">https://simplifier.net/PerformanceAnalytics/pa-tumor-registry</a>). I gotta say I'm very impressed with the Forge tool - it's been significantly enhanced since I first tried it out back in the early days of FHIR. Kudos to guys at Furore for providing these tools to the community!</p>",
        "id": 153895660,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1498745149
    },
    {
        "content": "<p>I have almost the same issue. I'd like to replace the complex address datatype in the Patient resource by a new complex type (fr-address-type). I've created the new complex type as you've described but I don't find how to profile the patient resource in Forge (how to replace address datatype by the new address datatype extended. Could you help me?</p>",
        "id": 153896820,
        "sender_full_name": "Isabelle GIBAUD ",
        "timestamp": 1499938975
    },
    {
        "content": "<p>I got it. I've created a new profile of the address datatype and then I've been able to reference this new profile of datatype in my Patient resource profile.</p>",
        "id": 153896839,
        "sender_full_name": "Isabelle GIBAUD ",
        "timestamp": 1499955972
    }
]