[
    {
        "content": "<p>What would be the best way to add additional information to device resource. I would like to add string about calibration code to the resource. Calibration code in our case is information that is used to tie a packet of flow transducers to the device. We have a lot of other information about the device planned for device resource such as: manufacturer, serialNumber, modelNumber, patient, type and version. </p>\n<p>I know there is a DeviceMetric resource but there is no place to store a string about calibration. In addition to that we have no other use for DeviceMetric resource. DeviceMetric seems more like resource to store information about time and type of calibration. Maybe it’s more about “action” calibration rather than just a code what was used to calibrate the device? Code that we would like to store is just one string and it would seem useless to add complete resource to just one string. <br>\nThere is a property element in device resource. Could this be used to store this information? </p>\n<p>Original plan was to add extension just to tell the calibration code but now we are reconsidering that is that the best way to do this? If extension is ok this would still probably be the most simple way to do this?</p>",
        "id": 211880740,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1601540462
    },
    {
        "content": "<p>seems Device.property would work. It is a rather unconstrained set of key value pairs</p>",
        "id": 211899972,
        "sender_full_name": "John Moehrke",
        "timestamp": 1601554397
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"196057\">Lauri Karppinen</span> <a href=\"#narrow/stream/179166-implementers/topic/Additional.20string.20to.20device.20resource/near/211880740\">said</a>:</p>\n<blockquote>\n<p>I know there is a DeviceMetric resource but there is no place to store a string about calibration.</p>\n</blockquote>\n<p>I thought <a href=\"https://www.hl7.org/fhir/devicemetric-definitions.html#DeviceMetric.calibration\">https://www.hl7.org/fhir/devicemetric-definitions.html#DeviceMetric.calibration</a> is meant for just this purpose.</p>",
        "id": 213887935,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1603182245
    },
    {
        "content": "<p>But yes, it seems there is no place for the actual calibration value.</p>",
        "id": 213887983,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1603182295
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179166-implementers/topic/Additional.20string.20to.20device.20resource/near/211899972\">said</a>:</p>\n<blockquote>\n<p>seems <a href=\"http://Device.property\">Device.property</a> would work. It is a rather unconstrained set of key value pairs</p>\n</blockquote>\n<p>Seems like <a href=\"http://device.property\">device.property</a> is still in progress? In <a href=\"https://www.hl7.org/fhir/device.html\">https://www.hl7.org/fhir/device.html</a> “DeviceDefinitionPropetyCode (Extensible)” can not be clicked. Are these codes still undefined or is there somekind of bug? Suggestion of <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  seem like a valid idea to use <a href=\"http://device.property\">device.property</a> to store this information. I’m still not sure did I understand the idea correctly. Should I just use device.property.type and use text element of codable concept? If there is some example of device resource which could be helpful can You please point me to that? I’ve only found very few device examples and they have a very little information in them.</p>",
        "id": 216322507,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1605086453
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span> <span class=\"user-mention\" data-user-id=\"192181\">@John Rhoads</span> ?</p>",
        "id": 216353883,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605105622
    }
]