[
    {
        "content": "<p>Background: Swedish names often consists of multiple given names (e.g. Björn Rune) and a family name (Borg). (Middle names also exist, but are less common and can in principle be seen as part of the family name.) For a person with multiple given names, one (e.g. Björn) or two can be officially pointed out as preferred (Swe: \"Tilltalsnamn\"). To handle this in a Swedish extension, we are considering adding an attribute - preferredGiven - to the HumanName datatype, on the same level as e.g. the 'family' and 'given' attributes. The cardinality would be 0..2. Any thoughts on this approach?</p>",
        "id": 160275214,
        "sender_full_name": "Marcus Petersson",
        "timestamp": 1552037380
    },
    {
        "content": "<p>You can't actually add new elements to a resource or data type if you want to be conformant.  The solution here would be to make use of an extension.  Take a look at <a href=\"http://build.fhir.org/valueset-name-part-qualifier.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-name-part-qualifier.html\">this standard extension</a> and see if the \"call me\" code would be appropriate.  If not, you could submit a change proposal for a new standard extension.</p>",
        "id": 160300351,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552060148
    },
    {
        "content": "<p>Thanks! I'll check it out.</p>",
        "id": 160459406,
        "sender_full_name": "Marcus Petersson",
        "timestamp": 1552292048
    },
    {
        "content": "<p>We looked into this a bit further, and dont see that we can use the above value set and Call Me. Reasons are first of all that it is not clear how we would easily pinpoint one of the given names using a code, and also the requirement is to have an official \"preferred name\" which is not to be confused with a \"nickname\" or similar. </p>\n<p>In Sweden the \"preferred name\" is set officially by the tax agency. </p>\n<p>What we are considering is having an Extension with a string to specify a given name that is also the preferred name. We will report a CR for this as it seems likely that others will have similar requirements.</p>",
        "id": 161153243,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1553004533
    },
    {
        "content": "<p>To clarify, the \"preferred name\" would not be the same as the \"official name\"?  I.e. it could be different than what's on your passport/birth certificate?  If so, the best solution might be to propose an addition to the name use code system (and use an extension to indicate the use in the meantime).  The name itself wouldn't have to be an extension, just the use that differentiated it.</p>",
        "id": 161159964,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553008854
    },
    {
        "content": "<p>Lets take my name as an example. </p>\n<p>Name:<br>\n-Given: Karl<br>\n-Given: Martin<br>\n-Given: Tobias<br>\n-Family: Grundberg</p>\n<p>We need to point out that my offical preferred name is Martin. All of the given names are in my passport.</p>",
        "id": 161161400,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1553009834
    },
    {
        "content": "<p>That sounds like a \"call me\" to me.  Nothing about \"call me\" says that it can't be part of your official name - it just allows for the possibility that it might not be.</p>",
        "id": 161169576,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553015183
    },
    {
        "content": "<p>But how would you use that code to pinpoint one of the given names? You can’t use it on the name as a whole (all given, family).</p>",
        "id": 161181601,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1553022979
    },
    {
        "content": "<p>The extension would appear on the specific given name.  entity-name-qualifier extends prefix, suffix, given and family, not HumanName overall.</p>",
        "id": 161183100,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553024238
    },
    {
        "content": "<p>Now I follow, and I agree that this is a good approach and have added that to our profile. Thanks!</p>",
        "id": 162615240,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1554465028
    }
]