[
    {
        "content": "<p>We in CBCP received a ticket (<a href=\"http://jira.hl7.org/browse/FHIR-31550\">FHIR-31550</a>) as follows:</p>\n<blockquote>\n<p>To add a new element to the Consent.provision with the Expression data type or redefine data type for the Consent.provision.code element from CodeableConcept to choice of data type (CodeableConcept, Expression) to be able to define a restricted/allowed element by FHIRPath.</p>\n</blockquote>\n<blockquote>\n<p>Rational: to avoid using LOINC or any other codes and define restricted/allowed element by FHIRPath, for example, instead of 76691-5 “Gender identity” use a machine readable Patient.gender.</p>\n</blockquote>",
        "id": 236372674,
        "sender_full_name": "David Pyke",
        "timestamp": 1619542610
    },
    {
        "content": "<p>The question was,  is this too much to ask for implementers that they implement FHIRPath for Consent?</p>",
        "id": 236372760,
        "sender_full_name": "David Pyke",
        "timestamp": 1619542647
    },
    {
        "content": "<p>That is the current model for Permission.. and I have similar reservations. That said, as long as you provide alternatives then IG or local decisions can choose to use those alternatives that they are willing to use.</p>",
        "id": 236372999,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619542753
    },
    {
        "content": "<p>When we're talking about a choice of data types, there isn't necessarily an expectation that everyone supports all choice options.  Implementation works more smoothly when 'reasonable' choices are explicit in the core spec rather than having the complexity of having the core element or an extension for the core element.</p>",
        "id": 236379597,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619545597
    },
    {
        "content": "<p>So if we should include the expression type, what would be a reasonable choice selection?</p>",
        "id": 236379834,
        "sender_full_name": "David Pyke",
        "timestamp": 1619545692
    },
    {
        "content": "<p>I think so</p>",
        "id": 236380032,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619545770
    },
    {
        "content": "<p>Sorry, I meant should we constrain it to FHIRPath or should we allow the full selection of types?</p>",
        "id": 236380216,
        "sender_full_name": "David Pyke",
        "timestamp": 1619545828
    },
    {
        "content": "<p>Allow full selection.  CQL could also make sense.  Some organizations might choose to use something organization-specific (e.g. SQL).</p>",
        "id": 236380350,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619545873
    }
]