[
    {
        "content": "<p>I'm confused by the comment on Address.district:</p>\n<blockquote>\n<p>District is sometimes known as county, but in some regions 'county' is used in place of city (municipality), so county name should be conveyed in city instead.</p>\n</blockquote>\n<p>Even if these terms can be interpreted differently, isn't there at least some explicit level of significance to these properties that remains consistent? It sounds as if \"city\" sometimes encompasses multiple districts, and sometimes vice versa?</p>\n<p>In our case, we don't use city or county in addresses. We use the name of the municipality. So should I put that in district or city? Or neither?</p>",
        "id": 153953534,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1524471757
    },
    {
        "content": "<p>Municipality would go in city.  \"county\" is only used if you need city but also need some larger region that's smaller than state/province/territory</p>",
        "id": 153953639,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524496847
    },
    {
        "content": "<p>I have a question about the use of address.district. The way I read the definition \"District is <strong>sometimes</strong> known as county...\" is an indication that district is not always county but is some recognized named subdivision of a country other than State. This subdivision is geographically bound and can be larger than or smaller than a State, perhaps even smaller than a city. </p>\n<p>I'd like to use district to represent a public health reporting jurisdiction in the US, particularly vital records reporting jurisdictions. Is this an appropriate use of the district component of the address datatype? A public health reporting jurisdiction is a subdivision of a country (typically, but not exclusively, a State or City), subdivisions of the United States deemed by the CDC to be a public health reporting jurisdiction include states, territories, \"districts\" (the District of Columbia), cities, townships, municipalities, and Native American Reservations. A value set based primarily upon FIPS codes has been defined for each vital record reporting jurisdictional districts.</p>",
        "id": 207086489,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1597607304
    },
    {
        "content": "<p>I'd say no: for a US address <code>district</code> = county</p>",
        "id": 207088577,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1597610019
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> <a href=\"#narrow/stream/179166-implementers/topic/Address.2Edistrict/near/207088577\">said</a>:</p>\n<blockquote>\n<p>I'd say no: for a US address <code>district</code> = county</p>\n</blockquote>\n<p>Is there something in the standard that states that in the US district is equal to and limited to county? For the state of Louisiana, would county = parish? Are the boroughs of New York City counties?</p>",
        "id": 207089230,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1597611168
    },
    {
        "content": "<p>The boroughs of NYC are counties.</p>\n<blockquote>\n<p>Each borough is coextensive with a respective county of New York State.</p>\n</blockquote>\n<p>From <a href=\"https://en.m.wikipedia.org/wiki/Boroughs_of_New_York_City\">Wikipedia</a></p>",
        "id": 207098280,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1597626150
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> Yes, I am aware that the boroughs of NYC are counties, just as the parishes of Louisiana are equivalent to counties. The point I was attempting to make is that district = county is not accurate. I think it appropriate to use district to represent a public health reporting jurisdiction in the US. How is district used outside of the US? Perhaps my first step should be to ask that the definition of district be modified to read \"A political or administrative subdivision of a country. In the United States, this would include counties and county-equivalents (e.g.independent cities, parishes, boroughs) as defined by the Federal Information Processing System (FIPS) Codes for States and Counties.\"</p>",
        "id": 207107116,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1597640245
    },
    {
        "content": "<p>District is any subdivision you may have between state/province and city, a subdivision used for postal addressing. Your use case is not related to postal addressing, it would not be appropriate if printed on an envelope. Yours is a characteristic of an address not covered by the standard data elements, so an extensions seems to be called for.</p>",
        "id": 207111376,
        "sender_full_name": "René Spronk",
        "timestamp": 1597646787
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/location.html\">Location</a> can be used to describe a public health reporting jurisdiction in the US.</p>\n<p>Jurisdiction is explicitly listed in the examples for location, and CDC/FDA is shown as an example for business scope.</p>",
        "id": 207143354,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1597670848
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> ** <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> You make a good point. The address resource is not a location. It is a means of facilitating postal deliveries. I should be looking at the Location resource for my use case. Thanks.</p>",
        "id": 207174990,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1597686534
    }
]