[
    {
        "content": "<p>Does it make sense for 'old' to be in the address-use valueset?  For example being able to determine an old home address from an old work address. </p>",
        "id": 153851884,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1475613197
    },
    {
        "content": "<p>Can you please log a tracker issue for this one?<br>\nI do think this is something we should address.</p>",
        "id": 153851903,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1475614504
    },
    {
        "content": "<p>old *is* in the address.use value set</p>",
        "id": 153851919,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475622494
    },
    {
        "content": "<p>That's the issue - it means you can't determine the use of an 'old' address.</p>",
        "id": 153851984,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1475654523
    },
    {
        "content": "<p>ah. does that matter? why?</p>",
        "id": 153851985,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475654561
    },
    {
        "content": "<p>Good question - I was addressing it from a modelling perspective rather than known use cases.  But there are uses in data analysis for population health and service commissioning (anything where home address is part of the equation, e.g. Townsend score).</p>",
        "id": 153851991,
        "sender_full_name": "Jonny Rylands",
        "timestamp": 1475659242
    },
    {
        "content": "<p>Previous addresses may also have been removed from the resource and not just end dated/marked as old.<br>\nThese wouldn't be considered by a townsend score either.</p>",
        "id": 153852069,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1475699918
    },
    {
        "content": "<p>Technically, <code>(current|old)</code> is orthogonal to <code>use</code> and should, therefore, be in a separate data element.   <code>period</code> is the best place to carry this, so ideally that data element could be one of these values (perhaps in an extension) where the actual time period is not known.  That way, you could more reliably infer whether the address is current or old depending on the absence or presence of a high date/time in <code>period</code>.</p>",
        "id": 153852140,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475732271
    },
    {
        "content": "<p>Or more accurately the period covers the time of interest (which could be now)</p>",
        "id": 153852143,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1475736881
    },
    {
        "content": "<p>Oh.  Well that's not going to work then. <img alt=\":disappointed:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/disappointed.png\" title=\":disappointed:\"> </p>",
        "id": 153852217,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475802784
    },
    {
        "content": "<p>I should have read the doco ( <img alt=\":face_with_rolling_eyes:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/face_with_rolling_eyes.png\" title=\":face_with_rolling_eyes:\"> ); I assumed that period was period of use not period of interest.</p>",
        "id": 153852218,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475802828
    },
    {
        "content": "<p>So ideally you'd want an extra element to carry this, and I suppose the chance of that being added to core is very low, so yet another extension then. <img alt=\":smirk:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/smirk.png\" title=\":smirk:\"> </p>",
        "id": 153852223,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475803550
    },
    {
        "content": "<p>don't know. Does anyone actually do this? </p>",
        "id": 153852227,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475803741
    },
    {
        "content": "<p>Well obviously <span class=\"user-mention\" data-user-id=\"191495\">@Jonny Rylands</span> does because otherwise we wouldn't even be having the discussion.  Also, AS4846 does include the concept of period of use -- which is similar -- but I would think that few systems record such data because capturing it is unreliable.  However, the knowledge of an address being old is common (and presumably why there's a use code for it), so being able to capture it independently of use would be good.  \"Old\" is clearly not a use of an address.  (Well. not unless you mean how my system uses the address data as opposed to how does the \"owner\" of the address use it, but that would be just weird.)</p>",
        "id": 153852234,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475807636
    },
    {
        "content": "<p>that was what I meant. Jonny so far has appeared to have the same perspective as you: a theoretical model perspective, not a practical system issue</p>",
        "id": 153852235,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475807715
    },
    {
        "content": "<p>I've worked on systems (outside of healthcare) that even automatically flag data like addresses and phone numbers as being stale after a while requiring a customer care agent to verify that they are still in use by the person.</p>",
        "id": 153852237,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475807755
    },
    {
        "content": "<p>Outside of healthcare, recording address and such as old is common, and the requirement to continue to know what use the person previously made of it remains.</p>",
        "id": 153852238,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1475807809
    },
    {
        "content": "<p>Our system only has the periods to work out what dates are applicable. We don't use old at all.<br>\nMaybe I missed the explanation, the period on the address is the period that this address applies. So on the Patient record I might have 3 addresses in a year as I moved twice, including a planned move that will happen mid december (which is in the future).<br>\nSo when I'm planning an appointment to visit the clients home, the current address can be calculated based on the context here.</p>",
        "id": 153852419,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476056991
    },
    {
        "content": "<p>Hope that is a little more clear.</p>",
        "id": 153852420,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476057003
    },
    {
        "content": "<p>So that is the period of use, then, i.e. the period during which the person was using a given address as their home address, say.</p>",
        "id": 153852421,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476057235
    },
    {
        "content": "<p>but most systems don't keep that; they simple have current home &amp; work, and when you replace one of these, they move the replaced one into the old list for searching purposes</p>",
        "id": 153852423,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476057336
    },
    {
        "content": "<p>they don't track period. Just 'this is an address that used to be valid, so show this patient if you search on this address'</p>",
        "id": 153852424,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476057359
    },
    {
        "content": "<p>That sound's about right also. So when using old possibly not using the periods.<br>\nStill interested in other implementers use of these 2 properties.</p>",
        "id": 153852425,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476057412
    },
    {
        "content": "<p>Which is fine, they don't have to.  However, I do know that systems that keep addresses like to know to what use the no-longer-current addresses were put.</p>",
        "id": 153852426,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476057442
    },
    {
        "content": "<p>why?</p>",
        "id": 153852427,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476057468
    },
    {
        "content": "<p>Typically for proof of identity purposes.</p>",
        "id": 153852428,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476057500
    },
    {
        "content": "<p>umm?</p>",
        "id": 153852429,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476057524
    },
    {
        "content": "<p>There are often times when you'll be asked to provide a history of addresses, not just your current one.</p>",
        "id": 153852430,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476057533
    },
    {
        "content": "<p>I don't remember that ever happening to me</p>",
        "id": 153852431,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476057547
    },
    {
        "content": "<p>me either.</p>",
        "id": 153852432,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476057558
    },
    {
        "content": "<p>I don't know whether that's required in healthcare, but it is not uncommon in other industries.</p>",
        "id": 153852433,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476057564
    },
    {
        "content": "<p>no I do, but only for police check purposes</p>",
        "id": 153852434,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476057565
    },
    {
        "content": "<p>Have you never had to do that when applying to rent a place?  They often ask it in a qualified sense, e.g. provide all the addresses you've lived in the last 3 years.</p>",
        "id": 153852435,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476057622
    },
    {
        "content": "<p>Utility companies will keep long records of their customers addresses as do banks.</p>",
        "id": 153852436,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476057693
    },
    {
        "content": "<p>And they would probably use the periods for these too.</p>",
        "id": 153852438,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476060281
    },
    {
        "content": "<p>Yes they often do, but address use periods are notoriously difficult to capture accurately, so they often actually record the period that they knew the address was used by the customer for the purpose given, which is not necessarily the same thing, especially for non-home addresses.  </p>",
        "id": 153852440,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476065252
    },
    {
        "content": "<p>All of which is interesting, but it may well be that this kind of data keeping has little utility in a healthcare context.  The only ones that I can think who might keep such records are jurisdictional depts of health or public hospitals.  Does anyone know?</p>",
        "id": 153852441,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476065419
    },
    {
        "content": "<p>national id systems, maybe. I've never heard of hospitals keeping it</p>",
        "id": 153852443,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476066999
    },
    {
        "content": "<p>Systems rostering home visits will likely track the address periods. (community based care provision)</p>",
        "id": 153852444,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476067200
    },
    {
        "content": "<p>(But not necessarily using the <code>old</code> value)</p>",
        "id": 153852445,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476067227
    },
    {
        "content": "<p>This is a common function of an Identity Provisioning (proofing) system; but is not an expectation of a HealthIT system. If it exists in the HealthIT, it is spotty, as it would only be addresses held while getting treatment. There is support in versions of the resource. In this regard the former addresses are relevant to healthcare as they were locations relevant to health treatment (or observations). These are commonly needed in clinical research; especially public-health research; when a regional environmental connection might have correlation or causation relationships to medical issue.  I would agree that there is sufficient support in 'versioning' for the use-cases.</p>",
        "id": 153852458,
        "sender_full_name": "John Moehrke",
        "timestamp": 1476103726
    },
    {
        "content": "<p>Is \"use versioning\" something we're going to commonly use as a solution to a use case other than audit/forensics?  Generally, we've designed the resources to have periods/histories within the resource itself.  If there's a business case for examining version history, we've introduced the need to differentiate between real-world update and data correction and (potentially) introduced use cases for search in _history.  That's bad.</p>",
        "id": 153852487,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1476140612
    },
    {
        "content": "<p>well, it's not great, but welcome to the real world; we cannot assume that there's a RESTful API available, one that is fully populated with all the combined record history of everything. So our guidance to the committees is that where the history is inherently important for current interpretation, to put it in the resource</p>",
        "id": 153852499,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476141835
    },
    {
        "content": "<p>And I wasn't expecting that we'd need to go through history for the patient addresses.<br>\n(Though you could to verify the old ones that were deemed important enough)</p>",
        "id": 153852511,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476151871
    },
    {
        "content": "<p>I'm not advocating for one approach or the other - just consistency.  It appears that we've got address.period to allow carrying previous/current/future addresses.  If there's a use case for an address history, this is where it goes, not in Patient/_history.  Otherwise, we need the capability to search _history </p>",
        "id": 153852700,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1476291726
    },
    {
        "content": "<p>(Just noticed that essentially the same thing was said above)</p>\n<p>It would be very valuable to know that an address was a patient's home address during a particular point of time in the past, especially for identifying possible environmental issues related to health care.</p>\n<p>A real life example was the recent Flint Michigan incident when people were exposed to high levels of lead in their water. Being able to identify individual(s) who lived in that area during the time frame of the incident could help to either identify people who should be monitored, or help to identify that a patient's current symptoms might be related to a known or suspected environmental incident at some time in the past.</p>",
        "id": 153852744,
        "sender_full_name": "Bruce Tietjen",
        "timestamp": 1476309752
    },
    {
        "content": "<p>but this does sound very different to 'patient's contact address'</p>",
        "id": 153852748,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476312096
    },
    {
        "content": "<p>Patient's travelling and living history...</p>",
        "id": 153852749,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476312104
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Actually, our advice (at least from Workflow) is to <em>not</em> put it in the resource, but instead to reference relevant Provenance instances.  This minimizes repetition of data and keeps instances lighter</p>",
        "id": 153852829,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1476417091
    },
    {
        "content": "<p>you are keeping old addresses in Provenance resources? </p>",
        "id": 153852858,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476472742
    },
    {
        "content": "<p>No, what I'm saying is that if you want to keep a history of events that have happened to a resource over time, we don't recommend including that as content of the resource anymore</p>",
        "id": 153852880,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1476478263
    },
    {
        "content": "<p>that's a very difficult proposition for non-RESTful use</p>",
        "id": 153852884,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476479558
    },
    {
        "content": "<p>Why?  If you want to include the history in a message or bundle, you can include the referenced provenances</p>",
        "id": 153852886,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1476483159
    },
    {
        "content": "<p>but the provenances don't include the data; you now need all the historical references. From all the contributing servers, and there's no reconciled list of past addresses. I think you haven't thought this all the way through</p>",
        "id": 153852892,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476486262
    },
    {
        "content": "<p>This is for capturing history of things like prescriptions.  Provenance allows you to capture: Who made the change, what kind of change (creation, suspension, etc.), why the change was made and when it was made.  That's generally all that's needed.  (It's been thought about and discussed quite a bit - 2 hours of discussion across a couple of calls with quite a few people.)</p>",
        "id": 153852899,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1476501858
    },
    {
        "content": "<p>Should use a validity period not 'old' as 'now' is a matter of perspective.</p>",
        "id": 153852901,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1476547381
    },
    {
        "content": "<p>The use of <code>Provenance</code> might work from a data persistence perspective, but if I get a ReSTful GET for a <code>Patient</code>, how do I include the old addresses in the response?</p>",
        "id": 153852940,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476661533
    },
    {
        "content": "<p>Provenance isn't about the actual data, so isn't relevant for the discussion.<br>\nWe have 2 choices here, use the periods, or use the history.<br>\n(the old flag is only there for previous stuff when the periods are not known, but want it recorded)<br>\nDo agree that the concepts are mixed, and we should consider if they should be seperated.</p>",
        "id": 153852945,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476665661
    },
    {
        "content": "<p>Yes. The concepts certainly are mixed; they are orthogonal and should be separated.  We should also bear in mind <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>'s comment about \"now\" being a matter of perspective, although I'm well aware of the challenges of capturing a proper validity period.</p>",
        "id": 153852946,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476667319
    },
    {
        "content": "<p>why should they be separated? Old addresses are retained but flagged as 'old' for patient matching purposes. A full history of addresses for... reseatch... is a different use case</p>",
        "id": 153852948,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476668588
    },
    {
        "content": "<p>Should we at least make the note that old addresses are expected to only be used for home addresses?</p>",
        "id": 153852950,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476670807
    },
    {
        "content": "<p>They should be separated because \"old\" is a different kind of thing to \"home\".  I say it again, the concept of \"old\" is <strong>_orthogonal_</strong> to the use.  (Note that the use should describe the use that the user of the address made of it, not the system recording it.)</p>",
        "id": 153852963,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476691497
    },
    {
        "content": "<p>that's a very theoretical answer, not based in practical use cases</p>",
        "id": 153852969,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476693201
    },
    {
        "content": "<p>So what, because someone somewhere once upon a time was lazy and munged the concepts of time-based status and use, we intend to propagate the bad practice ad infinitum?  I really don't get why you wouldn't want to simply add an extra element here.  The use case is clear and how do you know this is simply theoretical.  (I don't know that it isn't, but I've seen evidence for both.)</p>",
        "id": 153853031,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476751195
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191366\">@Stephen Royce</span> FHIR isn't focused on clarity of modeling as much as it is practicality.  \"Pure\" modeling tends to increase complexity and cost, so it needs to be balanced against real-world needs.  If most systems don't need it and are happy with what they've got, then the few systems that do need a distinct concept are free to do so with an extension.  Profiles and implementation guides are free to nudge implementers towards the more complex solution if they wish.  (And will have more success in that nudging if there's solid use-cases behind doing it.)</p>",
        "id": 153853033,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1476756526
    },
    {
        "content": "<p>I don't know where you get the idea that '\"Pure\" modeling tends to increase complexity and cost.'  That's only true of the initial development of any system.  It is well-known that the more normalised -- \"purer\" -- the underlying data model, the lower the long term costs of maintenance, especially adding new functionality.  The long term maintenance cost savings well outweigh the higher short term initial development costs over the lifetime of the system.</p>",
        "id": 153853035,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476757259
    },
    {
        "content": "<p>\"It is well known\"?  That certainly wasn't our experience with v3 - which was much purer than v2 and much more expensive to implement and maintain</p>",
        "id": 153853036,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1476757437
    },
    {
        "content": "<p>It has been proven by <strong>_decades_</strong> of development experience, and while the learning curve for v3 was certainly steep, the same would have been true of that too.</p>",
        "id": 153853037,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476757489
    },
    {
        "content": "<p>You have to bear in mind as well that  the \"pureness\" of the v3 model was not the problem, it was its level of abstraction.</p>",
        "id": 153853038,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476757558
    },
    {
        "content": "<p>They are not the same thing.</p>",
        "id": 153853039,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476757573
    },
    {
        "content": "<p>The level of abstraction was driven by the purity</p>",
        "id": 153853040,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1476759034
    },
    {
        "content": "<p>If you need to use a data element to hold a blend of concepts, the definition and guidance should make that clear. So defining Address.use as \"The purpose of this address.\" is not helpful. Something like \"The purpose of this address, or this address record (depending).\" is more accurate.</p>",
        "id": 153853053,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1476768746
    },
    {
        "content": "<p>:)</p>",
        "id": 153853054,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1476768780
    },
    {
        "content": "<p>Purity could easily have been achieved without the level of abstraction.  The abstraction was done to avoid the proliferation of classes and is in no way a consequence of attempting to hold to normalisation rules in the data modelling.  I say it again, decades of experience has shown that there are long term savings to be had by using properly normalised data models.  (Having said that, in practice, 4th and 5th normal form provide marginal benefit; 3rd normal form seend to be the ideal.)</p>",
        "id": 153853055,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476769018
    },
    {
        "content": "<p>Old is clearly not a value of use, it is a flag to indicate deprication, and in a manner which overwrites the actual use - work, home etc. So to minimize work and retain value I suggest you use the period, at whatever level of accuracy is known, and stop using 'old'.</p>",
        "id": 153853062,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1476773274
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> I agree.  Unfortunately, the period is often not known beyond the fact that the use is no longer current.</p>",
        "id": 153853063,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476773944
    },
    {
        "content": "<p>I did suggest early on in this thread, though, that an extension for \"out of date\" or similar could be added to <code>period</code>.</p>",
        "id": 153853064,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476774068
    },
    {
        "content": "<p>Not a new issue, put in year 1, 2, 3 or 1960, 1970, 1980 for the period end year so they present in the correct order.</p>",
        "id": 153853065,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1476774136
    },
    {
        "content": "<p>or just leave the period out if you don't know - but an extension is a heavy solution to a common issue.</p>",
        "id": 153853066,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1476774284
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> Q:How is this address to be used?  A: It's an old address no longer valid for the patient but useful for searching purposes</p>\n<p>That seems to fall squarely within the concept of Address.use which describes the circumstances in which a system should make use of a particular address.</p>",
        "id": 153853078,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1476798445
    },
    {
        "content": "<p>Ok, then can I have a code for 'current' for storing my current address?</p>",
        "id": 153853085,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1476802618
    },
    {
        "content": "<p>No, because it is material to know whether that current address is home, work, etc. same with prior addresses. Occupational health, data analysis etc. Why would you throw usefull data away by overwriting with a completely different concept?</p>",
        "id": 153853086,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1476802710
    },
    {
        "content": "<p>I don't think that any one throws useful data away here. And you can always have extensions. What this dsicussion is still lacking is any practical use cases (as opposed to theoretical ones). One of you can always create a task proposing separation of 'old' from the other codes, or following Richard's comment about the definition of the element - but the committee that decides (not Lloyd or I) will ask the same questions we have</p>",
        "id": 153853101,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476819215
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> It is usual in (modern!) CRMs for <code>Address.use</code> to be the use of the address made by the owner or user of the address, not the record keeping use that the system makes of it.  This is never values like \"old\"; it is always values like \"home\" or \"work\".<br>\n<span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> Using fudged dates in the period is not to be recommended; much better to have data elements that tell you what you know and only what you know.  That may well mean you use a code for \"current\" on the current address, although, in practice, you would probably make this the assumed value so that it was only necessary to be explicit about exceptions.</p>",
        "id": 153853114,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476838819
    },
    {
        "content": "<p>\"So when I'm planning an appointment to visit the clients home, the current address can be calculated based on the context here.\" Right, this is the opposite end of the spectrum from old - it is future - but you wouldn't want to obscure or confound your future work and home addresses by having the use of 'future' anymore than you'd want the use of 'old'. Better to keep use pure to how the party (address subject) uses that address, keep the period for those who can support, and if necessary add a status code to convey: depricated, current (active), future, entered-in-error, bad etc.</p>",
        "id": 153853144,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1476861214
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153853145,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1476861246
    },
    {
        "content": "<p>Often you will retain addresses so that you can accurately regenerate as at a point in time in the past, for example to re-print a bill or discharge summary, or so that you can indicate what you knew at the time. Or in Brians case above so that you can act appropriately in a future time.</p>",
        "id": 153853147,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1476861443
    },
    {
        "content": "<p><img alt=\":thumbs_up:\" class=\"emoji\" src=\"/static/third/gemoji/images/emoji/thumbs_up.png\" title=\":thumbs_up:\"> </p>",
        "id": 153853148,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476861827
    },
    {
        "content": "<p>The only thing I was suggesting is that the time status code -- not to be confused with use code -- be made an extension -- if it can't be added to the model -- and I thought inside <code>period</code> would be good, but it could just as well be a sibling.</p>",
        "id": 153853150,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476862014
    },
    {
        "content": "<p>Given that virtually every address will at some point become 'old' I think now is the time to make this a first-order element rather than committing us to having to use an extension 'all the time'. Also, I don't think think the code is exactly the same concept as the period.</p>",
        "id": 153853151,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1476863000
    },
    {
        "content": "<p>Period is a view which is correct from any point in time, the code is only true currently.</p>",
        "id": 153853152,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1476863067
    },
    {
        "content": "<p>its more like the active property in many of the administrative resources.</p>",
        "id": 153853156,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476871121
    },
    {
        "content": "<p>Agreed.</p>",
        "id": 153853157,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1476871175
    },
    {
        "content": "<p>Indeed; that's a good point.  I had thought of the whole thing as \"currency\" which could either be a code or a period, but I like this idea.</p>",
        "id": 153853272,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1476915668
    }
]