[
    {
        "content": "<p>Hi<br>\nWe are looking into address requirements for a Swedish address. Either we are confused, or several of the standard extensions for line are not correct.</p>\n<p>As an example, an address in Sweden will look something like this.</p>\n<p>text: <em>c/o Ibrahimovic, Abba's street 5, #1402, 12345 Stockholm, Sweden</em><br>\ncareOf: Ibrahimovic<br>\nline: Abba's street 5<br>\nunitId: 1402  //this is the apartment number<br>\npostalCode: 12345<br>\ncity: Stockholm<br>\ncountry: Sweden</p>\n<p>There are sometimes a need for multiple lines, but mostly not. There are standard extensions that meet our requirements from an information perspective (careOf <a href=\"http://build.fhir.org/extension-iso21090-adxp-careof.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-iso21090-adxp-careof.html\">http://build.fhir.org/extension-iso21090-adxp-careof.html</a> and unitId <a href=\"http://build.fhir.org/extension-iso21090-adxp-unitid.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-iso21090-adxp-unitid.html\">http://build.fhir.org/extension-iso21090-adxp-unitid.html</a>)</p>\n<p><strong>Problem</strong><br>\nThe extensions for careOf and unitId are not attributes that belong as a sub-elemnt to line, but can be seen as elements on the same level as Postal Code and City. You could argue that you would want to Slice line and have 0..1 careOf and 0..1 unitId, but then we loose interoperability as those would be Swedish specific slices. The same thing goes for another standard extension for streeAddressLine (<a href=\"http://build.fhir.org/extension-iso21090-adxp-streetaddressline.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-iso21090-adxp-streetaddressline.html\">http://build.fhir.org/extension-iso21090-adxp-streetaddressline.html</a>)</p>\n<p><strong>Questions</strong><br>\nHow should we use these extensions? <br>\nWhy are they extending line and not address itself?<br>\nAre there ways of slicing line and connect each slice to these extensions?</p>",
        "id": 161161005,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1553009590
    },
    {
        "content": "<p>text, careOf, unitId would all be repetitions of 'line'.  If you want to have extensions that call out what their purpose is, that's fine.  But the key thing is that if someone just spits out the lines in order, without knowing what they are, that would still give you a valid address.  On the other hand, if you burry the text, careOf and unitId in extensions and don't expose them as lines, then anyone who throws away the extensions would also be throwing away those parts of the address (which would presumably be a bad thing...)</p>",
        "id": 161169420,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553015100
    }
]