[
    {
        "content": "<p>Hi. I'm looking to the community to see what has been implemented for the adjudication category that represents the total amount that the member is responsible for paying. This value represents the sum of amounts from patient pay components like copay, deductible,  and the amount over the member's benefit max limit. If the member is responsible for tax, then the tax amount is also included.</p>",
        "id": 171172648,
        "sender_full_name": "Mona O",
        "timestamp": 1563458452
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span> <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span></p>",
        "id": 171179968,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563462881
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span> Typically the adjudication sates what the insurer will pay (benefit amount) and may state the copay, deductible, eligible amount (max billed amount to be considered) - in general the patient is responsible for the amount billed less the benefit and may state a patient responsibility amount but in fact an insurer cannot really determine the patient responsibility as the patient may have other insurances which will cover some or all of that amount.</p>",
        "id": 171184605,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1563465741
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span> , are you in the US? Are you looking at the values that appear on the remittance and/or the patient EOB?</p>",
        "id": 171189196,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1563469256
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span> I didn't answer your question because you seemed to be looking for input  from the wider community. But I will suggest that if yo haven't, look at what is in the CMS Blue Button 2.0 (which is a profile on EOB) or what is in the Da Vinci Provider Data Exchange (PDex) which is in the current ballot I believe</p>",
        "id": 171191017,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1563470624
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> I'm in the US and looking at EOB.item.adjudication.category. <br>\n<span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span>, Thank you. Unfortunately,  I already looked and didn't see anything on Da Vinici, so if you are aware of something that I have overlooked would you be able to direct me? CMS appears to be using \"Line Payment Amount to Beneficiary\".  Checking to see if there is something more widely used by the community.  Thanks!</p>",
        "id": 171195006,
        "sender_full_name": "Mona O",
        "timestamp": 1563473476
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217847\">@Mona O</span> <br>\nMona, so far, there are no US specific profiles, with US value sets that I found (which doesn't necessarily mean there aren't...). I think Andy's suggestion to review the CMS Blue Button 2.0 work may be helpful, they have included the CMS values used.</p>",
        "id": 171442346,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1563810652
    }
]