[
    {
        "content": "<p>In Loinc, the concept of an HL7 v3's \"Administrative gender\" is coded by <a href=\"https://loinc.org/72143-1/\">72143-1</a>. In FHIR we have the value set <a href=\"http://hl7.org/fhir/ValueSet-administrative-gender.html\">AdministrativeGender</a>. Can this value set considered equivalent to the concept of an administrative gender or is this value set only the set of values allowed for the concept of an administrative gender like the Loinc answer list <a href=\"https://loinc.org/LL2191-6/\">LL2191-6</a>?</p>\n<p>I like to have a coding (preferably) or identifier of the concept of the FHIR administrative gender in the sense of the definition of the value set which is: \"The gender of a person used for administrative purposes.\". </p>\n<p>Background: I like to build an ontology of searchable criteria of FHIR. Other searchable criteria are certain conditions or observations which are all already coded in FHIR. Other non-coded search criteria would be the todays age of a person like Loinc <a href=\"https://loinc.org/30525-0/\">30525-0</a>.</p>\n<p>There are also the search parameters, but I think they are more like a technical artifact instead of a general concept of a search criteria.</p>",
        "id": 224088017,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1611688340
    },
    {
        "content": "<p>What is your ontology intended to be used for?  We are starting to actively discourage use of AdministrativeGender for any sort of clinical use.  Since you mentioned conditions and observations, that hints that maybe you were looking for a clinical use of AdministrativeGender .  The <em>reason</em> we are discouraging AdministrativeGender is that there is not a great definition of what that actually means.  So do these two undefined concepts mean the same thing?  Probably.  But what do these two concepts mean?  Who knows.</p>",
        "id": 224091965,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1611690225
    },
    {
        "content": "<p>If you treat administrative gender as a room occupation category then it appears ok, except that it should belongs to visits instead of patients.<br>\nOverall, if you accept that gender is an observation then every, well most, information systems are wrong. But it would solve the problem from a solution aspect, but would require a massive update process.</p>",
        "id": 224100206,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1611693913
    },
    {
        "content": "<p>There has been a group working on sex/gender topics in HL7 products.  See <a href=\"https://confluence.hl7.org/display/VOC/The+Gender+Harmony+Project\">https://confluence.hl7.org/display/VOC/The+Gender+Harmony+Project</a>.</p>",
        "id": 224103210,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1611695203
    },
    {
        "content": "<p>There is a document that was balloted this month.  I'm not sure where the actual ballot document is, but that confluence page has a link to the draft ballot content we submitted.</p>",
        "id": 224103436,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1611695319
    },
    {
        "content": "<p>IMO, we should ask what is documented. SfCU does not cover that. It is also unclear, what aspect from more than a dozen is recorded.</p>",
        "id": 224110900,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1611698577
    },
    {
        "content": "<p>Eg., transgender and gender identity is not the same, although it is related.</p>",
        "id": 224111174,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1611698647
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191549\">@Frank Oemig</span>  - I don't want to hijak this topic too much with the Gender Harmony stuff, but if you want to chat more on that, should we spin off a new topic?</p>",
        "id": 224112129,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1611699138
    },
    {
        "content": "<p>Of course, we can</p>",
        "id": 224114084,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1611700098
    },
    {
        "content": "<p>But it goes hand in hand. There will not be a solution without recognizing the different aspects.</p>",
        "id": 224114159,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1611700155
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191764\">Cooper Thompson</span> <a href=\"#narrow/stream/179166-implementers/topic/Administrative.20Gender.20Concept/near/224091965\">said</a>:</p>\n<blockquote>\n<p>What is your ontology intended to be used for?  We are starting to actively discourage use of AdministrativeGender for any sort of clinical use.  </p>\n</blockquote>\n<p>Sorry for my late answer. The use case is a feasibility search tool. We will start to search within the <a href=\"https://simplifier.net/forschungsnetzcovid-19\">GECCO</a> dataset. But the search tool should also be able to adapt to other datasets. For GECCO, I was not aware that it already has a <a href=\"https://simplifier.net/forschungsnetzcovid-19/sexassignedatbirth\">Sex assigned at birth</a> observation. So I assumed we have to use administrative gender. For GECCO we can use the Loinc concept <a href=\"https://loinc.org/76689-9/\">Sex assigned at birth</a>.</p>\n<p>The FHIR Spec itself has a good roundup about <a href=\"http://hl7.org/fhir/patient.html#gender\">gender and sex</a> that I wasn't aware of.</p>\n<p>So I consider my question answered, because we most likely will be able to use a specific concept in our search tool. In case a dataset doesn't contain a specific gender or sex concept and the data model is FHIR, we will create our own non-specific administrative gender concept. I don't assume that such a concept is available at existing terminologies, because it is simply not specific enough.</p>",
        "id": 224366461,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1611856598
    },
    {
        "content": "<p>There are some issues to consider around sex assigned at birth.  A few things that come to mind:</p>\n<ul>\n<li>some states in the US allow updates to the birth certificate, and since the birth certificate is typically used as the \"birth sex\", the birth sex you get in FHIR from EHRs may not actually be the observed sex of the patient at birth.</li>\n<li>for transgender patients that undergo transition, sex assigned at birth is almost by definition an inaccurate concept to use for clinical care.</li>\n</ul>",
        "id": 224376017,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1611860607
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>  Thanks for your advice. Our tool will be agnostic regarding concrete search criteria. We only need a codeable concept for each criterion. So my initial question was about such a codeable concept for Patient.gender. Your input regarding the problem around Patient.gender was very helpful. So as long as gender/sex concepts are represented by an Observation, it's not important for us what the exact concept is.</p>",
        "id": 224707571,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1612175144
    }
]