[
    {
        "content": "<p>What is the correct way to implement advance directive in FHIR? In the case, where the patient (individual) has recorded his Advance Directive as a voice recording or video recording, how will this be captured? <br>\nAs I was digging through the documentation it seemed like it could be a FHIRDocument where Composition.class (<a href=\"https://hl7-fhir.github.io/composition-definitions.html#Composition.class\" target=\"_blank\" title=\"https://hl7-fhir.github.io/composition-definitions.html#Composition.class\">https://hl7-fhir.github.io/composition-definitions.html#Composition.class</a>) has a code -&gt; [LP173409-6  Advance directive]. Is my interpretation correct?  But still not sure how to capture the format or a reference to where the recording is stored. </p>",
        "id": 153819888,
        "sender_full_name": "Gana Pemmanda",
        "timestamp": 1459792726
    },
    {
        "content": "<p>Document is a way of packaging information - Composition is just the table of contents.  Consent is being modeled right now as a profile on Contract.  My guess is that AdvanceDirective would be managed in the same way (though there are some who have wondered whether separate resources for things like Consent might be better).</p>",
        "id": 153819929,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459819365
    },
    {
        "content": "<p>Thanks Lloyd! I will look into Consent Directive..</p>",
        "id": 153819999,
        "sender_full_name": "Gana Pemmanda",
        "timestamp": 1459902221
    },
    {
        "content": "<p>Advance directives vary greatly. Consent + questionnaire might well be the best way to handle this</p>",
        "id": 153820387,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1460062414
    },
    {
        "content": "<p>Thanks Grahame.. Will explore further.</p>",
        "id": 153820444,
        "sender_full_name": "Gana Pemmanda",
        "timestamp": 1460087876
    },
    {
        "content": "<p>Consent Directive is -- PRIVACY Consent Directive. We are not developing for all directives. Just Privacy Consent Directive.   It is possible that there is something re-usable, but possibly not. Most different is that an Advanced Directive is not necessarily a 'Contract', but rather a legal statement. </p>",
        "id": 153821200,
        "sender_full_name": "John Moehrke",
        "timestamp": 1460465294
    },
    {
        "content": "<p>So is a DNR,but that can be handled via contract, and contract does allow you to reference questionaire answers.</p>",
        "id": 153821240,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1460471306
    },
    {
        "content": "<p>Trying to figure out how an Advance Directive would get expressed in a FHIR Resource. A colleague pointed me to to Flag. I guess this could work with the appropriate code value. Anyone else looking at this?</p>",
        "id": 153830020,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1464279043
    },
    {
        "content": "<p>And just found this tracker item: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=7871\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=7871\">GF#7871</a></p>",
        "id": 153830021,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1464279188
    },
    {
        "content": "<p>I don't know of anyone that has taken that usecase up. It is explicitly not in the scope of the current Consent, which is Privacy focused. Not sure what workgroup would best handle it. Not sure it is urgent enough to have a FHIR resource specific to it.</p>",
        "id": 153830022,
        "sender_full_name": "John Moehrke",
        "timestamp": 1464280025
    },
    {
        "content": "<p>Flag would allow you to indicate that an advanced directive exists, but I think the content of it would need to be elsewhere.  I don't think it's the same thing as Consent.  What need do you have for discrete data.  If a PDF is good enough, your Flag could point to a Binary.</p>",
        "id": 153830093,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464303728
    },
    {
        "content": "<p>interesting flag doesn't have a mechanism to point to resource (other than the author and subject, and the \"encounter\". The encounter being defined \"This alert is only relevant during the encounter.\" so that doesn't allow pointing to an AHD directive...  </p>",
        "id": 153830127,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464304774
    },
    {
        "content": "<p>It does, but it's an extension at the moment.  We didn't think most systems that have flags have the capacity for a detailed link.</p>",
        "id": 153830131,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464304910
    },
    {
        "content": "<p>(Click on Profiles to see the common extension profile.)</p>",
        "id": 153830132,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464304925
    },
    {
        "content": "<p>I think that there's plenty of interest around advance directives at the policy level, and i've got personal experience with them. But mostly, they are questionnaires, and I'm not aware of any need to have the information in them be generally computable. mainly I would think, the data wouold be useful for secondary analysis, so I would argue that a questionnaire meets the needs. Happy to be corrected in theis regard</p>",
        "id": 153830293,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464385205
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Perhaps I'm misunderstanding but wouldn't comutability be valuable if the specific procedures not to be implemented (i.e.: No intubation, no IV fluids, etc.) are encoded so that an alert would fire if one was ordered while in the hospital?</p>",
        "id": 153830974,
        "sender_full_name": "Robert McClure",
        "timestamp": 1464795724
    },
    {
        "content": "<p>The measure for FHIR is : What are systems doing today... not what might they do in the future. So what level of computable processing are systems doing today with regard to Advanced Directives?  FHIR can always add extensions, and then make them core...  </p>",
        "id": 153830975,
        "sender_full_name": "John Moehrke",
        "timestamp": 1464798255
    },
    {
        "content": "<p>Rob, maybe so. but I'm not aware of any practice in this regard now. </p>",
        "id": 153831073,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464821462
    },
    {
        "content": "<p>Does anyone have any thoughts on where Advance Directives go or whether they deserve a resource of their own?  Are these part of CarePlan resource in some way?</p>",
        "id": 153860781,
        "sender_full_name": "Keith Boone",
        "timestamp": 1480963568
    },
    {
        "content": "<p>officially this is scoped in the Consent resource, but we say that the use of this is not investigated, and we might change our minds</p>",
        "id": 153860831,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480967078
    },
    {
        "content": "<p>it would be good for some one and committee to take on doing requirements analysis</p>",
        "id": 153860833,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480967097
    }
]