[
    {
        "content": "<p>In (STU 3) I see mention that the Consent resource is apparently the mechanism to express an Advance Directive. The docs also imply that this has not really been fleshed out. Does anyone see what the basic mechanism might be to specify a DNR, and in particular to specify conditional DNR?</p>\n<p>I see that consentcategorycodes can have a value of advance-directive, and purpose-of- use is extensible. However, I don't see that there are values to specify a DNR. </p>",
        "id": 153844457,
        "sender_full_name": "Keith Welch",
        "timestamp": 1471622053
    },
    {
        "content": "<p>You may also want to check out the Consent Profile on Contract in the MAy 2016 Connectthon 12/ Pre-STU3 version to see if that allows tyou to better express a DNR so that you can provide feedback to the CBCC committee which is working on this material.</p>",
        "id": 153844464,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1471625344
    },
    {
        "content": "<p>yes, it has not been fleshed out. It's on the future path. Wnat do you need to express for a DNR? </p>",
        "id": 153844481,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471641893
    },
    {
        "content": "<p>As of today, I have been told that DNRs may actually specify one or more criteria, some as specific as \"DNR on cardiac arrest\", or \"DNR on cessation of respiration\", or as general as \"DNR if found unresponsive\", with the possibility of multiple criteria. I expect that concept is news to some people - as it was to me. I thought there was only one type. I see the motivation, though. Those paying an attorney for something beyond the basic template DNR document seem to desire more control over the circumstances triggering the directive.</p>",
        "id": 153844488,
        "sender_full_name": "Keith Welch",
        "timestamp": 1471646101
    },
    {
        "content": "<p>What about DNR as an observation and a SNOMED CT problem/clinical finding as an answer?</p>",
        "id": 153844489,
        "sender_full_name": "Michael Osborne",
        "timestamp": 1471646338
    },
    {
        "content": "<p>This is why DNR is a subset of ACD, and ACD's a full of if ... then... else... but...</p>",
        "id": 153844491,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471647559
    },
    {
        "content": "<p>I may actually be distributing DNRs en masse at some time in the future. A practical problem with that is that I can send out transactions all day long, but if someone's EHR receives \"just another observation\" it may be ignored. One might hope that the Consent would be prioritized in way appropriate to the gravity of a patient's legal expression of a desire to be allowed to die. For instance, documents of the CCD/CDA/C-CDA lineage might have an Advance Directive section, that I believe will be seen, as opposed to me placing coding that up as an observation, somewhere, which may not.</p>",
        "id": 153844492,
        "sender_full_name": "Keith Welch",
        "timestamp": 1471647587
    },
    {
        "content": "<p>it's also far from obvious to me what the payoff of computability would be, which is using Contract per <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> remains an option</p>",
        "id": 153844493,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471647602
    },
    {
        "content": "<p>I hadn't considered the Contract, after seeing a mention of DNR on the Consent documentation. I suspect that a DNR is a contract of some sort, perhaps with the State, since it can be portable between clinicians. </p>",
        "id": 153844494,
        "sender_full_name": "Keith Welch",
        "timestamp": 1471649757
    },
    {
        "content": "<p>Computability would/may allow the system to block violations of Consents.</p>",
        "id": 153844521,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1471718462
    }
]