[
    {
        "content": "<p>Hi. If AdverseEvent is an event, how does \"actuality=potential\" work? what information is it supposed to transmit?</p>",
        "id": 154010152,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1539843863
    },
    {
        "content": "<p>in other words, what would be an example of an event that is a \"potential adverse event\"?</p>",
        "id": 154010153,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1539844030
    },
    {
        "content": "<p>Just a guess: An unsafe situation, which might lead to an adverse event or to a near miss. The outcome is not yet fixed, but the unsafe situation is noticed. Is that a likely explanation?</p>",
        "id": 154010155,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1539844522
    },
    {
        "content": "<p>As originally envisaged, it is for whether this is something that happened (water was spilled, regardless of if anyone slipped) versus something nearly happening, in an actual case (tap left running, but not actually a spillage problem). </p>\n<p>So yes a near miss or a unsafe situation that arose.</p>\n<p>It is not meant for theoretical events - risks. (e.g. be careful with water sources because people can slip)</p>\n<p>However we do need something for that type of thing, for use in \"undesirable effects\" for medication definitions. I considered re-using AdverseEvent there but it is too concrete, in its current form (and I'm not really suggesting we change it).</p>",
        "id": 154010169,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1539856596
    },
    {
        "content": "<p>Agree that adverseEvent should not be used for undesirable effects. <br>\nJust finished a pharmacovigilance discussion where this distinction was really needed.</p>",
        "id": 154010176,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1539863693
    },
    {
        "content": "<p>there is this now, as a starter: <a href=\"http://build.fhir.org/medicinalproductundesirableeffect.html\" target=\"_blank\" title=\"http://build.fhir.org/medicinalproductundesirableeffect.html\">http://build.fhir.org/medicinalproductundesirableeffect.html</a></p>",
        "id": 154010191,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1539872883
    }
]