[
    {
        "content": "<p>Hi All,<br>\nI was looking for some documentation or link that would clarify how to achieve the below in Questionnaires.</p>\n<ol>\n<li>How to provide an additional text for answers in a choice so that users of the application can get more details about the answer?</li>\n</ol>\n<p>For example, if I have a question like \"What is your ethnic group?\" and the choices are White or Asian, can I provide further details like White (Includes additional details around white) and Asian (Includes additional details around Asian)</p>\n<ol start=\"2\">\n<li>Provide intermediate save points for questions?</li>\n</ol>\n<p>For example, If I have 10 questions and want to save all the responses until question 3 and then all the responses until question 7, is there a way to indicate to the application using Questionnaire?</p>\n<ol start=\"3\">\n<li>How to provide an open-choice but instead of Others as text use different text?</li>\n</ol>\n<p>For example, If the question \"Which of the following best describes you?\" has the answers like Male, Female and Others (get the text field here). Is it possible to change the text from Others to Prefer to self-describe?</p>\n<p>Thanks.</p>",
        "id": 250650946,
        "sender_full_name": "Rajiv Iyer",
        "timestamp": 1629912038
    },
    {
        "content": "<ol>\n<li>Nested question with an 'enableWhen' tied to certain answers.  E.g. \"Enable this if answer to parent is 'other'\"</li>\n<li>Typically the user or system can save an incomplete form at any point.  If you wanted a standard extension that says \"Please save when the user gets this far\", you could submit a change request.</li>\n<li>Don't really understand the question.  Users can't change the list of options.  If it's an 'open' question, then they can type their own text if they don't like any of the options provided.  (Or if it's a repeating question, they can select some options and then also provide a few free text entries as well.)  If it's a closed question, you can also have a nested question to capture additional details if they select certain options.</li>\n</ol>",
        "id": 250668577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629919393
    },
    {
        "content": "<p>Hello! I am currently working on a Questionnaire profile and want to enable items to have type=reference. However, I want to be more explicit by saying that the item values can only be references of observations, conditions and procedures. Is there anyway to define this in a Questionnaire profile? Or should this be part of the QuestionnaireResponse profile?</p>",
        "id": 250765335,
        "sender_full_name": "Rebecka Hansson",
        "timestamp": 1629981882
    },
    {
        "content": "<p>Hello  <span class=\"user-mention\" data-user-id=\"309003\">@Rebecka Hansson</span>,<br>\nnormally you would not profile a questionnaire, but create the resource itself. Therefore my first question: Are you sure you need a profile, or do you need the questionnaire resource?<br>\nAlso for questions about questionnaire, there is a <a class=\"stream\" data-stream-id=\"179255\" href=\"/#narrow/stream/179255-questionnaire\">#questionnaire</a> stream here. There you might get further information for your question. Probably a similar question was asked there.</p>",
        "id": 250765794,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1629982137
    },
    {
        "content": "<p>There are a set of extensions defined in the <a href=\"http://build.fhir.org/ig/HL7/sdc/behavior.html\">SDC</a> implementation guide that allow you to constrain what's allowed in a Reference (what resources, what profiles the resources must be valid against, what query to use to find candidates, etc.)</p>",
        "id": 250786546,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629990114
    }
]