[
    {
        "content": "<p>The HL7 affiliate agreement requires ballots for 'localization' of HL7 standards. It's also explicit that we're not allowed to create a 'localization' of FHIR, but that we can create a Base Implementation Guide for the locale.</p>\n<p>Does this mean that the decision of whether or not to ballot the Base Implementation Guide is at the discretion of the affiliate?</p>",
        "id": 218681086,
        "sender_full_name": "Dunmail",
        "timestamp": 1606994892
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 218712227,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607010490
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 218713462,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1607010995
    },
    {
        "content": "<p>IMHO I you want to state that the HL7 Affiliate 'approves' / 'owns' a specification, then you SHALL comply with ANSI rules and have a balloting process. If the document is 'owned' by some third party, then the affiliate could republish it jointly with its own comments/opinion, but that of course doesn't turn it into a \"HL7\" or \"HL7 Affiliate\" publication. I expect that the HL7 GOM and the Affiliate Agreement will contain the formal wording.</p>",
        "id": 218802392,
        "sender_full_name": "René Spronk",
        "timestamp": 1607068744
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> Unfortunately the affiliate agreement is ambiguous about this!</p>",
        "id": 218820937,
        "sender_full_name": "Dunmail",
        "timestamp": 1607081238
    },
    {
        "content": "<p>I guess <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> is right: the important issue is to have a ballot according to the published rules. Otherwise it is a proprietary specification owned and governed by an external party.<br>\nHQ insists on that to ensure appropriate quality.</p>",
        "id": 218832853,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1607088943
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191549\">@Frank Oemig</span> Affiliate agreement:<br>\na) requires ballot on 'localization'<br>\nb) prohibits 'localization' of FHIR<br>\nc) reserves right the affiliate to publish a Base Implementation Guide.</p>\n<p>Req b) means that Base IG is not a 'localization' and consequently req a) doesn't apply. The current published rules for the UK affiliate don't include provision for balloting an IG. We want to update the bye-laws to include this provision but aren't clear whether this is a SHALL, SHOULD or MAY.</p>\n<p>I don't disagree with the principle but it would be helpful if we could easily track back from affiliate agreement to the requirement</p>",
        "id": 218834566,
        "sender_full_name": "Dunmail",
        "timestamp": 1607089813
    },
    {
        "content": "<p>In case of doubt, follow the spirit of the HL7 GOM. This reflects the ANSI (ballotting) requirements that apply to <a href=\"http://HL7.org\">HL7.org</a>, but also to its affiliates.</p>",
        "id": 218834788,
        "sender_full_name": "René Spronk",
        "timestamp": 1607089971
    },
    {
        "content": "<p>ANSI is a US organization and, as such, there is no way that its requirements can be legally enforced in an Affiliate Country. The GOM is the Governance &amp; Operations Manual for HL7 International - not Affiliates. Whether, or not, to ballot an IG published within an Affiliate is a decision to be made by each Affiliate, in conjunction with its members and other stakeholders. If an individual Affiliate wishes to amend its regulations to mandate the balloting of a FHIR Base IG all well and good but, IMHO, it's not practical (e.g. enforceable) for this to be required by the Affiliate Agreement.</p>\n<p>The fact that the Affiliate Agreement does not mandate something does not make it 'ambiguous' -it simply means that it is not mandatory! However, I do believe that it would be helpful if the next version of the Affiliate Agreement - due to be created by the end of 2021 - contains a definition of the term 'localization' in relation to HL7 FHIR as this is certainly open to interpretation.</p>",
        "id": 218891481,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1607116080
    },
    {
        "content": "<blockquote>\n<p>requires ballot on 'localization'</p>\n</blockquote>\n<p>This is a hang over from the RIM, where HL7 affiliates had the right - never used, as far as I know - to publish their own variants of it. Were they to do so, they had to hold a public ballot.</p>\n<p>Affiliates do not have the right to publish their own variations to the base standard</p>\n<p>Affiliates can publish translations of the base standard. I know of some affiliates and some other countries that have done this, but they are not complete (to my knowledge) and haven't been subject to ballot. I don't know that HL7 has ever taken any position on this. I think that given the problems FHIR has posed for language translation in my experience (I've had professional and amateur translators for Spanish, Chinese, Russian, Vietnamese, Thai, and Korean - I strongly prefer amateurs), it should be very mush necessary for a public comment/correction framework to be in place</p>\n<p>Given the above interpretation of 'localization' - which I am sure is the correct on based on the history, HL7 has made no rules about affiliate process for publishing base/core implementation guides for their jurisdiction. I very much wish we would; the affiliates represent a very wide ranging set of capabilities and reputation, and they represent HL7's product and brand in their area. It is critical that HL7 has some formal agreements for this with the affiliates</p>",
        "id": 218892370,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1607116648
    },
    {
        "content": "<p>we do say - but I don't think we can really enforce - that only affiliates have the right to designate the base/core IG for their jurisdiction, but paired with the is the unspoken (it should be though) requirement for the affiliate to collaborate with their appropriate jurisdictional authorities to create and publish that IG. Usually, there will be a better organization to publish this than the affiliate itself</p>",
        "id": 218892543,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1607116769
    },
    {
        "content": "<p>It might be helpful to have examples of these 'variations' - beyond what's covered by existing trademark and licensing restrictions. For example , would adding Custom Resources be considered a variation?</p>\n<p>We need to create a consensus about any rules for publishing base/core national FHIR IGs and, if  that's reached, add them to the next Affiliate Agreement. Grahame's comment about affiliate diversity also feeds into the work of the HL7 International Task Group that's examining the Affiliate Model. All input into that debate is welcome. For example - what functional roles should affiliates perform and is it reasonable to expect all affiliates to fulfill them to a level specified by HL7 International? Maybe we need an Affiliate Maturity Model related to demonstrable capability and capacity - many affiliates do little more than the bare minimum of paying fees and submitting an Annual Report.</p>\n<p>Given that, in some countries, much of the capability around the use of the current tooling for creating and publishing IGs sits with Affiliate Board Members, I think that at the moment some Affiliates are actually the best organization to physically create and publish a Base  National FHIR IG. However, in terms of accreditation, co-branding with a national standards organization  might be preferable (and we've already discussed this in NZ).</p>",
        "id": 218896930,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1607119403
    },
    {
        "content": "<blockquote>\n<p>Affiliates are actually the best organization to physically create</p>\n</blockquote>\n<p>very definitely yes </p>\n<p>But that doesn't mean that the affiliate has the appropriate authority it needs partnerships</p>",
        "id": 218904714,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1607124779
    },
    {
        "content": "<blockquote>\n<p>would adding Custom Resources be considered a variation?</p>\n</blockquote>\n<p>very much so.</p>",
        "id": 218904735,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1607124791
    },
    {
        "content": "<p>Anything that alters the meaning of conformance to the base standard is a variation</p>",
        "id": 218904785,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1607124820
    },
    {
        "content": "<p>I.e. Affiliates are not allowed to create custom resources.  (At least not if they want to say that what they're publishing is FHIR)</p>",
        "id": 218908811,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607129141
    },
    {
        "content": "<p>Is a requirement that Base/Core IGs must be balloted in a some kind of a consistent manner something that most people would consider reasonable on principle? </p>\n<p>What are the barriers for this to happen? Would the availability of a balloting infrastructure that each affiliate can use something that will help with such a requirement?</p>",
        "id": 218909637,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1607130120
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/179166-implementers/topic/Affiliate.20publication.20of.20Base.20Implementation.20Guide/near/218909637\">said</a>:</p>\n<blockquote>\n<p>Is a requirement that Base/Core IGs must be balloted in a some kind of a consistent manner something that most people would consider reasonable on principle? </p>\n<p>What are the barriers for this to happen? Would the availability of a balloting infrastructure that each affiliate can use something that will help with such a requirement?</p>\n</blockquote>\n<p>Good questions.  Such a requirement might be difficult for some affiliates to implement; for example where a partner organization (e.g. National Standards Body) has a different process. Certainly, the provision of a common balloting infrastructure by HL7 International would greatly help those affiliates wishing to ballot IGs - but as for a common set of rules around participation, quoracy, majorities, negative votes, etc, I'm not sure, and will an Affiliate (members only?) ballot be sufficient to represent the buy-in of all stakeholders in a given country?</p>",
        "id": 218912455,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1607133858
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Affiliate.20publication.20of.20Base.20Implementation.20Guide/near/218908811\">said</a>:</p>\n<blockquote>\n<p>I.e. Affiliates are not allowed to create custom resources.  (At least not if they want to say that what they're publishing is FHIR)</p>\n</blockquote>\n<p>Presumably that rule doesn't just apply to Affiliates!  It's certainly the message that HL7NZ has put across to the local community and just the kind of prescriptive statement that's needed as an example of a FHIR  variation that comes under the definition of 'localization' in the Affiliate Agreement.</p>",
        "id": 218912637,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1607134168
    },
    {
        "content": "<p>Right.  It applies to everyone.  The key point is that affiliates don't get a free pass.</p>",
        "id": 218913419,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607135453
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Affiliate.20publication.20of.20Base.20Implementation.20Guide/near/218913419\">said</a>:</p>\n<blockquote>\n<p>Right.  It applies to everyone.  The key point is that affiliates don't get a free pass.</p>\n</blockquote>\n<p>...nor members of the FHIR Core Team. :)</p>",
        "id": 218913682,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1607135866
    },
    {
        "content": "<div class=\"message_inline_image\"><a href=\"https://s.studiobinder.com/wp-content/uploads/2019/08/Michael-Jackson-Popcorn-GIF.webp?resolution=1680,2\"><img src=\"https://s.studiobinder.com/wp-content/uploads/2019/08/Michael-Jackson-Popcorn-GIF.webp?resolution=1680,2\"></a></div>",
        "id": 218929133,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1607164034
    },
    {
        "content": "<p>This discussion is awesome - and really relevant for the current situation - at least in DK as it sums up a lot of points that we have recently been talking about - and I agree to a lot of the points made here. Just the phrase about what it actually means that the affiliate 'approves something/a core/base IG' is a hard topic to agree on and requires a lot of buy-in from all members of the affiliate (which hopefully and usually contains members of the national authorities).</p>",
        "id": 218929296,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1607164334
    },
    {
        "content": "<p>In the DK affiliate we do ballots - but not primarily because it is formulated in the GOM or any affiliate agreement - we ballot because the balloting process is a natural proces of determining whether we agree on the content or not</p>",
        "id": 218929367,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1607164492
    },
    {
        "content": "<p>Affiliates are able to use the HL7 balloting process, in principle, but there are process issues, mostly from the fact that it hasn't been done.</p>",
        "id": 219028446,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1607295486
    },
    {
        "content": "<p>Affiliates are also able to use HL7 publishing infrastructure; this is a more worked out process.</p>",
        "id": 219028449,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1607295501
    },
    {
        "content": "<p>We seem to be focusing on how to exert control over the development and adoption of IGs... which is a distinct and not insignificant jump in scope from just focusing on the base standard (which is the typical purview of an international SDO). <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  has noted (correctly, in my view) that <strong>partnerships</strong> are needed. +1 on that; the HL7 Affiliate is not likely to be the sole national digital health governance authority. As <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> pointed out... Affiliate balloting can play a role in consensus-building. Maybe the upcoming revisiting of the Affiliate agreements should focus on how to support and operationalize this consensus-building; on enablement rather than on enforcement? Just a thought... <span aria-label=\"rolling eyes\" class=\"emoji emoji-1f644\" role=\"img\" title=\"rolling eyes\">:rolling_eyes:</span></p>",
        "id": 219028452,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1607295508
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193307\">Derek Ritz</span> <a href=\"#narrow/stream/179166-implementers/topic/Affiliate.20publication.20of.20Base.20Implementation.20Guide/near/219028452\">said</a>:</p>\n<blockquote>\n<p>Maybe the upcoming revisiting of the Affiliate agreements should focus on how to support and operationalize this consensus-building; on enablement rather than on enforcement?</p>\n</blockquote>\n<p>To some extent, this is covered by the <a href=\"https://confluence.hl7.org/display/FHIR/FHIR+Community+Process\">FHIR Community Process</a> which currently states that...</p>\n<blockquote>\n<p>The HL7 Affiliates are also candidates for FCP Participants, and should sign up to participate in the FCP Participant. Note that due to the very flexible arrangements between HL7 and the affiliates, there is no common process for affiliates to follow, and each Affiliate would need to choose to be a FCP Participant individually.</p>\n</blockquote>\n<p>Whether the next Affiliate Agreement should refer to the FCP and make a prescriptive statement on participation is up for discussion. Ideas on how it might be supported - and by whom - are also welcome. Building consensus around standards implementation is a process that varies considerably from country to country and often within the same country (e.g. when the membership of governance bodies changes).</p>",
        "id": 219030179,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1607298042
    },
    {
        "content": "<p>What about processes where comments are collected, but no votes counted?</p>",
        "id": 219056285,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1607332784
    }
]