[
    {
        "content": "<p>Hi! What would be the most simple way to put age to observation. I tried to find extensions from simplifier but didn't find exactly appropriate for my use. I need to store age at the moment of examination. I have patients age in patient resource but i would need this extra one for observation. Feels like common thing You need but didn't find examples. Any help would be very much appreciated.</p>",
        "id": 154396979,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1546591243
    },
    {
        "content": "<p>I believe the most common scenario for this is that you have the patient's birth date in Patient resource and you derive the age at the time of the observation from that, based on the effective time of the observation. Does that scenario not suit you?</p>",
        "id": 154405306,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1546604333
    },
    {
        "content": "<p>Do you specifically need the age to be stored within the Observation resource, for consumers of that resource not to require access to the patient resource, for instance?</p>",
        "id": 154405405,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1546604461
    },
    {
        "content": "<p>Calculating age from birthdate and effectiveDateTime is my second choice. Actually 1st version from screening study makes that already. Now I'm expanding our software to support serial monitoring studies and age in observation itself would be more useful in that. 1st I thought this would be common thing to make. But it seems not...</p>",
        "id": 154405965,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1546605287
    },
    {
        "content": "<p>Storing age with observations is pretty uncommon as you typically have the birth date available (along with gender) as part of the demographic information.  If there's a particular subtype of observation where capturing age as part of the observation is typical, it could go as a component.  Other than that, an extension is an option.  But certainly the preferred approach is to just calculate it based on effectiveTime and date of birth.</p>",
        "id": 154412901,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546613065
    }
]