[
    {
        "content": "<p>Hi, I'm looking to sanity check our proposed solution to a problem I would image is quite common in this space. We are looking at creating a single FHIR interface that will aggregate multiple distributed non-FHIR databases. The databases are hosted in different locations and have different schemas. So we are proposing to use an agent, co-located with each database to fulfill the read and write requests. The FHIR requests will be accepted at the interface and forwarded along to each respective agent using an event bus and the agents will be partitioned by an organization identifier that will have to be used on the request. The agents will be responsible for translating the fhir request to their respective database schemas. My first question is, is this a common enough problem that there is some best practice guidance available? Secondly, that would be a good format to serialize the FHIR requests to, or is there any downside to leaving them as raw http requests?</p>",
        "id": 257284757,
        "sender_full_name": "Bart Dutkowski",
        "timestamp": 1634079623
    },
    {
        "content": "<p>there's previous discussion here. I don't think we've published anything, but your issues are all around identity management and mixed security models, nothing to do with format</p>",
        "id": 257287017,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634081048
    },
    {
        "content": "<p>My company has the same scenario. For the most part I don't think FHIR is in a position to say anything about how you handle internal data gathering. FHIR defines the interface on your outer edge. How the API works and how the data is formatted/coded. All the gyrations that you have to go through to get the data to the edge is outside of FHIR scope. </p>\n<p>Personally I think the sooner you can get the data into FHIR format the better you'll be long term. i.e. the owner of the data translates the internal schema format into FHIR compliant resources. Otherwise when you are 2-3 levels removed you start asking questions like, \"I think this value is supposed to be category, but I don't know what 'A' is supposed to represent.\"</p>",
        "id": 257353951,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1634127024
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"404080\">@Bart Dutkowski</span>  - Firely's FHIR server has the ability to add plug-ins that could perform this type of facade to aggregate data from multiple 'back-ends' and present the results as FHIR.  <a href=\"https://fire.ly/products/firely-server/\">https://fire.ly/products/firely-server/</a></p>",
        "id": 257356394,
        "sender_full_name": "John Silva",
        "timestamp": 1634128119
    },
    {
        "content": "<p>AWS FHIR Works has a Persistence interface that you can implement to build custom data solutions like this one as well. We looked at doing this but ended up coming to the same conclusion that <span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span> came to in that it's actually just easier to hard migrate the system of record to a FHIR data store. The ability to support FHIR bundles across multiple data stores means you need distributed transactions and with AWS FHIR Works search is done through OpenSearch so you'd have to sync to indexes in OpenSearch or implement your own search interface.</p>\n<p><a href=\"https://github.com/awslabs/fhir-works-on-aws-interface/blob/mainline/src/persistence.ts\">https://github.com/awslabs/fhir-works-on-aws-interface/blob/mainline/src/persistence.ts</a></p>",
        "id": 257364955,
        "sender_full_name": "Mike Lohmeier",
        "timestamp": 1634131776
    },
    {
        "content": "<p>Hi everyone, thanks for all your input. <span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span>, I agree that it would be best that the source system move to FHIR but unfortunately this is unlikely to happen this decade so we are stuck aggregating and translating the data ourselves. I also totally agree that the interface at the edge of our system would be FHIR, I was just wondering if there were any practical advantages to keeping the internals of the system as FHIR too. One advantage I thought of was that FHIR will likely have better tooling and documentation than any intermediary data format we have, so it would be easier to use FHIR within our system. Our search requirements are quite specific, so we will always be searching withing a single patient context meaning that our indexing requirements are quite limited.</p>",
        "id": 258656935,
        "sender_full_name": "Bart Dutkowski",
        "timestamp": 1634873054
    },
    {
        "content": "<p>I don't know as it's a practical advantage or not, but it's my belief that every layer of translation is another layer of errors. This 1st layer only transposes 1 attribute, the next layer only transposes 1 attribute...by the time you get to the end it's junk. At least with a common interface between layers you aren't trying to match definitions between data formats it's a-&gt;a-&gt;a-&gt;a all the way through. Yes somebody has to say fhir.a-&gt;sql table X col Y but it's pretty simple if you know that then you probably know the reverse.</p>",
        "id": 258701833,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1634904342
    }
]