[
    {
        "content": "<p>In several cases, FHIR status values do not accurately reflect the semantics of VA status values. <br>\nWe have tried using \"Broader-than\" mappings to support required FHIR properties (e.g., for medications, \"on-hold\" for \"active suspension\" or \"stopped\" for \"discontinued\"), but these mappings have caused alarm for the clinical users who see the terms as incorrect. </p>\n<p>It is clear that we will need extensions to handle the specific VA status semantics. The question is whether it makes sense to populate the FHIR property in cases where we have a broader (or even exact) match, and to only DAR values where this is impossible, or to simply DAR the status field altogether, as impossible to populate consistently and of limited and risky value where present.</p>",
        "id": 161916767,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1553738934
    },
    {
        "content": "<p>are the problems with the definitions or the display values?</p>",
        "id": 161919840,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553742917
    },
    {
        "content": "<p>If there's a required binding, you can't use DAR.  (And there's generally a required binding for status elements).  Sharing data externally with just an extension for status is useless - no-one else can do anything with the data, so there's no point in sharing it.  Sending \"on-hold\" or \"stopped\" seems perfectly appropriate and semantically correct.  The question isn't whether the users are happy with the FHIR terms.  The question is whether they foresee clinical harm resulting from sharing the instance with the codes as they are defined.</p>",
        "id": 161922728,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553746766
    },
    {
        "content": "<p>Thanks Lloyd. Clarification: in DSTU2, MedicationDispense.status is 0..1, so I believe we have an out there, irrespective of binding strength.</p>\n<p>MedicationOrder.status is 1..1 code required: you're saying that in this case, DAR is not an option. The Terminology page doesn't go into this, and the DAR page doesn't explain how it manages to contravene prior requirements, or its limits. I think that's a gap.</p>\n<p>For the examples above, there may be a communication strategy for specifying that the VA values are correct and that the FHIR values are approximations (and shouldn't be displayed to anyone who depends on the distinction and doesn't understand and agree to the maps). (I'm not sure what it is, but it's conceivable.) I'll work with the SMEs to define approved maps, but I can't assume that will be possible.</p>",
        "id": 161952371,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1553780252
    },
    {
        "content": "<p>If you have specifics about how you want data displayed to the end-user, reflect that in the narrative.  When exposing to systems outside your organization, you have to assume they won't know any of your business rules and may not recognize any of your extensions.  (In fact, they might not even process some of the core elements.)  The key purpose of the discrete data is computer-to-computer processing, decision support, retrieval, etc.  Narrative supports the human-to-human piece.</p>",
        "id": 161957730,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553783405
    }
]