[
    {
        "content": "<p>Hi, I’m currently looking at modelling primary care data using FHIR and have a particular question regarding the AllergyIntolerance resource. A common way of representing allergies in GP care management systems is to record the allergy or adverse reaction as a coded statement e.g. ‘Adverse reaction to penicillins’ (SCTID: 292954005). The actual substance responsible for the adverse reaction is not recorded and a mapping may or may not exist in the source system. Even if a substance mapping does exist, it feels right that the original statement should also be preserved. The AllergyIntolerance resource drives you down the route of recording a substance, which I think is actually a much more solid approach. However, this does result in a disparity when trying to model the GP data. I’m struggling with which way to go when creating a Structure Definition to best represent this model. Any thoughts or ideas regarding direction would be greatly welcomed.</p>",
        "id": 153813879,
        "sender_full_name": "Jonathan Homer",
        "timestamp": 1457019289
    },
    {
        "content": "<p>But substance can be a class - could you not just use that?</p>",
        "id": 153813880,
        "sender_full_name": "David Hay",
        "timestamp": 1457023774
    },
    {
        "content": "<p>David, thanks for the reply. I had interpreted ‘class’ as being a class of substances, for example Penicillin is a class of antibiotics substances. The above coded example ‘Adverse reaction to penicillins’ is actually a disorder as opposed to a substance or a class of substances. However, my interpretation could well be wrong?</p>",
        "id": 153813885,
        "sender_full_name": "Jonathan Homer",
        "timestamp": 1457026814
    },
    {
        "content": "<p>I was imagining (rightly or wrongly) that a substance class could be 'Penicillins'  - thus meeting your use case...</p>",
        "id": 153813887,
        "sender_full_name": "David Hay",
        "timestamp": 1457039982
    },
    {
        "content": "<p>@Jonathan Homer  'Adverse reaction to penicillins' is a fully defined concept in SNOMED CT and, as such, has a causative agent attribute of  'Penicillin -class of antibiotic- (substance)' (SCTID: 373270004). Therefore the SNOMED CT expression derived from the Stated Concept Definition provides the relevant substance class. All fine, IF your system understands SNOMED CT compositional grammar!</p>",
        "id": 153813890,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1457057336
    },
    {
        "content": "<p>Jonathon, the substance can be a 'class' in the sense that 'peniciliins' is a class</p>",
        "id": 153813918,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457139798
    }
]