[
    {
        "content": "<p>AllergyIntolerance.recorder points to Practitioner|PractitionerRole|Patient|RelatedPerson, but we have a use case where we need a 1:1 in which organization the Practitioner did the recording (or assertion for that matter). </p>\n<p>I guess the \"real\" solution is to wrap it up in an encounter of some kind, but it's a lot of overhead and in the context information about the encounter does not exist. <br>\nAnother solution is a profile of PractitionerRole for linking to Organization.</p>\n<p>Extension \"RecordedAt 0..1(ref:Organization|HealthcareService)\" is allways possible. </p>\n<p>Anyone else have or see this use case?</p>",
        "id": 167468405,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1559815726
    },
    {
        "content": "<p>You can get to the Organization through PractitionerRole.  (In some cases, you'll use PractitionerRole to point to the Organization and won't even identify the Practitioner.)</p>",
        "id": 167477199,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559824604
    },
    {
        "content": "<p>Is this a valid use of the PractitionerRole resource, as a proxy/wrapper class to capture either/or Pracitioner &amp; Organization? Can PractitionerRole be used as an alternate way to implement element[X] = Practitioner|Organization?</p>",
        "id": 168322828,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1560787065
    },
    {
        "content": "<p>It shouldn't be.  The organization in PractitionerRole is the source of the roles.  I suppose you could use it to say \"the recorder is/was a community health physician at Good Health Hospital\".  But just saying \"Good Health Hospital\" would be an abuse of PractitionerRole, I think.</p>",
        "id": 168327372,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1560790444
    },
    {
        "content": "<p>In most places where PractitionerRole appears a bare Organization is also allowed, so the only situation where it makes sense to point to PractitionerRole is where you have something else to say beyond the Organization.  If the reference doesn't <em>allow</em> a bare Organization, you accomplish that by passing through PractitionerRole, but first I'd engage with the work group here on <a href=\"http://chat.fhir.org\" target=\"_blank\" title=\"http://chat.fhir.org\">chat.fhir.org</a> to find out why a bare Organization isn't supported.</p>",
        "id": 168328225,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560791196
    }
]