[
    {
        "content": "<p>What is the clinical status for an allergy that was refuted?<br>\nExample: </p>\n<ol>\n<li>Patient tells GP they are allergit to penicillin (clinicalStatus=active?, verificationStatus=presumed)</li>\n<li>Patient undergoes tests and it is not an allergy, just a minor known side effect (clinicalStatus=????, verificationStatus=refuted)</li>\n</ol>\n<p>The clinicalStatus is not clear to me from the value set<br>\n<a href=\"http://build.fhir.org/valueset-allergyintolerance-clinical.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-allergyintolerance-clinical.html\">http://build.fhir.org/valueset-allergyintolerance-clinical.html</a></p>",
        "id": 190432226,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584040475
    },
    {
        "content": "<p>Based on the definitions, it would be 'Resolved' (which is a specialization of 'inactive')  I.e. it should no longer trigger alerts</p>",
        "id": 190436378,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584042642
    },
    {
        "content": "<p>ok thanks</p>",
        "id": 190437086,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584043001
    },
    {
        "content": "<p>and the first one? <br>\nverification status=presumed =&gt; clinicalStatus=active?</p>",
        "id": 190437541,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1584043249
    },
    {
        "content": "<p>Active.  Presumed means you'd certainly want it to be checked</p>",
        "id": 190445522,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584047303
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Doesn't that really state the the allergy refutation is resolved? Seems that perhaps there is a new rule needed here (<a href=\"http://hl7.org/fhir/R4/allergyintolerance.html#invs\">http://hl7.org/fhir/R4/allergyintolerance.html#invs</a> ) \"if  Verification status is \"Refuted\" Don't populate Clinical Status\"</p>",
        "id": 198814252,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1590523370
    },
    {
        "content": "<p>From a clinical perspective. Maybe the patient just had some skin testing lab observation result, and you never had an allergy observation in the first place</p>",
        "id": 198814815,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1590523643
    },
    {
        "content": "<p>Active. Presumed is the usual case.  Laboratory or skin tests exist for less that 2% of possible drug allergies.  And direct challenge, the other possible verification, is done only rarely because of the expense and risk.  It is in the overwhelming majority that an allergy/intolerance is based on history or observation.  The other scenario that I would consider \"verification\" is, it happened 3 times (or more) with the same drug (substance) and the same reaction.</p>",
        "id": 198954610,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1590614224
    },
    {
        "content": "<p>@Russ - the real question is, if the an allergy is refuted, what is the clinical status? Are you saying \"active\" is the clinical status for a refuted allergy? There is no \"presumed\" status in either clinical or verification status</p>",
        "id": 199181944,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1590771527
    },
    {
        "content": "<p>We are currently having the exact same discussion about Condition: What's the appropriate clinicalStatus, if the verificationStatus is \"refuted\"?</p>",
        "id": 203822941,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1594726685
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 203838118,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594736139
    },
    {
        "content": "<p>Are you asking about R4 or latest build?  We've made a number of changes....</p>\n<ul>\n<li>In R4, the con-3 invariant was \"downgraded\" from Rule to Guideline, which should mean that you can leave clinicalStatus empty, if needed, as long as validator isn't enforcing best practices</li>\n<li>In build, we approved changes that are not yet applied <a href=\"http://jira.hl7.org/browse/FHIR-22973\">J#22973</a>, which includes changing the SHALL to a SHOULD</li>\n</ul>",
        "id": 203850705,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1594742038
    },
    {
        "content": "<p>I don't get the relation... <br>\nIn this thread I see three possibilities: When VerificationStatus is refuted, the clinicalStatus is</p>\n<ul>\n<li>empty </li>\n<li>active </li>\n<li>resolved<br>\nwhich one would be best?</li>\n</ul>",
        "id": 203864545,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594748845
    },
    {
        "content": "<p>I have a similar question that I'm going to put here, even though my original question was with conditions, but, allergies also has a similar refuted status.</p>\n<p>How would most suggest storing a patients \"refutation\" of having an allergy (or condition, or similar medical concepts), ie, in a discussion with a doctor/nurse, or maybe more commonly in filling out a checklist form.</p>\n<p>It seems like it might make sense to have verificationStatus \"refuted\" and the asserter be the patient themselves (or possibly a RelatedPerson for a caregiver).</p>\n<p>But, the wording on FHIR for these definitions seems to be too narrow to use it some of these scenarios currently:</p>\n<ul>\n<li>The issue above with a refuted allergy or condition having any sort of clinical status... to me the \"The subject is no longer experiencing the symptoms\" suggests they have in the past, which isn't necessarily accurate if the condition is refuted, which could mean they've never had it</li>\n<li>This issue... the  wording of refuted with \"has been ruled out by diagnostic and clinical evidence.\", doesn't really jive with a patient just telling you \"I don't have this\"... there is no diagnostic or clinical evidence there.</li>\n</ul>\n<p>I am guessing the answer might be that \"patient provided information\" such as this is something that gets stored in a completely different way (questionnaire?), but, we at least generally do store them in the same \"table/bucket\" per se within our system, so, it still seemed relevant possibly to send it this way via FHIR.</p>",
        "id": 203877746,
        "sender_full_name": "Dave Carlson (MIE)",
        "timestamp": 1594755620
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/AllergyIntolerance.20-.20clinical.20status.20of.20refuted.20allergies/near/203864545\">said</a>:</p>\n<blockquote>\n<p>I don't get the relation... <br>\nIn this thread I see three possibilities: When VerificationStatus is refuted, the clinicalStatus is</p>\n<ul>\n<li>empty </li>\n<li>active </li>\n<li>resolved<br>\nwhich one would be best?</li>\n</ul>\n</blockquote>\n<p>^ this</p>",
        "id": 204057449,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1594887890
    },
    {
        "content": "<p>Initially:</p>\n<blockquote>\n<p>Patient tells GP they are allergic to penicillin </p>\n</blockquote>\n<p>At this point in time (allergy hasn't been refuted yet), I agree with the earlier guidance that clinicalStatus should be active based on the definition of active being:</p>\n<blockquote>\n<p>The subject is currently experiencing the condition or situation, there is evidence of the condition or situation, or considered to be a significant risk.</p>\n</blockquote>\n<p>However, after some period of time, the allergy is subsequently refuted per</p>\n<blockquote>\n<p>Patient undergoes tests and it is not an allergy, just a minor known side effect </p>\n</blockquote>\n<p>My earlier response applies to this point in time (when the allergy has been refuted)</p>\n<blockquote>\n<p>In R4... you can leave clinicalStatus empty, if needed, as long as validator isn't enforcing best practices</p>\n</blockquote>\n<p>Once the allergy has been refuted, clinicalStatus = active would no longer be appropriate since (based on definition of active above) the patient isn't experiencing the condition, nor is there any evidence of the condition, nor is it considered to be a risk after it has been refuted.</p>",
        "id": 204753318,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1595468920
    },
    {
        "content": "<p>Nobody has thoughts/suggestions on my previous post in this thread of storing a patients \"refutation\" of having an allergy/condition/etc, or thoughts on the specificity of how FHIR is currently wording the \"refuted\" verificationStatus type?</p>",
        "id": 204837514,
        "sender_full_name": "Dave Carlson (MIE)",
        "timestamp": 1595529812
    },
    {
        "content": "<p>I don't see the answer to my question - I think we're down to 2 options.<br>\nWhat is the clinical status of a refuted allergy?</p>\n<ul>\n<li>empty </li>\n<li><del>active</del></li>\n<li>resolved</li>\n</ul>",
        "id": 204844269,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595533076
    },
    {
        "content": "<p>inactive or resolved - depending on testing</p>",
        "id": 204844472,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1595533190
    },
    {
        "content": "<p>refuted:  A propensity for a reaction to the identified substance has been disputed or disproven with a sufficient level of clinical certainty to justify invalidating the assertion. This might or might not include testing or rechallenge.</p>\n<p>inactive: The subject is no longer at risk of a reaction to the identified substance.<br>\nresolved: A reaction to the identified substance has been clinically reassessed by testing or re-exposure and is considered no longer to be present. Re-exposure could be accidental, unplanned, or outside of any clinical setting.</p>",
        "id": 204844579,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1595533246
    },
    {
        "content": "<p>Jean, maybe I am parsing words here too much, but \"The subject is NO LONGER at risk of a reaction to the identified substance.\", the \"no longer\" to me suggests they were at one point.... if you are marking refuted, that would suggest it was as stated initially marked \" unconfirmed\" (Jose said \"Presumed\", I don't see that as a named option, I assume we mean, \"unconfirmed\"), but, then decided that they didn't have the allergy/intolerance, most likely ever, which moves it to \"refuted\".</p>\n<p>Resolved is really no better with the wording of \" is considered no longer to be present. \"  That suggests at one point it was present.   </p>\n<p>None of the 3 clinicalStatus descriptions to me seem to be saying \"The subject has NEVER had a reaction to this substance\", which to me suggests leaving ClinicalStatus blank for \"refuted\".   I am agreeing with Gay Dolin's that someone starting an A/I as \"Unconfirmed\", and then moving it to \"Refuted\", the refuted (at this point, without modification to the descriptions) verificationStatus should have an empty clinicalStatus.</p>",
        "id": 204852232,
        "sender_full_name": "Dave Carlson (MIE)",
        "timestamp": 1595537556
    },
    {
        "content": "<p>I think the descriptions should be revisited</p>",
        "id": 204854783,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595539193
    },
    {
        "content": "<p>note that the <a class=\"stream\" data-stream-id=\"179262\" href=\"/#narrow/stream/179262-patient-empowerment\">#patient empowerment</a> workgroup is running a project specifically on the use-case of a patient requesting corrections.</p>",
        "id": 204858274,
        "sender_full_name": "John Moehrke",
        "timestamp": 1595541486
    },
    {
        "content": "<p>If you have an unconfirmed/active allergy - you are stating that you believe the patient is at risk for a reaction but you don't have confirmation.  Then you do something that causes you to no longer believe the patient is at risk - you refute the allergy and you make it either inactive or resolved based on whether you tested/re-exposed/whatever.</p>",
        "id": 204858649,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1595541773
    },
    {
        "content": "<p>In my case at top of thread, the patient was never allergic. The valueset does not allow this to be represented by active nor resolved</p>",
        "id": 204859403,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595542322
    },
    {
        "content": "<p>Because the text reads \"no longer\"</p>",
        "id": 204859445,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595542354
    },
    {
        "content": "<p>At least that is how.i read it. Why else would the words 'no longer' be there?</p>",
        "id": 204859477,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595542386
    },
    {
        "content": "<p>i read your case at the top and it didn't say the patient was never allergic.  it said that the patient told the GP that they were allergic.  That would get recorded as a Unconfirmed/Active allergy.  Then when the GP looked into it and thought the patient was full of baloney, he changes the statuses to \"refuted/inactive\" or perhaps he does some simple testing and then changes it to \"refuted/resolved\"</p>",
        "id": 204859498,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1595542425
    },
    {
        "content": "<p>that is exactly how it works in SK</p>",
        "id": 204859550,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1595542445
    },
    {
        "content": "<p>Refuted in this case means 'patient is actually not allergic, this was not an allergic reaction, this was an expected ADE'.</p>",
        "id": 204859741,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595542582
    },
    {
        "content": "<p>If inactive means 'it was never there or if it was, it is no longer' I'd say that refuted/inactive applies</p>",
        "id": 204859809,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595542646
    },
    {
        "content": "<p>But inactive says 'no longer at risk'. Those are specific words, I cannot assume they mean something more generic, right?</p>",
        "id": 204859921,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595542717
    },
    {
        "content": "<p>assuming the GP believed the allergy to be real when he first entered it, then the realization that the patient wasn't actually allergic means \"I used to think that the patient was at risk of a reaction but I no longer think that\"</p>",
        "id": 204859925,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1595542719
    },
    {
        "content": "<p>Go said it was presumed and referred to allergy specialist (allergist? Allergologist? Allergologologist?)</p>",
        "id": 204860118,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595542875
    },
    {
        "content": "<p>Perhaps in first step I should use unconfirmed instead of presumed</p>",
        "id": 204860242,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595542974
    },
    {
        "content": "<p>yes, mainly because there is no \"presumed\" code :)</p>",
        "id": 204860260,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1595542997
    },
    {
        "content": "<p>For verification status, I mean</p>",
        "id": 204860444,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595543137
    },
    {
        "content": "<p>there is no 'presumed' in either status value set</p>",
        "id": 204860504,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1595543164
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/valueset-allergyintolerance-verification.html\">http://build.fhir.org/valueset-allergyintolerance-verification.html</a></p>",
        "id": 204860671,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595543312
    },
    {
        "content": "<p>ah, i'm stuck in R4.  my apologies</p>",
        "id": 204860724,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1595543374
    },
    {
        "content": "<p>since Presumed is a child of unconfirmed, nothing I've said above changes.</p>",
        "id": 204860738,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1595543388
    },
    {
        "content": "<p>When referring to 'reactions' here I think that we need to be clear that we are referring to adverse reactions, not just reactions per se.</p>",
        "id": 204873119,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1595556779
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>   Can you elaborate on why there are still remaining questions as I tried to directly answer \"empty\" a couple times above, so I must be missing why you think the question is still unanswered (my apologies).<br>\n<span class=\"user-mention\" data-user-id=\"197476\">@Dave Carlson (MIE)</span>  To the question of how to represent a checklist Q&amp;A about the absence of a condition or allergy, I think the guidance we have in Condition (<a href=\"http://build.fhir.org/condition.html#9.2.4.5\">http://build.fhir.org/condition.html#9.2.4.5</a>) sums it up:</p>\n<blockquote>\n<p>It is common as part of checklists prior to admission, surgery, enrollment in trials, etc. to ask questions such as \"are you pregnant\", \"do you have a history of hypertension\", etc. This information should NOT be captured using the Condition resource but should instead be captured using QuestionnaireResponse or Observation. In this case, the combination of the question and answer would convey that a particular condition was not present.</p>\n</blockquote>",
        "id": 204873185,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1595556883
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197476\">@Dave Carlson (MIE)</span>   I agree with your assertion</p>\n<blockquote>\n<p>maybe I am parsing words here too much, but \"The subject is NO LONGER at risk of a reaction to the identified substance.\", the \"no longer\" to me suggests they were at one point....</p>\n</blockquote>\n<p>Condition has guidance, which could also apply to AllergyInterolerance (feel free to log change request to add a similar note to AllergyIntolerance)</p>\n<blockquote>\n<p>It is appropriate to capture a \"refuted\" Condition record <strong>if the Condition was considered present and subsequent evidence refuted it.</strong> Specifically, Condition.verificationStatus can convey refuted.</p>\n</blockquote>",
        "id": 204873413,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1595557208
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> </p>\n<blockquote>\n<p>I think the descriptions should be revisited</p>\n</blockquote>\n<p>Feel free to log a change request with proposed edits.  (Side note:  Patient Care recently approved updates to Condition.clinicalStatus code definitions per <a href=\"http://jira.hl7.org/browse/FHIR-26464\">J#26464</a>)<br>\nThat said, per my prior comment to Dave, we don't expect to have records for allergies or conditions that were <strong>never </strong> considered to be present  (e.g. the checklist use case mentioned above), but if there are other edits we can make to clarify definitions for conditions/allergies that were once believed to be present, please do log the change request so we can continue to refine the definitions.</p>",
        "id": 204873757,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1595557749
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191403\">Michelle (Moseman) Miller</span> <a href=\"#narrow/stream/179166-implementers/topic/AllergyIntolerance.20-.20clinical.20status.20of.20refuted.20allergies/near/204873185\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span>   Can you elaborate on why there are still remaining questions as I tried to directly answer \"empty\" a couple times above, so I must be missing why you think the question is still unanswered (my apologies).</p>\n</blockquote>\n<p>I saw the indication that it could be empty if needed, I did not see that as an indication of \"in that case is should/shall be empty\". I'll use that, thanks.<br>\nPerhaps we could add such guidance?</p>",
        "id": 204886180,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595575483
    },
    {
        "content": "<p>(I think this deserves assertive guidance)</p>",
        "id": 204886247,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1595575547
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191403\">Michelle (Moseman) Miller</span> <a href=\"#narrow/stream/179166-implementers/topic/AllergyIntolerance.20-.20clinical.20status.20of.20refuted.20allergies/near/204873185\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span>   Can you elaborate on why there are still remaining questions as I tried to directly answer \"empty\" a couple times above, so I must be missing why you think the question is still unanswered (my apologies).<br>\n<span class=\"user-mention silent\" data-user-id=\"197476\">Dave Carlson (MIE)</span>  To the question of how to represent a checklist Q&amp;A about the absence of a condition or allergy, I think the guidance we have in Condition (<a href=\"http://build.fhir.org/condition.html#9.2.4.5\">http://build.fhir.org/condition.html#9.2.4.5</a>) sums it up:</p>\n<blockquote>\n<p>It is common as part of checklists prior to admission, surgery, enrollment in trials, etc. to ask questions such as \"are you pregnant\", \"do you have a history of hypertension\", etc. This information should NOT be captured using the Condition resource but should instead be captured using QuestionnaireResponse or Observation. In this case, the combination of the question and answer would convey that a particular condition was not present.</p>\n</blockquote>\n</blockquote>\n<p>Thanks Michelle, as I stated, that is what I thought with the checklist Q&amp;A, (using questionnaire or something else), thanks for pointing out that wording.</p>\n<p>It sounds like we have some consensus for some sort of modification to either some of the language surrounding the inactive setting (adding \", or never had,\" after \"at risk of\" in the description?) or adding the guidance officially that for refuted VerificationStatus, that the clinicalStatus should be blank.   I think whatever is decided here should also get applied to conditions, and possibly other elements as well, but, I'd have to review those more closely.</p>",
        "id": 204913852,
        "sender_full_name": "Dave Carlson (MIE)",
        "timestamp": 1595596816
    },
    {
        "content": "<p>I just read the rewording on that request change:  <a href=\"https://jira.hl7.org/browse/FHIR-26464\">https://jira.hl7.org/browse/FHIR-26464</a></p>\n<p>The change to \"not presently\" instead of \"no longer\" IMO allows for the nuance of \"never had\" into the definition (although the \"returning\" at the end still makes that suggestion, it is less heavy handed than the \"no longer\" being at the beginning\").  </p>\n<p>It does appear though that they didn't approve the wording change though, am I reading that correctly?</p>",
        "id": 204914814,
        "sender_full_name": "Dave Carlson (MIE)",
        "timestamp": 1595597295
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>   Feel free to create a JIRA asking for explicit guidance to be added in the spec.<br>\n<span class=\"user-mention\" data-user-id=\"197476\">@Dave Carlson (MIE)</span>  <a href=\"http://jira.hl7.org/browse/FHIR-26464\">J#26464</a> was approved -- the revised wording is documented in the resolution description field.  Specifically, the bolded text (prefixed by \"Change\")</p>",
        "id": 205032086,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1595730683
    },
    {
        "content": "<p>Logged <a href=\"http://jira.hl7.org/browse/FHIR-28458\">J#28458</a> to add explicit guidance for clinicalStatus to be empty when verificationStatus is refuted</p>",
        "id": 209543294,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1599672918
    }
]