[
    {
        "content": "<p>AllergyIntolerance has two different ways to represent multiple reactions to a substance.  You can either have multiple AllergyIntolerance.reactions, each with one manifestation, or one reaction with multiple manifestations.  I think I understand the difference between the two in the spec.  The reactions are the reaction events, so if you have two reactions a year apart, and for some reason you had different symptoms during each reaction event, then you'd return multiple AllergyIntolerance.reactions.  However if a system doesn't really track allergy events on the allergy record itself, then it is likely more appropriate to return a single AllergyIntolerance.reaction with the \"reactions\" listed as manifestation.  </p>\n<p>Epic's implementation of AllergyIntolerance isn't currently event based, so we will return a single AllergyIntolerance.reaction, where multiple symptoms (swelling, rash, etc.) are returned as multiple manifestations on the reaction.</p>\n<p>1) Is my understanding as described above correct?<br>\n2) I'm curious how folks have actually implemented it.  </p>\n<p>We are working on a client to pull Argonaut-compliant (thus DSTU2) allergies, and are wondering how many implementers will actually return multiple reactions, rather than a single reaction with multiple manifestations.  Since we need to map into a non-event based allergy record, we're trying to understand how flexible we really need to be.</p>",
        "id": 154026146,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1545159628
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> ?</p>",
        "id": 154026148,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1545161223
    },
    {
        "content": "<p>I think your understanding is correct</p>",
        "id": 154026162,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1545165645
    },
    {
        "content": "<p>I've been pretty actively involved in the PCWG work and discussions on AllergyIntolerance andI  agree with your understanding.  I think your suggested approach for the \"non event based\" situation seems reasonable - but I'm not sure about the state of current and planned implementations in this regard, and, as you suggest, others could do it differently.</p>",
        "id": 154184860,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1546446761
    },
    {
        "content": "<p>If reaction is going to mean different things from different systems, it would be useful if we had a documented convention for differentiating them.  <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> can you submit a change request?</p>",
        "id": 154189578,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546451606
    }
]