[
    {
        "content": "<p>Shouldn't AllergyIntolerance.reaction also allow for a reference to Observation? Normally the Observation is found and entered first, only then we assert an allergy. Shouldn't we simply reuse Observation information there?</p>",
        "id": 181199026,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1574249656
    },
    {
        "content": "<p>The question is \"what do most systems do?\" - and I'm not aware of most systems maintaining a link between an Observation (or Condition) and an allergy record.</p>",
        "id": 181199407,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574250143
    },
    {
        "content": "<p>what most systems are you talking about there?</p>",
        "id": 181200542,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574251336
    },
    {
        "content": "<p>there is an extension that could be used event-basedOn</p>",
        "id": 181211550,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574260086
    },
    {
        "content": "<p>In a tutorial today I saw the case of capturing a reaction and only then inferring the allergy. I think it really makes sense. If in a series of consultations you a) make an observation of a reaction and b) infer an allergy because of that, why not reusing data?</p>",
        "id": 181216094,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1574262910
    },
    {
        "content": "<p>I agree with you. My personal use-case is getting tested for allergy to 'shellfish' there was an observation made of that test, and that observation moved my AllergyIntolerance severity from patient-suspects, to High Severity. My CDA summary does show the relationship between the Allergy and the Observation... so there is use like this in CDA (Epic).</p>",
        "id": 181225120,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574268219
    },
    {
        "content": "<p>Strangely enough, we just had a use case pop up for this.  An implementer wants to tie the MedRequest/Admin to the allergic reaction.  They can do that, but there is no way to associate that reaction with the allergyIntolerance.  So there is nothing to link the MedRequest with the Allergy which I would think we should do through the actual reaction.</p>",
        "id": 181247877,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1574282981
    },
    {
        "content": "<p>I just came upon this topic, too. We are currently profiling a WoundSummary where we want to capture the (allergic) reaction to wound dressing material. The symptoms in this context may be captured by a nurse or a wound manager. That it is a reaction to formerly added dressing material has to be infered by a physician, a nurse is not allowed to do so. So I would like to add references<br>\n(a) to the \"substance\" AND<br>\n(b) to the \"manifestation\"<br>\nin reaction.</p>",
        "id": 181622155,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1574415393
    },
    {
        "content": "<p>We now used custom extensions, but I think a change request would be nice. I'm waiting for my JIRA-Account.</p>",
        "id": 181634321,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1574427287
    },
    {
        "content": "<p>In JIRA: FHIR-25244</p>",
        "id": 181644716,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1574434567
    },
    {
        "content": "<p>(Public service announcement: if you write <code>J#25244</code> you'll get auto-linking behavior, FYI <span class=\"user-mention\" data-user-id=\"196115\">@Mareike Przysucha</span>.</p>\n<p><a href=\"http://jira.hl7.org/browse/FHIR-25244\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-25244\">J#25244</a></p>",
        "id": 181919357,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1574774127
    },
    {
        "content": "<p>scenario: <br>\nGP1: \"patient had a rash and shortness of breath after taking meds at lunch, seems allergic to meds, here is the reaction and allergy\" <br>\nGP2: \"patient had another reaction after taking meds at dinner, seems allergic to meds, here is the second reaction, but I cannot take responsibility for my colleague's  reaction statement\" <br>\nSpecialist 1: \"Patient is not allergic. the reaction is not part of this allergy, but are perhaps relevant to see as observations to see that the patient is allergic to fish\"</p>",
        "id": 191588991,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585044900
    },
    {
        "content": "<p>Can we discuss this? The resolution seems \"in this call we are not aware of implementers that do this\" - so what about a government implementation?</p>",
        "id": 191589084,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585044955
    },
    {
        "content": "<p>analysis here have asked: will the person that updates the allergy record assume responsibility for the reactions previously recorded?<br>\n(this is yet another argument I think)</p>",
        "id": 191589219,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585045021
    },
    {
        "content": "<p>From this thread it seems that it would make sense to allow a link to an observation, instead of forcing people to re-enter information in the .reaction. I think this is an oversight in the current specification.</p>",
        "id": 191589578,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585045235
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> this is feedback from implementers.</p>",
        "id": 191589761,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585045334
    },
    {
        "content": "<p>I can add 2 cents for data lineage and quality, or model consistency (we don't want systems to have 2 different models for the same information) but that is not as important as the implementers questioning</p>",
        "id": 191590020,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585045459
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-25244\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-25244\">J#25244</a> was already resolved back in January.  Per the DMP, <a href=\"http://www.hl7.org/documentcenter/public/decisionmaking/Default_HL7_WG_DMP_2019_V5.2.1.pdf\" target=\"_blank\" title=\"http://www.hl7.org/documentcenter/public/decisionmaking/Default_HL7_WG_DMP_2019_V5.2.1.pdf\">http://www.hl7.org/documentcenter/public/decisionmaking/Default_HL7_WG_DMP_2019_V5.2.1.pdf</a></p>\n<blockquote>\n<p>Revisiting Decisions<br>\na) It is recognized that revisiting previously made decisions inhibits progress and should be<br>\ndiscouraged. That said, circumstances might exist that warrant re-opening discussion on a<br>\npreviously resolved issue.<br>\nb) To dissuade this practice, such re-opening requires a formal motion, second, and two-thirds (66%)<br>\nmajority affirmative vote subject to the quorum rules in this document.<br>\nc) For the decision to revisit a previous decision to be considered binding, advance notification as<br>\nspecified in Meeting Notifications (section 3) is required.<br>\nd) The Meeting Notifications (section 3) can be waived to expedite ballot reconciliation items if the<br>\nWG determines that the new discussion represents the same range of views as addressed in the<br>\noriginal decision. </p>\n</blockquote>",
        "id": 191662890,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1585079229
    },
    {
        "content": "<p>I don't know what to do with that information.</p>",
        "id": 191663691,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585079655
    },
    {
        "content": "<p>I'd say this discussion makes a good case to open up the discussion - we are trying to implement the resources so I provide feedback to improve, I hope this is a good thing.<br>\n<span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> will you trigger the process given the new information?</p>",
        "id": 191664736,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585080157
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Do you have a system that actually links together its Allergy records with diagnoses or problems?  If so, just submit a new change request and point to the old one indicating that there's no evidence that the \"no systems do this\" assertion is incorrect.   (I'd phrase it as asking for an extension, because I'm pretty sure it's not an 80% situation.)</p>\n<p>If you're proposing it as a good idea/logical thing to do, then I think there's no action to take because the decision to add it needs to be based on a real implementer requirement, not a notion of something that might be desireable.</p>",
        "id": 191684657,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585091776
    },
    {
        "content": "<p>We need to implement this on the health data vaults and those are the requirements. It's not linking together allergies and diagnoses, it's the fact that we cannot first observe a reaction and then assert an allergy linking to it.</p>",
        "id": 191685207,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585092135
    },
    {
        "content": "<p>What is a \"health data vault\" - is that a personal health record?  A jurisdiction-maintained health record?</p>",
        "id": 191685633,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585092537
    },
    {
        "content": "<p>Sorry, it's the regional repository of patient healthcare records</p>",
        "id": 191686504,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585093199
    },
    {
        "content": "<p>So net new system?</p>",
        "id": 191687164,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585093673
    },
    {
        "content": "<p>System exists but I think these are new requirements to be added - will have to check but I assume so, these are new.</p>",
        "id": 191689072,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585095272
    },
    {
        "content": "<p>My leaning would be to use a local extension for now and, once you have production experience, propose a standard extension.</p>",
        "id": 191693633,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585100211
    },
    {
        "content": "<p>We can do that. But from the feedback received so far, this seems one case where \"sticking to what some vendors were doing yesterday\" is colliding with what seems reasonable.</p>",
        "id": 191730657,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585135263
    },
    {
        "content": "<p>I have no stigma with extensions, I just think we missed a spot there. <br>\nBut others have pointed it out in this stream so I will not be the only one to push it.</p>",
        "id": 191730790,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585135350
    },
    {
        "content": "<p>That's base FHIR methodology.  We try very hard to not have core 'lead' the community.  That's not to say it can't ever happen, but it's something we're super cautious about - because it's a super-slippery slope that leads to overly complex specs, a disconnect with the real world and - correspondingly - lower adoption.</p>",
        "id": 191758386,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585148549
    },
    {
        "content": "<p>I understand. Besides my project, the same question appeared in a presentation at devdays, and the few other people commenting in this thread. I see it not as leading the community, but responding.<br>\nWhile I believe this should be in core, we should at least get feedback \"we'd like to confirm that people are not using this\" and get a more significant sample.</p>",
        "id": 191815431,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585173008
    },
    {
        "content": "<p>The reality as we've been aware of it in the Patient Care discussions on this is that most systems seem to be recording the reactions at the same time as the allergies themselves.  If there are observations that are made prior to determining that there is an allergy (which certainly happens), it seems that typically there isn't an effort made to link the allergy record to those prior observations.  That fits pretty well with what we have right now in the AllergyIntolerance resource.  That's my take on the conclusions from the prior discussions, anyway.</p>",
        "id": 191833022,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585188161
    }
]