[
    {
        "content": "<p>Where do we capture \"exposure to this substance can put the patient in anaphylactic shock?\"</p>",
        "id": 191596271,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585049128
    },
    {
        "content": "<p><code>AllergyIntolerance.reaction</code></p>",
        "id": 191605990,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1585055194
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191381\">@Jason Walonoski</span>  No, AllergyIntolerance.reaction is for \"I was given this drug and I developed anaphylactic shock\".  We don't actually have anything that fully corresponds to what <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  is asking for, because it's rather unpredictable what reaction will occur on a particular future exposure, regardless of how high the risk.  It could be that on the first exposure I got a rash, but with the second exposure I did develop anaphylactic shock - or even vice versa.  So what we have to capture that risk of a serious or life-threatening reaction (including but not limited to anaphylactic shock) is AllergyIntolerance.criticality.</p>",
        "id": 191610306,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585057268
    },
    {
        "content": "<p>yes, correct. Problem with critiality is that it is a code. We can say this allergy is serious, but we don't know if that seriousness means \"blindness\", \"death if no epipen\" or \"patient will get really upset\".</p>",
        "id": 191610597,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1585057400
    },
    {
        "content": "<p>Yes, but that does reflect reality - we don't know what the future reaction is going to be.  Something like \"patient will get really upset\" at best would be indicating some kind of intolerance (although that's a stretch), but it definitely wouldn't be considered high criticality.  I think that would need to be recorded as a patient preference and/or a flag - something like that.</p>",
        "id": 191613767,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1585058725
    }
]