[
    {
        "content": "<p>from <a href=\"http://community.fhir.org/t/allergy-resource-onset-x/1464\" target=\"_blank\" title=\"http://community.fhir.org/t/allergy-resource-onset-x/1464\">http://community.fhir.org/t/allergy-resource-onset-x/1464</a>:</p>\n<blockquote>\n<p>onset[x] is when the allergy was known/believed to have started.</p>\n<p>Use Case 1: If a patient is allergic to bee stings, I would record onsetDateTime for the day when it actually started. Is this correct?</p>\n<p>Use Case 2: If a patient is allergic to bee stings since he or she was 10 he/she could record the Age in onSetAge. Is this correct?</p>\n<p>Use Case 3: onsetPeriod - Can you please provide an example on where an how will this be used?</p>\n<p>Use Case 4: onsetRange - Can you please provide an example on where an how will this be used?</p>\n<p>Use Case 5: onsetString - If a patient is allergic to bee stings, the patient could record it as “I have been allergic to bee stings from the age of 10”. Is this correct? But in this case the value “Bee sting” will also be provided code element as SNOMED code or just text?</p>\n<p>I have included a lot of use cases here, but I would really appreciate if you could review and validate each of these and provide guidance.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> <span class=\"user-mention\" data-user-id=\"191487\">@Russell Leftwich</span> <span class=\"user-mention\" data-user-id=\"192054\">@Viet Nguyen</span> ?</p>",
        "id": 173402760,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565985303
    },
    {
        "content": "<p>I agree with Lloyd's response:  <a href=\"http://community.fhir.org/t/allergy-resource-onset-x/1464/2\" target=\"_blank\" title=\"http://community.fhir.org/t/allergy-resource-onset-x/1464/2\">http://community.fhir.org/t/allergy-resource-onset-x/1464/2</a></p>",
        "id": 173545964,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1566223336
    },
    {
        "content": "<p>Use Case 1:  I would record the time of the first reaction.  Some I believe interpret this as when the allergy is first noted in the record.</p>",
        "id": 173575531,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1566245788
    },
    {
        "content": "<p>Use Case 2: yes, onSetAge = 10 years old<br>\nUse Case 3: the use of onset period I would think if someone reported first reaction \"last summer\" or \"when I was in high school\"<br>\nUse Case 4: I interpret onsetRange as being precise, with a start time and end time; I can't think of a good example where that would be relevant for bee sting reactions<br>\nUse case 5: for timing, yes \"when I was a kid\" or something like that; for the cause, someone might say \"some kind of bee or wasp\" so a text string that really has no coded equivalent would seem appropriate; people are often inaccurate about what it was that stung them; there are five types of stinging insects that individuals can be allergic to separately<br>\n\"bee\" to most individuals is a generic term for stinging insects.  Clinically probably best not to encode at a species level something that individuals misidentify at the Hymeoptra order level (the order that includes all bees, wasps, hornets, yellow jackets, etc)<br>\nWhile we are talking about coding issues, the diagnostic codes used for bee sting/wasp/etc allergy in ICD 9/10 are actually for the reaction (or just the sting), not the allergy (future risk).</p>",
        "id": 173577265,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1566247144
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 252133532,
        "sender_full_name": "Maximilian Reith",
        "timestamp": 1630910904
    }
]