[
    {
        "content": "<p>Hello everyone, <br>\nI have a few questions about how to fill some properties in FHIR Resource - AllergyIntolerance.</p>\n<p>I need to cover these points:</p>\n<ol>\n<li>The frequency of occurrence of the specific symptom. It means that a symptom can be periodic or permanent.</li>\n<li>Where this symptom has occurred. It can occur when a person at work or on the street.</li>\n</ol>\n<p>I have not found this information in the specification. So, is it possible (or it's the only opportunity) to cover these points by using custom extensions, because I have not found any official extensions for such cases? Or maybe there is someone who has had such needs and can suggest a possible solution.</p>\n<p>Thank you.</p>",
        "id": 226661348,
        "sender_full_name": "Jane Pankratova",
        "timestamp": 1613571268
    },
    {
        "content": "<p>Personal guessing if not using extensions:</p>\n<p>AllergyIntolerance.reaction.manifestation for (1);<br>\nAllergyIntolerance.reaction.description for both (1) and (2);<br>\nAllergyIntolerance.reaction.note for (2)</p>\n<p>Alternatively, Observations could be used to capture these data and then link it/them to the AllergyIntolerance by Reference (Observation.focus).</p>",
        "id": 226680003,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1613578007
    },
    {
        "content": "<p>The problem is that all these options are codes. I have special codings for the frequency of occurrence of the symptom and for the location. So, I guess, I can not write these values to usual text properties like note or description.</p>\n<p>I'll think about Observations. Thank you.</p>",
        "id": 226781520,
        "sender_full_name": "Jane Pankratova",
        "timestamp": 1613638904
    },
    {
        "content": "<p>Observation sounds like overkill and they'd probably get lost when passing the allergy around.  This might be a situation where extensions are better.</p>",
        "id": 226825318,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613661382
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Got it.  Thanks.</p>",
        "id": 226839146,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1613665981
    }
]