[
    {
        "content": "<p>Hi group, question on the AllergyIntolerance resource I can't seem to figure out - for Medication Allergies our EHR is able to capture both the Medication that caused the allergy and the Allergy Group/class of substance that caused the allergy as well.<br>\nSince the FHIR spec cardinality only permits 1 single value to go into the \"Code\" field, which of the two values should be inputted here? The specific medication or the drug class if/when known?</p>",
        "id": 254287375,
        "sender_full_name": "Chris Gibson",
        "timestamp": 1632263037
    },
    {
        "content": "<p>You can specify multiple codings within AllergyIntolerance.code to communicate the substance at varying levels of granularity.</p>",
        "id": 254291849,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632265855
    },
    {
        "content": "<p>Also, if specific medications are being captured as documentation of particular instances of allergic reactions, they may fit into <code>AllergyIntolerance.reaction</code> (\"Details about each adverse reaction event linked to exposure to the identified substance.\").</p>",
        "id": 254316933,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1632288417
    },
    {
        "content": "<p>Hello there I am pretty new to ml.  I got this FHIR dataset of Allergy Intolerance from public test server. The data does not look like it have those features and labels type. How to do I do Machine Learning on it.</p>",
        "id": 254571150,
        "sender_full_name": "Anoop Bhat",
        "timestamp": 1632417351
    },
    {
        "content": "<p>First, <em>NEVER</em> train a ML algorithm on a public test server.  Public test servers will, by definition, be full of random, fake and quite often totally non-realistic and non-representative data.  If you want to train a ML algorithm, you'll need to get access to real data from real servers (which will require establishing agreements with holders of such data).<br>\nNot totally clear what you mean by \"those features and labels type\" - what are you looking for?</p>",
        "id": 254573648,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632418385
    },
    {
        "content": "<p>unless you are looking to create ML rules that would sort garbage in to garbage out...</p>",
        "id": 254573931,
        "sender_full_name": "John Moehrke",
        "timestamp": 1632418501
    },
    {
        "content": "<p>I am just using it to learn ml.<br>\nThe datas were of json. I had to clean it and set in tabular columns<br>\nNow it looks something like this  -- <a href=\"/user_uploads/10155/D2hwnOjSMEzPWuKc5IcWW9RV/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/D2hwnOjSMEzPWuKc5IcWW9RV/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/D2hwnOjSMEzPWuKc5IcWW9RV/image.png\"></a></div>",
        "id": 254574989,
        "sender_full_name": "Anoop Bhat",
        "timestamp": 1632418930
    },
    {
        "content": "<p>I have done ml on healthcare datasets from kaggle<br>\nBut this was something new to me</p>",
        "id": 254575168,
        "sender_full_name": "Anoop Bhat",
        "timestamp": 1632419033
    },
    {
        "content": "<p>can i get some advise to perform ml on this data. Yes its from public test server but its fine for me. Its  for keeping it locally.</p>",
        "id": 254579662,
        "sender_full_name": "Anoop Bhat",
        "timestamp": 1632420744
    },
    {
        "content": "<p>If it's just to mess around with and will never have a hint of going near real patients, ok.  What are your issues with the data you have?  If it's the fact that some columns are missing values, that's normal - and your ML algorithm will have to learn to deal with it.  It's extremely rare for all data to be available all the time.  And in the base FHIR specification, very few elements are mandatory.</p>",
        "id": 254622117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632440156
    },
    {
        "content": "<p>i cant understand which columns should I train</p>",
        "id": 254643788,
        "sender_full_name": "Anoop Bhat",
        "timestamp": 1632453172
    },
    {
        "content": "<p>I cant figure out whether its a predictive or classification</p>",
        "id": 254703080,
        "sender_full_name": "Anoop Bhat",
        "timestamp": 1632489953
    },
    {
        "content": "<p>Well, given that it's largely junk data, I'm not sure it much matters?  Figuring out which elements are relevant to your process depends on what you're trying to predict and isn't an answer we can give you.</p>",
        "id": 254717138,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632495251
    },
    {
        "content": "<p>How can I get access to real FHIR data<br>\ncan I get it to practice my ML skills?</p>",
        "id": 254755117,
        "sender_full_name": "Anoop Bhat",
        "timestamp": 1632510008
    },
    {
        "content": "<p>There is a product called Synthea that generates realistic but fake medical data (in FHIR format). But as a normal person, no steward of real patient data is likely (illegal) to share actual live data with you. If you are part of a research group, you might be able to negotiate a de-identified view of real data. For learning ML, I would think Synthea would be enough.</p>",
        "id": 254759202,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1632511728
    },
    {
        "content": "<p>Keep in mind that, because Synthea is synthetic data, your ML algorithm will likely just end up predicting the algorithms Synthea uses to generate its fake data.  If you're just interested in building ML skills, that's fine.  But don't presume that any algorithms you produce by training against synthetic data will ever be valid against real data.</p>",
        "id": 254760238,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632512189
    },
    {
        "content": "<p>As the developer of Synthea, I agree with Daniel and Lloyd. Synthea can be used ML/Algorithm development (especially in educational learning), but mostly in terms of pipeline development, development and integration, etc. Once you want to use something in production, you better be using real data. As George Box famously said, \"All models are wrong, some are useful.\" Synthea models are therefore wrong. But they can still be useful, but you do need to understand where the edges are.</p>",
        "id": 255389552,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1632918513
    },
    {
        "content": "<p>There is also the possibility that you can \"train biases\" into your ML/AI model if you only use a dataset like Synthea.   Of course this same bias can happen for 'real data; too if you do not have a dataset that represents a varied population.</p>",
        "id": 255421686,
        "sender_full_name": "John Silva",
        "timestamp": 1632930172
    }
]