[
    {
        "content": "<p>Suppose I have a peanut allergy and some kind of reaction, it is clear what that looks like in FHIR. AllergyIntolerance with an AllergyIntolerance.reaction.</p>\n<p>Suppose I have an intolerance for radio waves [UMTS, 4G, 5G, WiFi, ...] and I have migraine attacks. Or suppose I get epileptic attacks from stroboscopic lights? </p>\n<p>AllergyIntolerance declares that out of scope:</p>\n<p><code>This resource is used to provide a single place within the health record to document a range of clinical statements about adverse reactions to substances/products</code></p>\n<p>Presumably you could say we are talking about a Condition, where every manifestation of the Condition is an Observation, but those are not relatable as far as I can find. So long story short: how should radio waves/stroboscopic light effects be modeled?</p>",
        "id": 181945642,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1574790287
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 181945850,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574790432
    },
    {
        "content": "<p>Also, what's the objective of tying the Condition to the Observation - what are you trying to get out of the linkage?</p>",
        "id": 181945881,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574790461
    },
    {
        "content": "<p>I would ike to connect conditions someone has, with manifestations thereof. This is something GPs do here on a day-to-day basis, They call that \"episode-based-record-keeping\" [forgive me my potentially awkward translation]. You come in with a complaint of some sort. This complaint is compared to known complaints i.e. the \"problem list\". If it is a known complaint, it is linked to that one, otherwise it is added to the problem list if it needs tracking of some sorts over time.</p>\n<p>The problem list provides an overview to the GP. Problems may evolve over time e.g. from stomach ache to bowel cancer. So you have a managed chain of conditions/problems connected to S-O-A-P based encounter activities, therapies, labs etc.</p>\n<p>But beyond GPs I would expect any specialist to be interest in if/how/how regular a condition manifests itself</p>",
        "id": 181950651,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1574793643
    },
    {
        "content": "<p>Thanks for raising the issue <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span>.  It sounds like the Dutch GP's are doing this the \"right\" way for episode-based (and problem-oriented) record keeping.  That's also the way that it's been taught (at least in the Family Medicine academic centers that I'm most familiar with) in US primary care for a long time.  I'm not sure how consistently that's being done now across the board in US primary care, but the notion is certainly there.  And I agree that we need to be able to support this (by some means in the 80%) in FHIR.  Honestly, it hadn't really registered with me that probably we don't currently support it (though it mentions manifestations, 'evidence' is targeted to \"the basis of the Condition's verification status\" and none of the extensions seem to quite cover it - so maybe an additional 'manifestation' element is needed?).  And Condition is FMM 3, so we do potentially have the opportunity to add explicit support for this.</p>",
        "id": 182006496,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1574850749
    },
    {
        "content": "<p>Condition.category could be 'problem-list-item'.</p>",
        "id": 182028315,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1574867928
    },
    {
        "content": "<p>I'd assume that all 'active' conditions would be on the problem list.. but apparently that's not the case?</p>",
        "id": 182089376,
        "sender_full_name": "René Spronk",
        "timestamp": 1574928286
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>?</p>",
        "id": 182107110,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1574946484
    },
    {
        "content": "<p>There can be multiple problem lists, each representing the interests of different practitioners</p>",
        "id": 182119003,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574956365
    },
    {
        "content": "<p>I think I'm clear on the problem list part: but how do I relate documented manifestations to them? What is it that binds an Observation of migraine to my Condition of sensitivity to stroboscopic light. And what if my migraine is made to a Condition itself? How do I relate migraine to my Condition of sensitivity to stroboscopic light?</p>\n<p>Do I create a list out of every Condition so I can relate them through List?</p>",
        "id": 182248159,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1575135693
    },
    {
        "content": "<blockquote>\n<p>every manifestation of the Condition is an Observation, but those are not relatable as far as I can find</p>\n</blockquote>\n<ul>\n<li>Condition.evidence.detail - this condition has the osbervation as evidence</li>\n<li>I don't see anywhere in the specification to say that an Observation is a manifestation of a condition. You might want to take that up with <a class=\"stream\" data-stream-id=\"179256\" href=\"/#narrow/stream/179256-Orders-and-Observation-WG\">#Orders and Observation WG</a> ?</li>\n</ul>",
        "id": 182249391,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575137552
    },
    {
        "content": "<p><code>Supporting evidence / manifestations that are the basis of the Condition's verification status, such as evidence that confirmed or refuted the condition.</code></p>\n<p>Aha... thanks Grahame! Although the element name is evidence which not quite fitting, the semantics of \"evidence\" are apparently wider</p>",
        "id": 182254721,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1575146997
    },
    {
        "content": "<p>What would I take up with OO? Should the Scope of Observation include \"observation of a manifestation\"? I think I can infer that from this part of the scope:</p>\n<p><code>Clinical Findings* such as abdominal tenderness</code></p>",
        "id": 182254839,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1575147176
    },
    {
        "content": "<p>well, I would think that there's at least some rational for saying, as part of an observation \"this observation is a manifestation of this problem we know about\" or something. Without needing to treat is as evidence (e.g. well established problem). I don't know whether OO has discussed this</p>",
        "id": 182255010,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575147471
    },
    {
        "content": "<p>I've gone back and forth a bit about whether this is a Patient Care issue (on Condition) or an OO issue (on Observation).  The observation that is judged to be a manifestation of the particular problem does occur subsequent to the problem/condition itself.  So that would seem to indicate that the Observation should point to the Condition.  But actually I think that there is a separate step involved.  The observation itself should probably stand alone - it is just what is observed, regardless of the particular problems/conditions that previously have been identified.  Then there is a subsequent step involving clinical judgement that would identify and associate the observation as being a manifestation of a particular condition.  So I think still that a 'manifestation' element on Condition indicating the Observation(s) that have been judged to be manifestations of the Condition may be the best way to represent this.  If so, that makes it a PC issue (and I agree that the currently existing 'evidence' element probably isn't quite the right semantic for this).</p>",
        "id": 182303632,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1575240233
    },
    {
        "content": "<p>you could have 10000+ observations on  Condition?</p>",
        "id": 182304480,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575241755
    },
    {
        "content": "<p>Yes, theoretically (an example could be continuous or frequent monitoring in the ICU).  But I think that would more likely be observations that are performed <strong>due to</strong> a condition rather than observations that are judged to be manifestations <strong>of</strong> a condition - which are different things.</p>",
        "id": 182304868,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1575242464
    }
]