[
    {
        "content": "<p>Question from some colleagues:</p>\n<p>The FHIR AllergyIntolerance resource has a criticality element at the base resource level (AllergyIntolerance.criticality), and severity elements for each contained reaction (AllergyIntolerance.reaction.severity). These two elements are bound to different (required) value sets.</p>\n<p>The HL7v2 messaging spec defines the AL1-4 segment for an Allergy level severity.</p>\n<p>How can we work around the problem of mapping a FHIR resource with multiple reaction level severities into an HL7v2 message and vice versa?</p>\n<p>And what is the correct mapping between a severity and a criticality, as the two seem to be quite distinct?</p>",
        "id": 153835280,
        "sender_full_name": "David Hay",
        "timestamp": 1467074879
    },
    {
        "content": "<p>I'm not sure you can convert severity to criticality in an automated way because it depends on the semantic of the reaction.  High severity of a non-significant reaction might be low criticality, while moderate severity of a potentially life-threatening reaction would be high criticality</p>",
        "id": 153835329,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1467078617
    },
    {
        "content": "<p>this made me pause</p>",
        "id": 153835332,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467079484
    },
    {
        "content": "<p>by \"criticality\" I guess FHIR means \"risk to health on re-exposure\"</p>",
        "id": 153835333,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467079523
    },
    {
        "content": "<p>so if you get a rash reaction to a drug with mild urticaria then this would be critical because re-exposure could cause anaphylaxis...</p>",
        "id": 153835335,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467079615
    },
    {
        "content": "<p>it's not up to us to make that decision. </p>",
        "id": 153835336,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467079670
    },
    {
        "content": "<p>whereas a reaction of \"severe constipation after oxycode\" (one of my mornings patients) would not be \"critical\" at all... as this is a common and expected reaction...</p>",
        "id": 153835337,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467079686
    },
    {
        "content": "<p>is there a definition for the HL7v2 \"severity\" field?</p>",
        "id": 153835338,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467079798
    },
    {
        "content": "<p>because regardless of the distinction (which is a good distinction) between reaction severity and allergy criticality, it would seem to me that the most useful thing would be to map the v7 severity to fhir criticality (or thats how it seems to me on superficial examination)</p>",
        "id": 153835339,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467079909
    },
    {
        "content": "<p>Agree that's what you should do, but it has to be an local mapping because the v2 definitions are very loose</p>",
        "id": 153835356,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467080598
    },
    {
        "content": "<p><strong>FHIR's definition of criticality (AllergyIntolerance.criticality):</strong> Estimate of the potential clinical harm, or seriousness, of the reaction to the identified Substance.<br>\n<strong>FHIR's definition of severity (defined per reaction, not per allergy - AllergyIntolerance.reaction.severity):</strong> Clinical assessment of the severity of the reaction event as a whole, potentially considering multiple different manifestations.</p>\n<p><strong>HL7v2 definition of severity (AL1^4):</strong> This field indicates the general severity of the allergy.<br>\nThis definition is problematic to say the least, as you can't define a term using the same term....</p>\n<p>However, the main problem is that these two concepts don't seem to match, as FHIR does not currently define a severity for the allergy as whole (e.g, how severe the actual allergy is, regardless of its criticality).</p>",
        "id": 153835529,
        "sender_full_name": "Avner Matan",
        "timestamp": 1467148523
    },
    {
        "content": "<p>Right.  FHIR isn't designed to maximize compatibility with v2 (or v3 or CDA or OpenEHR or any of the other multitude of systems implementers might be converting from.  Some conversions will be straight-forward.  Others will be tricky or non-automatable.  If you can't come up with a way to safely populate \"criticality\", then omit it.  (And if you wish, add an extension to convey the v2 concept you do have.)</p>",
        "id": 153835530,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1467149893
    },
    {
        "content": "<p>personally I cant see a meaningful distinction between FHIR criticality and HL7V2 severity - allergy is always a like a land-mine </p>",
        "id": 153835545,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467153234
    },
    {
        "content": "<p>and these statements are markers for clinicians about what is predicted to happen if you expose the patient to this substance</p>",
        "id": 153835546,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467153281
    },
    {
        "content": "<p>I just noticed that <code>AllergyIntolerance.substance</code> has disappeared from the resource definition.  This would appear to be an error, but if not, what's the reason/justification?</p>",
        "id": 153840989,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469496494
    },
    {
        "content": "<p>it was renamed to .code</p>",
        "id": 153840991,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469496591
    },
    {
        "content": "<p>Oh! Why? Is that because we're thinking of allowing more than just substances, e.g. SNOMED code for \"Allergy to ...\"?</p>",
        "id": 153840993,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469497102
    },
    {
        "content": "<p>Is it so that negation can be bound up in the code?  Have the clinical safety ramifications of that been documented somewhere?</p>",
        "id": 153840994,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469497603
    },
    {
        "content": "<p>yes negation can be bound up in the code </p>",
        "id": 153840995,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469498653
    },
    {
        "content": "<p>I'm not sure about the documentation, but it's pretty obvious</p>",
        "id": 153840996,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469498679
    },
    {
        "content": "<p>The clinical safety ramifications of hiding negation in a code are obvious?</p>",
        "id": 153841003,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469502142
    },
    {
        "content": "<p>Anyway, the change is useful I think.  One thing we've been wrestling with is the tension between modelling AllergyIntolerance &gt; Substance and using (or not using!) SNOMED codes meaning \"Allergic to <code>&lt;Substance&gt;</code>\".  This allows recognition of both.</p>",
        "id": 153841004,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469502266
    },
    {
        "content": "<p>Yes, <span class=\"user-mention\" data-user-id=\"191366\">@Stephen Royce</span>, that was exactly the intent.  It allows (and documents) the use of all of the available pre-coordinated SNOMED CT (and other) codes for allergies.  The resource documentation has been updated to reflect that - but possibly still needs some further updates.</p>",
        "id": 153841005,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1469502552
    },
    {
        "content": "<p><img alt=\":thumbsup:\" class=\"emoji\" src=\"static/third/gemoji/images/emoji/thumbsup.png\" title=\":thumbsup:\"> </p>",
        "id": 153841006,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469502629
    },
    {
        "content": "<p>Regarding negation, there are certainly potential issues with it being \"bound up\" in 'code'.  But there are also issues with the alternatives that have been proposed and considered, as well.  The SNOMED CT \"no known allergy\" subhierarchy codes are at least a pretty well defined and limited (only 7 at present) set. </p>",
        "id": 153841008,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1469502851
    },
    {
        "content": "<p>Bound up in the code is certainly far better than carrying a sibling element stating \"not\".  However, we found in our work that a completely separate class of clinical exclusions is better still.  FHIR seems to have shied away from that as a whole, though, so you're not left with a lot of choice, I suppose.</p>",
        "id": 153841009,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469503034
    },
    {
        "content": "<p>Right.  We considered a completely separate 'AllergyIntoleranceExclusion' resource, but so far decided not to go with that, as there is pretty strong sentiment toward having all of the allergy data accessible in one place.  </p>",
        "id": 153841010,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1469504086
    },
    {
        "content": "<p>hello everyone, <br>\nwhat's the diff among<br>\nAllergyIntolerance.onset[x],AllergyIntolerance.reaction.oncet,AllergyIntolerance.lastOccurence. </p>\n<ul>\n<li>when to use what? actually all of them are optional but if we want to capture one of them which is most imp?</li>\n<li>and here given <br>\n AllergyIntolerance.onset[x]--&gt;<br>\nonsetDateTime,onsetAge,onsetPeriod,onsetRange,onsetString where as<br>\nAllergyIntolerance.reaction.oncet--&gt;dateTime only</li>\n</ul>",
        "id": 153896701,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1499836667
    },
    {
        "content": "<p>AllergyIntolerance.onset[x] is when the allergy first appeared in the patient.  That might be a specific date (or just a year), a period (sometime beween 1980 and 1985), an age (5 years), an age range (between 5 and 10 years).<br>\nAllergyIntolerance.reaction deals with specific occurrence of the reaction - there might be multiple reactions - each having its own onset.  So far, there's been no broadly indicated need to capture reaction onset dates with the same imprecision we capture the start of the allergy as a whole.  AllergyIntolerance.lastOccurence would be the date of the last reaction - and it might be present even if no reaction details are present.</p>",
        "id": 153896702,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1499836918
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 153896819,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1499937777
    }
]