[
    {
        "content": "<p>I've read the proposed wording update for Bundle reference resolution at <a href=\"https://jira.hl7.org/browse/FHIR-29271?focusedCommentId=183020&amp;page=com.atlassian.jira.plugin.system.issuetabpanels%3Acomment-tabpanel#comment-183020\">https://jira.hl7.org/browse/FHIR-29271?focusedCommentId=183020&amp;page=com.atlassian.jira.plugin.system.issuetabpanels%3Acomment-tabpanel#comment-183020</a><br>\nbut I'm still not sure about something:  are there any other supported uri schemes (besides <code>http/s:</code> and <code>urn:</code>) for fullUrl which should be supported by the server for reference replacement?</p>",
        "id": 271621146,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1644605680
    },
    {
        "content": "<p>I think I've seen Bundles that have other fullUrl structures before (though maybe invalid ones!).  Right now, the only one I can recall is the Bundle that goes into smart health cards which uses a <code>resource:</code> scheme.  Would anyone expect to be able to post entries with that scheme to a server and have it do reference replacement?</p>",
        "id": 271623321,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1644606675
    },
    {
        "content": "<p>I guess there is <a href=\"http://jira.hl7.org/browse/FHIR-31422\">FHIR#31422</a> which relates to that (persuasive with modification) and what I'm trying to understand is whether / how that affects the resolution on <a href=\"http://jira.hl7.org/browse/FHIR-29271\">FHIR#29271</a></p>",
        "id": 271623756,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1644606899
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 271627118,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644608606
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-31422\">FHIR-31422</a> is the relevant decision here from my perspective; servers ought to be able to do \"full URL matching\" based on any scheme, and that's consistent with the \"If the reference.value is a versionless...\" logic from <a href=\"http://jira.hl7.org/browse/FHIR-29271\">FHIR-29271</a>, which you cite.</p>\n<p>If you need \"fhir base semantics\" (like, to turn a relative reference into an absolute reference by appending to an inferred base) then you're limited (today) to the http/https schemes. (Even that's an unnecessary limitation; I think base semantics should work for ipfs and its brethren).</p>",
        "id": 271636029,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644613149
    },
    {
        "content": "<p>I think I could get behind that.  But then, in my opinion, listing only http/https examples under \"Resolving absolute references\" is a bit misleading...it would be nice to have at least one non-http example listed there to make it clear that \"any\" scheme could be considered an \"absolute reference\".<br>\nBut that makes me wonder what would fall to the \"Resolving other references.\" section...</p>",
        "id": 271648051,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1644619140
    },
    {
        "content": "<blockquote>\n<p>servers ought to be able to do \"full URL matching\" based on any scheme</p>\n</blockquote>\n<p>would that include fullUrl with no scheme (i.e. no <code>:</code> delimiter), or is this what would full under the \"Resolving other references\" section?</p>",
        "id": 271648209,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1644619263
    },
    {
        "content": "<p>the one thing that gives me pause is the spec wants servers to replace references all over (even in the narrative text) and I'm wondering if its safe to do that for \"any scheme\".  the risk of an unrelated href or img <code>src</code> attribute containing a long <code>urn:</code> value seems a lot lower than a string like \"resource:0\"</p>",
        "id": 271648858,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1644619734
    },
    {
        "content": "<p>Sure, but the resolution rules are useful in places outside of \"batch create\" -- like, being able to publish a Bundle with one Organization's full hierarchy of clinics and practitioners with fullUrls  like <code>ipfs://{hash}/resources/Organization/123</code>, and working references across the entries like <code>Organization/123</code>) (using absolute URIs for the references here is workable though).</p>\n<p>[<del>Or being able or resolve short urls like <code>resource:0</code> across references in space constrained QR.</del> Edit: we don't need relative URIs in this references for this one; absolute are shorter].</p>\n<p>If you're preparing a Bundle specifically to call batch create and you want to avoid ambiguities, you could always use URNs.</p>",
        "id": 271650231,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644620562
    },
    {
        "content": "<p>(btw will you share a pointer to the language about replacing narrative? It sounds familiar but I'm having trouble finding it.)</p>",
        "id": 271664835,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644634591
    },
    {
        "content": "<p>sure, thats from <a href=\"https://build.fhir.org/http.html#trules\">https://build.fhir.org/http.html#trules</a><br>\nspecifically this bit:</p>\n<blockquote>\n<p>Servers SHALL replace all matching links in the bundle, whether they are found in the resource ids, resource references, elements of type uri, url, oid, uuid, and &lt;a href=\"\" &amp; &lt;img src=\"\" in the narrative. Elements of type canonical are not replaced.</p>\n</blockquote>",
        "id": 271667102,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1644637669
    },
    {
        "content": "<p>I'm not sure if servers actually implement that bit or not though.  I \"kind of\" get replacing href values but really not sure what the use case is for an img src attribute that points at a resource url.</p>",
        "id": 271667166,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1644637746
    }
]