[
    {
        "content": "<p>I've seen versions of this type of discussion in the past, but can't seem to find any final conclusion or common approach. </p>\n<p>Use case: User A is signed in and accessing FHIR to read lists of resources. That specific user (and app) may have limitations on what type of actions they can take. We would like to be able to communicate \"what can I do next\". EG: I read the active allergies, there are 5. I can update/patch 2 of them. I can delete 1. I can read all.</p>",
        "id": 190197053,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1583859444
    },
    {
        "content": "<p>I thought some of the discussion at connectathons started to lean towards common extensions (eg: tied to the interaction value set?), but I'm not finding any common extension that looks like it does this today.</p>",
        "id": 190197158,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1583859488
    },
    {
        "content": "<p>This is different from conformance because it may be calculated based off biz rules and specific user privs (you don't authenticate to metadata...), and may vary based on the type of allergy/med/etc that is in the list</p>",
        "id": 190197236,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1583859533
    },
    {
        "content": "<p>For example, you may not be able to modify an allergy if it's already in error. Or you don't have privs to modify CII drugs in this system. Etc</p>",
        "id": 190197290,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1583859566
    },
    {
        "content": "<p>Interesting problem. Just for me to understand: is this more about permissions (who can do what for some purposes), or more about workflows (what actions can we expect to be possible at some point in time after or before some other actions)? Or neither?</p>",
        "id": 190198181,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583859982
    },
    {
        "content": "<p>we've discussed this on and off over time. What we've leaned towards in the past is making some kind of operation that allows that app to ask whether a specific operation is possible before it lets the user spend time trying to start it</p>",
        "id": 190213475,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583867883
    },
    {
        "content": "<p>or maybe asking the server to indicate what operations are possible in the response (a prefer header?) but we have never landed anything</p>",
        "id": 190213538,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583867926
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  in the end, it may end up being both. IE: for this specific resource instance, here's what you can do next</p>",
        "id": 190336662,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1583964005
    },
    {
        "content": "<p>The reason you can't do something may be because of workflow (you can't/shouldn't modify an in error med, for eg) or privs</p>",
        "id": 190336711,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1583964038
    },
    {
        "content": "<p>Ok, so it sounds like I'm not missing anything in the spec at the moment</p>",
        "id": 190336791,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1583964093
    },
    {
        "content": "<p>We're having a discussion in Belgium about Privacy at the moment (who can change what), i want to prototype something. Possibly we'll use the Permission draft resource to test it</p>",
        "id": 190337978,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1583965051
    }
]