[
    {
        "content": "<p>Typically %resource would refer to the current focus of validation whether we are validating the outermost resource (container) or some contained resource either via DomainResource.contained or some other containment mechanism (e.g. Bundle.entry.resource). A good example of this is obs-7:</p>\n<p>value.empty() or component.code.where( (coding.code = %resource.code.coding.code) and (coding.system = %resource.code.coding.system)).empty()</p>\n<p>In some cases, though, particularly ref-1, it would appear that %resource should <em>always</em> be considered as the outermost resource:</p>\n<p>reference.startsWith('#').not() or (reference.substring(1).trace('url') in %resource.contained.id.trace('ids'))</p>\n<p>This is because contained resources should never have contained resources. The only thing that tells us the difference, however, is the 'contained' path that immediately follows %resource. Is there some general guidance on what %resource should mean in these different contexts? Any other thoughts on how to resolve this ambiguity?</p>",
        "id": 172051605,
        "sender_full_name": "John Timm",
        "timestamp": 1564502873
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 172052329,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564503361
    },
    {
        "content": "<p>The <a href=\"http://hl7.org/fhir/fhirpath.html\" target=\"_blank\" title=\"http://hl7.org/fhir/fhirpath.html\">fhirpath</a> page says \"The original resource current context is part of. When evaluating a datatype, this would be the resource the element is part of.\". When evaluating an invariant, that means %resource will always be the instance of the resource type on which the invariant is defined.</p>",
        "id": 172054974,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1564505464
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> Mapping that to my example, obs-7 is an invariant on the Observation resource type.The current context may be an Observation that is the root of the tree (outermost) OR it could be some contained observation and the value of %resource should follow that context accordingly. I\"m not sure how that maps to the Reference ref-1 case (when reference belongs to a contained resource). If the reference is part of a contained resource and I set %resource to the resource which the reference belongs to, then the constraint would unexpectedly fail.</p>",
        "id": 172056777,
        "sender_full_name": "John Timm",
        "timestamp": 1564506649
    },
    {
        "content": "<p>To me, the issue with the quoted section is this sentence:  <code>When evaluating a datatype, this would be the resource the element is part of.</code> </p>\n<p>ref-1 is an invariant on Reference data type.  when evaluating this on a reference that is in a resource that is contained in another resource, we want <code>%resource</code> to resolve to the outermost resource, not the contained resource its a part of.  Doesn't that conflict with the fhirpath page?</p>",
        "id": 172057572,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1564507292
    },
    {
        "content": "<p>ref-1 looks like it is in error to me. Can you create a task?</p>",
        "id": 172069803,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564515857
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <br>\n<a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_id=677&amp;tracker_item_id=23018\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_id=677&amp;tracker_item_id=23018\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_id=677&amp;tracker_item_id=23018</a></p>",
        "id": 172070429,
        "sender_full_name": "John Timm",
        "timestamp": 1564516415
    }
]