[
    {
        "content": "<p>Hello - I am looking for some advice on data modelling for analytics and ML purposes.</p>\n<p>I've been trying to map ML/analytical concepts to FHIR resources. My current idea is to model algorithms as Devices as I believe one could consider them to be \"Virtual Medical Devices\" in that they take observational information as input and produce some other, higher-level observational output. These algorithms could contain parameters for within the Device and be defined using the DeviceDefinition resource. A trained ML model could persisted as a Binary resource and loaded when utilised. Some kind of event/notification implementation could then leverage the Subscription resource to notify when Observation data produced by the algorithms matches a given criteria (e.g. exceeds a threshold). </p>\n<p>Below the concept mappings: </p>\n<p>Data (both as input and output) == Observation (or more generally, diagnostic resources)<br>\nModel == Binary (+ DocumentReference?)<br>\nAlgorithm and its parameters == Device<br>\nAlgo Definition == DeviceDefiniton<br>\nNotification definition == Subscription<br>\nNotification == Flag</p>\n<p>Would this approach make sense? Any others out there tackling this with FHIR?</p>",
        "id": 171953523,
        "sender_full_name": "Severin Skillman",
        "timestamp": 1564412687
    },
    {
        "content": "<p>Did you look at <a href=\"http://build.fhir.org/measure\" target=\"_blank\" title=\"http://build.fhir.org/measure\">http://build.fhir.org/measure</a> ?</p>",
        "id": 171964603,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1564420255
    },
    {
        "content": "<p>Device should be good for software algorithms / argorithm implementations. Not sure what is an algorithm definition, and I am curious to see how to manage Machine Learning but that is just my curiosity</p>",
        "id": 171965955,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1564421331
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> - did you guys end up using OperationDefinition for this?</p>",
        "id": 171975471,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564428082
    },
    {
        "content": "<p>We started there, but wanted a standardized interface, so in STU3 it would have been a ServiceDefinition, in R4, an OperationDefinition would be good because it would allow you to specify the parameters directly.</p>",
        "id": 171976096,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1564428600
    },
    {
        "content": "<p>If you have reasonably well-defined classes of models that all take the same types of parameters, then Measure is another potential fit, where a Library would be used to communicate the model and algorithms.</p>",
        "id": 171976443,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1564428863
    },
    {
        "content": "<p>It's the first time I'm looking into Measure and Library resources. Am I understanding correctly that a Measure is a way to track, for example, the sensitivity/specificity of an algorithm wheres a Library persists algorithm models and/or other assets?</p>",
        "id": 172027724,
        "sender_full_name": "Severin Skillman",
        "timestamp": 1564485585
    },
    {
        "content": "<p>Is the idea with OperationDefinition to define parameters for invoking an algorithm in a Library?</p>",
        "id": 172027839,
        "sender_full_name": "Severin Skillman",
        "timestamp": 1564485693
    },
    {
        "content": "<p>pretty much</p>",
        "id": 172028595,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564486432
    },
    {
        "content": "<p>What kind of operations are we talking about - something like $train, $predict?</p>",
        "id": 172038630,
        "sender_full_name": "Severin Skillman",
        "timestamp": 1564494243
    },
    {
        "content": "<p>against a Device? and is there a way to refer between Device and Library?</p>",
        "id": 172038662,
        "sender_full_name": "Severin Skillman",
        "timestamp": 1564494281
    },
    {
        "content": "<p>There is a cqf-Library extension that lets you reference a Library from any resource, that could be used to attach a library reference to a Device, yes.</p>",
        "id": 172055075,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1564505544
    },
    {
        "content": "<p>Ok thank you. I will take a look</p>",
        "id": 172115057,
        "sender_full_name": "Severin Skillman",
        "timestamp": 1564568330
    },
    {
        "content": "<p>To do ML, you need to define what you are looking for in data, e.g. a symptom reading field value range for a diagnosis, then train the model based on known data using an algorithm to find the relevant data then use that model to  predict the correct diagnosis for unseen data.</p>",
        "id": 172925559,
        "sender_full_name": "Dwight Walker",
        "timestamp": 1565445001
    },
    {
        "content": "<p>Very interesting discussion. I have a similar (a bit simpler) project at hand with a similar model. For modelling the algorithm, I was planning to use Device. However OperationDefinition has a much better-fitting structure to describe all the algorithm inputs and outputs, version, publisher, etc. What I am struggling with is that OperationDefinition is already normative and does not describe that kind of usage. Especially if we're talking about algorithms that won't be invoked as \"...a FHIR operation or a named query.\" (quoting <a href=\"https://www.hl7.org/fhir/operationdefinition.html#scope\">https://www.hl7.org/fhir/operationdefinition.html#scope</a>). Any suggestions?</p>",
        "id": 218726545,
        "sender_full_name": "Javier Espina",
        "timestamp": 1607016236
    },
    {
        "content": "<p>Broadening the scope is certainly something that's possible - you could submit a change request</p>",
        "id": 218744140,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607024481
    }
]