[
    {
        "content": "<p>Hello, I am new to FHIR and was looking to get guidance on how others treat anonymous patients. Our system currently supports patients with no first name but a middle name as a form of anonymity, but this is unsupported in FHIR as the middle name would get rolled up to the first name. I see that you can have a name field with a type anonymous. What would you expect for a patient who should remain anonymous? Two name fields, one official, one anonymous, or just the anonymous field with the family/given names filled out? Thankful for any guidance</p>",
        "id": 158808047,
        "sender_full_name": "Jim Price",
        "timestamp": 1550504156
    },
    {
        "content": "<p>not sure if i understood the problem correct, but why not omit the whole HumanName for anonymous patients?</p>",
        "id": 158808509,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1550504593
    },
    {
        "content": "<p>I would think you still want a means of identifying the patient somehow, even if just internally. The goal is to not include the patient's name on any displays. You would still want a means of tying patient records together, as well as distinguishing between anonymous patients.</p>",
        "id": 158808656,
        "sender_full_name": "Jim Price",
        "timestamp": 1550504749
    },
    {
        "content": "<p>then i would populate a indentifier element with a unique identifier for this patient and don't contain a HumanName Element</p>",
        "id": 158809277,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1550505324
    },
    {
        "content": "<p>Just withholding the first name won't necessarily create much anonanymity.  Some patients may have distinctive (and well-known) middle names.  Others might not have a middle name at all.  However, if you want to give the patient some sort of a pseudonym for anonymity purposes, you can use this extension: <a href=\"http://hl7.org/fhir/extension-iso21090-en-use.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-iso21090-en-use.html\">http://hl7.org/fhir/extension-iso21090-en-use.html</a>.  The code \"ANON\" should work.</p>",
        "id": 158810162,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550506085
    },
    {
        "content": "<p>There is some text in the FHIR specification on this topic -- <a href=\"http://build.fhir.org/secpriv-module.html#deId\" target=\"_blank\" title=\"http://build.fhir.org/secpriv-module.html#deId\">http://build.fhir.org/secpriv-module.html#deId</a></p>",
        "id": 158810203,
        "sender_full_name": "John Moehrke",
        "timestamp": 1550506140
    },
    {
        "content": "<p>There are standards that guide you on how to use pseudonymization to create various types of reversable methods. The one you use will depend on the use-case that is an authorized re-identification.  <a href=\"https://healthcaresecprivacy.blogspot.com/2014/06/de-identification-process-reduce-risk.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2014/06/de-identification-process-reduce-risk.html\">https://healthcaresecprivacy.blogspot.com/2014/06/de-identification-process-reduce-risk.html</a></p>",
        "id": 158810386,
        "sender_full_name": "John Moehrke",
        "timestamp": 1550506270
    },
    {
        "content": "<p>As an addition, what you are talking about is supposedly pseudonymization, not anonymization (see John's second link)</p>",
        "id": 158810673,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1550506515
    },
    {
        "content": "<p>In HL7 V2 the ADT PID XPN (eXtended Person Name) had a Name Type property from table 0200 and this has a value of:</p>\n<p>S   Coded Pseudo-Name to ensure anonymity</p>\n<p>Is there an equivalent way of encoding the HumanName FHIR property with a type qualifier?</p>\n<p>(I think the use case for this was a VIP patient whose real name is meant to be hidden, not necessarily for de-identified patient naming.)</p>",
        "id": 158834442,
        "sender_full_name": "John Silva",
        "timestamp": 1550530122
    },
    {
        "content": "<p>Yes, as mentioned above, you can use the iso21090-en-use extension.</p>",
        "id": 158834469,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550530175
    },
    {
        "content": "<p>Yes, as John Silva mentioned, the use case was for VIPs. We already have a solution for de-identified patient naming</p>",
        "id": 158886423,
        "sender_full_name": "Jim Price",
        "timestamp": 1550587348
    },
    {
        "content": "<p>even for VIP use, why would middlename be an allowed risk? For a VIP patient, I would expect a very pseudo Patient resource. For which the name can be all made up. I recall common situations where a VIP is given an alias, which would seem useful to put into the name element.</p>",
        "id": 158887476,
        "sender_full_name": "John Moehrke",
        "timestamp": 1550588032
    },
    {
        "content": "<p>Assigning a pseudonym is great.  Another option is not to return VIP patients at all.</p>",
        "id": 159374055,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1551130325
    }
]