[
    {
        "content": "<p>Hi!</p>\n<p>We are currently working on creating a questionnaire/QuestionnarieResponse for a Journal Note use case.<br>\nOne requirement is to only permit answers from ICD10(Code system containing diagnosis codes), KVÅ (Code system for classification of procedure codes) or both depending on the Question/Item. <br>\nWe have understood that we need to state which valueSet that are permitted in  Questionnaire.Item.answerValueSet. <br>\nWe would like to create implicit valueSets for this to state that the valueSet contains all codes from ICD10, KVÅ or both. Meaning that we would probably need to create/Support three different kinds of value set with codes from ICD10, KVÅ or Both. </p>\n<p>Do you think that this is the best approch? Or do you have any valuable input? Also, I have not created an Implicit value set. How do I reference the code system?</p>",
        "id": 242208574,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1623332874
    },
    {
        "content": "<p>To clarify, there are some questions for which the answers are just ICD10 codes, some that are KVA and some that are both and you want to define 3 expression-based (i.e. \"intensional\") value sets to cover those 3 use-cases?</p>",
        "id": 242220050,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623336934
    },
    {
        "content": "<p>Yes, exactly <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 242585198,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1623671633
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/answerValueSet.20in.20QuestionnaireResponse/near/242220050\">said</a>:</p>\n<blockquote>\n<p>To clarify, there are some questions for which the answers are just ICD10 codes, some that are KVA and some that are both and you want to define 3 expression-based (i.e. \"intensional\") value sets to cover those 3 use-cases?</p>\n</blockquote>\n<p>I will try to be more clear. <br>\nIn our system we use keywords(Questions binded with snomed codes) in our journal notes. These keywords can support different kinds of input/answers. E.g. values, strings, or codes. </p>\n<p>In the questionnaire profile we want to specify that for a ceratin keyword we only support codes from a certain codeSystem in the QuestionnaireResponse.  Our idea is to use the type = 'Choice' and in <strong>answerValueSet</strong> specify which valueSet that can be used. </p>\n<ol>\n<li>First question is if you agree with this approach?</li>\n</ol>\n<p>We would like to support three different keywords that are limited to codes from ICD10 and/or KVA.<br>\nOne value set with all codes from ICD10. One with all codes from KVÅ and one that value set that supports codes from both. </p>\n<p>Our Idea is therefore to create 3 expression-based value sets that only refers to the code system since all codes should be valid,</p>\n<ol start=\"2\">\n<li>Second question is if this is a good approach our if you would recommend anything else?</li>\n<li>How do I create a expression based value set that refers to two different code systems?</li>\n</ol>\n<p>Thanks!</p>",
        "id": 242735696,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1623765252
    },
    {
        "content": "<p>I'm not sure what you mean by 'keywords'? These are alias codes?</p>",
        "id": 242802085,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623792366
    },
    {
        "content": "<p>Sorry for the delayed response <span class=\"user-mention\" data-user-id=\"261302\">@Ludvig Eek Hofmann</span> - I was away for a bit.  So you've got a selection of questions.  Each question 'item' will have a 'code' that corresponds to a SNOMED concept.  You want to indicate that the 'answer' for certain SNOMED codes is limited to a particular value set.  That's completely fine.  Each Questionnaire.item allows you to have an answerValueSet.  You can share answerValueSets across multiple questions or you can have distinct ValueSets for whichever question you wish.</p>",
        "id": 243868385,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624586858
    }
]