[
    {
        "content": "<p>We have a need to represent Antithrombotic Therapy Not Given at Discharge, among other negative statements, in two different ways:<br>\n1) A specific drug was not prescribed<br>\n2) None of the drugs from a given value set were prescribed<br>\nFor the first case, it's straightforward to represent as a particular Coding, but for the second case, we're not sure. We initially used the <code>valueset-reference</code> extension, but that's not quite right, so we are now proposing to do something like this:</p>\n<div class=\"codehilite\" data-code-language=\"JSON\"><pre><span></span><code><span class=\"p\">{</span>\n  <span class=\"nt\">\"doNotPerform\"</span><span class=\"p\">:</span> <span class=\"kc\">true</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"medicationCodeableConcept\"</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n    <span class=\"nt\">\"coding\"</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n      <span class=\"p\">{</span>\n        <span class=\"nt\">\"system\"</span><span class=\"p\">:</span> <span class=\"s2\">\"urn:ietf:rfc:3986\"</span><span class=\"p\">,</span>\n        <span class=\"nt\">\"code\"</span><span class=\"p\">:</span> <span class=\"s2\">\"http://cts.nlm.nih.gov/fhir/ValueSet/2.16.840.1.113883.3.117.1.7.1.201\"</span><span class=\"p\">,</span>\n        <span class=\"nt\">\"display\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Antithrombotic Therapy value set\"</span>\n      <span class=\"p\">}</span>\n    <span class=\"p\">]</span>\n  <span class=\"p\">}</span>\n<span class=\"p\">}</span>\n</code></pre></div>\n<p>Any thoughts on whether that's a reasonable approach? Other suggestions on how best to model this?<br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span></p>",
        "id": 258772611,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1634935838
    },
    {
        "content": "<p>Isn't this saying \"Don't give any med on this value set\"?</p>",
        "id": 258777211,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1634938037
    },
    {
        "content": "<p>Yes, Gay is right - doNotPerform says that this order is saying not to give the medicationCode.  That's different than saying that this drug wasn't prescribed.</p>",
        "id": 258777451,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1634938166
    },
    {
        "content": "<p>Is there a way to say, \"this drug (or no drugs in this set) wasn't/were not  prescribed?</p>",
        "id": 258777687,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1634938290
    },
    {
        "content": "<p>Yes, prospectively that's what it says, but if you're looking at the record after the fact, it's documentation that the drug was not prescribed for a particular reason (I didn't include the status reason in the snippet, but it's typically because of a contraindication or a patient refusal or something like that).</p>",
        "id": 258778046,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1634938500
    },
    {
        "content": "<p>i'm not sure I agree - the semantics are close but different:<br>\nI am ordering you not to take this because of this reason<br>\nvs<br>\nI did not order you to take this because of this reason</p>",
        "id": 258778606,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1634938853
    },
    {
        "content": "<p>in any case, back to your original question - that's a novel way of using the value set as a code for a set of medications.  But I'm not sure that it will be understood by many receivers.</p>",
        "id": 258778709,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1634938918
    },
    {
        "content": "<p>The existence of an order to not do something in no way guarantees that it wasn't done anyhow...</p>\n<p>This smells to me like Observation.  \"As of this date, I declare that (to the best of my knowledge) the following actions did not happen during period of time X\".  5 minutes later, you might not be able to make that same statement.</p>",
        "id": 258783432,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634941539
    },
    {
        "content": "<p>I think I remember being advised that MedicationUsage would cover this</p>",
        "id": 258800587,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634959879
    },
    {
        "content": "<p>no, MedUsage can say that you didn't take something, but not that it wasn't ordered for you</p>",
        "id": 258800932,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1634960420
    },
    {
        "content": "<p>so there's two different issues here - one is the way to capture the negation correctly, and the other is about using Coding in this way. No one else has taken this up, so I'm going to comment about this part.</p>",
        "id": 258816994,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634986264
    },
    {
        "content": "<p>My first reaction was pretty negative because it's just so left field. I don't believe I've ever heard anything like this proposed in any other context in the time I've been in HL7. So:</p>\n<ul>\n<li>it's technically permissable - all value sets are a concept in the space of 'things identified by URLs' so there's no question that this is a valid coding.</li>\n<li>It's totally surprising to anyone used to any kind of HL7 content. Doing subsumption testing with the kind of codes you might be interested in will totally fail</li>\n<li>given that US core has an extensible binding to RxNorm, and this value set is a set of RxNorm codes, I'm finding it head bending to try and figure out whether this Coding shown above is \"If there is no applicable concept in value set, an alternate concept may be used instead\". Perhaps we can at least say, \"a set of RxNorm codes is not in the set of RxNorm codes\" - I think?</li>\n<li>for sure this will catch the validator out - it won't know what to do with that. I think. Did you test that?</li>\n<li>I'm supposing that this is an underlying pattern that will happen with negation - to modulate the meaning of the code, but I don't believe I've heard discussion about this before? This should be referred to MnM (I think) but we don't want to hold up this publication for that discussion, of course.</li>\n</ul>",
        "id": 258817241,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634986664
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Antithrombotic.20Therapy.20Not.20Given/near/258783432\">said</a>:</p>\n<blockquote>\n<p>The existence of an order to not do something in no way guarantees that it wasn't done anyhow...</p>\n<p>This smells to me like Observation.  \"As of this date, I declare that (to the best of my knowledge) the following actions did not happen during period of time X\".  5 minutes later, you might not be able to make that same statement.</p>\n</blockquote>\n<p>What you are calling an observation seems similar to the scenario I asked <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> at the time: <strong>Patient declares that they were prescribed drug X, and declares that they were dispensed drug X, and they swear they didn't take drug X.</strong></p>",
        "id": 258901078,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635113435
    },
    {
        "content": "<p>I don't know if I got the indication right, but IIRC we discussed (in a chat, not sure if it was in a WG meeting) the idea was to use MedStatement.</p>",
        "id": 258901173,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635113569
    },
    {
        "content": "<p>The negation can apply to \"didn't take the drug\" but it can also be used for \"wasn't ordered to do that\".</p>",
        "id": 258901243,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635113662
    },
    {
        "content": "<p>In my view, there are 3 things that seem orthogonal: </p>\n<ul>\n<li>the workflow steps (what we're talking about - whether it was ordered? or it's about whether it was taken)</li>\n<li>a statement vs the actual document (i.e. \"I took the drug\" vs an actual MedAdmin)</li>\n<li>the negation (\"I affirm that I took the drug\" or \"I don't confirm (or I deny) that I took the drug\")</li>\n</ul>",
        "id": 258901424,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635113906
    },
    {
        "content": "<p>The first bullet point is well handled in FHIR Medication. For the other 2, I don't think the separation is that clear.<br>\nI think this should be handled in a simple way to give the 20% a decent chance.</p>",
        "id": 258901517,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635114023
    },
    {
        "content": "<p>On using Coding in this way, if we created a different extension, say a \"notDoneValueSet\" that was applicable on a CodeableConcept and allowed us to say what value set of things weren't done, is that the right way to model this? Would the tooling and/or implementers be able to deal with that more easily?</p>",
        "id": 258994835,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1635183852
    },
    {
        "content": "<p>the tooling yes, but the implementers are more important. Would it be better for them? Probably?</p>",
        "id": 259002534,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635187365
    },
    {
        "content": "<p>We will be meeting with USCore editors on a call on Thursday morning (10:00 ET) to discuss this along with the USCore variances we've requested, call details here: <a href=\"https://www.hl7.org/concalls/CallDetails.cfm?concall=58560\">https://www.hl7.org/concalls/CallDetails.cfm?concall=58560</a></p>",
        "id": 259033112,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1635203661
    },
    {
        "content": "<p>It will be an interesting discussion, the advantage of the approach where a value set url is the code in a coding is that this is essentially exactly what was done in QDM-based QRDA so the ability to align here in FHIR would be nice. I understand it looks odd to many of you but it is essentially what we have already done in valueset.compose if we claim conformance with \"All things in a value set are codes from a code system\" as long as that requirement extends to the compose part versus only the expand part.</p>",
        "id": 259033690,
        "sender_full_name": "Robert McClure",
        "timestamp": 1635204205
    },
    {
        "content": "<p>Looking at this differently, let's say your activity definition said not only \"do one of the procedures from valueset X\", but also said \"do it to this body part and do it in this time range\".  When you're wanting to say \"I did not do\", are you wanting to <em>only</em> assert the bit about the value set, or do you really just want to say \"I did not do this definitional thingy\"?  My suspicion is the latter.</p>",
        "id": 259035167,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635205661
    },
    {
        "content": "<p>If you want to say \"I didn't do this definitional thingy\", then I think you omit the code entirely and just point to the definition.</p>",
        "id": 259035215,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635205685
    },
    {
        "content": "<p>I think another aspect of this needs to be clarified. This use of the value set url as a code is meant to be just like the use of a code from a code system - as the representation of the idea that value set represents, not the expansion of codes you could get. Yes they are related and that is important but the use means I have not done any of the alternatives described by the meaning of the value set. In that way this functions very much like a code. But I also understand that the system of URI's is a big messy thing that no tool could ever conformance test, but I think that could be acceptable; the only tooling that needs to understand the instance with one of these will know to be looking for specific uri's and ignore the system anyway.</p>",
        "id": 259035465,
        "sender_full_name": "Robert McClure",
        "timestamp": 1635205926
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191359\">Bryn Rhodes</span> <a href=\"#narrow/stream/179166-implementers/topic/Antithrombotic.20Therapy.20Not.20Given/near/259033112\">said</a>:</p>\n<blockquote>\n<p>We will be meeting with USCore editors on a call on Thursday morning (10:00 ET) to discuss this along with the USCore variances we've requested, call details here: <a href=\"https://www.hl7.org/concalls/CallDetails.cfm?concall=58560\">https://www.hl7.org/concalls/CallDetails.cfm?concall=58560</a></p>\n</blockquote>\n<p>this bit is not in question for the US Core variance as it \"in addition to\"   We are interested in the use case and whether the \"NotDone\"s can be extended  direactly from USCore/QICore</p>",
        "id": 259037433,
        "sender_full_name": "Eric Haas",
        "timestamp": 1635207774
    },
    {
        "content": "<p>I'm uncomfortable with the idea that a 'valueset' represents a 'concept'.</p>",
        "id": 259040940,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635211282
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> What is the negative consequences of representing a valuesset scope as a concept? Seems all the push back is simply because this is a new way for some of you to think about it. While not the same, we did this for years as concept domains, (which is a different discussion than this, but one we should have!)</p>",
        "id": 259094727,
        "sender_full_name": "Robert McClure",
        "timestamp": 1635254502
    },
    {
        "content": "<p>On the question of whether we want to say \"I didn't do this thingy\" or \"I didn't do any of these\", we have both use cases. Whether other additional information about the activity is relevant depends on the clinical intent (i.e. if the body site is an important part of the activity, then it will be part of the negative statement as well)</p>",
        "id": 259096591,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1635255289
    },
    {
        "content": "<p>We haven't defined ValueSet as having a conceptual meaning, so treating it as though it does is problematic.  Also, the terminology machinery isn't going to work - can't query the display name or definition (and no 'definition text can ever exist even if you could query it), can't do subsumption testing.  Also the 'system' of \"any URI\" would be an exceedingly ill-behaved codesystem where meaning is not consistent and there is no 'versioning' of the system.</p>",
        "id": 259097790,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635255763
    },
    {
        "content": "<p>The terminology machinery worked back when this same method was used in HQMF and QDM based HQMF</p>",
        "id": 259107865,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1635259749
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191991\">@Gay Dolin</span> not sure we can say much about the terminology machinery back then, when everything was hand written. </p>\n<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> the concern for me is that it's not clear how this relates to the definition of the element, or the definition of extensible value sets. It's fine for a concept to refer to a value set, but it needs to do so in a way that meets the applicable definitions</p>",
        "id": 259139479,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635272577
    }
]