[
    {
        "content": "<p>Anyone had an IG which originally was published in US Realm but needed to be migrated for international support (UV-realm)?<br>\nI'm currently doing a discovery on creating a UV-realm version of mCODE (which is published under US-realm) and looking for feedback from others that went through something similar to share HL7 processes you had to go through or best practices.</p>",
        "id": 273526875,
        "sender_full_name": "May Terry",
        "timestamp": 1646070289
    },
    {
        "content": "<p>I haven't, but one of the HL7 processes to be aware of is that you need a new HL7 project to make it happen.  Basically the people who would have reviewed a US-specific IG are not the same as those who would review a UV IG.</p>",
        "id": 273528344,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1646070877
    },
    {
        "content": "<p>SDC went through that.  My understanding is that Grahame didn't much enjoy the process...</p>",
        "id": 273528387,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646070895
    },
    {
        "content": "<p>oh my..a new PSS if there's an mCODE UV IG - I was afraid of that. <span aria-label=\"oh no\" class=\"emoji emoji-1f615\" role=\"img\" title=\"oh no\">:oh_no:</span> <br>\ncc: <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> and <span class=\"user-mention\" data-user-id=\"195479\">@Rute Martins</span></p>",
        "id": 273536485,
        "sender_full_name": "May Terry",
        "timestamp": 1646074552
    },
    {
        "content": "<p>It's also mechanically challenging right now since all the canonical URLs (for profiles, extensions, etc) embed the realm -- i.e., moving realms would change canonical URLs which would break instance-level data.</p>",
        "id": 273537659,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646074958
    },
    {
        "content": "<p>Thanks all for the very enlightening and somewhat sobering replies. Definitely something to consider as we continue our investigation.</p>",
        "id": 273537985,
        "sender_full_name": "May Terry",
        "timestamp": 1646075109
    },
    {
        "content": "<blockquote>\n<p>moving realms would change canonical URLs which would break instance-level data</p>\n</blockquote>\n<p>it doesn't have to but not doing so increases my challenges</p>",
        "id": 273539387,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1646075795
    }
]