[
    {
        "content": "<p>We're in the process of creating a profile on the Apgar score, a test which consist of five assessments which are combined into a total score to determine the clinical status of a newborn child. We want to record these separate assessments as well as the total score, using a profile on Observation:</p>\n<div class=\"codehilite\"><pre><span></span>Observation\n- valueQuantity ... total score\n- component\n  - slice RespiratoryScore\n  - slice AppearanceScore\n  - slice PulseScore\n  - slice GrimaceScore\n  - slice MuscleToneScore\n</pre></div>\n\n\n<p>Each of the component assessments as well as the total are coded using their own LOINC code. Now, this test is repeated at 1, 5 and 10 minutes after birth, and although the assessments are the same at each time point, the different time points are distinguished using different LOINC codes. </p>\n<p>So the question arises if it is better to create a singe profile which can accommodate the three different time points, or to create three different profiles for the three different time points.</p>\n<p>Both approaches have their merits and drawbacks. A single profile means less clutter, but you would need to add slices or valueset bindings on the respective .code elements to make all the LOINC codes available, and then probably throw in some constraints to make sure that the matching codes are selected (for example, that the '1 minute' codes are used in a single instance). Also, we would like to make the code use extensible, so we'd need to find a way that at least one of the three codes is used but that other codes (from different code systems) are allowed as well on each .code element. The approach with three separate profiles would be much cleaner in this respect.</p>\n<p>Any opinions on what would be the best approach? Ironically, the Apgar score is used quite a lot to demonstrate how to model scores in FHIR, but practical profiles seem to be thin on the ground.</p>",
        "id": 166084112,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1558358494
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 166084140,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558358520
    },
    {
        "content": "<p>My expectation is that each APGAR timepoint would be captured as a distinct Observation instances.  You could have a distinct profile for each, but a single profile should probably be ok.  The differentiation would be by the LOINC code of the root Observation.code.</p>",
        "id": 166090583,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558363410
    },
    {
        "content": "<p>I have created several different <a href=\"http://build.fhir.org/observation-examples.html#10.1.8.8\" target=\"_blank\" title=\"http://build.fhir.org/observation-examples.html#10.1.8.8\">example instances</a> in the spec for Observation.   Largely based on the <a href=\"https://forms.loinc.org/48334-7\" target=\"_blank\" title=\"https://forms.loinc.org/48334-7\"> LOINC L Form</a>.   I thnk you have to decide if you want distinct observations or a single with component observations like the examples referenced above.    In my experience no matter what you do there will be vehement opposiition from somebody.   :-)</p>",
        "id": 166092183,
        "sender_full_name": "Eric Haas",
        "timestamp": 1558364573
    },
    {
        "content": "<p>Note that this would be one more example of multiple bindings for Observation.code (panel 1, 5, 10 minutes), and Observation.component.code unless you create a ValueSet for each set of 3.</p>",
        "id": 166095842,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1558367286
    },
    {
        "content": "<p>I think the difficulty lies not in instances, but in profiling - we'd like to make specific profiles for the Apgar score. Since each different time point needs six different LOINC codes (on Observation.code and on .component.code for each of the five components), if you'd want to create a single profile, you'd have to:<br>\n- enforce that the component.codes match the main Observation.code for time point<br>\n- enforce that for each of the six .codes, exactly one of three provided codings is used<br>\n- make sure that other codings may be added for each of the six .codes</p>\n<p>I'm not sure how to do this in a clean way that's obvious to users of the profile, which would suggest three different profiles is the better option. But then again, this feels a bit like overkill.</p>",
        "id": 166245555,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1558512287
    },
    {
        "content": "<p>Short answer is you can do it with 3 simple profiles or one fairly complex profile (where you'll have invariants and need to define value sets for each of the codes)</p>",
        "id": 166273185,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558535583
    }
]