[
    {
        "content": "<p>Is there anything in the FHIR spec that can be used to indicate the applications that are enabled on a per hospital/clinic facility basis?  We are using the Organization endpoint to generate facility records.</p>",
        "id": 268564525,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1642609409
    },
    {
        "content": "<p>Application would typically be represented as a Device.  What do you mean by \"enabled\"?  Do you mean \"this must be configured to allow use for data associated with this Organization\"?</p>",
        "id": 268633443,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642646581
    },
    {
        "content": "<p>By \"enabled\" I mean active/on.  Certain applications in the hospital or clinic are sold as separate add-on features and activated once purchased.  So we want the ability to query Organization and limit the results to only those entries where a certain application is active.</p>\n<p>In one implementation we just added a custom search parameter to filter Organization but I don't think that was the proper solution.  Another solution  that was suggested was to use a _list  filter with an operation (e.g. _list=$applicationA-active) but that too seems wrong.</p>\n<p>I do see that Device.owner references Organization.  Our only use thus far of Device has been for implantable devices.  </p>\n<p>If Device is the correct location for listing these applications I'm having a difficult time seeing how I can properly define its elements.  </p>\n<p>Would we just use (at a minimum) Device.status (active | inactive), <a href=\"http://Device.deviceName.name\">Device.deviceName.name</a>, Device.deviceName.type (with a code of \"other\"), and Device.owner?</p>",
        "id": 268702616,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1642690183
    },
    {
        "content": "<p>It seems to me that since you are trying to do something that isn't directly related to healthcare (software licensing management) there aren't going to be any good matches for resources to meet your need. Anything you do implement is probably going to have to be custom (whether search params or a custom use of a generic resource). </p>\n<p>Perhaps you'd use a Contract resource. You the developer (organization) have contracted with a healthcare facility (organization) to provide an Application for an amount of time. <br>\nThen you could search for all Contracts (that were in force) for a specific application and _include all the referenced Organization resources.</p>",
        "id": 268707358,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1642691893
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I'd like to get your opinion on my response above and Daniel's response.</p>",
        "id": 268741737,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1642705498
    },
    {
        "content": "<p>I do agree with Daniel that software license management is well outside the intended scope of FHIR.  (That doesn't mean that FHIR isn't regularly used outside its intended scope though :&gt;).  Device corresponds to a software 'instance'.  So if each organization has its own 'instance', it'd be a simple query of \"what organizations own instance of device with type X?\".  On the other hand if there's a single instance which has permission to function for users from one organization but not another, then you might look at the new Permission resource in the R5 build.  (If you're using R4, you may be stuck using Basic to approximate it, but at least you can be forward-looking.)  It certainly true that you're unlikely to find any pre-configured solutions that will directly support your requirement without a bit of coaxing.</p>",
        "id": 268794679,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642739332
    }
]