[
    {
        "content": "<p>Has anyone integrated with apple healthkit via FHIR?</p>",
        "id": 154017232,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1541788300
    },
    {
        "content": "<p>What do you mean by integrated? My understanding is that HealthKit is storing FHIR resources in HealthKit but I haven't tried using the HealthKit APIs to pull anything out</p>",
        "id": 154017235,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1541788915
    },
    {
        "content": "<p>You could write libraries to pull out HealthKit data and then convert to FHIR for transmission</p>",
        "id": 154017236,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1541788969
    },
    {
        "content": "<p>We are a large integrated provider.  I want to explore the technology side of integrating our Patient data in Healthkit and then having that data be available to the Patient via their HealthApp.</p>",
        "id": 154017250,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1541794763
    },
    {
        "content": "<p>All I know is Apple is pursuing deep integration of patient data from a series of providers using FHIR (according to the press releases). They have integrated kaiser-Permanente in Washington state, Mayo, and a number of other American institutes. I see by your time zone that you are likely in the UK. If you have an Apple Developer account, you may want to try reaching out to the HealthKit team. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> may have been involved in the discussion and might be able to provide more information. I haven't dug into the API to see how easy it is to store FHIR resources or how to query (or what profiles or version HealthKit may accept). If I find some time I can let you know what I find out</p>",
        "id": 154017307,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1541799117
    },
    {
        "content": "<p>What Apple does with providers is use the existing Argonaut-based FHIR APIs that are hosted/served by the vendors for the provider or by the providers themselves</p>",
        "id": 154017312,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1541800779
    },
    {
        "content": "<p>They allow patients to get data via those APIs in their iPhones, which stores into HealthKit</p>",
        "id": 154017313,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1541800812
    },
    {
        "content": "<p>And I know they announced that they were opening up the HealthKit APIs to developers to get access to that data set, assuming the patient opted in</p>",
        "id": 154017314,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1541800839
    },
    {
        "content": "<p>But from what I understand, apps integrating with HealthKit get access to the locally stored health data that was retrieved using SMART and FHIR previously.</p>",
        "id": 154017315,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1541800910
    },
    {
        "content": "<p>Jenni, from reviewing the API and watching the WWDC video, it appears they are storing the raw resource but I am not sure entirely which resources can be stored right now in HealthKit</p>",
        "id": 154017322,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1541804480
    },
    {
        "content": "<p>Since iOS 12 we have an API that allows apps to retrieve the FHIR resources that a user may have downloaded. You cannot write FHIR data to HealthKit.</p>",
        "id": 154017329,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1541808394
    },
    {
        "content": "<p>For the health data to show up in the Health App the user must connect to your hospital via the FHIR API. Was that the question?</p>",
        "id": 154017330,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1541808491
    },
    {
        "content": "<p>So, confirming what <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> said.</p>",
        "id": 154017331,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1541808611
    },
    {
        "content": "<p>We integrated our myFHR app with HealthKit FHIR data - i.e. we can get FHIR data that has been downloaded into HealthKit, parse it and import it into our app.</p>",
        "id": 154017400,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1541872690
    },
    {
        "content": "<p>(our app can also get the data directly from the FHIR end point, but if you already connected with HeakthKit getting it from there could be quicker)</p>",
        "id": 154017401,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1541872741
    },
    {
        "content": "<p>Presume this is DSTU2 FHIR resources?</p>",
        "id": 154017475,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1541972102
    },
    {
        "content": "<p>Yes</p>",
        "id": 154017514,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1541986538
    },
    {
        "content": "<p>Thanks. Notice it’s still beta and could change to STU3.<br>\nI’ll have a more detailed look at the SDK (I’m learning swift).</p>",
        "id": 154017580,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1542009633
    },
    {
        "content": "<p>I have this from Apple when I asked last week about integration of institutional FHIR sources \"After reviewing the details on the program, I have confirmed that at this time, registration is only available for U.S. healthcare institutions. You can view the full details here\" <a href=\"https://www.apple.com/healthcare/health-records/\" target=\"_blank\" title=\"https://www.apple.com/healthcare/health-records/\">https://www.apple.com/healthcare/health-records/</a>  would be great to know if this blocker is something that can be lifted - have some capability here in Australia going to waste...</p>",
        "id": 154018266,
        "sender_full_name": "Brett Esler",
        "timestamp": 1542155197
    },
    {
        "content": "<p>it could be lifted in the future providing a bunch of things are lined up. One of this would be a clear take on Argonaut for Australia</p>",
        "id": 154018284,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1542163534
    },
    {
        "content": "<p>can make that happen - have the base AU in ballot - so can move forward after that</p>",
        "id": 154018296,
        "sender_full_name": "Brett Esler",
        "timestamp": 1542169238
    },
    {
        "content": "<p>Happy to say that we just successfully integrated with HealthKit, and were able to pull FHIR resources from a phone into Symptomatic.  Was surprised to find that FHIR isn't supported on iPad, only iPhones, which means we're going to need to pivot some of our business plans.  But generally speaking, quite happy with the implementation.  It's not exactly a standard FHIR query; but the data types are DSTU2 conformant, and flowed into the rest of our app without problem.</p>",
        "id": 154022359,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1543771909
    },
    {
        "content": "<p>how is it not standard?</p>",
        "id": 154022578,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543866529
    },
    {
        "content": "<p>iOS devs don't retrieve FHIR data from HealthKit with FHIR API calls, it's via HealthKit API calls (which are local).</p>",
        "id": 154022590,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1543869516
    },
    {
        "content": "<p>ah oh yes - missed that context. thanks</p>",
        "id": 154022595,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543870082
    }
]