[
    {
        "content": "<p>If I look at Epic's <a href=\"http://fhir.epic.com\">fhir.epic.com</a>, I see an Appointment.$find operation that seems functionally equivalent to Slot.Search (which is what Cerner CODE has) - both seem to expose the schedule availability. </p>\n<p>I would imagine the right way to find booked appointments is <a href=\"http://Appointment.search\">Appointment.search</a> and the right way to find availability is Slot.Search, so just wanted to confirm that. I don't see Appointment.$find as a FHIR R4 or DSTU3 operation, but some mention of something similar in Argonaut scheduling documentation.</p>",
        "id": 223988119,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1611625513
    },
    {
        "content": "<p>See <a href=\"http://www.fhir.org/guides/argonaut/scheduling/OperationDefinition-appointment-find.html\">Argo Schedulihng IG</a></p>",
        "id": 223988522,
        "sender_full_name": "Eric Haas",
        "timestamp": 1611625912
    },
    {
        "content": "<p>Not every implementation uses/exposes Slots so this operation smooths over that</p>",
        "id": 223988612,
        "sender_full_name": "Eric Haas",
        "timestamp": 1611625996
    },
    {
        "content": "<p>What's interesting is that Epic does expose the Slot resource, just not for searching (only read)</p>",
        "id": 223994292,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1611632674
    },
    {
        "content": "<p>The issue with <a href=\"http://slot.search\">slot.search</a> is that the rules around managing slots are very complicated.  E.g. a provider might have a rule that says they only want 2 \"new patient\" appointments per day, so once two slots are used for new patients, the rest become unavailable.  That is complicated to communicate in <a href=\"http://Slot.search\">Slot.search</a> (at least in the workflows that folks actually use <a href=\"http://Slot.search\">Slot.search</a> for).  The key difference between $find and <a href=\"http://Slot.search\">Slot.search</a> is that $find delegates the identification of appropriate slots to the server, where <a href=\"http://Slot.search\">Slot.search</a> lets the client determine which slots are appropriate.   it is similar in concept to <a href=\"http://Patient.search\">Patient.search</a> vs. $match.</p>",
        "id": 224046034,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1611671328
    },
    {
        "content": "<p>That makes sense. <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> does Cerner see it that way as well? Or will there be divergent approaches to FHIR based scheduling?</p>",
        "id": 224048752,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1611672443
    },
    {
        "content": "<p>We haven't implemented the STU3 Argonaut standard (we don't have an STU 3 FHIR server). cc <span class=\"user-mention\" data-user-id=\"191357\">@Drew Torres</span></p>",
        "id": 224071784,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1611681419
    },
    {
        "content": "<p>I believe Meditech is using it as well, but it is an STU3 IG.  Briefly discussed updating it to R4, but no decision on that and whether there is critical mass to do it.</p>",
        "id": 224079096,
        "sender_full_name": "Eric Haas",
        "timestamp": 1611684370
    },
    {
        "content": "<p>Okay, so definitely some divergent approaches there. I see eClinicalWorks/Healow using the Slot oriented method.</p>",
        "id": 224095784,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1611691868
    },
    {
        "content": "<p>Also, our use of $find is only for provider-to-provider scheduling, not for patient-facing scheduling.</p>",
        "id": 224096122,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1611692015
    },
    {
        "content": "<p>Can you elaborate? Provider to provider as in cross-organization? Or as in a \"provider app\" (provider/system-level auth)? Couldn't a health system (or developer) create a <a href=\"http://fhir.epic.com\">fhir.epic.com</a> app using those APIs and deploy it with that health system's authorization/acceptance?</p>",
        "id": 224125775,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1611708194
    },
    {
        "content": "<p>Totally understand that slot/appointment isn't USCDI / patient auth, if that's what you mean.</p>",
        "id": 224125824,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1611708234
    },
    {
        "content": "<p>We built it for cross-organization scheduling, so you could schedule a specialist visit  from a PCP office at a nearby partner organization.  So referral-adjacent type stuff.   A <a href=\"http://fhir.epic.com\">fhir.epic.com</a> developer could build an app with those.  However it requires close partnership with the health system.  Behind the scenes there is build needed to determine which visit types, departments, specialties, pools, etc. are considered when identifying candidate slots for $find.  Many organizations don't want to open up their entire schedule for either cross-org or even internal scheduling.  For some departments/providers they'll always want scheduling to go through their schedulers.</p>",
        "id": 224189339,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1611758184
    },
    {
        "content": "<p>However, our current support of $find is not built to work in the patient-facing context.  So the <a href=\"http://fhir.epic.com\">fhir.epic.com</a> apps would be for providers.  We have other options for patient-facing scheduling, but just not $find (at least not now).</p>",
        "id": 224189484,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1611758242
    },
    {
        "content": "<p>There are also a bunch of special rules in $find.  You pass in a patient (and diagnosis I think?), and it finds slots for you that are appropriate for that situation.</p>",
        "id": 224189686,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1611758333
    }
]