[
    {
        "content": "<p>I have two appointment types - remote and in person. How to properly set appointment type  as per FHIR?<br>\nThanks!</p>",
        "id": 186284793,
        "sender_full_name": "Andrey Guzyuk",
        "timestamp": 1579698720
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 186287057,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579700571
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/appointment-definitions.html#Appointment.appointmentType\" target=\"_blank\" title=\"http://build.fhir.org/appointment-definitions.html#Appointment.appointmentType\">http://build.fhir.org/appointment-definitions.html#Appointment.appointmentType</a> - the preffered value set doesn't have a value for 'Virtual', this valueset may actually be more appropriate: <a href=\"http://build.fhir.org/v3/ActEncounterCode/vs.html\" target=\"_blank\" title=\"http://build.fhir.org/v3/ActEncounterCode/vs.html\">http://build.fhir.org/v3/ActEncounterCode/vs.html</a></p>",
        "id": 186312087,
        "sender_full_name": "René Spronk",
        "timestamp": 1579715847
    },
    {
        "content": "<p>Need help to find a preferred valueset to use for In-person, phone consultation and Telehealth appointments? </p>\n<p>We are working on an online appointment booking application with three main types of appointments that can be booked i.e. In-Person, Telehealth (Online Consultation) and Phone Consultation. Appointment request will be sent to third party clinical systems so it's important to send correct mode using a pre-defined codesystem. </p>\n<p>We are using appointment type resource for sending this information in request however, looking for help to find a single preffered value set for all three types. Options we have considered are V2 appointment codes and also SNOMED Telephone consultation but nothing that covers all three. Another option would be to use FHIR ServiceType codesystem as it has Online and Telephone Consultation codes but nothing suitable for a general In-Person or Office Visit. Help is much appreciated.</p>",
        "id": 264396442,
        "sender_full_name": "Umer Dhillon",
        "timestamp": 1639103803
    }
]