[
    {
        "content": "<p>We are currently doing some work in the Appointment domain in our EHR, and at the same time look at FHIR to get some inspiration for simpler mapping later and not having to re-inventing the wheel. </p>\n<p>This stands out in the Appointment resource documentation:</p>\n<p><strong>Hospital Scheduling - Clinical</strong><br>\nClinical scheduling is often far more complex in its requirements and processing. Often this involves checking multiple availabilities across multiple systems and timing with other internal systems, not just those exposed by the Slot resources.</p>\n<p>Consideration should be given to situations where scheduling needs to be handled in more of a queue-like process.</p>\n<p><strong>Implementation Note: </strong>Note: This type of clinical appointment scheduling has not been specifically covered with this definition of the Appointment resource (and other related resources), however if you would like to contribute to the modification of this resource to cover these use cases, please contact the HL7 Patient Administration work-group.<br>\n<a href=\"https://www.hl7.org/fhir/appointment.html#workflow-types\" target=\"_blank\" title=\"https://www.hl7.org/fhir/appointment.html#workflow-types\">https://www.hl7.org/fhir/appointment.html#workflow-types</a></p>\n<p><strong>Question 1</strong><br>\nWhat is the status of the Appointment resource in regards to hospital scheduling? Is there some forum or work group currently discussing how to improv/clarify support for hospital scheduling?</p>\n<p>As an example, we are currently looking at operation scheduling. We need availability of surgery rooms, equipment, and surgeons. The difference between a booked operation and and a normal outpatient clinic visit is not clear though in terms of the scheduling (or non-existent), so we feel having a generic Appointment that has resource requirements is a good way forward for a wide range of booked clinical services. </p>\n<p>Other use cases are things like being able to search for slots for an appointment where all resource requirements are available. </p>\n<p><strong>Question 2</strong><br>\nThis is shorter question. These are the current Appointment statuses: <br>\n<a href=\"https://www.hl7.org/fhir/valueset-appointmentstatus.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-appointmentstatus.html\">https://www.hl7.org/fhir/valueset-appointmentstatus.html</a></p>\n<p>What is the final state of a normal Appointment where the patient arrives and an encounter is created? How are you intended to use the following statuses?</p>\n<ul>\n<li>Arrived - \"The patient/patients has/have arrived and is/are waiting to be seen.\"</li>\n<li>Fulfilled - \"The planning stages of the appointment are now complete, the encounter resource will exist and will track further status changes. Note that an encounter may exist before the appointment status is fulfilled for many reasons.\"</li>\n</ul>",
        "id": 178747777,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1571745389
    },
    {
        "content": "<p>The work group is Patient Administration.  (You can find a link to this work group's home page at the top of the Appointment resource.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> can provide a current state.</p>\n<p>The final state would be fulfilled.  It's possible for an Appointment to transition from \"arrived\" to cancelled.  E.g. Patient arrives on time, but the clinician is called out to deal with a birth and the appointment gets cancelled and rebooked.</p>",
        "id": 178766018,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571757615
    },
    {
        "content": "<p>There is a section on all the state transitions and the interplay between appointment, appointment response and encounter on the appointment page (in sure you found that already)<br>\nThe Argonaut group has done quite a bit of work in this space, but hasn't been absorbed into the core spec as yet.<br>\n<span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>, can you reference where that work got to?</p>",
        "id": 178797608,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1571777086
    },
    {
        "content": "<p>The <a href=\"http://fhir.org/guides/argonaut/scheduling/OperationDefinition-appointment-find.html\" target=\"_blank\" title=\"http://fhir.org/guides/argonaut/scheduling/OperationDefinition-appointment-find.html\">Argonaut Scheduling IG</a> defined some operations for find availability then booking an appointment.  Those operations were meant to let a client to provide info about what sort of appointment they want, and approximately when, and the server would then go off and do whatever it needed to behind the scenes to identify what resources are needed and determine their availability.  Thie $find operation then returns a list of proposed appointments.  The client then picks which one they want, and uses $book to book that slot.  With $book, the server is also responsible for sorting out all the resources needed and making sure they are all reserved appropriately.</p>",
        "id": 178851518,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1571836260
    }
]