[
    {
        "content": "<p>There is an AppointmentResponse resource in the FHIR spec but no AppointmentRequest. So my question is : what resource do I need to use use to make an appointment? Is it the Appointment resource (with a particular status)? If yes, how do we differentiate the Appointment resource as the object of appointment from the Appointment resource as the request of the appointment?</p>",
        "id": 153968351,
        "sender_full_name": "Isabelle Gibaud",
        "timestamp": 1528728011
    },
    {
        "content": "<p>good point, <span class=\"user-mention\" data-user-id=\"194609\">@Isabelle Gibaud</span> the resource seems to be Appointment,</p>",
        "id": 153968354,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528728188
    },
    {
        "content": "<p>but I am not at ease where it says \"The Appointment request pattern used is different from the order-response pattern used elsewhere in FHIR. This is due to the close relationship to the iCal standard.\"</p>",
        "id": 153968355,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528728191
    },
    {
        "content": "<p>Appointment works sort of like iCal.  When an appointment is scheduled, all of the participants are invited.  They can then indicate whether they're planning to come or not.</p>",
        "id": 153968356,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528728195
    },
    {
        "content": "<p>You can check people's calendars by querying for open slots before scheduling the appointment</p>",
        "id": 153968357,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528728233
    },
    {
        "content": "<p>an iCal invite seems considerably consistent with the request pattern</p>",
        "id": 153968358,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528728240
    },
    {
        "content": "<p>With the request pattern, there's essentially an \"order\" that can then be fulfilled.  That's not what happens with an appointment.</p>",
        "id": 153968359,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528728287
    },
    {
        "content": "<p>hmmm, from a user perspective, i'd say that iCal works with a request (invite) and a response (confirmation). How does it differ?<br>\nI may have to read on iCal.</p>",
        "id": 153968360,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528728343
    },
    {
        "content": "<p>(note, i am not interested in forcing the pattern, but it just seems quite  aligned)</p>",
        "id": 153968361,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528728449
    },
    {
        "content": "<p>this sounds like a good excuse not to miss the workflow call today.</p>",
        "id": 153968362,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528728493
    },
    {
        "content": "<p>The confirmation isn't an Event.  It's essentially an update of the Request indicating someone who plans to attend.</p>",
        "id": 153968363,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528728707
    },
    {
        "content": "<p>yep.</p>",
        "id": 153968364,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528728733
    },
    {
        "content": "<p>Thank you for your answers. So I understand that I must use the Appointment resource, OK. In some use cases, the application will  exchange an Appointment and in other use cases the application will exchange an appointment request (same resource = Appointment). How the receiving application will make the difference between the two use cases (same resource used, but the two resources have not same semantic)?</p>",
        "id": 153968367,
        "sender_full_name": "Isabelle Gibaud",
        "timestamp": 1528728950
    },
    {
        "content": "<p>Right. I am looking at ordering workflows (we will have many scenarios where there is an update without having an event - this is why in my mind an update is an event itself.). It's worth a later discussion for this. for now...</p>",
        "id": 153968368,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528729098
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194609\">@Isabelle Gibaud</span> : <br>\n12.11.1.1 The basic workflow to create an appointment <br>\nMaking the Appointment Request<br>\nWhen an appointment is required, a requester creates new Appointment resource with the Appointment.status=\"proposed\".<br>\nAll included participants (optional or mandatory) should have the status=\"needs-action\" to allow filtering and displaying appointments to user-participants for accepting or rejecting new and updated requests. Based on internal system business rules, certain statuses may be automatically updated, for example: \"reject because the requested participant is on vacation\" or \"this type of user is not allowed to request those specific appointments\".<br>\nReplying to the request<br>\nThe reply process is simply performed by the person/system handing the requests updating the participant statuses as needed. If there are multiple systems involved, then these will create AppointmentResponse entries with the desired statuses.<br>\nOnce all participants have their participation status created/updated (and the main system marking the appointment participant records with the AppointmentResponse statuses) then the overall status of the Appointment is updated.</p>",
        "id": 153968369,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528729118
    },
    {
        "content": "<p>Status of \"proposed\" vs. \"booked\" I guess</p>",
        "id": 153968371,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528729153
    },
    {
        "content": "<p>Thank you  lloyd and Jose, your answers are very clear <span class=\"emoji emoji-263a\" title=\"relaxed\">:relaxed:</span></p>",
        "id": 153968372,
        "sender_full_name": "Isabelle Gibaud",
        "timestamp": 1528729331
    },
    {
        "content": "<p>Hence why it is not useful for FHIR to re-invent other standards...  Where iCal standard satisfies, we should not be duplicating. At least without defining exactly why and how we interact with that standard.</p>",
        "id": 153968378,
        "sender_full_name": "John Moehrke",
        "timestamp": 1528730621
    }
]