[
    {
        "content": "<p>Suppose I'm booking an appointment for an eConsult: how do I convey the virtual location of that? In our use case we assume a URI to exist as starting point. This could be a webex/skype/zoom/fcc/http link.</p>\n<p>Appointment could have a .participant.actor Location or HealthcareService that describes the virtual service. HealthcareService relies on Location for the actual 'address'. </p>\n<p>Location is scoped to be a physical location, which seems to contradict the virtual notion of an eConsult. My initial leaning goes towards Location.telecom nonetheless.</p>\n<p>Help appreciated. <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>?</p>",
        "id": 169468248,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1562061931
    },
    {
        "content": "<p>You're right there. The location has indeed been scoped to physical, the only wiggle room in the definition is jurisdiction, but that's not what you're after.<br>\nI thought it wasn't so tight, but that's what it is.<br>\nHealthcare servo e is feeling better, and would suggest an endpoint for the details of the service.<br>\nCould even schedule the HCS.<br>\nDont need to have the location on the HCS if not needed.</p>",
        "id": 169468976,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1562062796
    },
    {
        "content": "<p>Thanks. HealthcareService.endpoint is 0..*, so presumably when I want to say \"please log in at this endpoint\" I would have to make sure that my HealthcareService instance has a 1..1 connection to Endpoint.</p>\n<p>Would scheduling an EndPoint actor directly from Appointment not make more sense? If you feel it deserves some discussion I could file a tracker for it?</p>",
        "id": 169470204,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1562064341
    },
    {
        "content": "<p>Specify which type of endpoint rather than constraing the reference.</p>",
        "id": 169473213,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1562067868
    },
    {
        "content": "<p>Healthcare services should have lots for various purposes.</p>",
        "id": 169473237,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1562067909
    },
    {
        "content": "<p>One for inbound referrals etc.</p>",
        "id": 169473248,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1562067926
    }
]