[
    {
        "content": "<p>Hi!<br>\nI’m fairly new to FHIR and have a question related to the use of multiple appointments versus the use of the multiplicity of Slots in an appointment when planning for a patients visit to the outpatient clinic. My use case is as follows:</p>\n<p>I want to schedule an appointment for the patient on the same day at the outpatient clinics in the hospital from say, 07:00 to 11:00 during which the patient will have several activities set up for her. At 07:15, the activity is to undergo radiology screening, at 08:30, for consultation to check the healing of a punctured lung by consulting a physician, and 10:15 to meet with an orthopedist to check the healing progress of the eight broken ribs and fracture collarbone. They is only one referral/service request. </p>\n<p>As I understand, an appointment bundle with one appointment for each activity and one slot for each could represent this. Another way to represent this is by using one appointment with several slots, using slots (and schedule) to reflect each activity. <br>\nI have met some arguments that the idea behind slots is to only represent free (or booked) time-slots in a schedule but find no explicit limitation in the specification to use slots only in that setting, and for me it seems to be most tidy to only use one appointment getting the different resources through slot and schedule.</p>\n<p>Any advice would be appreciated.</p>",
        "id": 241756960,
        "sender_full_name": "Tore Bjerke",
        "timestamp": 1623062447
    },
    {
        "content": "<p>The definition of Appointmtn.slot states</p>\n<blockquote>\n<p>The slots from the participants' schedules that will be filled by the appointment.</p>\n</blockquote>\n<p>To me, this is a clear indication that you need to use multiple appointments for your use case.</p>",
        "id": 241773560,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1623071389
    },
    {
        "content": "<p>I would recommend against the slots too, that's really around availability and discovery, not actual appointment details.<br>\nThe use of multiple appointments (with the various services/practitioners) makes sense, all linked back to the same ServiceRequest (referral).</p>",
        "id": 241818122,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1623089664
    }
]