[
    {
        "content": "<p>I need to add participant as a Room / Resource in appointment. Is there a way to do that?<br>\nI am using HAPI FHIR 2.1 implementation.</p>",
        "id": 153869667,
        "sender_full_name": "Divya Ahuja",
        "timestamp": 1485944300
    },
    {
        "content": "<p>Just do exactly as you've described, and other participant with the actor reference pointing to the room (location resource) that you want to.<br>\n(or device resource if equipment)</p>",
        "id": 153869737,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1485988537
    },
    {
        "content": "<p>Has anyone integrated Appointments with Outlook or with a Resource Manager such as OptaPlan from the JBOSS BPM Resource Optimization?  I would love to get some of your insights on the approach and results.</p>",
        "id": 153870884,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1486655824
    },
    {
        "content": "<p>I have a question about appointment resoure.</p>\n<p>I know that after all the participants update their status then the overall status of appointment should be changed. But I am not understanding how and who will change the overall status at that time when all the participants will update their status?</p>",
        "id": 153871812,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1487222463
    },
    {
        "content": "<p>Server and enviroment decision, depends if a human is expected to be in the loop and authorizations/negotiarions are needed.</p>",
        "id": 153871817,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1487223277
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> so in simple words in my software application I have to explicitly watch if all the participants have updated the status then update the overall status of appointment is it true?</p>",
        "id": 153871829,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1487227900
    },
    {
        "content": "<p>That's about right, my server processes it on the submission of the response.</p>",
        "id": 153872150,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1487282997
    }
]