[
    {
        "content": "<p>Where would you store the time of an appointment cancellation? I could not find an obvious spot in the Appointment and the AppointmentResponse resources</p>",
        "id": 197420579,
        "sender_full_name": "Domenico Corapi",
        "timestamp": 1589380145
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 197444552,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589389679
    },
    {
        "content": "<p>In the Provenance resource?</p>",
        "id": 197467045,
        "sender_full_name": "René Spronk",
        "timestamp": 1589399462
    },
    {
        "content": "<p>Thanks for the suggestion, Provenance might work. <br>\nAlthough the problem in our specific case is that we are already generating a Provenance object whose timestamp refers to when the cancellation was received/processed rather than when it happened (could have been on a phone call actioned by an operator). We could create another provenance resource and use something like the agent in order to differentiate, but we are also considering using an extension for it.</p>",
        "id": 197527534,
        "sender_full_name": "Domenico Corapi",
        "timestamp": 1589447664
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 197554358,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589463302
    },
    {
        "content": "<p>Yes you could have a Provenance that is specific to the canceling event, vs when it was received. <br>\nAlthough I am the Provenance  advocate, this canceling time seems like it is fundamental enough to appointment typical (not normal) flow. So I would advocate for the canceling time to become an element in the Appointment, along with cancelingReason that is already there.  The FHIR modeling for Provenance recognizes that sometimes an element of Provenance is so critical to the resource being designed that it needs to be represented in the resource (e.g. author). <br>\nThis said, I am not an expert in the art of appointments.</p>",
        "id": 197556516,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589464150
    },
    {
        "content": "<p>One of the problems being that the cancellation time will be be relevant from a 'storage' perspective, but less some from an interoperability perspective. FHIR is an interoperability standard, right ? ;-)</p>",
        "id": 197557039,
        "sender_full_name": "René Spronk",
        "timestamp": 1589464396
    },
    {
        "content": "<p>Also not an appointment expert but my view here is that a cancellation time is on par with the \"cancellation reason\" and \"created\" fields  from an interoperability perspective</p>",
        "id": 197568740,
        "sender_full_name": "Domenico Corapi",
        "timestamp": 1589468839
    },
    {
        "content": "<p>I think it is interop relevant as it indicates when the cancellation happened. Which would be needed to understand state change..  It could be considered something that should be recorded in a communication record that held the cancelation.  right?</p>",
        "id": 197569319,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589469004
    },
    {
        "content": "<blockquote>\n<p>It could be considered something that should be recorded in a communication record that held the cancelation.  right?</p>\n</blockquote>\n<p>That is stretching it too far out, IMO.</p>",
        "id": 197570725,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1589469528
    },
    {
        "content": "<p>Wouldn't be using the modified value when that content was defined in the history, and for what purpose are you looking to use the value?</p>",
        "id": 201567987,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1592801622
    },
    {
        "content": "<p>Most of status-based resources should have to deal with this as a requirement... perhaps statusDate rather than having distinctive element related to each status</p>",
        "id": 203885423,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1594759352
    }
]