[
    {
        "content": "<p>At Appointment creation, I need to know the Account so that Coverage can be verified.<br>\nBut it looks like Account doesn't exist at Appointment. Only at the Encounter.<br>\nIs there no tie between the Appointment and Account?</p>",
        "id": 153978087,
        "sender_full_name": "Bo Pritchard",
        "timestamp": 1532552398
    },
    {
        "content": "<p>The account(s) are linked to the patient directly. There can be multiple of these, and multiple coverages (which is what you're really looking for)<br>\nNot sure if when making the appointment you'd be doing much here other than verifying that they had one (not pre-auths etc) and when admitting (begining the encounter) the actual account/coverage selection would be finalised and created/assigned as needed</p>",
        "id": 153978103,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1532554023
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> at Appointment creation I'd need coverage to check eligibility.<br>\nI don't see how to get from Appointment -&gt; Coverage(s)</p>",
        "id": 153980338,
        "sender_full_name": "Bo Pritchard",
        "timestamp": 1533143277
    },
    {
        "content": "<p>At Appointment creation I need Account.Coverage so eligibility can be checked.<br>\nBut I can't see how to get there from Appointment. Encounter has Account, why doesn't Appointment?</p>",
        "id": 153980340,
        "sender_full_name": "Bo Pritchard",
        "timestamp": 1533144632
    },
    {
        "content": "<p>Appointment -&gt; Patient, Coverage -&gt; Patient, so Patient is your linkage point.  If you want filtered coverages specific for an Appointment, that would be an extension I think.</p>",
        "id": 153980506,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533160393
    },
    {
        "content": "<p>Rationale for difference is that the decision of what coverages to use is typically made at the time the encounter starts because what coverages the patient has might change between when the appointment is made and when the encounter starts.</p>",
        "id": 153980509,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533160493
    },
    {
        "content": "<blockquote>\n<p>Appointment -&gt; Patient, Coverage -&gt; Patient, so Patient is your linkage point.  If you want filtered coverages specific for an Appointment, that would be an extension I think.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I understand that you can get from Coverage -&gt; Patient, but is there a way to get from Patient -&gt;Coverage(s)?</p>",
        "id": 153980928,
        "sender_full_name": "Bo Pritchard",
        "timestamp": 1533215616
    },
    {
        "content": "<blockquote>\n<p>Rationale for difference is that the decision of what coverages to use is typically made at the time the encounter starts because what coverages the patient has might change between when the appointment is made and when the encounter starts.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I understand what you're saying, but the use case would be:<br>\nFront desk person creates Appointment with Coverage. 3 days before appointment an eligibility check runs to verify coverage for said appointment. That way the practice has an opportunity to interact with patient about financial arrangements if ineligible. Make sense? Encounter time is too late.</p>",
        "id": 153980930,
        "sender_full_name": "Bo Pritchard",
        "timestamp": 1533215843
    },
    {
        "content": "<p>Patient doesn't point to Coverage.  Coverage points to Patient.  However, that should still let you find the Coverages for the Patient.</p>",
        "id": 153980944,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533218885
    },
    {
        "content": "<p>The use-case makes sense.  And you can propose a change request for a standard extension and an evaluation of whether this capability is sufficiently common to justify including in core.</p>",
        "id": 153980945,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533218926
    },
    {
        "content": "<blockquote>\n<p>Patient doesn't point to Coverage.  Coverage points to Patient.  However, that should still let you find the Coverages for the Patient.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  So there is currently no way (extension or otherwise) to include an Account or Coverage within the Patient resource?</p>",
        "id": 153980955,
        "sender_full_name": "Bo Pritchard",
        "timestamp": 1533220580
    },
    {
        "content": "<p>You just query for the coverages associated with the patient (and you have the patient ID) so it looks like this<br>\n<a href=\"http://sqlonfhir-stu3.azurewebsites.net/fhir/Coverage?patient=5\" target=\"_blank\" title=\"http://sqlonfhir-stu3.azurewebsites.net/fhir/Coverage?patient=5\">http://sqlonfhir-stu3.azurewebsites.net/fhir/Coverage?patient=5</a></p>",
        "id": 153981224,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1533248626
    },
    {
        "content": "<p>1. The doctor has agrees with some Insurer Companys, not all, and this create constrainst on scheduling<br>\n2. Customers can have various insurance plans, actives at the same date, and choose to use what is most conveniente in that moment<br>\n3. To refer to what insurer plan, i need to use an extension of the resource? Or i sould create a Bundle with resources Patient and Coverage?</p>",
        "id": 157044533,
        "sender_full_name": "Hélder Cunha",
        "timestamp": 1548698857
    },
    {
        "content": "<p>Extension to which resource?  Once the visit starts, you'll have an Account to track the charges for the encounter and that Account will be tied to the relevant/selected Coverage(s).</p>",
        "id": 157059028,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548710802
    },
    {
        "content": "<p>Extension to resource appointment.  It’s before visit starts. Refer to the insurance plan on the appointment.</p>",
        "id": 157063327,
        "sender_full_name": "Hélder Cunha",
        "timestamp": 1548714644
    },
    {
        "content": "<p>Just a comment...<br>\nIn our EHR we also have the ability to set an Account for who will be paying for an Encounter and the services provided within them. This can be done at the booking stage, i.e. when arranging the Appointment. Some appointments are not allowed to be made without the Account details set. </p>\n<p>It sounds like there is a common requirement for capturing Account details on Appointment? Going through the patient is not a sufficient solution as it can be associated with multiple accounts. </p>\n<p>Is there maybe a need for a standard extension here? Or even better, can an Account reference be included in the Appointment resource?</p>",
        "id": 157115258,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1548777943
    },
    {
        "content": "<p>That sounds like a good thing to submit as a change proposal - either a core element or a standard extension sounds like a good idea.  <span class=\"user-mention\" data-user-id=\"197234\">@Martin Grundberg</span> can you submit a change request?</p>",
        "id": 157116410,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548778991
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , sure, is this the correct place? <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemBrowse&amp;tracker_id=677\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemBrowse&amp;tracker_id=677\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemBrowse&amp;tracker_id=677</a></p>",
        "id": 157174377,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1548841894
    },
    {
        "content": "<p>Yes</p>",
        "id": 157196269,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548862946
    },
    {
        "content": "<p>Hi Martin, also in our Italian scenario we need to track the kind of Payment for the encounter (Patient's Private Insurance or some NationalProgramme), which is the old HL7 v2.x field FinancialClass. This information, as well as the Nhspriority and the prescriptiontype impacts in the scheduling business logic 'cause they can enable some \"reserved\" availabilities in slots. For this reason in our FHIR server we added FinancialClass, NhsPriority and NhsPrescriptionType as extensions for Encounters and ServiceRequest. We hope this suggests will be accepted and integrated in the canonical resource and in case it will not we will try to define an Italian Profile  in order to include this attributes.</p>",
        "id": 157367494,
        "sender_full_name": "vania manzelli",
        "timestamp": 1549040656
    }
]