[
    {
        "content": "<p><a href=\"/user_uploads/10155/HEZ9wOFQMUdeOItts7VVZO9S/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a><br>\nI'm writing code that essentially parses StructureDefinitions into JsonSchemas. This is throwing both myself and my code off. How is this interpretted in real life? Should there be anywhere between 1-5 extension objects in an array? Is this legal in a structure definition? I haven't found any others with duplicate keys like this.. If anyone has an STU3 page with this style of rules, or especially a JsonSchema representing one, I'd appreciate it.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/HEZ9wOFQMUdeOItts7VVZO9S/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/HEZ9wOFQMUdeOItts7VVZO9S/pasted_image.png\"></a></div>",
        "id": 153975160,
        "sender_full_name": "Dread Hawk",
        "timestamp": 1531498631
    },
    {
        "content": "<p>It's totally legal - and expected - to do this in profiles.  You can set different constraints on different repetitions that have the same name.  In this case, there could be 50+ extension objects.  The profile has just described a specific set of extensions that are expected to be supported, but it's not enumerating everything that's possible.</p>",
        "id": 153975178,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531507191
    },
    {
        "content": "<p>note that the IG publisher already produces Json schemas from StructureDefinitions</p>",
        "id": 153975322,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531701382
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ...umm.... I look for this periodically and  last time I checked:</p>\n<div class=\"codehilite\"><pre><span></span>&lt;p style=&quot;color: maroon; font-weight: bold&quot;&gt;yet to be done: json schema as html&lt;/p&gt;\n</pre></div>\n\n\n<p>I can't locate the json schema files in the temp directory or the output directory.  What are they called?</p>",
        "id": 153975507,
        "sender_full_name": "Eric Haas",
        "timestamp": 1531763677
    }
]