[
    {
        "content": "<p>Hi everyone,</p>\n<p>Is there any way in HL7 FHIR to associate between them observations of a taken measure?.</p>\n<p>That is, if in a pulse oximetry measurement, I get Spo2, heart rate, and perfusion index. How could you define that these observations belong to the same measure?<br>\nOr for example, to add the cardiac pulse in a measure of blood pressure, but associated with it, and not as an independent observation.....</p>",
        "id": 153998502,
        "sender_full_name": "Mariano Garuz",
        "timestamp": 1537436608
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196877\">@Mariano Garuz</span> <br>\nI link then with the derivedFrom element (not the best name as it is misleading; I was assured that it does not mean the measurement was actually obtained from that measurement during the balloting process).</p>",
        "id": 153998504,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537436924
    },
    {
        "content": "<p>Those other measurements could also be seen as all part of the same Observation. Thus you have a primary Oxygen saturation value, and a set of components.  This indicates that those component values are all part of the same observation. They don't stand on their own. In the component element they can be well defined, so the fidelity doesn't get lost.  <a href=\"http://hl7.org/fhir/STU3/observation.html#10.1.4.1\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/observation.html#10.1.4.1\">http://hl7.org/fhir/STU3/observation.html#10.1.4.1</a></p>",
        "id": 153998538,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537446269
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> These wouldn't all be on the same Observation.  SPO2 and heart rate are completely separate measures.  They often can be captured independently and can certainly be analyzed independently.  (That's different than the parts of an APGAR or a susceptability level and an antibiotic - for those, they need to be reported together to be useful.)</p>",
        "id": 153998630,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537455113
    },
    {
        "content": "<p>Association of Observations right now is just linked by same performer, same device, same or proximate time.  You could, if you wanted, report them as a panel - so an overall Observation with multiple members as a way of linking them too.  Do you have a need for somethign more than those options?</p>",
        "id": 153998634,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537455234
    },
    {
        "content": "<p>derivedFrom isn't appropriate unless there's true derivation - and cardiac pulse and blood pressure aren't derived from each other.</p>",
        "id": 153998635,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537455274
    },
    {
        "content": "<blockquote>\n<p>derivedFrom isn't appropriate unless there's true derivation - and cardiac pulse and blood pressure aren't derived from each other.</p>\n</blockquote>\n<p>I will be very disappointed, I remitted on my negative vote on this change because I was assured what I could do with the former 'related' element (I think it was) I could still do. 'derivedFrom'is still perhaps okay in my use case but in that case there is no direct derivation. It does contain some important information that may have helped in populating some of the elements in the current observation.</p>",
        "id": 153998646,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1537455772
    },
    {
        "content": "<p>I don't understand what the issue is.  They are independent measures.  How are they related besides be taken at the same time by the same device?   If you want them reported as a panel then use a panel.  Otherwise there is no intrinsic dependency or preconditions on the measurements.</p>",
        "id": 153998664,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537457715
    },
    {
        "content": "<p>If there is a requirement to interpret one observatino in light of another observaition  then see this...  <a href=\"http://build.fhir.org/observation.html#refine\" target=\"_blank\" title=\"http://build.fhir.org/observation.html#refine\">http://build.fhir.org/observation.html#refine</a>   But again - as a clinician -  I don't see this applying here either.</p>",
        "id": 153998665,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537457887
    },
    {
        "content": "<p>You could always group them in a List resource where List.source points to the device that created them all.</p>",
        "id": 153998666,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1537457916
    },
    {
        "content": "<p>There a many ways to group Observations documented here... <a href=\"http://build.fhir.org/observation.html#obsgrouping\" target=\"_blank\" title=\"http://build.fhir.org/observation.html#obsgrouping\">http://build.fhir.org/observation.html#obsgrouping</a> <br>\n  List is not one of them</p>",
        "id": 153998667,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537457985
    },
    {
        "content": "<p>If we are suggesting that List never be used to group Observation resources, then perhaps that should be noted here:<br>\n<a href=\"http://build.fhir.org/list.html#bnr\" target=\"_blank\" title=\"http://build.fhir.org/list.html#bnr\">http://build.fhir.org/list.html#bnr</a></p>",
        "id": 153998668,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1537458193
    },
    {
        "content": "<p>List can be used to group all sorts of things, but grouping Observations would be somewhat unusual.  It certainly wouldn't be an appropriate way to convey \"these things were Observed as a group\".</p>",
        "id": 153998670,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537458245
    },
    {
        "content": "<p>hasMember or grouping in a DiagnosticReport would be the appropriate solutions for that.</p>",
        "id": 153998671,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537458284
    },
    {
        "content": "<blockquote>\n<p>There a many ways to group Observations documented here... <a href=\"http://build.fhir.org/observation.html#obsgrouping\" target=\"_blank\" title=\"http://build.fhir.org/observation.html#obsgrouping\">http://build.fhir.org/observation.html#obsgrouping</a> <br>\n  List is not one of them</p>\n</blockquote>\n<p>as is indicated in this section \"Because the idea of what to group together is often highly contextual and based upon the end user's point of view, the choice of which structure to use will be driven by jurisdiction, organizational practice and context. Profiling will normally be necessary for implementation.\"</p>",
        "id": 153998676,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537459232
    },
    {
        "content": "<p>so clearly there is an important IG or Profile needed to deal with Lab results that do have many values. Like Pulse Ox, Cholesterol, etc...  Lacking these, then any of these groupings seem up for grabs</p>",
        "id": 153998678,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537459378
    },
    {
        "content": "<p>There's specific guidance in the core spec.  You can't use \"componentOf\" unless the observation can't reasonably be interpreted independent of others - and obviously that's not true of the relationship between heart rate and blood pressure.  There's similar guidance for the others.  The expectation is for implementers to follow the guidance provided.  There will certainly be some degree of variance.  Some will report APGAR without components, some will report it with. Some will organize data into panels, others won't.  But you can't choose components for something that aren't clearly components, nor can you split data that's not separably interpretable into distinct Observations.</p>",
        "id": 153998695,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537463632
    },
    {
        "content": "<p>that is indeed the point... Lacking those guides where there is questionable independent observations we will have some using one Observation with multiple component values where others will be reporting multiple Observations.  This is simply the state of the FHIR standard, and typical for a standard to offer regional or other alternatives.</p>",
        "id": 153998709,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537468039
    },
    {
        "content": "<blockquote>\n<p>Hi everyone,</p>\n<p>Is there any way in HL7 FHIR to associate between them observations of a taken measure?.</p>\n<p>That is, if in a pulse oximetry measurement, I get Spo2, heart rate, and perfusion index. How could you define that these observations belong to the same measure?<br>\nOr for example, to add the cardiac pulse in a measure of blood pressure, but associated with it, and not as an independent observation.....</p>\n</blockquote>\n<p>seems to me an SpO2 Observation could have components of the heart rate during that measurement, and perfusion index during that measurement. That specific question, seems legitimate to be one Observation.  The heart rate is key to the SpO2 measurement. to take it as a standalone heart rate seems less useful.</p>",
        "id": 153998711,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537468174
    },
    {
        "content": "<p>SpO2 is a measure of oxygen saturation.  It's not clear to me how heart rate is a key to that measure.  In this specific case, there are already mandatory vital signs profiles implementers are expected to adhere to.  And heart rate and oxygen sat are captured as separate Observations.</p>",
        "id": 153998712,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537468381
    },
    {
        "content": "<p>I think there is no clear way to relate independent, yet related measures because they are done for example in the same clinical intervention.</p>",
        "id": 153998941,
        "sender_full_name": "Mariano Garuz",
        "timestamp": 1537523270
    },
    {
        "content": "<blockquote>\n<p>I think there is no clear way to relate independent, yet related measures because they are done for example in the same clinical intervention.</p>\n</blockquote>\n<p>that would be Observation.partOf(Procedure)</p>",
        "id": 153998943,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1537524263
    },
    {
        "content": "<p>I think this stream is getting a little off topic.  The original question was how to relate independent measures.  Lloyd answered correctly.  Physiologically hr and bp are correlated but the measures are independent.  What I think Brian meant was equivalent to saying “the code for a bp when the hr is X.  “.  We have both guidance and an extension if you want to be explicit about all the associated concurrent measures and I encourage everyone to read the spec. I personally think you don’t need to do this though</p>",
        "id": 153999055,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537547205
    },
    {
        "content": "<p>And do as Lloyd suggested</p>",
        "id": 153999064,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537549117
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/StructureDefinition/observation-precondition\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/observation-precondition\">http://hl7.org/fhir/StructureDefinition/observation-precondition</a> is extension.</p>",
        "id": 153999066,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537549309
    },
    {
        "content": "<p>New in R4 and I thought was in response to Patrick’s tracker</p>",
        "id": 153999067,
        "sender_full_name": "Eric Haas",
        "timestamp": 1537549345
    },
    {
        "content": "<p>I've read this thread a couple of times, the STU3 guidance, and current guidance; and I'm still not clear on the best route to take. </p>\n<p>To add to the conversation, here is another use-case. <br>\nI have a fitness tracking device which will send a daily summary of various things for a period (step count, calories burned, exercise minutes, heart rate highs/lows, etc.)</p>\n<p>I would like to maintain some grouping of the individual Observations, if possible. </p>\n<p>The guidance on DiagnosticReport states that it should be associated with an order - not the case here. </p>\n<p>Creating a grouping/parent Observation and linking the Observations via Observation.related could make sense in STU3, but less clear in R4 as Observation.related becomes Observation.derivedFrom. </p>\n<p>What is the best way to do this - or is there a \"best\" way. </p>\n<p>Thanks</p>",
        "id": 154007510,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1539188632
    },
    {
        "content": "<p>Each Observation would be captured on its own.  Those leaf-level Observations would not show any relationship to each other.  However, you could also create a grouping/panel Observation that pointed to each of the leaf-level Observations using the <code>hasMember</code> element.  (derivedFrom would potentially be appropriate to link minutes or steps to calories burned if the calorie calculation was made based on one or both of the other Observations, but it would not be appropriate to link most of them with that relationship.)</p>",
        "id": 154007513,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539189312
    },
    {
        "content": "<p>Thanks Lloyd. I need to check my reading comprehension skills, ha.. Somehow I overlooked  'Observation.hasMember'.   So in STU3 I can use 'Observation.related' with a type code of \"hasMemeber\" and in R4 transition to 'Observation.hasMember'.</p>",
        "id": 154007547,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1539195155
    },
    {
        "content": "<p>Correct</p>",
        "id": 154007548,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539195342
    }
]