[
    {
        "content": "<p>Good morning to all of you!</p>\n<p>We are currently working on a use case, where an Encounter needs to be associated with a ResearchStudy to perform analyses. Achieving this however, was not as trivial as it sounds and we would appreciate some input. Consider the following architecture: </p>\n<p><a href=\"/user_uploads/10155/uOyylTC2MJfZEUWfl8yxTqKq/EncounterResearchStudy.png\">EncounterResearchStudy.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/uOyylTC2MJfZEUWfl8yxTqKq/EncounterResearchStudy.png\" title=\"EncounterResearchStudy.png\"><img src=\"/user_uploads/10155/uOyylTC2MJfZEUWfl8yxTqKq/EncounterResearchStudy.png\"></a></div><p>Two research studies use the same PlanDefinition as a protocol which will result in two instances, namely the CarePlans. Let's suppose each CarePlan has one encounter and you now attempt to associate them with their respective ResearchStudy. You backtrack up until the PlanDefinition but as we have two ResearchStudies implementing the same PlanDefinition, we can not unanimously associate the Encounter with the original ResearchStudy. </p>\n<p>Our only solution for this issue would be to use an extension on the CarePlan pointing to the ResearchStudy. This might also solve the same issue for other resources connected to the CarePlan. </p>\n<p>Has anyone encountered (haha) a similar problem and found a more elegant solution? <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> What do you think about this?</p>",
        "id": 224441675,
        "sender_full_name": "Yannick Börner",
        "timestamp": 1611908660
    },
    {
        "content": "<p>There's a standard extension to allow linking resources that are associated with a study (or multiple studies) to the study directly.  However, this requires an awareness in the system that maintains the resource that that linkage exists.  Otherwise, you're faced with the tracing exercise you showed.  (I might actually trace a secondary path through Patient to ResearchSubject.  If the same patient wasn't part of both studies, that would allow you to disambiguate.)</p>\n<p>The extension in question is here: <a href=\"https://build.fhir.org/extension-workflow-researchstudy.html\">https://build.fhir.org/extension-workflow-researchstudy.html</a></p>",
        "id": 224540251,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611957737
    },
    {
        "content": "<p>Thank you for your reply Lloyd. We thought about using the patient as a differentiator but the case of the patient being part of both studies could actually happen in this project. We'll go with the linked extension! <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span>  <span class=\"user-mention\" data-user-id=\"194020\">@Gustav Vella</span></p>",
        "id": 224587466,
        "sender_full_name": "Yannick Börner",
        "timestamp": 1612016628
    }
]