[
    {
        "content": "<p>I have been asked about a FHIR profile for Asthma Action Plans - and a key attribute of the inhaler is its color (to distinguish the preventative inhaler from the reliever inhaler) -- there does not seem to be an obvious place to put this - it could be a added as an extension to medication.image, an extension in medication.package.container, as an alternate code in medication.code, or as an extension on medicationstatement itself -- and it needs to be recordable even if the rest of the details about the inhaler are not available -- eg - be able to say \"I use a blue inhaler\" or \"I use a blue xxxx inhaler\" where xxxx is the actual medicinal product.  As a follow-up question - there is a need to say whether it is a preventer inhaler or reliever inhaler -- again it seems that there are a few ways this could be done - and it would be nice to be consistent -- given that 10% of the population have asthma and may need help with medication when travelling -- anyone done this already and/or got a suggestion?  many thanks ... charlie</p>",
        "id": 153970921,
        "sender_full_name": "Charlie McCay",
        "timestamp": 1529572958
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"192080\">@John Hatem</span> ?</p>",
        "id": 153970922,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529574509
    },
    {
        "content": "<p>while waiting for an answer, i'd just say that inhaler is not \"container\", it is an associated device.</p>",
        "id": 153970923,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529576991
    },
    {
        "content": "<p>(at least from what I read in IDMP)</p>",
        "id": 153970924,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529577030
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>   many thanks for responding - and for the correction re IDMP and associated device -- the question then moves to whether there is a consistent way to indicate the colour of a device.... I assume that it is common practice to use a description to help patients and their carers identify a medication or device -- it is interesting that the device resource does not have an \"image\" attribute so you can have a picture of the blue pill, but not \"blue pill\" as text.  It would be nice if both device and medication would support an image or (structured) textual description ... maybe as a \"standard extension\" if this is not really a common requirement</p>",
        "id": 153970929,
        "sender_full_name": "Charlie McCay",
        "timestamp": 1529579109
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"194796\">@Charlie McCay</span> continuing the IDMP theme, ISO 11615 does include the colour of a device. I am currently working to bring all of 11615 into FHIR, so this is something that is in scope for me. There is a ProdCharacteristic datatype in the FHIR build (though for technical reasons that I don't understand it doesn't yet show up in the datatypes page) which is what MedicinalProductDeviceSpec uses to record dimensions and colour. It is also used for colour and shape of tablets etc. This is all very draft and may change significantly. Also these resources are  intended for regulatory use, perhaps extending into medicinal knowledge base use (maybe via MedicationKnowledge resource), and perhaps not for day to day prescribing i.e. patient says its the brown one. But clearly there are points of overlap.</p>",
        "id": 153971759,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1530013130
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194796\">@Charlie McCay</span> MedicationKnowledge includes an attribute to support an image of a medication.  This resource is not intended to be used for prescribing, dispensing or administering medication.  The use case for this resource is to support drug information queries which I believe your use case is - looking up a drug to help a patient identify their medication.</p>",
        "id": 153971821,
        "sender_full_name": "Melva Peters",
        "timestamp": 1530028207
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> and <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>   many thanks for your suggestions -- it does seem that this would be a reasonable extension to the usage of MedicationKnowledge -- in this case the information about the medication may come from the supplier via a catalogue lookup -- but it may also come from the patient or their carer.  If a patient has a patient-held action plan, they would want to be able to update it with the correct colour (that is what they can do with the paper form, and we should not be making life more difficult).   More generally I would have thought that with apps for to help with patient/informal carer administration of medication, being able to store a description in text of medication items seems to me something that should be supported by the medicationstatement/medicine - or something like medicationknowledge linked to that -- with teh description being updateable by clinicians, patients, or whoever is the author / informant of the  medicationstatement.  Another usecase requiring a similar partial description of a medicine would be reporting that a child has eaten some pills that were blue (from her grandfathers bedside)...   My other thought was that this is something that is dealt with as a QuestionnaireResponse -- and not worrying about using a medication-specific  resource at all ... but would rather do something more elegant.  My ideal solution would be having drugCharacteristic from medicationKnowledge available in the medication resource.... maybe renamed medicationCharacteristic</p>",
        "id": 153971841,
        "sender_full_name": "Charlie McCay",
        "timestamp": 1530031111
    },
    {
        "content": "<p>medicationKnowledge.drugCharacteristic should support color.</p>",
        "id": 153971844,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530031232
    },
    {
        "content": "<p>so, yes, if the term \"drug\" in drugcharacteristic\" is misleading, then it could be renamed</p>",
        "id": 153971845,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530031292
    },
    {
        "content": "<p>(my 2 cents for <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> to comment on)</p>",
        "id": 153971846,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530031305
    },
    {
        "content": "<p>the fact that a patient can identify also the color should be supported and this will be an interesting discussion to continue : boundary between medicationKnowledge and medication. I think that reality may compel us to do some changes once we flesh out the kind of content we need.</p>",
        "id": 153971847,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530031380
    },
    {
        "content": "<p>the partial description of drugs is rather common (\"i take the white pills\", \"i am allergic to the round ones\" \"i only know the brand name, not the dosage\")so my guess is that we can have a profile&amp;combination of medicationKnowledge and medication which would support that you use formulary for full descriptions, but in other situations you can have more or less partial descriptionsof the drug - from a simple code to a more descriptive medicaiton description.</p>",
        "id": 153971849,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530031575
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> many thanks - sounds promising - seems like we may need to use an extension on medication to keep things clean  until this is resolved</p>",
        "id": 153971853,
        "sender_full_name": "Charlie McCay",
        "timestamp": 1530032222
    },
    {
        "content": "<p>If your use case is clinical (patient informing about characteristics of the product) then you a) either refer to a MedicationKnowledge as Melva pointed out (with the awareness that as she says, it is a bit draft) or b) you indeed use an extension</p>",
        "id": 153971857,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530034641
    }
]