[
    {
        "content": "<p>Hi everyone,<br>\nLooking over <a href=\"https://www.hl7.org/fhir/async.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/async.html\">https://www.hl7.org/fhir/async.html</a>, it's not exactly clear how the Async RESTful interaction works. For example, a Create Patient call would return the location of the Patient ID, along with any OperationOutcomes in case of warnings and errors (after the Create Patient has been processed). What happens in an Asynch RESTful call, since the Patient ID is not yet available, nor the OperationOutcomes?<br>\nFHIR Async Messaging addresses this by allowing the client to call the server to check for responses. Is there something similar designed for Async RESTful?</p>",
        "id": 164086384,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1556116857
    },
    {
        "content": "<p><a href=\"https://www.hl7.org/fhir/async.html#3.1.6.4\" target=\"_blank\" title=\"https://www.hl7.org/fhir/async.html#3.1.6.4\">https://www.hl7.org/fhir/async.html#3.1.6.4</a> talks about Bulk Data status check</p>",
        "id": 164088154,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1556117899
    },
    {
        "content": "<p>Thanks Yunwei. It wasn't clear if the Bulk Data sections (3.1.6.3, 3.1.6.4) was specific to the Bulk Data IG operations ($export), or if it applied to all RESTful interfaces running in Async mode.  An async RESTful interaction doesn't necessarily have to be \"Bulk Data\", it could just be a single Create interaction, so that was confusing. Can someone confirm that the Bulk Data sections apply equally to all RESTful interactions in Async mode?</p>",
        "id": 164089087,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1556118485
    },
    {
        "content": "<p>The whole page is still under construction. It has mixed content from Async and Bulk data. Bulk data is under May's ballots. This page may get reorganized after that.</p>",
        "id": 164102756,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1556127809
    },
    {
        "content": "<p>the async pattern can apply to any request, though it doesn't really make sense to apply to simple Get requests. But it can apply to a Create Patient interaction. And I don't understand the question - the async operation redirects to a new location where the client queries until it gets the response it would have go in the first place</p>",
        "id": 164121223,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556141084
    },
    {
        "content": "<p>bulk data uses the async pattern but they are not one and the same</p>",
        "id": 164121235,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556141099
    }
]