[
    {
        "content": "<p>When transmitting a FHIR message, you can indicate multiple recipients.  The initial message is posted to an endpoint which ensures the message gets appropriate fanned out and delivered to its target recipients (possibly with numerous additional systems intervening).  If the message fails at one of the intermediaries, is there a \"proper\" way to indicate the failure to deliver to all recipients short of sending a separate message for each intended recipient?  If so, what would that convention be?  (My concern is that if I send a message from A to B, C and D, it'd be a bit confusing to have a response message from Z to A saying the message couldn't be processed.)</p>",
        "id": 153863632,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481819573
    },
    {
        "content": "<p>is this a message of consequence? </p>",
        "id": 153863634,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481824476
    },
    {
        "content": "<p>Yes - It asks for something to be done or delivers something, but sends it to additional recipients as \"ccs\"</p>",
        "id": 153863638,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481826935
    },
    {
        "content": "<p>how do they know which is which?</p>",
        "id": 153863640,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481834230
    },
    {
        "content": "<p>The payload distinguishes.  </p>",
        "id": 153863646,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481836787
    },
    {
        "content": "<p>how does the payload distinguish which is cc:?</p>",
        "id": 153863647,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481837100
    },
    {
        "content": "<p>Extension on Communication.recipient</p>",
        "id": 153863648,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481837255
    },
    {
        "content": "<p>that matches the message header?</p>",
        "id": 153863650,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481837343
    },
    {
        "content": "<p>Composition is targeted to practitioners, one of whom is \"primary\".  Practitioner will live at one of the targeted systems</p>",
        "id": 153863657,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481851686
    },
    {
        "content": "<p>Are the receivers all peers? From the designation of one as 'primary' you'd expect that the implication of that one not being delivered may not be the same as other not being delivered. It appears as though the message to the 'primary' is the message of consequence and the others are really notifications. If the primary fails then the notifications should be recalled.</p>",
        "id": 153865190,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1483353336
    },
    {
        "content": "<p>If as you say the communication is requesting action, will all of the recipients know to look for the extension to determine that they are not supposed to provide the action? Should this be elevated, for safety reasons, from being an extension to being an infrastructure concept and therefore meta element?</p>",
        "id": 153865191,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1483353663
    },
    {
        "content": "<p>The receivers are all peers, but yes there's a difference in expected behavior.  If message delivery isn't successful, then the content would be delivered in other ways (fax, phone, mail) so I don't think there'd be a need to reverse the notifications.  The question of whether this should be a \"must-understand\" is a good one.</p>",
        "id": 153865196,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1483372914
    },
    {
        "content": "<p>Thoughts on the original question?</p>",
        "id": 153865197,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1483372925
    },
    {
        "content": "<p>Yes this must be a 'must understand' as you are modifying the meaning of an action request where the the presence of the extension means for some to not follow the request and perform the action since this is just a notification.</p>",
        "id": 153865241,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1483428841
    },
    {
        "content": "<p>Also, if you fail to deliver the action request by any means I don't see how you have any choice but to reverse the notification. When is situation dependent.</p>",
        "id": 153865242,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1483428966
    }
]