[
    {
        "content": "<p>Hi,<br>\n We are planning to develop a FHIR asynchronous messaging between two entities to exchange documents using bundle based messaged as described here under the async interaction pattern here <a href=\"https://www.hl7.org/fhir/messaging.html#async\">https://www.hl7.org/fhir/messaging.html#async</a>.<br>\nPage indicates that sender and received can get their latest messages and acknowledgements using time based queries such as  <br>\nGET [base]/Bundle?message.destination-uri=[rcv]&amp;_lastUpdated=&gt;2015-03-01T02:00:02+01:00</p>\n<p>We are also floating an idea to track read status(pending/read/ failed) at the server, and also provide a custom query parameter to query by read/acknowledgement status.<br>\nWhile I acknowledge this is technically possible, we are discussing whether this in line with general design goals of this message pattern.<br>\nMainly, we are introducing read status and acknowledgement into the server, which are meant for the two endpoints involved. <br>\nQuery parameter is representing something not tracked or contained within resources  (i.e. read, pending)<br>\nDoes fhir provide any other mechanism to track user activity on read/pending statuses of resources in general ( primarily meant for improve client experience, in this case )</p>\n<p>Like to hear the thoughts from the community, </p>\n<p>Thanks <br>\nSanjaai</p>",
        "id": 211948824,
        "sender_full_name": "Sanjaai",
        "timestamp": 1601574964
    },
    {
        "content": "<p>I have a customer who has done something like that, but rather than trying to track 'read' status (which is hard), their workflow calls for the client to submit a batch of 'deletes' for the resources they've successfully read and written to persistent store (and which thus no longer need to be stored on the intermediary mailbox system).  Obviously the mailbox retains an audit log of everything that's passed through.</p>",
        "id": 211962224,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601580666
    },
    {
        "content": "<p>Anything that isn't deleted will show up on the next query and presumably get deleted then if it somehow gets missed the first round.</p>",
        "id": 211962281,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601580696
    },
    {
        "content": "<p>Follow-up question on Async Messaging.</p>\n<p>As part of the acknowledgement message, we would like to add an additional destination/recipient on this acknowledgement. Does this break any rules and/or expectations on how Async Messaging should work?</p>",
        "id": 217778940,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1606235740
    },
    {
        "content": "<p>The original message from Sender A is being sent to Destination [B, C] (two destinations). On the acknowledgement response, Destination B is responding to originating Sender A.<br>\n1) What should Destination B do with Destination C from the originating message? The guidance in the Async Messaging documentation is that Sender and Destination are inverted, but doesn't talk about how to deal w/ multiple destinations.<br>\n2) On the acknowledgement from Destination B, could Destination B \"cc\" Destination C on the acknowledgement?</p>",
        "id": 217779627,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1606236016
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> for guidance/feedback</p>",
        "id": 217786791,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1606238909
    },
    {
        "content": "<p>In general, an acknowledgement goes from whichever destination received the message to the sender. Expecting/requiring that an acknowledgement will also go to a third party (even if it was one of the destinations in the original message) seems to be a custom/non-standard behavior.</p>\n<p>If you have complex workflow orchestration  requirements, have you looked <a href=\"http://build.fhir.org/branches/argonaut-subscription/subscriptions.html\">at subscriptions</a>, and the RESTful API?</p>",
        "id": 217794062,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1606242200
    },
    {
        "content": "<p>Is the question whether B is responsible for routing to C or whether it can assume that it's A's responsibility to get it to C?  I would have presumed the former.  In the end, there would be two acknowledgment messages, one from B and one from C with a destination of A.</p>",
        "id": 217948145,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606344511
    },
    {
        "content": "<p>Basically the scenario is this:<br>\nSender A sends the message to Org B and Org C through an intermediary messaging system.<br>\nOrg B attempts to process the message (async) and determines there was a fatal-error in doing so.<br>\nOrg B send the appropriate error response to Sender A via the intermediary message system, however, because it's an error Org B also wants to send the response to Org C for their records.</p>",
        "id": 218037780,
        "sender_full_name": "Chris Mota",
        "timestamp": 1606424277
    },
    {
        "content": "<p>I don't think there's any standard mechanism for C to receive B's response.</p>",
        "id": 218042572,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606429729
    },
    {
        "content": "<p>Okay so then i guess in this situation, the most appropriate path forward would be for Org B to instead send a new message to Org C containing the appropriate data?</p>",
        "id": 218105695,
        "sender_full_name": "Chris Mota",
        "timestamp": 1606492380
    },
    {
        "content": "<p>Either that or A could wrap B's response and pass it on to C (if B and C don't know how to talk to each other)</p>",
        "id": 218114347,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606498002
    }
]