[
    {
        "content": "<p>I'm having issues with the Atom <code>cql-language</code> plugin. Nothing happens when I try to run the CQL execution nothing happens. Has anyone else experienced this and troubleshooted? So far I've tried restarting atom, updating it, uninstalling and reinstalling the plugin.</p>",
        "id": 248360633,
        "sender_full_name": "Rebecca Green",
        "timestamp": 1628088593
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"427685\">@Rebecca Green</span>  - you might want to ask this in the <a class=\"stream\" data-stream-id=\"179220\" href=\"/#narrow/stream/179220-cql\">#cql</a> channel.<br>\nYes, I've run into this before.  I believe the cql-language plugin page (<a href=\"https://atom.io/packages/language-cql\">https://atom.io/packages/language-cql</a>) has instructions on what needs to be setup in your (local) test directory structure for the CQL execution, e.g. you need to have a folder that is the name of the library and under that folders with the patientId for any (all) test patients you want to run the tests against, and then the actual test resources to use for the tests.</p>",
        "id": 248363056,
        "sender_full_name": "John Silva",
        "timestamp": 1628089557
    },
    {
        "content": "<p>Thanks for the response <span class=\"user-mention\" data-user-id=\"298707\">@John Silva</span>!  The weird thing is that I do have that folder structure set up.</p>",
        "id": 248365163,
        "sender_full_name": "Rebecca Green",
        "timestamp": 1628090480
    },
    {
        "content": "<p>Do you have the correct Java runtime in your path?  I also had to run the CQL with Atom opened up in the correct folder or else it wouldn't find things.   I also ran into the problem (misunderstanding) that the top-level folder has to be the name of the CQL library, e.g. the on in the CQL file like this:   library MyTestLib version '0.0.1' (i.e.  MyTestLib -- not sure if it's case sensitive, I expect it would be on Linux/Mac.)</p>",
        "id": 248389859,
        "sender_full_name": "John Silva",
        "timestamp": 1628102199
    },
    {
        "content": "<p>Hey I'm really hoping someone can help me out here - I'm struggling!</p>\n<p>I work healthcare EMR company and need to turn our raw clinical data residing BigQuery into CQM measure scores per doctor. I've just stumbled on CQL and it seems like that might be the best tool to get the job done in an efficient manner.</p>\n<p>I know SQL and Python. Can anybody point me in the right direction to learn about how to use CQL with SQL and/or Python? </p>\n<p>How should underlying data be structured to conform to the \"retrieve\" CQL command? </p>\n<p>Can I download CQL like any other language and use in my IDE? </p>\n<p>Is there any place in the internet where someone starts with raw claims data, uses CQL, and returns a CQM numerator/denominator?</p>\n<p>ANY help would be greatly appreciated!</p>",
        "id": 248974704,
        "sender_full_name": "Michael Douglas",
        "timestamp": 1628600217
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 248976703,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628601185
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"431769\">@Michael Douglas</span> - already answered here: <a href=\"#narrow/stream/179220-cql/topic/Intro.20to.20CQL\">https://chat.fhir.org/#narrow/stream/179220-cql/topic/Intro.20to.20CQL</a><br>\nWelcome to the community.  A few hints: </p>\n<ul>\n<li>Please don't ask the same question on multiple streams unless asked to do so.  </li>\n<li>Also, please edit your topic to be specific to the question you asked.  (For example this one is posted under a conversation about Atom plugins, which isn't really related to your question.)</li>\n</ul>",
        "id": 248977239,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628601470
    }
]