[
    {
        "content": "<p>The documentation for a Attachment.hash specifically states the has is SHA1.  It's interesting because it doesn't seem to include any extensibility mechanism for future, or other current hash algorithms.</p>",
        "id": 176019057,
        "sender_full_name": "Jeremy Chapman",
        "timestamp": 1568822668
    },
    {
        "content": "<p>Yes that seems like a problem. Should we add a new coded element to indicate the hashing algorithm used? SHA-1 is now regarded as vulnerable and is falling out of use. (Although this particular case is intended more to protect against accidental data corruption rather than intentional attacks.)</p>",
        "id": 176019911,
        "sender_full_name": "Nick Radov",
        "timestamp": 1568823256
    },
    {
        "content": "<p>We don't care that it's vulnerable.  The intention isn't to secure the information, it's to check if the data has changed.</p>",
        "id": 176021210,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568824161
    },
    {
        "content": "<p>If you wanted to secure it, you'd use a different element (probably DigitalSignature)</p>",
        "id": 176021321,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568824202
    },
    {
        "content": "<p>it's a trip wire for not using it for crypto stuff</p>",
        "id": 176027442,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568828438
    },
    {
        "content": "<p>Lloyd and Grahame nailed it. For more discussion of why it is NOT a cryptographic signature see my write up for the exact same need in XDS with the exact same solution, and where new people end up with a misunderstanding of the purpose of the hash -- <a href=\"https://healthcaresecprivacy.blogspot.com/2019/06/xds-sha-1-is-still-okay.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2019/06/xds-sha-1-is-still-okay.html\">https://healthcaresecprivacy.blogspot.com/2019/06/xds-sha-1-is-still-okay.html</a><br>\nI welcome suggestions on ways to improve the description of these elements (in both IHE and HL7). They clearly need clarification.</p>",
        "id": 176184313,
        "sender_full_name": "John Moehrke",
        "timestamp": 1568979115
    },
    {
        "content": "<p>The pain is when you already have a (different) hash that you want to use rather than being forced to compute a new one.</p>",
        "id": 176184408,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1568979203
    },
    {
        "content": "<p>understood. You are free to add an extension for your custom hash.. but now you put a burden on the recipients that they also have have your hash. So we picked one for this need. And aligning it with XDS allows intermediaries between the technology to not need to re-calculate a hash (which would be a failure-mode). Most important is that there is no value to the need for a different hash.</p>",
        "id": 176184747,
        "sender_full_name": "John Moehrke",
        "timestamp": 1568979587
    },
    {
        "content": "<p>you have to compute your own surely?</p>",
        "id": 176187300,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568982175
    },
    {
        "content": "<p>In our case, low level code has already computed and checked a (SHA256) hash, so we're happy with the integrity of the file.  We don't want to have to re-process the file at this point in the handling to compute another hash.  Instead we use an extension.<br>\nTo <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> s point about putting a burden on recipients, the use case for us is that clients have a manifest from a trusted source that lists the SHA256 hash, and they wish to know that it corresponds with the hash of the <em>input</em> to a function that resulted in a derived artifact.  i.e., we're saying here is f(X) for that \"X\" over there (URL) and it had this hash when we used it to compute f(X).</p>",
        "id": 176289105,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1569117038
    }
]