[
    {
        "content": "<p>We're profiling an observation for the description of wounds and we would like to attach a picture of the wound too. What would be the way to go? My suggestion is to  make an extension with valueAttachment. Is this a good idea or are there better options?</p>",
        "id": 170536167,
        "sender_full_name": "Sebastiaan Raap",
        "timestamp": 1562761360
    },
    {
        "content": "<p>We are also profiling resources for wound management (WoundSummary, National Consensus for the documentation of leg ulcera). We plan to use a media resource for the picture, but I am currently thinking about how to tell the media it is made because of a special wound. Probably you/we could use a clinical impression to summarize the observations and the media. What do you think?</p>",
        "id": 170537362,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1562762392
    },
    {
        "content": "<p>We're using Condition to state that a patient has a wound, one Observation (with lots of components) for our wound observables like wound edge, woundwith, woundlength. we've chosen to put this all in one observation so you've got them grouped together because  you to be able to discriminate between assessments over time. As we're on STU3 we're using the extension Observation.reasonReference to link it to the Condition, in R4 we would use Observation.focus. </p>\n<p>We planned on using Media for the wound photo's, but linking it to an Observation is not something the standard is describing. That's why we just want to extend the Observation with Attachments where you can place the photo's made during the assessment. </p>\n<p>Do I understand correctly (from your previous posts as well) that you want to make Observations (one per observable) and Media's (for the photo's) in which you will refer to ClinicalImpression (to group the observables to discriminate between assessments), which will refer to a Condition (which describes the existence of the wound at a certain bodySite?    </p>\n<p>I certainly think that implementation would make sense, but we're a bit hesitant on using ClinicalImpression because of the maturitylevel of 0, which has been 0 over STU3 and R4.</p>",
        "id": 170540623,
        "sender_full_name": "Sebastiaan Raap",
        "timestamp": 1562764928
    },
    {
        "content": "<p>Is one Encounter or a series of Encounters? (I think I've seen similar events linked by Encounter)</p>",
        "id": 170540800,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1562765050
    },
    {
        "content": "<p>I think both approaches have their charm and consider the different use cases. <br>\n<span class=\"user-mention\" data-user-id=\"215518\">@Sebastiaan Raap</span>  Your description of our approach is correct. For us this is the better approach as in our project the idea is to gather information from other systems and use these data for clinical decision support. <br>\n<span class=\"user-mention\" data-user-id=\"191687\">@Kevin Mayfield</span>  Therefore we may have different Encounters.</p>",
        "id": 170541730,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1562765676
    },
    {
        "content": "<p>I think I modelled a ER use case using multiple encounters under a master encounter. Each obs, condition, etc was linked to the child encounter.</p>",
        "id": 170541872,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1562765795
    },
    {
        "content": "<p>Sounds legit. but wouldn't you refer to the Condition in the master encounter? Since Encounter.diagnosis.condition and Encounter.reasonReference is a Condition for which the encounter has taken place, not the resulting diagnosis from that encounter, as is the consensus in <a href=\"#narrow/stream/179166-implementers/topic/Type.20of.20Condition\" title=\"#narrow/stream/179166-implementers/topic/Type.20of.20Condition\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Type.20of.20Condition</a></p>",
        "id": 170542479,
        "sender_full_name": "Sebastiaan Raap",
        "timestamp": 1562766298
    },
    {
        "content": "<p>use DocumentReference. It would then be Observation.derivedFrom</p>",
        "id": 170544140,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562767501
    },
    {
        "content": "<p>reminder that a 'document' in the terms of DocumentReference is not the same as CDA defines as Document. It is more the definition of document in the context of http... that is some bits that have a mime-type. DocumentReference is then filled with the available metadata about that document. In your case the image.</p>",
        "id": 170544272,
        "sender_full_name": "John Moehrke",
        "timestamp": 1562767598
    },
    {
        "content": "<p>But would \"derivedFrom\" not mean that the content of the observation is derived from the document?</p>",
        "id": 170544424,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1562767716
    },
    {
        "content": "<p>so you have the picture and look at it and say: 5 cm wide, 2 cm broad, 1 cm deep, ...</p>",
        "id": 170544478,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1562767775
    },
    {
        "content": "<p>I would have recorded a new Condition against a child encounter (Condition.encounter). If that Condition was also a diagnosis I would record it in the parent encounter. I suppose I'm using the child encounters as a journal.</p>",
        "id": 170545133,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1562768247
    },
    {
        "content": "<p>If the value is the observation then I think valueAttachment is the way to go.  If it’s a “here is the image upon which my observation is based used the docref as derived from.  We are planning to merge Media into docref and are considering bringing valueAttachment back for R5.  There is resistance from the from the owning workgroup on adding it so will be posting a straw poll here in near future to measure implementer sentiment.</p>",
        "id": 170547798,
        "sender_full_name": "Eric Haas",
        "timestamp": 1562770169
    },
    {
        "content": "<p>You can also use BodyStructure to link Observations,Procedures and other resources to a single locayion/wound/lesion.  There is a standard extension for that linkage</p>",
        "id": 170591577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562804209
    },
    {
        "content": "<p>I just had a look at the extensions for Media: reasonReference is possible (<a href=\"https://www.hl7.org/fhir/extension-workflow-reasonreference.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/extension-workflow-reasonreference.html\">https://www.hl7.org/fhir/extension-workflow-reasonreference.html</a>)</p>",
        "id": 181647236,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1574436125
    },
    {
        "content": "<p>Media is likely to go away, replaced by docref</p>",
        "id": 181648166,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1574436669
    },
    {
        "content": "<p>Thanks for the hint!!!<br>\nAs we are now profiling in r4 we need it this way. For further developments we will keep this in mind and add our IG accordingly.</p>",
        "id": 181648416,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1574436817
    },
    {
        "content": "<p>DocumentReference is in R4.. so why not start with DocumentReference and prevent pain in the future?</p>",
        "id": 181650907,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574438465
    },
    {
        "content": "<p>If I use DocumentReference, do I use context.related to connect it to the wound (and the body structure)?</p>",
        "id": 181797252,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1574665326
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 181797751,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574666201
    },
    {
        "content": "<p>An example how I plan it can be seen here <a href=\"https://simplifier.net/ui/publication/show?projectkey=PosiThera&amp;pubUrlKey=PosiTheraWoundPhoto\" target=\"_blank\" title=\"https://simplifier.net/ui/publication/show?projectkey=PosiThera&amp;pubUrlKey=PosiTheraWoundPhoto\">https://simplifier.net/ui/publication/show?projectkey=PosiThera&amp;pubUrlKey=PosiTheraWoundPhoto</a></p>",
        "id": 181797769,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1574666269
    },
    {
        "content": "<blockquote>\n<p>If I use DocumentReference, do I use context.related to connect it to the wound (and the body structure)?</p>\n</blockquote>\n<p>yes. That is used to connect it to any kind of resource not listed in a specific .context element (e.g. .context.encounter)</p>",
        "id": 181834766,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574697176
    },
    {
        "content": "<p>Thanks a lot to all of you. I think now I have it.</p>",
        "id": 181899464,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1574757060
    }
]