[
    {
        "content": "<p>What is the best way to attach a questionnaireResponse to a serviceRequest?<br>\n1) Reference the QuestionnaireResponse from ServiceRequest.SupportingInfo<br>\n2) Reference the ServiceRequest from QuestionnaireResponse.basedOn<br>\n3) Other?</p>\n<p>Note: This is a questionnaire that is submitted with the request, not in response to the request (i.e., the serviceRequest is not being FULFILLED by this QuestionnaireResponse, it's being submitted). </p>\n<p>I was considering QuestionnaireResponse.basedOn buy am having second thoughts based on the description which says \"Request FULFILLED by this QuestionnaireResponse\" ... which is not the scenario.</p>\n<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 153940167,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1519414885
    },
    {
        "content": "<p>We're planning to talk about Questionnaire-related workflow as part of the <a href=\"https://chat.fhir.org/#narrow/stream/questionnaire/subject/SDC.20call\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/questionnaire/subject/SDC.20call\">Structured Data Capture</a> project.</p>\n<p>Where you attach sort of depends on why you're attaching.  If it's information to take into account or that is expected to help when executing the request, <code>supportingInfo</code> is appropriate.  <code>basedOn</code> is really intended to point to \"request\" resources - so plans, proposals or higher level orders that help to provide justification/authorization for this particular ServiceRequest.  But it might be possible to have an extension pointing to it as a \"reason\" for the order or perhaps some other sort of link.</p>",
        "id": 153940179,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519416202
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , in this case Questionnaire is meant to capture a \"Referral Form\" used in a eReferral process flow. Let's say i'm referring to meals on wheels, and i want to know a) the patient's food preferences (puree, kosher, etc...), b) If there's a dangerous dog when delivering, c) etc...</p>\n<p>i.e., to collect all of the miscellaneous info that gets asked in a referral for things other than your core data like demographics, location, etc...</p>\n<p>So yes, it's \"information to take into account that is expected to help when executing the request\". So sounds like /supportingInfo is the right option then?</p>",
        "id": 153940197,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1519417374
    },
    {
        "content": "<p>Yes.  Though be aware that information in a QuestionnaireResponse is more limited in terms of computable interoperability than discrete observations or something like that.  (Not saying QuestionnaireResponse is inappropriate for your use-case, just encouraging you to make sure you've thought about the tradeoffs.)</p>",
        "id": 153940204,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519419137
    },
    {
        "content": "<p>Ok interesting, when using observations in a serviceRequest, should the by referenced by serviceRequest.supportingInfo too?</p>",
        "id": 153940336,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1519495991
    },
    {
        "content": "<p>If it's information included in the proposal/plan/order to aid in the execution of the requested event, yes.</p>",
        "id": 153940338,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519499236
    },
    {
        "content": "<p>Would the same logic apply to clinical/diagnostics/medications resources that might help inform to serviceRequest, such as  an /allergy, or /MedicationStatement, even though those resources exist referencing the same /patient that is referenced by the /serviceRequest?</p>\n<p>e.g., reference an /allergy resource in serviceRequest.supporting info?</p>",
        "id": 153940352,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1519504082
    },
    {
        "content": "<p>The way I think of it, \"supportingInfo\" is intended to provide links to those things the author of the request feels that the filler is likely to need to know/have access to when performing the requested activity (but that don't actually define the requested activity).  If you were going to send the request in a messaging or other loosely coupled environment, you'd include all the resources pointed to by \"supportingInfo\" as part of the message bundle.</p>",
        "id": 153940357,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519507000
    },
    {
        "content": "<p>Yeah, I think that the QuestionnaireResponse should be attached to the serviceRequest vie the supporting information property.</p>",
        "id": 153940390,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1519562690
    }
]