[
    {
        "content": "<p>Hi folks,<br>\nI'm trying to understand how Security Labels might work with Attribute-Based Access Control. Is there a way to encode/include Patient Identifier information in a resource's meta tag? We're looking at ways to apply Access Control to FHIR resources using the Security Labels, but also trying not to pry into the resource content itself to identify who the resource is about (e.g. reading the resource's subject element). That way, consent blocks and access control can be applied without messing with the data itself, and can generally be content-agnostic. How have other live implementations done this?<br>\nThanks for any feedback!</p>",
        "id": 154019254,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1542397626
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ?</p>",
        "id": 154019259,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542397863
    },
    {
        "content": "<blockquote>\n<p>Is there a way to encode/include Patient Identifier information in a resource's meta tag? </p>\n</blockquote>\n<p>no. I think you need to provide more context</p>",
        "id": 154019325,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1542431109
    },
    {
        "content": "<p>in order to apply patient specific rules, you must look at the .patient and/or .subject. Putting this same information in a different location would be simply duplicative and thus an opportunity to be out-of-sync.</p>",
        "id": 154019392,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542487446
    },
    {
        "content": "<p>We reported this as one of the issues in Consent enforcement. Determining the identity of the patient whose Consent policy applies to a given resource is a challenge we have reported in our previous demos (see Section 1.8 <a href=\"https://gforge.hl7.org/gf/project/security/docman/CCDE%20Consumer%20Centered%20Data%20Exchange%20Connectathon/CCDE%20Interim/UMA_Consent_Management_Service-2017-11-27.pdf\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/security/docman/CCDE%20Consumer%20Centered%20Data%20Exchange%20Connectathon/CCDE%20Interim/UMA_Consent_Management_Service-2017-11-27.pdf\">here</a>).<br>\nWe dealt with this by a very simple graph traversal algorithm which starts from the given resource until it reaches a Patient resource which was sufficient for the purpose of the demo but arguably not a complete solution in all possible cases.</p>",
        "id": 154019500,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1542593413
    }
]