[
    {
        "content": "<p>Hi there! In an audit logging use case we are using the AuditEvent Resource. All activity within a patient’s record should be logged. The information that has been ‘touched’ should be identifiable as well as the patient. Is it possible to use object.reference for the patient and the object.identifier, <a href=\"http://object.name\" target=\"_blank\" title=\"http://object.name\">object.name</a> and object.description for the identification of the ‘touched’ information? Or should this be done separately by slicing object? </p>",
        "id": 153839664,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1468939527
    },
    {
        "content": "<p>i'm not understanding the 'or' bit? You can do that, I think, but where does slicing come into it?</p>",
        "id": 153839752,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468955763
    },
    {
        "content": "<p>Ardon, you have two AuditEvent.entity elements. One that points at the Patient (by reference), One that points at the object touched (by reference). You also need an AuditEvent.agent to identify who did the touching, you should likely have another AuditEvent.agent to identify the software doing the touching.   All of these should be just references. So the size of this thing is not that big. The expectation is that an audit log analysis/reporting system can follow the references if it needs details, and when it does that access conttrol and more audit events are logged.</p>",
        "id": 153839855,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468968311
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>   I wondered if I can use 1 object element to identify the patient and the information touched  or that I should use multiple object elements.</p>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  For what I am understanding from your answer is that I should use two AuditEvent.objects (DSTU2), one for the patient and the other for the identification of the information that has been accessed. </p>",
        "id": 153839962,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1468997123
    },
    {
        "content": "<p>y I agree with John</p>",
        "id": 153839964,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468998286
    },
    {
        "content": "<p>Thank you both</p>",
        "id": 153839965,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1468998335
    }
]