[
    {
        "content": "<p>This is to discuss <a href=\"https://jira.hl7.org/browse/FHIR-24691\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-24691\">https://jira.hl7.org/browse/FHIR-24691</a></p>\n<p>During presentation of the FHIR Privacy and Security webinar, when discussing that some FHIR Servers have a remedial auditEvent recording of basic REST actions, it was asked if that was discoverable in a CapabilityStatement.</p>\n<p>When an ImplementationGuide defines manditory AuditEvent conformance, this knowledge is already supported in the CapabilityStatement. So this is not a replacement of more actionable knowledge about support for an actor within an Implementation Guide.</p>\n<p>Could this be conveyed as a type of security?</p>\n<p>Should there be a set of codes to indicate basic restful auditevents, vs basic restful provenance, or both?</p>",
        "id": 189542426,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1583186567
    },
    {
        "content": "<p>this fits nicely into the proposed re-work of CapabilityStatemnet</p>",
        "id": 189544276,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583187835
    },
    {
        "content": "<p>Im interested. I was figureing this might be simply handled with the definition of an IG specific to Security/Privacy audit logging. Where by the declaration that an endpoint supports that IG, one knows they can find the events logged...</p>",
        "id": 189544502,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583188012
    },
    {
        "content": "<p>I tried to understand what it takes to leverage the new CapabilityStatement2 model. I am unclear where the conformance details exist.<br>\nWhereas I have started solving this problem the classic way with an Implementation Guide - <a href=\"http://build.fhir.org/ig/JohnMoehrke/BasicAudit/branches/main/index.html\">http://build.fhir.org/ig/JohnMoehrke/BasicAudit/branches/main/index.html</a></p>",
        "id": 236160323,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619438231
    },
    {
        "content": "<p>You need to figure out what codes you want IG authors to be able to declare values for related to AuditEvent support.</p>",
        "id": 236211653,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619457742
    },
    {
        "content": "<p>I am still unclear. My understanding is that somewhere I would define a set of codes representing various kinds of \"auditEven recording capabilities\", and that these codes would have defined values available for them. These codes and values don't exist already... as far as I understand.<br>\nMore to my point... where would the normative behaviors for each given code and value pair be documented?</p>",
        "id": 236226072,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619463640
    },
    {
        "content": "<p>It seems that this is far easier and more clear how to do this with an ImplementationGuide</p>",
        "id": 236226121,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619463659
    },
    {
        "content": "<p>Not completely following.  In the end, you need to define some codes and what they mean so they can be used in CapabilityStatement.  Yes, you could do that as part of an IG if you wished.</p>",
        "id": 236240569,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619470271
    },
    {
        "content": "<p>what is the alternative documentation model for these codes besides an IG? And if an IG is used, then current CapabilityStatement is mostly enough (need actor decoration to an IG canonical conformance claim).</p>",
        "id": 236318059,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619521935
    },
    {
        "content": "<p>It's only enough if you expect to define distinct CapabilityStatements for every function - which isn't really what CapabilityStatements are intended for.</p>",
        "id": 236341335,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619531959
    },
    {
        "content": "<p>Also, you wouldn't be able to query and say \"Does this system support X\"</p>",
        "id": 236341374,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619531974
    }
]