[
    {
        "content": "<p>We have the need to capture a correlation id, who (individual user GUID) and when any operation is performed for auditing purposes.  We are only performing read operations and not creating or updating any information.  It appears AuditEvent is a good fit over Provenance, but I'm not entirely clear how a consumer would provide the AuditEvent information.  Can it be used as a custom header like Provenance?  If it can't be provided as custom header how would an AuditEvent be submitted along with a specific resource (ex. Coverage)?  We have traditionally requested this information in our headers (x-correlation-id, x-source-system, x-user).</p>",
        "id": 175495812,
        "sender_full_name": "Mona O",
        "timestamp": 1568258996
    },
    {
        "content": "<p>To make sure I understand, the client system provides a unique id for every query they do that the server stores as part of their AuditEvent to allow linking the server's audit record with the client's audit record?</p>",
        "id": 175518442,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568286426
    },
    {
        "content": "<p>see X-Request-Id in <a href=\"http://hl7.org/fhir/http.html#custom\" target=\"_blank\" title=\"http://hl7.org/fhir/http.html#custom\">http://hl7.org/fhir/http.html#custom</a></p>",
        "id": 175518777,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568286737
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Yes, the client system provides a unique id for every query and we also need to capture an unique id of the user who initiated the action.  Looking at <a href=\"http://build.fhir.org/http.html\" target=\"_blank\" title=\"http://build.fhir.org/http.html\">http://build.fhir.org/http.html</a> I see that \"X-Request-Id\" would work for the client system id, but I don't see anything that could be used for the unique id of the user who initiated the request.  AuditEvent resource has the attributes that would allow us to solve that use case, but I didn't see any reference that it could be submitted  as a http header like Provenance has noted.  Can AuditEvent be submitted as a custom header?  As I read the documentation Provenance is only to be used for PUT or POST or is it acceptable to use Provenance for my use case?</p>",
        "id": 175668180,
        "sender_full_name": "Mona O",
        "timestamp": 1568412509
    },
    {
        "content": "<p>The user who intitiated is typically conveyed as part of the OAuth token</p>",
        "id": 175671171,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568415498
    },
    {
        "content": "<p>as LLoyd says, the user is identified using security layers... But the client can record an AuditEvent. Best to record it in an independent POST so it can represent the success/failure of the other request.</p>",
        "id": 175712291,
        "sender_full_name": "John Moehrke",
        "timestamp": 1568485387
    },
    {
        "content": "<p>Thank you. Unfortunately, this is a B2B integration, so the user initiating the action where the application/process that would call the API is not available in the OAuth token. Any additional thoughts?</p>",
        "id": 176004485,
        "sender_full_name": "Mona O",
        "timestamp": 1568813192
    },
    {
        "content": "<p>client records AuditEvent that has the user identity... server should still record the auditEvent without it.</p>",
        "id": 176141992,
        "sender_full_name": "John Moehrke",
        "timestamp": 1568927148
    }
]