[
    {
        "content": "<p>I need to save information in the Australian patient extension about the DVA card (Department of Veterans' Affairs). I've used the example from the hl7 website here: <a href=\"http://hl7.org.au/fhir/base2018Mar/Patient-example1.json.html\" target=\"_blank\" title=\"http://hl7.org.au/fhir/base2018Mar/Patient-example1.json.html\">http://hl7.org.au/fhir/base2018Mar/Patient-example1.json.html</a></p>\n<p>I also need to save the patient's condition or disability that is sometimes attached to the DVA card. I've used an extension to end up with the following format:</p>\n<p>{<br>\n  \"type\": {<br>\n    \"coding\": [{<br>\n        \"system\": \"<a href=\"http://hl7.org/fhir/v2/0203\" target=\"_blank\" title=\"http://hl7.org/fhir/v2/0203\">http://hl7.org/fhir/v2/0203</a>\",<br>\n        \"code\": \"DVG\",<br>\n        \"display\": \"DVA Gold Card Number\"<br>\n      }],<br>\n    \"text\": \"Department of Veterans' Affairs Number\"<br>\n  },<br>\n  \"system\": \"<a href=\"http://ns.electronichealth.net.au/id/dva\" target=\"_blank\" title=\"http://ns.electronichealth.net.au/id/dva\">http://ns.electronichealth.net.au/id/dva</a>\",<br>\n  \"value\": \"NBUR9080\",<br>\n  \"extension\": [ {<br>\n      \"url\": \"&lt;my_domain_base_url&gt;/patient-dva-disability\",<br>\n      \"valueCodeableConcept\": { \"text\": \"A certain condition or disability\" }<br>\n    }]<br>\n}</p>\n<p>I just want to have some feedback about this way of storing the disability value. Do you see a better way to store that information related to the DVA card?</p>",
        "id": 163068898,
        "sender_full_name": "Emilien Perico",
        "timestamp": 1554956479
    },
    {
        "content": "<p>Would certainly try to use a code rather than text. Also it would be tempting to try and link to a Condition resource for the condition</p>",
        "id": 163068990,
        "sender_full_name": "Jim Steel",
        "timestamp": 1554956613
    },
    {
        "content": "<p>Why is it not a condition of the patient?</p>",
        "id": 163068999,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1554956631
    },
    {
        "content": "<p>The disability isn't really related to the identifier, so I wouldn't put it there.  Is it something that's handled as part of the patient's demographics?  It seems like actually capturing a Condition or perhaps something tied to a Coverage (if the purpose is to grant special insurance coverate).</p>",
        "id": 163069049,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554956656
    },
    {
        "content": "<p>Unless the identifier's use is somehow contingent on the condition</p>",
        "id": 163069053,
        "sender_full_name": "Jim Steel",
        "timestamp": 1554956675
    },
    {
        "content": "<p>A few additional information: the condition can be a long text, not just limited to a code. And the condition is closely tight to the DVA card, you're only entitled to treatment related to this condition with the card</p>",
        "id": 163069174,
        "sender_full_name": "Emilien Perico",
        "timestamp": 1554956851
    },
    {
        "content": "<p>Yes <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , it is related to the patient's demographics</p>",
        "id": 163069243,
        "sender_full_name": "Emilien Perico",
        "timestamp": 1554956936
    },
    {
        "content": "<p>So, the card contains a summary of what conditions are covered by the DVA.</p>",
        "id": 163069335,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1554957049
    },
    {
        "content": "<p>Yes, the DVA has different colours (gold, orange, white). White is the specific colour that only gives you coverage for the conditions you applied for.</p>",
        "id": 163069435,
        "sender_full_name": "Emilien Perico",
        "timestamp": 1554957219
    },
    {
        "content": "<p>That sounds more like Coverage than demographics.  It's not an innate characteristic of the patient, it's used to govern what's going to get paid for by whom - and that's what Coverage is for.</p>",
        "id": 163069573,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554957452
    },
    {
        "content": "<p>Think this would be better served as a separate Coverage resource like Lloyd suggests  - Patient.identifier is only there as common identifying information and is not recording specific coverage details. Using Coverage makes it explicit and can hold the details of conditions of coverage much more fully.</p>",
        "id": 163069574,
        "sender_full_name": "Brett Esler",
        "timestamp": 1554957454
    },
    {
        "content": "<p>Putting the identifier on the Patient is fine if it's a common way to look up the patient.  But it would also be the identifier on a Coverage resource.</p>",
        "id": 163069625,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554957512
    },
    {
        "content": "<p>The stuff in the AU patient profile is equivalent to the PID.3 content you would have as per a master patient index - pretty typical set of identifiers; when you start asking eligibility questions then an explicit Coverage entry is better.  This would be something good to talk about in the AU PA working group as  DVA coverage with conditions is a common case.</p>",
        "id": 163069715,
        "sender_full_name": "Brett Esler",
        "timestamp": 1554957707
    },
    {
        "content": "<p>I understand, I'm not really across the Coverage concept (looking at it now) Is there any way to store the disability/condition then? I cannot find a proper way to do this</p>",
        "id": 163069716,
        "sender_full_name": "Emilien Perico",
        "timestamp": 1554957710
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> ?  Presumably this would be relevant for workers compensation-related coverage and other coverage types as well.</p>",
        "id": 163069906,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554957970
    },
    {
        "content": "<p>Thanks for the feedback guys. I'm starting to look at private insurance information as well. I guess I'll have a better knowledge about the coverage concept after this. The way I see it at the moment is that the condition would be stored as an extension of the class or something like that</p>",
        "id": 163071373,
        "sender_full_name": "Emilien Perico",
        "timestamp": 1554960343
    },
    {
        "content": "<p>Perhaps, though this seems like something that ought to be part of core.</p>",
        "id": 163071898,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554961133
    }
]