[
    {
        "content": "<p>Does anyone have any suggestions for a graphical tool that could be used to create hierarchical FHIR logical models that's similar to UML editors such as MagicDraw or Rational Rose? CIMI has a deep class hierarchy and we need a way to visualize and edit the class hierarchy -- with loading and saving to StructureDefinition.</p>",
        "id": 153969628,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1528978879
    },
    {
        "content": "<p>for the spec, we're now able to use inkscape to layout out the diagrams, but it's very far from an interactive experience.</p>",
        "id": 153969630,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528978935
    },
    {
        "content": "<p>Right. We need not just layout and drawing, but interactive with authoring. Just thought I'd ask.</p>",
        "id": 153969635,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1528979190
    },
    {
        "content": "<p>never hurts to ask. It's only the answers that hurt sometimes</p>",
        "id": 153969639,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528979212
    },
    {
        "content": "<p>I know of one.  LOL</p>",
        "id": 153969711,
        "sender_full_name": "Richard Esmond",
        "timestamp": 1528982346
    },
    {
        "content": "<p>...go on...</p>",
        "id": 153969712,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1528982412
    },
    {
        "content": "<p>VHA Information &amp; Knowledge Architecture (BIK) has been using IBM's Rational Software Architect for almost 10 years.  Along with Rational Team Concert for configuration management.  Very robust – but a bit quirky.  Highly graphical and interactive.  In its native workspace format, as well as published as HTML.  We've worked with IBM to also link BIK to our Process &amp; Value Architecture (BPMN).  Here are the OSEHRA links:  Integrated Business Information Model:  <a href=\"https://bim.osehra.org/\" target=\"_blank\" title=\"https://bim.osehra.org/\">https://bim.osehra.org/</a> (please read the intro and please use the Diagrams view to navigate).  \"Normalized\" VistA Model:  <a href=\"https://him.osehra.org/\" target=\"_blank\" title=\"https://him.osehra.org/\">https://him.osehra.org/</a> (please read the intro – the Diagrams view is easier to navigate; the Models view provides navigation by VistA package.)</p>",
        "id": 153969888,
        "sender_full_name": "Robert Bishop",
        "timestamp": 1528985935
    },
    {
        "content": "<p>BTW we have modeling guidelines which might be of interest.  The main thing is we've been doing the modeling in a real world health business setting for many years.  ALSO:  We are starting to re-look at tooling – for all of VHA Business Architecture as well as clinical pathways, standards, interoperability, and terminology.  Maybe an opportunity for VHA BA to contribute?  We are taking a fairly formal approach so might not be a fit for your immediate needs.</p>",
        "id": 153969891,
        "sender_full_name": "Robert Bishop",
        "timestamp": 1528986374
    },
    {
        "content": "<p>Here I must say I stand with Galen on that one. Why reinvent the wheel? Should we not simply have a bridge from StructureDef to a constrained UML representation that can load in most UML tools if that is the desire. That is not to say that there are not other viewers far more friendly to our space but I am a bit puzzled by the question.</p>",
        "id": 153969915,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1528992217
    },
    {
        "content": "<p>Galen wasn't part of this thread...  I don't think anyone's arguing for reinventing the wheel.  If you can find an existing tool that can author StructureDefinitions or whose output can straightforwardly be converted to and from StructureDefinitions, that would be useful.  The only other consideration is that if we want to use that tool's format as a source-of-truth for HL7 balloted specifications, it need to be ammenable to source control management, merges, etc. through Github.  All Grahame is saying is that, to our knowledge, no such tool exists.  And we have no intention of developing an HL7-specific tool.</p>",
        "id": 153969916,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528992838
    },
    {
        "content": "<p>We have been building a collaborative graphical modeling tool.  It's still very alpha, but it is online and freely available for any teem to use.  </p>\n<p>For the moment we simply call it Modeling Lab</p>\n<p><a href=\"http://modelinglab.org\" target=\"_blank\" title=\"http://modelinglab.org\">http://modelinglab.org</a></p>\n<p>This will redirect you to an Azure server.  I still need to get a certificate on it, but you can create an account and play around with it.</p>\n<p>Once it get it more complete I will be making some tutorial videos.</p>",
        "id": 153969924,
        "sender_full_name": "Richard Esmond",
        "timestamp": 1528995619
    },
    {
        "content": "<p>What about clinfhir?  <a href=\"http://clinfhir.com/logicalModeller.html\" target=\"_blank\" title=\"http://clinfhir.com/logicalModeller.html\">http://clinfhir.com/logicalModeller.html</a>  from <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span></p>",
        "id": 153969954,
        "sender_full_name": "John Moehrke",
        "timestamp": 1529003570
    },
    {
        "content": "<p>yep - it certainly does that - and persists the model as a StructureDefinition resource. There's some documentation <a href=\"https://fhirblog.com/?s=logical+modeler\" target=\"_blank\" title=\"https://fhirblog.com/?s=logical+modeler\">here</a>:</p>",
        "id": 153970010,
        "sender_full_name": "David Hay",
        "timestamp": 1529010485
    },
    {
        "content": "<p>Symptomatic is close to having a generalized hierarchical model builder implemented.  We’ve done prototypes with a form builder, a care plan builder, various phylogenetic trees and cladograms, and a CCD on FHIR builder.</p>",
        "id": 153970288,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1529343480
    }
]