[
    {
        "content": "<p>Hello, I've been transferred here with my inquiry. Our company needs an automatic email sending program that looks at the filename and sends the file as an attachment to an email corresponding to the filename.</p>\n<p>I've created a quick script in python that does that, but my boss thinks we should use professional software because we are sending cardiac reports.</p>\n<p>So my question is: anyone here knows a program that does that, or at least point me in the right direction?</p>",
        "id": 220602834,
        "sender_full_name": "Alexandru Tureac",
        "timestamp": 1608568606
    },
    {
        "content": "<p>Are you sending using a secure email mechanism (e.g. Direct)?  There are security issues with sending patient-sensitive information over regular email.</p>",
        "id": 220605647,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1608570231
    },
    {
        "content": "<p>The script was not used to send the patient's data, and probably it won't be used.</p>",
        "id": 220607605,
        "sender_full_name": "Alexandru Tureac",
        "timestamp": 1608571487
    },
    {
        "content": "<p>A cardiac report is generally patient-specific and typically includes patient-identifying information...</p>",
        "id": 220608796,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1608572209
    },
    {
        "content": "<p>That is why we are looking for a program that does that.</p>",
        "id": 220621857,
        "sender_full_name": "Alexandru Tureac",
        "timestamp": 1608579622
    },
    {
        "content": "<p>What I'm saying is that it's not just a question of the program.  You probably can't use regular email.  In the U.S. you could do secure email using a Direct address.  In other countries, you might not be able to use email at all.</p>",
        "id": 220633569,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1608586690
    },
    {
        "content": "<p>We are in the US, and patient's information is send in a password protected PDF file. the body of the email doesn't have any patient's info. Also our company has signed BAA with google, so we try to be secure about that.</p>",
        "id": 220636031,
        "sender_full_name": "Alexandru Tureac",
        "timestamp": 1608588268
    }
]