[
    {
        "content": "<p>Hi all. We've just released a toolchain that will consume FHIR Json Schemas and generate Avro schemas and Java SpecificRecord classes.</p>\n<p>It's here if anyone's interested: <a href=\"https://github.com/carreragroup/avro-on-fhir\">https://github.com/carreragroup/avro-on-fhir</a></p>\n<p>We'd love feedback if anyone wants to use it.</p>",
        "id": 235905692,
        "sender_full_name": "Angelo Kastroulis",
        "timestamp": 1619210652
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191582\">@Angelo Kastroulis</span>  trying to understand does it provide the .avsc files for all the resources and their respective data tyoes?</p>",
        "id": 236067396,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1619358937
    },
    {
        "content": "<p>Yes, <span class=\"user-mention\" data-user-id=\"202825\">@Vibin_chander</span>  it generates the avsc files, but we also include a gradle project that builds SpecificRecords. We currently have it generating a single avsc, but we're adding a switch the generate loose files.</p>",
        "id": 237710195,
        "sender_full_name": "Angelo Kastroulis",
        "timestamp": 1620327045
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  As we work through debugging/implementing this Avro tooling, do either of you think that there would be any interest in transferring the FHIR-&gt;Avro repo to HL7 so that the schemas could be part of the balloted package (or if not part of the package, part of some process we could treat as canonical)?</p>",
        "id": 238496415,
        "sender_full_name": "Angelo Kastroulis",
        "timestamp": 1620834349
    },
    {
        "content": "<p>I think it's possible.  I suspect that Avro would be as widely used as RDF.  First step is probably to submit a change request proposing that.  It could then be discussed by FHIR-I and InM.</p>",
        "id": 238497887,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620834730
    }
]