[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> I'm doing some work with NCPDP on Gender Identity and they are wondering if the research and use cases that led to the current guidance on the FHIR Patient resource is documented anywhere.  I have worked at getting them to be compatible in their solution with our guidance, but they want to see if the use cases they have were considered.</p>",
        "id": 160587999,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1552409827
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> ?</p>",
        "id": 160722321,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1552507226
    },
    {
        "content": "<p>For the uses cases, I tend to break things up by administrative and clinical use cases (I am including more than just GI that you asked about for completeness).</p>\n<p>Administrative:</p>\n<ul>\n<li><strong>Patient identity matching/validation/duplicate checking</strong> [gender identity, sex assigned at birth, and legal sex can all apply here]</li>\n<li><strong>Patient informal communication</strong> (i.e. when addressing the patient or providing written documents like discharge instructions) [gender identity is best, with a fall back to administrative sex if there is no GI documented]</li>\n<li><strong>Patient formal/legal communication</strong> (i.e. when printing / signing legal documents) [legal sex (which in some jurisdictions may be the GI)]</li>\n<li><strong>Family member history</strong>: the gender identity of family members can drive display of family relationships.  E.g. \"grandfather\" vs. \"grandmother\" vs. \"grandparent\".</li>\n<li><strong>Billing</strong> often uses legal sex, though there may also be an \"insured sex\" in some cases, if you know the sex the insurance company has on file is different than the legal sex</li>\n<li><strong>Patient avatars</strong> - it is probably best to just use a genderless avatar, but if for some reason you need a gendered avatar, you can use gender identity for that.  (this is different than clinical avatars, see below).</li>\n<li><strong>Colors</strong> - same with avatar, it is usually best to use genderless colors, but if you <em>need</em> to pick a color, gender identity can be used.</li>\n<li><strong>Bed planning</strong> - for non private rooms, which property is best to use for bed planning is something that likely needs to be tailored for specific regions, organizations or even units.</li>\n</ul>\n<p>Clinical:</p>\n<ul>\n<li><strong>Reference ranges</strong> - this is hard and complicated and I don't think any of the current categories in the spec provide a good and realistic solution. </li>\n<li><strong>Health maintenance / alerts / BPAs / Risk scores / etc.</strong> - kinda the same as reference ranges.  For some health maintenance (mammogram/prostate exam), an organ inventory is ideal.    Some of the administrative properties (SAAB, GI, Admin Gender) can provide a proxy value, but those don't often cover transgender patients well.  The approach we (Epic) takes is that if <em>any</em> of the documentation we have indicates any ambiguity, we will display the health maintenance topic / alert /etc.  So a provider may see alerts for both a mammogram and a prostate exam for transgender patients.  Gender Identity does actually play a role here, as it provides a hint that the patient <em>may</em> not have the biological properties you would expect based on other data.  </li>\n<li><strong>Pedigree</strong> - often the desired information is genotype, but in practice patients may only know the gender identity of their relatives.</li>\n<li><strong>Other clinical uses</strong> - sex can be used as one factor in determining things like what blood product to admin.  Right now, I think the best option is basically the same as what I listed for health maintenance.  I.e. if all of your documentation suggests cisgender male or female, then use that value.  Otherwise fall back to \"unknown\" to trigger a manual review of what is the most appropriate care.</li>\n<li><strong>Weight-based med dosing</strong> that use sex-based formulas can use gender identity as a hint that the calculation should be flagged for special review.</li>\n<li><strong>Clinical avatars</strong> where genderless avatars are not appropriate (i.e. for documenting against genitalia), showing both and having the clinician pick which to use is a good option.</li>\n</ul>\n<p>The <a href=\"https://fenwayhealth.org/\" target=\"_blank\" title=\"https://fenwayhealth.org/\">Fenway Institute</a> has some research on the topic as well.</p>",
        "id": 160915913,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1552686054
    },
    {
        "content": "<p>I will also plug the <a href=\"https://confluence.hl7.org/display/VOC/The+Gender+Harmony+Project\" target=\"_blank\" title=\"https://confluence.hl7.org/display/VOC/The+Gender+Harmony+Project\">Gender  Harmony project</a> that is getting started.  Much of what I describe above are topics that will likely be refined as part of that effort.</p>",
        "id": 160915951,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1552686100
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> Thanks a lot for this.  I will forward this on to the NCPDP work, including the plug for the Gender Harmony Project.</p>",
        "id": 160918523,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1552688730
    }
]