[
    {
        "content": "<p>Currently, in FHIR XML, the elements are required to be in a fixed order.  In JSON, they are not (except resourceType).  Is there any background on why XML order matters?  I expect this has been discussed and there is a good reason, we'd just like to understand what was considered.</p>",
        "id": 153868446,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1484858749
    },
    {
        "content": "<p>It's a requirement of XML schema.  XML schema doesn't support unordered elements if any of them repeat.  You can get around that by having a \"wrapper\" element, but XML people generally find that ugly/unappealing.  </p>",
        "id": 153868454,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484862124
    },
    {
        "content": "<p>It was talked about at length</p>",
        "id": 153868455,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484862136
    },
    {
        "content": "<p>also to support sax. we would much prefer to be able to impose order on json to enable efficient processing, but can't</p>",
        "id": 153868481,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484867415
    },
    {
        "content": "<p>XML itself is order-sensitive, so any questions about that are whenever you want to kludge it to make it order-insensitive like Llyod mentioned, not whenever you want to impose ordering</p>",
        "id": 153868543,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1484905042
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191363\">@Vadim Peretokin</span> I don't believe XML itself is order sensitive.  The order is enforced in the XSD using xs:sequence.   FHIR could support unordered XML if our XSD allowed it.  But looking more into how you have to build your XSD to support unordered repeating elements, I see Lloyd's point.</p>",
        "id": 153868585,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1484923414
    },
    {
        "content": "<p>You're right, technically the XML spec says nothing about it - though in practice every parser would preserve it (<a href=\"http://lists.xml.org/archives/xml-dev/201003/msg00045.html\" target=\"_blank\" title=\"http://lists.xml.org/archives/xml-dev/201003/msg00045.html\">http://lists.xml.org/archives/xml-dev/201003/msg00045.html</a>)</p>",
        "id": 153868590,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1484923735
    },
    {
        "content": "<p>XML is human unkind - hash-map (key value) has unordered semantic. That's why hipsters like json or something like this (yaml, edn)- it's naturally fit in memory datastructures for objects, struct, records etc. Modern REST API ignore XML at all (google, facebook, etc), i do not know why FHIR community keep it  and make reference. My opinion, primary format should be JSON, if we are targeting modern web developers, xml should be jsonified!</p>",
        "id": 153868594,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1484924886
    },
    {
        "content": "<p>@<strong>nicola (RIO)</strong> FHIR's committed to supporting both because there are considerable communities that wish to use both.  And we've also committed to ensuring that each syntax feels as right as it can to its particular community.  Discussion about the pros and cons should be limited to change requests enhancing the guidance for implementers in choosing which syntax(s) to support if they're not sure - and those should be expressed in neutral terms :)</p>",
        "id": 153868608,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484926038
    },
    {
        "content": "<p>Thank you, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  - my fault.</p>",
        "id": 153868633,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1484929197
    },
    {
        "content": "<p>No worries - just don't want to get bogged down in something that'll divert us from getting R3 out the door.</p>",
        "id": 153868643,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484931633
    },
    {
        "content": "<p>There's was older thread on this on xml-dev, where Tim Bray clearly states that XML element order is significant in practice (all software preserves it), though the spec is indeed unclear (as <span class=\"user-mention\" data-user-id=\"191363\">@Vadim Peretokin</span> says too): <a href=\"http://lists.xml.org/archives/xml-dev/200101/msg00863.html\" target=\"_blank\" title=\"http://lists.xml.org/archives/xml-dev/200101/msg00863.html\">http://lists.xml.org/archives/xml-dev/200101/msg00863.html</a></p>",
        "id": 153868728,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1485006972
    }
]