[
    {
        "content": "<p>It appears the international FHIR community is evolving towards further differentiation between the use of Base, Baseline, and Core naming conventions to categorize national implementation guides. I've been struggling to find a formal definition.  </p>\n<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191687\">@Kevin Mayfield</span>  <span class=\"user-mention\" data-user-id=\"192158\">@Dave Barnet</span>  <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> and others who have worked on the guides below... </p>\n<p>Here are the patterns we've observed in existing national implementation guides- are these a fair starting point to summarize the differences between base, baseline, and core?</p>\n<p><strong>National Base Implementation Guides</strong> (e.g., Australian Base, Germany Base, Netherlands Base, UK Base) provide awareness of localized concepts but do not apply cardinality constraints or required binding strengths that enforce conformance to those concepts. In rare cases, cardinality constraints may be applied to elements that have been <a href=\"https://www.hl7.org/fhir/profiling.html#slicing\">sliced</a> to ensure the presence of sub-elements if a particular slice is used (ex: identifier coding system). Must support flags are not utilized in Base National Profiles. Available extensions are socialized but not constrained. </p>\n<p><strong>National Baseline Implementation Guides</strong> (e.g., Canadian Baseline (In Development), US Baseline(?)) provide awareness of localized concepts and apply minimal cardinality constraints and preferred binding strengths only where appropriate and when expected given national context. In some scenarios, more restrictive constraints may be found on elements that have been <a href=\"https://www.hl7.org/fhir/profiling.html#slicing\">sliced</a> to support meaningful conformance when heterogeneous systems are routinely expected (ex: fixed values for specific systems the slice applies to). Must Support flags are utilized to identify elements that are expected to be supported broadly regardless of use case. The most common extensions are socialized but not constrained. </p>\n<p><strong>National Core Implementation Guides</strong> (e.g., US Core, UK Core) define a set of conformance requirements that enforce alignment to localized concepts through cardinality constraints, must support flags, and required/extensible binding strengths. Extensions may be flagged as must support. Conformance to these profiles is tied to regulatory and/or contractual agreements in order to necessitate adoption to these more prescriptive specifications.</p>",
        "id": 207686631,
        "sender_full_name": "Sheridan Cook",
        "timestamp": 1598045106
    },
    {
        "content": "<p>I would lump baseline into base and have two layers at most.  There is no US Baseline AFIAK</p>",
        "id": 207699741,
        "sender_full_name": "Eric Haas",
        "timestamp": 1598057533
    },
    {
        "content": "<p>yes I don't think there are systematic differences here</p>",
        "id": 207704933,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1598066425
    },
    {
        "content": "<p>Agree baseline could be merged with base. I believe the ukcore is a base profile only. Is core rules on base, base tending to reflect a model rather more specific regional rules in a core?<br>\nWe appear to be seeing two types, one top down - base and another bottom-up - core?</p>",
        "id": 207705101,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1598066813
    }
]