[
    {
        "content": "<p>What's the best way to record that a particular observation should be treated as a baseline measure? (ie one user for later comparison? I guess an option could be a category - though I suspect that an extension is cleaner...</p>",
        "id": 161080773,
        "sender_full_name": "David Hay",
        "timestamp": 1552932156
    },
    {
        "content": "<p>Isn't that what an ObservationDefinition is?</p>",
        "id": 161088651,
        "sender_full_name": "John Moehrke",
        "timestamp": 1552937494
    },
    {
        "content": "<p>what makes something a base line measure? I thought it was where it is used rather than an inherent property of the observation</p>",
        "id": 161090817,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552939098
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ObservationDefinition defines a kind of Observation that's possible.  A 'baseline' Observation is a patient-specific Observation taken at a particular time intended to be used for comparison to subsequent observations - often prior to start of a therapy.</p>\n<p>I think that a baseline can be designated in one of two ways.  Either that's flagged as the purpose for a particular Observation in a protocol or plan (i.e. PlanDefinition or CarePlan) or it's an asserted relationship from a non-baseline resource to the baseline it's comparing against.</p>",
        "id": 161106873,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552952451
    },
    {
        "content": "<p>What I first thought was using <a href=\"http://build.fhir.org/extension-observation-sequelto.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-observation-sequelto.html\">http://build.fhir.org/extension-observation-sequelto.html</a>  but that has a slightly different connotation.  it is really relative to a specific protocol like a stim test, perhaps we could broaden the  defiinition?  </p>\n<p>However I think of baseline measurements clinically as in I want to compare these xrays  8 weeks out to the post op xrays.    so I agree with GG not something inherent on the observation but maybe the baseline encounter for that condition?</p>",
        "id": 161108144,
        "sender_full_name": "Eric Haas",
        "timestamp": 1552953833
    },
    {
        "content": "<p>It could be a baseline for an episode of care, not sure about a Condition.</p>",
        "id": 161108628,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552954407
    }
]