[
    {
        "content": "<p>Hi all - what would a RESTFul URL look like if we wanted to serve up <code>Observations</code> on a per-protocol basis? We work in clinical research, and I'm trying to discover a way to to segment results in a way that's meaningful to consumers of our service. </p>\n<p>Would this simply be a search parameter on the root <code>Observation</code> resource?</p>\n<p><code>http://[domain]/fhir/Observations?protocol=123</code></p>\n<p>or would we nest this in another type of resource?</p>\n<p><code>http://[domain]/fhir/[ResearchStudy?]/123/Observations</code></p>\n<p>Suggestions welcome!</p>",
        "id": 153936564,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1518184627
    },
    {
        "content": "<p>You certainly could have an endpoint for each study if you wanted to, though that gets a bit tricky if some data is relevant to multiple studies.  The first approach keeps your infrastructure simpler - and allows it to be more easily used by systems that may not care about study.  We've defined a standard extension to link resources (including Observation) to studies but haven't defined a standard search criteria.  If you wanted to submit a change proposal, we certainly <em>could</em> create a standard search criteria though...</p>",
        "id": 153936572,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518190960
    },
    {
        "content": "<p>And in the meantime several FHIR Servers (e.g. HAPI, Vonk) allow you to use custom searchparameters.</p>",
        "id": 153937460,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1518634936
    },
    {
        "content": "<p>hi</p>",
        "id": 153937787,
        "sender_full_name": "Jalapathi",
        "timestamp": 1518706937
    },
    {
        "content": "<p>Hi, Anyone idea about Open Epic api connectivity</p>",
        "id": 153937789,
        "sender_full_name": "Jalapathi",
        "timestamp": 1518707106
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195278\">@Jalapathi</span> Please read <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions\">FHIR Rules for asking questions</a> and then post something more specific.</p>",
        "id": 153937851,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518716772
    },
    {
        "content": "<blockquote>\n<p>You certainly could have an endpoint for each study if you wanted to, though that gets a bit tricky if some data is relevant to multiple studies.  The first approach keeps your infrastructure simpler - and allows it to be more easily used by systems that may not care about study.  We've defined a standard extension to link resources (including Observation) to studies but haven't defined a standard search criteria.  If you wanted to submit a change proposal, we certainly <em>could</em> create a standard search criteria though...</p>\n</blockquote>\n<p>Thanks for the reply. I certainly agree that the first approach is simpler. What's the standard extension to link resources to studies you mentioned? I wonder if a standard search criteria of <code>?research study=XX-XXX</code> makes sense...?</p>",
        "id": 153951708,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1523406600
    },
    {
        "content": "<p>Hmm.  The only two I can find are <a href=\"http://hl7.org/fhir/extension-questionnaire-studyprotocolidentifier.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-questionnaire-studyprotocolidentifier.html\">http://hl7.org/fhir/extension-questionnaire-studyprotocolidentifier.html</a> and <a href=\"http://hl7.org/fhir/extension-patient-clinicaltrial.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-patient-clinicaltrial.html\">http://hl7.org/fhir/extension-patient-clinicaltrial.html</a> (though you could technically also use <a href=\"http://build.fhir.org/extension-event-partof.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-event-partof.html\">http://build.fhir.org/extension-event-partof.html</a>).  Can you submit a change request for us to add this as an extension for all request and event resources?</p>",
        "id": 153951722,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523414447
    },
    {
        "content": "<p>I would expect that the linkage to a study would be through the agreement with the Patient to engage in that study. Thus I would expect there to be a Consent (Research type) that identifies the actors, the purpose, and the data. These use-cases have not yet been brought forward to the workgroup that owns Consent. Please contact <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> and join the workgroup to help them improve Consent for these use-cases.</p>",
        "id": 153951792,
        "sender_full_name": "John Moehrke",
        "timestamp": 1523448085
    },
    {
        "content": "<p>There would be a Consent, but it wouldn't necessarily be expressed in FHIR.  There's still a need to be able to link Observations, Procedures, MedicationAdministrations, etc. to say that they're tied to a study.</p>",
        "id": 153951839,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523455658
    },
    {
        "content": "<p>the Consent resource is intended to be as small as an indicator of a paper (or other) consent evidence is held somewhere else (consent on file). But the resource is still useful to identify the data of interest (Consent.provision)</p>",
        "id": 153951840,
        "sender_full_name": "John Moehrke",
        "timestamp": 1523455779
    },
    {
        "content": "<p>Interesting points here, especially the inclusion of Consent somehow. At this point I think I’ll need to consider how to move forward as there does not appear to be a clear cut way to segment by study currently.</p>\n<p>Happy to submit a CR for a standard search criteria (researchstudy) if there is enough interest.</p>",
        "id": 153951935,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1523479954
    },
    {
        "content": "<blockquote>\n<p>Interesting points here, especially the inclusion of Consent somehow. At this point I think I’ll need to consider how to move forward as there does not appear to be a clear cut way to segment by study currently.</p>\n</blockquote>\n<p>Surely use of patient's myGov could authorize access for doctor or hospital to access patient records. I don't know protocol but there must be a broker or this will bog down in paperwork.</p>",
        "id": 153951960,
        "sender_full_name": "Dwight Walker",
        "timestamp": 1523498894
    },
    {
        "content": "<blockquote>\n<p>Hmm.  The only two I can find are <a href=\"http://hl7.org/fhir/extension-questionnaire-studyprotocolidentifier.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-questionnaire-studyprotocolidentifier.html\">http://hl7.org/fhir/extension-questionnaire-studyprotocolidentifier.html</a> and <a href=\"http://hl7.org/fhir/extension-patient-clinicaltrial.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-patient-clinicaltrial.html\">http://hl7.org/fhir/extension-patient-clinicaltrial.html</a> (though you could technically also use <a href=\"http://build.fhir.org/extension-event-partof.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-event-partof.html\">http://build.fhir.org/extension-event-partof.html</a>).  Can you submit a change request for us to add this as an extension for all request and event resources?</p>\n</blockquote>\n<p>Just signed up for an account @ <a href=\"https://gforge.hl7.org/gf/\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/\">https://gforge.hl7.org/gf/</a> - currently awaiting approval...</p>",
        "id": 153952053,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1523542685
    },
    {
        "content": "<p>Looks like you're already approved...</p>",
        "id": 153952061,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523543902
    },
    {
        "content": "<p>I had a \"doh\" moment and forgot my password, so I can't confirm my account... Trying to use the reset password link...</p>",
        "id": 153952066,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1523545515
    },
    {
        "content": "<p>Addressed offline</p>",
        "id": 153952074,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523545915
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153953120,
        "sender_full_name": "Peter Heisig",
        "timestamp": 1524128184
    },
    {
        "content": "<p>I wanted to add something now that the CR has been approved (hooray!) </p>\n<p>In a situation where we are returning Observations, how would we deal with the <code>subject</code> attribute (given our use case of needing to de-identify the Patient for clinical research purposes - hence the push towards <code>ResearchSubject</code> ?)</p>\n<p>Example:</p>\n<div class=\"codehilite\"><pre><span></span>{\n  &quot;resourceType&quot;: &quot;Observation&quot;,\n       //\n       &quot;subject&quot;: {\n          &quot;reference&quot;: &quot;Patient/SMART-99912345&quot;\n        },\n       //\n}\n</pre></div>\n\n\n<p>Where SMART-99912345 is something analogous to an MRN (which we don't want to show.) Is there a way to display the observations with a reference to the <code>ResearchSubject</code> they are related to?</p>",
        "id": 153964646,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1527186380
    },
    {
        "content": "<p>a given patient can involved in multiple studies. So you'd have to compare the patient reference with whatever research subjects you were interested in</p>",
        "id": 153964653,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527186975
    },
    {
        "content": "<p>That makes sense. In my example, I am assuming the result-set is filtered by <code>ResearchStudy</code>, so that scope is taken care of. I'm wondering the best way to represent the patient here while at the same time not exposing their identifier (e.g. MRN.) I'm not sure if this is possible via the <code>subject </code>attribute...</p>",
        "id": 153964659,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1527187352
    },
    {
        "content": "<p>the subject refers to a patient by the id of the resource:</p>\n<p>\"reference\" : \"Patient/some-id\"</p>",
        "id": 153964660,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527187470
    },
    {
        "content": "<p>and then the patient resource will include gender, munged birth date, and no name or identifiers.</p>",
        "id": 153964661,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527187526
    },
    {
        "content": "<p>'some-id' should not be the patient MRN, and this is one of the reasons. If it is, the de-identification service will haev to not only remove names and identifiers and munge the birth date, it will have to maintain a very large table of mrn switches</p>",
        "id": 153964662,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527187554
    },
    {
        "content": "<p>Right - I see. We've always traditionally identified patients by MRN so that's why I'm in that headspace. This makes sense. We'll need to decide on a different identifier</p>",
        "id": 153964666,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1527187615
    },
    {
        "content": "<p>What if the subject is not a Patient?</p>",
        "id": 153964675,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1527189419
    },
    {
        "content": "<p>I guess this is a dumb question - I rescind it. I was referring to the case where the subject may not be a Patient at the institution but I fail to see how that's possible.</p>",
        "id": 153964676,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1527189976
    },
    {
        "content": "<p>we discuss the use of MRNs and their like in the spec itself - MRNs are managed identifiers that humans use - it is nearly always a mistake to use that as the resource id.... something will crop up where the management of the id breaks the rules about persistence of identifies where as database primary / composite keys are exactly what you should use</p>",
        "id": 153964683,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527190103
    },
    {
        "content": "<p>of course, some clinical systems use the MRN as a primary database key....</p>",
        "id": 153964684,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527190125
    },
    {
        "content": "<p>ResearchSubject doesn't eliminate the need for Patient.  ResearchSubject establishes a linkage between Patient and a particular ResearchStudy - and captures the information specific to that join (e.g. subject status within the study, assigned arm, whether their consent is done, etc.)  If there's a need to share \"anonymized\" information, you'd still have a Patient resource, they just wouldn't have a name (and might have less granular information such as just a year or year + month for date of birth).  Systems responsible for anonymizing the data shared would convert from the identified Patient resource to the non-identified resource - and might maintain a linkage to support subsequent reidentification if needed.</p>",
        "id": 153964711,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527200142
    },
    {
        "content": "<p>I'm not sure whether this is the right thread. Question is related to clinical trials and guys here seem to be acquainted with ResearchSubject &amp; ResearchStudy: I'm trying to associate a lab test  with a study visit (eg. screening visit or stratification visit) but can't find the concept of the study visit anywhere. If I take  Encounter, I'll have to goof my way spuriously around to bridge a relationship to research study. Any Idea on how best to define a study visit?</p>",
        "id": 153982195,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1533488201
    },
    {
        "content": "<p>A question related to clinical trials: Specifically planned dose and<br>\ngiven/administered dose. My understanding  is that MedicationRequest<br>\ncan be used to define the planned dose. MedicationStatement can be<br>\nused to document the given dose.<br>\nHowever following the references from ResearchStudy to the<br>\nPlanDefinition, it doesn't seem easy to create a reference to<br>\nMedicationRequest. Has anyone encountered this issue? Does anyone know<br>\na different way to define Medications and Doses in ResearchStudies?<br>\nFor the long haul, I’m also after  dose modifications and delay in<br>\nadministration.</p>",
        "id": 153982197,
        "sender_full_name": "Markus Döring",
        "timestamp": 1533490727
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194020\">@Gustav Vella</span> Study visit is absolutely Encounter.  There's agreement to add a generic extension that will let you link the Encounter to a research study.  (Or to multiple research studies).  You can also point to a particular Activity in one or more study protocols (PlanDefinitions)</p>",
        "id": 153982242,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533513606
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195369\">@Markus Döring</span> \"planned dose\" can mean two different things.  It can be the protocol-defined dose, in which case it would be in ActivityDefinition.  Alternatively, it can be a patient-specific does, in which case MedicationRequest would be appropriate.  In general, you'll take the time-agnostic and patient-agnostic PlanDefinition and use it to generate a CarePlan which defines the intended path of a particular patient through the study based on their arm assignment and other characteristics.  The CarePlan would have an 'instantiates' relationship to the PlanDefinition.  The MedicationRequest would be one of the activities within the plan and could have an 'instantiates' relationship with one of the ActivityDefinitions from the PlanDefinition.</p>",
        "id": 153982243,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533513768
    },
    {
        "content": "<p>Actual administrations would more likely be captured using MedicationAdministration rather than MedicaitonStatement.  The former is precise and represents an individual administration.  The latter represents an approximate summary of administrations which will presumably be less common in a research setting.</p>",
        "id": 153982244,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533513832
    },
    {
        "content": "<p><code>quote  There's agreement to add a generic extension that will let you link the Encounter to a research study.  (Or to multiple research studies).  </code></p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  First off thanks alot! But I'm still confused. What exactly makes an extension generic -  as opposed to a vanilla extension? How are agreements made? Is it written somewhere? Machine semantics need machine readable contracts.  I assume that all extensions used in resources require a formal published definition.</p>",
        "id": 153982472,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1533542283
    },
    {
        "content": "<p>I don't have answers to offer but this is at the core of one of the clinical research tracks at the connectathon in Baltimore.</p>",
        "id": 153982481,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1533550466
    },
    {
        "content": "<p>I assume <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> means 'generic' as a well-defined extension to link to a study that can be applied to <em>any</em> ressource...?</p>",
        "id": 153982489,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1533553528
    },
    {
        "content": "<p>Given we have an extension, which points from PlanDefinition to Encounter.   <br>\nAccording to your <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  answer we can model the planned medication (times and dosage) via ActivityDefiniton.<br>\nMedicationStatement has a \"context\" field via which an Encounter can be referenced as well as a \"basedOn\" attribute which can point to MedicationRequest.<br>\nWe'd thus have these cards in the game:  ReserachStudy, PlanDefinition, ActivityDefinition, Encounter, MedicationStatement, MedicationRequest.<br>\nThe game ist to to figure out how to approach Encounter. What direction do you suggest? PlanDefinition (= Trial Protocol) to Encounter (= Vist)<br>\nor <br>\nEncounter to PlanDefinition via reverse chaining?</p>\n<p>I think the former makes more sense because we're after the Encounters = Visits for a given trial.<br>\nIf we were, say after Adverse Events for a set patients linked to trials on my site, then probably the other way round would make more sense. right?</p>\n<p>Now let's say I had use cases for which both approaches made sense - and don't want to kill the server with back chaining -  would I write two different versions of the extension? How would the world make sense of this?</p>",
        "id": 153982532,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1533561462
    },
    {
        "content": "<p>The specific extension is <a href=\"http://build.fhir.org/extension-event-researchstudy.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-event-researchstudy.html\">http://build.fhir.org/extension-event-researchstudy.html</a>.  It'll let you link encounters, procedures, medication administrations, observations, etc. to a study.</p>",
        "id": 153982622,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533571615
    },
    {
        "content": "<p>It won't point from PlanDefinition from Encounter.  It'll point from Encounter to Study.</p>",
        "id": 153982625,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533571634
    },
    {
        "content": "<p>Nothing will ever point from PlanDefinition to Encounter, however Encounter should be able to point to PlanDefinition (or to ActivityDefinition which is pointed to by PlanDefinition) using the event-instantiatesCanonical extension.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> Why is this not supported by Encounter?  It certainly should be...</p>",
        "id": 153982631,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533571791
    },
    {
        "content": "<p>Thanks alot <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - Could I offer you a beer in Amsterdam? ;°&gt;<br>\nHowever this still feels like the fine Art of Goofing Off <a href=\"https://youtu.be/N5AvTQnKnF8\" target=\"_blank\" title=\"https://youtu.be/N5AvTQnKnF8\">https://youtu.be/N5AvTQnKnF8</a><br>\n<span class=\"user-mention\" data-user-id=\"195369\">@Markus Döring</span>  Take note.</p>",
        "id": 153982693,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1533581570
    },
    {
        "content": "<p>You could offer, but I'll probably like you more if you don't insist I drink it :)  (Last beer I had was almost a decade ago in France where the locals were most insistent that I had to try the local brew...)</p>",
        "id": 153982815,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533591866
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - Now that the researchstudy extension is defined (<a href=\"http://build.fhir.org/extension-event-researchstudy.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-event-researchstudy.html\">http://build.fhir.org/extension-event-researchstudy.html</a>), can we leverage / incorporate it as a search parameter for a resource (e.g. Observation)?  For example, would this be considered valid?</p>\n<p><code>http://fhir-server.test/api/observations?researchstudy=XX-YYYY&amp;_count=50</code></p>",
        "id": 153983235,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1533663465
    },
    {
        "content": "<p>Here are a few more I'd like to get some feedback on the validity of, assuming the <code>researchstudy</code> search parameter above is valid:</p>\n<ul>\n<li>Querying for observations that occurred between a specific period of time:</li>\n</ul>\n<p><code>http://fhir-server.test/api/observations?researchstudy=XX-YYYY&amp;_count=50&amp;context:Encounter.status=finished&amp;context:Encounter.date=le2006-06-30&amp;context:Encounter.date=ge2006-06-20</code></p>\n<ul>\n<li>Querying for observations for a specific ResearchSubject, using the Patient link:</li>\n</ul>\n<p><code>http://fhir-server.test/api/observations?researchstudy=XX-YYYY&amp;_count=50&amp;patient._has:ResearchSubject:identifier=HASHID123</code></p>",
        "id": 153983237,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1533664063
    },
    {
        "content": "<p>Seems like a reasonable request.  Submit a change request and we can define a standard SearchCriteria too</p>",
        "id": 153983279,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533667188
    },
    {
        "content": "<p>Is this required? Or can we just start using the resource in the search params? <span class=\"user-mention\" data-user-id=\"192121\">@Geoff Low</span> - what say you?</p>",
        "id": 153983448,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1533683293
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - This was submitted. <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19717\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19717\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19717</a></p>",
        "id": 154022773,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1543932144
    },
    {
        "content": "<blockquote>\n<p>The specific extension is <a href=\"http://build.fhir.org/extension-event-researchstudy.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-event-researchstudy.html\">http://build.fhir.org/extension-event-researchstudy.html</a>.  It'll let you link encounters, procedures, medication administrations, observations, etc. to a study.</p>\n</blockquote>\n<p>Just an FYI, this link is broken.</p>",
        "id": 154022775,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1543934220
    },
    {
        "content": "<p>I guess this extension was meant: <a href=\"http://build.fhir.org/extension-workflow-researchstudy.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-workflow-researchstudy.html\">http://build.fhir.org/extension-workflow-researchstudy.html</a><br>\nSearchParameter resources can be created by yourself, also on extensions. Some of the servers allow you to use your own searchparameters for search. Let me know if you need help in creating the correct criteria.</p>",
        "id": 154023041,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1543997521
    },
    {
        "content": "<p>Apologies, completely missed this stream. </p>\n<p>I'd just echo that I'd envisioned that data access would most probably be via a ResearchSubject basis; the <a href=\"http://ResearchSubject.id\" target=\"_blank\" title=\"http://ResearchSubject.id\">ResearchSubject.id</a> would be the foreign key in the interrogating system (with a link to the ResearchStudy and Patient resource through which you'd be able to access the data) - this would allow the inquisitor to check the status of the subject enrolment prior to accessing the data.  </p>\n<p>Is the link here intended for the assessment of standard of care versus research purposes?  Most of my thoughts (probably blinkered by my view of the world) are that we would always request the data through the lens of a subject, rather than at the individual resource.  My thinking hitherto now has been that the Research experiments would leverage the health resources in the EHR - the EHR would be the eSource; the majority of the resources would be populated/defined as part of standard of care.</p>\n<p>Some of the resources would be added to the healthcare system prompted via a ServiceRequest spurred by a CarePlan relating to the specific protocol (ResearchStudy).  Some of the biggest use cases are Relevant Medical Histories, Concomitant Medications, Labs/Vitals (especially with complex oncology studies) so maybe I'd recommend adding the extension AdverseEvent/Condition/ServiceRequest as well?  </p>\n<p>Is it worth getting on a call to discuss?</p>",
        "id": 154023048,
        "sender_full_name": "Geoff Low",
        "timestamp": 1544001071
    },
    {
        "content": "<blockquote>\n<p>I guess this extension was meant: <a href=\"http://build.fhir.org/extension-workflow-researchstudy.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-workflow-researchstudy.html\">http://build.fhir.org/extension-workflow-researchstudy.html</a><br>\nSearchParameter resources can be created by yourself, also on extensions. Some of the servers allow you to use your own searchparameters for search. Let me know if you need help in creating the correct criteria.</p>\n</blockquote>\n<p>Thanks! So are you saying that we don't need a \"standard\" search param here? If that is the case I am happy to explore using custom search parameters for our use cases. Can you point me in the right direction?</p>",
        "id": 154023501,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1544108316
    },
    {
        "content": "<p>I think the query mechanism is more proper REST. Adding an extension to all resources would result in modifying clinical data each time that clinical data is identified as relevant to a new clinical trial. The methods of REST as selected by FHIR  would have your Research Study point at the relevant clinical data, not have the clinical data point at the ResearchStudy.  Thus a service that supports the special query parameter (research-study) agrees to follow the breadcrumbs in the research study to find all the data relevant.</p>",
        "id": 154023539,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544118848
    },
    {
        "content": "<p>I'm assuming (from the perspective of provenance) that the downstream research system would keep a record of the source datapoint (Resource, attribute and version) - accessing the Resource for the purposes of using in a Research Study should not mutate the resource itself.  Data ownership in clinical research is a bit of a sticky wicket; in my opinion the use of EHR data in research should be an agent for individuals having clearer ownership of their data; at the moment the EDC vendor, Investigator and Sponsor probably all consider the data captured as part of a study as 'their' data.  <br>\nI understand where this extension may have come from; Clinical Research domains are always qualified with context (study, site, subject and temporal) -  I suspect people are wanting to have a one stop shop for that context in a resource instance.</p>",
        "id": 154023710,
        "sender_full_name": "Geoff Low",
        "timestamp": 1544181322
    },
    {
        "content": "<blockquote>\n<p>I'm assuming (from the perspective of provenance) that the downstream research system would keep a record of the source datapoint (Resource, attribute and version) - accessing the Resource for the purposes of using in a Research Study should not mutate the resource itself.  Data ownership in clinical research is a bit of a sticky wicket; in my opinion the use of EHR data in research should be an agent for individuals having clearer ownership of their data; at the moment the EDC vendor, Investigator and Sponsor probably all consider the data captured as part of a study as 'their' data.  <br>\nI understand where this extension may have come from; Clinical Research domains are always qualified with context (study, site, subject and temporal) -  I suspect people are wanting to have a one stop shop for that context in a resource instance.</p>\n</blockquote>\n<p>I agree. And this is one usecase that we used in the design of Provenance. Specifically using Provenance in the way it is designed, pointing at the data, it will not get in the way of the clinical trial algorithm analysis; but is always there to enable proof of provenance and authority to use. Note that one only needs one Provenance instance to cover an extraction of data. That Provenance would describe the extraction, and point (.target) at ALL of the data extracted. Further Provenance.policy can point at the documentation for that authorized extract... Would love to see this profiled, and added to the specification. As the owner of Provenance, I welcome this..</p>",
        "id": 154023739,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544191561
    },
    {
        "content": "<p>Whether the search parameter is necessary depends on what you're trying to do.  If you start from ResearchSubject and navigate to Patient you'll be able to easily find all information associated with the patient - but not all information associated to the patient will necessarily have been deemed relevant to the study.  And if you want to filter to only see study-relevant data, you'll need to be able to filter based on the extension.</p>",
        "id": 154024342,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544495086
    },
    {
        "content": "<p>The ResearchStudy or ResearchSubject can point at the relevant data.. having the data point at the ResearchStudy or ResearchSubject is not proper REST. Modifying the medical data to add a pointer to ResearchStudy will affect the medical-record integrity.   We should have one model, that which has ResearchStudy or ResearchSubject pointing at the relevant data.  <br>\nI would recommend looking at Consent, as the Consent resource is designed to support pointing at explicit data, referencing kinds of data, and referencing tagged data.  Any logic that a research study needs is also needed in Consent, so lets make improvements there if you need them.  The Consent resource has within scope the support of Clinical Research. Both in recording participation agreement, and in recording authorization to access data. (Likely two related instances given the different activity being authorized).<br>\nI will argue further that ResearchStudy and ResearchSubject should not duplicate this, but rather leverage Consent.  These resources do reference Consent, but they must utilize that consent's .provisions rather than inventing another model of identifying data that is relevant and authorized.</p>",
        "id": 154024419,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544537846
    },
    {
        "content": "<p>We have two guidelines for the direction of relationships:<br>\n1. The record created second should point to the record created first<br>\n2. The many should point to the one<br>\nIf you're recording an Observation, an AdverseEvent or any other record and want to say \"this is related to Study X\", both of those rules mean that the Observation, AdverseEvent or other resource should point to the study, not the other way around.</p>",
        "id": 154024445,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544544249
    },
    {
        "content": "<p>Consent is completely separate from the determination of whether a particular record is considered \"relevant\" to a particular study.</p>",
        "id": 154024446,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544544299
    },
    {
        "content": "<blockquote>\n<p>Whether the search parameter is necessary depends on what you're trying to do.  If you start from ResearchSubject and navigate to Patient you'll be able to easily find all information associated with the patient - but not all information associated to the patient will necessarily have been deemed relevant to the study.  And if you want to filter to only see study-relevant data, you'll need to be able to filter based on the extension.</p>\n</blockquote>\n<p>Yes, what we are after here is study specific data. My thoughts are that if you are building a RESTful web service, the endpoints exposed have to be descriptive enough for someone to reason about. If I say I want lab result data for my research study returned, I should be able to do that in a reasonably simple way and make sense of the web service URL I am looking at. </p>\n<p>An example use case would be exposing an endpoint / query string that looks like this<br>\nGET <br>\n<code>[base]/observations?researchstudy=12-345&amp;category=laboratory&amp;patient:_has:ResearchSubject:identifier=12345</code><br>\nWhere the above is considered \"valid.\"  </p>\n<p>The server accepting a request like this has to decide what to do with it. Assuming it's set up to appropriately surface data as FHIR resources (bundles, most likely) AND the source system can properly differentiate what is and is not \"study specific data\", can we do this using FHIR in it's current state? In other words, if this is well documented and expressed in an IG why would it not be considered a satisfactory approach?</p>",
        "id": 154024789,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1544624640
    },
    {
        "content": "<blockquote>\n<p>I'm assuming (from the perspective of provenance) that the downstream research system would keep a record of the source datapoint (Resource, attribute and version) - accessing the Resource for the purposes of using in a Research Study should not mutate the resource itself.  Data ownership in clinical research is a bit of a sticky wicket; in my opinion the use of EHR data in research should be an agent for individuals having clearer ownership of their data; at the moment the EDC vendor, Investigator and Sponsor probably all consider the data captured as part of a study as 'their' data.  <br>\nI understand where this extension may have come from; Clinical Research domains are always qualified with context (study, site, subject and temporal) -  I suspect people are wanting to have a one stop shop for that context in a resource instance.</p>\n</blockquote>\n<p>Re: mutating, I'm not suggesting we alter the underlying data in any way, but isn't this what profiling is for? Creating a set of rules specific to an implementation?</p>",
        "id": 154024790,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1544624818
    },
    {
        "content": "<p>Re: mutating...  The quality of the data captured during clinical practice is defined by rules of clinical practice. It might have clinical practice defined profiles. But the quality of that data is set by the clinical practice.<br>\nwhen along comes a research project, it must deal with the quality of data that exists. It can't expect that the data can be magically improved. It could filter the data that comes back to it, but I suspect that needs to be a decision of that specific project.<br>\nthere is a common de-identification processing of that data that could also be done. Is de-identification what you are calling mutating?</p>",
        "id": 154024795,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544625877
    },
    {
        "content": "<p>We'd need to define a search parameter based on the researchstudy extension, but that seems appropriate.  Can you submit a change request for us to define a standard one in R5?</p>",
        "id": 154024808,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544627517
    },
    {
        "content": "<p>Flagging data as study-relevant isn't mutating.  If an EHR is set up to support a clinical study, it's reasonable to expect it to allow new and existing data to be flagged as associated with a study.  Alternatively, someone might have to go through and supplement data extracted from the EHR to identify which data is study-relevant.  In any case, having the records point to the study is reasonable.</p>",
        "id": 154024809,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544627624
    },
    {
        "content": "<p>well, we disagree... I think the very same task can be done in the ResearchStudy resource to update it to point at the data...  Either way some action is happening to identify study-relevant... I am arguing that the evidence of study-relevant seems more logical in the ResearchStudy, than ALL the other data.</p>",
        "id": 154024831,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544630097
    },
    {
        "content": "<p>That's equivalent to saying we should update the Encounter to point to all data that's relevant to the encounter.  It's contrary to our design principles and not terribly practical.  The ResearchStudy is going to live on one system and there could be millions of records distributed across hundreds of systems that are relevant to it.  There's no way you're going to have the ResearchStudy point to every single one of them.</p>",
        "id": 154024834,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544630253
    },
    {
        "content": "<p>The advantage of the model I am refering to is that your ResearchStudy 'relevance' can be managed against a read-only FHIR api... Yours requires that the FHIR api allow research studies to change data.</p>",
        "id": 154024835,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544630263
    },
    {
        "content": "<p>Research studies are <em>gathering</em> the data.  When you record an Observation that's related to an encounter, you flag it with the encounter.  When you record an Observation that's related to a study, you flag it with the study.  There's no \"change\" involved.</p>",
        "id": 154024837,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544630346
    },
    {
        "content": "<p>Your model breaks digital-signatures everywhere (in every clinical data repository)... something you keep bringing up to others when they try to architect something that would break digital signatures. (see your comment seconds ago on a different thread)</p>",
        "id": 154024838,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544630381
    },
    {
        "content": "<p>Why would it break digital signatures any more than pointing to an encounter.  You're assuming that linking to the study is something that happens after-the fact.  Generally speaking, it wouldn't</p>",
        "id": 154024841,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544630473
    },
    {
        "content": "<p>I take the point about ResearchStudy and ResearchSubject needing to take account of Consent, but I think we may be making a mistake in assuming all the consent and relationship happens within the queries.  In the conversations I've had the popular suggestion is that the \"owners\" of the EHR will stand up a FHIR server that delivers what the clinical trial is allowed to see.  The only \"pointing\" of one set of data to another that will happen is indirectly by getting a number of shared references of varying sorts.  Once the data is acquired it will be assembled into a new database that can create whatever associations it wants.</p>",
        "id": 154024890,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1544633858
    },
    {
        "content": "<p>And what they're allowed to see is distinct from what's been linked to the study.  The extension supporting linking to the study actually allows differentiation between what records were created because of the study vs. what's been deemed as study-relevant.</p>",
        "id": 154024892,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544634137
    },
    {
        "content": "<p>As a side point, the issue of linking things after the fact is no different for studies than it is for episodes or encounters.  Existing records sometimes need to be updated to point to those things too.  If you're in a digital signature world, that's going to present some complexities, but they're far less than the complexity of trying to update the Encounter every time someone takes a blood pressure.</p>",
        "id": 154024893,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544634225
    },
    {
        "content": "<p>Yes we need to keep clear that having something specifically done for a study does not say anything about who is allowed access to that data.</p>",
        "id": 154024898,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1544635081
    },
    {
        "content": "<blockquote>\n<p>We'd need to define a search parameter based on the researchstudy extension, but that seems appropriate.  Can you submit a change request for us to define a standard one in R5?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nHere's where I'm confused, see here:<br>\n<a href=\"user_uploads/2/92/vqeQTyNvSaoy_k785IZQm5_c/1C4CD798-2FCD-4315-B0A0-87BC33B31F51.jpeg\" target=\"_blank\" title=\"user_uploads/2/92/vqeQTyNvSaoy_k785IZQm5_c/1C4CD798-2FCD-4315-B0A0-87BC33B31F51.jpeg\">1C4CD798-2FCD-4315-B0A0-87BC33B31F51.jpeg</a></p>\n<div class=\"message_inline_image\"><a href=\"user_uploads/2/92/vqeQTyNvSaoy_k785IZQm5_c/1C4CD798-2FCD-4315-B0A0-87BC33B31F51.jpeg\" target=\"_blank\" title=\"1C4CD798-2FCD-4315-B0A0-87BC33B31F51.jpeg\"><img src=\"user_uploads/2/92/vqeQTyNvSaoy_k785IZQm5_c/1C4CD798-2FCD-4315-B0A0-87BC33B31F51.jpeg\"></a></div>",
        "id": 154025004,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1544652320
    },
    {
        "content": "<p>Right.  The extension that does the linking exists in the core spec.  However, there's no SearchParameter in the core spec to let you search based on that extension - and that's what you're looking for.  You're free to define your own search parameters, but if you want a standard one, you'll need to submit a change request.</p>",
        "id": 154025010,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544652965
    },
    {
        "content": "<p>In general, I'm not sure attaching a reference from a ResearchStudy to a resource makes sense; in the majority of the cases the resources (be they Observations, Conditions, MedicationAdministration/MedicationStatement) are captured into source system, entirely unrelated to their use in a clinical study.  I agree we need to associate these resources to a clinical study, but my inclination is still to do it through the lens of the <code>ResearchSubject</code>. </p>\n<p>Could we have something like a <code>ResearchCarePlan</code> associated with the <code>ResearchSubject</code> that, once the resource has been associated to a given study (by some clinical adjudication), is linked via a <code>supportedBy</code> attribute or similar.  That could also link to the signed consent agreement or similar.  Maybe the reference could also include the profile in the URI so any data ablation before retrieval (eg Patient MRN should not be shared with a research consumer) could be achieved.  </p>\n<p>I wonder if attaching the researchStudy to the resource itself could end up leaking details about other studies ongoing?  Just a thought</p>",
        "id": 154025636,
        "sender_full_name": "Geoff Low",
        "timestamp": 1544795786
    },
    {
        "content": "<p>You can use the existing 'basedOn' relationship to point to a study-specific CarePlan.  Leakage can be an issue regardless of the type of link - e.g. Encounter or EpisodeOfCare.  That's managed by data filtering based on permissions, not through centralized management of links.</p>",
        "id": 154025686,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544811132
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194077\">@Matthew Koch</span> :<br>\nDefining the searchparameter means:<br>\n- create a SearchParameter resource, in your favorite editor, in XML or JSON<br>\n- fill out the required fields, most notably type (reference), target (Observation) and expression.<br>\n- expression is FhirPath, you can experiment with e.g. <a href=\"https://github.com/brianpos/FhirPathTester\" target=\"_blank\" title=\"https://github.com/brianpos/FhirPathTester\">https://github.com/brianpos/FhirPathTester</a><br>\n- your expression would look something like 'Observation.extension.where(url='http://hl7.org/fhir/StructureDefinition/workflow-researchStudy').value', but I haven't tested it.<br>\n- add it to the server. <br>\nAs I happen to know most about Vonk, here's how to do it there:<br>\n- add to a running instance with the <a href=\"http://docs.simplifier.net/vonk/features/conformanceresources.html#manage-conformance-resources-with-the-administration-api\" target=\"_blank\" title=\"http://docs.simplifier.net/vonk/features/conformanceresources.html#manage-conformance-resources-with-the-administration-api\">Administration API</a><br>\n- or administer your SearchParameter (along with your profiles, examples and IG) on Simplifier and <a href=\"http://docs.simplifier.net/vonk/features/conformanceresources.html#load-conformance-resources-from-simplifier-net\" target=\"_blank\" title=\"http://docs.simplifier.net/vonk/features/conformanceresources.html#load-conformance-resources-from-simplifier-net\">connect the two</a>.</p>",
        "id": 154025899,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1545030181
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention\" data-user-id=\"194077\">@Matthew Koch</span> :<br>\nDefining the searchparameter means:<br>\n- create a SearchParameter resource, in your favorite editor, in XML or JSON<br>\n- fill out the required fields, most notably type (reference), target (Observation) and expression.<br>\n- expression is FhirPath, you can experiment with e.g. <a href=\"https://github.com/brianpos/FhirPathTester\" target=\"_blank\" title=\"https://github.com/brianpos/FhirPathTester\">https://github.com/brianpos/FhirPathTester</a><br>\n- your expression would look something like 'Observation.extension.where(url='http://hl7.org/fhir/StructureDefinition/workflow-researchStudy').value', but I haven't tested it.<br>\n- add it to the server. <br>\nAs I happen to know most about Vonk, here's how to do it there:<br>\n- add to a running instance with the <a href=\"http://docs.simplifier.net/vonk/features/conformanceresources.html#manage-conformance-resources-with-the-administration-api\" target=\"_blank\" title=\"http://docs.simplifier.net/vonk/features/conformanceresources.html#manage-conformance-resources-with-the-administration-api\">Administration API</a><br>\n- or administer your SearchParameter (along with your profiles, examples and IG) on Simplifier and <a href=\"http://docs.simplifier.net/vonk/features/conformanceresources.html#load-conformance-resources-from-simplifier-net\" target=\"_blank\" title=\"http://docs.simplifier.net/vonk/features/conformanceresources.html#load-conformance-resources-from-simplifier-net\">connect the two</a>.</p>\n</blockquote>\n<p>Thanks for this. How would you reference the fact that you are using a custom SearchParameter in an IG?</p>",
        "id": 154026333,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1545230134
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194077\">@Matthew Koch</span> - have you connected with <span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span> ?  I know he wants to talk to you about this - if there's going to be a research IG it should be shepherded by the BR&amp;R group.</p>",
        "id": 154026608,
        "sender_full_name": "Geoff Low",
        "timestamp": 1545295351
    },
    {
        "content": "<p>Sorry for the slow response here. I'll do my best to reply. </p>\n<p>Ever since FHIR became a part of the discussion internally, we've been trying to find ways to best leverage the technology, both as defined in the spec and via the quite robust extensibility mechanisms FHIR offers. We have a specific use case around data sharing we are trying to build out. I feel that the best way to communicate expectations and give general guidance about how we intend to accomplish this is via an IG. As I understand it, this need not be something that aspires to cover all research cases, but could be scoped to a specific problem or application. To be fair this could probably be outlined better in what we've got so far. That being said, can I hear from you both, or anyone else seeing this, if a governing body or group is required to oversee all IG creation for a given domain? I'll also note that we are attempting to describe how we intend to use FHIR given the current state of the platform and the tools available, not necessarily shape future change to the core specification.</p>",
        "id": 154026619,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1545309693
    },
    {
        "content": "<p>An IG can be writen by anyone anywhere. If you write your IG inside the HL7 organization, then HL7 rules apply. If you write your IG in the IHE organization, then IHE rules apply. If you write your IG within your household, ...  Most visible case is Argonaut, which was a bunch of providers and vendors that got together because they had a common goal.   Standards organizations like HL7 and IHE add a governance and transparency that has benefits to your IG being used by others outside of those writing your IG.  Having written an IG in a closed group does not forbid you from bringing it to a standards organization, however that standards organization will then apply their governance and transparency, which might very much produce a different IG. (Like Argonaut has now become US-Core).  So anyone wanting an IG does need to weigh their ability to gather the proper experts to get best accuracy, vs using a standards group (HL7, IHE) to get the most broadly re-usable.<br>\nTo your question of scope. The best IG are very focused on a tight set of use-cases. It is far better to start too constrained, and later relax rules. Plus starting with a tightly constrained use-case will usually get people more passionate about that use-case. As long as your experts are all excited about solving for that tightly constrained use-cases.</p>",
        "id": 154026696,
        "sender_full_name": "John Moehrke",
        "timestamp": 1545314391
    },
    {
        "content": "<p>In the end, the scope of the IG determines the size of the community it applies to and the effort to get consensus from (and adoption by) that community.  Standards organizations can sometimes help that process, but not always.  Whether it works best to start small and grow or start broad and tighten if necessary can also vary depending on the community.  Sometimes you can do both in parallel.  FHIR doesn't dictate an approach.</p>",
        "id": 154026705,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1545322823
    },
    {
        "content": "<p>And I don't think it should dictate an approach; I've seen enough solving the same problem in different locations in the CR realm (with the corollary being it never really gets solved, but a bunch of people are setup in consulting for life)  - I think for something so pivotal we should have a best foot forward approach.  We've had EHR use as a 'nice-to-have-someday' with eSource as a first class citizen in Clinical Research.  I don't want difficulty in choosing the one true path to get in the way of this happening.  TBH it may be a difficult task to motivate the BR&amp;R group sufficiently - they have a number of irons in the fire (excuse the pun) - but I think with enough motivating from some key opinion(ated) leaders we should be able to get some momentum.  Just my $0.02</p>",
        "id": 154026850,
        "sender_full_name": "Geoff Low",
        "timestamp": 1545349958
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span> - Thanks again for the outline of how to define a search param earlier in this thread. I was looking at the \"expression\" piece. Would it not just be <code>Observation.extension('http://hl7.org/fhir/StructureDefinition/workflow-researchStudy')</code> ? Then, in the URI, we'd have something like <code>api/observations?researchstudy=XXXX</code> - do I need the extra bits (using <code>where</code> / <code>.value</code>) / etc?</p>",
        "id": 168599821,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1561040419
    },
    {
        "content": "<p>I just validated in the FHIRPath utility you linked and your expression is good to go :) Thanks. I think I just needed some practice with FHIRPath.</p>",
        "id": 168618448,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1561053374
    },
    {
        "content": "<p>Hello again! Is there a way to represent that a ResearchSubject is being treated at a specific “Site”, (which is linked on ResearchStudy) or would this be done through Encounter somehow? <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 179322458,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1572350706
    },
    {
        "content": "<p>Typically each \"study site\" will have their own ResearchStudy instance that reflects what's happening at that particular site and will have its own status (one study site might still be recruiting, another might not).  The StudySubject would be tied to the site-specific ResearchStudy and those would then be aggregated within the overall ResearchStudy.  <span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span> <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span></p>",
        "id": 179331149,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572357827
    },
    {
        "content": "<p>Thats interesting. Is that how this is handled in the BR&amp;R group ? <span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span> <span class=\"user-mention\" data-user-id=\"196953\">@Myron Finseth</span> <span class=\"user-mention\" data-user-id=\"194425\">@Boris Brodsky</span></p>",
        "id": 179524726,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1572523736
    },
    {
        "content": "<p>It is theoretically correct, but there is a lot of push back from people about using the ResearchStudy resource to represent a site.  It doesn't make sense to most people.  I think the solution may be to create a ResearchSite profile of ResearchStudy.  With that proviso Lloyd is correct that each \"site\" may have its own version of many things that start off as being at an overall study level - protocol version, recruitment targets etc etc.</p>\n<p>We are also expanding the definition of status on the ResearchSubject to allow better representation of the subject journey through the milestones and associated statuses.  I don't think we have it quite right yet, but there may be something committed to the current build on this today.</p>",
        "id": 179616071,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1572605832
    }
]