[
    {
        "content": "<p>Hi there,</p>\n<p>I have an information model: Ability to Perform Nursing Activities.</p>\n<p>Which has a use case:</p>\n<p>Person who performs the nursing activity: Mother<br>\nBeneficiary: Patient (son of the mother)<br>\nActivity: catheterize (this is a reference to a nursing activity, another information model)<br>\nAbility: With help (codeableconcept)</p>\n<p>We're in doubt on how to profile this. Our first thought was to use the Observation structure, but who should be in Observation.subject? The mother, or the patient?</p>\n<p>In all other Observations we used observation.subject to define who the patient is. But this observation is about the mother and her capability to perform the nursing activity on her child. So shouldn't she be the subject?<br>\nIf so, what's the best way to reference the patient in this case?</p>\n<p>Or is the Observation structure not suitable? Should we use another? If so, which one fits better?</p>\n<p>tnx in advance<br>\n<span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  could you help us out?</p>",
        "id": 164456504,
        "sender_full_name": "Sebastiaan Raap",
        "timestamp": 1556547742
    },
    {
        "content": "<p>Bringing in <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> because it's related - at least tangentially - to Practitioner qualifications too.</p>",
        "id": 164459972,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556550353
    },
    {
        "content": "<p>Observation.subject = Mother,  Observation.focus = infant</p>",
        "id": 164503087,
        "sender_full_name": "Eric Haas",
        "timestamp": 1556587611
    },
    {
        "content": "<p>That doesn't seem right.  The observation is describing the mother, not the infant.  Focus is when the true subject differs from the record target here.  <span class=\"user-mention\" data-user-id=\"215518\">@Sebastiaan Raap</span>, whose health record should this statement be part of - the mother's or the baby's?  (In FHIR it generally can't be in both.)</p>",
        "id": 164509826,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556597819
    },
    {
        "content": "<blockquote>\n<p>That doesn't seem right.  The observation is describing the mother, not the infant.  Focus is when the true subject differs from the record target here.  <span class=\"user-mention silent\" data-user-id=\"215518\">Sebastiaan Raap</span>, whose health record should this statement be part of - the mother's or the baby's?  (In FHIR it generally can't be in both.)</p>\n</blockquote>\n<p>The health record applies to the infant. To clarify: the information deals with the question 'is the patient able to perform the nursing intervention?'. One of the options is: 'yes, with help', in which case a third person needs to be involved.</p>\n<p>To me, it looks a bit dangerous to make the subject of the observation dependent of the 'ability' status, as 'with help' is just one of the options - in any other case, the subject will always be the infant, but in this particular case it suddenly changes. (We also have a bunch of other 'ability' statements; feeding, drinking, clothing, washing, etc. which don't include the 'with help' option; it would be nice if we could align this observation with the other ones). <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span></p>",
        "id": 164516270,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1556607487
    },
    {
        "content": "<p>well the description of focus is...\"The actual focus of an observation when it is not the patient of record representing something or someone associated with the patient such as a spouse, parent, fetus, or donor. For example, fetus observations in a mother's record. The focus of an observation could also be an existing condition, an intervention, the subject's diet, another observation of the subject, or a body structure such as tumor or implanted device. <strong>An example use case would be using the Observation resource to capture whether the mother is trained to change her child's tracheostomy tube</strong>. In this example, the child is the patient of record and the mother is the focus.\"</p>\n<p>That bold bit sounds a lot like your use case.</p>",
        "id": 164517479,
        "sender_full_name": "Eric Haas",
        "timestamp": 1556609012
    },
    {
        "content": "<p>I don't remember where that use case came from, maybe Lloyd does...</p>",
        "id": 164517551,
        "sender_full_name": "Eric Haas",
        "timestamp": 1556609076
    },
    {
        "content": "<p>so flip what I said earlier.  </p>\n<p>focus = mom, subject = kid</p>",
        "id": 164517581,
        "sender_full_name": "Eric Haas",
        "timestamp": 1556609126
    },
    {
        "content": "<blockquote>\n<p>well the description of focus is...\"The actual focus of an observation when it is not the patient of record representing something or someone associated with the patient such as a spouse, parent, fetus, or donor. For example, fetus observations in a mother's record. The focus of an observation could also be an existing condition, an intervention, the subject's diet, another observation of the subject, or a body structure such as tumor or implanted device. <strong>An example use case would be using the Observation resource to capture whether the mother is trained to change her child's tracheostomy tube</strong>. In this example, the child is the patient of record and the mother is the focus.\"</p>\n<p>That bold bit sounds a lot like your use case.</p>\n</blockquote>\n<p>This does sound a lot like our use case and it'll keep our 'ability' use cases consistent. Thanks for the input, we're discussing the solution tomorrow.</p>",
        "id": 164534347,
        "sender_full_name": "Sebastiaan Raap",
        "timestamp": 1556627395
    },
    {
        "content": "<p>Right.  It makes more sense to have the child as the subject and mother as the focus here too.  Child's chart, with potential different observations relating to the skills of mom, dad and grandma.</p>",
        "id": 164544665,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556635384
    }
]