[
    {
        "content": "<p>I have currently built a profile on condition, with condition.stage.assessment referring to several other profiles on observation.<br>\nCurrently I have used the | to sepearate the references (i.e. Reference(Observation){profile 1} | Reference(Observation){profile 2} | ...)  but I am unclear if I should be slicing condition.stage.assessment  instead?<br>\nAs far as I understand, the resultant paths are not affected by slicing, only the ID's are, and that a discriminating factor between the references is alread provided (each has different profile uris) is there a benefit to slicing in this case?</p>",
        "id": 153874016,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1488292592
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193151\">@Sadiq Saleh</span> if you just want to define  a couple of (external) element type profiles to choose from, then you don't need to slice the element. Instead, you can simply extend the element type collection:</p>\n<div class=\"codehilite\"><pre><span></span>        &lt;type&gt;\n          &lt;code value=&quot;Reference&quot; /&gt;\n          &lt;profile value=&quot;http://example.org/fhir/StructureDefinition/CustomProfile1&quot; /&gt;\n        &lt;/type&gt;\n        &lt;type&gt;\n          &lt;code value=&quot;Reference&quot; /&gt;\n          &lt;profile value=&quot;http://example.org/fhir/StructureDefinition/CustomProfile2&quot; /&gt;\n        &lt;/type&gt;\n</pre></div>",
        "id": 153874019,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1488292883
    },
    {
        "content": "<p>Thanks for your prompt response <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> , that is currently how I have it set up. So I guess the issue is that I don't quite understand the contexts in which slicing is beneficial (other than in the examples given w.r.t. blood pressure, etc.).<br>\nA follow up question is that given an instance where this profile is populated by data, how would I refer to a specific reference from this list (i.e. specifically to CustomProfile1)? As I mentioned I know we can distinguish it using the profile tag, but is there another way which I am unaware of?</p>",
        "id": 153874031,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1488295099
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193151\">@Sadiq Saleh</span> Slicing is an advanced profiling technique. You use slicing if you want to define additional profiling constraints on the individual slices <em>from within the referencing profile</em>. The discriminator allows you to define the unique aspect(s) that identifies each slice. I suggest you examine some examples on the FHIR website or on Simplifier to get a better understanding.</p>",
        "id": 153874032,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1488295632
    },
    {
        "content": "<p><a href=\"https://www.hl7.org/fhir/profiling.html#slicing\" target=\"_blank\" title=\"https://www.hl7.org/fhir/profiling.html#slicing\">https://www.hl7.org/fhir/profiling.html#slicing</a></p>",
        "id": 153874033,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1488295651
    },
    {
        "content": "<p>Thanks again. I have looked through the examples on the FHIR page, but will also take a look at those on Simplifier to further my understanding.</p>",
        "id": 153874034,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1488295763
    },
    {
        "content": "<p>Michel is the slice king.   I tend to avoid slicing and use invariant where I can instead especially since I expect my profiles to be reprofiled and I worry about burdening downstream with profilers  reslicing.   Check out the section on reslicing as well.</p>",
        "id": 153874059,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488303544
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <br>\nCould you give me an example of how you would use an invariant as a replacement to slicing?</p>",
        "id": 153874061,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1488303988
    },
    {
        "content": "<p>In my case most slicing by type, code or valueset  so for example category  here instead of a valueset slice I used:</p>\n<div class=\"codehilite\"><pre> us-core-1: A code in Condition.category SHOULD be from US Core Condition Category Codes value set. (: where(category in    http://hl7.org/fhir/us/core/ValueSet/us-core-condition-category&#39;).exists())&quot;\n</pre></div>",
        "id": 153874063,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488305143
    },
    {
        "content": "<p>Slicing is a bit more explicit. A slice definition in a profile is easier to parse and understand than an expression constraint. For example, if you render a sliced profile, then the result will typically show the slice elements. However there is no such expectation from expressions; hence this information is a bit more implicit.</p>",
        "id": 153874065,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1488305428
    },
    {
        "content": "<p>That is what I understood from looking at the results from slicing Condition, that the slices were explicitly linked to a specific profile and that this was reflected in differing ids, but not in differing paths. For example slices on Condition.category would look like Condition:Profile1.category:Slice1, but the path for all slices is still Condition.category. Thus the only way to differentiate them is to use the discriminator to understand the data that is provided at that path.</p>",
        "id": 153874083,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1488309268
    }
]