[
    {
        "content": "<p>Hey all,<br>\nI need some advice on the best way to achieve what I am trying to do in my app. This is a C# ASP.NET Web App hosted in the cloud with its own SQL Database backend. This is more of an Administrative level app rather than clinical. </p>\n<p>What the app wants to know:<br>\n1) When a planned or scheduled admission is created or updated<br>\n2) When that planned or scheduled admission turns into an actual admission<br>\n3) When a standard admission happens<br>\n4) When a transfer happens<br>\n5) When a discharge happens</p>\n<p>The app is external from any EHR but does have the ability to receive FHIR resources and/or go out and get FHIR resources.<br>\nSo, what is the best way to achieve what the app is meant to handle and what is the most \"standard\" way to do it across EHRs?</p>",
        "id": 153978427,
        "sender_full_name": "Justin",
        "timestamp": 1532629978
    },
    {
        "content": "<p>The simplest thing would be to subscribe to the Encounter resources of interest.  Then you'll get notified whenever they're created or changed.  You'll get notifications about changes you don't care about that you'd need to ignore, but it's the least effort for the server - and thus more likely that servers will actually do it.</p>",
        "id": 153978432,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532630544
    },
    {
        "content": "<p>Thanks for the answer! Yes that is what I have been working towards. Do you know of a good workflow/use case document that outlines the different Encounter statuses and when they are used? Also, would an Encounter flow act as (for status) Planned -&gt; Arrived -&gt; In-Progress -&gt; Finished and keep the same Encounter ID?</p>",
        "id": 153978438,
        "sender_full_name": "Justin",
        "timestamp": 1532631321
    },
    {
        "content": "<p>FHIR supports a wide variety of flows and it's hard to guarantee consistency given that internal business processes aren't the same.  For example,in some cases you might be discharged from an emergency encounter and then admitted for an inpatient encounter.  In other organizations that would be handled as a transfer.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>, <span class=\"user-mention\" data-user-id=\"191797\">@Irma Jongeneel</span> - are you aware of any specific guidance/documentation beyond what's already in the spec?</p>",
        "id": 153978439,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532631661
    },
    {
        "content": "<p>ahh that reminds me, the app would only be interested with inpatient but yes the differences by ehr make total sense! Just the joys of trying to make an external administrative application!</p>",
        "id": 153978440,
        "sender_full_name": "Justin",
        "timestamp": 1532631754
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Like you said, some systems would see that as a transfer, others as a discharge and new encounter.</p>",
        "id": 153978445,
        "sender_full_name": "Irma Jongeneel",
        "timestamp": 1532632682
    },
    {
        "content": "<p>And there isn't anything linking that together besides the patient ID correct?</p>",
        "id": 153978448,
        "sender_full_name": "Justin",
        "timestamp": 1532633348
    },
    {
        "content": "<p>Also, is there an efficient way to pull new/updated encounters out of Fhir with search parameters? I assume this is also depending on the Fhir EHR of how we can pull?</p>",
        "id": 153978449,
        "sender_full_name": "Justin",
        "timestamp": 1532634276
    },
    {
        "content": "<p>admitSource could give a hint - e.g. admitSource=emergency would be a hint to look for an encounter.  There's also an associated-encounter extension.  But whether those will be populated or not is probably not something you can rely on.</p>",
        "id": 153978450,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532634427
    }
]