[
    {
        "content": "<p>Howdy</p>\n<p>in a relational DBMS, are there any advantages to using GUIDs vs the native primary key (big int) implementation to identify FHIR resources?</p>",
        "id": 174922376,
        "sender_full_name": "Shane O'Neill",
        "timestamp": 1567630757
    },
    {
        "content": "<p>Only benefit is if you want to use PUT creates on a server where lots of other servers are also performing creates.  With GUIDs you know there won't be collisions.  With big int ids, there can be.  If you're not in that situation, no benefit.</p>",
        "id": 174938014,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567648142
    },
    {
        "content": "<p>GUIDs could also have a minor privacy benefit, in that you can't infer anything about the order that resources were created by looking  at their IDs. I can't think of a scenario where that would be an exploitable fact, but that doesn't mean there aren't any..</p>",
        "id": 174958314,
        "sender_full_name": "James Agnew",
        "timestamp": 1567676376
    },
    {
        "content": "<p>I would use guids for a number of reasons:<br>\nClearly don't know your usecases nor db choice etc but 3 quick reasons (out of a greater number)<br>\n1) Often for reasons of scalability (or lack thereof) you might have identical db'es in a n customer orgs (e.g. gp surgeries or hospitals) per db arrangement. If the scalability then improves and you want to move to one db period or even simply more customer orgs per db then you will have a problem of identical keys with ints.<br>\n2) If using a variety of sharded db options guids are more random and thus ease the hot partition problem<br>\n3) Because of the growing prevalence of the use of guids as keys the indexing around them has improved such that there is little if any benefit any more to using ints (admittedly there did use to be &amp; possibly in your choice of db there still might be)</p>",
        "id": 174959668,
        "sender_full_name": "Adam Flinton",
        "timestamp": 1567677745
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"232411\">@Shane O'Neill</span>  -- one disadvantage of using GUIDs is that they do not necessarily work well as primary DB keys.  I'm not a 'DB guy' but I remember a DB architect talking about this problem from a performance and space perspective.</p>",
        "id": 174972086,
        "sender_full_name": "John Silva",
        "timestamp": 1567689417
    },
    {
        "content": "<p>The issue typically comes in if the DB in question doesn't have a first class GUID/UUID type and thus dumps these into strings. And indexing off those strings for what would have been a \"unique id\" lookup tends to be slower, from what I understand</p>",
        "id": 174985256,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1567697499
    },
    {
        "content": "<p>In MSSQL Server (relational I'm most comfortable with), uniqueidentifier is a 128 bit binary value.  Performance is no different from other binary types, but it's larger than an integer type (e.g., 64 bit bigint).  That said, I'm now of the 'storage is cheap' camp for things like this - I'd rather inflate by the extra 64 bits and not worry about collisions when I consolidate databases.</p>",
        "id": 174987208,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1567698645
    },
    {
        "content": "<p>One other point in favour of GUIDs: Anytime you use a sequence to generate IDs, sooner or later an application restart or rolled back transaction causes a gap in your IDs, and even though this gap makes absolutely no meaningful difference to anyone or anything, it's a guarantee that some bright-eyed analyst will notice and freak out on the developers that there are gaps. Use GUIDs and the issue goes away..... ;)</p>",
        "id": 175018631,
        "sender_full_name": "James Agnew",
        "timestamp": 1567720636
    },
    {
        "content": "<p>GUIDs are good candidates for primary keys in modern RDBMS, providing they are not used as clustered indexes. From an RDBMS perspective (certainly in MSSQLS) they are required to perform replication. They are also used as identifiers in SNOMED CT Reference Sets.</p>",
        "id": 175020576,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1567722461
    }
]