[
    {
        "content": "<p>Hi, <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> ,<br>\nIs there any smart way to include billing data, such as coverage or self-pay option, into a patient encounter?<br>\nWe have at least two projects where we need this, because billing information can be different for each visit. In our case, we extended Encounter resource with a reference to a particular patient coverage or self-pay option, but considering this will be an often case,  could you suggest more convenient way  to do that?<br>\nHas anyone had a similar issue?</p>",
        "id": 153964054,
        "sender_full_name": "Varvara",
        "timestamp": 1526985048
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194124\">@Varvara</span> Hi: Can you give me a bit more of the use case as it isn't clear to me why the coverage would be different on different visits. (Clearly coverage can change over time, and different coverages may be applicable depending upon the circumstance such as work related injury or an auto accident, but typically features of the charge and encounter such as date would be used by your system to triage through the coverages (which are normally referenced by Account) to determine both which coverages are applicable and the coordination of benefit order if there are multiple coverages which may be applicable.).</p>\n<p>Please also check with the  Patient Administration work group as they own encounter and may be able to better advise you on your use case and what extension is appropriate.</p>",
        "id": 153964059,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1526990820
    },
    {
        "content": "<p>Thank you, <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> , I will confirm with PA group for sure. <br>\nour conclusion that billing data has a connection to a particular visit was based on several use cases:<br>\n1. Even if a patient has coverage, it's not applicable for some services/visits (such as cosmetic services/visits)<br>\n2. Patient may use self pay option any time even with the active coverage, for example, if there is no referral (and the plan requires referral) or coverage is temporary inactive/ provider is out-of-network.<br>\n3. Claim submission and adjudication may take a long time, during which patient plan could be changed, so new visits will be associated with a new coverage, but the old visits are still refer to the old one. It seems that for such cases we would need to create a new Account for a patient, or are we missing something here?</p>",
        "id": 153964579,
        "sender_full_name": "Varvara",
        "timestamp": 1527158785
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"194124\">@Varvara</span> Typically the Account would hold, reference, the list of coverages and the item being changed would indicate, I expect, whether it was selfpay. If self pay then it would be gathered with other selfpay items, run through the grouper/pricer/billing black box and emerge as zero or more things to be billed directly to the individual. If insured then the items would be gathered and run through the grouper/pricer/billing black box and emerge as zero or more things to be sent as claims in an iterative fashion against the list of applicable coverages, in the coordination of benefit order, and only for those coverages which were in force on the date of service until the list of coverages was exhausted or the receivable is accounted for. Any balance remaining after the insurance claiming would then be billed to the patient, their guarantors, etc. <br>\nWhile there are any number of ways to design a financial system, typically the designs I have build and seen do not list the applicable coverages on each encounter , rather they filter the list of available coverages based on nature of event, event date or service date etc. to derive the suite of coverages to claim against.<br>\nWhat you may need in the encounter is a code to indicate: selfpay; auto accident related; work accident related; Property/Casualty accident related (home, office etc); none of the above. This would aid in the processing determinations.</p>",
        "id": 153964581,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1527162297
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"194124\">@Varvara</span> is correct with planning to have a separate account for each Encounter - or at least for each Encounter where payment information has changed.  A single code isn't going to allow the patient the flexibility of choosing to exclude a particular coverage from payment, for example.  Or to indicate whether they want to use patient-directed funding within their insurance plan to cover a particular service or not.  Setting up an account specifically for a particular set of services would allow this to be tracked.</p>",
        "id": 153964603,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527171439
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>, <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>   your thoughts on this?</p>",
        "id": 153971457,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1529921542
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194124\">@Varvara</span>   You typically wouldn't created a new account just because your coverage changed. The coverage which is applicable is based on the active period of the coverage and the date of service.</p>\n<p>You may have a few accounts if you want to manage further which coverages are to be used for example you could choose to flag a charge as being work or accident related to support the downstream systems to select the correct coverages, eg. Workers Compensation, or you could have an additional account which also has the Workers Compensation coverage listed.<br>\nAlso you might set up a selfpay account but you wouldn't normally set up one per charge card or encounter. In fact often the patient funding is handed by putting a credit on the account which is used to clear the self pay changes or when it is known that certain changes are not insurable they remain in the account and the patient, or responsible parties, settle the account later.</p>",
        "id": 153974609,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1531310357
    }
]