[
    {
        "content": "<p>What is this new securityContext element now in Binary? It says it is a reference to Any. The definition seems to indicate that an Access Control decision point should treat this Binary resource in the same way it would treat this other resource. How might that be used? This seems to imply that this 'other' resource is equivalent from a security 'context'? </p>",
        "id": 153863275,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481664243
    },
    {
        "content": "<p>Is this for a case where some non-FHIR formatted data is imported into a FHIR system, thus it is saved as a Binary for reference purposes; then decomposed into N FHIR native resources. Is this the use-case? If so, how would one find the Binary object? In cases like where DocumentReference is used, the DocumentReference would be the way to discover the Binary object, and DocumentReference contains the metadata that is used to rule over accessibility of the Binary object. Thus in the case of DocumentReference managed Binary, the pointer is in the opposite direction. Thus I am struggling with why I would have a pointer from Binary to something else. For HL7 v2 message ingestion, wouldn't a Provenance record be the linkage between the various derived FHIR resources and the Binary copy of the original v2 message? Thus Provenance is how one discovers Binary?</p>",
        "id": 153863276,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481664530
    },
    {
        "content": "<p>I think the main use case is for there is no reference to the binary (yet?)</p>",
        "id": 153863290,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481666746
    },
    {
        "content": "<p>The frustrating part is that this was added using <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10126\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10126\">GF#10126</a> which is the CR I created with the intent to just add a \"Security Considerations\" section to the Binary resource page to inform the reader that Binary is different and not as clear how to protect. I don't like the solution, and my objections on the gForge tracker were ignored. Now it exists and I can't figure out how to use it.</p>",
        "id": 153863322,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481670381
    },
    {
        "content": "<p>If you add a comment on a task resolution long after the task is resolved, you really need to alert people to that</p>",
        "id": 153863323,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481670661
    },
    {
        "content": "<p>ok, it wasn't long after. still, it was after</p>",
        "id": 153863324,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481670697
    },
    {
        "content": "<p>There's a gap between 'I  don't need to use X' and \"I don't like X'. I don't follow why you don't like it</p>",
        "id": 153863325,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481670741
    },
    {
        "content": "<p>first. the solution is counter to the way that Binary would be used with DocumentReference.</p>",
        "id": 153863326,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481670890
    },
    {
        "content": "<p>That can be solved by explaining DocumentReference, and saying when Binary is used with DocumentReference that the DocumentReference method is to be used.</p>",
        "id": 153863327,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671011
    },
    {
        "content": "<p>Note that it is important to recognize that the meta tags protecting DocumentReference are different than the security-tags that DocumentReference holds that are used to protect the Binary.</p>",
        "id": 153863329,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671067
    },
    {
        "content": "<p>they might be equal, but might not.</p>",
        "id": 153863330,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671074
    },
    {
        "content": "<p>we could add documentation about both of those</p>",
        "id": 153863331,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481671112
    },
    {
        "content": "<p>okay, than what use-case is left... lets decompose that and determine if there is a solution.   I think the other formally understood use-cases are less clear, they are ANY resource that  has an element that is an Attachment... unfortunate we don't have them nicely grouped</p>",
        "id": 153863333,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671201
    },
    {
        "content": "<p>so, for those... we use this SecurityContext? And if so, how does that work?</p>",
        "id": 153863334,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671245
    },
    {
        "content": "<p>there are people out there using Binary directly without referencing it from attachment</p>",
        "id": 153863335,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481671262
    },
    {
        "content": "<p>Especially for cases where the Binary has a relationship to more than one FHIR Resource (e.g. the HL7 v2 message decomposed).</p>",
        "id": 153863336,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671275
    },
    {
        "content": "<p>Binary, as in not related to anything? If so, then do they have a use for SecurityContext?</p>",
        "id": 153863337,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671312
    },
    {
        "content": "<p>yes. it's linked to their context somehow - typically, patient - but that is not explicit in their resources</p>",
        "id": 153863338,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481671375
    },
    {
        "content": "<p>I can think of many nefarious uses for a server that will accept Binary RESTful actions...</p>",
        "id": 153863339,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671383
    },
    {
        "content": "<p>they will learn... can't mandate security-by-design</p>",
        "id": 153863340,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671421
    },
    {
        "content": "<p>I'm sure that if you think about it, you can also think of some valid uses</p>",
        "id": 153863341,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481671428
    },
    {
        "content": "<p>I know of some, yes... but I always try to create a security risk management plan around them.</p>",
        "id": 153863342,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671466
    },
    {
        "content": "<p>well, here, you appear to be taking exception to a information field that exists to support various risk mgmt plans</p>",
        "id": 153863343,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481671509
    },
    {
        "content": "<p>Binary is important. And securityContext might be the right solution. I started the thread with a question asking how to use it. I have new understanding, but not enlightenment</p>",
        "id": 153863344,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671521
    },
    {
        "content": "<p>is seeking enlightenment not acceptable?</p>",
        "id": 153863345,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671573
    },
    {
        "content": "<p>lol</p>",
        "id": 153863346,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481671573
    },
    {
        "content": "<p>so, I can create text that can help people understand how to protect Binary if that binary is referenced from DocumentReference.... </p>",
        "id": 153863347,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671620
    },
    {
        "content": "<p>I can do similar if I understood a reasonable set of other Attachment places...</p>",
        "id": 153863348,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671644
    },
    {
        "content": "<p>For example, When Binary is used in Patient.photo; then protecting it with the same 'security context' as Patient seems logical. </p>",
        "id": 153863349,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671682
    },
    {
        "content": "<p>and if ultimately we need bidirectional URL (which is what the current solution seems to be designing) because the current directional url is from Attachment to Binary... then I guess we create bidirectional URL, something surely going to get broken.</p>",
        "id": 153863350,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671738
    },
    {
        "content": "<p>well, when we dsicussed it, there were a few considerations</p>",
        "id": 153863351,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481671811
    },
    {
        "content": "<p>so some reasonable subset of \"Attachment is used in the following places: BodySite, Claim, Communication, CommunicationRequest, Consent, Contract, DiagnosticReport, DocumentManifest, DocumentReference, ExplanationOfBenefit, HealthcareService, Library, Media, Observation, Patient, Person, Practitioner, Questionnaire, QuestionnaireResponse and RelatedPerson\"</p>",
        "id": 153863352,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671814
    },
    {
        "content": "<p>amybe </p>",
        "id": 153863353,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481671836
    },
    {
        "content": "<p>in principle, if a resource references  a binary, then it should be secured as for the resource that references it. </p>",
        "id": 153863354,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481671836
    },
    {
        "content": "<p>what about when multiple Resources reference the same Binary</p>",
        "id": 153863355,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671861
    },
    {
        "content": "<p>for example a CDA document that is decomposed into thousands of FHIR objects...</p>",
        "id": 153863356,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671889
    },
    {
        "content": "<p>maybe. that is. at least, probably. Though we haven't said what the rules are - if we could - about resources that reference things that have higher privelege</p>",
        "id": 153863357,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481671934
    },
    {
        "content": "<p>actually Attachment is not enough... as it is really Resource(ANY) too.. right?</p>",
        "id": 153863358,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671936
    },
    {
        "content": "<p>I am thinking about Provenance, which we are modeling to say that the source material might be something like an HL7 v2 message that is saved in a Binary...</p>",
        "id": 153863359,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481671986
    },
    {
        "content": "<p>there was also an issue about posting order - if you aren't using transactions, the binary will be created before the thing that references it</p>",
        "id": 153863360,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481672002
    },
    {
        "content": "<p>hmmm, you operational people... in theory it just happens...</p>",
        "id": 153863361,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481672032
    },
    {
        "content": "<p>hah. the gap between theory and reality is bigger in reality than in theory</p>",
        "id": 153863362,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481672099
    },
    {
        "content": "<p>So, how about three cases: ( 1 ) DocumentReference, ( 2 ) Provenance, and ( 3 ) undefined.... That is, if you have special handling needed on a Binary, then you must either have a DocumentReference or a Provenance.</p>",
        "id": 153863363,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481672149
    },
    {
        "content": "<p>we did intend to reduce the pressure on this by introducing an operation on DocumentReference that gives you direct access to it's content in native form</p>",
        "id": 153863364,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481672163
    },
    {
        "content": "<p>something like GET DocumentReference/[id]/$content</p>",
        "id": 153863365,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481672187
    },
    {
        "content": "<p>I thought that magjic just happened with Binary</p>",
        "id": 153863366,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481672194
    },
    {
        "content": "<p>but we didn't do that, and it's complicated since DocumentReference can acutally include multiple things</p>",
        "id": 153863367,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481672214
    },
    {
        "content": "<p>OH, because the request is saying I want DocumentReference in FHIR form; but I want any Binary in native</p>",
        "id": 153863368,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481672221
    },
    {
        "content": "<p>in IHE MHD, I just forced two steps... </p>",
        "id": 153863369,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481672264
    },
    {
        "content": "<p>although I might have implied the impossible... hmm, better go look.</p>",
        "id": 153863370,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481672326
    }
]