[
    {
        "content": "<p>If I want to create a DocumentReference, what are my options for uploading the actual document? <br>\nAs I see it, I can include it in the content.attachement.data, but that means I need to base64 encode it before sending it. <br>\nAlternatively, I think I can do it as two transactions: post the content unencoded to the Binary endpoint to create a new Binary resource, then reference that location in the content.attachment.url. However, that means two separate transactions. If I want to do this for multiple documents, I could upload all the new DocumentReferences in a transaction, but each Binary needs to be a separate call.<br>\nDoes FHIR support an equiavelent to MTOM/XOP, or some similar way of efficiently referencing and transmitting binary content? What about multipart HTTP?</p>",
        "id": 153838331,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1468521644
    },
    {
        "content": "<p>Binary also requires base64 encoding.  <a href=\"http://hl7-fhir.github.io/binary-definitions.html#Binary\" target=\"_blank\" title=\"http://hl7-fhir.github.io/binary-definitions.html#Binary\">http://hl7-fhir.github.io/binary-definitions.html#Binary</a></p>",
        "id": 153838333,
        "sender_full_name": "Eric Haas",
        "timestamp": 1468522998
    },
    {
        "content": "<p>Elliot, take a look at MHD. We do the equivalent of XDS Provide&amp;Register with a Bundle holding DocumentReference, DocumentManifest, List, and Binary. One POST, many create requests.</p>",
        "id": 153838334,
        "sender_full_name": "John Moehrke",
        "timestamp": 1468523619
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , it is basically this context I was considering. We would need to base64 encode the document content in order to transmit it. The only way I can see to avoid the extra effort of encoding the document  is to do a separate post of the document (unencoded) to the Binary endpoint, and then create a  DocumentReference in a separate post.</p>",
        "id": 153838382,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1468527351
    },
    {
        "content": "<p>certainly that's the only way we describe</p>",
        "id": 153838385,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468527829
    }
]