[
    {
        "content": "<p>Hello,</p>\n<p>I would like to implement a  BInary reference into a Composition resource but I don't know where is the better place.<br>\nI thought about the \"subject\" field, but I need it for \"Patient\".<br>\nThe easiest option would be to put the Binary reference into an extension but I'm not sure that's quite right.<br>\nThanks</p>",
        "id": 153924250,
        "sender_full_name": "Florian Kelnerowski",
        "timestamp": 1513001727
    },
    {
        "content": "<p>what is in your Binary? What purpose does it have? What do you think the recipient is going to do with it?</p>",
        "id": 153924251,
        "sender_full_name": "John Moehrke",
        "timestamp": 1513001962
    },
    {
        "content": "<p>My Binary will contain the PDF itself, in base-64, nothing more. <br>\nThe goal of the Composition is to reference the Binary but also to contain some \"metadata\" of this Binary.</p>",
        "id": 153924256,
        "sender_full_name": "Florian Kelnerowski",
        "timestamp": 1513005030
    },
    {
        "content": "<p>Then seems your Binary would be in the Composition.section.entry... I might suggest that your Binary first be pointed to by a DocumentReference or Media; and that is what is pointed to by Composition.section.entry.</p>",
        "id": 153924258,
        "sender_full_name": "John Moehrke",
        "timestamp": 1513005865
    },
    {
        "content": "<p>Why not just use a DocumentReference? Why do you want to have a Composition?</p>",
        "id": 153924259,
        "sender_full_name": "John Moehrke",
        "timestamp": 1513005891
    },
    {
        "content": "<p>Thanks for your answers.<br>\nSo, you think it should look like this : Binary into DocumentReference into Composition ?<br>\nActually I found that Composition would be good to contains the metadatas, thats the only answer. But it seems like DocumentReference would do the work too.<br>\nThe goal of the project is to get a list of the PDF documents of a patient.<br>\nMy actual solution is to get a list of Composition (through an automatic Bundle) which will each contain the metadatas of the document (+ references to Encounter, Location,Period...) and the reference to the Binary. <br>\nIf I use DocumentReference, the Binary reference would be in : content -&gt; attachment -&gt; url ?</p>",
        "id": 153924467,
        "sender_full_name": "Florian Kelnerowski",
        "timestamp": 1513074117
    },
    {
        "content": "<p>SO you clarified why just DocumentReferene-&gt;Binary is not sufficient. This would be sufficient if you were just looking for a way to discover the PDF files. This is common \"Document Sharing\" solution, originally based in IHE-XDS, now available in FHIR. Profiled in IHE using the MHD profile.</p>",
        "id": 153924498,
        "sender_full_name": "John Moehrke",
        "timestamp": 1513087007
    },
    {
        "content": "<p>There is an additional profile from IHE - mXDE, which shows interaction between a Document Sharing environment and an API that makes more fine-grain data (FHIR Resources) available <a href=\"http://wiki.ihe.net/index.php/Mobile_Cross-Enterprise_Document_Data_Element_Extraction\" target=\"_blank\" title=\"http://wiki.ihe.net/index.php/Mobile_Cross-Enterprise_Document_Data_Element_Extraction\">http://wiki.ihe.net/index.php/Mobile_Cross-Enterprise_Document_Data_Element_Extraction</a>; using the IHE QEDm profile (very similar to USA specific argonaut) <a href=\"http://wiki.ihe.net/index.php/Query_for_Existing_Data_for_Mobile\" target=\"_blank\" title=\"http://wiki.ihe.net/index.php/Query_for_Existing_Data_for_Mobile\">http://wiki.ihe.net/index.php/Query_for_Existing_Data_for_Mobile</a>.    These are all international standards from IHE.</p>",
        "id": 153924499,
        "sender_full_name": "John Moehrke",
        "timestamp": 1513087190
    },
    {
        "content": "<p>You seem focused on using Composition, but it is not clear to me that you are actually creating a true Document <a href=\"http://build.fhir.org/documents.html\" target=\"_blank\" title=\"http://build.fhir.org/documents.html\">http://build.fhir.org/documents.html</a>    It seems more that you are just needing a Operation that returns a Bundle. That bundle could contain the Encounter, Location, Patient, Provider, DocumentReference, and Binary) resources as necessary.  The structure of Composition might not be adding value.</p>",
        "id": 153924500,
        "sender_full_name": "John Moehrke",
        "timestamp": 1513087358
    },
    {
        "content": "<p>That said, there is no problem with having a Composition carrying all of those resources including carrying the DocumetReference that points at (and describes) the Binary(PDF).  Each of these resources would be different section elements.</p>",
        "id": 153924501,
        "sender_full_name": "John Moehrke",
        "timestamp": 1513087436
    },
    {
        "content": "<p>I am also hearing some are using DocumentReference to point at not just documents, but also other resources like Encounter, Location, etc.. That is that the DocumentReference is their primary API, and it can point at ANY FHIR resource in addition to content agnostic Documents.</p>",
        "id": 153924502,
        "sender_full_name": "John Moehrke",
        "timestamp": 1513087531
    },
    {
        "content": "<p>'I am also hearing some are using DocumentReference to point at not just documents, but also other resources like Encounter, Location, etc.. That is that the DocumentReference is their primary API, and it can point at ANY FHIR resource in addition to content agnostic Documents.'  seems indirect way of doing this - but ok</p>",
        "id": 153924544,
        "sender_full_name": "Eric Haas",
        "timestamp": 1513097769
    }
]