[
    {
        "content": "<p>If my accept header states that I'd like to have a JPEG image, whereas the Binary resource states that the resource in question is mime-type DICOM, would it be OK for a server to create a JPEG ? - <a href=\"http://build.fhir.org/binary.html#rest\" target=\"_blank\" title=\"http://build.fhir.org/binary.html#rest\">http://build.fhir.org/binary.html#rest</a> doesn't seem to preclude this arrangement. <br>\nOne can't force a server to perform this conversion, but if it has the capability, and that capability is known to a client, why not?</p>",
        "id": 153924514,
        "sender_full_name": "René Spronk",
        "timestamp": 1513090454
    },
    {
        "content": "<p>(the question was raised during a training course)</p>",
        "id": 153924515,
        "sender_full_name": "René Spronk",
        "timestamp": 1513090487
    },
    {
        "content": "<p>I proposed this very thing in the IHE-MHD profile. We had it in the mXDE profile. I had even envisioned a Server that could take a natively CDA and return a FHIR-Document which has the advantage of giving you the FHIR core resources.  But had to remove it upon public comment given that there was no deterministic way to indicate that a server would or would not do this. It all seemed automatic, with fallback, as defined by http negotiate.  So I like it, but the IHE-MHD community was cautious. So it has been discussed.   There are mechanisms in ImagingStudy and DICOM Web for the specific JPG from DICOM that you speak of.</p>",
        "id": 153924516,
        "sender_full_name": "John Moehrke",
        "timestamp": 1513091170
    },
    {
        "content": "<p>it's legal. but beyond the specification</p>",
        "id": 153924563,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513104287
    },
    {
        "content": "<p>Alternatively we could add an operation to Binary, which would allow servers to express support for mime type conversions, and would allow for parameters which could influence the conversion process, e.g. 'give me a 300 by 200 pixel jpeg of that dicom image', or 'create a FHIR document according to profile X' for this CDA-document. One still wouln't be aware as to what conversions the server supports, so that would still be hit and miss.</p>",
        "id": 153924726,
        "sender_full_name": "René Spronk",
        "timestamp": 1513169050
    },
    {
        "content": "<p>having watched the discussion of this play out in dicom space, I'm super keen for us not to burn effort to solve a difficult problem badly. If people really want a standard for that, there's WADO-RS</p>",
        "id": 153924843,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513192519
    },
    {
        "content": "<p>Sure, but that just solves the DICOM issue, not any other conversions, such as the one mentioned: CDA to FHIR-doc, or CDA to PDF. The latter is fairly common.</p>",
        "id": 153925137,
        "sender_full_name": "René Spronk",
        "timestamp": 1513245907
    },
    {
        "content": "<p>well, the simple format conversions are pretty straight forward: ask for it in a different media type, and see if you can get it</p>",
        "id": 153925156,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513251100
    },
    {
        "content": "<p>Im with Grahame. http negotiate is already available for this. reinventing this with an operation seems like it is not likely to produce any more deterministic results.</p>",
        "id": 153925198,
        "sender_full_name": "John Moehrke",
        "timestamp": 1513265202
    },
    {
        "content": "<p>Agree with John and Grahame. I think doing plain content type conversions is an appropriate extension for a FHIR implementation (hmm, wonder if something should be documented in the Capability statement). If you want to do more with a DICOM image you should put it a DICOMweb server where the semantics are well defined. </p>\n<p>It would also be possible to implement a single system that provided both a FHIR Binary and a DICOMweb interface.</p>",
        "id": 153925263,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1513275396
    }
]