[
    {
        "content": "<p><a href=\"https://www.hl7.org/fhir/condition-definitions.html#Condition.clinicalStatus\" target=\"_blank\" title=\"https://www.hl7.org/fhir/condition-definitions.html#Condition.clinicalStatus\">https://www.hl7.org/fhir/condition-definitions.html#Condition.clinicalStatus</a> is a <code>code</code> with a binding strength of <code>preferred</code>. That's a bug, yes?</p>",
        "id": 153836449,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1467730697
    },
    {
        "content": "<p>Actually, as I look at <a href=\"https://www.hl7.org/fhir/condition.html#def\" target=\"_blank\" title=\"https://www.hl7.org/fhir/condition.html#def\">https://www.hl7.org/fhir/condition.html#def</a> I see other in-line code systems used in value sets that have Preferred binding (<a href=\"https://www.hl7.org/fhir/condition-definitions.html#Condition.category\" target=\"_blank\" title=\"https://www.hl7.org/fhir/condition-definitions.html#Condition.category\">https://www.hl7.org/fhir/condition-definitions.html#Condition.category</a>, <a href=\"https://www.hl7.org/fhir/condition-definitions.html#Condition.verificationStatus\" target=\"_blank\" title=\"https://www.hl7.org/fhir/condition-definitions.html#Condition.verificationStatus\">https://www.hl7.org/fhir/condition-definitions.html#Condition.verificationStatus</a>.) DId this happen because of worries about using SNOMED CT? If so, I suggest these would be excellent candidates (once the SCT equivalent concept is found) to submit to the HTA as requests to IHTSDO for universal access. This would men we could reference these as SCT concepts in the model and any implementer could use them (independent of IHTSDO membership). If FHIR agrees <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  and I can can work that out and take it to HTA.</p>",
        "id": 153836453,
        "sender_full_name": "Robert McClure",
        "timestamp": 1467732128
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> I can't imagine us tightening the bindings for the value sets you identified to be \"required\".  We generally only use required bindings on super-small value sets where there's global consensus or at least where mappings are super-straightforward.  Also, the universal access rule doesn't provide access to relationships, which in SNOMED are what essentially provides the definitions.  Codes without the ability to share or use the definitions isn't much use.</p>",
        "id": 153836455,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1467732853
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> please raise a publishing tracker item - this should be caught by the build tool.</p>",
        "id": 153836456,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1467732878
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Not sure why SCT relationships in this case matter, but I could be missing something. It seems to me these meet all your requirements: they are \"super small\" by my assessment - well less than 10 codes each (usually &lt;5,) mappings would be straight forward, and you get exactly the same thing you have here right now. So what is the complaint?</p>",
        "id": 153836460,
        "sender_full_name": "Robert McClure",
        "timestamp": 1467733553
    },
    {
        "content": "<p>+1 should be required.</p>",
        "id": 153836486,
        "sender_full_name": "Eric Haas",
        "timestamp": 1467747138
    },
    {
        "content": "<p>it's not clear whether they are only preferred because of SCT Licensing rules or because of lack of consensus. I suspect more the latter, but I'm guessing </p>",
        "id": 153836487,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467747176
    },
    {
        "content": "<p>Given that in SCT the relationships define the meaning of a concept, it's astonishing to think that it's meaningful to license the concepts with the relationships</p>",
        "id": 153836489,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467747233
    },
    {
        "content": "<p>Oops I  forgot the licensing prevents it from being anything beyond preferred.  -  Drat  -If we make it required  - then should be code with a fhir code system</p>",
        "id": 153836492,
        "sender_full_name": "Eric Haas",
        "timestamp": 1467747606
    },
    {
        "content": "<p>Added <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10272\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10272\">GF#10272</a> to capture this.</p>",
        "id": 153836506,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1467749023
    },
    {
        "content": "<p>I'm quite certain it's lack of consensus.  There's no clear agreement on what the categories mean or when they get used.  Nor is there consistency in industry around these notions.  <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> I misread what value sets you were referring to.  I'm happy for these to be \"preferred\" from SNOMED - and in fact we must move away from HL7-defined codes here.  But I don't think they can/should be required and don't think we'd consider using required bindings to SNOMED in UV content given the current license terms.</p>",
        "id": 153836509,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1467749128
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> The fact that SNOMED CT binding strengths are example is because of those concerns about SNOMED CT licensing and accessability.  So, I agree that these would be good candidates to request that we have universal access for.  I will mention that I still think that a much simpler and still viable (for IHTSDO and others) process to deal with would be to provide universal access for all concepts and descriptions (not relationships).  But without that, or in the meantime if we ever do get to that, then submitting these to the HTA  for access makes sense.</p>",
        "id": 153836564,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1467781087
    },
    {
        "content": "<p>So these are not currently using SCT. They are custom terminologies. </p>",
        "id": 153836565,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467781496
    },
    {
        "content": "<p>looking at SCT to see what we might use underscores my grounds for concern. Take, for example, 'relapse' as a status. Would you recommend 263855007? 134409004? neither of them are appropriate, but this is not evident in their descriptions, only in their relationships. </p>",
        "id": 153836566,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467781593
    },
    {
        "content": "<p>It's extremely inappropriate for IHTSDO to propose making concepts and descriptions available when you do not know what a description means unless you can look at the relationships</p>",
        "id": 153836567,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467781629
    },
    {
        "content": "<p>if they publish fully descriptive descriptions, then, fine. </p>",
        "id": 153836568,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467781649
    },
    {
        "content": "<p>maybe HTA would like to propose new codes under 394731006. That would seem right to me</p>",
        "id": 153836569,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467781815
    },
    {
        "content": "<p>though there's the condition vs problem thing, of course</p>",
        "id": 153836570,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467781829
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> \"Given that in SCT the relationships define the meaning of a concept\" is true only partly , or not at all, in many cases.  The official statement has always been that the determination of the meaning of a concept is based on the fully specified name.  There is discussion of changing that, but I'm not aware that it has actually been changed (happy to stand corrected if so).  But we know there are issues with relying on the FSNs, as in the examples that you cite.  For the large number of primitive concepts (including those two), the FSN is at least the primary source of the meaning - the set of relationships is by definition/declaration inadequate for that.  In those two examples, looking at the stated isa relationships does provide additional clarity regarding the meaning (theoretically, if the FSNs were complete, that wouldn't be necessary), but the relationships alone do not constitute or represent the definition of the concept.</p>",
        "id": 153836573,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1467782394
    },
    {
        "content": "<p>no, but my point is that neither, in many/most cases, does the definition. You need the relationships. And so it's wrong to think that making SCT - relationships available in a meaningful way</p>",
        "id": 153836576,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467782938
    },
    {
        "content": "<p>if IHTSDO wants us to use SCT, they need to license the subset of relationships for the terms that they license, or got all the descriptions correct</p>",
        "id": 153836577,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467782980
    },
    {
        "content": "<p>Yes, I agree with you - your two examples illustrate that.  And you're right on the last point - it's a fiction to think that you can really get along without the relationships for the concepts that are \"accessible\", at least given the current state of SNOMED CT.   That state will change and hopefully will improve significantly over time, but it won't be changing substantially enough to resolve this issue any time soon. </p>",
        "id": 153836579,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1467783325
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> I don't agree that we need the relationships to make this valuable. Yes, it would be better but I am baffled as to why you would think making up words here in FHIR is so much better?  As for the \"meaning\" of SCT concepts currently, yes it is the FSN full stop. The relationships, while very useful (when they are not in error) are not a part of the \"official\" meaning. If you want a complex statement that defines the meaning of a SCT concept then we can suggest one as it is my understanding that IHTSDO is considering adding them, and we can keep that in our own terminology service as a code system supplement. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> as for your relapse examples,  yes there is a missing concept \"Patient with relapse\" that we would need to add as a child to 271299001 (Patient codition worsened). That would be similar to concepts like 313386006 (Patient in remission), and 359748005 (Paient codition unchanged) for example. Again I suggest we use SCT and request these concepts be universally available instead of creating more HL7 terminology that the HL7 Board has already said we should not be doing.</p>",
        "id": 153836601,
        "sender_full_name": "Robert McClure",
        "timestamp": 1467820561
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> You are correct that the actual problem you found was an aligned technical issue that we've gone on a tangent about. Yes I agree a \"code\" should not have a Preferred strength. These should be codeableconcept datatype</p>",
        "id": 153836604,
        "sender_full_name": "Robert McClure",
        "timestamp": 1467820843
    }
]