[
    {
        "content": "<p>In the use case of having a registry of available medication products, where should i store/link  the information about other bioequivalent products? I haven't found anything in medication and it's extension.<br>\nAt the moment i would go for a custom extension which adds a List of references to bioequivalent products. <br>\nIs this a good idea? Or have i missed something?</p>",
        "id": 153912344,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1507137712
    },
    {
        "content": "<p>At the moment, that's all there is.  Work is underway on how to represent additional \"knowledge\" about medications, including the relationship of different granularities of medication codes.</p>",
        "id": 153912347,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507138327
    },
    {
        "content": "<p>We could consider a \"bioequivalent cluster\" defined somewhere and link that to the medications in that cluster.</p>",
        "id": 153912367,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507141894
    },
    {
        "content": "<p>medication clusters are many times defined ad-hoc and for given contexts.</p>",
        "id": 153912368,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507141919
    },
    {
        "content": "<p>(sorry, just food for own thought). As Lloyd says, there is no guidance there yet</p>",
        "id": 153912369,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507141977
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> The Pharmacy Work Group is starting a project to look at a new resource that will represent \"knowledge\" or other information about drugs.  This might fit there.  I would suggest that you log a tracker item with your use case and as much detail as you can provide so that we can consider as we look at requirements.  Also if you have other requirements that might fit into this type of a resource , please feel free to log tracker items.  Thanks</p>",
        "id": 153912652,
        "sender_full_name": "Melva Peters",
        "timestamp": 1507218881
    }
]