[
    {
        "content": "<p>I have a need to capture the patient's birth address, however, the address-use value set does not contain the concept birth address as one of its values. Has anyone else had this requirement? If so, how did you resolve it? Thanks.</p>",
        "id": 154025834,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1544894942
    },
    {
        "content": "<p>add an extension to Address</p>",
        "id": 154025836,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544897181
    },
    {
        "content": "<blockquote>\n<p>add an extension to Address</p>\n</blockquote>\n<p>Thanks <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>   That is an option I will consider.  </p>\n<p>Although I am troubled by the use of an extension being such a prominant method of work around for defects or deficencies in the standard. I could add an extension to the address datatype, add a birth address extension to patient, or use a birth address observation with patient as it's subject. I asked what others have done in the hope of reuse instead of reinvention.</p>\n<p>As I think about it now, I think my real question is what is the process by which birth address can added as a value in the address use value set? Doing so would get rid of the need for a work around.</p>",
        "id": 154025838,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1544898294
    },
    {
        "content": "<ul>\n<li>It's not a defect in the standard because you don't agree with a decision the committee made</li>\n<li>it's the first listed extension here: <a href=\"http://hl7.org/fhir/patient-profiles.html\" target=\"_blank\" title=\"http://hl7.org/fhir/patient-profiles.html\">http://hl7.org/fhir/patient-profiles.html</a> (it's not a deficiency in the standard that you haven't read it completely )</li>\n</ul>\n<p>if you think that there's a problem, the order of events is roughly</p>\n<ul>\n<li>ask here</li>\n<li>create a gForge task proposing a change</li>\n<li>follow the committee deliberations which will be tracked in the task / in the announcements</li>\n</ul>",
        "id": 154025839,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544903709
    },
    {
        "content": "<p>I think I get the 80% rule but I don't understand why things like birthPlace, patient-birthtime, etc  are 'standard extensions' (if that isn't an oxymoron) and maintained by HL7?  It's strange to me (and I suppose others new to FHIR) why these are extensions (especially when we had them in V2 and pretty widely used) yet something like 'animal' (whatever that property is used for veterinary) is standard ; sure doesn't seem like that follows the 80% rule.</p>",
        "id": 154025842,
        "sender_full_name": "John Silva",
        "timestamp": 1544906983
    },
    {
        "content": "<p>if you look at hL7 v2, there's a long tail of patient demographic information that is rarely used. The committee surveys across usage to see what is actually widely used. I've never seen birthplace used in v2, for instance. The PA committee continues to be interested in usage, it helps decide what things are part of patient, what are standard extensions, and what are not. </p>\n<p>Animal was included on a different basis, to do with safety, but after very much argument it has been moved to an extension in R4</p>",
        "id": 154025845,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544907604
    },
    {
        "content": "<p>FYI: animal is an extension from R4</p>",
        "id": 154025846,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1544907629
    },
    {
        "content": "<p>The exclusion of data elements that aren't widely used across the spectrum of healthcare isn't a defect/deficiency.  It's a FHIR design feature.  It ensures that the base resources are lightweight and easy to understand and also that it's very clear to implementers which data elements they should expect wide support for (and correspondingly, what they shouldn't necessarily expect support for).  It's one of the things that makes FHIR easy to use and it also drives interoperability by encouraging consistency.  If you don't support a core element in FHIR, it's reasonable to ask the question \"why\" and it's an obvious place to consider adding capability.  On the other hand, if you don't support one of the 100+ \"core\" elements in PID+PD1, there's absolutely no incentive to consider adding it because there's no indication how likely it is for anyone else to do so.</p>\n<p>HL7 defines \"common\" extensions for data elements that aren't used on a sufficiently wide basis to justify their inclusion in the resource, but which are still sufficiently common and consistent across the world that defining a \"standard\" way to do it is useful.  It gives implementers a starting place to look when they face a requirement that they can't find in the immediate resource.  If you can't find something in core <em>or</em> the standard extensions, then asking on <a href=\"http://chat.fhir.org\" target=\"_blank\" title=\"http://chat.fhir.org\">chat.fhir.org</a> is a good strategy because there may be a standard way to do what you want that you've missed/misunderstood.  And if not, it may be that the community will encourage you to submit a change request to add the capability to the specification - likely as a core extension.  On the other hand, if it's not supported and it's esoteric to a particular country or extremely niche area, you still have the ability to convey the data using a custom extension - and have the option of further standardizing its use through an implementation guide that applies to the relevant community.</p>\n<p>In the case of birthPlace, it's really only relevant to systems that are deeply involved with identity management - which is a very small subset of the systems that create and manage Patient instances - thus why it's handled as an extension rather than core.</p>",
        "id": 154025852,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544917506
    },
    {
        "content": "<p>Yeh!! (on animal being removing from 'core' and moved to extension!   That helps for many patient-centric systems that have nothing to do with animal care. Yes, I've heard about the fact that it's not just about the animals but their use in trials and such, but that doesn't seem to fit the 80% rule, if I interpret it right.)</p>\n<p>Yes, of course V2 had 'bloat' -- it was the \"union of every use case\"; I get it.   I guess birthplace is important for MPIs and insurance systems, identity management systems, but not 'every system'.   I also raised the question a while back about birthDate (and time) and was told about the patient-birtdatetime (?) extension.  I guess the question as to how many systems need to know about the time of birth is another one 'in the grey area'; yes, this too could be used in an MPI, for example, in helping to differentiate multiples born on the same date, or in baby care (again with multiples), or in neonatal care where the date and time makes a difference on care treatments (yes, hours are very important to neonates).   Oh well, these decisions have already been made and as an individual, I don't have enough of a justification for \"petitioning\" (via gForce) for considering them for core use.  I suspect many in the \"end user\" (not committee) community do not have the wherewithal or bandwidth to work through when things that they feel are very important to their use case(s) are important (or not) to the community as a whole.</p>",
        "id": 154025854,
        "sender_full_name": "John Silva",
        "timestamp": 1544939161
    },
    {
        "content": "<p>If you're interested about the birth time discussion, I wrote a blog post about it.<br>\n<a href=\"https://brianpos.com/2016/10/19/patient-birth-date-no-time/\" target=\"_blank\" title=\"https://brianpos.com/2016/10/19/patient-birth-date-no-time/\">https://brianpos.com/2016/10/19/patient-birth-date-no-time/</a></p>",
        "id": 154025855,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1544940614
    },
    {
        "content": "<p>The solution for birth-address in v2 was to label one of the many addresses as the birth address, because the PID field called BirthPlace was not intended to be used as the birth address. The same use-case (birth address) is obviously dealt with differently in different standards, so in FHIR it's a separate element. An extension, because those countries using common law don't really care about it, but most other countries do. Because birthPlace doesn't meet the 80% rule, but it is used by multiple countries, HL7 has predefined a standard extension for it. In general you're recommended to serach <a href=\"http://Simplifier.net\" target=\"_blank\" title=\"http://Simplifier.net\">Simplifier.net</a> for extensions (for an X use case), as that may be faster than trying to find it in the standard itself.</p>",
        "id": 154025864,
        "sender_full_name": "René Spronk",
        "timestamp": 1544963957
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>  - thanks for your article, it's good to see some of the discussion behind this.   I'm very familiar with the issues around date/times and timezones, etc.; I've worked on products that have to deal with this; it is very complicated.  (If only Ben Franklin didn't come up with DST! ;-) )    However, having a birthdate only  doesn't always solve the problem. For example, if I need to calculate the hours since birth, how does the system know what time zone that date was recorded in?   Do I then also need to record (somewhere) the birthPlace ( ;-) ) and the time zone and the timezone offset, specifically for that instance (because time zone switches can change over time by local laws.)    One approach is to convert the local date (date/time really) into UTC since that really represents the 'exact instant in time' but now you've lost the 'where this occurred' info.   Not an easy problem and I suppose, people/systems will come up with their own way of handling it.  However, the need for birthDate as date/time values doesn't go away, and to your point, maybe it's not in the 80% of the use cases so it's best left out of the core (and the complications only left to those systems that have to deal with it.)</p>",
        "id": 154025869,
        "sender_full_name": "John Silva",
        "timestamp": 1544969834
    },
    {
        "content": "<p>I see that my use of the term 'defect' may have been a poor choice in words. What I intended to state was that there will come a time when the standard as stated is not able to support a given use case. Perhaps \"deficiency\" would have been a better word choice. I imagine that for any deficiency there will be multiple workaround solutions, including the use of extensions. </p>\n<p>I now understand that the maintenance process for discovery and reconciliation of perceived deficiencies is to begin by noting the observation here on Zulip. One might find that there is an existing solution already within the standard that addresses the perceived deficiency, and that there is no deficiency at all. It is also possible to have the perceived deficiency confirmed as a deficiency in which case the next step would be to open a ticket in gForge to initiate deliberations on the issue which will eventually come to a resolution and may result in a change in the standard to be included in the next release.</p>\n<p>Is my understanding correct?</p>\n<p>It seems to me that many of the questions I have put to Zulip about the use of the standard for a use case for which I have noted a perceived deficiency that the response is a suggestion to create an extension. I know that I am working from a small sample size, but is the use of extensions the more popular (perhaps preferred) way of resolving perceived deficiencies? In other words, is creating an extension more preferred than modifying the standard?</p>",
        "id": 154025872,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1544987510
    },
    {
        "content": "<p>creating an extension is easier, and the extension is retrospectively active. Creating an extension also drives consistency in implementations (or lack of consistency in requirements) and is therefore an excellent data collection tool that feeds into an ongoing discussion of whether a requirement is common enough to drive a change to the actual underlying standard. Which does happen. So rather than thinking of an either/or thing, you should be thinking in terms of overall process</p>",
        "id": 154025874,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544989651
    },
    {
        "content": "<p>Extensions are actually the \"standard\" way for conveying most data elements.  The number of country-specific and edge-case data elements far out-numbers the set of commonly used data elements.  Thus the failure to have most elements in the core specification isn't a deficiency.  It's by design that edge cases will need to use extensions.  The ability to use extensions means that it's pretty much impossible to encounter a situation where FHIR can't express what's needed.  The only challenge is how to ensure that \"edge-case\" data elements are represented consistently across systems that are designed independently.  And that's what HL7 extensions, the HL7 artifact registry, implementation guides and <a href=\"http://chat.fhir.org\" target=\"_blank\" title=\"http://chat.fhir.org\">chat.fhir.org</a> are all intended to help.</p>",
        "id": 154025883,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1545002897
    },
    {
        "content": "<p>... and in thinking about extensions: core extensions have our preference for anything we think is of relevance outside our Dutch scope, so we'll try to get consensus for those before turning to building our own.</p>",
        "id": 154026488,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1545265524
    },
    {
        "content": "<p>Is it safe to assume that the patient birth place extension (<a href=\"http://hl7.org/fhir/extension-patient-birthplace.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-patient-birthplace.html\">http://hl7.org/fhir/extension-patient-birthplace.html</a>)  can only be used for the Patient resource and can't be applied to Patient.contact or RelatedPerson if there was a use case for those locations? I don't see extensions for these locations in R4 (<a href=\"http://hl7.org/fhir/patient-profiles.html\" target=\"_blank\" title=\"http://hl7.org/fhir/patient-profiles.html\">http://hl7.org/fhir/patient-profiles.html</a> and <a href=\"http://hl7.org/fhir/relatedperson-profiles.html\" target=\"_blank\" title=\"http://hl7.org/fhir/relatedperson-profiles.html\">http://hl7.org/fhir/relatedperson-profiles.html</a>) but I'm not confident I know all of the best places to look for extensions. What are the best places to look for existing extensions to use? Thanks.</p>",
        "id": 154935808,
        "sender_full_name": "Craig Newman",
        "timestamp": 1547231246
    },
    {
        "content": "<p>The only context declared for that extension is Patient.  The extensions registry (<a href=\"http://hl7.org/fhir/extensibility-registry.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extensibility-registry.html\">http://hl7.org/fhir/extensibility-registry.html</a>) lists all HL7-defined extensions.  If you've got a good use-case for adding birthplace to those other locations, you can certainly submit a change request.  Why do you need it?</p>",
        "id": 154945307,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547239131
    },
    {
        "content": "<p>I asked because I'm part of the v2-FHIR project and was looking at mapping NK1 to  either Patient.contact or RelatedPerson. One of the NK1 fields is birth place. I've never seen this used, but i figured it would be worth including in the mapping if a FHIR extension existed. As a group, i don't think we've decided if v2 mapping will be targeted to be 100% or just the \"commonly used\" stuff.</p>",
        "id": 154993328,
        "sender_full_name": "Craig Newman",
        "timestamp": 1547315922
    },
    {
        "content": "<p>My leaning is not to create extensions unless we have a clear need for them - there's a whole bunch of stuff in v2 that's either not used anwhere or only used in a super-small number of systems.  By defining an HL7 extension, we're adding a degree of weight that \"sharing this is a good idea and has a good use-case\".  We should only define things if we actually believe that to be true.</p>",
        "id": 154993835,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547316791
    },
    {
        "content": "<p>(My personal opinion - not official policy)</p>",
        "id": 154993838,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547316808
    },
    {
        "content": "<p>Just curious, what is the use case to know the birth place of a contact person?</p>",
        "id": 156623592,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1548179123
    },
    {
        "content": "<p>I don't have a use case, but it's in the v2 NK1 segment (NK1-38) and I ran across it in a v2 to FHIR mapping exercise and was just following through to see if an existing FHIR element existed for it. I don't know what the original v2 motivation was.</p>",
        "id": 156641117,
        "sender_full_name": "Craig Newman",
        "timestamp": 1548192395
    },
    {
        "content": "<p>In quite a few countries the tuple (birth name, birth city, birth date) [as data which doesn't change over time] form the core demographics characteristics of a person. Hence this would be useful on Patient, RelatedPerson (=the closest thing to NK1), Practitioner, etc. But one would probably not use it on Patient.Contact, if one has full identifying details of a contact it should probably be captured as a RelatedPerson, not as Patient.Contact.</p>",
        "id": 156682417,
        "sender_full_name": "René Spronk",
        "timestamp": 1548243829
    },
    {
        "content": "<p>RelatedPerson is someone you expect to <em>do</em> something.  Patient.contact is just that - a contact.  Which you use isn't driven by how much information you have, but rather whether the person is an informer/performer/witness/other function in the patient's healthcare activities.</p>",
        "id": 156698556,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548258033
    },
    {
        "content": "<p>I have a need to capture the birth address of a patient. I notice that there is a birthplace extension defined but wonder if consideration was given to including birth as an address use thereby allowing the patient.address element to be sliced by use. How do I extend the address.use value set to include the concept of birth address?</p>",
        "id": 178548329,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1571494814
    },
    {
        "content": "<p>You can't extend a fixed value set.  Given that there's a standard extension, there isn't a need to either.  It would be surprising to most systems you see a patient's birth address amongst their list of addresses.  (Not all systems will support or expose Address.use)</p>",
        "id": 178549746,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571497084
    }
]