[
    {
        "content": "<p>Hi, can anyone tell me if there is any resource suitable for registering a birth notice, that includes information about the mother, type of birth and of information about the newborn (apgar measurements, body measures, confirmation of vaccinations taken at birth, etc)? Or I should use a set of resources for that, like: DiagnosticReport with a set of Observations for the measurements (and what other resources)? Thank you</p>",
        "id": 153820482,
        "sender_full_name": "Patricia Alves",
        "timestamp": 1460125504
    },
    {
        "content": "<p>You'd definitely want a set of resources - so a profile on Bundle (possibly a FHIR Document, though not necessarily).  If the focus is the birth, that would be Procedure.  Then you'd also link in the various Observations, Immunizations, MedicationAdministrations, etc.</p>",
        "id": 153820524,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460138308
    },
    {
        "content": "<p>Why not use a form = Questionnaire/ QuestionnaireAnswer?  This is an approach that has been suggested by me and others  for vitals records and case reporting as well? </p>",
        "id": 153820540,
        "sender_full_name": "Eric Haas",
        "timestamp": 1460187666
    },
    {
        "content": "<p>Questionnaire can be used as a data capture tool to represent absolutely anything - but the data within it is opaque and pretty non-standard.  I.e. There'd be little chance of an arbitrary third-party being able to do anything computable with the data.</p>",
        "id": 153820554,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460212418
    },
    {
        "content": "<p>In most cases, you'd want to take the data you capture using a Questionnaire (Questionnaires make excellent data capture tools) and convert it to other resources for use in subsequent retrieval/analysis/computation.</p>",
        "id": 153820555,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460212468
    },
    {
        "content": "<p>Why can't the QA be exchanged and used like any other resource.  especially for secondary use like pop health Especially if you develop an IG  ( e.g. US Realm Case report ) and have references to resources as some of the answers.   Im trying  to understand the cons vs a using resource for notice.  </p>",
        "id": 153820563,
        "sender_full_name": "Eric Haas",
        "timestamp": 1460222657
    },
    {
        "content": "<p>Well, if you want to find birth procedures, you'd search on Procedure where the Procedure.code is one of the codes for birth in SNOMED, CPT and other common coding systems.  You could then find the date and time it had occurred, the method, who performed the delivery, etc. in standard places in the Procedure resource.  If you capture the data in Questionnaire, there's no way to query against QuestionnaireResponse to find a birth record unless you know all of the possible Questionnaire ids that might be used to capture birth information.  Furthermore, there'd be no way to know which questions captured the birth method, the birth time or other information without human inspection.  Making use of Questionnaire for data exchange requires a significantly higher degree of pre-negotiation and agreement to get out any kind of data than using the topic-specific resources.  Using Questionnaire as a means of primary data exchange means you're using FHIR as a transport for custom data structures</p>",
        "id": 153820568,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460235240
    },
    {
        "content": "<p>Thanks Lloyd following up with SDC questions on a new stream</p>",
        "id": 153820630,
        "sender_full_name": "Eric Haas",
        "timestamp": 1460356433
    },
    {
        "content": "<p>Thank you for your answer Lloyd, the Procedure makes sense. I shall use a Bundle with a Procedure to introduce information about the mother and the birth, where the Procedure.report references a DiagnosticReport with a set of Observations for the newborn. The pregnancy information can be registered in the Condition resource, being referred by the Procedure.reasonReference.<br>\nWhere can I reference the newborn Immunizations? And where can I put information on the Puerperium? <br>\nAlso, where can I register if the mother fulfilled the pre-natal monitorization ultrasounds and exams (and which)?<br>\nThank you.</p>",
        "id": 153820637,
        "sender_full_name": "Patricia Alves",
        "timestamp": 1460362136
    },
    {
        "content": "<p>Immunizations would be the Immunization resource.  And they're not directly tied to the birth procedure.  If you care about both the care leading up to the birth as well as the care afterwards, you might want to link everything through EpisodeOfCare.  You'd have one episode that would be linked to everything associated with the pregnancy, including all of the visits, observations, etc.  You could choose to algorithmicly filter which ones showed up in your bundle though.  (The ultrasounds would most likely be ImagingStudy and the exams would either be encounters (if you just want to capture occurrence) or Observations or DiagnosticReports (if you want to capture the findings).</p>",
        "id": 153820679,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460389714
    },
    {
        "content": "<p>Thank you very much for your help!<br>\nI leave a suggestion for creating a new resource for registering the newborn information (if it was liveBirth, measurements, apgar results, if the newborn was admitted to Neonatology, etc.), since it is very complex to register all the newborn information using so much resources; and another resource for pregnancy monitoring, for the same reasons.</p>",
        "id": 153821044,
        "sender_full_name": "Patricia Alves",
        "timestamp": 1460455812
    },
    {
        "content": "<p>When you're drawing on a whole bunch of different types of information, you should expect a bunch of resources.  Each of the individual occurrences (each immunization, each observation, etc.) will be - and will need to be - a distinct resource.  Compiling the information into a report/document will involve creating a Bundle of the relevant resources.  We might create a profile that defines the specific set of information to be included.</p>",
        "id": 153821257,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460474540
    },
    {
        "content": "<p>That would be great :)</p>",
        "id": 153821433,
        "sender_full_name": "Patricia Alves",
        "timestamp": 1460544672
    },
    {
        "content": "<p>Another question if you can aswer please. On which resource(s).element can I register the mother's pregnancy data like: pregnancy days, pregnancy weeks, type of pregnancy (if it is simple, or multiple), pregnancy risk, reason of the risk, if was administered immunoglobulin, number of visits to the doctor during pregnancy, list of locations where the pregnant is being followed, name of the family doctor, name of the family nurse</p>",
        "id": 153821440,
        "sender_full_name": "Patricia Alves",
        "timestamp": 1460547836
    },
    {
        "content": "<p>It depends.  You can capture anything and everything as responses to a Questionnaire.  However, that isn't terribly interoperable.  If you want data that's queriable and can easily be used by decision support, then you're looking at using Observation and MedicationAdministration/MedicationStatement and possibly things like RiskAssessment, as well as EpisodeOfCare, CareTeam, etc.  (Note that CareTeam is from STU 3)</p>",
        "id": 153821504,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460560209
    },
    {
        "content": "<p>Yes I understand what you mean, but with the use of all those separate resources I'm getting a Bundle with tens of linked resources just to send information from an hospital to the mother's primary care unit to register a birth. It is becoming such a complex structure that the main purpose of using FHIR messages to make uniform and standardized communications is being sort of  \"contradicted\". </p>",
        "id": 153821510,
        "sender_full_name": "Patricia Alves",
        "timestamp": 1460561016
    },
    {
        "content": "<p>If you want to send something super light-weight and it's not for general purpose interoperability (you don't expect anyone to query based on the data or to be able to access parts of the information for other purposes (e.g. what substances have been administered to the infant, what encounters has the mother had over the past year), then QuestionnaireResponse might be your best bet.  </p>",
        "id": 153821513,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460561208
    },
    {
        "content": "<p>Sorry for this question, but when you say \"to query based on  the data\", you mean to query the information directly on the resources in the message?</p>",
        "id": 153821516,
        "sender_full_name": "Patricia Alves",
        "timestamp": 1460561712
    },
    {
        "content": "<p>Yes.  So for example, if you wanted to be able to query to find birth weight or query to find head diameter across different ultrasounds or something like that.</p>",
        "id": 153821525,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460566140
    },
    {
        "content": "<p>Ah ok, we do not need to query the message then. We just want to send the data. What is your opinion on the use of a fhir document for this (<a href=\"http://www.hl7.org/fhir/documents.html\" target=\"_blank\" title=\"http://www.hl7.org/fhir/documents.html\">http://www.hl7.org/fhir/documents.html</a>)?</p>",
        "id": 153821526,
        "sender_full_name": "Patricia Alves",
        "timestamp": 1460566157
    },
    {
        "content": "<p>A FHIR Document is a special type of Bundle, so that would fall within the first recommendation.  You'd capture the different pieces and then wrap them all up in a document Bundle.</p>",
        "id": 153821529,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460566239
    },
    {
        "content": "<p>I think I'll go with the first recommendation with the bundle document, so that I can keep the data standard. Thank you for your help, it became easier to understand what to do.</p>",
        "id": 153821702,
        "sender_full_name": "Patricia Alves",
        "timestamp": 1460622127
    }
]