[
    {
        "content": "<p>In Patient I can record that the patient was the 2nd of a multiple birth using <code>Patient.multipleBirthInteger</code>. How should I represent that the multiple birth produced 3 children? <br>\nI'm tempted to use an observation with some suitable value for code. (there is a SNOMED CT code for triplet birth, but none for 'multiple birth specify number')<br>\nAny comments?</p>",
        "id": 153900790,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1502162701
    },
    {
        "content": "<p>`Richard  You can also record the patient was 3rd of a multiple birth using  Patient.multipleBirthInteger. Do we need to use a code value for this? I am trying to understand your question</p>",
        "id": 153900796,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1502165155
    },
    {
        "content": "<p>Hi Sunanda.<br>\nI want to say 2nd of 3 children, multipleBirthInteger lets me say '2nd', but does not let me say 'of 3'</p>",
        "id": 153900797,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1502165423
    },
    {
        "content": "<p>`Ah! I get it now. Does it add any value for a patient record to capture 2nd of 3?</p>",
        "id": 153900799,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1502165581
    },
    {
        "content": "<p>we have multiple siblings to a patient but that is not captured anywhere in patient record</p>",
        "id": 153900800,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1502165760
    },
    {
        "content": "<p>I do not know what the value is, but it is part of the AIHW set of birth data.</p>",
        "id": 153900801,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1502165832
    },
    {
        "content": "<p>I think an extension on Patient would be more appropriate for this sort of demographic information</p>",
        "id": 153900802,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502166451
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nAn extension of Patient certainly keeps it close to multipleBirth. Do you know why multipleBirth is not an extension or an observation? I agree that it belongs in Patient for neonates, as multipleBirthInteger might be identifying information, but for everyone else it is just interesting information about their birth.</p>",
        "id": 153901089,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1502261392
    },
    {
        "content": "<p>It can be both... right? It could be recorded in Patient, but also as an Observation.</p>",
        "id": 153901127,
        "sender_full_name": "John Moehrke",
        "timestamp": 1502281415
    },
    {
        "content": "<p>multipleBirthInteger is part of Patient for use in identifying neonates.  Certainly on the mother's record there would probably be Observations capturing number of children for a pregnancy, number of live births, etc.  But that wouldn't generally be on the child's records.</p>",
        "id": 153901345,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502300866
    }
]