[
    {
        "content": "<p>There's some kind of ongoing background discussion about use of FHIR with block chain, or at least block chain magic, or partial block chain or something</p>",
        "id": 153877298,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489631979
    },
    {
        "content": "<p>frankly, some of the ideas I've heard are a little bit wishful thinking. But I've also seen working solutions, particularly in the financial transaction area.</p>",
        "id": 153877299,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489632010
    },
    {
        "content": "<p>is anyone here interested in that? should we set up a blockchain channel?</p>",
        "id": 153877300,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489632032
    },
    {
        "content": "<p>Better to talk than be ignorant</p>",
        "id": 153877301,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489632194
    },
    {
        "content": "<p>The Meteor community has a prototype of a HIPAA audit log based on Ethereum blockchain.  I've got a preliminary sketch of how to upgrade it to use Patient and AuditEvent resources.  So there are maybe a half dozen people from our ecosystem who might occasionally use the channel.  </p>\n<p><a href=\"https://github.com/chafey/ethereum-hipaa-audit-log\" target=\"_blank\" title=\"https://github.com/chafey/ethereum-hipaa-audit-log\">https://github.com/chafey/ethereum-hipaa-audit-log</a></p>",
        "id": 153877326,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1489636821
    },
    {
        "content": "<p>I have colleagues who are big into blockchain, but not (yet) healthcare.  It'd would help me if a channel focussed the discussion (even if small) so I can loop them, in when appropriate</p>",
        "id": 153877417,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1489661490
    },
    {
        "content": "<p>so I created the channel - \"blockchain\"</p>",
        "id": 153877421,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489662059
    },
    {
        "content": "<p>I, for one, am knee deep in several scenarios involving a convergence of certain \"permissioned\" blockchains with FHIR.  Moreover, and more important perhaps, I'm aware of a half dozen or more projects on similar courses. And, at risk of coming off as a boorish newcomer, IMHO, we need to bring these discussions out of the shadows in other places (to get the real FHIR experts perspectives)</p>",
        "id": 153877460,
        "sender_full_name": "Doug Bulleit",
        "timestamp": 1489668713
    }
]