[
    {
        "content": "<p>Hello,</p>\n<p>Actually we're looking how to store transfusion and relative used blood products. For the transfusion we build a related procedure  that contain all needed information, but to store related blood product information is less clear. Actually we can use a Substance or a BiologicallyDerivedProduct. The problem is that the BiologicallyDerivedProduct isn't referenced by any other resource and it is in trial use. I think it is more safe if we store these information with the Substance resource.</p>\n<p>They are someone that can help me to understand which can be the best practice to store blood product information's?</p>",
        "id": 160732126,
        "sender_full_name": "Michele Korell",
        "timestamp": 1552515169
    },
    {
        "content": "<p>BiologicallyDerivedProduct is intended for that purpose, but you're right that relevant resources haven't been updated to point to it.  You could however use an extension.</p>",
        "id": 160732370,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552515393
    },
    {
        "content": "<p>Thanks a lot! </p>\n<p>Yes, it was one of our idea. Actually they are just few months we implementing fhir and one of ur first rule was to not abuse of the extensions. We are at the beginning of fhir interfaces integration for our hospital and we're little afraid to use extension. Now we started to implement an internal implementation guide. This permits us to specify and share the structure with our medical software providers. So i think that you propose to use extension can be a solution.</p>",
        "id": 160734050,
        "sender_full_name": "Michele Korell",
        "timestamp": 1552516704
    },
    {
        "content": "<p>This wouldn't be considered an abuse.  In fact, I  suspect the relationship will be in core in r5</p>",
        "id": 160741441,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552524787
    },
    {
        "content": "<p>Yes, but R5 is not planned at least in a year?</p>",
        "id": 160754415,
        "sender_full_name": "Michele Korell",
        "timestamp": 1552543496
    },
    {
        "content": "<p>Right, but using an extension for something that's likely to be supported in core in a future release is about as far as you can get from abusing extensions :)</p>",
        "id": 160754749,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552543952
    },
    {
        "content": "<p>What's the context of the use case:  EHR, LIS, transfusion donor center, donor testing on products, etc.?  Is this global or US implementation?  AABB (<a href=\"http://www.aabb.org\" target=\"_blank\" title=\"http://www.aabb.org\">www.aabb.org</a>) regulations may apply.  Have you reviewed Specimen DAM?  It does address derived specimens and pooling (as is used for platelets and other BPUs).</p>",
        "id": 167852914,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1560261969
    }
]