[
    {
        "content": "<p>Hello, FHIR experts!<br>\nHL7 v3 has information about Blood, Tissue, Organ: Donation. Choosing between v3 and FHIR, the question is: can this information be represented via FHIR resources anyhow? Do we have something similar in FHIR? Could you point me please to any guides, best practices or examples of mappings in a Blood Bank setting?<br>\nI'd really appreciate a point in the right direction here.</p>",
        "id": 153858250,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1479901127
    },
    {
        "content": "<p>A couple related trackers/discussions I have seen....<br>\n1) PC has a pending <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8458\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8458\">GF#8458</a> asking about blood transfusion, which we resolved indicating a new resource is needed.<br>\n2) OO resolved <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9449\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9449\">GF#9449</a> by adding a donation identification number extension to the device resource, <a href=\"http://build.fhir.org/extension-device-din.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-device-din.html\">http://build.fhir.org/extension-device-din.html</a>, but OO is asking for feedback.  This tracker triggered an interesting listserv discussion,  <a href=\"http://lists.hl7.org/read/messages?id=288144\" target=\"_blank\" title=\"http://lists.hl7.org/read/messages?id=288144\">http://lists.hl7.org/read/messages?id=288144</a>, questioning whether a new resource is needed for biologically derived products (as well as boundaries with device and substance):</p>\n<ul>\n<li>Device: a manufactured item that is used in the provision of healthcare without being substantially changed through that activity. The device may be a medical or non-medical device</li>\n<li>Substance: A homogeneous material with a definite composition</li>\n<li>BiologicallyDerivedProduct: material extracted from a living mammalian organism or that is still living</li>\n</ul>",
        "id": 153858782,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1480377073
    },
    {
        "content": "<p>We are looking for input from subject matter experts on how these products are administratively handled and whether they can be represented using existing resources like Device or Meds or Need there own resource.  </p>",
        "id": 153860188,
        "sender_full_name": "Eric Haas",
        "timestamp": 1480842530
    },
    {
        "content": "<p>are you interested in stock control? </p>",
        "id": 153860215,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480880254
    },
    {
        "content": "<p>We (Be The Match/National Marrow Donor Program) can provide input re hematopoietic stem cell transplant. We've just started looking into how to describe this with FHIR and having questions too.</p>",
        "id": 153861299,
        "sender_full_name": " Bob Milius",
        "timestamp": 1481056047
    },
    {
        "content": "<p>ISBT 128 is the relevant standard in use.<br>\n<a href=\"https://iccbba.org/\" target=\"_blank\" title=\"https://iccbba.org/\">https://iccbba.org/</a></p>\n<p>A CodableConcept should suffice for most ISBT128 tagging, but there are up to 6 barcodes per ISBT label; so it may need to be an array of CodableConcepts.  BodySite may be a relevant resource; as would Device is there is a prosthetic involved.  </p>\n<p>'Biological' seems like a more semantically useful term than 'BiologicallyDerivedProduct'.  ie. Organ, Tissue, Blood, are all Biologicals.   </p>",
        "id": 153862564,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1481242435
    },
    {
        "content": "<p>Our (Be The Match/National Marrow Donor Program) use case is similar to a blood transplant with a few wrinkles. A PATIENT (the recipient) will have a PROCEDURE (hematopoietic cell transplant) performed which uses hematopoietic cells taken from another PATIENT (the donor, there may be multiple donors). I have 2 main questions about this, first what resource should I use for the donor cells? I think SPECIMEN is closest (\"Any material sample taken from a biological entity, living or dead\"), but it is not allowed in the UsedReference of the PROCEDURE resource. MEDICATION is possible, but that has more of a manufactured flavour. SUBSTANCE is off-target as the transplanted cells are certainly not a \"homogeneous material\".</p>\n<p>Additionally, we collect additional HLA typing information from samples other than the recipient, donor, and product, for example relatives of the recipient. We have to capture the relationship between the recipient and the donor (e.g. unrelated, mother, father, HLA-matched sibling, cousin, etc.), as well as the relationship between the recipient and these additional HLA samples. The RELATEDPERSON resource could possibly be used, but that is for a \"person that is related to a patient, but who is not a direct target of care\" and that is certainly not the case for the donor.</p>",
        "id": 153863287,
        "sender_full_name": "Kirt Schaper",
        "timestamp": 1481666467
    },
    {
        "content": "<p>Does your implementation allow for schema extensions?  It would be fairly simple to just extend the Procedure resource to include a Specimen reference.  </p>",
        "id": 153863296,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1481666977
    },
    {
        "content": "<p>I believe we can do that -- do you have an idea about the relationship issue?</p>",
        "id": 153863309,
        "sender_full_name": "Kirt Schaper",
        "timestamp": 1481667808
    },
    {
        "content": "<p>We're working on extended our objects so we can convert between resources.  Not sure 100% how that's going to look like, but it's shaping up to look something like the following:</p>\n<div class=\"codehilite\"><pre>let janeDoe = new Person(&#39;Jane Doe&#39;, &#39;01/22/1973&#39;, &#39;F&#39;);\nlet newPatientA = janeDoe.enrollAsPatient(&#39;BlueCross&#39;, &#39;8219475399&#39;);\nlet newPatientB = Patient.fromPerson(janeDoe);\n</pre></div>\n\n\n<p>So, there's this idea that a person might be a RelatedPerson at one point in time, and a Patient at another.  To that extent, I'm not sure it matters too much which one is chosen... they could both be valid situations.  I'd be more concerned about supporting both.   </p>",
        "id": 153863318,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1481668366
    },
    {
        "content": "<p>That is to say...  RelatedPerson seems perfectly fine to start modeling the solution; as long as you don't bake it in and hardcode it.  It should be able to be swapped out for a Patient when necessary.  </p>",
        "id": 153863319,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1481668458
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192901\">@Kirt Schaper</span>  Specimen is for diagnostic specimens.   You are left with Device and/or Medication/ and or Substance plus extensions.   We believe there is a gap in FHIR Resources here but no-one from the community has stepped forward to fill in the blanks on what the most common elements would be.  ( or pointed to a reasonable data model that we could reference )</p>",
        "id": 153863456,
        "sender_full_name": "Eric Haas",
        "timestamp": 1481741774
    },
    {
        "content": "<p>The ISBT 128 standard that's used for organ transplants and blood samples would look something like this in JSON/FHIR format:</p>\n<div class=\"codehilite\"><pre>{\n  &quot;resourceType&quot; :  &quot;ProductOfHumanOrigin&quot;,\n  &quot;catalogNumber&quot; : { String },\n  &quot;containerLotNumber&quot; : { String },\n  &quot;donationIdentificationNumber&quot; : { Identifier },\n  &quot;bloodGroup&quot; : { Code },\n  &quot;productCode&quot; : { CodeableConcept },\n  &quot;expirationDate&quot; : { Date },\n  &quot;collectionDate&quot; : { Date },\n  &quot;specialTesting&quot; : { CodeableConcept }\n}\n</pre></div>\n\n\n<p>The <code>productCode</code> is an anatomical dictionary managed by ICCBBA, similar to SNOMED-CT.</p>",
        "id": 153863513,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1481759050
    },
    {
        "content": "<p>that is a great start.  next steps include getting approvals by the OO workgroup and FMG.  is anybody interested in writing up a <a href=\"http://wiki.hl7.org/index.php?title=Template:FHIR_Resource_Proposal\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Template:FHIR_Resource_Proposal\">resource proposal</a>?  </p>",
        "id": 153863521,
        "sender_full_name": "Eric Haas",
        "timestamp": 1481761935
    },
    {
        "content": "<p>is single blood group and single donor sufficient? </p>",
        "id": 153863524,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481762070
    },
    {
        "content": "<p>don't we use pooled things like antibodies</p>",
        "id": 153863525,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481762082
    },
    {
        "content": "<p>and it's not clear whether this is definition or instance either</p>",
        "id": 153863526,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481762101
    },
    {
        "content": "<p>Hard to think of how there would be multiple blood groups or donors without resorting to scifi scenarios.  </p>",
        "id": 153863529,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1481762654
    },
    {
        "content": "<p>Actually, bone marrow recipients will change blood type to the donor type, which can take weeks or months.  So there's a small use case where there could be more than one type.  </p>",
        "id": 153863530,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1481762807
    },
    {
        "content": "<p>bone marrow recipients are donors of something?</p>",
        "id": 153863531,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481763147
    },
    {
        "content": "<p>\"Immunoglobulin products are purified from pooled plasma of many healthy blood donors\" - multiple donors are the normal case here</p>",
        "id": 153863532,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481763191
    },
    {
        "content": "<p>Bone marrow transplants during chemotherapy.   They take the bone marrow from one patient, give it to another.  The recipient will become the blood type of the donor, because the bone marrow has stem cells in it that generate blood itself.   They try to match blood types if possible so the patient doesn't have to go through a type conversion, but sometimes they take what they can get.  Stem cell transplants do all sorts of odd things to people.  They can cause eye color change, blood type change, reset immune responses, clear up allergies, etc.</p>",
        "id": 153863533,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1481763223
    },
    {
        "content": "<p>oh I know that, but wouldn't recipients of bone marrow transplants not be donors themselves?</p>",
        "id": 153863534,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481763640
    },
    {
        "content": "<p>Wouldn't think so.  Didn't mean to imply that was the case.  </p>",
        "id": 153863535,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1481763678
    },
    {
        "content": "<p>re definitions and instance - probably both.</p>",
        "id": 153863549,
        "sender_full_name": "Eric Haas",
        "timestamp": 1481768431
    },
    {
        "content": "<p>I think Device is best suited to be extended to handle Products of Human (and other) Origin, most of the elements are already there as is the UDI.</p>",
        "id": 153863569,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1481780313
    },
    {
        "content": "<p>It's nuts to consider that a product of human origin is a 'device' - there's no sense in that statement. </p>",
        "id": 153863570,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481780362
    },
    {
        "content": "<p>nor does the fact that \"UDI\" is wrongly used make it right</p>",
        "id": 153863572,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481780384
    },
    {
        "content": "<p>It is an information model, if you want copy it, rename it and then feel better. And they have UDIs so don't throw that element out.</p>",
        "id": 153863583,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1481781099
    },
    {
        "content": "<p>lol. or we could rename 'Device' to 'Thing'</p>",
        "id": 153863584,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481781141
    },
    {
        "content": "<p>or even better: \"Entity\"</p>",
        "id": 153863585,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481781182
    },
    {
        "content": "<p>Sure and remove the elements except for Id and people can extend at will.</p>",
        "id": 153863601,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1481782071
    },
    {
        "content": "<p>A couple of notes. BMT transplants can be autologous (receiving your own cells after chemotherapy and/or radiation) or allogeneic (receiving cells from another individual). Allogeneic transplants can entail multiple products from the same person (e.g. peripheral blood stem cells [PBSC] and bone marrow). They can also entail multiple products from different people (or more precisely sources), for example using multiple cord blood units. Finally, there can be a multitude of additional cellular products infused during the entire episode of care, additional blood products from the original donor, manufactured products from the same donor or other sources, etc. This is a rapidly growing field and the list of cellular products being considered/explored is rapidly growing and sometimes comes with proprietary baggage (i.e. intellectual property rights).</p>",
        "id": 153863626,
        "sender_full_name": "Kirt Schaper",
        "timestamp": 1481812881
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"grahame@healthintersections.com.au\">@Grahame Grieve</span> If your heart valve is faulty it can be replacced with: one from another human (transplant); one grown from your cells (future maybe); one from another species (eg. pig); or a manufactured one - possible other options in the future. You can choose to use one resource for all with an element for the source plus one or more for typification, or more than one resource - but I suggest more than two resources in total will be wastefull and confusing.</p>",
        "id": 153865186,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1483341532
    },
    {
        "content": "<p>We at NMDP and CIBTMR would like to participate in helping develop a new resource for transplant material (bone marrow, peripheral blood stem cells, etc). Both <span class=\"user-mention\" data-user-id=\"192901\">@Kirt Schaper</span> and myself can help. Let us know whom to contact.</p>",
        "id": 153880095,
        "sender_full_name": " Bob Milius",
        "timestamp": 1490719143
    },
    {
        "content": "<p>This could also be used for blood transfusions, solid organ transplants, etc.</p>",
        "id": 153880112,
        "sender_full_name": "Kirt Schaper",
        "timestamp": 1490721953
    },
    {
        "content": "<p>All starts with a PSS, an interested WG, and creating a new resource proposal.  Would start by seeing if Pharmacy is interested</p>",
        "id": 153880114,
        "sender_full_name": "Eric Haas",
        "timestamp": 1490722122
    },
    {
        "content": "<p>pardon the HL7 speak</p>",
        "id": 153880116,
        "sender_full_name": "Eric Haas",
        "timestamp": 1490722142
    },
    {
        "content": "<p>I'd also mention Patient Care work group.  We had <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8458\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8458\">GF#8458</a> logged about blood transfusion, which we concluded that we'd prefer having a new resource instead of trying to leverage Procedure.  We didn't have capacity at the time to develop the new resource, so we asked the submitter to start drafting the resource, but I don't recall ever seeing a draft of what he wanted.  In any case, I think Patient Care would be interested.</p>",
        "id": 153880132,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1490723560
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> , I just sent an email to the Patient Care co-chair about this</p>",
        "id": 153880137,
        "sender_full_name": " Bob Milius",
        "timestamp": 1490723808
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span> Is the intention to scope this resource to Medical Products of Human Origin?</p>",
        "id": 153880223,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1490773686
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> I don't think it would have to be human, as long as the source is identified. Our use case is human stem cells from bone marrow, cord blood, or peripheral blood. But the resource should be broad enough for things like cultured cells,  pig heart valve, or for use in veterinary medicine. We're thinking of calling it BiologicallyDerivedProduct or perhaps simply Graft.</p>",
        "id": 153880278,
        "sender_full_name": " Bob Milius",
        "timestamp": 1490804402
    },
    {
        "content": "<p>Implanting an item that is a scaffold laced with cultured tissue will test the boundary between implants and transplants.</p>",
        "id": 153880346,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1490835841
    },
    {
        "content": "<p>FWIW ... Present FDA rules related to biologics fall under a category labeled as *Vaccines, Blood &amp; Biologics*, and are organized into product areas:  general, blood, tissue, and vaccine.</p>\n<p><a href=\"https://www.fda.gov/BiologicsBloodVaccines/\" target=\"_blank\" title=\"https://www.fda.gov/BiologicsBloodVaccines/\">https://www.fda.gov/BiologicsBloodVaccines/</a><br>\n<a href=\"https://www.fda.gov/BiologicsBloodVaccines/GuidanceComplianceRegulatoryInformation/ActsRulesRegulations/\" target=\"_blank\" title=\"https://www.fda.gov/BiologicsBloodVaccines/GuidanceComplianceRegulatoryInformation/ActsRulesRegulations/\">https://www.fda.gov/BiologicsBloodVaccines/GuidanceComplianceRegulatoryInformation/ActsRulesRegulations/</a></p>\n<p>The *Vaccines, Blood &amp; Biologics* category includes Allergenics, Blood &amp; Blood Products, Cellular &amp; Gene Therapy Products, Tissue &amp; Tissue Products, Vaccines, and Xenotransplantation.</p>\n<p>Per the FDA, it's possible for a human cell, tissue, or cellular or tissue-based product (HCT/P) to be regulated as a device, or not.  Investigational New Drug (IND), Device Exemption (IDE) and/or other exemptions and licensing conditions may also apply.</p>\n<p>Other countries may have a framework for biologics similar to that of the FDA.</p>",
        "id": 153880632,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1490991775
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span> Right, so this would cover MPHO and non-human origin, thanks.</p>",
        "id": 153880955,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1491383049
    },
    {
        "content": "<p>Regarding the BMT use case and the Specimen resource ...</p>\n<p>Sitting in on an O&amp;O session at the Madrid HL7 WGM just now, I inquired about whether it would be ok to use the Specimen FHIR resource to represent a marrow or PBSC donation (blood stem cell product), considering that the Specimen FHIR resource is currently described only as “A sample to be used for analysis.”</p>\n<p>Their responses included a suggestion that we could define a Specimen extension to represent our blood stem cell products, and indicated there is not a purposeful prohibition against using the Specimen resource to represent biological products such as those.</p>\n<p>Additionally, it was mentioned the Specimen resource hasn’t really been touched since DSTU1, and was hurriedly assembled at that time.  They are thinking about splitting it into two resources in the future, one for the specimen itself, and one for the collection method, and also said now would be a good time to offer comments on it.</p>\n<p>So, it appears the O&amp;O group has no objection to usage of the FHIR Specimen resource (with extension) to represent a blood stem cell product.  Based on the discussion today, I think defining a Specimen extension for blood stem cell products would be preferable to creating a new resource for that purpose.</p>",
        "id": 153888642,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1494327717
    },
    {
        "content": "<p>Followup:  Further discussion with and among O&amp;O people indicates usage of the Specimen resource to represent a biological product (as for the BMT use case) is prohibited.</p>\n<p>An effort by the Patient Care workgroup to define a new resource for this purpose is underway.</p>\n<p>In the meantime, the suggested approach is to create an extension for the Device resource, possibly adding copies of most or all of the fields from Specimen to the extended Device.</p>",
        "id": 153889113,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1494432635
    },
    {
        "content": "<p>Wed Q3 (Sept 13) will be a joint Patient Care, Pharmacy, and OO discussion about blood transfusions.  We welcome implementers to attend with their requirements, use cases, etc. </p>\n<p>We had a preliminary joint discussion last week (minutes: <a href=\"http://wiki.hl7.org/index.php?title=2017-08-10_Patient_Care_FHIR_Call\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=2017-08-10_Patient_Care_FHIR_Call\">http://wiki.hl7.org/index.php?title=2017-08-10_Patient_Care_FHIR_Call</a>).</p>\n<p>For inquiring minds, the full Patient Care WGM agenda is available: <a href=\"http://wiki.hl7.org/index.php?title=PC_Sept_2017_WGM\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=PC_Sept_2017_WGM\">http://wiki.hl7.org/index.php?title=PC_Sept_2017_WGM</a></p>",
        "id": 153902529,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1502811839
    },
    {
        "content": "<p>I'm working on the resource proposal draft for BiologicallyDerivedProduct and need help with the RIM scope, specifically the formal RIM mappings. Can someone direct me to a reference list of RIM concepts for this mapping?</p>",
        "id": 153905826,
        "sender_full_name": "Kirt Schaper",
        "timestamp": 1505062137
    },
    {
        "content": "<p>Happy news:  I just signed a contract with a major University and we have some grant funding to work on Organ Donations and other Advanced Directives.  More on this as we iron out the details this month, but I may be able to devote a fair bit of time to this over the upcoming year.</p>",
        "id": 153922965,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1512482067
    },
    {
        "content": "<p>great. you're coming to New Orleans, yes?</p>",
        "id": 153923060,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512509922
    },
    {
        "content": "<p>Yes!  That's the plan!  Wish I could have made it to FHIR DevDays, but it just wasn't in the cards.</p>",
        "id": 153923089,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1512525316
    },
    {
        "content": "<p>great</p>",
        "id": 153923252,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512592155
    }
]