[
    {
        "content": "<p>New proposal for January connectathon / R4:</p>",
        "id": 153909151,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505871950
    },
    {
        "content": "<p><a href=\"http://www.healthintersections.com.au/?p=2689\" target=\"_blank\" title=\"http://www.healthintersections.com.au/?p=2689\">http://www.healthintersections.com.au/?p=2689</a></p>",
        "id": 153909152,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505871950
    },
    {
        "content": "<p>Comments welcome</p>",
        "id": 153909153,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505872260
    },
    {
        "content": "<p>Makes me think of our <a href=\"https://syntheticmass.mitre.org\" target=\"_blank\" title=\"https://syntheticmass.mitre.org\">https://syntheticmass.mitre.org</a> server.</p>\n<p>We have over 1 million synthetic patients available using FHIR STU3. Scaling that large was a challenge. People often ask for the whole dataset (22 GB), so we give them a download link to a zip file.</p>\n<p>Large complex queries are difficult to handle with performance. Often times, people are searching for a cohort. They run a search, and page through the results (many many pages).</p>\n<p>Should bulk data access support a query, or does that just complicate matters? My instinct says to avoid query support to keep matters simple, but it would help limit very large files. How long are those files supposed to persist for?</p>",
        "id": 153909331,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1505917516
    },
    {
        "content": "<p>One minor point about filesize is: the server can split data into as many chunks as it wants. Doesn't change the total size of the data, but individual <em>files</em> aren't necessarily big.</p>",
        "id": 153909332,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1505917812
    },
    {
        "content": "<p>Based on the requests for data I've received, nearly all would have benefitted from query based scoping.  Very few want or can handle a whole system dump, and the limiting criteria are often more complex than simply a list of patients (although that is common).</p>",
        "id": 153909336,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1505918266
    },
    {
        "content": "<p>On the nd-json format - I'd assume it would be preferable to always compress these files (gzip?). I don't think <code>application/fhir+ndjson+zip</code> is legal?</p>",
        "id": 153909344,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1505919472
    },
    {
        "content": "<p>Just use http/2 and you get compression free...</p>",
        "id": 153909354,
        "sender_full_name": "John Moehrke",
        "timestamp": 1505922972
    },
    {
        "content": "<p>...not completely on topic, but considering than of the 11 original Argonaut organizations only two or three actually implemented it so far, wouldn't be better to still focus on that at the connectathon, instead of adding an entire new protocol?</p>",
        "id": 153909407,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1505937019
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191381\">@Jason Walonoski</span> I think it makes a great deal of sense to support this on your server, and to support this for search (\"query\"). I've supported this for search and that was my primary test case. really big searches can get really long</p>",
        "id": 153909537,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505949813
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> indeed, that was my first take on this too. But ONC asked us to take this on. We don't set priorities for the argonaut project - they do, under, ahh, advice, from the ONC and the market. It will be up to the market and ONC to influence the priorities of the vendors...</p>",
        "id": 153909538,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505949919
    },
    {
        "content": "<p>Got it, thanks Grahame</p>",
        "id": 153909543,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1505950319
    },
    {
        "content": "<p>Well, supporting bulk data access is something I'm willing to explore starting in... maybe October.</p>",
        "id": 153909728,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1506001657
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  The Security WG looked at the Bulk Data Access proposal, and we have some Privacy and Security \"Considerations\". We recognize that you are simply trying to address a technical need for a solution to Bulk Data Access, and you have been careful to indicate that you have not addressed Security. We would agree with the modularity of focusing on the access method without conflating Security/Privacy; but we also want to make sure that this Bulk Data Access has a Privacy and Security Considerations so that use of the method DOES consider these issues.  The Security WG minutes contain these 'issues', we stayed away from declaring 'solutions' although we do think there are ready accessible solutions. We would like to be included on development to help address these issues. See <a href=\"http://wiki.hl7.org/index.php?title=October_3,_2017_Security_Conference_Call#Bulk_Data_Transfer_Access_Control_.26_AuthorizationQuestions\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=October_3,_2017_Security_Conference_Call#Bulk_Data_Transfer_Access_Control_.26_AuthorizationQuestions\">http://wiki.hl7.org/index.php?title=October_3,_2017_Security_Conference_Call#Bulk_Data_Transfer_Access_Control_.26_AuthorizationQuestions</a>:</p>",
        "id": 153912253,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507121987
    },
    {
        "content": "<p>Generally we are not clear what kind of use-case would allow this level of access, especially with a PERMIT without exceptions. Given that we expect many exceptions, we are concerned that a mechanism is needed to recognize the exceptions and obligations. Second we would like to assure that audit logging be specified in a way that is actionable but not unnecessarly verbose.</p>",
        "id": 153912255,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507122605
    },
    {
        "content": "<p>There was also discussion and support for a companion method for service to de-identify, such as I outline on my blog <a href=\"https://healthcaresecprivacy.blogspot.com/2017/09/fhir-and-bulk-de-identification.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2017/09/fhir-and-bulk-de-identification.html\">https://healthcaresecprivacy.blogspot.com/2017/09/fhir-and-bulk-de-identification.html</a></p>",
        "id": 153912256,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507122654
    },
    {
        "content": "<p>in general, I expect that the API itself will be use for a variety of purposes of use</p>",
        "id": 153912383,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507147025
    },
    {
        "content": "<p>in general, for all the uses, there will be consent/authorization/access control issues.</p>",
        "id": 153912385,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507147053
    },
    {
        "content": "<p>as yet, we have had no requests for anything related to these to appear on the API itself.</p>",
        "id": 153912386,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507147078
    },
    {
        "content": "<p>we did refer a number of policy issues back to ONC for clarification - these are US specific things</p>",
        "id": 153912387,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507147097
    },
    {
        "content": "<p>I agree that there's a place for de-identification in the service, but as yet this is not required or asked for</p>",
        "id": 153912388,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507147130
    },
    {
        "content": "<p>finally, audit logging is a policy question. We do't anywhere specify that audit logging is required, and nor should we in the base specification</p>",
        "id": 153912390,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507147177
    },
    {
        "content": "<p>I agree that many of these issues are not the issues we would address in a core specification. But we can put them in a \"Security/Privacy Considerations\" section so that those that are using the core capability are informed of some of the 'considerations' . This is minimally all we ask. This is what IETF, W3C, ISO, IHE, and DICOM are doing today. This is what our Security Risk Assessment Cookbook intended to drive to happen.</p>",
        "id": 153913411,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507728892
    },
    {
        "content": "<p>do you think this is different to any other access that FHIR permits?</p>",
        "id": 153913444,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507736647
    },
    {
        "content": "<p>Yes, for the above reasons...</p>",
        "id": 153913445,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507736833
    },
    {
        "content": "<p>The use-cases that SMART focused on were targeting either Treatment (this patient, or any patient I have access to), or accesses by the Patient themselves. These are the use-case focus that has driven the development of the scope patterns today.</p>",
        "id": 153913447,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507736909
    },
    {
        "content": "<p>Basically, the 'risk' -- 'impact' for bulk data access is 'everyone'; where a Provider or Patient access is more clearly one-patient-at-a-time.</p>",
        "id": 153913453,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507737060
    },
    {
        "content": "<p>so this is actually an issue with SMART, not the FHIR API. Because the FHIR API itself has never been one patient or provider at at time</p>",
        "id": 153913590,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507805535
    },
    {
        "content": "<p>Fine, but YOU pointed at SMART as the solution for security.. therefore you introduced it as a problem with your bulk data access proposal.</p>",
        "id": 153913615,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507813621
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , since the Sept HL7 meeting, we've continued to look at this proposed specification and wanted to help by sharing some practical challenges to bring this API to scale.</p>",
        "id": 153914865,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1508427082
    },
    {
        "content": "<ul>\n<li>Performance: Use of the API mustn't impact patient care. Practically, this could mean throttling the bulk query or running it against a replica or other non-operational database such that the API might not return real-time data.  This might not have any functional impact, but it's an important expectation to set.</li>\n</ul>",
        "id": 153914866,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1508427133
    },
    {
        "content": "<ul>\n<li>Reciprocity: Towards our goal of improving patient care, this API should be reciprocal. A health system should be able to both query and be queried for bulk data.</li>\n</ul>",
        "id": 153914867,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1508427152
    },
    {
        "content": "<ul>\n<li>Patient consent: The spec doesn't currently address the exchange of patient consent. (<span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> made this point as well). For similar integrations, health systems re-use or define their own authorization form, which is signed by the patient and provided as part of the query for clinical information. If authorization is determined to be incomplete or not automatically verifiable, it's examined by an actual person before clinical information is released. By not addressing consent within the specification, the ability to quickly implement and scale the API is diminished.</li>\n</ul>",
        "id": 153914868,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1508427227
    },
    {
        "content": "<ul>\n<li>The time based filtering could be really hard to implement accurately. FHIR isn't a native database format in either operational or reporting production databases. Determining the current time of $everything accurately is prohibitively expensive. Perhaps specific existing search criteria on the \"focus\" resources would both give the spec the flexibility you want and be more implementable?</li>\n</ul>",
        "id": 153914869,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1508427254
    },
    {
        "content": "<p>Further, as the data passes out of the organization's protection, so should the liability for data loss.</p>",
        "id": 153914870,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1508427263
    },
    {
        "content": "<p>what do you think we should do about patient consent? I would like to address consent but any attempt to do so de-generates into a free for all that never resolves. Anyway, in this case, the use case doesn't involve consent because there is BAA agreements - at least, that's how I understand it</p>",
        "id": 153915241,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508703516
    },
    {
        "content": "<p>I don't understand the point you are making in regards to time. The time service that we look to support is timestamp on the source records. That's got nothing to do with FHIR as a native database format or not. Why is making use of that prohibitively expensive?</p>",
        "id": 153915242,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508703586
    },
    {
        "content": "<p>agree about the liability for data loss, but.... so?</p>",
        "id": 153915243,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508703601
    },
    {
        "content": "<p>Further to this, <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> please see the connectathon proposal at <a href=\"http://wiki.hl7.org/index.php?title=201801_Bulk_Data\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201801_Bulk_Data\">http://wiki.hl7.org/index.php?title=201801_Bulk_Data</a></p>",
        "id": 153915254,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508712612
    },
    {
        "content": "<p>note that I signed you both up ;-)</p>",
        "id": 153915258,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508714093
    },
    {
        "content": "<p>Grahame, I think that we should not address Access Control at all. In the core definition of the bulk data access 'methodology'. We can describe the security and privacy concerns.     If you have specific policy, we could write that in an IG that expresses the policy that eliminates the need for consent checking.  There could be a set of these policy specific IGs. These might be very light weight IGs.  I would however stay away from declaring this kind of thing in the core specification where bulk data access methodology is defined.</p>",
        "id": 153915819,
        "sender_full_name": "John Moehrke",
        "timestamp": 1508890262
    },
    {
        "content": "<p>I think we should define the AuditEvent. Likely one AuditEvent for each patient that was accessed, with the query parameters. I say one for each patient as this makes mining the AuditEvent easier.</p>",
        "id": 153915820,
        "sender_full_name": "John Moehrke",
        "timestamp": 1508890388
    },
    {
        "content": "<p>that's what I think, and why the API as described doesn't address it. Maybe you're an internal application that has the right to complete access subject to access control, for instance. Else the consent process might be 'everyone in the group is who has consented'. But OTOH, maybe it will help EHR companies implement this in some cases if we can sort out access control. For instance, maybe we need to specifically document purpose of use on the request?</p>",
        "id": 153915822,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508890566
    },
    {
        "content": "<p>as for audit event, I'll generate an audit event for the operation whatever, though I don't currently generate an audit entry per... patient?.... and it would be a good idea</p>",
        "id": 153915824,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508890627
    },
    {
        "content": "<p>Yup, that is why I mentioned it. I expected one auditEvent for the whole transaction is natural, and good to do too...</p>",
        "id": 153915825,
        "sender_full_name": "John Moehrke",
        "timestamp": 1508890677
    },
    {
        "content": "<p>Doesn't SMART include the PoU? If it does, then it is possible for the request to come in with a PoU like \"PUBHLTH\" when it is a government purpose for some pubic health investigation, which clearly the user and system must also be authorized... But some PoU like this, would be exempt from Consent in the USA due to 'required government reporting' (I am not a lawyer... but know there are some PoU that do fall along these lines). --- This is what I am thinking is in an IG. Possibly a 1 page IG. But something that is use-case specific, and thus policy is already known.</p>",
        "id": 153915826,
        "sender_full_name": "John Moehrke",
        "timestamp": 1508890937
    },
    {
        "content": "<p>where does smart in the PoU? I don't know of a place</p>",
        "id": 153915827,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508891419
    },
    {
        "content": "<p>unless it's entirely out of band</p>",
        "id": 153915828,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508891427
    },
    {
        "content": "<p>drat... you are right. Smart today doesn't have PoU... but I know I put in a ballot comment on that...</p>",
        "id": 153916017,
        "sender_full_name": "John Moehrke",
        "timestamp": 1508941695
    },
    {
        "content": "<p>Our server is similar to Grahame's: we audit what we feel is necessary/required and probably wouldn't \"trust\" an AuditEvent from an external source as \"truth\" (we may eventually use it to add more context to audits, when it's something only the application calling us will have)</p>",
        "id": 153916040,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508952421
    },
    {
        "content": "<p>when I say \"trust\" - if the incoming audit event said a different application or user was accessing it than what was actually authorized/is tied to the auth context, we wouldn't replace those fields with supplied data :)</p>",
        "id": 153916041,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1508952503
    },
    {
        "content": "<p>Quick plug for the <a href=\"http://wiki.hl7.org/index.php?title=201801_Bulk_Data\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201801_Bulk_Data\">FHIR API for Bulk Data Export Connectathon Track</a>!</p>\n<p>Do you yearn to share huge piles of data using FHIR, providing or consuming FHIR resources for things like assessing the value of the care provided, conducting population analyses, identifying at-risk populations, and tracking progress on quality improvement? We're piloting a FHIR API for Bulk Data Export at January's Connectathon in New Orleans.</p>",
        "id": 153918653,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1510265593
    },
    {
        "content": "<p>I <em>yearn</em> for that, yes</p>",
        "id": 153918658,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510265890
    },
    {
        "content": "<p>:p I guess I deserve that.</p>",
        "id": 153918661,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1510266593
    },
    {
        "content": "<p>Looking at your server's implementation, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I'm seeing three things that surprise me (and I think <span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> shared my interpretation):</p>\n<p>1. The final resulting <code>.ndjson</code> files cover only 49 entries, rather than the full set. Is this a bug?<br>\n2. When I call <code>/Patient/$everything</code> I was expecting to generate .ndjson files pertaining to various resource types -- but I just get a  <code>Patient.ndjson</code> file, and no <code>Observation.ndjson</code>, etc. In other words, I thought  <code>/Patient/$everything</code>  was synonymous with <code>/Group/everybody/$everything</code> (if <code>everybody</code> happens to be the id of a group containing all patients), and would return files representing the whole common clinical data set. Did I interpret this differently from you?<br>\n3. When I try to retrieve the status of an export, the request fails (<code>500</code>) if I leave off an <code>Accept</code> header (and indeed, if I provide anything other than <code>Accept: application/fhir+ndjson</code>). But this request expects a status response with no body, so an absent Accept header should be A-OK.</p>",
        "id": 153920113,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1510871180
    },
    {
        "content": "<p>For anyone following  along, I'm doing:</p>\n<div class=\"codehilite\"><pre><span></span>$ curl -v -H <span class=\"s2\">&quot;Accept: application/fhir+ndjson&quot;</span> -H <span class=\"s2\">&quot;Prefer: respond-async&quot;</span> <span class=\"s2\">&quot;http://test.fhir.org/r3/Patient/</span><span class=\"nv\">$everything</span><span class=\"s2\">&quot;</span> <span class=\"m\">2</span>&gt;<span class=\"p\">&amp;</span><span class=\"m\">1</span> <span class=\"p\">|</span> grep -i content-location:\n&lt; Content-Location: http://test.fhir.org/r3/task/4a1f26d6-4948-4647-8f7c-c6849a252950\n$ curl -v -H <span class=\"s2\">&quot;Accept: application/fhir+ndjson&quot;</span> <span class=\"s2\">&quot;http://test.fhir.org/r3/task/4a1f26d6-4948-4647-8f7c-c6849a252950&quot;</span> <span class=\"m\">2</span>&gt;<span class=\"p\">&amp;</span><span class=\"m\">1</span> <span class=\"p\">|</span> grep -i Link:\n&lt; Link: &lt;http://test.fhir.org/r3/task/4a1f26d6-4948-4647-8f7c-c6849a252950/Bundle.ndjson&gt;<span class=\"p\">;</span><span class=\"nv\">rel</span><span class=\"o\">=</span>item, &lt;http://test.fhir.org/r3/task/4a1f26d6-4948-4647-8f7c-c6849a252950/Patient.ndjson&gt;<span class=\"p\">;</span><span class=\"nv\">rel</span><span class=\"o\">=</span>item, &lt;http://test.fhir.org/r3/task/4a1f26d6-4948-4647-8f7c-c6849a252950.zip&gt;<span class=\"p\">;</span><span class=\"nv\">rel</span><span class=\"o\">=</span>collection\n$ curl -s <span class=\"s2\">&quot;http://test.fhir.org/r3/task/4a1f26d6-4948-4647-8f7c-c6849a252950/Patient.ndjson&quot;</span> -o Patient.ndjson\n$ wc -l Patient.ndjson\n<span class=\"m\">49</span> Patient.ndjson\n</pre></div>",
        "id": 153920117,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1510871391
    },
    {
        "content": "<p>with regard to #3 - it didn't occur to me to check for no Accept header.</p>",
        "id": 153920128,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510891285
    },
    {
        "content": "<p>#2 your interpretation is correct, I just had a bug. Should be fixed shortly</p>",
        "id": 153920129,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510895220
    },
    {
        "content": "<p>I'm not sure what you mean by #1.</p>",
        "id": 153920130,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510895220
    },
    {
        "content": "<p>Number one was the easy one, I hope. I expected to see &gt; 1000 patients and instead I only have 49 (just one Patient fille output generated, and it had only 49 lines).</p>",
        "id": 153920132,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1510902215
    },
    {
        "content": "<p>Number 3, fair enough-- do you agree that it should work without an except header?</p>",
        "id": 153920133,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1510902268
    },
    {
        "content": "<p>yes it will shortly</p>",
        "id": 153920140,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510908522
    },
    {
        "content": "<p>ok updated</p>",
        "id": 153920146,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510910165
    },
    {
        "content": "<p>number 1... it's clear that I'm not populating an internal field properly. I should be generating somewhere near 80000 resources for that query, but I'm only returning about 1500. It's something that I'm not populating when I write the resources into the store., and I'll look at tonight. So for now, you're getting more data, but for from the proper set of data</p>",
        "id": 153920147,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510910249
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> , this should be all good now</p>",
        "id": 153921259,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511433726
    },
    {
        "content": "<p>I 'm just doing a little housekeeping and wanted to add this link here:  <a href=\"https://docs.google.com/document/d/1Ps9OJVixnGO8qgLhxkprpZrH4icmBJC7-VAXLoOYd1U\" target=\"_blank\" title=\"https://docs.google.com/document/d/1Ps9OJVixnGO8qgLhxkprpZrH4icmBJC7-VAXLoOYd1U\">https://docs.google.com/document/d/1Ps9OJVixnGO8qgLhxkprpZrH4icmBJC7-VAXLoOYd1U</a></p>",
        "id": 153952513,
        "sender_full_name": "Alan Viars",
        "timestamp": 1523884528
    }
]