[
    {
        "content": "<p>If I am using a bundle for a transaction does the endpoint need to be /Bundle or can it be anything?  It would be easier for us to manage multiple endpoints for different types of transactions.</p>",
        "id": 176956641,
        "sender_full_name": "Jeremy Chapman",
        "timestamp": 1569866313
    },
    {
        "content": "<p>For a transaction the end point is the root, not /Bundle</p>",
        "id": 176957360,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1569866722
    },
    {
        "content": "<p>Right, it's always the base URL of the FHIR RESTful API as documented <a href=\"https://www.hl7.org/fhir/http.html#transaction\" target=\"_blank\" title=\"https://www.hl7.org/fhir/http.html#transaction\">here</a>.</p>",
        "id": 176960406,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1569868597
    },
    {
        "content": "<p>Generic FHIR systems won't have any notion of 'types' of transactions - a transaction is a transaction is a transaction.  If you <em>need</em> distinct behavior, then you might need custom operations.</p>",
        "id": 176983783,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569885885
    },
    {
        "content": "<p>with transactions that do have behaviors, how do you account for a microservices architecture where you would have multiple services (endpoints) in a given system?</p>",
        "id": 177100479,
        "sender_full_name": "Jeremy Chapman",
        "timestamp": 1569966015
    },
    {
        "content": "<p>are you referring specifically to FHIR transactions: <a href=\"http://hl7.org/fhir/http.html#transaction\" target=\"_blank\" title=\"http://hl7.org/fhir/http.html#transaction\">http://hl7.org/fhir/http.html#transaction</a> </p>\n<p>In that case, they have a fully specified set of behaviors and they have to happen at the root of the server whether they are in a MSA or any other setup.</p>\n<p>If you just mean an operation you defined that happens to have transactional (in the DB sense, not the FHIR sense), you have more options in terms of what the URL will be, but it does have to follow the FHIR rules for naming operations. I.e. <code>[baseUrl]/Bundle/$process-my-transaction</code> would be acceptable.</p>",
        "id": 177109329,
        "sender_full_name": "James Agnew",
        "timestamp": 1569973922
    }
]