[
    {
        "content": "<p>Hi,</p>\n<p>Probably in the documentation but I'm having trouble finding it sorry, is there any way to upload a bundle where the collection type is:<br>\n&lt;type value=\"collection\"/&gt;<br>\nUsing postman to post onto my local test server I get:<br>\n &lt;pre&gt;Unable to process transaction where incoming Bundle.type = collection&lt;/pre&gt;</p>\n<p>Should all Posts by of type transaction &amp; is there any way to get a bundle collection into my test server without modifying it to \"transaction\"?</p>\n<p>Cheers,<br>\nSteve</p>",
        "id": 153902696,
        "sender_full_name": "Stephen Lloyd",
        "timestamp": 1502980639
    },
    {
        "content": "<p>You ought to be able to post it to the [root]/Bundle endpoint.  You won't be able to post to the [root] endpoint.</p>",
        "id": 153902699,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502981617
    },
    {
        "content": "<p>Thanks Lloyd, that has worked however we now end up with a Bundle entry in our server and not a list of individual resources. Will they still be individually resolvable in any way?</p>",
        "id": 153902700,
        "sender_full_name": "Stephen Lloyd",
        "timestamp": 1502982082
    },
    {
        "content": "<p>Actually, I've just been told that they're trying to upload the default fhir profiles (from defintions.xml.zip), does this sound sensible or are they externally resolvable permanently (from somewhere else)?<br>\nDo they need to be in our server for our profiles to reference &amp; if so, what's the best process?</p>",
        "id": 153902702,
        "sender_full_name": "Stephen Lloyd",
        "timestamp": 1502982313
    },
    {
        "content": "<p>If the Bundle type is Collection, they won't be stored separately.  If you want them stored separately, then you need a Bundle type of \"transaction\" and in that case you'd post it to the [root] endpoint.</p>",
        "id": 153902703,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502982565
    },
    {
        "content": "<p>wrt loading the default definitions, I generally do that so I know where they are. Certainly there is the intention to make them globally accessible from a single registry (likely Simplifier) - but AFAIK we're not quite ready yet. Hapi has a neat tool for uploading these resources - see (<a href=\"https://fhirblog.com/2016/03/06/building-your-own-fhir-server/\" target=\"_blank\" title=\"https://fhirblog.com/2016/03/06/building-your-own-fhir-server/\">https://fhirblog.com/2016/03/06/building-your-own-fhir-server/</a>) - I'm guessing that it would work against any server supporting the correct API (but I haven't checked)</p>",
        "id": 153902725,
        "sender_full_name": "David Hay",
        "timestamp": 1503009530
    },
    {
        "content": "<p>the spec says that how to handle a collection is at the discretion of the server. what server are you using?</p>",
        "id": 153902732,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1503023416
    },
    {
        "content": "<p>Thanks for the information everyone it's much appreciated, we're using a HAPi server (2.5 atm) although that's out of my control at the moment but I can nudge the people in control of it if needs be.<br>\nI will have a look at the 'building your own server' link suggested and speak to the person in control of the server we're bring up :)</p>",
        "id": 153902756,
        "sender_full_name": "Stephen Lloyd",
        "timestamp": 1503047903
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> 's suggestion of the CLI tool to upload the standard profiles is looking very useful. Thanks again.</p>",
        "id": 153902759,
        "sender_full_name": "Stephen Lloyd",
        "timestamp": 1503060753
    }
]