[
    {
        "content": "<p>Hi, We're looking at an implementation where we need to include a patient as a the subject of an observation. We are planning on doing this using a reference to a contained resource since at the time of the observation being created there is no meaningful patient resource to reference, so a minimal once with a key identifier will be included as the contained resource. We are grouping a number of observations (all about the same patient) into a bundle for transport to the server. Reading the STU3 spec, the Bundle.entry.resource field is of type resource (<a href=\"http://hl7.org/fhir/STU3/resource.html\">http://hl7.org/fhir/STU3/resource.html</a>), which does not allow contained resources. Could you please advise if we're going down the wrong path or if we could treat the resource in the bundle as a domain resource which allows contained resources.</p>",
        "id": 260751472,
        "sender_full_name": "Bart Dutkowski",
        "timestamp": 1636430538
    },
    {
        "content": "<p>in that context, Resource is abstract, and the contents of the element will be a valid concrete resource. if that concrete resource allows contained resources, then they are allowed</p>",
        "id": 260753759,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1636433761
    },
    {
        "content": "<p>If you have identifiers for the patients, you can avoid creating any Patient resources by using Observation.subject.identifier instead of Observation.subject.reference.</p>",
        "id": 260754080,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1636434058
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> thanks for the clarification, that makes sense. <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> thanks for the suggestions, I didn't know about that option. We'll take a look if we can use that approach.</p>",
        "id": 260880333,
        "sender_full_name": "Bart Dutkowski",
        "timestamp": 1636502114
    },
    {
        "content": "<p>If you want to say that all of the Observations are about the same patient, you might consider just putting the patient in the same Bundle and having all of the other resources reference it.  Multiple Observations each with their own contained resource would in no way indicate that they're all talking about the same individual</p>",
        "id": 261455606,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1636949892
    }
]