[
    {
        "content": "<p>Should a bundle with bundle type <a href=\"http://build.fhir.org/valueset-bundle-type.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-bundle-type.html\">valueset</a> document be treated as a transaction? It seems a bit fluffy that there are valuetypes (eg. transaction and batch) that describes the behaviour of <strong>how</strong> the collection of elements should be handled mixed with <strong>what</strong> is contained (document and message). Ain't that two different qualities that mixed together? Is it not something that is orthogonal on eachother and should not be mixed?</p>",
        "id": 153991812,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1535616618
    },
    {
        "content": "<p>What gets done with a Bundle depends on what you do with it.  If you POST it to the Bundle endpoint, the base expectation is that you'll store it as-is.  However, a system MAY choose to process it as a transaction too - creating or updating resources at various other endpoints based on the content of the Bundle.  If you POST the document to the root endpoint, then some servers might opt to treat the Bundle as a transaction, though without the specific instructions on whether to POST or PUT the data, the server would have to make up its own business rules.  And of course, the server would be well within its rights to reject the POST as invalid.  In general, the only thing that you can count on being treated as a transaction is a Bundle of type \"transaction\".  The primary purpose of a document Bundle is to be stored and to be rendered in a particular way.</p>",
        "id": 153991822,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535616990
    },
    {
        "content": "<p>Where does the spec say anything about rendering of document Bundles?</p>",
        "id": 153991823,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1535617120
    },
    {
        "content": "<p>would you agree to the fact that <strong>how</strong> and <strong>what</strong> are sort of mixed together in this valueset?</p>",
        "id": 153991824,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1535617351
    },
    {
        "content": "<p>It's all about the \"what\".  A transaction and a document are different things.  The rules around processing documents is <a href=\"http://build.fhir.org/documents.html#presentation\" target=\"_blank\" title=\"http://build.fhir.org/documents.html#presentation\">here</a></p>",
        "id": 153991825,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535617447
    },
    {
        "content": "<p>you stated that servers MAY choose to process documents as transactions too - which makes sense to me - and this in my perspective qualifies as <strong>how</strong>.</p>",
        "id": 153991827,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1535617861
    },
    {
        "content": "<p>to me it seems a bit shoehorned that there is a special transactional type for bundles containing a composition (given that one can treat a document as a transaction) - but it might just be the special case that makes the world spin. And why must composition be the first resource? Wouldn't it be adequate to say that it must contain at least one or only one? Is the order important?</p>",
        "id": 153991830,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1535618524
    },
    {
        "content": "<p>Processing a document as a transaction is an unusual thing.  Servers <em>can</em> do whatever they like.  But if something is a document, the expectation is that it'll be processed like a document - i.e. stored and rendered.</p>",
        "id": 153991833,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535618592
    },
    {
        "content": "<p>Composition must be the first resource because it's the anchor for the content.  It defines how the document is rendered and provides all the metadata needed when searching for the document.</p>",
        "id": 153991834,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535618627
    },
    {
        "content": "<p>but you would like the document being processed by a server as an atomic commit, right?</p>",
        "id": 153991835,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1535618724
    },
    {
        "content": "<blockquote>\n<p>Composition must be the first resource because it's the anchor for the content.  It defines how the document is rendered and provides all the metadata needed when searching for the document.</p>\n</blockquote>\n<p>The need you describe only require the composition to be within the bundle. It does not describe a need for it to be first</p>",
        "id": 153991836,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1535619201
    },
    {
        "content": "<p>No.  When you post adocument, you want it stored as a Bundle</p>",
        "id": 153991837,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535619210
    },
    {
        "content": "<p>Making the composition first means that servers don't have to wade through a Bundle of 100+ resources looking for it.</p>",
        "id": 153991838,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535619247
    },
    {
        "content": "<p>Documents are \"special\", just like messages and history and all the other types of Bundle.  Each has rules around what content is expected to be present and where it's expected to appear.  Those rules allow the behaviors associated with those types to be performed appropriately and efficiently.</p>",
        "id": 153991840,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535619326
    },
    {
        "content": "<blockquote>\n<p>Making the composition first means that servers don't have to wade through a Bundle of 100+ resources looking for it.</p>\n</blockquote>\n<p>if the argument is for performance reasons wouldn't it be suitable to suggest an order for all resources  in all types of bundles - e.g. patients before encounters and so on?</p>",
        "id": 153991841,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1535619587
    },
    {
        "content": "<p>There's no general purpose rule for a transaction bundle - we have no clue what they might contain.  But a Document will always contain one \"defining\" Composition.  And that Composition is key to it being a document.  (In fact, in some rare cases, a document Bundle could theoretically contain multiple compositions, so insisting that the defining one be first has additional importance.)</p>",
        "id": 153991842,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535619966
    },
    {
        "content": "<p>There's no ordering of the content within a document bundle beyond the requirement that the defining Composition must come first (just as the MessageHeader must come first in a message Bundle).</p>",
        "id": 153991843,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535620020
    },
    {
        "content": "<blockquote>\n<p>There's no general purpose rule for a transaction bundle - we have no clue what they might contain.  But a Document will always contain one \"defining\" Composition.  And that Composition is key to it being a document.  (In fact, in some rare cases, a document Bundle could theoretically contain multiple compositions, so insisting that the defining one be first has additional importance.)</p>\n</blockquote>\n<p>A document bundle cannot pr. spec contain multiple compositions - that would violate the rule about it having to be first as both cannot be first</p>",
        "id": 153991845,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1535620101
    },
    {
        "content": "<blockquote>\n<p>There's no ordering of the content within a document bundle beyond the requirement that the defining Composition must come first (just as the MessageHeader must come first in a message Bundle).</p>\n</blockquote>\n<p>I cant see the need for the MessageHeader to come first either</p>",
        "id": 153991847,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1535620181
    },
    {
        "content": "<p>Where does the spec say that multiples are prohibited?  The defining Composition must be first, but I don't see any rule prohibiting others.</p>",
        "id": 153991848,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535620221
    },
    {
        "content": "<p>When you're processing a message, the first thing you want to see (so you know whether you even want to process it or not) is the MessageHeader.  Having the MessageHeader anywhere else in the instance is just inefficient.</p>",
        "id": 153991849,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535620280
    },
    {
        "content": "<p>I'd rather spec those extra bucks on a CPU doing the traversal of +100 resources than spending time on development tuning my serializer to enforce a rule about certain elements to come first - but that is a subjective matter of opinion.</p>",
        "id": 153991850,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1535620363
    },
    {
        "content": "<p>Well, if you're serializing a document, the root object that you're working with is going to be the Composition, so making it the first entry in the Bundle should be a pretty natural thing to do.  (Same for MessageHeader and a message)</p>",
        "id": 153991851,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535620500
    },
    {
        "content": "<blockquote>\n<p>Well, if you're serializing a document, the root object that you're working with is going to be the Composition, so making it the first entry in the Bundle should be a pretty natural thing to do.  (Same for MessageHeader and a message)</p>\n</blockquote>\n<ul>\n<li>back to my performance argument. I would either buy more CPU - or globally define a relational order for all elements - but that is my own subjective opinion</li>\n</ul>",
        "id": 153991853,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1535620606
    },
    {
        "content": "<blockquote>\n<p>Where does the spec say that multiples are prohibited?  The defining Composition must be first, but I don't see any rule prohibiting others.</p>\n</blockquote>\n<p>I'm in deep water here and I wouldn't expect multiple compositions. If there exists something as a 'defining' composition, I would suggest it to be modelled in the datafields - not in the order I read it</p>",
        "id": 153991854,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1535620703
    },
    {
        "content": "<p>Breaking out the Composition or MessageHeader as separate elements would introduce a significant amount of other complexity - as you'd then have to handle those resources pointing to entries in the Bundle and entries in the Bundle pointing to them.  On balance, requiring that the \"special\" resources come first is much simpler.  Order has to be retained and order is allowed to have significance.  We take advantage of that where we need to.  (Just as we require that the \"first\" name of a Patient is the first repetition of Patient.name.given...)</p>",
        "id": 153991858,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535621256
    }
]