[
    {
        "content": "<p>Hi<br>\nWe are working on the FHIR implementation. I want to ask if I want to create a episode of care with a reference patient that doesn’t exist, (both the episode of care and the reference patient need to be created. ) what should the bundle be like?</p>\n<p>Does someone have experience on it?</p>",
        "id": 153971751,
        "sender_full_name": "Jenny Zhu",
        "timestamp": 1530006888
    },
    {
        "content": "<p>So you want to send a Bundle that requests creation of both Patient and EpisodeOfCare?  That sounds like a transaction.  The Patient would have a fullUrl of a guid and the EpisodeOfCare would reference the Patient by that GUID.  It would be the responsibility of the receiving server to translate that reference into a proper URL as part of executing the transaction.</p>",
        "id": 153971752,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530007254
    },
    {
        "content": "<p>Thank you very much for your reply.<br>\nDo you mean that it's not necessary for the receiving server to create the patient? <br>\nFor the receiving server, it only stores the full Url of patient.</p>\n<p>Or the full Url contains the operation 'POST' for the patient? then the receiving server should analyze the Url and do corresponding operation?</p>",
        "id": 153972000,
        "sender_full_name": "Jenny Zhu",
        "timestamp": 1530067911
    },
    {
        "content": "<p>If you're sending a transaction, you'd be doing a POST for both.  The inclusion of the fullUrls would be to allow referencing between the items in the Bundle.  The receiving system would assign new fullUrls in its system when it processes the POST requests.</p>",
        "id": 153972028,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530076914
    },
    {
        "content": "<p>So you mean that in a transaction we can create an episode of care and a patient. Is it correct?</p>",
        "id": 153972280,
        "sender_full_name": "Jenny Zhu",
        "timestamp": 1530153449
    },
    {
        "content": "<p>Yes</p>",
        "id": 153972299,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530167486
    },
    {
        "content": "<p>Thank you very much. It's clear for me now.</p>",
        "id": 153972496,
        "sender_full_name": "Jenny Zhu",
        "timestamp": 1530254037
    }
]