[
    {
        "content": "<p>When the API is called with NDC, the response is a bundle with bundle-type=Search Results<br>\nHowever, when the API called with RxCUI, it has multiple NDC - Can we make the bundle resource in a bundle resource? In other words, how to return the multiple bundle resources in a single source?</p>",
        "id": 245063143,
        "sender_full_name": "Bapi Behera",
        "timestamp": 1625588406
    },
    {
        "content": "<p>A search always returns all results in a single Bundle.  There is no 'group by' functionality to organize the results into sub-bundles.  The only way to get back Bundles in a search is to be searching the Bundle endpoint for pre-existing stored Bundles.</p>",
        "id": 245067751,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625590667
    },
    {
        "content": "<p>We have been exploring a similar issue for batched notifications (e.g., I need to send 'x' primary resources and each one may have additional resources included).  So far, the options have been creating a list in the notification (e.g., <a href=\"https://www.hl7.org/fhir/messageheader-definitions.html#MessageHeader.focus\">MessageHeader.focus</a>), doing the same but with a graph of sorts (to allow defined relationships for things like the same resource being included twice), or adding annotations to <code>Bundle.entry</code> (e.g., how <a href=\"http://hl7.org/fhir/bundle-definitions.html#Bundle.entry.search.mode\">Bundle.entry.search.mode</a> works today).</p>\n<p>As of right now I would lean towards an extension on <code>Bundle.entry</code> since it would allow for much more general use (a similar issue has been brought up in the current Argonaut Write project - in a call to add/update one resource it can be useful to include additional info for the server case it needs the data).</p>\n<p>It seems that an extension such as <code>bundle-entry-grouping</code> would check most of those boxes alone, though we may also need something equivalent to the current <code>Bundle.entry.search.mode</code> in order to identify a primary vs. included resource. (Sorry, thinking as I am typing =).. Or, we could bake that into the grouping itself, e.g., if the grouping is an ID it implies the primary resource included.</p>",
        "id": 245225142,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1625683541
    }
]