[
    {
        "content": "<p>I am using firely-net-sdk (HL7.Fhir.R4) I have a bundle consisting of 2 entities. When creating the bundle object i can pass in a Bundle.BundleType which can be Transaction, Batch...etc</p>\n<p>I want the bundle to be processed as a batch. However when needing to post the bundle using the FhirClient class, I only see the methods Transaction(Bundle) and TransactionAsync(Bundle). This seems counterintuitive as I have already specified the transaction type. Maybe it is just a naming issue with the Transaction methods. I expected to find something like \"PostBundle(Bundle)\". </p>\n<p>So my question is: how can I, using HL7.Fhir.R4, post the bundle as a batch?</p>",
        "id": 227733378,
        "sender_full_name": "Jonas Toft",
        "timestamp": 1614241459
    },
    {
        "content": "<p>Use those Transaction methods</p>",
        "id": 227756779,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1614254942
    },
    {
        "content": "<p>Can you elaborate a bit on that? The documentation says that the bundle is executed as a transaction when using those methods so I am not sure it is supported. How would you verify that it could work as a batch?</p>",
        "id": 227774131,
        "sender_full_name": "Jonas Toft",
        "timestamp": 1614263029
    },
    {
        "content": "<p>I am betting that they do not change the bundle type - and that's the only thing that distinguish a transaction from a batch</p>",
        "id": 227780556,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1614265406
    },
    {
        "content": "<p>But in the end it is just a simple POST - so no real need to use those methods either</p>",
        "id": 227780824,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1614265501
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span></p>",
        "id": 227787503,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614267888
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> - that is right. We pass on the bundle unchanged.  The name is a bit confusing nowadays, I admit, but was chosen 7 years ago when Bundle was just used for a search result (incoming) or (outgoing) as a transaction.  We were even using Atom for Bundles back then ;-)</p>",
        "id": 228200516,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1614590623
    }
]