[
    {
        "content": "<p>Looking at the constraints on Bundle - what is the rationale behind bdl-9 - why is the presence of a system mandated for a document?</p>\n<p><a href=\"/user_uploads/10155/2oG8W9IOCXT2etPrgkARt4ZK/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/2oG8W9IOCXT2etPrgkARt4ZK/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/2oG8W9IOCXT2etPrgkARt4ZK/pasted_image.png\"></a></div>",
        "id": 153926807,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1513940194
    },
    {
        "content": "<p>Good question.  This seems like an imposition of a \"best practice\" rather than an essential requirement.  We generally try to leave best practices for implementation guides where the context can be known and the notion of best practice can be more appropriately evaluated.  Feel free to submit a change request :)</p>",
        "id": 153926838,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513962918
    },
    {
        "content": "<p>because everyone agreed that documents should ave globally unique identifiers. Sounds like you don't agree - why?</p>",
        "id": 153926870,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513975931
    },
    {
        "content": "<p>Every healthcare business object <em>should</em> have globally unique identifiers.  But we accept that there are use-cases where such identifiers might not exist or might not be useful/necessary for the use-case at hand in some cases - which is why we make identifier optional everywhere it's not essential for the use of the object (e.g. in MessageHeader it's essential to allow acknowledgement and checking for duplicate delivery).  It's not clear to me how a document is any different from an Observation or AllergyIntolerance or MedicationRequest here.  The identifier isn't essential for use even if it might be good practice.  If someone has systems that don't produce them or have no need for one, we shouldn't be enforcing the existence of the element with the base standard.</p>",
        "id": 153926884,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513976998
    },
    {
        "content": "<p>if everyone agrees to anyway, then we make the rule, to make life simpler for the entire eco-system.</p>",
        "id": 153926889,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513977444
    },
    {
        "content": "<p>The problem is that \"everyone\" is the narrow set of folks who are looking at documents right now - and who tend to be dominated by folks who are used to doing things the CDA way where they've had no choice (and were also dealing with a narrow class of documents).  Imposing \"best practice\" notions to make life simpler will tend to make life simpler for those doing the imposing, but more complex for those who come to the table late.  I'm much more comfortable with the idea that all \"best practice\" stuff gets punted to IGs (like \"CDA on FHIR\")</p>",
        "id": 153926896,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513979079
    },
    {
        "content": "<p>In the core standard, we can't possibly be aware of all the contexts where a resource might be used, so we need to be very cautious about imposing mandatory elements.</p>",
        "id": 153926897,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513979117
    },
    {
        "content": "<p>... but the counter argument is that the second most common criticism of FHIR that I get as product director is that everything is optional, and we don't standardise enough. So we should always try</p>",
        "id": 153926899,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513979811
    },
    {
        "content": "<p>Well, even the few things we standardized in v2 ended up causing grief - e.g. Patient name being required which requires fudging for anonymized patients, animals without names, patients whose names aren't known, etc.  - all use-cases that weren't considered as part of the original decision.  I understand the concern of people who see too much optionality in the core spec - but that's driven by the fact the base spec is contextless.  And we provide mechanisms to tighten down cardinality once your operating context is defined.  In the real world, \"documents\" get created all the time without identifiers, let alone globally unique identifiers.  This doesn't feel like a rule that should be in the core spec.</p>",
        "id": 153926902,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513981661
    },
    {
        "content": "<p>I don't see what special benefit is provided for doing this for documents rather than other business objects, nor do I see how there's significantly greater consistency around the use of identifiers in the non-CDA document community than there is for other types of business objects.</p>",
        "id": 153926903,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513981751
    },
    {
        "content": "<p>Interesting debate - we'll conclude that this is for universal uniqueness and nothing more. As we are fixed to STU3 then as it exists we need to cater for it in our solutions. Not a big deal, we were more trying to understand the why as it now means that every document provider now has o understand the process of allocating their own system id now. Not a challenge for the FHIR educated but \"just another thing\" for everyone else.</p>",
        "id": 153926919,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1514017764
    }
]