[
    {
        "content": "<p>My question's in the scope of a SMART on FHIR launch.  I'm working with a vendor that is publishing SMART on FHIR widgets and using all Bundle resources to access data, creating fully custom results.  Some of the bundles are accessed from my middleware (so they're calling their own FHIR APIs plus mine).  One thing we're struggling with is agreeing to the cardinality rules from the FHIR specs.  If I'm returning a Bundle of type search-set with a Claim in it, does that Claim need to follow all cardinality rules described in <a href=\"https://www.hl7.org/fhir/claim.html\">https://www.hl7.org/fhir/claim.html</a> ; for instance the 1..* on the insurance (the vendor represents the insurer so they are actually managing the data for the insurance on the Claim and don't need my system to provide this).</p>",
        "id": 200547808,
        "sender_full_name": "John D. Ament",
        "timestamp": 1591884038
    },
    {
        "content": "<p>All cardinality requirements as well as all other constraints must be met by all instances in order to be valid.  If you think any of the constraints are inappropriate for your use-case , please submit a change request with details about your use-case so the relevant work group can consider whether the constraints should be loosened in a future version.  In the meantime, you might be able to use the data-absent-reason extension to satisfy the cardinality.  Also consider using the Basic resource.</p>",
        "id": 200550612,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591885238
    },
    {
        "content": "<p>Note that you can't expect systems that support SMART to support custom query responses - so you'll have to negotiate with any servers you want your app to run on (and I wouldn't hold your breath on most EHR implementers being enthused about supporting custom structures).</p>",
        "id": 200550838,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591885323
    }
]