[
    {
        "content": "<p>Hello All, <br>\nFor my use case, I'm interested in collecting an organization's patient data for 2 purposes, 1) Analytics and Reporting (short term) 2) Potentially the provision of care (long term goal). </p>\n<p>We're planning to receive 1 bundle containing Patient, Service Request and Organization resources at a minimum, each bundle should contain data for 1 and only 1 patient. Updates will contain the same 3 resources at listed at a minimum, and optionally additional resources including Episode Of Care, Health Care Program, Encounter, Appointment, and Observation. Currently, there is no need to capture an Attester, Author, and other details contained in a document. My question is - could the above use case be supported using a Bundle Resource with Type - Transaction, with slices on Bundle.entry on the 3 required resources  (making Cardinality 1..1 on Patient, ServiceRequest, Organization)? Or is a Bundle Type of Transaction not meant for the purposes outlined here. Is there a benefit to using the Composition resource for this type of scenario? </p>\n<p>Thanks!</p>",
        "id": 260702992,
        "sender_full_name": "Inderpal Singh",
        "timestamp": 1636398081
    },
    {
        "content": "<blockquote>\n<p>We're planning to receive 1 bundle</p>\n</blockquote>\n<p>This needs further clarification. Does it mean:</p>\n<ul>\n<li>your application is going to execute a search , and the response bundle needs to meet your requirements</li>\n</ul>\n<p>or</p>\n<ul>\n<li>your application is going to execute a custom operation, and the result of the operation needs to meet your requirements</li>\n</ul>\n<p>or</p>\n<ul>\n<li>the source of the information will be configured to post the information to your server when a particular event occurs, and the bundle to be posted needs to meet your requirements</li>\n</ul>\n<p>or</p>\n<ul>\n<li>you are planning to use FHIR messaging, and the bundle of type message needs to meet your requirements</li>\n</ul>\n<p>Have you considered these options?</p>",
        "id": 260713582,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1636402982
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/179166-implementers/topic/Bundle.20Type.20-.20Transaction.20or.20Document.3F/near/260713582\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>We're planning to receive 1 bundle</p>\n</blockquote>\n<p>This needs further clarification. Does it mean:</p>\n<ul>\n<li>the source of the information will be configured to post the information to your server when a particular event occurs, and the bundle to be posted needs to meet your requirements</li>\n</ul>\n<p>Have you considered these options?</p>\n</blockquote>\n<p>Hi Vassil, </p>\n<p>Thanks for responding. </p>\n<p>This options is the closest to what we're trying to achieve:<br>\n\"* the source of the information will be configured to post the information to your server when a particular event occurs, and the bundle to be posted needs to meet your requirements\"</p>\n<p>The source will be configured to post a new bundle (for new patients), or update an existing bundle based on search criteria (using conditional update) ideally when a new event occurs (they will hold the data until end of day and send us nightly). The posted bundle will need to meet our conformance requirements.</p>",
        "id": 260714782,
        "sender_full_name": "Inderpal Singh",
        "timestamp": 1636403576
    },
    {
        "content": "<p>If you're wanting to comply with the FHIR specification, then you'd need to either use FHIR messaging or a custom operation.  Note that both of these will require custom configuration of your communication partners and won't let you leverage things like SMART on FHIR or CDS Hooks or anything else that relies on having a RESTful FHIR server.</p>",
        "id": 261453250,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1636946486
    }
]