[
    {
        "content": "<p>I want a create/update operation for the notion of a \"patient\" in our FHIR-enabled system. My \"patient\" is essentially a FHIR Patient, but with a couple extra data fields. These fields are required at the lowest level, so in my system - I can't create a \"patient\" without them.</p>\n<p>Is it reasonable to make the create/update operation a “transaction” type operation for the Bundle resource – where the Bundle has a Patient entry and other dependent entries (which have the additional fields)?</p>",
        "id": 168141137,
        "sender_full_name": "Chris Dwyer",
        "timestamp": 1560523548
    },
    {
        "content": "<p>The contents of a Bundle have to be official resources.  Have you looked at using extensions?</p>",
        "id": 168141411,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560523722
    },
    {
        "content": "<p>Yeah, the idea is that the entries in the Bundle are official resources. For example, one of the \"dependent entries\" is a Coverage resource.</p>",
        "id": 168141495,
        "sender_full_name": "Chris Dwyer",
        "timestamp": 1560523795
    },
    {
        "content": "<p>You're looking for an external system to request creation of a Patient on your system, but for that to work they also need to send you a Coverage?  I suppose a transaction could work for that.  (But be aware that most systems won't try to work with you that way, so you'll essentially be imposing a customization requirements on everyone that talks to you.)</p>",
        "id": 168141777,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560523961
    },
    {
        "content": "<p>OK. I think I understand that. Our current implementation is somewhat internal - that is, we have a certain level of authority to impose the requirements. Would imposing such a requirement not be \"according to standard\"?</p>",
        "id": 168142627,
        "sender_full_name": "Chris Dwyer",
        "timestamp": 1560524572
    }
]