[
    {
        "content": "<p>Hi all. We are migrating outlook events to fhir appointments. But we need to model the concept of the doctor's calendar (sometimes there are several outlook calendars for the same doctor). We plan to use the Schedule resource to model this calendar concept (with a 1-1 relationship). The problem is that we do not want to use, for now, the Slot resource (intermediate between Schedule and Appointment) because in this case we do not want to model the reservation process (we don't need it currently). We plan to link the appointments with their Schedule using an extension in the appointment. What do you think of this idea? Use Schedule as a representation of the calendar concept? and link the appointments with the Schedule with 1 extension? Any advice, thanks</p>",
        "id": 232600622,
        "sender_full_name": "Yagami L",
        "timestamp": 1617200776
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 232622204,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617208244
    },
    {
        "content": "<p>I think that the relationship with the practitioner (through participants) in the appt is more relevant than the specific schedule resource. The schedule resource is really more about the reservation slot part (think Free-Busy information in outlook) rather than the appointments themselves.</p>\n<p>When we render our calendar, the schedule gives the slots available, and the appt's are the real bookings - but they aren't all bookings, some are reservations of time marked out.</p>",
        "id": 232657704,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1617221636
    },
    {
        "content": "<p>How are you going to adjust if in the future you need the Slot resource? In my opinion, it is better to account for the intermediary Slot from the get-go, than to later try to handle two different ways to do the same things.</p>",
        "id": 232661331,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1617223114
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> . The specific situation is that for example, we have a Practitioner with 3 PractitionerRole. We extract the medical appointments of two of the PractitionerRole from one of their outlook calendars and that of another PractitionerRole from another calendar. The problem is that in the first case we cannot always determine which of the 2 PractitionerRole corresponds to it. That is why we always use the Practitioner as a participant in the appointment (and not the PractitionerRole). The situation is that we need to be able to express the membership of an appointment to a calendar both to be able to define how the migration is from outlook, and when it comes to displaying it in our UI. And the resource that seemed closest to us was Schedule although in reality it is more related to booking. What other resource or idea could we use to express this relationship with a calendar?</p>",
        "id": 232665174,
        "sender_full_name": "Yagami L",
        "timestamp": 1617224789
    },
    {
        "content": "<p>You've exactly described the problem, and whtly fhir hasn't defined anything tighter. There are just so many ways people run their calendars, and many don't have just one (as you've shown)<br>\nAnd given with your description you don't know which rlthey belong to, don't know how a fhir representation could help you here.<br>\nYou correctly have prac, PracRole, appt and schedule.<br>\nRemebering that schedule just points back to the resource too, which would either be prac or PracRole (or location too if you were considering rooms or equipment in the mix too)</p>",
        "id": 232675321,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1617229668
    }
]