[
    {
        "content": "<p>In v2, the NK1 segment can be a person or an organization. While an organization can have a contact person, presumably it's the organization that is often the important bit (contact people come and go within an organization). What is the equivalent in FHIR to an organizational NK1 segment? I've found some threads that suggest it might be a Practitioner (more likely a PractitionerRole) but the Preferred value set for RelatedPerson.relationship does into values for things like employer, state agency, etc suggesting a RelatedPerson could be an organization. But looking at RelatedPerson, I don't see a way to including organizational data. For what it's worth, Patient.contact.organization exists, so an Organization seems to be able to be a contact point for a patient, but not a RelatedPerson acting on behalf of the patient. Is the scope of RelatedPerson limited just to humans (and animals)?</p>",
        "id": 204583481,
        "sender_full_name": "Craig Newman",
        "timestamp": 1595355618
    },
    {
        "content": "<p>Patient.contact can be an Organization.  I had proposed allowing RelatedPerson to be an organization (for cases where the individual acting on the patients behalf is an organization - e.g. a government acting on behalf of a ward of the state).  However, the change request was rejected as insufficiently broadly supported (<a href=\"https://jira.hl7.org/browse/FHIR-9893\">https://jira.hl7.org/browse/FHIR-9893</a>)</p>",
        "id": 204590410,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595358983
    },
    {
        "content": "<p>Finding this randomly. Kinda crazy this was rejected. A RelatedPerson seems great for <a href=\"http://patient.contact\">patient.contact</a>, especially if it was a choice between a RelatedPerson and Organization. Instead, we get some random attributes within patient itself? Strange</p>",
        "id": 263087776,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1638232652
    }
]