[
    {
        "content": "<p>I have gotten conflicting information about the setting of the meta.profile element.  I would have thought that an uploader creating a resource that follows a certain profile would populate the meta.profile element with the profile it is following. But I have been told that the server might change that value. Is this true? I would think that a reader would want to examine the meta.profile values and take advantage of any additional knowledge it may have regarding a certain profile.</p>\n<p>So my question is, can I safely set the meta.profile value, upload the resource, and rely on that field being present for a consumer of the resource?</p>",
        "id": 153921543,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1511554330
    },
    {
        "content": "<p>Resource.meta.profile is a claim that a resource meets a profile.</p>",
        "id": 153921551,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511559293
    },
    {
        "content": "<p>Servers are allowed to remove claims, and/or add additional claims</p>",
        "id": 153921552,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511559318
    },
    {
        "content": "<p>claims SHOULD be true, of course. but that doesn't mean they are</p>",
        "id": 153921553,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511559335
    },
    {
        "content": "<p>You'll have to define 'safe' before we could know what safe means.</p>",
        "id": 153921554,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511559358
    },
    {
        "content": "<p>but in principle, you should always use the data - the codes, etc - to decide how to handle resources.</p>",
        "id": 153921555,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511559378
    },
    {
        "content": "<p>Technically you can't rely on <em>any</em> data being persisted by a server, as servers are allowed to choose which elements they support and which they don't.  So technically, some systems could throw away <a href=\"http://Patient.name\" target=\"_blank\" title=\"http://Patient.name\">Patient.name</a> - and there are use-cases where that would be a valid thing for them to do.  There's a whole section on <a href=\"http://hl7.org/fhir/updates.html\" target=\"_blank\" title=\"http://hl7.org/fhir/updates.html\">Variations between Submitted and Retrieved Data</a> in the spec that talks about some of this.</p>",
        "id": 153921559,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1511563696
    }
]