[
    {
        "content": "<p>I'm trying to determine the best way to launch a referral application using FHIR. One of the proposed methods is with a SMART on FHIR app.</p>\n<p>The referral app will help select services, present a fillable form, etc... I know that i can request resources like /patient, and maybe the allergies etc... but would it make sense for a SMART app to pull an partially completed ServiceRequest?</p>\n<p>For example, lets say i'm in an EMR, and using its referral module i want to start a referral, enter reason for referral, specify some of the data that i want to include in a referral, then launch a SMART app to open the form for the service i'm referring to and complete the remainder of the information.</p>\n<p>This approach to this SMART app would only work in the context of making a referral (since i would need an active service request to pull from).</p>\n<p>Is this something that philosophically makes sense from a SMART app perspective, or is it too narrow/specific?</p>",
        "id": 153940991,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1519752473
    },
    {
        "content": "<p>I think most EHR companies would prefer a less granular workflow, where it starts and finishes in the app - finishes with a service request being POSTed. But I suspect that life won't be so simple</p>",
        "id": 153941006,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519754821
    },
    {
        "content": "<p>I suspect this as well. A ServiceRequest being posted at the end is indeed the goal. I'm trying to narrow down the starting point. The way you phrase it, leans me to try and err on the side of ... generically launching an eReferral app from the patient context, rather than from a \"referral\" context.</p>",
        "id": 153941011,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1519755182
    },
    {
        "content": "<p>well, there's trial and error here to figure out what's best. Have you read this, btw?</p>",
        "id": 153941013,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519756275
    },
    {
        "content": "<p><a href=\"http://www.healthintersections.com.au/?p=2746\" target=\"_blank\" title=\"http://www.healthintersections.com.au/?p=2746\">http://www.healthintersections.com.au/?p=2746</a></p>",
        "id": 153941014,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519756305
    },
    {
        "content": "<p>not directly related, but possibly relevant</p>",
        "id": 153941015,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519756311
    }
]