[
    {
        "content": "<p>The spec mentions resolving the StructureDefinition for an extension using a \"canonical\" URL though Extension.url is typed to <code>uri</code>.  Can / should Extension.url be used in a similar fashion to Resource.meta.profile  where an optional <code>version</code> can be appended?</p>\n<p>\"The url SHALL be a URL, not a URN (e.g. not an OID or a UUID), and it <strong>SHALL be the canonical URL of a StructureDefinition that defines the extension</strong>. Except for child extensions defined within complex extensions, the URL SHALL be an absolute URL.\"</p>\n<p>When I think of a canonical URL, I think about the potential for an optional version (especially if we are looking up a StructureDefinition from a registry).</p>",
        "id": 204564375,
        "sender_full_name": "John Timm",
        "timestamp": 1595346132
    },
    {
        "content": "<p>Extension.url is <em>not</em> allowed to contain \"|version\" because it does not have a type of canonical.  This is intentional.</p>",
        "id": 204566571,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595347205
    },
    {
        "content": "<p>So perhaps the wording should be changed to not include \"canonical URL\"?</p>",
        "id": 204566861,
        "sender_full_name": "John Timm",
        "timestamp": 1595347346
    },
    {
        "content": "<p>It's a reference to the canonical URL, but it's not of type 'canonical'.</p>",
        "id": 204567116,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595347449
    },
    {
        "content": "<p>Perhaps the language should then be changed from <strong>SHALL be the canonical URL of  a StructureDefinition that defines the extension</strong> to <strong>SHALL be a reference to the canonical URL of a StructureDefinition that defines the extension</strong> though the nuance between an element of type canonical and a reference to a canonical URL still seems a bit ambiguous to me.</p>",
        "id": 204568353,
        "sender_full_name": "John Timm",
        "timestamp": 1595347991
    },
    {
        "content": "<blockquote>\n<p>Extension.url is not allowed to contain \"|version\" because it does not have a type of canonical. This is intentional.</p>\n</blockquote>\n<p>Mind expanding on the intention behind this?  Elsewhere, when we have a reference to a definitional knowledge artifact that needs to get looked up, it tends to be a canonical (so that it can include the version), right?  Why not here?</p>",
        "id": 204568997,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1595348316
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 204575496,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595351630
    },
    {
        "content": "<p>it's deliberate because you should not change the definition of an extension so much that the version becomes relevant to the interpretation</p>",
        "id": 204604987,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595366948
    },
    {
        "content": "<p>but I do think that it's reasonable to clarify the language</p>",
        "id": 204605006,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595366963
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192334\">@John Timm</span> Can you submit a change request asking for the clarification?</p>",
        "id": 204630740,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595394286
    },
    {
        "content": "<p>Created: <a href=\"https://jira.hl7.org/browse/FHIR-28143\">https://jira.hl7.org/browse/FHIR-28143</a></p>",
        "id": 204963396,
        "sender_full_name": "John Timm",
        "timestamp": 1595622864
    }
]