[
    {
        "content": "<p>In FHIR I search for all healthcareservice in a specific organization, I do:<br>\nGET baseurl/healthcareservice?_organization=123</p>\n<p>However, is it ok for me to build an API using a modern path based approach such as the following, or is it strongly discouraged?<br>\nGET baseurl/organization/123/healthcareservice</p>",
        "id": 278304801,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1649425068
    },
    {
        "content": "<p>More specifically, I'm trying to GET all appointments in a specific calendar in our application, but i can't find a concept of calendar (\"Schedule\" resource) as it exists for Appointment, as \"Schedule\" is intended only for open Slots</p>\n<p>Where my local restful path to get all appointments in a calendar is:<br>\nMy native API: GET baseurl/calendar/123/appointment</p>\n<p>I can't figure out the equivalent way to get all appointments in a calendar in FHIR as there's not query parameter for a schedule or calendar in the appointment resource<br>\nFHIR: GET baseurl/Appointment/?_??????</p>\n<p>Some options i'm considering right now:<br>\n1) create a custom search parameter called ?_calendar<br>\n2) when GETting fhir appointments by calendar, say that the base url = <a href=\"http://api.base.com/calendar/123/\">api.base.com/calendar/123/</a></p>\n<p>Does option 2 make sense in a FHIR world or is that discouraged?</p>",
        "id": 278309023,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1649426779
    },
    {
        "content": "<p>see <a href=\"http://hl7.org/fhir/compartmentdefinition.html\">http://hl7.org/fhir/compartmentdefinition.html</a></p>",
        "id": 278312584,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649428290
    },
    {
        "content": "<p>the compartments supported will be dependent on the server capabilities</p>",
        "id": 278312648,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649428321
    },
    {
        "content": "<p>If i'm reading this correctly, it means that there's only compartments for 5 resources, so I COULDN'T do things like</p>\n<p>/Organization/123/HealthcareService<br>\n/Schedule/873/Slot</p>\n<p>and that it's would be very unwise to do this for our implementation b/c these have to be approved at the HL7 international level, which is a big deal?</p>",
        "id": 278314250,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1649428998
    },
    {
        "content": "<p>What is the best way to GET appointments by calendar? </p>\n<p>e.g., a vaccination clinic has a calendar for 6 different rooms, all managed within one system, and I want to get the list of appointments for only Room A?</p>\n<p>The two options I've come up with so far are:<br>\n1) conceptualize the \"calendar\" as a \"location\"<br>\n2) create a custom search parameter for my implementation ?_calendar=123</p>",
        "id": 278323814,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1649433191
    },
    {
        "content": "<p>Compartments haven't been widely implemented.  They're a stylistic convention, but don't really add value.  They also presume that data exists in a hierarchy, and in some cases it doesn't.  <br>\nEach 'resource' (person, location, significant piece of equipment) can have a 'Schedule' (i.e. a calendar).  So if you want a calendar for a room, you'd be looking for the Schedule associated with that Location.</p>",
        "id": 278324200,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649433345
    },
    {
        "content": "<p>And yes, it does very much depend on what is considered a calendar in the system you're talking to.<br>\nThe calendar is typically a Schedule resource, which has slots, and those can have appointments attached to them.<br>\nAlternately you can search just based on your specific resource of interest via the Appointment?participant=resource/id</p>",
        "id": 278637294,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1649726496
    }
]