[
    {
        "content": "<p>Hi! We try to use FHIR R4 resource ImmunizationRecommendation to describe personal immunization plan for patient. So, we have some case when ImmunizationRecommendation already was created, but in new point-in-time this recommendations became not actual now. What we must do with resource ImmunizationRecommendation to describe that now patient has't some recommendations? ImmunizationRecommendation hasn't status and we can't create new resource with empty recommendation.</p>",
        "id": 275239683,
        "sender_full_name": "Artem Pavlov",
        "timestamp": 1647266614
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196402\">@AbdulMalik Shakir</span> <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span></p>",
        "id": 275240458,
        "sender_full_name": "David Pyke",
        "timestamp": 1647266930
    },
    {
        "content": "<p>You can create a recommendation where recommendation.forecastStatus as a value like \"complete\" to indicate that no additional doses are necessary for a given target disease. For example, if the recommendation was an additional dose of  Hepatitis B vaccine which the patient received, you could indicate that the Hepatitis B series is not \"complete\". Some other target diseases may require additional doses well in the future, I would imaging that it's OK to recommend a dose a year or more in the future. Not all systems may want to display this data to a provider or patient, but it is a valid forecast. Hope that helps.</p>",
        "id": 275251070,
        "sender_full_name": "Craig Newman",
        "timestamp": 1647271320
    },
    {
        "content": "<p>I can confirm what Craig is saying and add that for US based immunization registries, that we have been testing, we expect them to develop a recommendation for all routine immunizations, even if the patient has already completed the vaccination series or is too old to complete. For example, we expect immunization systems to generate a Rotavirus recommendation for all patients, including adults, even though this vaccine is only recommended to children under 1 year of age.  For this reason, for immunization registries we would expect every patient to always have a ImmunizationRecommendation for each routine immunization and then have all of them updated every time the recommendations are updated.   This would probably be the same for other systems.</p>\n<p>Hope this helps!</p>",
        "id": 275276750,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1647281688
    },
    {
        "content": "<p>If a immunization recommendation is not actionable as a request, why does it need cancellation?</p>",
        "id": 275335345,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647327122
    },
    {
        "content": "<p>Some of these overlaps/gaps between medication and immunization(and others) seem unresolved or undocumented. I think this is one of the biggest challenges we have: If we have different ways of doing the same thing, we are harming interoperability.</p>",
        "id": 275335570,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647327328
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Cancel.20current.20ImmunizationRecommendation/near/275335570\">said</a>:</p>\n<blockquote>\n<p>Some of these overlaps/gaps between medication and immunization(and others) seem unresolved or undocumented. I think this is one of the biggest challenges we have: If we have different ways of doing the same thing, we are harming interoperability.</p>\n</blockquote>\n<p>Thanks for all answers. Yes, you are right. We try to use definition or request pattern in our solutions, but we don't understand what the pattern for ImmunizationRecommendation? It seems like some template for CarePlan with request pattern resources, but in build version ImmunizationRecommendation it is a referenced resource for activity in CarePlan. </p>\n<p>In our case we want to use this resource to show for practitioner and patient actual immunization plan. So when this plan in new point in time is empty we can't to describe it. So we need cancel current ImmunizationRecommendation. Use \"complete\" status seems semantically incorrect. We can add new status in new code system?</p>\n<p>May be we need to use other resources to describe actual personal immunization plan like request pattern with lifecycle status?<br>\nAnd what the goal to use ImmunizationRecommendation? Is it use in CDS systems only?</p>",
        "id": 275338755,
        "sender_full_name": "Artem Pavlov",
        "timestamp": 1647330574
    },
    {
        "content": "<p>This is very interesting. When you put together an immunization plan, are you setting the dates for all subsequent doses? </p>\n<p>We designed the ImmunzationRecommendation originally to be used for just-in-time systems. The resource would be used to answer questions like \"What is the patient due for today?\", \"When should the patient come back for more vaccinations?\", \"Is the patient up-to-date?\". These answers would not be cached, or if they were, not for very long. Rather they would be generated everytime the answer was needed. We hadn't thought about using this to indicate exactly when a patient should return for a specific vaccination, nor about cancelling this plan.</p>",
        "id": 275403619,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1647363914
    },
    {
        "content": "<p>We still have something that is called ImmunizationRecommendation and looks like a request, quacks like a request... Of course implementers are going to use it as a request. I think we could provide much more solid guidance than we have.</p>",
        "id": 275417953,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647369619
    },
    {
        "content": "<p>Yes, agree. There needs to be documentation. When you say it looks like a request. Do you meant it looks like a request to get an immunization? Make sure I understand that correctly.</p>",
        "id": 275424915,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1647373124
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193813\">Nathan Bunker</span> <a href=\"#narrow/stream/179166-implementers/topic/Cancel.20current.20ImmunizationRecommendation/near/275403619\">said</a>:</p>\n<blockquote>\n<p>This is very interesting. When you put together an immunization plan, are you setting the dates for all subsequent doses? </p>\n<p>We designed the ImmunzationRecommendation originally to be used for just-in-time systems. The resource would be used to answer questions like \"What is the patient due for today?\", \"When should the patient come back for more vaccinations?\", \"Is the patient up-to-date?\". These answers would not be cached, or if they were, not for very long. Rather they would be generated everytime the answer was needed. We hadn't thought about using this to indicate exactly when a patient should return for a specific vaccination, nor about cancelling this plan.</p>\n</blockquote>\n<p>We develop special medical system for professional medicine (dispensary observation for employees in companies) . Every year health manger planing immunization plan for all company based on some rules to achieve collectively immunity. And we know all vaccines which need for each employe in this year. Also we know immunization period (earliest and latest date to give immunization)  for specific vaccines. For example, vaccine for influenza must be done before increased incidence in autumn. So we want to use ImmunizationRecommendation for this case. Practitioner can control immunization status for each employees. This plan will be actual all year for employee. When some immunization.recommendation will be completed, we create new resource ImmunizationRecommendation with new actual statuses for each recommendation with supporting Immunization in the past. </p>\n<p>May be it is not correct... Have you some ideas about this case?)</p>",
        "id": 275428427,
        "sender_full_name": "Artem Pavlov",
        "timestamp": 1647374774
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193813\">Nathan Bunker</span> <a href=\"#narrow/stream/179166-implementers/topic/Cancel.20current.20ImmunizationRecommendation/near/275424915\">said</a>:</p>\n<blockquote>\n<p>Yes, agree. There needs to be documentation. When you say it looks like a request. Do you meant it looks like a request to get an immunization? Make sure I understand that correctly.</p>\n</blockquote>\n<p>a FHIR Request is an authorization and/or explicit instruction to do something. In that sense, \"patient should come for second dose next week\" is a request (?). And the ImmunizationRecommendation really looks like a resource that is conveniently close to that...</p>",
        "id": 275491679,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1647426691
    },
    {
        "content": "<p>This is really helpful. The ImmunizationRecommendation was written with the idea that it would work like this: </p>\n<p>CDS Engine --&gt; Clinician Review --&gt; Vaccination Ordered</p>\n<p>The Immunization Recommendation was designed to solve the first arrow, to communicate the recommendation from CDS engine to the Clinician. Furthermore, it was designed from the perspective of public health making recommendations to those in the clinical setting, across organizational boundaries, and was not built to support clinical work flows. That may why it's causing problems as it gets used in a clinical workflow. </p>\n<p>We have  had some discussions about MedicationRequest, which shares a lot in common with ImmunizationRecommendations. How does MedicationRequest interact with CarePlan? My naïve thought was that MedicationRequest would be after the clinician reviews the recommendation and orders a specific vaccination. But the MedicationRequest can be used to create \"proposals\" so could theoretically replace ImmunizationRecommendation. </p>\n<p>This is all very interesting, any additional information you can give me would be helpful. I'm going to bring this up in discussions this week with folks from public health.</p>",
        "id": 275513242,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1647438957
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193813\">Nathan Bunker</span> <a href=\"#narrow/stream/179166-implementers/topic/Cancel.20current.20ImmunizationRecommendation/near/275513242\">said</a>:</p>\n<blockquote>\n<p>This is really helpful. The ImmunizationRecommendation was written with the idea that it would work like this: </p>\n<p>CDS Engine --&gt; Clinician Review --&gt; Vaccination Ordered</p>\n<p>The Immunization Recommendation was designed to solve the first arrow, to communicate the recommendation from CDS engine to the Clinician. Furthermore, it was designed from the perspective of public health making recommendations to those in the clinical setting, across organizational boundaries, and was not built to support clinical work flows. That may why it's causing problems as it gets used in a clinical workflow. </p>\n<p>We have  had some discussions about MedicationRequest, which shares a lot in common with ImmunizationRecommendations. How does MedicationRequest interact with CarePlan? My naïve thought was that MedicationRequest would be after the clinician reviews the recommendation and orders a specific vaccination. But the MedicationRequest can be used to create \"proposals\" so could theoretically replace ImmunizationRecommendation. </p>\n<p>This is all very interesting, any additional information you can give me would be helpful. I'm going to bring this up in discussions this week with folks from public health.</p>\n</blockquote>\n<p>In current time MedicationRequest has't some important fields to describe Immunization recommendations, for example: it is targetDisease. It may be describe with MedicationRequest.reasonCode but it looks like not correct to use. <br>\nAlso MedicationRequest has field MedicationRequest.medication (1..1) and this field is describe specific medication (Sputnik V or Pfizer/BioNTech). I think when immunization plan created we can't make choice which medication will be used. It depends on stock in medical location and patient choice too. <br>\nMay be the first arrow in your flow possible to describe with CarePlan with intent=proposal and status=draft or PlanDefinition?</p>",
        "id": 276592470,
        "sender_full_name": "Artem Pavlov",
        "timestamp": 1648199655
    },
    {
        "content": "<p>Have you looked at ImmunizationRecommendation?</p>",
        "id": 276628524,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648219398
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Cancel.20current.20ImmunizationRecommendation/near/276628524\">said</a>:</p>\n<blockquote>\n<p>Have you looked at ImmunizationRecommendation?</p>\n</blockquote>\n<p>Yes, but in the first messages we discussed that we don't understand what the pattern of this resource: definition or request pattern? About ImmunizationRecommendation was primary question)</p>",
        "id": 276836686,
        "sender_full_name": "Artem Pavlov",
        "timestamp": 1648453080
    },
    {
        "content": "<p>ImmunizationRecommendation is 'request' pattern.  It's not an 'order', but more of a recommendation.  It's always patient and time-specific.  The 'definition' side would be handled as a PlanDefinition.</p>",
        "id": 276888794,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648480635
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Cancel.20current.20ImmunizationRecommendation/near/276888794\">said</a>:</p>\n<blockquote>\n<p>ImmunizationRecommendation is 'request' pattern.  It's not an 'order', but more of a recommendation.  It's always patient and time-specific.  The 'definition' side would be handled as a PlanDefinition.</p>\n</blockquote>\n<p>Ok, thnx. So how we can to describe, that at new point in time patient hasn't recommendation or it is not actual now? But previously ImmunizationRecommendation  had recommendations and now they are cancel. Or we should create other resource like CarePlan based in ImmunizationRecommendation to manage workflow status (planned, completed and cancel)? Also in build version we saw that ImmunizationRecommendation it is referenced resource in CarePlan.plannedActivityReference, so it like as request (order) (<a href=\"https://build.fhir.org/careplan-definitions.html#CarePlan.activity.plannedActivityReference\">https://build.fhir.org/careplan-definitions.html#CarePlan.activity.plannedActivityReference</a>). Is it correct?</p>",
        "id": 277019701,
        "sender_full_name": "Artem Pavlov",
        "timestamp": 1648566720
    },
    {
        "content": "<p>ImmunizationRecommendation is set up sort of like a point-in-time decision support response.  So it's saying \"as of this date, according to algorithm A, the recommendation was B\".  It's entirely possible that two days later you'd have a different statement saying \"as of this new date, according to algorithm X, the recommendation is Y\".  The old recommendation doesn't go away.  And it's entirely possible that you're on the hook to try to satisfy both recommendations (e.g. from two different jurisdictions and you need to be able to travel to both).</p>\n<p>If you want to actually track 'completion', then yes, you'd be looking at CarePlan or MedicationRequest.</p>",
        "id": 277020343,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648566977
    },
    {
        "content": "<p>Sorry for the slow reply. What Lloyd is saying sounds correct, as far as I understand the ImmunizationRecommendation. ImmunizationRecommendation was not built to be permanently attached to a patient record but rather to be generated whenever the patient record was evaluated to see what immunizations are due next. (Some systems might cache this result for performance reasons but the recommendation must be update after a certain amount of time and definitely after additional vaccination(s) are given.) It also wasn't expected to be very specific, to identify the exact medication that should be given, but rather a class of vaccinations that was due next. (E.g. to indicate that the patient needs their next \"flu shot\" but not indicate the exact type/brand/formulation of influenza vaccination.)</p>",
        "id": 277152652,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1648650307
    }
]