[
    {
        "content": "<p>Hi all!<br>\nWe are looking at making work easier for the healthcare professionals involved in cancer processes (or pathways). What we mean with a cancer process is something that starts once there is a suspected cancer and ends with necessary follow ups after treatment are no longer needed, when patient declices further treatment or the patient dies. The use cases involve things like \"which are our current breast cancer patients\", \"which of the current breast cancer patients have started their treatment\" etc. </p>\n<p>The process we dont see as necessarily bound to an Organization, but of course is often managed by one (or several) Organizations. </p>\n<p>The process/pathway could as an example indicate where in the process the patient is, under invetigation/diagnostics, treatment, post-treatment etc. </p>\n<p>When looking at different resources for this there are some candidates:</p>\n<ul>\n<li>EpisodeOfCare - This seems to much bound to an organization, and too administrative in nature, but otherwise I can see it being used as the episode during which several encounter occur and treatment is planned</li>\n<li>CarePlan - Not sure a plan of activities that are to happen with the patient is the right approach either? Parts of the process/pathway might be goverened by a predifined plan, but not necessarily all of it. </li>\n<li>Condition - Maybe our use case should be reflected by a Condition resource representing the Cancer as a problem list item?</li>\n</ul>\n<p>Other ideas?</p>\n<p>Thanks!</p>",
        "id": 265670553,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1640083085
    },
    {
        "content": "<p>CarePlan seems the right one. This has been profiled in a set of ImplementationGuides.</p>",
        "id": 265678356,
        "sender_full_name": "John Moehrke",
        "timestamp": 1640088904
    },
    {
        "content": "<p>.. as well as Condition. EpisodeOfCare (like Encounter) acts as a 'grouper' of activities or planned activities, but given that its use is limited to one organization that may or may not prove helpful.</p>",
        "id": 265678485,
        "sender_full_name": "René Spronk",
        "timestamp": 1640089023
    },
    {
        "content": "<p>yes, many other resources will be involved.  I was just pointing out that the whole process would be best managed by a CarePlan(s).</p>",
        "id": 265678745,
        "sender_full_name": "John Moehrke",
        "timestamp": 1640089209
    }
]