[
    {
        "content": "<p>Hi,<br>\nWe are working on an implementation to allow an outside system to schedule appointments to another outside system.  This was accomplished using the flows here: <a href=\"https://www.hl7.org/fhir/appointment.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/appointment.html\">https://www.hl7.org/fhir/appointment.html</a></p>\n<p>Now we want to add two forms of cancelling an appointment:<br>\n1) If an appointment request is sent out, and still pending, cancel the pending request.<br>\nI'm not sure of the correct way to do this.  My first instinct was to send an AppointmentResponse with \"declined\" participantStatus, but found it was difficult to tell the difference between the 'cancel-pending' request and a normal request to deny a scheduled appointment.  For clarity, I'd like to use a new \"cancel-pending\" participantStatus, but maybe there is a better way I'm not seeing right now.</p>\n<p>2) If an appointment is booked, cancel the booked appointment.<br>\nMy idea for this was to send it as if it were a new appointment request, with the participantStatus \"needs-action\", but the appointment status would be \"cancelled\" instead of \"proposed\" and then follow the same flow as a new appointment request, requiring approval.</p>\n<p>I'm looking for input one way or the other.. or if someone knows of an existing spec they could point me to, or something in progress?<br>\nThanks!</p>",
        "id": 180832713,
        "sender_full_name": "Savannah Dearing",
        "timestamp": 1573825521
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 180833137,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573825818
    },
    {
        "content": "<p>You're correct in terms of the cancellation. But the pending vs booked is an internal business rule, and you should deal with it server side.<br>\nAs I'm sure there will be more reasons and different cases for different appointment types.<br>\nYou should always permit cancellations, however the effects of this will be different under different conditions.<br>\nSome might just cancel and be ok, others might cancel and still charge the patient, and could be based on time, previous cancellation history, appt type, relationship to other conditions or actions.</p>",
        "id": 180874110,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1573853483
    },
    {
        "content": "<p>Okay, so it looks like I'm on the right path for a cancel request once an appointment is booked.<br>\nGoing to think more on how cancelling a proposed appointment should be handled.</p>\n<p>Thanks!</p>",
        "id": 181010625,
        "sender_full_name": "Savannah Dearing",
        "timestamp": 1574079556
    }
]