[
    {
        "content": "<p>The NCCN once generated a FHIR IG for cancer chemotherapy order sets (<a href=\"https://simplifier.net/nccnchemotherapyorde\" target=\"_blank\" title=\"https://simplifier.net/nccnchemotherapyorde\">https://simplifier.net/nccnchemotherapyorde</a>), but I don't think any of the people involved in this project are still involved in HL7 or the NCCN (I apologize if I'm wrong). As a consequence, I think this is largely unmaintained.   Is anyone here interested in this topic?  I am currently at the HL7 WGM in Baltimore, so if you are here, I'd love to talk to you about it.</p>",
        "id": 154003808,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1538411519
    },
    {
        "content": "<p>If you have time to come to the Pharmacy Work Group - I know that there were some outstanding questions related to the Medication resources.</p>",
        "id": 154003832,
        "sender_full_name": "Melva Peters",
        "timestamp": 1538415394
    },
    {
        "content": "<p>Where is that?</p>",
        "id": 154003838,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1538415746
    },
    {
        "content": "<p>Hello Kevin. My Apologies I missed this post - I was in the care planning &amp; management track last weekend. I work for Elsevier and YES we are very much interested in participating ! We already have a library of order sets and we are working with the care planing &amp;  management track on serving them as FHIR plan definitions.  It will be of our keen interest in collaborating for Chemotherapy Order Sets   ... Please include me in any discussions that you may have in this regards (given below my contact details)... Happy to collaborate and contribute !!</p>\n<p>Thanks,<br>\nSunish Vengathattil<br>\nElsevier Clinical Solutions<br>\n<a href=\"mailto:s.vengathattil@elsevier.com\" title=\"mailto:s.vengathattil@elsevier.com\">s.vengathattil@elsevier.com</a><br>\n215 713 8859</p>",
        "id": 154003872,
        "sender_full_name": "Sunish Vengathattil | Elsevier",
        "timestamp": 1538416871
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196989\">@Sunish Vengathattil | Elsevier</span> are you at the HL7 conference?</p>",
        "id": 154003912,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1538417608
    },
    {
        "content": "<p>I was there on Saturday. Unfortunately, I had to make it a short trip...</p>",
        "id": 154003924,
        "sender_full_name": "Sunish Vengathattil | Elsevier",
        "timestamp": 1538417806
    },
    {
        "content": "<p>Ah that's unfortunate, I was here then too.  Wish I had brought it up earlier!</p>",
        "id": 154003926,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1538417848
    },
    {
        "content": "<p>I shall be available If you want to catchup sometime offline after the conference... Please feel free to let me know...  Or I shall reach out to you during the next one.</p>",
        "id": 154003940,
        "sender_full_name": "Sunish Vengathattil | Elsevier",
        "timestamp": 1538418347
    },
    {
        "content": "<p>We actually had a separate SIG working on this for a few connectathons. <span class=\"user-mention\" data-user-id=\"191334\">@Marten Smits</span> might still know what happened there.</p>",
        "id": 154004250,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1538440643
    },
    {
        "content": "<p>And <span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span> was involved in building the software that turned their internal knowledge database into FHIR.</p>",
        "id": 154004251,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1538440706
    },
    {
        "content": "<p>But indeed, I think none of the participants (like Peter Lamb) still work at NCCN anymore.</p>",
        "id": 154004252,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1538440726
    },
    {
        "content": "<p>The SIG for this specific topic has been closed, because the people at NCCN who were involved left NCCN. I have no idea what the current status of the NCCN IG is, and if it is still being maintained. Maybe <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> knows more.</p>",
        "id": 154004352,
        "sender_full_name": "Marten Smits",
        "timestamp": 1538477206
    },
    {
        "content": "<p>Yeah, I'm no longer involved in that work but am personally still interested in it.  Last I heard they were still producing and offering the order templates (even if they stopped maintaining/developing the formal implementation guide).  It seemed like there was enough interest to start the SIG...too bad it didn't work out (yet).  I know folks like <span class=\"user-mention\" data-user-id=\"191791\">@Daniel Lanphear</span> were tracking this pretty closely as well.</p>",
        "id": 154004636,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1538490880
    },
    {
        "content": "<p>FWIW, <span class=\"user-mention\" data-user-id=\"191791\">@Daniel Lanphear</span>  works for me, so his interests are also mine in this case.</p>",
        "id": 154004695,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1538494637
    }
]