[
    {
        "content": "<p>On the FHIR-I call today, we agreed to take <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15879\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15879\">GF#15879</a> here for discussion. The proposal is to make the \"canonical\" data type complex so that in addition to a URL, it's possible to have a 'display'. The use-case is that lots of resources point to protocols, questionnaires and other things that have canonical URLs. Resolution of the URL to find a name isn't always practical. In messaging/document environments, resolution might not be possible. In other environments, security policies might prohibit resolution. And in all cases, it's a performance imposition. This is NOT a small change tooling-wise. (Changing to use canonical in preparation for the ballot was already painful.) Doing this would mean that the infrastructure portion of FHIR would have to return to ballot in the Sept. cycle, though we had already planned for that as a possibility.</p>\n<p>We would like to hear from a broader set of implementers: Do you have a need for \"display\" when dealing with references to protocols, questionnaires, value sets, profiles, templates, implementation guides, etc. or are you comfortable with needing to resolve the references in order to determine a name.</p>",
        "id": 153953742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524516820
    },
    {
        "content": "<p>I'd support this change -  I never understood why \"canonical\" was implemented as a simple data type in the first place.</p>",
        "id": 153953745,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1524518422
    },
    {
        "content": "<p>In the FHIR tooling, i resolve all canonicals on the fly. I'm sympathetic to the problem, but the change process is deeply problematic. Changing this stuff burns so many weeks of my time, and not just my time.</p>",
        "id": 153953752,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524521464
    },
    {
        "content": "<p>it's pretty concerning that it's only coming up now. We've been using URL for a long time</p>",
        "id": 153953753,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524521582
    },
    {
        "content": "<p>The problem manifests most strongly in those places that were previously Reference that were only recently updated.  Most places that were only URLs were places where looking up was likely to happen all the time anyhow.  But canonical is now (appropriately) appearing in places where you often <em>don't</em> want to resolve.</p>",
        "id": 153953772,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524524844
    },
    {
        "content": "<p>I'm very sympathetic to the amount of work involved here.  But we're about to lock this as normative, and I think if we don't fix this now, we're going to be kicking ourselves for a long time.</p>",
        "id": 153953775,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524524932
    },
    {
        "content": "<p>Can it be resolved by leaving canonical as is, and defining a standard extension for \"canonical display name\"?</p>",
        "id": 153953778,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1524525840
    },
    {
        "content": "<p>That's an option.  However, it creates a challenge if we expect it to be present most of the time.  If we had identified this as a change after normative, then we'd have no choice but to take that approach.  This time we do have a choice.  My main concern is that the implementers most likely to need display are the \"simple\" implementers - who are the ones least likely to see an extension.</p>",
        "id": 153953787,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524531250
    },
    {
        "content": "<p>When updating the dotnet client to the latest R4 build I found that it was a pretty even mix of places where the uri was changed to a canonical, and also reference to canonical.<br>\nSo painful either way, just a shame that we had all this pain to put the first one in without the other at the same time.</p>",
        "id": 153953796,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1524538786
    },
    {
        "content": "<p>The impact didn't become clear to me until updating IGs - which of course happened after the original change had been propagated :(</p>",
        "id": 153953797,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524539786
    }
]