[
    {
        "content": "<p>Hi, we have a requirement to support terminology catalogs (German EBM Catalogs) in our solution. Each  catalog can have multiple business versions to be supported at the same time. How can we achieve this behavior catalogs being canonical terminology resources? I found the following example in Fhir Site.</p>\n<p>A value set is posted to a server (POST [base]/ValueSet) with ValueSet.url = \"<a href=\"http://acme.com/valuesets/example\">http://acme.com/valuesets/example</a>\". This is identified as the 1st version of the value set (ValueSet.version = 1). When the server gets it, it assigns an identity e.g. <a href=\"http://ValueSet.id\">ValueSet.id</a> = x1, and ValueSet.meta.versionId = 1. Later, another user creates a revised version of the value set, and this is called version 2. This time, as well as supporting this new version 2, there are production systems still using version 1, and both need to be valid on the value set server. So a new value set is created on the server (POST [base]/ValueSet) and is assigned the identiity 'x2'.</p>\n<p>Now, there are two different value sets, both with URL \"<a href=\"http://acme.com/valuesets/example\">http://acme.com/valuesets/example</a>\". One has <a href=\"http://ValueSet.id\">ValueSet.id</a> = x1, ValueSet.version = 1 and ValueSet.meta.versionId = 1 and the other has <a href=\"http://ValueSet.id\">ValueSet.id</a> = x2, ValueSet.version = 2 and ValueSet.meta.versionId = 1</p>\n<p>In this example,  'example' resource has two business versions.  I am confused to understand this. Does it mean we shall always query/read always using 'id' (GET [base]/ValueSet/x1) ? Why this pattern is not strictly followed for conformance resources in the fhir specification? </p>\n<p>Is it a valid request (GET [base]/ValueSet/example)? If yes, which business version shall be obtained in the above example?</p>\n<p>Thanks in advance<br>\nShankar</p>",
        "id": 203959109,
        "sender_full_name": "Shankar",
        "timestamp": 1594821818
    },
    {
        "content": "<p>If you do a straight read, it'll be driven by the 'id', not the canonical URL.  If you do a search filtering by canonical URL, you'll get both.  If you have a canonical reference and want to know how the system will resolve between the two, it'll look at the .version element and if it can figure out a precedence between the two, it'll give the most recent.  If it can't, behavior is undefined.</p>",
        "id": 203984570,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594833309
    },
    {
        "content": "<p>is it a good idea in that case to mandate the \"id\" field for canonical resources?</p>",
        "id": 204045152,
        "sender_full_name": "Shankar",
        "timestamp": 1594875558
    },
    {
        "content": "<p>You can't - because different servers use different styles of ids - and also because there are legitimate reasons to have multiple instances with the same canonical URL on the same server (i.e. different versions).</p>",
        "id": 204045602,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594876104
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> when you say different versions, do you mean record version or business version?</p>",
        "id": 204069772,
        "sender_full_name": "Signe Hejgaard Kristoffersen",
        "timestamp": 1594897545
    },
    {
        "content": "<p>Business version</p>",
        "id": 204081766,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594905571
    },
    {
        "content": "<p>Okay. Just tried creating two CodeSystems with the same url but different versions at <a href=\"http://hapi.fhir.org\">hapi.fhir.org</a>, butI got the error: \"Can not create multiple CodeSystem resources with CodeSystem.url \\\"http://provdennetest.dk\\\", already have one with resource ID: CodeSystem/xxx\" for the second instance. But this should work then?</p>",
        "id": 204082653,
        "sender_full_name": "Signe Hejgaard Kristoffersen",
        "timestamp": 1594905991
    },
    {
        "content": "<p>Servers are always allowed to enforce their own business rules, but yes, a server that supported multiple instances with the same canonical URL but different 'version' elements would be fully conformant.</p>",
        "id": 204083788,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594906461
    }
]