[
    {
        "content": "<p>We've gotten the request to align our <a href=\"http://CapabilityStatement.software.name\">CapabilityStatement.software.name</a> values with the products listed in the <a href=\"https://chpl.healthit.gov/\">CHPL</a>.  Our issue is that we have one CapabilityStatement (i.e. one FHIR server) for our entire suite of products, and CapabilityStatement.software is 0..1.  I submitted <a href=\"http://jira.hl7.org/browse/FHIR-28909\">FHIR#28909</a> to open up that cardinality, but I was wondering if folks had other options.  <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Would a US Core extension be an option?  This isn't required for certification, but it sounds like it could be useful until R5 (assuming we open up the cardinality on software).</p>",
        "id": 212307833,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1601908690
    },
    {
        "content": "<p>The name is a string - if you want to say \"All xxx products\", you can</p>",
        "id": 212309747,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601909398
    },
    {
        "content": "<p>For CHPL matching, we'd probably need a delimited string.  So yeah, we could comma delimit it, but... gross.  The request we got was basically to use CapabilityStatement.software for discrete matching against another (non-FHIR) system where the composite \"identifier\" is the product name and version.</p>",
        "id": 212317443,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1601912479
    },
    {
        "content": "<p>CapabilityStatement.software isn't expected to be computable.  The intention is to use it to advertise the capabilities of a shrink-wrapped product.  The typical situation certainly isn't that multiple products are guaranteed to share the exact same behavior.  And if they did, they'd presumably still each host their own statement.  So I don't see shifting the cardinality as a likely thing.</p>",
        "id": 212321983,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601914386
    },
    {
        "content": "<p>if you want an extension log a tracker,  I have not used Capstatements for defining software requirments so I can't really comment on the issue.</p>",
        "id": 212334119,
        "sender_full_name": "Eric Haas",
        "timestamp": 1601920555
    },
    {
        "content": "<p>I bet Cooper's situation of a single FHIR server (one CapabilityStatement) covering multiple 'shrink-wrapped' products is quite common. Call it a multi pack'. Extension on us core is fine for now.</p>",
        "id": 212334360,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1601920671
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I think the problem is defining what exactly a software product is.  The CapabilityStatement currently seems to think that the overall EHR is the product (using EHR as an example).  However within an EHR there are multiple sub-products like scheduling, billing, inpatient, outpatient, etc.).  Some product listings track at the sub-product level (specifically, the ONC's CHPL).</p>\n<p>I'm fine with a US Core extension for now, but I do think loosening the cardinality on CapabilityStatement.software is a good thing to consider, as it enables representing the different real-world scenarios.</p>\n<p>Also, to my knowledge we don't use shrink-wrap for our products.  It's mostly electronic delivery these days.</p>",
        "id": 212345562,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1601926006
    },
    {
        "content": "<p>I created <a href=\"http://jira.hl7.org/browse/FHIR-28935\">FHIR#28935</a>  for the US Core extension.</p>",
        "id": 212346681,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1601926679
    },
    {
        "content": "<p>I assume that the pattern of having multiple software products represented by a single endpoint is going to be quite common. Do the CapabilityStatement.instantiates and/or CapabilityStatement.imports fields already cover this problem?</p>",
        "id": 212422204,
        "sender_full_name": "Matt Mayer",
        "timestamp": 1601988607
    },
    {
        "content": "<p>If you're talking about a specific endpoint, then you're generally not using 'software' at all.</p>",
        "id": 212436500,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601994885
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I don't follow your comment about not using software on a specific endpoint.  Can you elaborate?</p>",
        "id": 212439248,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1601996037
    },
    {
        "content": "<p>If you're talking about a specific endpoint, then you'll have CapabilityStatement.implementation.  While you're <em>allowed</em> to also include CapabilityStatement.software, it's not necessary.  CapabilityStatement.software is primarily used when CapabilityStatement.kind is 'capability', not 'instance'.</p>",
        "id": 212444852,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601998167
    },
    {
        "content": "<p>CapabilityStatement.implementation is also all 0..1, so it also doesn't let you specify that your FHIR Server implementation is serving data from multiple products.  But I think software makes more sense than implementation for what we are trying to express.  The software would be (name = Epic Inpatient, version = May 2020) and (name = Epic Outpatient, version = May 2020) (since the implementation covers both products), and the implementation would be (description = instance of Epic software deployed at Healthcare System A).  Since the single implementation supports two software products, software needs to be 0..*.</p>",
        "id": 212613196,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1602101508
    },
    {
        "content": "<p>For <a href=\"http://jira.hl7.org/browse/FHIR-28909\">FHIR#28909</a>, were there reasons other than making a normative change that FHIR-I had for rejecting the change?  The  recommendation was to make a standard extension, which seems like a bad precedent.  \"Replacing\" fields with an extension if we don't want to make improvements to normative content seems like a slippery slope that could lead to a future state where we just use extensions for everything and ignore the base (effectively deprecated) base resource properties (I'm exaggerating for effect).</p>",
        "id": 258957648,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1635168064
    },
    {
        "content": "<p>Locking into backward-compatibility has benefits and draw-backs.  FMG is looking at how we can minimize the circumstances like this (non-repeating element turns out to need repetitions) going forward.  However, there's not much we can do about resources that are already normative.</p>",
        "id": 258965053,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635171343
    }
]