[
    {
        "content": "<p>Hi all,<br>\nWe are defining CapabilityStatement declarations for a FHIR server.<br>\nWe are having some trouble with declarations of profiles for contained resources (if necessary at all) .<br>\n1) Do contained resource profiles need to be declared at all under CapabilityStatement.profile (STU3) or CapabilityStatement.rest.resource.supportedProfile (R4)? Or is it sufficient to declare them in the profile that's referenced by the parent resource's CapabilityStatement.rest.resource.profile?<br>\n2) Is there a way to declare allowed chained search params within CapabilityStatement.rest.resource.searchParam? Or must it be defined via a separate SearchParameter resource? (which only seems to be possible in R4, not in STU3 -- is this correct?)<br>\nThank you!</p>",
        "id": 154007370,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1539179034
    },
    {
        "content": "<p>1. There isn't strictly a need to declare profiles at all.  The profile for contained resources would typically be asserted on the element that references the contained resource, though if you have contained resources that are referencing the parent, you'd have to slice the <code>contained</code> element and declare your profiles there.  How much profiling you do is really up to you.<br>\n2. You define a separate SearchParameter.  It should be possible in R3 - where are you running into trouble?</p>",
        "id": 154007406,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539182942
    },
    {
        "content": "<p>Lloyd, for the #2, if I am trying to search for DiagnosticReport profile and I using patient id as a search parameter, do I  still need to define Patient ID in a separate SearchParameter resource?</p>",
        "id": 154009109,
        "sender_full_name": "Natalya Pogrebetsky",
        "timestamp": 1539615616
    },
    {
        "content": "<p>DiagnosticReport already defines a standard patient search criteria</p>",
        "id": 154009130,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539616886
    },
    {
        "content": "<p>If you're wanting a chained search criteria, you'll need to define that.</p>",
        "id": 154009132,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539616918
    },
    {
        "content": "<p>If we're looking to enable DiagnosticReport search by the search parameter \"patient.identifier=http://something.../hcn|39283483\", don't we need to separately define the chained search? since DiagnosticReport search param \"patient\" is the entire resource itself, not the patient.identifer.</p>",
        "id": 154009139,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1539617301
    },
    {
        "content": "<p>Yes.  Patient.identifier would.  <a href=\"http://Patient.id\" target=\"_blank\" title=\"http://Patient.id\">Patient.id</a> would not - as that's queriable using the patient search criteria.</p>",
        "id": 154009146,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539618156
    },
    {
        "content": "<p>You meant Patient._id?</p>",
        "id": 154010779,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1540136304
    },
    {
        "content": "<p>y</p>",
        "id": 154010818,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540151495
    }
]