[
    {
        "content": "<p>So we are looking at an architecture on the national level where a consuming application is interested in finding available organizations that offers the right type of medical service and then find out if that organization has the capability to support a specific IG (e.g. Scheduling). <br>\nThe first question we can answer through a national medical services catalouge giving us the organizational identifier for further inquiry. <br>\nThe second question is somewhat tricky though. First thought was to establish a national capability statement registry, but the Capability Statement only expresses the capability of a FHIR server, not an organization. The other option is to just provide the link between the organizational identifier and a FHIR server endpoint in a registry, but we still have the same problem that the FHIR server endpoint only can provide Capability Statements for the server and not the organizations it supports.<br>\nIs the only option here to provide virtual endpoint for each organization a FHIR server supports? <br>\nE.g. for organization 123: endpoint.server/fhir/123/CapabilityStatement<br>\nIf I understand correctly this is how a similar problem is handled in the UK with the Spine solution.</p>\n<p>Is there no way in FHIR to express an organizations capabilities?</p>",
        "id": 253620362,
        "sender_full_name": "Arvid Thunholm",
        "timestamp": 1631814000
    },
    {
        "content": "<p>So your issue is that a single endpoint might support an IG for some organizations for whom it manages data, but not others?</p>",
        "id": 253622370,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631814806
    },
    {
        "content": "<p>Yes, or several IGs, for which some are valid for certain organizations behind the endpoint.</p>",
        "id": 253701642,
        "sender_full_name": "Arvid Thunholm",
        "timestamp": 1631863514
    },
    {
        "content": "<p>So the data you hold for some organizations, you'll enforce conformance with IG profiles, but the data you host for other organizations, you won't?  At the moment, there's no capability to express CapabilityStatements for a single endpoint on a \"per organization\" basis.  You could look at using extensions, but few clients would recognize them.</p>",
        "id": 253742319,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631885606
    }
]