[
    {
        "content": "<p>Hi All, I am currently working on creating a sample CapabilityStatement and I am considering STU 3.0.1. To make progress on it, I need few clarifications on CapabilityStatement resource (<a href=\"http://hl7.org/fhir/capabilitystatement.html\" target=\"_blank\" title=\"http://hl7.org/fhir/capabilitystatement.html\">http://hl7.org/fhir/capabilitystatement.html</a>). May I request the group to help me understand the following points:<br>\n1. How to structure 'CapabilityStatement.rest' ? Is it recommended that per 'server' there will be only one 'rest' element ('CapabilityStatement.rest') and all the resources ('CapabilityStatement.rest.resource') exposed by the server will be residing under that element ? According to my understanding, there will be one 'CapabilityStatement.rest' element per api (resource) that the server is exposing. For an example if my server is exposing 'Patient' and 'ExplanationOfBenefit' as to different rest interfaces, then in my CapabilityStatement, there will be two 'CapabilityStatement.rest' elements and each of them should contain a resource (Patient/EOB). However looking at the samples (<a href=\"http://hl7.org/fhir/capabilitystatement-examples.html\" target=\"_blank\" title=\"http://hl7.org/fhir/capabilitystatement-examples.html\">http://hl7.org/fhir/capabilitystatement-examples.html</a>), it seems like all the resources will go under one rest element.  <br>\n2. If the model doesn't support dedicated 'rest' element per resource in the CapabilityStatement, then, :<br>\n        1. How can I find out a custom operation which is applied to a particular resource by looking at the CapabilityStatement without reading the corresponding OperationDefination for that resource? <br>\n        2. From the 'CapabilityStatement' how would I know that the server is implementing varying subset of common search paramaters (e.g.: '_id') for different rest interfaces ?<br>\n3. From the 'CapabilityStatement' how would I know if the server is implementing http/https for the 'rest' interface? I can see 'CapabilityStatement.messaging.endpoint.protocol' has one.<br>\n4. In the 'CapabilityStatement.rest.security' how would I specify urls to generate 'auth_code' or 'access_token'?<br>\n5. For the search paramater (CapabilityStatement.rest.resource.searchParam), how would I know whether a paramater is optional/mandatory? rather cardinality ?<br>\n6. I can see the element 'CapabilityStatement.profile', is there any way to to understand the custom extensions applied? I can see the cardinality is 0..*. I guess we should add all the custom extensions here. But just like we are explicitly mentioning the search paramaters for a resource, can we also provide an option to detail out (e.g.: name, description, path, cardinality etc.) the custom extensions here ?</p>",
        "id": 153885619,
        "sender_full_name": "Shovan",
        "timestamp": 1492937203
    },
    {
        "content": "<p>1. The only time you'll have multiple 'rest' elements is to describe both your client and server capabilities (some systems will act as both)<br>\n2.1. The only way to understand an operation you're not familiar with is to retrieve the OperationDefinition<br>\n2.2. In principle each resource should list every search parameter it supports, including _id<br>\n2.3. I think the presumption is what you use as the base url - so if you query <a href=\"https://somewhere.org/capabilities\" target=\"_blank\" title=\"https://somewhere.org/capabilities\">https://somewhere.org/capabilities</a> and you get a response, then it supports https.  But I'm not positive on this one.<br>\n2.4. I don't think this is standardized<br>\n2.5. Not yet standardized.  Typically the cardinality of search parameters is based on what other search parameters are required - and we found that this gets really complicated fast, so for now, we've left it for descriptive text<br>\n2.6. CapabilityStatement.profile indicates what profiles you can search by using the profile tag.  It has nothing to do with what extensions are supported.  To see those, look at CapabilityStatement.rest.resource.profile and retrieve the StructureDefinition </p>",
        "id": 153885632,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492961218
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I have few more quires on top of your clarification<br>\n1. It sounds like the cardinality is 0..2 for rest. Is there any specific reason we shouldn't expose one rest interface per resource?<br>\n2. I have worked on couple of OperationDefinition, however I was wondering if I could get hold of the Operation applicable to resource type from the CapabilityStatement directly other than referning to the OperationDefinition.<br>\n3. What if I want read it the details from the capabilityStatement directly ( just like how it is structured for message) other than manupulating it from url<br>\n4. Any plan to add that in the capabilityStatement defination ?<br>\n5. Any plan to add that in the capabilityStatement definition ?<br>\n6. Thanks.. got it :)</p>",
        "id": 153885708,
        "sender_full_name": "Shovan",
        "timestamp": 1493033657
    },
    {
        "content": "<p>1. Cardinality is 0..2.  There are some tooling issues with us being that explicit.  The spec currently says you can only have one 'server' and one 'client' REST interface and I can't imagine why you'd want one per resource.</p>",
        "id": 153885742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493045427
    },
    {
        "content": "<p>2. You can get the name used and the URL, but for anything else, you'll need the CapabilityStatement</p>",
        "id": 153885743,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493045471
    },
    {
        "content": "<p>3. Not really following the question</p>",
        "id": 153885744,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493045514
    },
    {
        "content": "<p>4. No - there's too many different ways for security to be done, so this would likely be extensions space.  That said, you're free to submit a change request and make your case for adding it to core.</p>",
        "id": 153885745,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493045566
    },
    {
        "content": "<p>5. CapabilityStatement is already one of the most complex resources we have, so doubtful.  However, feel free to come up with a proposal you think is workable and reflects what systems would actually need.</p>",
        "id": 153885746,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493045628
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> for your comments and suggestions . this was very helpful. I will reaise task on # 2,4, 5</p>",
        "id": 153886036,
        "sender_full_name": "Shovan",
        "timestamp": 1493167243
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nCapabilityStatement.acceptUnknown= element|extension|no|both<br>\nIt means application can accept unknown elements. But writing any data element which is not in FHIR is done by \"extension\".  Then what this \"element\" represents here in case of acceptUnknown. Not able to understand meaning or purpose of \"element\".</p>",
        "id": 154011760,
        "sender_full_name": "Aditya Joshi",
        "timestamp": 1540374889
    },
    {
        "content": "<p>see <a href=\"http://hl7.org/fhir/codesystem-unknown-content-code.html#unknown-content-code-elements\" target=\"_blank\" title=\"http://hl7.org/fhir/codesystem-unknown-content-code.html#unknown-content-code-elements\">http://hl7.org/fhir/codesystem-unknown-content-code.html#unknown-content-code-elements</a>:</p>\n<blockquote>\n<p>The application accepts unknown elements, but not unknown extensions.</p>\n</blockquote>",
        "id": 154011810,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1540385694
    },
    {
        "content": "<p>different versions</p>",
        "id": 154011899,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1540395097
    },
    {
        "content": "<p>It's a statement of forward compatibility.  If you say you accept unknown elements then if new elements are added in a future version of the resource, you won't reject the instance because you don't recognize those elements.   Note that this element was dropped from CapabilityStatement in R4.</p>",
        "id": 154012068,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540439651
    },
    {
        "content": "<p>I am exploring how to use CapabilityStatement to express the capabilities of FHIR-capable systems that are defined beyond the FHIR spec. A concrete example would be a FHIR R4 Server that is also a PCHA Continua compliant server (Continua CDG H.812.5 profiles the use of FHIR thereby defining Continua Capabilities). In this context I am wondering:</p>\n<p>Q1.When we have a FHIR Server can CapabilityStatement be used to also describe non-FHIR capabilities of the Server (e.g. Continua-defined capabilities)?<br>\nQ2. If the answer to Q1 is \"yes\", do I need 2 instances of CapabilityStatement (one for FHIR caps &amp; one for Continua caps) or can I use just one?<br>\nQ3. Can CapabilityStatement be used to describe capability of a Server irrespective of whether it’s a native FHIR Server or not (e.g. a legacy system with a FHIR façade)?<br>\nQ4. The last note of <a href=\"http://hl7.org/fhir/capabilitystatement.html\" target=\"_blank\" title=\"http://hl7.org/fhir/capabilitystatement.html\">http://hl7.org/fhir/capabilitystatement.html</a> says \"Other service-based use of resources: Due to the variability of these services, the CapabilityStatement resource does not attempt to describe service-based use of resources. The various service specifications will need to describe this usage in their own way.\". It looks like this could be relevant info to answer some of the previous questions. However I don't understand the statement (I guess because I don't understand the concept \"service-based use of resources\"). Could someone clarify the statement?<br>\nThanks!!!</p>",
        "id": 159530848,
        "sender_full_name": "Javier Espina",
        "timestamp": 1551285802
    },
    {
        "content": "<p>Technically you <em>can</em> use CapabilityStatement to do pretty much anything with extensions.  One of the challenges we're going to be playing with in R5 is how to reasonably allow the specification of detailed behaviors via CapabilityStatement such that it doesn't grow bigger than it is and we don't have to define new resources for every new type of capability we might want to describe.  Not fully landed yet though.  Experimentation and feedback are certainly welcome.</p>",
        "id": 159532209,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551286724
    },
    {
        "content": "<p>it possible for Continua to paste a particular capability statement, and say in the description that it includes particular obligations in regard to processing. Then, if you reference it in CapabilityStatement.instantiates, then you are claiming that you implement those obligations. To me, this sounds like the answer to your question</p>",
        "id": 159704212,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551440646
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>: thank you for your quick replies. They've shed some light. I'll need to look into this in further detail.</p>",
        "id": 160115250,
        "sender_full_name": "Javier Espina",
        "timestamp": 1551892924
    },
    {
        "content": "<p>and I see I wrote \"Continua to paste a particular \" when I should've written \"Continua to publish a particular \"</p>",
        "id": 160137351,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551908629
    },
    {
        "content": "<p>I have a chained search that is used to return values from a document bundle. Something like this:</p>\n<p>Composition?subject.identifier=:nhs&amp;subject.birthdate=:birthdate&amp;section=:section</p>\n<p>I need a capability statement to support this search. Would something like this:</p>\n<p>\"searchParam\": [<br>\n            {<br>\n              \"name\": \"section\",<br>\n              \"definition\": \"<a href=\"http://hl7.org/fhir/SearchParameter/Composition-section\" target=\"_blank\" title=\"http://hl7.org/fhir/SearchParameter/Composition-section\">http://hl7.org/fhir/SearchParameter/Composition-section</a>\",<br>\n              \"type\": \"token\",<br>\n              \"documentation\": \"Classification of section (recommended)\"<br>\n            },<br>\n            {<br>\n              \"name\": \"subject\",<br>\n              \"definition\": \"<a href=\"http://hl7.org/fhir/SearchParameter/Composition-subject\" target=\"_blank\" title=\"http://hl7.org/fhir/SearchParameter/Composition-subject\">http://hl7.org/fhir/SearchParameter/Composition-subject</a>\",<br>\n              \"type\": \"reference\",<br>\n              \"documentation\": \"Who and/or what the composition is about\"<br>\n            }<br>\n          ]<br>\n        },</p>\n<p>be suitable ? Not sure if I need to include serchparam for Patient to:</p>\n<p>{<br>\n          \"type\": \"Patient\",<br>\n          \"interaction\": [<br>\n            {<br>\n              \"code\": \"search-type\"<br>\n            }<br>\n            ],<br>\n          \"searchParam\": [<br>\n            {<br>\n              \"name\": \"identifier\",<br>\n              \"definition\": \"<a href=\"http://hl7.org/fhir/SearchParameter/Patient-identifier\" target=\"_blank\" title=\"http://hl7.org/fhir/SearchParameter/Patient-identifier\">http://hl7.org/fhir/SearchParameter/Patient-identifier</a>\",<br>\n              \"type\": \"token\",<br>\n              \"documentation\": \"A patient identifier\"<br>\n            },<br>\n            {<br>\n              \"name\": \"birthdate\",<br>\n              \"definition\": \"<a href=\"http://hl7.org/fhir/SearchParameter/individual-birthdate\" target=\"_blank\" title=\"http://hl7.org/fhir/SearchParameter/individual-birthdate\">http://hl7.org/fhir/SearchParameter/individual-birthdate</a>\",<br>\n              \"type\": \"date\",<br>\n              \"documentation\": \"Multiple Resources: \\r\\n\\r\\n* <a href=\"http://relatedperson.html\" target=\"_blank\" title=\"http://relatedperson.html\">RelatedPerson</a>: The Related Person's date of birth\\r\\n* <a href=\"http://person.html\" target=\"_blank\" title=\"http://person.html\">Person</a>: The person's date of birth\\r\\n* <a href=\"http://patient.html\" target=\"_blank\" title=\"http://patient.html\">Patient</a>: The patient's date of birth\"<br>\n            }<br>\n          ]<br>\n        }</p>\n<p>or is there a way to define a searchparam for chained searches ?</p>\n<p>Cheers</p>",
        "id": 171681066,
        "sender_full_name": "Dave Henderson",
        "timestamp": 1564052332
    },
    {
        "content": "<p>You'll actually need to point to your own system-specific SearchParameter instances which will have derivedFrom links to the original HL7 parameter, but will also list the specific chaining paths you support.</p>",
        "id": 171688584,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564059567
    },
    {
        "content": "<p>Look at US Core ig this done.</p>",
        "id": 171714792,
        "sender_full_name": "Eric Haas",
        "timestamp": 1564079288
    },
    {
        "content": "<p>I also overloaded the expectation extension on search parameter for implementation guide purposes</p>",
        "id": 171714857,
        "sender_full_name": "Eric Haas",
        "timestamp": 1564079341
    },
    {
        "content": "<p>Go the question way up too I don’t understand what cardinality has to do with search parameters.</p>",
        "id": 171714916,
        "sender_full_name": "Eric Haas",
        "timestamp": 1564079386
    },
    {
        "content": "<p>I think the expectation extension should be used there as well</p>",
        "id": 171715010,
        "sender_full_name": "Eric Haas",
        "timestamp": 1564079420
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  and <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> for pointers. I'll take a look at both options.</p>",
        "id": 171759412,
        "sender_full_name": "Dave Henderson",
        "timestamp": 1564132683
    },
    {
        "content": "<p>FHIR-I have been discussing re-working the trial use portions of CapabilityStatement in R5. I've published a rough draft of what that might look like - see <a href=\"#narrow/stream/179280-fhir.2Finfrastructure-wg/topic/Rework.20of.20CapabilityStatement\">https://chat.fhir.org/#narrow/stream/179280-fhir.2Finfrastructure-wg/topic/Rework.20of.20CapabilityStatement</a> for discussion</p>",
        "id": 210904782,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600795975
    },
    {
        "content": "<p>Any tool to create CapabilityStatement instance with html content?</p>",
        "id": 256406942,
        "sender_full_name": "Vivek",
        "timestamp": 1633525472
    },
    {
        "content": "<p>Can you explain more what you're wanting to do <span class=\"user-mention\" data-user-id=\"197718\">@Vivek</span> ?</p>",
        "id": 256411568,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633527187
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197718\">@Vivek</span> , Looking forward to hear what you are looking for. </p>\n<p>If it is a tool that can help you create a CapabilityStatement from scratch without having to text/hand edit json/xml, there is a python/Jinja tool out there that can take an xlsx file and convert it to a CapabilityStatement with text.div narrative (html content). All you have to do is fill out the included workbook spreadsheets. I have a version of this locally that I could share, but <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> (whom I believe built it) may know where a more recent version is available.<br>\nI have further extended those scripts such that it can take an already existing CapabilityStatement and create a nicely formatted text.div narrative. I am currently working on merging these two together (xslx input script and CapabilityStatement json script) so it is all handled in one tool.</p>\n<p>I am also interested in how I can make this more available to the community at large. This seems like a good area of common need across all IGs and implementations that do not have specialized CapabilityStatement narrative requirements.</p>",
        "id": 256425380,
        "sender_full_name": "Corey Spears",
        "timestamp": 1633532338
    },
    {
        "content": "<p>I have made updates to it as well.  I have not had a chance to look at <span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span>  changes.  I too would like to make it more available though.</p>",
        "id": 256444503,
        "sender_full_name": "Eric Haas",
        "timestamp": 1633539027
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> This is exactly what I want. Can you please share the github location for this utility?</p>",
        "id": 256561537,
        "sender_full_name": "Vivek",
        "timestamp": 1633606104
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I want to create a rich human readable CapabilityStatement instance.</p>",
        "id": 256562718,
        "sender_full_name": "Vivek",
        "timestamp": 1633606723
    },
    {
        "content": "<p>There's a default narrative generator for CapabilityStatement that exposes most stuff.  There's also a transform I use <a href=\"https://github.com/HL7/fhir/blob/master/source/capabilitystatement/capabilitystatementNarrative.xslt\">here</a> that I think creates slightly better narrative.</p>",
        "id": 256576598,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633613155
    },
    {
        "content": "<p><a href=\"https://github.com/Healthedata1/MyBinder/blob/master/CapStatement/Narrative_generator.ipynb\">https://github.com/Healthedata1/MyBinder/blob/master/CapStatement/Narrative_generator.ipynb</a>  will take a capability statement and create a pretty narrative.  also available as notebook file: <a href=\"https://hub.gke2.mybinder.org/user/healthedata1-mybinder-4wcdenjg/lab/tree/CapStatement\">https://hub.gke2.mybinder.org/user/healthedata1-mybinder-4wcdenjg/lab/tree/CapStatement</a></p>\n<p>still very much alpha and not merged with Cory's features.</p>",
        "id": 256608358,
        "sender_full_name": "Eric Haas",
        "timestamp": 1633624392
    },
    {
        "content": "<p>I finally had the opportunity to put my additions up in a github repo: <a href=\"https://github.com/cspears-mitre/CapStatement\">https://github.com/cspears-mitre/CapStatement</a></p>\n<p>There are 2 scripts. One to take an xslx input to create a CapabilityStatement with Narrative. The other to take in a json CapabilityStatement input and creates a new CapabilityStatement file with the Narrative included.</p>\n<p>It includes the r4models necessary to support the element extensions used to include capabilitystatement-expectation extension.</p>\n<p>It is still a quick and dirty tool. Hope to polish it more in the future and possibly merge with other tooling so there is only one place one has to go to get the latest and greatest (and we don't have unnecessarily divergent versions).</p>",
        "id": 258653079,
        "sender_full_name": "Corey Spears",
        "timestamp": 1634869696
    },
    {
        "content": "<p>In CapStatement / CapStatement2, can we consideradding the publisher as a reference(organization)?</p>",
        "id": 258820374,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634991610
    },
    {
        "content": "<p>Also, I see that implementation.custodian says \"Organization that manages the data\" - assuming that who <em>manages the data</em> is not necessarily the same <em>as who manages the server</em>, can we make that clearer?</p>",
        "id": 258820476,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634991771
    },
    {
        "content": "<p>Zulip is a great place to discuss. When you are ready, would you mind entering a Jira Ticket on FHIR Core if you would like to see these changes in the standard?</p>",
        "id": 258858999,
        "sender_full_name": "Corey Spears",
        "timestamp": 1635050478
    },
    {
        "content": "<p>I will. I don't know if those are good ideas or if anyone else has similar or opposing requirements</p>",
        "id": 258871500,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1635071338
    }
]