[
    {
        "content": "<p>When creating a capability statement what goes in CapabilityStatement.profile ?</p>\n<p>Is it just the StructureDefinitions for the resources? or does it include the extensions and any data type profiles as well?</p>",
        "id": 153919411,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1510649384
    },
    {
        "content": "<p>preferably as much as you can say for each kind of use case.</p>",
        "id": 153919412,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510654089
    },
    {
        "content": "<p>CapabilityStatement may be retired in favor of ExampleScenario (? I am watching that develop)</p>",
        "id": 153919413,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510654117
    },
    {
        "content": "<p>Can I check out ExampleScenario somewhere? I could not find it on <a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">build.fhir.org</a></p>",
        "id": 153919420,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1510655382
    },
    {
        "content": "<p>it is there<br>\n<a href=\"http://build.fhir.org/examplescenario\" target=\"_blank\" title=\"http://build.fhir.org/examplescenario\">http://build.fhir.org/examplescenario</a></p>",
        "id": 153919421,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510655417
    },
    {
        "content": "<p>i have a few questions there but I could not put them in Forge because i could not find exampleScenario in the resource list. :)</p>",
        "id": 153919423,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510655578
    },
    {
        "content": "<p>I see those as very different resources Grahame.  One is defining what you can do, the other is giving an example of how a particular flow could work</p>",
        "id": 153919477,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510672349
    },
    {
        "content": "<p>not CapabilityStatement.rest.resource.profile - I think that's what you're referring to. CapabilityStatement.profile is something different. And it's not quite the same as ExampleScenario, but maybe that's what it should be</p>",
        "id": 153919490,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510673184
    },
    {
        "content": "<p>Differentiating those two has been a challenge for many of us.  ON FHIR-I we chatted briefly about an outstanding Gforge tracker that has morphed into a proposal to move CS.profile under .rest since it doesn't seem to apply to messaging ( but that may be a red herring here).  GG can you clarify why an example would replace an profile - I don't follow that at all?</p>",
        "id": 153919496,
        "sender_full_name": "Eric Haas",
        "timestamp": 1510674389
    },
    {
        "content": "<p>And examplescenario would benefit greatly if it had an introduction and scope and usage section ... Am assuming is an interaction diagram in fhir.</p>",
        "id": 153919498,
        "sender_full_name": "Eric Haas",
        "timestamp": 1510674585
    },
    {
        "content": "<p>what you list in CS.profile is saying 'this is one kind of profile that the system supports'. There's a few specific obligations shown here: <a href=\"http://hl7.org/fhir/profiling.html#profile-uses\" target=\"_blank\" title=\"http://hl7.org/fhir/profiling.html#profile-uses\">http://hl7.org/fhir/profiling.html#profile-uses</a></p>",
        "id": 153919500,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510674642
    },
    {
        "content": "<p>exampleScenario can be shown as an interaction diagram (actually a sequenceDiagram)</p>",
        "id": 153919501,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510674710
    },
    {
        "content": "<p>as for moving it to .rest... I think that would be wrong. The underlying capabilities apply irrespective of channel</p>",
        "id": 153919502,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510674748
    },
    {
        "content": "<p>the key sentence is the start one: \"These profiles describe the information handled/produced by the system on a per use case basis\" - but it doesn't say anything about the use case. Seems to me that ExampleScenario is close to describing the use case. So I'm watching to see how that plays out</p>",
        "id": 153919503,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510674748
    },
    {
        "content": "<p>My point was that it is not obvious what go where on first blush.  Maybe changing the element names might help that a bit.</p>",
        "id": 153919504,
        "sender_full_name": "Eric Haas",
        "timestamp": 1510674757
    },
    {
        "content": "<p>My second point was that ExampleScenario need an Introduction and Scope and Usage Section....:-)</p>",
        "id": 153919507,
        "sender_full_name": "Eric Haas",
        "timestamp": 1510674831
    },
    {
        "content": "<p>well, it's certainly caused a lot of confusion. it seems clear  to me, except for the missing information</p>",
        "id": 153919508,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510674845
    },
    {
        "content": "<p>in exampleScenario there is an xslt that allows a sequence diagram to be generated.<br>\nexampleScenario has description, pre- and post-conditions.</p>",
        "id": 153919509,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510674952
    },
    {
        "content": "<p>since exampleScenario already supports \"instance\" resources, i think it would be neat if it supported \"conformance\" resources. As in \"<br>\nin step 1, this structureDefinition needs to be respected. <br>\nIn step 2, the following constraints apply: <br>\n   2a: if this happens, structure definition 2a<br>\n   2b: if this other thing happens, structureDefintition 2b</p>",
        "id": 153919512,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510675340
    },
    {
        "content": "<p>This is overlapping with PlanDefinition, so i may be tunnelling to a solution</p>",
        "id": 153919514,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510675633
    },
    {
        "content": "<p>ExampleScenario refers to example instances.  I don't see how it could be useful for Conformance.</p>",
        "id": 153919539,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510677586
    },
    {
        "content": "<p>hmm. I assumed that you'd be able to talk the scenario indendepently of providing instances</p>",
        "id": 153919541,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510677843
    },
    {
        "content": "<p>The purpose was to provide a scenario instance example of exactly who did what when.  It doesn't talk about who <em>can</em> do what.</p>",
        "id": 153919542,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510678358
    },
    {
        "content": "<p>The expectation was the latter would be handled by PlanDefinition</p>",
        "id": 153919543,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510678372
    },
    {
        "content": "<p>The requirements i was thinking of - not even sure if they fit in this discussion, and regardless of which resource - are thus:</p>",
        "id": 153919553,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510683835
    },
    {
        "content": "<ul>\n<li>If a single medication administration is requested, this is a medicationRequest (instance-order)</li>\n<li>if it is an infusion, there SHALL be a medicationRequest containing the overall infusion</li>\n<li>If the infusion is planned to have different phases, each phase MAY be represented by a medicationRequest, in which case it SHALL point to the request for the overall infusion.</li>\n<li>if the actual administration is a result of an administration (instance) request, then it SHALL be a medicationAdministration, BasedOn this request.<br>\n...</li>\n<li>If it's an infusion, then there is an overall medicationAdministration</li>\n<li>If there are phases or changes, then they MAY be captured with additional medicationAdministrations. If so, they SHALL point to the overall medicationAdministration, and MAY be BasedOn on a medicationRequest.</li>\n</ul>",
        "id": 153919556,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510684400
    },
    {
        "content": "<p>in short, requirements of type <br>\n\"If this is the scenario, these are the constraints\" - (use <strong>this</strong> resource type / apply <strong>these</strong> constraints on the resources)<br>\n\"If this happens, what happens next has these constraints\" (the resources on step have to link to the previous step)</p>",
        "id": 153919557,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510684587
    },
    {
        "content": "<p>I feel ExampleScenario is more functional and CapabilityStatement more technical. [base]/metadata will respond with a ONE CapabilityStatement, so that a client \"knows\" what the server can do. How will ExampleScenario fit in there?</p>",
        "id": 153919562,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1510685921
    },
    {
        "content": "<p>I think of plan definition as a sequence of user actions, not an API use case thing</p>",
        "id": 153919608,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510720622
    },
    {
        "content": "<p>It allows you to define order of events, pre-conditions, triggers, timing relationships, etc.  All potentially relevant when defining technical workflows.</p>",
        "id": 153919646,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510737591
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191421\">@Michael van der Zel</span> on your question on how an exampleScenario/PlanDefinition fits when getting ONE capabilityStatement, I have been thinking that CapabilityStatements could/should nest other stuff. <br>\nSo i can get from a system \"here is my capabilityStatement. I support these <strong>general</strong> constraints on resource content, and also I also support the following <strong>workflow conformance</strong> aspects which themselves entail additional constraints.\"</p>",
        "id": 153919667,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510742442
    },
    {
        "content": "<p>so 2 general requirements, 1= supporting content and workflow conformance, 2= nesting (conformance inheriting or containing more conformance).</p>",
        "id": 153919671,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510742708
    },
    {
        "content": "<p>i can try to make a strawman for the workflow conformance bit using PlanDefinition and ExampleScenario, so that i am not anchored to any specific implementation option</p>",
        "id": 153919674,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1510742773
    },
    {
        "content": "<p>Agree with <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  we have had difficulty differentiating between CapabilityStatement.profile and CapabilityStatement.rest.resource.profile elements. We may have to support amalgamated capability statements so will be watching developments here. Are there any good examples that demonstrate multiple system use cases?</p>",
        "id": 153928142,
        "sender_full_name": "Simon Knee",
        "timestamp": 1515514853
    }
]