[
    {
        "content": "<p>When creating capability statements and populating CapabilityStatement.rest.resource.searchParam is it correct to add the underscore parameters as well (e.g. _id, _lastUpdated etc) ?</p>\n<p>If not how does an  end-system know which of these have been implemented on an endpoint?</p>",
        "id": 153922546,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1512121707
    },
    {
        "content": "<p>Yes it's appropriate to list those.</p>",
        "id": 153922598,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512140739
    },
    {
        "content": "<p>So does this answer also apply to _include and _revinclude when CapabilityStatement.rest.resource.searchInclude and .searchRevInclude are defined and populated? </p>\n<p>Also is the fact that underscore parameters should be included in searchParam defined in the spec at all because I couldn't find it.<br>\nIn a small sample size of test servers most (that supported them at all) defined the searchInclude but didn't define _include in searchParam <br>\nso if it is expected to have them listed I'm not the only one who doesn't know this.</p>",
        "id": 178692586,
        "sender_full_name": "ryan moehrke",
        "timestamp": 1571688212
    },
    {
        "content": "<p>No, _include and _revinclude (and _count, _total, _summary, _elements etc) are not search parameters</p>",
        "id": 178699801,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1571692679
    },
    {
        "content": "<p>really? <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span></p>",
        "id": 178762090,
        "sender_full_name": "John Moehrke",
        "timestamp": 1571755184
    },
    {
        "content": "<p>Correct.  They govern the operation behavior, but they're not search parameters.  At the moment, CapabilityStatement can convey _searchinclude and _searchrevinclude.  It can't specify support for some of the other search qualifiers though</p>",
        "id": 178762618,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571755521
    },
    {
        "content": "<p>So then, let me get this clear, <br>\nhaving searchInclude populated in the capability statement is the only thing used to know if a server supports _include.<br>\n(and likewise with searchRevInclude and _revInclude) <br>\n_include and _revInclude should explicitly not be in searchParams.<br>\ncorrect?</p>\n<p>And then also, is any of this written in the fhir spec.</p>",
        "id": 178765843,
        "sender_full_name": "ryan moehrke",
        "timestamp": 1571757508
    },
    {
        "content": "<p>Well, there are no SearchParameter instances for ._include or._revinclude and they're not listed in the spec as search parameters.  The other CapabilityStatement properties are clearly defined.  What other guidance do you think is needed?</p>",
        "id": 178766877,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571758147
    },
    {
        "content": "<p>rather than just checking to see if it isn't defined in the list of SearchParameter instances (which I didn't check because I didn't realize there was an extensive list published)<br>\nI instead looked where _include and _revInclude are defined. Which for one is confusing because it is on the Search page and the formatting of search qualifiers is identical to the actual search parameters; the only information that they are are different is they are in a different section of the summary table and have a separate header to distinguish this (that is named differently from the table header so it isn't even obvious that it is what you're looking at)<br>\nBut then the header in the contents of the page (link: <a href=\"https://www.hl7.org/fhir/search.html#return\" target=\"_blank\" title=\"https://www.hl7.org/fhir/search.html#return\">https://www.hl7.org/fhir/search.html#return</a>) is completely empty. If there are substantial differences between the actual search parameters and these search qualifiers then something should be there to describe what this new section is for. <br>\nI may have a strange take on this being that I'm not trying to build a server or client but rather trying to test on the topic. But this documentation seems rather lacking to me.</p>",
        "id": 178774316,
        "sender_full_name": "ryan moehrke",
        "timestamp": 1571763491
    },
    {
        "content": "<p>you could create a task to make this clearer. I agree it's not obvious now</p>",
        "id": 178775214,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571764149
    },
    {
        "content": "<p>What about documenting support for modifiers like <code>\"missing</code>, <code>:text</code>, but especially <code>:below</code> and <code>:in</code> (code in ValueSet expansion), etc?</p>",
        "id": 178813175,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1571791723
    },
    {
        "content": "<p>They are defined in the SP resource which the capstatrment references</p>",
        "id": 178911129,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571878253
    },
    {
        "content": "<p>ah, so that would be a server-specific SP resource and it would then be <code>derivedFrom</code> the corresponding FHIR-defined SP - that makes sense</p>",
        "id": 178911839,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1571879165
    }
]