[
    {
        "content": "<p>Greetings Everyone,</p>\n<p>I'm looking to capture a patient's room assignment being changed. Does that capture fall under the Encounter resource or the Location resource for a patient?</p>",
        "id": 153914446,
        "sender_full_name": "Akeem Leighton Foster Spencer",
        "timestamp": 1508255112
    },
    {
        "content": "<p>I don't understand what you mean with \"location resource for a patient\".</p>",
        "id": 153914447,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1508255282
    },
    {
        "content": "<p>seems that encounter.location points to a Location resource, so would that work?</p>",
        "id": 153914448,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1508255315
    },
    {
        "content": "<p>Encounter.location = \"List of locations where the patient has been during this encounter.\" It's 0..*, so i'd say when patient's room changes, you add one location there...</p>",
        "id": 153914449,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1508255421
    },
    {
        "content": "<p>Okay so would this be an entirely new Encounter Resource if the patient's location is changing or would this update an older Encounter instance tied to the patient?</p>",
        "id": 153914453,
        "sender_full_name": "Akeem Leighton Foster Spencer",
        "timestamp": 1508255630
    },
    {
        "content": "<p>I guess it depends on what you consider encounter - is it to the hospital or to each location. From my experience, most places consider an encounter \"one visit to the hospital\", not \"one visit to room A\"</p>",
        "id": 153914456,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1508255758
    },
    {
        "content": "<p>With this, if patient goes from room A to room B, you have an encounter for the hospital, and you start with location=[{roomA}]  and when you update you have location=[{roomA}, {roomB}]</p>",
        "id": 153914460,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1508255862
    },
    {
        "content": "<p>It would have to be each room, if a user has to temporarily go to a different room for a procedure request, as an example</p>",
        "id": 153914461,
        "sender_full_name": "Akeem Leighton Foster Spencer",
        "timestamp": 1508256109
    },
    {
        "content": "<p>you can still support many rooms with the example I showed</p>",
        "id": 153914465,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1508258426
    },
    {
        "content": "<p>Sometimes a separate encounter gets created when you go from one department to another, but generally the encounter would remain the same and you'd just end the previous location and add a new one.</p>",
        "id": 153914469,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1508259509
    }
]