[
    {
        "content": "<p>From: Olga Vovk &lt;<a href=\"mailto:ovovk@samvit-solutions.com\">ovovk@samvit-solutions.com</a>&gt;<br>\nDear all,<br>\nI need to be able to capture both aliquot and analyte information for a given sample/specimen.</p>\n<p>Aliquots can be derived either from a sample or from analyte.<br>\nFor aliquots, the following information need to be captured : 1) the quantity in micrograms of the aliquot(s) derived from the analyte(s) and 2) the volume in microliters of the aliquot(s) derived from the analyte(s).</p>\n<p>Analyte is the specimen extracted for analysis from a given sample or a portion of a sample. So, it looks like it can be referenced as a specimen to itself.<br>\nFor analyte, I need to capture its type and analyte concentration.</p>\n<p>I am not sure I can capture all this information using the Specimen resource. At least, I don't know how.<br>\nI would appreciate any advice/suggestions.<br>\nThank you!</p>\n<p>Olga Vovk<br>\n&lt;:3)))~~~~</p>",
        "id": 232475424,
        "sender_full_name": "Email Gateway",
        "timestamp": 1617129484
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span></p>",
        "id": 232477969,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617130457
    },
    {
        "content": "<p>try <span class=\"user-mention\" data-user-id=\"191698\">@Riki Merrick</span></p>",
        "id": 232485414,
        "sender_full_name": "Eric Haas",
        "timestamp": 1617133355
    },
    {
        "content": "<p>I agree that the analyte would just be a different specimen resource that references the specimen.identifier of the sample in its specimen.parent. use specimen.type for the analyte type but  I am not sure where I would put the concentration - you have 2 choices, but neither seem right to me:<br>\na) specimen.container.quantity - this is what I would use for the aliquot quantity - but I don't understand why you need both the mass as well as the volume - currently that element is 0..1 (there is a tracker to allow reference of a device resource, so you can create nesting containers, but I don't think that applies to your case = <a href=\"https://jira.hl7.org/browse/FHIR-22823\">https://jira.hl7.org/browse/FHIR-22823</a>)<br>\nb) specimen.collection.quantity, not quite right, as the analyte is not collected, but rather created by processing, so maybe we need a new element for specimen.processing.quantity</p>\n<p>We already added a tracker to add specimen role (<a href=\"https://jira.hl7.org/browse/FHIR-22838\">https://jira.hl7.org/browse/FHIR-22838</a>), but would need to review the suggested vocabulary (<a href=\"https://terminology.hl7.org/ValueSet-v2-0369.html\">https://terminology.hl7.org/ValueSet-v2-0369.html</a>), as what you need here seems to fit better with the vocabulary for specimen child role (<a href=\"https://terminology.hl7.org/ValueSet-v2-0494.html\">https://terminology.hl7.org/ValueSet-v2-0494.html</a>) but we have not added that element so far, as we don't quite understand how BOTH would be used in v2 at the moment, so opted to just add one, but probably need to expand the vocab, if we do that) which might help keep things organized better.</p>\n<p>It sounds like this might need more discussion - is there a way you could join our specimen project calls on Mondays 2 - 3 PM EDT?</p>",
        "id": 232489789,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1617135119
    },
    {
        "content": "<p>HI Riki, Thank you so much for your answer.<br>\nMuch appreciated.</p>\n<p>Riki, you asked:  \" but I don't understand why you need both the mass as well as the volume - currently that element is 0..1 \"</p>\n<p>There are use cases when volume is needed and in other use cases when the mass is needed. <br>\nI agree with you, most likely we would not need both mass and volume the same time.</p>\n<p>And, Yes, I would be happy to join Specimen project calls . Thank you!!!<br>\nOlga</p>",
        "id": 232492125,
        "sender_full_name": "Olga Vovk",
        "timestamp": 1617135973
    }
]