[
    {
        "content": "<p>We are looking at an implementation for clinical decision support, based on the ServiceDefinition/GuidanceResponse interactions, in the urgent &amp; emergency care space, particularly for triage.  <br>\nWithin triage, a key element is the recording of negative information (e.g. Patient DOES NOT have diabeters, or Patient IS NOT suffering shortness of breath).  In the Condition commentary (<a href=\"https://www.hl7.org/fhir/condition.html#9.2.3.5\" target=\"_blank\" title=\"https://www.hl7.org/fhir/condition.html#9.2.3.5\">https://www.hl7.org/fhir/condition.html#9.2.3.5</a>) there is a statement about using Observation to capture this kind of statement.<br>\nDoes anyone have any examples of this being implemented that we can learn from?</p>",
        "id": 154018861,
        "sender_full_name": "David Waters",
        "timestamp": 1542294715
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> ?</p>",
        "id": 154018867,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542295785
    },
    {
        "content": "<p>If <a href=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=418\" target=\"_blank\" title=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=418\">TermInfo</a> in its latest rendition still applies to FHIR, there is a section on negation within Observations (2.2.10 on page 54). </p>\n<blockquote>\n<p>Assertions of negative Observations (e.g. absence of a specified finding)<br>\nSHOULD be represented, as part of the SNOMED CT expression in the<br>\nObservation.value attribute, by including the appropriate explicit<br>\n408729009 | Finding context | </p>\n</blockquote>\n<p>Thus you would encode this by a post-coordinated expression of the form<code> &lt;404684003 | Clinical\nfinding | :  408729009 | Finding context | = 410516002 | Known absent |</code></p>",
        "id": 154018871,
        "sender_full_name": "Vladimir Smirnov",
        "timestamp": 1542296629
    },
    {
        "content": "<p>for findings that are not found:  there are terminology options as noted above or  see <a href=\"http://build.fhir.org/observation.html#code-interop\" target=\"_blank\" title=\"http://build.fhir.org/observation.html#code-interop\">this guidance</a> in the specification.</p>\n<p>pattern 3:</p>\n<ul>\n<li>code=[diabetes]</li>\n<li>value=[true|false]</li>\n</ul>",
        "id": 154018922,
        "sender_full_name": "Eric Haas",
        "timestamp": 1542307313
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195982\">@David Waters</span> - To clarify, the use case is Triage, and a clinician is asking diagnostic or safety protocol questions? And if the answer is yes, diabetes, we expect to record a condition, but if it's no, an Observation is sufficient? (And if it's yes, shortness of breath, do you have any expectations about which way it would go?)</p>",
        "id": 154018924,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1542307578
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  But isn't this pattern violating prior TermInfo recommendations? See section 2.2.3.1 (p. 33)</p>\n<p><a href=\"/user_uploads/10155/RS4mXBuYomwBS6zGenZijlCU/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/RS4mXBuYomwBS6zGenZijlCU/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/RS4mXBuYomwBS6zGenZijlCU/pasted_image.png\"></a></div><p>TermInfo recommends all observations to follow the pattern of code being an &lt; Observable entity, and value being a &lt; Finding, in order to normalize their interpretation when sharing.</p>",
        "id": 154018925,
        "sender_full_name": "Vladimir Smirnov",
        "timestamp": 1542307784
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ?   We took much of this from terminfo and it should be consistent (at least when we wrote it)</p>",
        "id": 154018926,
        "sender_full_name": "Eric Haas",
        "timestamp": 1542307932
    },
    {
        "content": "<p>\"Pattern 4\" in current draft spec is also deprecated in TermInfo:</p>\n<p><a href=\"/user_uploads/10155/hcIiWwtDnmZdd0FW37KdTik_/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/hcIiWwtDnmZdd0FW37KdTik_/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/hcIiWwtDnmZdd0FW37KdTik_/pasted_image.png\"></a></div><p>To my understanding, isn't it the case when a Condition should be used instead? This is the case when we postulate the presence of a finding without any further value. In CDA RIM there's no Condition, so they introduced this pattern in TermInfo as a workaround. Wasn't Condition introduced in FHIR to represent just such statements?</p>",
        "id": 154018927,
        "sender_full_name": "Vladimir Smirnov",
        "timestamp": 1542308257
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> We are facing a similar question in our work. The answer depends on whether the absence of the problem is clinically relevant. As stated in the Condition spec, «generally, electronic records do not contain assertions of conditions that a patient does not have». If the whole purpose of the question is triggering further sub-questions, then the statement of non-presence may be of no value. If there is a requirement to save it for audit purposes, then I would choose the Observation, or keeping it in QuestionnaireResponse without conversion to structured data (if your screen forms are based on Questionnaires). As for Diabetes vs Shortness of breath, is there any difference? As long as they both fall under the Clinical Finding SNOMED hierarchy, both codes are safe to go in a Condition.</p>",
        "id": 154018929,
        "sender_full_name": "Vladimir Smirnov",
        "timestamp": 1542309510
    },
    {
        "content": "<p>I am not a fan of  pattern 4 but it does reflect what implementers do.</p>",
        "id": 154018942,
        "sender_full_name": "Eric Haas",
        "timestamp": 1542313464
    },
    {
        "content": "<p>the terminfo thing is a red herring BTW.  I mean how many implementers of FHIR are reading up on terminfo?</p>",
        "id": 154018988,
        "sender_full_name": "Eric Haas",
        "timestamp": 1542320727
    },
    {
        "content": "<p>I appreciate <span class=\"user-mention\" data-user-id=\"193029\">@Vladimir Smirnov</span> referencing the TermInfo guidance on this (Eric does have a fair point, which I hadn't seen when I first was writing this).  The TermInfo guidance wasn't written with FHIR in mind, and the CDA/V3 standard that the guidance is based on has some differences from FHIR, like negationInd.  So technically the TermInfo IG doesn't apply to FHIR, but where there is an appropriate alignment I would say that the principles do still apply and we should try to follow them and remain in sync where possible.  And as <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> said, we did try to align with TermInfo in writing the guidance in <a href=\"http://build.fhir.org/observation.html#code-interop\" target=\"_blank\" title=\"http://build.fhir.org/observation.html#code-interop\">10.1.4.4.3</a>.  Oner key difference with the TermInfo guidance is that in FHIR we've explicitly recommended to <em>not</em> use the ASSERTION pattern (particularly because that tends to adversely impact searching)  and we also did not include a \"negation indicator\" element in FHIR (largely to avoid the overlap and potential inconsistency issues that arise with that).  And, as mentioned, in CDA/V3 we didn't have a class separate from Observation that would be equivalent to the Condition resource.  So what should we do in FHIR in this particular case?  There isn't only one correct answer (and maybe we need to try to get there), but I have some thoughts on what I would do in this case.  If this is reflecting a typical set of questions that are asked of patients that present with similar presentations then I think I would use Questionnaire/Questionnaire with an appropriate set of questions and coded answers.  If the questions are more directed by the clinician and are specific to the patient then I probably would use Observation pre-coordinated LOINC and/or SNOMED CT codes using a variety of pattern 1 or 2.  Since the questions to be asked (especially that any subsequent decision support might be based on) should be known in advance, if the needed codes for the questions or answers aren't available in existing terminologies (standard terminologies, ideally) then they can be requested to be added.</p>",
        "id": 154019003,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1542322221
    },
    {
        "content": "<p>TermInfo for CDA is the most thorough guidance on use of SNOMED in information models that we have. It requires some mental adjustment to be applied to FHIR, but it can't be ignored. In particular, it is nearly fully applicable to Observations, since they are very similar between FHIR and RIM. And since patterns 3 &amp; 4 were recommended against years ago, shouldn't it be appropriate to include this warning in FHIR documentation, if it derives from that? Of course legacy systems can use the best approach that fits, but new systems shouldn't!</p>",
        "id": 154019018,
        "sender_full_name": "Vladimir Smirnov",
        "timestamp": 1542325589
    },
    {
        "content": "<p>there's a key priority that wasn't considered for terminfo, which makes a real difference for FHIR. which is search. You will want the Observation.code to be as useful as possible so that searches are most efficient. In practice, this is mostly a comment on the use of Observation.code = \"ASSERTION\"</p>",
        "id": 154019059,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1542356052
    },
    {
        "content": "<p>@<strong>Jay Haas</strong></p>\n<blockquote>\n<p><span class=\"user-mention\" data-user-id=\"195982\">@David Waters</span> - To clarify, the use case is Triage, and a clinician is asking diagnostic or safety protocol questions? And if the answer is yes, diabetes, we expect to record a condition, but if it's no, an Observation is sufficient? (And if it's yes, shortness of breath, do you have any expectations about which way it would go?)</p>\n</blockquote>\n<p>That's correct - if the answer is yes, diabetes, we expect to record as a condition.  If it's no, I'm expecting an observation.<br>\nFor shortness of breath, if the answer is yes, I'm also expecting to record this as an observation. <br>\nNote that when you say 'record' - our current clinical guidance is that these elements will only be recorded for the duration of the triage process - a patient telling you that they have diabetes may not have sufficient 'weight' to update a permanent medical record</p>",
        "id": 154019065,
        "sender_full_name": "David Waters",
        "timestamp": 1542356705
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> </p>\n<blockquote>\n<p>... I think I would use Questionnaire/Questionnaire with an appropriate set of questions and coded answers.  </p>\n</blockquote>\n<p>We are using Questionnaire and QuestionnaireResponse to ask the actual questions, but we want to code the meaning behind that in an appropriate way so that different CDSS can interoperate in the same patient journey.<br>\nSo, a triage journey may want to use two different CDSS (for a variety of reasons, including supporting different skill sets, different comms channels, different specialties, etc.).  Both CDSS are aware that a patient suffering from shortness of breath is a key element to guide the decision support.  However, one CDSS asks a question 'Are you suffering from shortness of breath?' (Yes, No, Maybe), while the other CDSS asks the question 'Is the patient having difficulty catching their breath, or are they finding that they are out of breath doing things that they used to be able to easily do?' - the meaning is the same in both cases, hence wanting to codify as an Observation, which can be shared (and hence the problem as stated)</p>",
        "id": 154019068,
        "sender_full_name": "David Waters",
        "timestamp": 1542357235
    },
    {
        "content": "<blockquote>\n<p>there's a key priority that wasn't considered for terminfo, which makes a real difference for FHIR. which is search. You will want the Observation.code to be as useful as possible so that searches are most efficient. In practice, this is mostly a comment on the use of Observation.code = \"ASSERTION\"</p>\n</blockquote>\n<p>Yes, this is my thinking for this use case, as well - when the second CDSS receives a set of Observations from the first, it will make things simpler if it can just search for the relevant code (shortness of breath) and then check the value (true|false) to provide the guidance</p>",
        "id": 154019075,
        "sender_full_name": "David Waters",
        "timestamp": 1542357846
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195982\">@David Waters</span> I still have some questions about the use of a \"relevant\" code and value (true|false), which is basically pattern 3.  It's essentially treating 'value' as a de facto negation indicator, but it's even far less constrained than the CDA/V3 negation indicators were (at least without specific profiling), and I have some concern that we'll end up seeing similar issues using that approach.  I think I would be more inclined to have the specificity (including negation or presence/absence) expressed in the 'code', which I think fits with Grahame's comment about usefulness for search.  That can be done using pre-coordinated codes (as I mentioned earlier) or it could be with post-coordinated expressions (to the extent that you or anyone wants to and is able to support them).  And either way that keeps the meaning in one place rather than distributing it with potentially divergent lines of division across two elements, which I think was the most useful and compelling point of the TermInfo guidance.</p>",
        "id": 154019108,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1542362432
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Yes, pattern 3 is as you say.  At the risk of reopening something which is well known - what were the issues from CDA/V3 that you are concerned about?<br>\nWith regard to profiling, we are intending to profile the set of observations/similar that are relevant to the triage use case<br>\nAre your concerns/issues about the general advisability of pattern 3, or its specific applicability to the triage use case?</p>",
        "id": 154019114,
        "sender_full_name": "David Waters",
        "timestamp": 1542364712
    }
]