[
    {
        "content": "<p>We have a use case where we want to capture how time much a person spent in a poor body posture within some reference time frame (say, a day). Understandably, there does not seem to be e.g. LOINC codes capturing exactly this concept (\"Time spent in poor body posture\"). However, there are of course codes for body posture itself, e.g. SNOMED 249858009 - \"Poor posture (finding)\". My general question is whether there is some way on FHIR to combine such codes with time-intervals to capture that fact that a person was in the state described by the code for a specific period/length of time (similar to saying e.g. that a patient was unconscious for a specific period of time).</p>\n<p>Technically, one could create a Condition, with the appropriate code and the time interval  captured in <code>onsetDataTime</code> and <code>abatementDateTime</code>, but that definitely seems wrong since we are not really talking about a \"condition (...) that has risen to a level of concern\". Following option 3 in <a href=\"http://hl7.org/fhir/R4/observation.html#guidance\">this guidance on the use of codes in Observation</a>, we can capture the fact that a patient was found to have poor posture in an Observation with the SNOMED finding code, no <code>value[x]</code> and <code>dataAbsentReason</code> set to \"clinical-finding\". That seems more on the right tracks, but still leaves me with some questions:</p>\n<ol>\n<li>Would following this guidance and additionally setting <code>effectivePeriod</code> to the period when the poor posture was observed convey the correct meaning?</li>\n<li>Following on (1): Is there some way of aggregating the time spent in the relevant state over a fixed interval , e.g. saying \"code applied for 3 hours on this particular day\", rather than saying \"code applied for this specific period of time\"?</li>\n<li>The value \"clinical-finding\" for <code>dataAbsentReason</code> is not in the extensibly bound value set. Is this value defined in another standard code system?</li>\n</ol>\n<p>I suspect cases like these are becoming more common with the spread of wearables that generate  many different kinds of data for various time intervals, so I would be very interested in any general guidelines that exist on this.</p>",
        "id": 260762127,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1636442497
    },
    {
        "content": "<p>On question 2 - could you use an Observation.valueQuantity of 3 hrs with an effectivePeriod of the day of the observation?</p>",
        "id": 260946259,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1636520573
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> Yes, I think that would make sense. My only worry is whether it will be consistently correctly interpreted by all consumers since the code itself is just a finding (\"bad posture\") and does not provide any clue as to what the value means. Looking at option 2 in the section I linked above, (which I realized is more appropriate than 3), the recommendation is to only combine a SNOMED finding code with <code>valueBoolean</code> or <code>valueCodeableConcept</code> (basically to say present/not present). I suppose we could capture this pattern in our IG and document what it means (i.e. SNOMED finding code  in <code>code</code> + reference period in <code>effectivePeriod</code> + time for which finding code applies within this period in <code>valueQuantity</code>). I wonder if others have tried something like this as well.</p>",
        "id": 260966541,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1636537854
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> I would recommend an Observation with a custom code.  When using resources, always think about where you want the data to show up and how the system behaves as a patient's situation evolves.  Conditions generally show up in the patient's problem list and the Condition resource is updated over time to reflect their current state.  (You'd have to look at history to understand past state).  In your case, you presumably want to be able to capture multiple values over time - so you can see if interventions are helping.  You also don't (necessarily) want to see this as a 'problem'.  So my leaning is to define your own code for the Observation.  (Though you can certainly propose it as a concept to be added to a standard terminology such as LOINC.)</p>",
        "id": 261457622,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1636952670
    },
    {
        "content": "<p>Thanks for the input, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - I will certainly go with Observation. A custom code would definitely allow to completely fix the semantics. However, I am a little worried that we will have a profusion of custom codes of type \"Time spent in state X\" where X is some state reported by a wearable device and for which we already have perfectly good standard codes (e.g. asleep, physically active, bad posture, having low blood-sugar etc.). That is why it seemed worthwhile to consider establishing a pattern to represent these cases as Observations using the pre-existing \"State codes\" , thus leveraging the existing terminology work rather than manually adding each combination to LOINC or using custom codes. Is there something that would speak against declaring such a pattern convention (like the one I mentioned above) in an IG, instead of using custom codes?</p>",
        "id": 261470426,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1636965845
    },
    {
        "content": "<p>There are possible mechanisms that leverage 'component' to qualify a higher-level observation code.  It would be best to raise this on <a class=\"stream\" data-stream-id=\"179202\" href=\"/#narrow/stream/179202-terminology\">#terminology</a> to get vocabulary input.  <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> - any thoughts?</p>",
        "id": 261541844,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637002275
    },
    {
        "content": "<p>OK thanks, will do.</p>",
        "id": 261614916,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1637054586
    },
    {
        "content": "<p>Opened <a href=\"#narrow/stream/179202-terminology/topic/Using.20finding.20codes.20for.20time.20spent.20in.20physiological.20state\">this thread</a> in <a class=\"stream\" data-stream-id=\"179202\" href=\"/#narrow/stream/179202-terminology\">#terminology</a></p>",
        "id": 261616848,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1637055801
    }
]