[
    {
        "content": "<p>I am doing some due diligence around Provider Attribution for Patients. ie. A Patient can actively identify their preferred Provider. I believe a number of payers are already using an API to express this relationship/preference. I wanted to check if there is a FHIR Resource that is being used to declare this relationship.<br>\nI am looking at what would be involved to capture a patient's provider attribution preference and express it as a FHIR resource.<br>\n- Is there a published API that people are aware of that performs this task?<br>\n- Which FHIR resource captures the relationship. </p>\n<p>Per <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  comments on mapping to coverage resource RelatedPerson covers non-professional relationships. <br>\n/cc <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>  </p>",
        "id": 153854210,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1477421447
    },
    {
        "content": "<p>So a patient's GP is conveyed by Patient.generalPractitioner.  And I believe there was going to be an extension to capture their preferred pharmacy, though it doesn't appear to be there yet.  If you want more than that, I'd look at CareTeam which allows you to capture all of the practitioners (and other participants) involved in a particular patient's care, along with their roles and timeframes.</p>",
        "id": 153854211,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1477421790
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  That helps.</p>",
        "id": 153854257,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1477428244
    },
    {
        "content": "<p>+1 on Lloyds comments.</p>",
        "id": 153854318,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1477437906
    },
    {
        "content": "<p>To twist the question slightly, what about organization attribution for a patient?  For example, what if a health plan creates/suggests a relationship between a patient and organization/clinic.  It isn't at the practitioner level and it didn't get expressed by the patient.  In some cases, the patient may not have had an encounter at that org/clinic, but the org is still deemed to be responsible for the patient.  Thoughts on whether this fits the scope of a CareTeam, too?</p>",
        "id": 153854650,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1477693357
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> There is an ongoing weekly meeting on CareTeam elements (ONC started this) that is populated by mostly HL7 PC folks. Some of what you are aluding to is being discussed there. You (and others interested) should consider attending. Fridays 4p. Info at <a href=\"https://oncprojectracking.healthit.gov/wiki/display/CC/Care+Coordination+Home\" target=\"_blank\" title=\"https://oncprojectracking.healthit.gov/wiki/display/CC/Care+Coordination+Home\">https://oncprojectracking.healthit.gov/wiki/display/CC/Care+Coordination+Home</a> but you'll need to contact J. Skapik to get access. PM me for more info.</p>",
        "id": 153854804,
        "sender_full_name": "Robert McClure",
        "timestamp": 1477850568
    },
    {
        "content": "<p>You would want to record the Accountable Care Organization, if present, in the same manner you record the Primary Care Provider. </p>",
        "id": 153854822,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1477894269
    },
    {
        "content": "<p>Hi all,<br>\nWe want to create extensions  like CareTeam Type, CareTeam encrypt type and CareTeam split for CareTeam resource. Is this a right approch can anyone suggest me ?</p>",
        "id": 154018784,
        "sender_full_name": "Mounika",
        "timestamp": 1542283171
    },
    {
        "content": "<p>It would be helpful to have descriptions for each of those elements.  In particular, how is CareTeam Type distinct from CareTeam.category?</p>",
        "id": 154018787,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542283440
    },
    {
        "content": "<p>type refers to is it Teaching or Non Teaching care team.<br>\nWhere Teaching type care team consists medical student included in team  along with Practitioners<br>\nWhere non teaching doesn't consists of Medical Student along with Practitioners</p>",
        "id": 154018792,
        "sender_full_name": "Mounika",
        "timestamp": 1542283772
    },
    {
        "content": "<p>And the other two?</p>",
        "id": 154018815,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542286796
    },
    {
        "content": "<p>Care Team Encounter Type which refers to is it Main Team or Co - Management Team or Consultant team with respect to Encounter.<br>\nCare Team Split&amp;Share type means  - is Care Team involved by single or multiple Team members.<br>\nIs this correct way?</p>",
        "id": 154018824,
        "sender_full_name": "Mounika",
        "timestamp": 1542287634
    },
    {
        "content": "<p>Not totally grasping spit&amp; share, but it sounds like they're all appropriate as extensions</p>",
        "id": 154018836,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542288668
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Thank you</p>",
        "id": 154018839,
        "sender_full_name": "Mounika",
        "timestamp": 1542289487
    },
    {
        "content": "<p>Hi there,</p>\n<p>I'm trying to represent a patient's historical and current care team, which could potentially include multiple organizations and sub-teams within the organizations. For example, let's say that:</p>\n<ul>\n<li>Patient Harry Potter has received care from Hogwarts Health and Hogsmeade Health. With Hogwarts Health, he has received care from the Gryffindor team, which includes Ron Weasley and Hermione Granger. From Hogsmeade Health, he has received care from Abeforth Dumbledore.</li>\n</ul>\n<p>In that example, </p>\n<ol>\n<li>Should Harry Potter only have one care team resource, and if so, that care team is dynamic? Or, does a patient have several care teams, and to see the entire village of care team members, you list all care teams with the patient as the subject?</li>\n<li>What happens if an encounter resource includes a reference to a participant that’s a Practitioner, but that Practitioner isn’t in the CareTeam resource?</li>\n<li>How do you prevent duplication of practitioners in the Care Team?</li>\n</ol>",
        "id": 272875334,
        "sender_full_name": "Amna Hashmi",
        "timestamp": 1645568712
    },
    {
        "content": "<ol>\n<li>No 'right' answer.  Considerations include: What's in the database - one team or multiple? (or even are you dealing with records in different databases?)  Who needs to see what and has access to change what?</li>\n<li>That'll be pretty common.  CareTeam is typically used either for a set of people who provide a type of care independent of patient (e.g. \"Trauma team 2\") or who are responsible for care for a particular patient or condition across encounters (My cancer care team is...).  In a typical encounter, there'll certainly be people who interact with the patient who aren't officially on the patient's care team.</li>\n<li>It's possible the same Practitioner might be listed on the care team more than once, perhaps with different periods or perhaps with different roles.  You can use business rules to enforce any restrictions you have (e.g. can't be there more than once, all members must be from same organization, can't be more than one nutritionist, etc.)</li>\n</ol>",
        "id": 272878632,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645570668
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - in an ambulatory setting, we are looking at managing a patient's \"preferred practitioners\" - a list of 1 or more preferred healthcare providers the patient selects as \"favorite\". <br>\nCould we manage this by creating a \"Preferred Team\" Profile on the CareTeam resource for \"logging\" patient choices through our enterprise mobile app?</p>",
        "id": 275652607,
        "sender_full_name": "Yuval Romm",
        "timestamp": 1647524064
    },
    {
        "content": "<p>That seems viable.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>, any comments?</p>",
        "id": 275672093,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647531349
    },
    {
        "content": "<p>A profile alone isn't sufficient. You want a category indicating \"preferred providers\". The profile would require that category be used.</p>",
        "id": 275751229,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1647568176
    },
    {
        "content": "<p>Seams reasonable</p>",
        "id": 276253160,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1647982698
    }
]