[
    {
        "content": "<p>Is there a Careplan example which demonstrates the use of <code>Careplan.activity.reference</code>?</p>\n<p>I'm trying to validate a FHIR careplan example where <code>Careplan.activity.reference</code> will reference a MedicationRequest resource.  What I find weirdly circular is that there is an attribute generically called \"reference\" which also happens to be a Reference().  At least with outcomesReference, it's a different name. This seems to point back to itself.  Regardless, when I create an example, it won't validate.<br>\nfor example:<br>\n<code>    \"activity\": [\n            \"reference\": {\n              \"reference\": {\n                       \"MedicationRequest/16885\"\n              },\n             etc...\n</code><br>\nThe above gives the error: cpl-3: Provide a reference or detail, not both [detail.empty() or reference.empty()</p>\n<p><em>Question</em>: Is the syntax wrong, or is this a validator bug, or should I not be using this attribute at all?</p>\n<p>cc: <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> since this is related to PCDE examples creation for Guidewell + HIMSS20 showcase.</p>",
        "id": 187556748,
        "sender_full_name": "May Terry",
        "timestamp": 1581002344
    },
    {
        "content": "<p>That fragment doesn't look valid.  Should be a <code>{</code> after the start of the array.  Also, what's in the <code>etc...</code> bit matters very much.  You can't have a detail element - only the reference.  Can you provide your actual instance?</p>",
        "id": 187580008,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581017257
    },
    {
        "content": "<p>You might try using <a href=\"http://build.fhir.org/ig/HL7/fhir-shorthand/\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/fhir-shorthand/\">shorthand / sushi</a> to generate the examples - it does do basic validation. another example here: <a href=\"https://fhirblog.com/2020/02/10/family-fhir-with-sushi/\" target=\"_blank\" title=\"https://fhirblog.com/2020/02/10/family-fhir-with-sushi/\">https://fhirblog.com/2020/02/10/family-fhir-with-sushi/</a></p>",
        "id": 188419131,
        "sender_full_name": "David Hay",
        "timestamp": 1581992695
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - Thanks! I'll give that change a try. Otherwise, I'll attach the bundle example to ask for a second review to possibly catch the error.<br>\n<span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> -  Yeh...I've been creating examples for our mCODE IG with shorthand, so I'm kinda familiar with it.  Shorthand is nice for simple straightforward examples but it falls short for what I need at this time. I'm creating a complex PCDE bundle which I found is more cumbersome to represent in FHIR shorthand with PCDE's dependencies on 2 different IGs (US Core and PAS) as well as the number of entries and references in my example.</p>",
        "id": 188698392,
        "sender_full_name": "May Terry",
        "timestamp": 1582251424
    }
]