[
    {
        "content": "<p>Hi,  I  not sure whether the CarePlan or ProcedureRequest resource  would be better to capture \"diary entry\" information?  Our requirements appear to fit  the data items in either of the profiles. If you can provide any advice, or if someone has already modelled \"diary enteries\", I would be very happy to hear from you.  I summarised the positives and negatives below:</p>\n<p>•   Both ProcedureRequest and CarePlan have the required elements<br>\n•   Both belong to the “request” resource from a “FHIR workflow perspective”<br>\n•   Diary Entries have a broad scope and will include activities which do not relate well to being represented as procedures<br>\n•   ProcedureRequest is designed to task an action on to a person or organisation where the Diary Entry is often less specific<br>\n•   Whilst CarePlan covers complex planning it also includes simple actions explicitly within it’s scope which equate well to Diary Entries: <br>\n“…can be as simple as a general practitioner keeping track of when their patient is next due for a tetanus immunization”</p>\n<p>The requirements for Diary Entry are:</p>\n<p>•   A proposal for clinical action to be undertaken at an indicative date (in the future). The diary entry<br>\n•   is created unscheduled, that is, it is not an appointment and <br>\n•   resources are not directly committed to it. </p>\n<p>The diary entry may be: <br>\n•   a reminder for a review<br>\n•   a follow up to a consultation / treatment / test<br>\n•   a recall or <br>\n•   treatment to be provided according to a schedule.</p>\n<p>•   Examples:<br>\n•   - Asthma review<br>\n•   - COPD review<br>\n•   - Diabetes review<br>\n•   - Epilepsy review<br>\n•   - Mental Health review<br>\n•   - NHS Health checks (5years)<br>\n•   - Over 75 Check<br>\n•   - Antipsychotic injections<br>\n•   - Child immunisations<br>\n•   - Cytology Smear<br>\n•   - Depo Provers <br>\n•   - flu vaccines <br>\n•   - Repeat Blood tests</p>",
        "id": 175078308,
        "sender_full_name": "John George",
        "timestamp": 1567785724
    },
    {
        "content": "<p>Depends on what you want. For my local interpreation of a diary entry, I am looking at Communication</p>",
        "id": 175079109,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1567786288
    },
    {
        "content": "<p>your \"diary entry\" seems to be more of a \"to do\" list, so a request may be more approprite if that is what you need.</p>",
        "id": 175079242,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1567786364
    },
    {
        "content": "<p>my diary entry is like a real diary or a chat channel like \"noticed that he patient is not eating\" or \"who can replace me tomorrow\" or \"Mr Belpit's legs are so swollen\"</p>",
        "id": 175079464,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1567786526
    },
    {
        "content": "<p>Have you looked at Task?  It may be a better fit</p>",
        "id": 175091856,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567795283
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> many thanks for your suggestions, I will consider those too.</p>",
        "id": 175221482,
        "sender_full_name": "John George",
        "timestamp": 1568015676
    }
]