[
    {
        "content": "<p>We are about to represent standardized care plans (patient instances of them) for cancer in an overview. </p>\n<p>From the healthcare professionals point of view it is very important to understand in which <em>phase</em> the plan is in. For cancer there are different deparmtents and different KPIs involved in the diagnostic phase (before a confirmed diagnosis and a decision to treat) than after the treatment starts. Hence, we have use cases like:</p>\n<ul>\n<li>See all patients on a cancer pathway undergoing diagnostics</li>\n<li>See all patients on a cancer pathway that have started treatment</li>\n</ul>\n<p>There is a CarePlan.status, but that seems more oriented towards whether the plan is active or completed. We would like something like a CarePlan.phase. </p>\n<p>We could see it being a codeableConcept with cardinality 0..1. </p>\n<p>Any thoughts on how to solve this requirement? We can obviously always add an extension, but if that is the way, maybe we should add a jira ticket to add this to the CarePlan resource if others agree it belongs there?</p>\n<p>Thoughts?</p>",
        "id": 271147686,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1644335491
    },
    {
        "content": "<p>You can use a Task. Task supports business statuses which seems to be (related to) what you're looking for</p>",
        "id": 271152517,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1644337366
    },
    {
        "content": "<p>This goes back to the early discussions on Task and some F2F (we were happy then and we didn't realize it) that if a Task represents \"something that is to be done\", then a Task can be divided by Task.</p>",
        "id": 271152760,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1644337479
    },
    {
        "content": "<p>so I think I'd start looking at Task for that</p>",
        "id": 271152797,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1644337500
    },
    {
        "content": "<p>Actually, I would use CarePlan.category.  The purpose of category is to allow grouping and filtering of plans that fall into the same 'bucket', and the notion of 'phase' seems like it would correspond to that.</p>",
        "id": 271164767,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644342480
    }
]