[
    {
        "content": "<p>Hi , I have a question on CarePlan resource, we are planning to build a care plan management product in our EHR,  the following is how we are trying to model this: <br>\na) We first build a library of careplans that contain the condition that each of them addresses along with the set of activities that are prescribed to bring the condition under control and also meet the goals that are defined to address the condition.<br>\nb) Each of the care plans defined at the library level are carefully devised so that each meet a specific purpose and one does not eclipse or mimic another careplan.<br>\nc) Now, when a patient is diagnosed with a specific condition/conditions, a care plan for each of the condition is derived from the library we have built in above steps. So a patient may endup with one or more careplans derived from the library. Each of the derived careplan has a reference to the library careplan and this will enable us to support analytics.<br>\nd) An individual care plan is a mirror image of the library careplan with the activities curtailed to the individual/patient specific condition. The goals may also be modified to suit the patient's condition.<br>\ne) Now if we have a situation where we need to have an activity for a patient which is not defined in library, we first add the activity to the library and then derive the individual plan.<br>\nf) We also have a use case wherein as part of the careplan the condition is monitored via the Labs/procedures (actionResulting) and that keep the goal in check</p>\n<p>Please let us know if you see any flaw/issues with this model and also any suggestions comments are welcome.</p>",
        "id": 153856321,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1478782139
    },
    {
        "content": "<p>The CarePlan resource supports modeling a specific care plan for a particular patient or group, and it sounds like what you're trying to define here is a definition of a CarePlan. The PlanDefinition resource is intended to support that use case, so the library of careplans you are referring to would be a set of PlanDefinition resources, and applying one of those to a particular patient would then produce a CarePlan.</p>",
        "id": 153856355,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1478792879
    },
    {
        "content": "<p>Yup, that's basically how we implemented it.  </p>",
        "id": 153856870,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1479150499
    },
    {
        "content": "<p>Hi,</p>\n<p>Ok, so Plandefinition for the definition and CarePlan for the individual looks<br>\napt. We have one more usecase where we want to group the set of clinics that<br>\nprovide/participate in the careplan.We looked at the group resource but it does<br>\nnot have location as one of its member.  Should we go with an extension for<br>\ngroup to accomodate the location or should we use healthcare service to make<br>\nthis association but looks like it complicates more than it solves the problem?<br>\nOr should the association be made from the Practitioner (Part of CareTeam) via the role in a location(clinic)?<br>\nPlease advice...</p>",
        "id": 153857055,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1479263025
    },
    {
        "content": "<p>It seems like that would always just be inferred based on the practitioners involved. Would it ever be the case that a location could be involved with the CarePlan but no practitioner from that location would be?</p>",
        "id": 153857195,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1479293081
    },
    {
        "content": "<p>You could have a preferred pharmacy or something referenced in a CarePlan but the pharmacy isn't involved in the maintenance of the CarePlan and you wouldn't identify any particular practitioner</p>",
        "id": 153857215,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479294938
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> ,Yes, in a realistic scenario a clinic may have been enrolled in providing a careplan and a user/practitioner is still not assigned. It could also be a case where an existing practitioner may have resigned or left and the clinic is yet to appoint one in his place.</p>",
        "id": 153857273,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1479305651
    },
    {
        "content": "<p>I see, in that case I'd suggest an extension for now, maybe accompanied by a tracker request to the CarePlan to support that use case?</p>",
        "id": 153857320,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1479315965
    },
    {
        "content": "<p>still, it's organization. What happens if the team at the location moves down the road?</p>",
        "id": 153857321,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479316034
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , Hi, so are you suggesting that the grouping of clinics offering a CarePlan can be supported by Organization? In our case, a clinic can support multiple CarePlans which would mean that a location need to refer more than one Organization.</p>",
        "id": 153857332,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1479318160
    },
    {
        "content": "<p>organizations refer to locations, not vice versa?</p>",
        "id": 153857346,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479322432
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , I do not see any reference to location in Organization Resource, am I missing something here?</p>",
        "id": 153857385,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1479333011
    },
    {
        "content": "<p>A Location has a managingOrganization element.</p>",
        "id": 153857387,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1479333471
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> , as I mentioned earlier how can a location refer to multiple organizations..</p>",
        "id": 153857388,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1479334056
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192784\">@ravi.kuchi</span> What exactly do you want to express when using a location in that context?<br>\nLike, the place where the care plan is applied to the patient? Or rather the responsible organization (might be CareTeam.managingOrganization then)?</p>",
        "id": 153857389,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1479334887
    },
    {
        "content": "<p>We actually want to show a list of clinics(location) that can support the careplan so when a user is to be assigned a careplan he can select one among the location.</p>",
        "id": 153857548,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1479389888
    },
    {
        "content": "<p>In FHIR terms, the clinics aka locations are Organization resources while Location is rather about the physical place.<br>\nAs Grahame pointed out, the clinic may move down the road but is still capable of supplying the care plan.</p>\n<p>Your use case sounds like an extension to me that would extend PlanDefinition, containing references to Organization resources and having a cardinality of 0..* (maybe 1..*, if you can ensure there is always at least one clinic that is able to provide any PlanDefinition).<br>\nFrom that list, the application will let the user choose, eventually resulting in the chosen organization becoming managingOrganization of the CarePlan's CareTeam.</p>",
        "id": 153857554,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1479391782
    },
    {
        "content": "<p>The extension sounds good and it would make our design simple, thanks for all your suggestions <span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> , <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  &amp; <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> </p>",
        "id": 153857582,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1479405620
    },
    {
        "content": "<p>Hi, We are trying to use Plandefinition as a library of CarePlans and dervie CarePlan that could be associated to each individual patient. A CarePlan has Goal, Condition and activity , I am trying to map these to PlanDefinition so when a Patient is enrolled we can scope a Careplan from the PlanDefinition. I assume that the activity in CarePlan could be mapped to ActivityDefinition in PlanDefinition. The Condition could be mapped to condition in actiondefinition. I am struggling to map Goals... I looked at requiredBehavior but it is just a code , any ideas or corrections about these thoughts is appreciated. Thanks!</p>",
        "id": 153857847,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1479506246
    },
    {
        "content": "<p>After going through the PlanDefinition Resource in Comparison with CarePlan, I feel that Goal is something that should have been part of the action definition but is missing, I am planning to log in a request in GForge for that, please let me know if any of alternate opinions?</p>",
        "id": 153857999,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1479749214
    },
    {
        "content": "<p>The documentation for the Goal resource indicates it's intended to support description of a Goal with respect to a specific patient, so it might not be the best fit for describing goals on the PlanDefinition. That being said, I think you're right there isn't a good place to express that sort of thing on the PlanDefinition right now. So yes, submit a request to GForge I think, and if you can include a specific example of a Goal you are trying to represent, that would be very helpful. Thank you!</p>",
        "id": 153858174,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1479861193
    },
    {
        "content": "<p>Hi, The CarePlan has a relatedPlan reference to CarePlan, would it also make sense to include PlanDefinition in the realtedPlan so we can keep track of the PlanDefinitions from which we have derived this CarePlan. I know that there is a reference to PlanDefinition in the activity detail but that seems to be at a lower level in the hierarchy... The usecase here is when we create a CarePlan from a PlanDefinition, the CarePlan would be in the initial phase of plan definition where only few activities may be asscociated with the CarePlan based on the triggerdefinition and condition. As the CarePlan gets updated with it's current activities it will be ready to move on to the next phase where the CarePlan needs to be associated with other set of activities defined in the plandefinition again based on the trigger and condition. So we require a reference to PlanDefinition so whenever an update/event happens we can go back to the plandefinition and perform the next sequence of actions...</p>",
        "id": 153859953,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1480695913
    },
    {
        "content": "<p>CarePlan supports both of the following:<br>\nCarePlan.definition -- reference to the PlanDefinition at the CarePlan level<br>\nCarePlan.activity.detail.definition -- reference to the PlanDefinition at the activity level</p>",
        "id": 153859954,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1480696249
    },
    {
        "content": "<p>I am looking at DSTU3 <a href=\"http://hl7.org/fhir/2016Sep/careplan.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2016Sep/careplan.html\">http://hl7.org/fhir/2016Sep/careplan.html</a>, not able to find CarePlan.definition , <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> , could you please point me where to find that?</p>",
        "id": 153859955,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1480696785
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192784\">@ravi.kuchi</span> Your link is to the Sept 2016 ballot version.  The current build is what I was looking at (which will feed into STU3 publication in March 2017):  <a href=\"http://build.fhir.org/\" target=\"_blank\" title=\"http://build.fhir.org/\">http://build.fhir.org/</a></p>",
        "id": 153859960,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1480697196
    },
    {
        "content": "<p>Thanks @Michelle (Moseman) Miller </p>",
        "id": 153859966,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1480699074
    }
]