[
    {
        "content": "<p>Hi all,<br>\nIn  an Organization we have multiple CareTeams, who are working on different Patients. <br>\nIf a CareTeam resource work on a Patient Encounter, from day 1 to day 10 encounters total count 10 encounters. How can we capture these encounters info in CareTeam resource? Similarly same CareTeam resource worked on different Patients encounter’s.</p>",
        "id": 154020823,
        "sender_full_name": "rekha",
        "timestamp": 1543235061
    },
    {
        "content": "<p>What is your objective in linking the CareTeam to the encounters?  What involvement did the CareTeam have with the encounters?</p>",
        "id": 154020869,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1543245112
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>   We have to create documentation based on Care team who spent time on Patient based on Encounters which are they involved.</p>",
        "id": 154020988,
        "sender_full_name": "rekha",
        "timestamp": 1543301364
    },
    {
        "content": "<p>Typically involvement is captured at a more granular level.  So a particular member of a care team performed a particular Procedure that was part of the Encounter.  You could aggregate to figure out which Care Teams were involved, but you won't typically find raw data captured that way.</p>",
        "id": 154020989,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1543302594
    },
    {
        "content": "<p>We have multiple care teams which contains different types of Practitioners (Attendee’s, Medical Student, Personal Attendees etc) . These care teams working on Patients Encounters. </p>\n<p>Example there are 3 CareTeam resources,<br>\n<br>\n  CareTeam1, <br>\n  CareTeam2,<br>\n  CareTeam3. <br>\n      Worked on Patient on Day1. We are capturing each CareTeam work on Patient consider as one Encounter. Then we are taking 3 encounters for each CareTeam. Now on Day 2 same CareTeam’s working on same Patient. So we are capturing 3 more Encounters on Day 2 for each CareTeam. But as per <a href=\"http://build.fhir.org/careteam.html\" target=\"_blank\" title=\"http://build.fhir.org/careteam.html\">http://build.fhir.org/careteam.html</a> , We are able to capture single Encounter object with CareTeam resource. How can we group these Encounters info. Do we need to capture any other way instead of CareTeams?  <br>\n<a href=\"/user_uploads/10155/qE3D08_PHeh3AKQDdBmgIS9-/IMG_20181127_190355.jpg\" target=\"_blank\" title=\"IMG_20181127_190355.jpg\">IMG_20181127_190355.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/qE3D08_PHeh3AKQDdBmgIS9-/IMG_20181127_190355.jpg\" target=\"_blank\" title=\"IMG_20181127_190355.jpg\"><img src=\"/user_uploads/10155/qE3D08_PHeh3AKQDdBmgIS9-/IMG_20181127_190355.jpg\"></a></div>",
        "id": 154021055,
        "sender_full_name": "rekha",
        "timestamp": 1543326109
    },
    {
        "content": "<p>That seems to be an uncommon way to handle encounters.  An encounter is generally a visit from a patient to a particular hospital or clinic or a particular department within a hospital.  It's a single encounter regardless how how many practitioners engage with them or what teams those practitioners are part of.</p>",
        "id": 154021080,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1543336332
    },
    {
        "content": "<p>The CareTeam.encounter is intended to say \"This is the patient's care team for the course of this encounter\".  If CareTeam.encounter is specified, the CareTeam <em>must</em> be patient-specific.</p>",
        "id": 154021081,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1543336384
    },
    {
        "content": "<blockquote>\n<p>That seems to be an uncommon way to handle encounters.  An encounter is generally a visit from a patient to a particular hospital or clinic or a particular department within a hospital.  It's a single encounter regardless how how many practitioners engage with them or what teams those practitioners are part of.</p>\n</blockquote>\n<p>Okay@<strong>Lloyd McKenzie</strong>  That is for Admission Encounter part. How to implement the Encounter for Hospitalized patient.<br>\nWe have Encounters like for each day. How to implement that?</p>",
        "id": 154021315,
        "sender_full_name": "Mounika",
        "timestamp": 1543414308
    },
    {
        "content": "<p>Wouldn't that be an EpisodeOfCare? It seems that resource would be a better match to what you're trying to track.</p>",
        "id": 154021321,
        "sender_full_name": "Jeffrey Danford",
        "timestamp": 1543416153
    },
    {
        "content": "<p>Episode of Care is for diagnosis. That is a bundling concept. We want to capture Encounters of day1, day2,..etc and which Care Teams were involved.</p>",
        "id": 154021653,
        "sender_full_name": "Mounika",
        "timestamp": 1543498176
    },
    {
        "content": "<p>Episode of care can be more than grouping diagnosis, can be for other types of bundling too. But this sounds more like an addmssion encounter, and partof encounters. Not sure where the care team is coming in here, if the practitioners are different each time, then I would have expected you to enter them into the encounter, rather than the care team reference.</p>",
        "id": 154022447,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1543832855
    },
    {
        "content": "<p>Billing/financial rules cause a lot of differences as to how one views and records encounters. In this case there seem to be administrative/financial rules for wishing to track these encounters. Nothing wrong with creating encounters to track the (patient, careTeam) relationship, and to create a new encounter each and every day. Common: no. But we've seen stranger things..</p>",
        "id": 154024056,
        "sender_full_name": "René Spronk",
        "timestamp": 1544447283
    }
]