[
    {
        "content": "<p>On the last LHS Tech Forum I moderated, Dr. John Glaser (past-president of HIMMS) talked about his proposal of shifting from record-focused EHR to plan-focused EHR. After forum, I asked John whether his idea also requires a shift in document standards. He said it is worthy to raise this issue in HL7 community.  So, I asked Dr. Charles Jaffe and he mentioned HL7 has lots of focus on modeling plan-oriented healthcare process already. I think this is great. If you are working on this direction, please share your perspectives, and we can have some discussions on this important shift. Thanks</p>",
        "id": 221020770,
        "sender_full_name": "AJ Chen",
        "timestamp": 1609098672
    },
    {
        "content": "<p>Thanks, I am not in that group though.</p>",
        "id": 221031284,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1609116924
    },
    {
        "content": "<p>just request to join the linkedin LHS group, I'll let you in.</p>",
        "id": 221032510,
        "sender_full_name": "AJ Chen",
        "timestamp": 1609118960
    },
    {
        "content": "<p>I agree that this is an important new perspective and a different perspective than before. However I don't think that it is a fundamental change to the modeling. I would express it more as an expansion of the model. In that everything that an EHR does today is still useful, and often for inpatient they are plan focused. But for out-patient or chronic-care; this is where the EHR tends to fail. The EHR could encompass these other domains,  and some EHR vendors seem to want to do that. But the patients and other forces in the market are demanding movement far faster. Thus I say it is an expansion of the model, not a totally new model.  One where the EHR is a participant, but so too are others in the plan, and so too is the patient (etc).</p>",
        "id": 221134106,
        "sender_full_name": "John Moehrke",
        "timestamp": 1609248586
    },
    {
        "content": "<p>These discussions are happening in HL7. See the <a class=\"stream\" data-stream-id=\"220328\" href=\"/#narrow/stream/220328-Care-Plan.2FCare-Coordination\">#Care Plan/Care Coordination</a>  stream</p>",
        "id": 221134163,
        "sender_full_name": "John Moehrke",
        "timestamp": 1609248609
    },
    {
        "content": "<p>There are also specific perspectives being discussed in <a class=\"stream\" data-stream-id=\"179262\" href=\"/#narrow/stream/179262-patient-empowerment\">#patient empowerment</a> stream</p>",
        "id": 221134240,
        "sender_full_name": "John Moehrke",
        "timestamp": 1609248693
    },
    {
        "content": "<p>And the Security and Privacy people are trying to enable a careplan that is appropriately authorized so as to be frictionless while protecting the patient safety and privacy.</p>",
        "id": 221134319,
        "sender_full_name": "John Moehrke",
        "timestamp": 1609248740
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  thanks.  some people think it's expansion, others may prefer more radical changes. It's all good. Looks like Care Plan discussion stream is a great place to start.</p>",
        "id": 221145743,
        "sender_full_name": "AJ Chen",
        "timestamp": 1609259054
    }
]