[
    {
        "content": "<p>We are implementing an application for a cash-based practice and need some help modeling the resources and interactions.</p>\n<p>Scenario: A patient goes to a consult and the doctor orders two lab tests and a few supplements (the doctor also schedules a follow-up appointment, suggests literature, etc, but the practice doesn't charge for those items, I'm only including them to paint a better picture)</p>\n<p>One of the lab tests is covered by the patient's insurance but the other needs to be paid cash. All the supplements are cash also.</p>\n<p>Our application lets the practitioner order those items and presents them with a stripe-like UI to capture the credit card and pay for the items.</p>\n<p>The patient might have more than one credit card from a different encounter and can choose to use a saved credit card or enter a new one.</p>\n<p>Now, this is what we are doing:</p>\n<ul>\n<li>\n<p>We are using the catalog IG (<a href=\"https://build.fhir.org/ig/HL7/fhir-order-catalog/\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/fhir-order-catalog/\">https://build.fhir.org/ig/HL7/fhir-order-catalog/</a>) to model the lab compendium and the supplement catalogs, the <br>\n   items have ChargeItemDefinitionss associated with the pricing information</p>\n</li>\n<li>\n<p>We are using a ServiceRequest to model the order containing the supplements and the lab tests, that is: a ServiceRequest that contains children <br>\n   ServiceRequests for the lab order and MedicationRequests for the supplements</p>\n</li>\n<li>\n<p>When it's time, we generate an invoice with a line for each item and additional lines for taxes and shipping costs</p>\n</li>\n<li>We are using Account to store the credit card references (one Account per credit card)</li>\n</ul>\n<p>We have some questions:</p>\n<ol>\n<li>\n<p>Invoice has an account field<br>\n  a) Should we use it to link to the credit card that is used to pay for the invoice?<br>\n  b) If true, we don't know which credit card the patient will use before payment, should we leave it blank and then update it once the patient pays<br>\n  c) If false, where should we store the reference to the credit card used to pay for the invoice?</p>\n</li>\n<li>\n<p>Should we add the lab orders that are going to be covered by the insurance to the Invoice?<br>\n  a) As a charge item with a price of $0?<br>\n  b) If true, how do we link it with the patient's coverage?</p>\n</li>\n<li>\n<p>Invoice has lineItem.priceComponent of type tax, should add the taxes to each line item individually or have an extra lineItem only for the taxes <br>\n     total (we think the 2nd option is more common in eCommerce)</p>\n</li>\n<li>\n<p>Is there an IG, discussions, draft or something about payment, cash, credit cards that you can point us to? It would be very useful. </p>\n</li>\n</ol>\n<p>Thanks in advance :)</p>",
        "id": 191050367,
        "sender_full_name": "Jorge Yero",
        "timestamp": 1584570216
    },
    {
        "content": "<p>1a) No.  The account would be the patient account that is being cleared by the invoice.  The notion is that you accrue charges to the patient account during the visit and then invoice the patient/guarantor to clear the balance of the account<br>\nb/c) We don't have a resource that represents the actual processing of payment - in part because there's nothing FHIR-specific about doing that.  You could use Basic for now and submit a change proposal if you think there's a need to represent the payment in FHIR<br>\n2a) Up to you based on what you think will be most useful to the patient.  The ExplanationOfBenefit resource would generally be used to indicate what insurance had covered<br>\nb) If you felt that was necessary, you'd need to use an extension</p>\n<ol start=\"3\">\n<li>Again, up to you - based on what you think your customers will want</li>\n<li>I think there is one, but it's German :)  <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span></li>\n</ol>",
        "id": 191051757,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584571135
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Could we use paymetReconciliation as the resource that represents the actual processing of payment and save a reference to the paymentMethod used</p>",
        "id": 191165597,
        "sender_full_name": "Jorge Yero",
        "timestamp": 1584647087
    },
    {
        "content": "<p>Didn't even know that resource existed.  Yes, that would be appropriate.  It seems to me that credit card info would be reasonable to include in the resource as core - <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 191181122,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584655423
    },
    {
        "content": "<p>Scenario: We generate MedicationRequest and ServiceRequest and we want the patient pay in advance. We are using ChargeItem.</p>\n<p>We can't see at ChargeItem.service a reference to ServiceRequest or MedicationRequest, instead it point to DiagnosticReport and MedicationDispense.</p>\n<p>How can we use it to model pay in advance?</p>",
        "id": 191310966,
        "sender_full_name": "Jorge Yero",
        "timestamp": 1584743493
    },
    {
        "content": "<p>Submit a change request for those resources to be added, and in the mean-time, use an extension</p>",
        "id": 191315532,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584747380
    },
    {
        "content": "<p>Couple of comments: <br>\n1) PaymentReconciliation is currently used for bulk payments from insurers for claims paid/adjusted. FM is working on expanding the resource to also handle patient payment including credit cards. Meetings are Tuesdays at 4PM eastern.<br>\n2) The ClaimResponse, not the ExplanationOfBenefit, resource would generally be used to indicate what insurance had covered. The ExplanationOfBenefit is a (typically) patient facing, although also used for reporting, resource to integrate the Claim and ClaimResponse information.</p>",
        "id": 191643240,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1585069974
    }
]