[
    {
        "content": "<p>After 2 years looking to describe \"this medication concept includes/contains/refers to that other medication concept\", and a few PSSs, it seems we now have abundance.<br>\nSo, here are some requirements from implementing this.  </p>\n<ul>\n<li>There is not a single master of drug formulary . this is federated data.</li>\n<li>The boundary between devices and medications is very thin and implementers cannot be forced to cross big borders between them. One thing is a device in one country and a medication in another.</li>\n<li>There is no universal concept of \"a medication\", nor which attributes are in there - in some places the medicine concept A is defined by manufacturer+substances+strenght. In other places, the medicine concept B is defined by all that + package size. in others, Medicine concept C is defined by all of the above except brand name. ISO IMP establishes 3-4 core concepts. But diversity is there and is to be supported.</li>\n<li>There is DEFINING a product and SPECIFYING a product. Those are different.</li>\n<li>There are additional more-or-less contextual attributes like classifications</li>\n<li>There are additional relations between items that are used in a specific scope/context.</li>\n</ul>\n<p>I hope this helps</p>",
        "id": 153929666,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516380285
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Can you be clear about what these requirements are for?  I'm unsure if you are stating what you want for our MedicationKnowledge resource to handle or whether you are just stating some generic requirements.  In any case, here are my comments:</p>\n<p>A) I agree.  There are multiple drug formularies across jurisdictions and even different formularies serving different purposes within a jurisdiction.  In one jurisdiction that I have implemented systems, we have 1) a drug knowledgebase that lists all of the known products that can be prescribed and dispensed, 2) a formulary that lists everything that the government insurer will be paying for, including costs and other restrictions, 3) a catalog of restricted use products.<br>\nB) I totally agree with this.  In Canada, we are actually using the existing Medication resource to convey anything that can be prescribed/dispensed because its existing attributes work for this.  It loses the point of the name, but it works for our implementation. :)<br>\nC) I don't agree with this but it might because I don't see what point you are trying to make.  I think it goes with the previous point that we will provide a resource that satisfies the use cases of our implementers and if they then use this resource for a bigger scope than we intended and it works for them, then kudos to them! :)<br>\nD) The Pharmacy WG has gone further and said that there are three different \"views\" of a Medication.<br>\nE) I disagree that classifications are contextual.  You'll have to provide some examples of classifications that are contextual and are not inherent to the product itself.   Perhaps this is just definitional of what we mean by classifications and what we mean by contextual.<br>\nF) Although I'm willing to admit that this might be true, I have been unable to find relations between items that are restricted to a specific scope.  There are <em>groupings</em> that are restricted to a specific scope, but that is not relationships between entries.</p>\n<p>We should have some very interesting discussions in New Orleans! :)</p>",
        "id": 153929689,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1516381866
    },
    {
        "content": "<p>Good, we are finally discussing requirements. Thanks. These requirements are for catalog of meds&amp;devices. <br>\nCatalog discussion in OO seems to conflict with medicationKnowledge in Pharm. I think it would be good to fix that.</p>",
        "id": 153929773,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516432535
    },
    {
        "content": "<p>for item c) see discussion on Concept Type <a href=\"https://chat.fhir.org/#narrow/stream/implementers/topic/concept.20type.3F\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/topic/concept.20type.3F\">https://chat.fhir.org/#narrow/stream/implementers/topic/concept.20type.3F</a><br>\nFor the others we can discuss in the Catalog or in the medicationKnowledge(if we find a slot)</p>",
        "id": 153929774,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516432714
    },
    {
        "content": "<p>We needed to draft the entryDefinition resource and will be testing it next week. Feel free to comment on it, as well. <br>\nI will gladly contribute with comments on this Knowledge resource when it is there.<br>\nBTW, if there are different views, you may not be asserting knowledge, you may be asserting a local definition. So it would make  me much more at ease if we call that resource medicationDefinition or medicineDefinition.</p>",
        "id": 153929775,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516433093
    },
    {
        "content": "<blockquote>\n<p>Good, we are finally discussing requirements. </p>\n</blockquote>\n<p>We have actually been discussing requirements of the Medication Knowledgebase in Pharmacy for a few months now.  And I'm sure that you've been involved in those discussions.</p>\n<p>I think the main worry that I have is that it seems that your concept of what the Catalog is and the Catalog entry doesn't seem to match what I've seen from others, including the existing draft resources and profiles.  I'm actually pleased with what I see in the current draft profiles where they leave the actual knowledge of what the catalog contains to domain-specific resources.  The catalog and the catalog entry are very abstract things that just serve as another way of grouping resources.  That totally fits the picture I have of a Jurisdictional Formulary that has sections as groupers.  It also fits my knowledge of how First Data Bank catlogs their prescribable drug products.</p>\n<p>In any case, the Pharmacy WG will continue to go forward in investigating what our MedicationKnowledge / MedicationDefinition resource will look like and how it fits in the continuum of products, medications, and such.</p>",
        "id": 153929901,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1516600954
    },
    {
        "content": "<p>Catalog candidate resources have been designed based on the agreement that intrinsic attributes of product are in the product, and contextual stuff is on catalog. Don't see any issue with that, or why that is not clear.</p>",
        "id": 153929908,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516611174
    },
    {
        "content": "<p>There are some requirements that stem from openMedicine, as discssed a few years back and that gave origin to a couple PSSs</p>",
        "id": 153929909,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516611230
    },
    {
        "content": "<p>(btw, catalogEntry is now entryDefinition)</p>",
        "id": 153929910,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516611282
    },
    {
        "content": "<p>Other requirements from implementation: <br>\nG) Align with GS1 Catalog Item Notification - we did that in catalog, much of this is already there, child products and packaging.<br>\nH) Must support clusters (structured and ad-hoc groups)<br>\nI) Support segmentation (some attributes in context A are not the same as those attributes in context B).</p>",
        "id": 153929911,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516611519
    },
    {
        "content": "<p>i haven't seen medicationKnowledge yet, nor the discussions, sadly. So i exposed what we had in Catalog.</p>",
        "id": 153929912,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516611602
    },
    {
        "content": "<p>And i am glad the Catalog resources fit your vision. Any feedback from this discussion of from implementation is appreciated.</p>",
        "id": 153929913,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516611830
    },
    {
        "content": "<p>I disagree with the notion that contextual information is catalog-specific.  Price is not a notion that requires the use of catalogues.  Lots of organizations establish, change and add new prices for things continuously and no catalogues are involved.  Therefore in FHIR \"price\" should not be in a catalog-specific resource - it needs to live in it's own resource.  The same argument applies to what products/services are available from a particular location, covered under a certain plan, etc.  I can't think of a single piece of information that would be specific to catalogues that isn't already covered by Composition as metadata about creating the compilation of information for a particular catalogue publication.</p>",
        "id": 153929965,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516639635
    },
    {
        "content": "<p>ItemInstance does not reflect information that is typically stored separately.  Every database I've seen stores serial numbers and lot numbers in the device table or the medication table, not in a separate \"instance\" table.  I'm fine with the notion of an ItemInstance pattern, but trying to separate things out because it makes for nicer modeling is not a good plan.</p>",
        "id": 153929967,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516639762
    },
    {
        "content": "<p>(Leaving itemInstance out, because I don't see it as part of this discussion (is it?))<br>\nA catalog of meds will not be only about the product, but how the product is seen in that specific context. <br>\nPricing is one of those things that can live in the product itself but will be shared as part of the catalog.</p>",
        "id": 153929982,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516640724
    },
    {
        "content": "<p>so, we can step back in the analysis: we can say that product-specific things are in the product, and that information that is contextual will eventually be transmitted in a catalog (and other places too, i'm sure). <br>\nI recall an example where reference price is in the prescription. It's not defined there, but it comes from the catalog.</p>",
        "id": 153929983,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516640858
    },
    {
        "content": "<blockquote>\n<p>Lots of organizations establish, change and add new prices for things continuously and no catalogues are involved.  </p>\n</blockquote>\n<p>Perhaps the word Catalog has different perspctives to it. <br>\nThe idea of Catalog is to support \"the following characteristics and relations of these items, as updated today, are:... \". <br>\nOr better put -  regardless of how we call it, hospitals need to get data about product updates. Can be a full document, can be a differential product definition update.</p>",
        "id": 153929984,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516641106
    },
    {
        "content": "<p>I don't think <em>anything</em> \"comes from\" a catalog.  A catalog is a way of presenting information that already exists elsewhere.  When hospitals get information about product updates, the \"data\" would be in the definition resources.  Whether those get delivered in a document, via pub-sub, via query or something else doesn't matter.</p>",
        "id": 153929989,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516641418
    },
    {
        "content": "<blockquote>\n<p>I don't think <em>anything</em> \"comes from\" a catalog.  A catalog is a way of presenting information that already exists elsewhere.  When hospitals get information about product updates, the \"data\" would be in the definition resources.  Whether those get delivered in a document, via pub-sub, via query or something else doesn't matter.</p>\n</blockquote>\n<p>i can agree with that - have a different idea of a catalog, but it works here too.</p>",
        "id": 153929991,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516641496
    },
    {
        "content": "<p>Hi all, <br>\nwe're modeling a catalog of medications (formulary) for medical organizations in a region. <br>\nCould you please direct me if there are any guidelines on how to do it?</p>\n<p>Currently, we consider 4 options of the modeling:<br>\n1. Medication resource (for branded medications that can be ordered in a med org, with information about manufacturer, primary and secondary package and amount in the package, etc., that reference generic medications (actually, substances with form and strength) + CodeSystem resource (catalog of generic medications with form, strength, units of measure for consumers, reference costs, different classifications, etc.) <br>\n2. Medication resource (for branded) + Medication.ingredient.itemCodableConcept (for generic)<br>\n3. Medication resource (for branded) + Medication.ingredient.itemReference(Medication) (for generic)<br>\n4. Medication resource (for branded) + MedicationKnowledge (for generic)</p>",
        "id": 162857495,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1554759511
    },
    {
        "content": "<p>I would use medicationKnowledge for all levels- branded and generic. except substance definitions. so for example \"paracetamol 500 mg tablets\" is a medicationknowledge. \"paracetamol\" is a substance.</p>",
        "id": 162858587,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554760452
    },
    {
        "content": "<p>not sure why you would use medication to define a product in a catalog.</p>",
        "id": 162858632,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554760514
    },
    {
        "content": "<p>We're going to define medication products in a catalog as the Medication resource because these medications will be used in the prescription workflow, and the reference from the MedicationRequest and MedicationDispense resources is only to the Medication resource. Is it correct?</p>\n<div class=\"codehilite\"><pre><span></span>. medication[x] Σ   1..1        What medication was supplied\n.... medicationCodeableConcept          CodeableConcept\n.... medicationReference            Reference(Medication)\n</pre></div>",
        "id": 162891885,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1554799361
    },
    {
        "content": "<p>The catalog is a collection of definitional resources, so it  should be the medication definitional resource (currently called medicationKnowledge)</p>",
        "id": 162892225,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554799694
    },
    {
        "content": "<p>each medication that you prescribe will have a code which should then allow you to look up the medication in a catalog of MedicationKnowledge</p>",
        "id": 162892251,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554799746
    },
    {
        "content": "<p>say you prescribe 10 tablets of a drug that comes in boxes of 20, or that you prescribe a soluble drug... what you prescribe is what medication is for. How the drug is defined in the catalog that is the medicationknowledge.</p>",
        "id": 162892390,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554799889
    },
    {
        "content": "<p>i am leaving out the matters of medicinalproduct and others which are WIP.</p>",
        "id": 162892533,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554800020
    },
    {
        "content": "<p>but if you want to define a product, there are lots of fields that you do not have in medication but do have in medicationKnowledge.</p>",
        "id": 162892611,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554800065
    },
    {
        "content": "<p>if the reason for chosing medication would be because the workflow resources point to it, that should not be a reason.<br>\nI am curious how many people have implemented drug catalogs while we did not provide clear consistent guidance how to do it (not that this would be bad, it is just just that we have to chase things a bit).</p>",
        "id": 162892828,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554800284
    },
    {
        "content": "<p>It's ok to have a registry of just Medication instances.  MedicationKnowledge is only relevant if you're going to actually capture the 'knowledge' information.  If what you care about is having a dropdown you can select meds from to prescribe, dispense or administer, Medication gives you what you need.  If you <em>need</em> the knowledge information, then quite typically, that would be the only thing in your registry (unless you're also wanting to store custom compounds).  You'd look up the code in the MedicationKnowledge and then just send that code in the MedicationRequest/MedicationDispense/etc. and not bother with Medication.</p>",
        "id": 162919390,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554822443
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191329\">@Aleksandra Pavlyshina</span>  you can use Medication instances, but if you need more details that is included in the Medication resource, I suggest you look at MedicationKnowledge.  The MedicationKnowledge was developed with formularies and drug knowledge bases in mind.</p>",
        "id": 163115667,
        "sender_full_name": "Melva Peters",
        "timestamp": 1555000273
    },
    {
        "content": "<p>Thinking about MedicationKnowledge and the 'drug DB companies' --- how does the modeling done so far deal with the fact that the drug DB companies regularly update their info (DBs)?    How does is 'lifecycle' of the drug info handled, e.g. I would imagine that the history of the drug info needs to be maintained for past administrations that have already been given -- or is that left to the DBs themselves and not for FHIR MedKnowledge to worry about?</p>",
        "id": 163116942,
        "sender_full_name": "John Silva",
        "timestamp": 1555001238
    },
    {
        "content": "<p>We are still in the process of getting the companies to come to the table and tell us how they use FHIR, but I suspect that is not something that the resource needs to worry about - other than perhaps a status field.</p>",
        "id": 163117017,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1555001291
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>  - I suppose if the DB companies have a product that puts up a FHIR facade then they can maintain the historical (or recalled) drugs while only exposing the current/active drugs to the prescribers and fulfillers (those who perform MedAdmin).   However, there may need to be something more than just status (active/inactive/withdrawn/recalled) because previous Med resources that reference the old drug info may need to retain that for historical (and in the US and other countries) legal reasons.  (maybe FHIR version history can solve this as long as the business identifier remains the same?)</p>",
        "id": 163119195,
        "sender_full_name": "John Silva",
        "timestamp": 1555003066
    },
    {
        "content": "<p>The history of a catalog is maintained in the catalog itself</p>",
        "id": 163122591,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555005488
    },
    {
        "content": "<p>they would expose the \"current release of the catalog\" (a snapshot) using Composition.</p>",
        "id": 163122670,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555005551
    },
    {
        "content": "<p>and i think so, the business identifiers should remain the same. that should enable to show the history of the meds and also the relations between the meds and other stuff (e.g. between a med and a device)</p>",
        "id": 163123465,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555006065
    },
    {
        "content": "<p>I'm told of one french drug db vendor that is making a FHIR façade for their catalog.</p>",
        "id": 163123773,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1555006254
    },
    {
        "content": "<p>Thank you all for your answers!<br>\nNow, we’re considering the following solution:</p>\n<ul>\n<li>To use the <code>MedicationKnowledge</code> resource for drug formulary.</li>\n<li>To use the <code>MedicationRequest</code> resource for simple medication prescriptions specifying the medication code from MedicationKnowledge (<code>MedicationRequest.medicationCodeableConcept = MedicationKnowledge.code</code>).</li>\n<li>To use <code>MedicationRequest</code> with inlined (contained) <code>Medication</code> resource for complex medications (such as drug solutions) where <code>Medication.ingredient.itemCodeableConcept</code> will hold the <code>MedicationKnowledge.code</code> and an amount of the medication will be captured in the <code>Medication.ingredient.strength.numerator</code> element.</li>\n</ul>\n<p>Could you please verify?</p>",
        "id": 163324999,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1555261348
    },
    {
        "content": "<p>Yes, that is how the Pharmacy workgroup intended the resources to be used.</p>",
        "id": 163328991,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1555267921
    }
]