[
    {
        "content": "<p>I hope this is the right place. Also, forgive me if I use some of the wrong terminology for CCDA docs - I'm still kind of learning in that area.</p>\n<p>In the US Core DocumentReference spec, the category field has \"clinical-note\" as the only code option with a binding level of extensible. </p>\n<p>We are using this category code for \"handwritten\" progress notes at the moment, but were looking to represent CCDA documents as well. I'm not sure whether CCDA documents actually would fall under the \"clinical-note\" category or not. The sticking point for me right now is that these documents are essentially generated on request based on existing data, but are not actually \"written\" by providers/professionals. However, they do still end up essentially containing clinical data about a patient.</p>\n<p>This is further complicated by the class code / type code associated with these CCDA documents. The documents I'm looking to map have the same class codes and type codes. These codes are 11506-3 and 34133-9 which are also listed in the valuesets for category/type in standard DocumentReference. But 11506-3 is also explicitly called out in the DocumentReference US Core type binding (though 34133-9 is not, and 11506-3 is not listed as a category option)</p>\n<p>There's a lot to unpack here, but any insights? I think I can break this down into more straightforward questions</p>\n<p>1) Should CCDA documents be categorized as \"clinical-notes\"<br>\n    1) a) If so, could I use the associated LOINC class codes I have as additional codings on that category?<br>\n    1) b) If not, I imagine I'd want to use the existing class codes as the category, right? </p>\n<p><a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-documentreference.html\">https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-documentreference.html</a><br>\n<a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/ValueSet-us-core-documentreference-category.html\">https://build.fhir.org/ig/HL7/US-Core-R4/ValueSet-us-core-documentreference-category.html</a></p>",
        "id": 235414467,
        "sender_full_name": "Hayden Bader",
        "timestamp": 1618952436
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  - should we add a code to the DocRef.category valueset in US Core for the documents generated by the <a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/OperationDefinition-docref.html\">$docref</a> operation on DocumentReference?  The example response doesn't include a category.  US Core doesn't have a DocRef profile for the CCDA container, so I guess we could just omit the category property completely for DocRefs for CCDAs?</p>",
        "id": 235416813,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1618952987
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> ?</p>\n<p>my answers:</p>\n<blockquote>\n<p>1) Should CCDA documents be categorized as \"clinical-notes\"</p>\n</blockquote>\n<p>yes</p>\n<blockquote>\n<p>1) a) If so, could I use the associated LOINC class codes I have as additional codings on that category?</p>\n</blockquote>\n<p>Category element is 1..* so you could have additional category schemes if you want<br>\nI would discourage using additional codings to refine the category - its intent is to be a coarse grouping element. The type is where you define the document. (e.g. Progress Note)</p>\n<blockquote>\n<p>1) b) If not, I imagine I'd want to use the existing class codes as the category, right?</p>\n</blockquote>\n<p>see above answer,  a fine grained categorization blurs into the type element and I would stick to type.</p>",
        "id": 235423996,
        "sender_full_name": "Eric Haas",
        "timestamp": 1618956514
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191764\">Cooper Thompson</span> <a href=\"#narrow/stream/179166-implementers/topic/CCDA.20DocumentReference.20Category/near/235416813\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191401\">Eric Haas</span>  - should we add a code to the DocRef.category valueset in US Core for the documents generated by the <a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/OperationDefinition-docref.html\">$docref</a> operation on DocumentReference?  The example response doesn't include a category.  US Core doesn't have a DocRef profile for the CCDA container, so I guess we could just omit the category property completely for DocRefs for CCDAs?</p>\n</blockquote>\n<p>I don't know what you mean by \"US Core doesn't have a DocRef profile for the CCDA container,\" but In the next version of US Core we have relaxed the constraint on $docref so there is only a recommendation that the server SHOULD return a US Core Docref Profile.</p>",
        "id": 235424597,
        "sender_full_name": "Eric Haas",
        "timestamp": 1618956875
    },
    {
        "content": "<p>If your system tracks a generic 'Progress Note', and very specific progress notes -  'Dialysis and Therapeutic apheresis Progress note' then fine to use Category = Progress Note.</p>",
        "id": 235494193,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1619004963
    },
    {
        "content": "<p>It still should be a relatively course grouping.</p>",
        "id": 235494235,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1619004990
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> - you really think C-CDA documents would be considered a clinical-note?  That seems very odd to me.  C-CDA documents <em>could</em> contain some note information, but it doesn't make sense to me to consider the C-CDA itself a note.  I'll admit I'm not a C-CDA expert though, so if that does actually make sense, I'd be interested in learning the specifics around why.</p>",
        "id": 235511456,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1619012441
    },
    {
        "content": "<p>There is a mapping between CDA and DocumentReference in the FHIR core spec -- <a href=\"http://hl7.org/fhir/documentreference-mappings.html#cda\">http://hl7.org/fhir/documentreference-mappings.html#cda</a></p>",
        "id": 235512469,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619012831
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191990\">@Emma Jones</span> <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> <span class=\"user-mention\" data-user-id=\"192383\">@Tone Southerland</span> <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span>  -- is there general guidance in C-CDA or an IHE profile using C-CDA that would answer this?</p>",
        "id": 235512915,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619012996
    },
    {
        "content": "<p>There is general guidance about C-CDA use of clinical notes in the C-CDA Companion Guide Release 2 - see section 2.7<br>\n<a href=\"http://www.hl7.org/ccdasearch/pdfs/Companion_Guide.pdf\">http://www.hl7.org/ccdasearch/pdfs/Companion_Guide.pdf</a></p>",
        "id": 235557700,
        "sender_full_name": "Emma Jones",
        "timestamp": 1619029173
    },
    {
        "content": "<p>I think that is the other way around.  That is about how to represent clinical notes in a C-CDA.  The question we have is what DocRef category should be used to describe a C-CDA.  For example, if we have an CCD in C-CDA format, what DocRef.category should that have.  \"clinical-note\" doesn't seem like the right category to describe a CCD.</p>",
        "id": 235558728,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1619029643
    },
    {
        "content": "<p>While it may be a stretch to call CCD a \"Clinical Note\", once its created it is most certainly a \"clinical document\". Many of the other Documents in C-CDA are \"true\" Clinical Notes (Discharge Summary, Transfer Summary, Referral Note, Consultation Note, or Progress Note). The most valuable aspect when referencing a document is the reference to the actual documentType anyway - and all of the documentTypes in C-CDA are in that set (and more of course (scale-type = \"doc\")). In US Core, the binding is to DocumentReferenceCategory is extensible - so you could just repeat the 34133-9\" Summarization of Episode Note\" if you wanted, if you don't want to consider it a clinical-note and therefore \"there is no applicable concept in value set (based on human review)\" and it adds value to you document management system to do so</p>",
        "id": 235588266,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1619041922
    },
    {
        "content": "<p>having everything called a clinical-note is not helpful. Surely there is a different category for summary than clinical-note.<br>\nHow about SNOMED-CT 422735006 \"Summary clinical document\"?</p>",
        "id": 235662008,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619092198
    },
    {
        "content": "<p>My reservation with using that SNOMED is that we'll then have two codes for DocRef.category:  clinical-notes and 422735006.  Conceptually those make sense, but just visually they are so very different.  Using a code like summary-document just makes it more consistent.</p>",
        "id": 235891939,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1619204381
    },
    {
        "content": "<p>Sorry for the long hiatus - I'm back to this question. </p>\n<p>In general, what I've picked up is the intent of category and type are to filter DocumentReference by a coarse-grained grouping and a finer-grained grouping respectively. </p>\n<p>From what I know about our C-CDAs we are usually using them to summarize information - like a patient's information or what happened in an encounter. These documents are definitely clinical information as <span class=\"user-mention\" data-user-id=\"191991\">@Gay Dolin</span> mentioned, but don't really align with my understanding of \"clinical-note\" at least, so I'd also hope that we could update the US Core category profile to allow something like \"summary-document\" as <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>  mentioned.</p>\n<p>I think that would give an added benefit to the US Core profile in that it would appear a little more flexible. Right now, it kind of looks like everything in the US Core profile will be a \"clinical-note\". Now, that's not really the case because the binding on category is extensible. I'd just like to note that with only one example, the use-cases for category can give the appearance that all everything that would be a US Core note would be a clinical-note - which others noted wouldn't be super helpful when attempting to search/filter for certain pieces of data.</p>\n<p>Short version:<br>\nOur CCDAs do contain clinical data but that appears to me to run towards a potential problem where too many DocumentReferences are called \"clinical-notes\". For our use-case, our CCDAs are usually used to summarize other clinical information, so I think using something along those lines as a broad category that can be drilled down on using type would be the most desirable.</p>\n<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> does this change your answer to the previous question?</p>",
        "id": 237698069,
        "sender_full_name": "Hayden Bader",
        "timestamp": 1620322323
    }
]