[
    {
        "content": "<p>This is my first post. I am new to HL7. I am wondering if anyone with experience building an EHR system would recommend the HL7 CDA standard? I am currently recommending HL7 FHIR, but believe that using CDA is  not a wise choise. Thoughts anyone? Is FHIR being used for document architecture, content?</p>",
        "id": 153955160,
        "sender_full_name": "Rachel Morehouse",
        "timestamp": 1525155983
    },
    {
        "content": "<p>Would anyone who is recommending standards for and EHR system recommend the use of CDA with FHIR? I have selected FHIR as a msessing standard.</p>",
        "id": 153955161,
        "sender_full_name": "Rachel Morehouse",
        "timestamp": 1525156068
    },
    {
        "content": "<p>The answer is: \"it depends\".  Looking at the timezone of your profile you're located in the US, and as such you a) may have to implement CDA for legal/financial reasons, b) you may have to implement it because all partners whom you exchange data with support CDA. Assuming one gets to choose an interoperability standard  without looking at what others are using is probably not a good idea.<br>\nIn general CDA is much more mature than FHIR documents with equivalent clinical content, many of the clinical resources in FHIR have a low maturity level at this point in time. However, for use cases with a limited scope FHIR Documents is certainly mature enough to be used. IMHO it'll take a year or two for FHIR to have created the necessary maturity on the clinical resources for it to be truly a full equivalent/replacement for CDA documents.</p>",
        "id": 153955168,
        "sender_full_name": "René Spronk",
        "timestamp": 1525161132
    },
    {
        "content": "<p>The question is sort of equivalent to asking a mother \"what's your favorite child?\" - she may have one, but isn't likely to say so :)  (Also, the viewpoints on this forum are probably slightly biased - for a well-rounded opinion, you might also ask the question on the Structured Documents work group list serve.)</p>\n<p>FHIR is capable of expressing the same content CDA can and generally has a lower learning curve, plus it allows easy transfer of data between documents/messaging/REST/services, so it gives you more architectural flexibility.  (And FHIR REST tends to mean less negotiation/customization when interfacing with partners).  So I agree with Rene that if you're not constrained by communication partners, FHIR is probably the way to go.  If you need to support CDA (or more specifically C-CDA), then you might also look at supporting FHIR internally, but mapping your data to and from the C-CDA spec.  There's active work now on creating a standard set of transformations to help support this process - though there are some fuzzy areas where transformation won't be as clean/simple as we might like.</p>",
        "id": 153955217,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525179967
    },
    {
        "content": "<p>This has been very helpful and I appreciate your insights. You have clarified some of my concerns and have provided me with more insight to think about. Thanks!</p>",
        "id": 153955272,
        "sender_full_name": "Rachel Morehouse",
        "timestamp": 1525198965
    },
    {
        "content": "<p>I like that \"what's your favorite child\" analogy.</p>",
        "id": 153955467,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1525291500
    }
]