[
    {
        "content": "<p>Hello - I am a student at GaTech and as part of my course I am trying to implement a CDS Hook.  This CDS Hook is supposed to query an external service and show some results. However I  keep on getting \"connection refused\" error. I know the external service is up cause I can query it outside of CDS Hook. I am using the sandbox code from <a href=\"https://github.com/cds-hooks/sandbox\" target=\"_blank\" title=\"https://github.com/cds-hooks/sandbox\">https://github.com/cds-hooks/sandbox</a></p>\n<p>Any pointers on what might be going on? Or if somebody has faced this issue before. </p>\n<p>TIA</p>",
        "id": 153917688,
        "sender_full_name": "Venu Shankar",
        "timestamp": 1509912180
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"194741\">@Venu Shankar</span> - we have a #<strong>cds-hooks</strong> stream where you can ask all of your CDS Hooks questions. Perhaps you could post some error logs from your server to help provide more context?</p>",
        "id": 153918077,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1510087565
    },
    {
        "content": "<p>I'm currently trying to send a POST request to my api for a CDS-Hooks implementation, but I'm confused on the context and the prefetch fields of the request. My goal is just to send the practioner's email as well as the patient's mrn. I'm currently sending: <br>\n{<br>\n\"Hook\": \"patient-view\",<br>\n\"HookInstance\": \"1234\",<br>\n\"Context\": {<br>\n\"email\": \"<a href=\"mailto:test@test.com\" title=\"mailto:test@test.com\">test@test.com</a>\",<br>\n\"mrn\": \"9999999\"<br>\n}<br>\n}<br>\nSo my questions are:<br>\nDoes the prefetch field work by using data in the context? Does the context field get its values from the prefetch? or are they both prepopulated<br>\nHow can I check if the ContactType in the practitioner field is type email before getting the value?<br>\nWhat form should my post request look like in addition to what I have?</p>\n<p>Any help is appreciated, thank you!</p>",
        "id": 165174207,
        "sender_full_name": "Michael Avendano",
        "timestamp": 1557330138
    },
    {
        "content": "<p>Hi,<br>\nI have a question re: implementing CDS hooks, my question is about how to make the calls to the CDS system to invoke the hook<br>\nwill my EHR application be responsible on invoking the hook when needed, or this is something that should happen on the FHIR server automatically. and in that case what will the response from FHIR to the EHR look like, will it have the resources + CDS cards ?</p>",
        "id": 175308394,
        "sender_full_name": "Ahmed Mohamed",
        "timestamp": 1568094225
    },
    {
        "content": "<p>EHR system invokes the hooks. Suggest that further discussion happen on <a class=\"stream\" data-stream-id=\"179159\" href=\"/#narrow/stream/179159-cds-hooks\">#cds hooks</a></p>",
        "id": 175309926,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568096549
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <br>\nI am reading through the topics there.</p>",
        "id": 175402600,
        "sender_full_name": "Ahmed Mohamed",
        "timestamp": 1568179826
    }
]