[
    {
        "content": "<p>We would like to implement this use-case with CDS Hooks.<br>\n- CDS request for starting of a calculation.<br>\n- Returning the result of this calculation.</p>\n<p>Quite basic, but the calculation takes a long time, typical several minutes.<br>\nI don't think that sending the response after finishing the calculation is good practice.<br>\nSo the idea is to send a CDS response after basic intake of pre-fetched data with intake status.<br>\nAfter the calculation is completed, it is then needed to push the result.<br>\nThe only way within CDS Hook context I see is mis-use a pre-fetch cycle to push the result.<br>\nNot good practice either as seen from standpoint of consistent standard use, but already somewhat better from general perspective ...<br>\nPolling using a second CDS request is something I would not like at all.</p>\n<p>Please advice. Am I missing or misinterpreting something?</p>\n<p>Thanks in advance, Bart.</p>",
        "id": 153903547,
        "sender_full_name": "Bart van der Worp",
        "timestamp": 1503578323
    },
    {
        "content": "<p>is this actually a cds-hooks thing? as in, integrated with the UI? What does the flow look like from the user's perspective?</p>",
        "id": 153903548,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1503578391
    },
    {
        "content": "<p>Yes, the result is a link to the result. As such a normal CDS use as far as I understand. The point is the very long elapsed time of the calculation.<br>\nMore detailed consideration would be to send the link already in the first reply, it is known then, but we would also like to synchronize the end of the calculation. This could also result in error status that the caller system needs to know, so that's beyond only presenting it.</p>",
        "id": 153903549,
        "sender_full_name": "Bart van der Worp",
        "timestamp": 1503578684
    },
    {
        "content": "<p>It's a good use case, and not one the current CDS Hooks spec supports very well. You've identified one workaround, which is a forward pointer to a result that can be generated right away, even before the result is available. Users can click the link and see a page that you host to indicate status and, when available, the final result.</p>",
        "id": 153903550,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1503578806
    },
    {
        "content": "<p>Thinking about how the spec would need to change to accommodate this use case better: we could say something like 1) response cards can contain a \"pollAgainAfter\" interval and perhaps a \"pollAgainUrl\" that would return a replacement card when content was available, or 2) the EHR could host an endpoint specifically for asynchronous results, and the external service could push to that endpoint when ready.</p>",
        "id": 153903551,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1503578883
    },
    {
        "content": "<p>I would prefer 2) in our current case, but both seem feasible I guess.<br>\nWe need to proceed, so for the time being we could mis-use the pre-fetch for pushing the result as a work around?<br>\nWe could arrange a special FHIR 'resource' to create an endpoint to push the result to.<br>\nAnd ofcoarse, this needs to discussed clearly in detail with the builders of the requesting system.</p>",
        "id": 153903558,
        "sender_full_name": "Bart van der Worp",
        "timestamp": 1503579381
    },
    {
        "content": "<p>I'm not sure I follow what you mean about prefetch... prefetch is a way to send data from the EHR to a CDS Service, but you're talking about returning data from the CDS Service to the EHR.</p>",
        "id": 153903561,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1503579565
    },
    {
        "content": "<p>Yes, but pre-fetch is initiated by the CDS service as I understand and as such could be mis-used as a push by posting our result in stead of or added to the standard content of the pre-fetch request?</p>",
        "id": 153903562,
        "sender_full_name": "Bart van der Worp",
        "timestamp": 1503579693
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153903563,
        "sender_full_name": "Bart van der Worp",
        "timestamp": 1503579775
    },
    {
        "content": "<p>(You can edit a previous post by hitting the left arrow, or clickinging the post and choosing \"Edit\".)</p>",
        "id": 153903564,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1503579798
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 153903565,
        "sender_full_name": "Bart van der Worp",
        "timestamp": 1503579868
    },
    {
        "content": "<p>(sure!)</p>",
        "id": 153903566,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1503579880
    },
    {
        "content": "<p>I don't follow what you're saying — pre-fetch is initiated by the EHR (based on a client's static, configuration-time settings).</p>",
        "id": 153903567,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1503579882
    },
    {
        "content": "<p>BTW this may be a better topic for <a href=\"https://chat.fhir.org/#narrow/stream/cds-hooks\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/cds-hooks\">https://chat.fhir.org/#narrow/stream/cds-hooks</a></p>",
        "id": 153903568,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1503579921
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153903569,
        "sender_full_name": "Bart van der Worp",
        "timestamp": 1503579930
    },
    {
        "content": "<p>I mixed terminology ...<br>\nThe CDS request contains pre-fetched data. This is not what I mean.<br>\nThe CDS request also contains a EHR FHIR server URL that can be used to ad-hoc request additional data from the EHR. This is what I erroneously called 'prefetch' ...<br>\nWe could use this URL to push the result from the CDS service to the EHR as a temporary workaround.</p>",
        "id": 153903571,
        "sender_full_name": "Bart van der Worp",
        "timestamp": 1503580582
    },
    {
        "content": "<p>Can an admin move this topic to cds-hooks please?</p>",
        "id": 153903580,
        "sender_full_name": "Bart van der Worp",
        "timestamp": 1503585486
    },
    {
        "content": "<p>Topics don't move, but we can pick up the convo there :-)</p>",
        "id": 153903581,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1503585864
    }
]