[
    {
        "content": "<p>Hello,</p>\n<p>we are implementing an EHR-type application and are currently looking into dynamically handling integration with 3rd party CDS services. We started adopting CDS Hooks and that works well so far in a strongly defined context. As we are thinking about more advanced use cases, we are struggling with matching CDS Hooks to those use cases.</p>\n<p>The basic scenario is that for a particular hook type (e.g. \"treatment-recommendation\") we have various vendors that can provide support (I call them \"CDS Providers\") and within each vendor, they offer several services (\"CDS Services\"). For example, one 3rd party has 3 services for lung cancer patients (one predicting outcome, the other offering treatment selection support, etc.) and 2 services for Head and Neck cancer. Another 3rd party has various other combinations of services based on certain inclusion/exclusion criteria.</p>\n<p>Use Case 1: Semantic filtering<br>\nWe only want to show the user CDS services that make sense in the current EHR context. E.g. a lung cancer patient should not be offered H&amp;N-specific services. <br>\nThe discovery mechanism does not seem to lend itself to that since it is a simple GET call without passing any context that the CDS Provider could use to narrow down the responses.<br>\nWe could use the normal CDS Service call. The CDS service would then return x App Link Cards with links to context-matching apps? The links to the apps are very basic though and there is no way to provide additional prefetch instructions for each specific service. In this case we would be using the CDS Service to discover the actual CDS Services.</p>\n<p>Use Case 2: Admin-level, preselection<br>\nCDS Providers often have \"several  flavors\" of algorithms for the same questions (e.g. guideline1, guideline2, guidelineX for breast cancer). A hospital typically decides to go with one particular guideline and does not want their users to see the other options when requesting the decision support within a patient context.<br>\nHow would we go about that using CDS Hooks? At admin-time, there is no patient context. We would be able to create a general context (e.g. show me all available services for lung cancer patients older than 65 and female). When we get the response from the CDS service, we are not asking for actual decision support, just for a list of CDS Services that match the context. In order for the admin to select which services should be available at the point of care.</p>\n<p>The question that I keep circling around is:<br>\nIf a vendor has several services for the same hook type, do we register one CDS Service for that vendor OR do we register one CDS Service per vendor service category? E.g. One \"VenderX\" service that figures out the details during the user interaction OR one \"VendorX-LungCancer\" and one \"VendorX-H&amp;NCancer\" service? In the latter example, where you draw the line seems arbitrary.</p>\n<p>CDS Hooks seem to be very user-interaction focused. Which makes it hard to do some preselection without the user.</p>\n<p>I hope I could express my thoughts and the challenges properly. I have a few more items to cover. Just want to get the conversation started.</p>\n<p>Any feedback would be greatly appreciated!</p>",
        "id": 153919441,
        "sender_full_name": "Wolfgang Wiessler",
        "timestamp": 1510658869
    },
    {
        "content": "<p>You might want to post this over on the <a href=\"https://chat.fhir.org/#narrow/stream/cds-hooks\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/cds-hooks\">cds-hooks</a> stream</p>",
        "id": 153919458,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510671293
    },
    {
        "content": "<p>Thanks. New to Zulip and mixed up the streams</p>",
        "id": 153919465,
        "sender_full_name": "Wolfgang Wiessler",
        "timestamp": 1510671896
    },
    {
        "content": "<p>No worries.  The pros do it from time to time too :)</p>",
        "id": 153919475,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510672282
    },
    {
        "content": "<p>Hi Wolfgang, <br>\nwelcome to the FHIR community!<br>\nYou may also want to join this stream, I guess: <a href=\"https://chat.fhir.org/#narrow/stream/german.20(d-a-ch)\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/german.20(d-a-ch)\">https://chat.fhir.org/#narrow/stream/german.20(d-a-ch)</a> :)</p>",
        "id": 153919484,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1510672659
    },
    {
        "content": "<p>Hello, I'm working with our health system to integrate CDS Connect authoring tool into CDS Hooks but we are looking for other health systems that have successfully ran this for health operations?  Any takers to show us what an end-to-end CQL authoring to FHIR implementation into a CDS service like Hooks?  Thanks for considering.</p>",
        "id": 274485352,
        "sender_full_name": "Majid Afshar",
        "timestamp": 1646703974
    },
    {
        "content": "<p>You might want to ask on the <a class=\"stream\" data-stream-id=\"179159\" href=\"/#narrow/stream/179159-cds-hooks\">#cds hooks</a> stream</p>",
        "id": 274487613,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646706336
    }
]