[
    {
        "content": "<p>Hi,<br>\nCan anyone help me understand  when a resource holds a reference to another resource where the referenced resource is on a different FHIR server, how chained searches are handled? It would be ideal if they can work the same way as if all the resources sit on the same server, however I am not sure of all the practicalities of this (i.e. how the downstream servers are queries, how security is carried etc).</p>\n<p>Cheers,<br>\nNichol</p>",
        "id": 224423208,
        "sender_full_name": "Nichol Hill",
        "timestamp": 1611886289
    },
    {
        "content": "<p>FHIR is silent on this.  If you can figure out how to make it work in your environment, you're free to do so.  I'm not aware of any implementations that actually <em>do</em> though.</p>",
        "id": 224431344,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611896729
    },
    {
        "content": "<p>Definitely a question that's being raised increasingly, given the increasing number of (federated) implementations. Worthy of a brainstorm session at one of the HL7 meetings. <br>\nFor relatively simple searches I could imagine that the primary server fetches a copy of the 'remote resource(s)', [temporarily] stores them locally, and executes the query locally. This doesn't scale, but it'll get the job done. <br>\nFor complex searches, one may have to somehow break the search into pieces and have them executed on multiple servers. That sounds like a challenge ..</p>",
        "id": 224442989,
        "sender_full_name": "René Spronk",
        "timestamp": 1611909675
    },
    {
        "content": "<p>Very few server implement chained search to begin with</p>",
        "id": 224479368,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1611931422
    },
    {
        "content": "<p>The CDRs that are part of the 'Fireball alliance' all support this - but I agree that your average Facade may not.</p>",
        "id": 224498529,
        "sender_full_name": "René Spronk",
        "timestamp": 1611938248
    },
    {
        "content": "<p>I don't think that that this should be visible in the interface; it's a private implementation detail</p>",
        "id": 224943054,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612303083
    }
]