[
    {
        "content": "<p>We'll add a \"device.component\" to the Device Resource, supporting N levels of devices. <br>\nSome questions:</p>",
        "id": 153970214,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529253881
    },
    {
        "content": "<p>1. It seems more reasonable to put \"device.component\" than \"device.parent\". This way it's the parent that points to eventual children. Is this agreeable?</p>",
        "id": 153970215,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529253890
    },
    {
        "content": "<p>2. Device.component can be implemented in different ways:<br>\na) a reference to Device, so if we need to define the component, it is either a contained resource or must exist as an instance<br>\nb) a nested Device (i.e. allowing to repeat the whole structure), so that we can, in one single resource, define the components as well. (actually I am not sure it is possible to nest the device root, but let's assume so)<br>\nOn this point I would lean to a), because while with a) the device component can be contained  or autonomous, with b) it can only be contained, i think.<br>\na) is closer to the current design where a device component is an autonomous resource, which seems ok (IRL components may become devices and vice-versa).</p>",
        "id": 153970216,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529254055
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191968\">@Ioana Singureanu</span> <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> Please help: whom should we ping to comment on this?</p>",
        "id": 153970217,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529254354
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192966\">@Stefan Karl</span></p>",
        "id": 153970218,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529254368
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> <br>\n1. Currently DeviceComponent points to the Device resource. This follows the rule that the reference should be in the resource that is usually created second - e. g. a module (DeviceComponent) that is plugged into a system (Device). The \"parent\" reference will also make it easier to detect the top-level device in a tree structure by searching for a Device that has no parent. What is the benefit of changing direction?<br>\n2. I agree making it a separate resource for the reason you mentioned.<br>\nThere is a proposal for a merged Device resource at this <a href=\"http://wiki.hl7.org/index.php?title=Device-DeviceComponent_Merge\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Device-DeviceComponent_Merge\">wiki page</a>, which has been discussed in the Devices workgroup.</p>",
        "id": 153970241,
        "sender_full_name": "Stefan Karl",
        "timestamp": 1529309757
    },
    {
        "content": "<p>I think we could also have the child pointing to parent, yes. (There was no specific reason for doing the other way around, so we can choose)</p>",
        "id": 153970293,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529344874
    },
    {
        "content": "<p>when defining (e.g. in a catalog) or identifying (e.g. in an order or procedure) a device, i think it makes more sense to point to the parent, no?</p>",
        "id": 153970294,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529344935
    },
    {
        "content": "<p>i.e.  \"for this procedure, use this device (and whatever modules you need from it)\" seems more natural.</p>",
        "id": 153970295,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529344984
    },
    {
        "content": "<p>this may not necessarily require to chose the top-down approach (child pointing to parent). We have to discuss to see which one to use</p>",
        "id": 153970297,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529345128
    },
    {
        "content": "<p>we should use the content of the wiki page to check if we are missing something (although that page includes kind and instance).</p>",
        "id": 153970298,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529345364
    },
    {
        "content": "<p>component should point to parent.  whether is Device or DeviceComponent.</p>",
        "id": 153970365,
        "sender_full_name": "Eric Haas",
        "timestamp": 1529358494
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  did you look at <a href=\"#narrow/stream/103-Orders-and.20Observation.20WG/subject/GF.2315596.20.20Request.20cardinality.20of.20Device.2Etype.20be.20changed.20from/near/132231\" title=\"#narrow/stream/103-Orders-and.20Observation.20WG/subject/GF.2315596.20.20Request.20cardinality.20of.20Device.2Etype.20be.20changed.20from/near/132231\">this</a> I thought was pretty straightforward except for the specialization bit that Brian talked about.  Whatever that is should be a) defined so we all know what it is and then b) decide if is in 80% or extension.</p>",
        "id": 153970367,
        "sender_full_name": "Eric Haas",
        "timestamp": 1529358738
    },
    {
        "content": "<p>We will merge Device and DeviceComponent. The specialization can be added and the rest we can converge on. I am building a first iteration of the revised resources now.</p>",
        "id": 153970370,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529359169
    },
    {
        "content": "<p>Can someone tell me what the hierarchy will look like with the Device-DeviceComponent merge for PHD devices? <br>\nFor a PHD that connects via a mobile application, will the top-level Device be the PHD or the mobile app?</p>",
        "id": 153974340,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1531154043
    },
    {
        "content": "<p>In line with the last question, can someone give me a quick explanation of the modeling of a PHD (personal health device). What I'm looking for is the hierarchy/relationships/resources to represent the PHG (gateway), PHD (device), and Observation. I'd like to know what the prescribed model should look like in STU3, and what it will look like in R4. <br>\n<span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span>   anyone? <br>\nThanks!</p>",
        "id": 154005523,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1538597797
    },
    {
        "content": "<p>sure, can you give an example, to instanciate the resources ?</p>",
        "id": 154005524,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538597884
    },
    {
        "content": "<p>(and sorry for missing the last question)</p>",
        "id": 154005525,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538597906
    },
    {
        "content": "<p>A bluetooth enabled glucometer (PHD), communicating  data to a mobile phone application (PHG), sending data to a server which then persists to FHIR.</p>",
        "id": 154005528,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1538597946
    },
    {
        "content": "<p>ok, first, i I assume your question is NOT \"are apps devices?\"</p>",
        "id": 154005532,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538598127
    },
    {
        "content": "<p>well, yeah, I don't have clarity there. Is the app a Device, a DeviceComponent, or is the whole combined \"system\" simply an abstract Device.</p>",
        "id": 154005534,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1538598190
    },
    {
        "content": "<p>sure, let's check how it works. but i assume that the app is part of the construct and you don't want to exclude the app</p>",
        "id": 154005535,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538598231
    },
    {
        "content": "<p>the nice thing now is that there is no DeviceComponent</p>",
        "id": 154005536,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538598258
    },
    {
        "content": "<p>there is a device that can contain other devices</p>",
        "id": 154005537,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538598267
    },
    {
        "content": "<p>the Device / DeviceComponent (and now \"Device with children Devices\")  was conceived for a \"hierarchical composition\" of devices - a cartridge belonging to a device, or a syringe in a perfusion system, or a lead in the ECG...</p>",
        "id": 154005538,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538598292
    },
    {
        "content": "<p>The PHD is definitely a Device resource.<br>\nIf the PHG is doing something with the information and if you want to consider that as a relevant part of the  system (I would), and not a passive gateway, you have another device.</p>",
        "id": 154005552,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538598709
    },
    {
        "content": "<p>now, the questions for feedback:</p>",
        "id": 154005553,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538598717
    },
    {
        "content": "<p>do you see the app as a child of the PHD (i mean is the app something that comes with the device)?<br>\nor is the app a more generic aggregator or communication system that handles this and other PHDs?</p>",
        "id": 154005556,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538598790
    },
    {
        "content": "<p>You have two devices. Whether the PHG is a device on its own or the PHG is a part of a \"configuration\" together with the PHD, i would say it depends on how they are designed to work with each other.</p>",
        "id": 154005558,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538598890
    },
    {
        "content": "<p>but my first guess would be \"PHG / App\" is parent device, PHD is another device</p>",
        "id": 154005562,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538599013
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193261\">@craig mcclendon</span>  Continua has specified guidelines for FHIR uploads. THere is also an implementation guide submitted for ballot based upon DSTU3. This implementation was a best fit scenario given DSTU3. However, with the Device/DeviceComponent merge in R4, a new mapping has been specified and an IG guide for it is in development. I am writing it. You can find the R4 IG on github/HL7. The DSTU3 version is here<br>\n<a href=\"https://simplifier.net/guide/pchapersonalhealthdevicedataimplementationguide/home2\" target=\"_blank\" title=\"https://simplifier.net/guide/pchapersonalhealthdevicedataimplementationguide/home2\">https://simplifier.net/guide/pchapersonalhealthdevicedataimplementationguide/home2</a></p>\n<p>The R4 version will be the only mapping that will be part of the final Continua Guidelines.</p>\n<p>I have implemented both for all Continua PHDs</p>",
        "id": 154005564,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1538599057
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> is the IG called uv-pocd?</p>",
        "id": 154005572,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1538599451
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> is the IG called uv-pocd?</p>\n</blockquote>\n<p>No. That is PoCD devices (Point of Care). It is called PHG</p>\n<p><a href=\"https://github.com/HL7/PHD\" target=\"_blank\" title=\"https://github.com/HL7/PHD\">https://github.com/HL7/PHD</a></p>\n<p>Its a work in progress, most of it is done.</p>\n<p>Oh yuulk. That's just how to build it which is a major pain. I will attach a zip file that you can view in any browser (after unzipping)</p>",
        "id": 154005575,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1538599492
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/XJUX7kY7cWL8e_sP1A1vAagA/full-ig.zip\" target=\"_blank\" title=\"full-ig.zip\">full-ig.zip</a></p>\n<p>hope that worked.</p>",
        "id": 154005578,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1538599791
    },
    {
        "content": "<p>Thanks guys. <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span>  - I'm still confused on the proper way to represent things in STU3. The Continua guidelines show an example of a PHD represented as a Device, and a PHG represented as a Device.  And the \"Phd Coincident Time Stamp Observation\" shows an Observation referencing a DeviceComponent, which is possibly a typo?</p>",
        "id": 154005583,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1538600532
    },
    {
        "content": "<p>I can see a few ways to model it. </p>\n<p>App/PHG (Device)<br>\n  PHD (DeviceComponent)<br>\n     DeviceMetric (dummy resource to contain relationship)<br>\n         Observation</p>\n<p>The above is problematic for many reasons. </p>\n<p>A variation: </p>\n<p>App/PHG (DeviceComponent)<br>\n  PHD (DeviceComponent)<br>\n     DeviceMetric (dummy resource to contain relationship)<br>\n         Observation</p>\n<p>More problematic.</p>\n<p>Or more simply: </p>\n<p>Device (an abstract combination of the PHD and PHG)<br>\n  Observation<br>\nSimple, but is it correct? </p>\n<p>Or use extenentions on Device to mimic the R4 modeling?</p>",
        "id": 154005587,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1538600805
    },
    {
        "content": "<p>^zulip took out my formatting, but assume the resource under another resource reference it in the above - ie a parent-child hierarchy</p>",
        "id": 154005588,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1538600943
    },
    {
        "content": "<blockquote>\n<p>Thanks guys. <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span>  - I'm still confused on the proper way to represent things in STU3. The Continua guidelines show an example of a PHD represented as a Device, and a PHG represented as a Device.  And the \"Phd Coincident Time Stamp Observation\" shows an Observation referencing a DeviceComponent, which is possibly a typo?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"193261\">@craig mcclendon</span> That is because there were many problems trying to map PHDs to FHIR and there were many trials. You are seeing the results of that confusion.<br>\nIn the end, before R4 came out, the PHD and PHG were represented in the DeviceComponent ONLY. Anything else is an error or something from development and trials.  You may not have the final Continua Guidelines.There is an Android application in the playstore LniPlugfestPHG which does the final DSTU3 version of the FHIR upload. Supports HDP and USB 20601 devices and BTLE.</p>\n<p>R4 merged DeviceCOmponent and Device and the DeviceCOmponent is gone. New elements were also added in R4 much better for PHD.</p>",
        "id": 154005589,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1538600949
    },
    {
        "content": "<p>Appreciate the help.. </p>\n<p>If I need to model this in STU3, would I be very wrong (or run into problems) if I:</p>\n<p>a) Combine the PHD and PHG into a single Device resource<br>\n   or <br>\nb) Add an extension to Device to mimic the R4 Device.parent attribute so I can represent both PHG and PHD as Devices?</p>",
        "id": 154005591,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1538601465
    },
    {
        "content": "<p>.. to add to that, the DeviceComponent-only representation would be problematic for something like a smart inhaler or glucose pump which is administering medication as well as producing observations.</p>",
        "id": 154005592,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1538601655
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193261\">@craig mcclendon</span>  If you want to do your own mapping you can do what you want. The problem with FHIR  in DSTU3 was that the System-Model information (manufacturer name and model number) were in the Device and the Production-Spec information was in the DeviceCOmponent. IN the last versions of DSTU3 some fixes were made in the DeviceComponent so a PHD could be mapped ENTIRELY into the DeviceComponent without extensions. The PHG was mapped by assuming it had the same properties as a PHD in a MDS (which it really doesnt have).</p>\n<p>In the COntinua mapping, it is critical to report everything the device transmits by standard protocol. The last versions of DSTU3 did this with the addition of the DeviceComponent.properties element. Before that we used extensions in the DeviceComponent to model what would be in the properties.</p>\n<p>In the LNIPlugfestPHG you can set the FHIR to 4 different versions (the R4 is not the current R4 but the pre-merge case). Extensions are used in all the options prior to what is listed as R4 in the app (really 3.1.0).</p>\n<p>All this confusing crap goes away in 3.5.0/3.6.0</p>",
        "id": 154005593,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1538602033
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/asOP7kN_xL_McwtgOiTLTtcc/NoninBtle.json\" target=\"_blank\" title=\"NoninBtle.json\">NoninBtle.json</a> </p>\n<p>Here is a 3.1.0 upload of a BTLE  Nonin PulseOx</p>",
        "id": 154005595,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1538602246
    },
    {
        "content": "<p>So just to be clear, in R4 will the PHG be the parent Device and the PHD the child Device?</p>",
        "id": 154005597,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1538603339
    },
    {
        "content": "<p>hmmm, but that is problematic if a user sync's a PHD through two different PHGs.. for instance if they have the same app on a tablet and phone. You'd need to duplicate the PHD Device to capture both relationships if it is the child.</p>",
        "id": 154005598,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1538603635
    },
    {
        "content": "<p>Still up in the air.<br>\nI think what will be decided is that the PHG will be referenced in the OBSERVATION and not the Device. There will be no parent/child relation, because there is not. THere is another good reason NOT to do that. If the PHG is made a parent of the PHD, then every  PHG that uploads the Device resource for a given PHD will need to create its own resource that will differ only in the parent element. Same physical device with two resources. Not good. Since there is no way to use any existing element in the Observation to do this, the PHG will be in an extension. That will be the only extension in the PHD profile.</p>\n<p><span class=\"user-mention\" data-user-id=\"193261\">@craig mcclendon</span> I am at an HL7/FHIR meeting right now and they are shutting down. Will have to continue this later.</p>",
        "id": 154005599,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1538603671
    },
    {
        "content": "<p>That makes most the sense on quick inspection. The Observation should reference the PHD and the PHG separately.</p>",
        "id": 154005600,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1538603891
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"193261\">@craig mcclendon</span>,  is there a sample observation resource or documentations explaining this? I'm trying to do something similar,  An App that packages data from the phone (device)'s sensors into an Observation.</p>",
        "id": 163478301,
        "sender_full_name": "Raheel Sayeed",
        "timestamp": 1555427569
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194948\">@Raheel Sayeed</span>  - I am not sure what the current PHD profile has in it. Would be worth finding out. <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> ?     But what I am currently doing (in STU3) is creating two Devices, one for the sensor (PHD) and one for the phone/gateway (PHG). I have Observation.device reference the PHD. And I add a custom extension to Observation to reference the PHG. (If the devices group has defined a standard extension for that, it of course would be preferable to use that instead making up your own. ) I do not have the two Device resources reference each other in any way. The only relationship between them is linked through the Observations.  <br>\nThis approach has the downside that you cannot search for Observations from a particular PHG through FHIR directly. But for my cases the PHG association is mostly just for provenance/audit purposes.</p>",
        "id": 163481553,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1555429952
    },
    {
        "content": "<p>Yes, that's what I'm looking at. For some clarity that's specific to case:<br>\n if Observation.value is from the phone sensor, then the phone itself is PHD. And there's no need for a PHG. <br>\n--or--<br>\n because I'm using an app (running on the same phone), would the app then become a PHG?</p>",
        "id": 163482619,
        "sender_full_name": "Raheel Sayeed",
        "timestamp": 1555430818
    },
    {
        "content": "<p>I'm not a definitive expert, but I think it could still be useful to separate the two. Changes to the application version,  for instance, could affect the way the data is interpreted/processed. So you may want that information divorced from the sensor.  It also might make your information models more uniform if in the future you collect data from external devices communicating through an app on the phone.  But there are tradeoffs, and you could probably model it either way.</p>",
        "id": 163483833,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1555431678
    },
    {
        "content": "<p>Makes sense. There  are also complexities where different apps use the same \"embedded 3rd party frameworks\" that are responsible for harmonizing sensor derivatives. In this case, the 3rd framework/publisher is a reliable PHG. (this is true in my case)</p>",
        "id": 163484898,
        "sender_full_name": "Raheel Sayeed",
        "timestamp": 1555432618
    },
    {
        "content": "<p>In the PHD world where the PHD is a separate entity from the PHG, the important role of the PHG is handling time stamps from the PHD (which are often pretty bad). They are both corrected (if in error) and given an offset to UTC. That allows the measurement time stamp to be sent anywhere and one knows when it is.</p>\n<p>In your case the phone is both PHD and gateway. In that case, the 'PHD' is probably well synchronized to UTC and that can be indicated in the PHD Device resource. I do not think you need a PHG Device resource; just be sure to indicate the type of time stamp (base offset time) and the time synchronization protocol. This will tell the reader of the Observation that the device is synchronized to UTC and thus so are the measurement time stamps.</p>",
        "id": 163507289,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1555448907
    }
]