[
    {
        "content": "<p>Suppose my programming platform represents non-ASCII characters internally with their Unicode values, for example:<br>\n    \"た\" (HIRAGANA LETTER TA) = 0x305F<br>\nSo to put this in a field of type base64binary, I first have to base64-encode it, but before I can do that, I have to convert it somehow from a double-wide byte to a series of single-width bytes.  UTF-8 encoding comes to mind, in which case the value becomes:<br>\n    0xE3 0x81 0x9F<br>\nThis base64-encodes to:<br>\n    44Gf<br>\nSo that is what would go in the field value.  So my question this, if I then send this resource to another system, how is that system supposed to \"know\" that once the value is base-64 decoded, that it is still UTF-8 encoded?  Should UTF-8 encoding of the decoded value always be assumed?</p>",
        "id": 153902783,
        "sender_full_name": "Jorge de la Garza",
        "timestamp": 1503076932
    },
    {
        "content": "<p>First, you'd look the mime type to figure out what kind of file you're dealing with.  If the content is a text file, you can use a BOM to indicate to the text processor that it's dealing with UTF.  If your content is in some other encoding, you'd have to use whatever conventions (if any) are in place for that type of character encoding.  And of course, if someone sends you UTF without a BOM, you have all the same fun that exists today when someone sends an email attachment with text that's in an unexpected encoding.  FHIR doesn't fix that problem.  (Which is why PDF or other syntaxes that don't have the encoding issue will often be easier to use.)</p>",
        "id": 153902785,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1503077921
    },
    {
        "content": "<blockquote>\n<p>First, you'd look at the mime type</p>\n</blockquote>\n<p>The mime type of what?  This is in the context of a resource, for example, AuditEvent.entity.query.</p>",
        "id": 153902786,
        "sender_full_name": "Jorge de la Garza",
        "timestamp": 1503078384
    },
    {
        "content": "<p>I was assuming you were referring to Binary or the Attachment data type.  I agree that AuditEvent.event.query seems under-specified.  It's not clear how this content should be parsed when un-encoded.  Can you submit a change request for that to be clarified?  (Or alternatively to change the data type to Attachment which would allow conveying the mime type.</p>",
        "id": 153902788,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1503079833
    },
    {
        "content": "<p>Submitted: <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13759&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13759&amp;start=0\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13759&amp;start=0</a><br>\nThanks Lloyd.</p>",
        "id": 153903014,
        "sender_full_name": "Jorge de la Garza",
        "timestamp": 1503333373
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192535\">@Jorge de la Garza</span> The meaning of the AuditEvent.entity.query and AuditEvent.entity.detail encoding is specific to the AuditEvent.type,  AuditEvent.subtype,  AuditEvent.entity.type, and AuditEvent.entity.role.   This is just like in DICOM. We will improve the element definitions using your <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13759\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13759\">GF#13759</a>. The base64 is intended only to be a general-use and safe container for event specific data blobs.</p>",
        "id": 153903390,
        "sender_full_name": "John Moehrke",
        "timestamp": 1503493396
    }
]