[
    {
        "content": "<p>Our spec says that's clients MUST include <code>; charset=UTF-8</code> as part of a content type header when posting data -- but reference servers are happy to accept `Content-Type: application/fhir+json\" without the charset specifier. Should our servers be stricter, or should the spec be looser? Or do we like the status quo?</p>",
        "id": 153952322,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1523652941
    },
    {
        "content": "<p>validating servers should. Not so sure about reference servers</p>",
        "id": 153952325,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523653300
    },
    {
        "content": "<p>There is a tension between HTTP default behavior (iso-8859-1) and FHIR (everything utf-8). When you say application/fhir+... you sort of imply that content shall be utf-8 regardless of HTTP?</p>",
        "id": 153952328,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1523653401
    },
    {
        "content": "<p>The ISO-8859-1 fallback mentioned in RFC 2616 for HTTP 1.1 only applied to \"text/...\" MIME types, so defaulting to ISO-8859-1 shouldn't have been applicable to \"application/...\" types like fhir+xml. Also, that fallback has since been explicitly removed, ref: RFC 7231 Appendix B:</p>\n<p>|   The default charset of ISO-8859-1 for text media types has been<br>\n|   removed; the default is now whatever the media type definition says.<br>\n|   Likewise, special treatment of ISO-8859-1 has been removed from the<br>\n|   Accept-Charset header field.</p>",
        "id": 153952331,
        "sender_full_name": "Luis Maas",
        "timestamp": 1523656047
    },
    {
        "content": "<p>re: \"the default is whatever the media type definition says\"...<br>\nThe application/fhir+json and application/fhir+xml definitions both state that if the charset parameter is present, its value must be UTF-8.<br>\nThis isn't quite the same as saying UTF-8 is the only allowable character encoding, so it might be worth updating of the MIME-type registry to include something to that effect, e.g. UTF-8 is also the default if no charset is specified.</p>\n<p>If interested, the definitions are here: <a href=\"https://www.iana.org/assignments/media-types/application/fhir+xml\" target=\"_blank\" title=\"https://www.iana.org/assignments/media-types/application/fhir+xml\">https://www.iana.org/assignments/media-types/application/fhir+xml</a> and <a href=\"https://www.iana.org/assignments/media-types/application/fhir+json\" target=\"_blank\" title=\"https://www.iana.org/assignments/media-types/application/fhir+json\">https://www.iana.org/assignments/media-types/application/fhir+json</a></p>",
        "id": 153952342,
        "sender_full_name": "Luis Maas",
        "timestamp": 1523656659
    }
]