[
    {
        "content": "<p>Hi all. <br>\nI am trying to implement a billing part of the FHIR in our system. As far as I understand we should use ChargeItemDefinition(CID) with the corresponding context in order to assign a billing artifact to the encounter. So from the business analytics our requirement looks as follows:<br>\nWe must have a list of Contracts with all the organization for reimbursement. <br>\nIn the context of the encounter the practitioner will search for all ChargeItemDefinitions which are applicable with the corresponding contract. So for that reason the ChargeItemDefinition must have a relation to Contract in order to be searchable in that context.<br>\nFrom that perspective we have a few approaches.</p>\n<ol>\n<li>We can use an identifier with specific value or code which corresponds to the particular contract. </li>\n<li>We can use a jurisdiction with a CodeableConcept which corresponds to the particular Contract. </li>\n<li>Or we can use a ChargeItemDefinition.useContext.valueCodeableConcept to mark a specific Contract.<br>\nIn these ways the choosing which  ChargeItemDefinition is applicable,  will be performed by search request against the FHIR database. </li>\n</ol>\n<p>However we can use a completely different approach. We can load all the ChargeItemDefinitions in the client application (which is a WEB based app) and can use a ChargeItemDefinition.applicability with rules applied for each usage context.  If we have a thousands of CIDs this will make the client application heavier to load. </p>\n<p>Please share your experience with the  billing engine implementation over the FHIR standard. </p>\n<p>Thanks in advance.</p>",
        "id": 190964893,
        "sender_full_name": "Dimitar Dimitrov",
        "timestamp": 1584529271
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span></p>",
        "id": 190983586,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584540124
    }
]