[
    {
        "content": "<p>t has been suggested by one of the trainees who attended our FHIR training course, that we publish a 'checklist for PROFILERS (not: users of profiles, but authors of profiles and implementation guides)'. <br>\nFeel free to make suggestions (key issues, high level), we'll create a curated list, which will be made available to the community as a whole.</p>",
        "id": 223884866,
        "sender_full_name": "René Spronk",
        "timestamp": 1611574965
    },
    {
        "content": "<p>Choose a tool for FHIR profiling</p>",
        "id": 223884885,
        "sender_full_name": "René Spronk",
        "timestamp": 1611574984
    },
    {
        "content": "<p>decide: open or closed model approach</p>",
        "id": 223884905,
        "sender_full_name": "René Spronk",
        "timestamp": 1611574997
    },
    {
        "content": "<p>what are your requirements for the IGs? Choice of publication tool</p>",
        "id": 223884934,
        "sender_full_name": "René Spronk",
        "timestamp": 1611575027
    },
    {
        "content": "<p>I once wrote a \"guide\" when asked in the German stream. I'll try to translate as good as possible.</p>",
        "id": 223889151,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1611577488
    },
    {
        "content": "<p>Questions to answer, when I want to create one or more profiles:</p>\n<ul>\n<li>What is my use case?</li>\n<li>What are my data and information and how are they connected to each other?</li>\n<li>Which resources do I need?</li>\n<li>Is there anything on national or international level which I can use?</li>\n<li>How about terminology?</li>\n<li>In how far do I have to adjust the resources so that they fit to my data and data structures?</li>\n</ul>\n<p>There are certainly more questions to ask, these are probably the first ones.</p>\n<p><strong>What is my use case?</strong><br>\nThis question sometimes sound trivial, as you have your use case in mind. Nonetheless it might not hurt to write it down. Do I want to send a document? Do I want to define an interface and write down / communicate, what it (should) support? In which sector am I: ambulatory, stationary, intersectoral, interdisciplinary, physician, nursing, ...? Do I define local, regional, national, international? </p>\n<p><strong>What are my data and information and how are they connected to each other?</strong><br>\nIt is also helpful to visualize what you want to represent. In a discussion with others, you might find one thing or another which does not fit or is missing. This discussion might be open or closed to only a few members within the same organization. This depends on the use case (see above).</p>\n<p><strong>Which resources do I need?</strong><br>\nIn order to answer this question, you should have a look at the <a href=\"http://hl7.org/fhir/resourcelist.html\">FHIR resources</a>. It might also help to look into the FHIR-Chat Zulip (also in international streams), whether there was a similar question or discussion before.</p>\n<p><strong>Is there anything on national or international level which I can use?</strong><br>\nIn our efforts, interoperability on national or even international level should play an important role. Thus national (and international) profiles should play an important role. [Hint to the German base profiles, I skip the part here...] On international level there are standard extensions, which consider single additional data fields, but do not fit the 80%-Rule. For similar use cases these international extensions should be preferred. It might also happen, that a similar use case was dealt with at another place, so you can get inspiration from there. There is the <a href=\"https://registry.fhir.org/\">FHIR registry</a> or the <a href=\"https://www.fhir.org/guides/registry/\">FHIR Implementation Guide registry</a>, but also a search on <a href=\"https://simplifier.net\">Simplifier</a> might help.</p>\n<p><strong>How about terminology</strong><br>\nDepending on the use case, terminology can play a mayor or minor role. Fact is: You can't ignore that topic. For Conditions or Observations, you need a code to specify them: What is the condition about? What was observed? For this you should use (inter)national standards. The terminology to use again depends on the use case and the data you want to represent.</p>\n<p><strong>In how far do I have to adjust the resources so that they fit to my data and data structures?</strong><br>\nThis is by far the most time-consuming question: The profiling. For starting there is the <a href=\"https://simplifier.net/guide/profilingacademy/home\">Profiling Academy</a>. Here the most important points are explained. As a tool, Forge is used, the resulting profiles might be published on Simplifier. [Addition: But there are also additional tools]. Based on personal experience I can say: The better you first points (use case, data and relationships) are elaborated, the easier is the profiling, as you know exactly, what you want to do.</p>",
        "id": 223891436,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1611578848
    },
    {
        "content": "<p>I know, along answer and not really a \"checklist\", but it may help starting.</p>",
        "id": 223891529,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1611578889
    },
    {
        "content": "<p>Ah yes, i did read that checklist in the German stream - thanks for reposting in English.</p>",
        "id": 223892771,
        "sender_full_name": "René Spronk",
        "timestamp": 1611579570
    },
    {
        "content": "<p>No problem. I hope it's understandable and it fits. Anyone who's more fluent in English is welcome improve the text.</p>",
        "id": 223898342,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1611582309
    },
    {
        "content": "<p>The notion of 'closed' profiles should generally be avoided as it makes interoperability much harder over the long term for the community.  The <a href=\"http://build.fhir.org/ig/FHIR/ig-guidance/index.html\">IG Guidance</a> implementation guide was intended to be a repository of such instructions and recommendations, but it hasn't been touched in quite a while.  Pull requests welcome...</p>",
        "id": 223914091,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611589175
    },
    {
        "content": "<p>Valueable<span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 223996590,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1611635778
    },
    {
        "content": "<p>Nice work <span class=\"user-mention\" data-user-id=\"196115\">@Mareike Przysucha</span> !</p>",
        "id": 224024428,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1611659548
    },
    {
        "content": "<p>I wrote a check list for profile/ig reviewers. Not sure what happened to it..</p>",
        "id": 224940880,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612302054
    },
    {
        "content": "<p>ahh: <a href=\"/user_uploads/10155/3TJ_E5VlHgIon6bUxTjtWhey/FHIR-IG-Review-Checklist.docx\">FHIR-IG-Review-Checklist.docx</a></p>",
        "id": 224940933,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612302082
    },
    {
        "content": "<p>it's something...</p>",
        "id": 224940980,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612302105
    },
    {
        "content": "<p>Grahame's word doc list could be integrated into <a href=\"http://build.fhir.org/ig/FHIR/ig-guidance/index.html\">http://build.fhir.org/ig/FHIR/ig-guidance/index.html</a></p>",
        "id": 225047105,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1612372270
    },
    {
        "content": "<p>And some content from <span class=\"user-mention\" data-user-id=\"196115\">@Mareike Przysucha</span>'s document too.  Any volunteers? :)</p>",
        "id": 225052809,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612374550
    }
]