[
    {
        "content": "<p>Is anyone else seeing an error when doing an SVN check out?</p>\n<p>I'm getting an error of:</p>\n<p>ra-serf: The server sent a truncated HTTP response body.</p>",
        "id": 153922770,
        "sender_full_name": "Craig Newman",
        "timestamp": 1512395846
    },
    {
        "content": "<p>Yes.  We're working on getting it fixed.  In the meantime, do an SVN cleanup and an SVN up</p>",
        "id": 153922775,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512397246
    },
    {
        "content": "<p>Any update on this? The load is still failing and the clean up fails too. Thanks</p>",
        "id": 153923230,
        "sender_full_name": "Craig Newman",
        "timestamp": 1512587280
    },
    {
        "content": "<p>HQ is working on the issue with <span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span>.  The current theory is that the issue is caused with new SVN clients and can only be fixed by upgrading gForge's SVN libraries which will take some time due to testing.  I don't yet have an ETA for a fix :(  If you wished, you could try experimenting with an alternate/older SVN client and see if that works better.</p>",
        "id": 153923237,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512588130
    },
    {
        "content": "<p>I haven't changed my SVN client lately. I'm using TortoiseSVN now. Is there an alternative?</p>",
        "id": 153923243,
        "sender_full_name": "Craig Newman",
        "timestamp": 1512588979
    },
    {
        "content": "<p>There are alternatives.  I don't know if there's another one that will work better.</p>",
        "id": 153923269,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512597938
    },
    {
        "content": "<p>Yesterday I had to totally kill my whole FHIR directory, and start with a fresh checkout, followed by aditional cleanup and override and administrative scary things... all things that my tortoiseSVN walked me through.</p>",
        "id": 153923271,
        "sender_full_name": "John Moehrke",
        "timestamp": 1512598113
    },
    {
        "content": "<p>So when are we migrating to a version control system that fails less?</p>",
        "id": 153923351,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1512650305
    },
    {
        "content": "<p>I also get the \"truncated HTTP response body\" message. I noticed that by using the Clean command, I can continue the check out process.</p>",
        "id": 153923383,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1512660850
    },
    {
        "content": "<p>Now the SVN commit is failing. I'm being told that the immunization-speadsheet.xml file has a status of conflicted. The SVN tool tried to fix the conflict but all it seemed to do was render the file corrupt (I can't open it in Excel anymore). Anyone have thoughts on how to resolve the conflict? Thanks.</p>",
        "id": 153923746,
        "sender_full_name": "Craig Newman",
        "timestamp": 1512746593
    },
    {
        "content": "<p>conflicts in excel are tricky.  you can try to hand edit in xml. (which is tricky because there is a lot of of crap in excel xml)  or revert and renter your changes into the excel file.  The spreadsheet.txt file is handy to see what you changes were if you can't remember and that is tracked by Travis</p>",
        "id": 153923748,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512746973
    },
    {
        "content": "<p>I was afraid you'd say that I'd have to start again...</p>",
        "id": 153923749,
        "sender_full_name": "Craig Newman",
        "timestamp": 1512747188
    },
    {
        "content": "<p>You can use SVN show log to see who also changed things and find out what they did.  Typically you need to start from one of your versions and re-apply the other person's changes.  So the first step is to figure out which starting point is going to result in the least work.</p>",
        "id": 153923866,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512778732
    }
]