[
    {
        "content": "<p>I have similar question for the Chemotherapy for which I need to represent the cumulative dose for each kind of product given.<br>\nI was thinking to the  MedicationAdministration resource, but it is not clear to me how this information can be conveyed with the dosage BackboneElement. (maybe I'm wrong, but it seems to me that this is instead possible by using the dosage datatype used in the MedicationStatement resource)</p>",
        "id": 245988840,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1626282193
    },
    {
        "content": "<p>CumulativeDose seems like an Observation.  It, itself, isn't describing an intervention.  It's also a point-in-time assessment, may have a methodology that drives the calculation, is derived from other things, and in theory could be calculated differently by different people.</p>",
        "id": 245997676,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626286084
    },
    {
        "content": "<p>Would you even need a cumulative observation recorded into the chart? If you want to know how much radiation the patient has had in the past year, gather all the dosages and sum them just in time. If you ask the same question tomorrow, you might get a different answer based on timing, once again just in time. \"As of Tue you had 200 rads in the past year. As of Wed you had 10 rads in the past year.\" What if some situations wanted 18 month or 24 month exposure. Do you every day record 12, 18 and 24 cumulative observations into the chart? Of course not that would be crazy. If you want to know, right now, how much they have had during X timeframe, get all the dosages and sum them.</p>\n<p>I am a data person not a clinician. Of course this scenario presumes that you have all of the raw data in order to summarize.</p>",
        "id": 246001822,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1626288115
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"335936\">Daniel Venton</span> <a href=\"#narrow/stream/179166-implementers/topic/Chemotherapy.20Cumulative.20Dose/near/246001822\">said</a>:</p>\n<blockquote>\n<p>Would you even need a cumulative observation recorded into the chart? If you want to know how much radiation the patient has had in the past year, gather all the dosages and sum them just in time. If you ask the same question tomorrow, you might get a different answer based on timing, once again just in time. \"As of Tue you had 200 rads in the past year. As of Wed you had 10 rads in the past year.\" What if some situations wanted 18 month or 24 month exposure. Do you every day record 12, 18 and 24 cumulative observations into the chart? Of course not that would be crazy. If you want to know, right now, how much they have had during X timeframe, get all the dosages and sum them.</p>\n</blockquote>\n<p>I suppose this relates to the <a href=\"#narrow/stream/179166-implementers/topic/Radiotherapy.20Cumulative.20Dose\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Radiotherapy.20Cumulative.20Dose</a> thread, or am I wrong ?</p>",
        "id": 246002120,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1626288265
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Chemotherapy.20Cumulative.20Dose/near/245997676\">said</a>:</p>\n<blockquote>\n<p>CumulativeDose seems like an Observation.  It, itself, isn't describing an intervention.  It's also a point-in-time assessment, may have a methodology that drives the calculation, is derived from other things, and in theory could be calculated differently by different people.</p>\n</blockquote>\n<p>How do you suggest that this CumulativeDose Observation should be linked to the MedicationAdministration ? by using the Observation.partOf  element ?</p>",
        "id": 246002464,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1626288472
    },
    {
        "content": "<p>Most correct would be an extension on Observation.derivedFrom to point to all of the records used to calculate.  If what you want is \"After this administration, their cumulative dose is now X\", then that'd be a custom extension on the MedicationAdministration</p>",
        "id": 246003165,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626288816
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> ?</p>",
        "id": 246005625,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626289910
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> . I don't have any particular insight here, although I think recording the cumulative dose, rather than calculating it on the fly would be preferred. I suspect we need to know that the decision to go ahead with treatment in March was based on the fact that the patient was (just) under their total lifetime safe dosage. What happens if we find out in May that the patient also had had a January treatment which now means that the March treatment puts them over the limit? The measure we used shouldn't come up with a different answer (although, we may want to have a new measure based on the current information).</p>\n<p>If there is ambiguity here, I suggest following up with <span class=\"user-mention\" data-user-id=\"253132\">@Abderrazek Boufahja</span>, <span class=\"user-mention\" data-user-id=\"277357\">@Christopher Lindop</span>, or <span class=\"user-mention\" data-user-id=\"197037\">@Jonathan Whitby</span></p>",
        "id": 246026508,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1626299467
    },
    {
        "content": "<p>In the Radiation Dose Summary IG, we avoided reporting cumulative dose; the IG is about reporting the procedures radiation summaries, punctually, one by one. This was for the following reasons: the meaning of cumulative dose over multiple procedures was not yet clear (at least for me), its definition may varies, and the cumulative dose may depend on many parameters (from which date to which date it is calculated, the weighting technique, the modality type, etc.).   Using FHIR Operations was a possible solution for calculating Cumulative dose for the Radiation Dose Summary IG. Things with RT and Chemotherapy may be different about the Cumulative Dose, which may have a strict definition, and thus using operations may not be relevant.</p>",
        "id": 246064724,
        "sender_full_name": "Abderrazek Boufahja",
        "timestamp": 1626337237
    }
]