[
    {
        "content": "<p>Hi All, <br>\ncould you please advise how to represent chemotherapy regimens in FHIR? In our system, we need to record that a patient is on a chemotherapy regimen, e.g. ICE-V when a nurse care manager is gathering information about medications that a patient is taking. Are there any best practices on how to do it? Is there any preferred dataset for chemotherapy regimens list?</p>",
        "id": 153834071,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1466608051
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"191329\">@Aleksandra Pavlyshina</span> there are a few of us working in this area, but i havn't seen any formal guidance/recommendations yet.  i'm focused on representing chemotherapy order templates using the new PlanDefinition resource being defined.  I think <span class=\"user-mention\" data-user-id=\"191516\">@Andrew Ross</span> is leading efforts to support Chemo Regimen via the existing CarePlan resource, so maybe he could send some pointers?</p>",
        "id": 153834088,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1466615700
    },
    {
        "content": "<p>regarding lists of chemo regimen, you could try <a href=\"https://ncit.nci.nih.gov/ncitbrowser/\" target=\"_blank\" title=\"https://ncit.nci.nih.gov/ncitbrowser/\">https://ncit.nci.nih.gov/ncitbrowser/</a> ?  for example <a href=\"https://ncit.nci.nih.gov/ncitbrowser/ConceptReport.jsp?dictionary=NCI_Thesaurus&amp;version=16.05e&amp;ns=NCI_Thesaurus&amp;code=C10345&amp;key=1802929943&amp;b=1&amp;n=null\" target=\"_blank\" title=\"https://ncit.nci.nih.gov/ncitbrowser/ConceptReport.jsp?dictionary=NCI_Thesaurus&amp;version=16.05e&amp;ns=NCI_Thesaurus&amp;code=C10345&amp;key=1802929943&amp;b=1&amp;n=null\">https://ncit.nci.nih.gov/ncitbrowser/ConceptReport.jsp?dictionary=NCI_Thesaurus&amp;version=16.05e&amp;ns=NCI_Thesaurus&amp;code=C10345&amp;key=1802929943&amp;b=1&amp;n=null</a></p>",
        "id": 153834090,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1466615809
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191329\">@Aleksandra Pavlyshina</span> in our system, we're representing chemotherapy regimens as FHIR CarePlans, with all of the individual treatments expanded out into a flat list of MedicationOrder/MedicationAdministration <code>activity</code> elements. We also record things like the NCCN ID in the <code>identifier</code> list and link to the patient, their cancer condition, etc, and may use a few small extensions to record information like the current chemotherapy cycle / day within it. Is your use-case more about representing existing scheduled regimens for which you already have data, or picking regimens for new patients?</p>",
        "id": 153834092,
        "sender_full_name": "Andrew Ross",
        "timestamp": 1466620117
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span>, thank you for quick response!</p>",
        "id": 153834307,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1466669008
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"191516\">@Andrew Ross</span>, thank you for your response. We are implementing a care management application designed specifically around palliative care. We need to have an accurate list of the medications our patients are taking to 1) identify interactions 2) troubleshoot patient reported issues (may be related to a drug, or multiple drugs they are taking), and 3) identify correlation between adverse events and stopping of a medication. Having an up to date list of medications was a very important item for the care managers we consulted with.<br>\nThe use-case is as following:<br>\nDuring initial in-home visit to a patient, a nurse care manager talks to a patient and makes up a list of medications he is taking. Patient can say that he is on a specific regimen, e.g. ICE-V. <br>\nIt's likely that the patient doesn't know details of the regimen and knows only its name or abbreviation. And NCM also doesn't know all lists of medications for all regimens. There is not a list of regimens in our medications source (RxNorm). However, in order to identify drug-drug interactions it's not enough to add a regimen name to a medications list, we need to add concrete medications.<br>\nSo, it seems like our use-case is more about representing existing scheduled regimens for which we don't have data yet. I'm doing a research on how this kind of information should be entered into application and stored as FHIR resources, which terminology is to be used here.<br>\nI suppose that it might look like an option 'Add a Regimen' in application, with a list of existing regimens stored as ordersets, NCM selects the appropriate one from the list (e.g. ICE-V), and the predefined set of medications is loaded and can be added to a patient's medications list where each medication is stored in the MedicationStatement resource.</p>",
        "id": 153834522,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1466701385
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191516\">@Andrew Ross</span> is your chemotherapy cycle extension published anywhere? I'm facing the same now and would rather re-use an extension than create a duplicate.</p>",
        "id": 153895404,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1498652503
    },
    {
        "content": "<p>Include <span class=\"user-mention\" data-user-id=\"191334\">@Marten Smits</span> in this discussion, and <span class=\"user-mention\" data-user-id=\"193440\">@Mary Visceglia</span> ....</p>",
        "id": 153895824,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1498822848
    },
    {
        "content": "<p>Here's the one that is used in the KDN5 regimen, is this what you're looking for:</p>",
        "id": 153895885,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1498860899
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/extension-timing-daysofcycle.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-timing-daysofcycle.html\">http://build.fhir.org/extension-timing-daysofcycle.html</a></p>",
        "id": 153895886,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1498860899
    },
    {
        "content": "<p>Unfortunately, not quite - my usecase is specifically for recording the # of cycles that have happened</p>",
        "id": 153896017,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1499175955
    }
]