[
    {
        "content": "<p>Does anybody know of a (correct) example of a choice of alternatives over the same type. In particular I'm looking for a choice over Observation.value[x], but any example would do.<br>\nI can provide some (probably wrong) examples so we can discuss over them if no correct example exists yet.</p>",
        "id": 170976705,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1563276905
    },
    {
        "content": "<p>I'm not sure I'm following what you're asking for.  Can you explain further?</p>",
        "id": 170989428,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563286373
    },
    {
        "content": "<p>Sure. The idea is having two (or more) allowed values in a attribute with 0..1 occurrences. This is the use case of having for example two different Quantities with different units and allowed ranges (e.g. one could be [0..300] kg and the other [0..10000] g). In theory this should be no problem as they can be distinguishable from code.coding.code attribute, using that as the slicing criteria.<br>\nThis could also be applied to other complex data types such as CodeableConcept (arguably the declaration of bindings implicitly declares alternatives) or SampledData with different parameters.</p>",
        "id": 170992534,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1563288190
    },
    {
        "content": "<p>sounds like choice of units and not multiple choice types   - in your first example they are both valueQuantity?  so bind the Quantity.code to possible choice of units.  example here: <a href=\"http://build.fhir.org/bodytemp.html\" target=\"_blank\" title=\"http://build.fhir.org/bodytemp.html\">http://build.fhir.org/bodytemp.html</a></p>",
        "id": 170997286,
        "sender_full_name": "Eric Haas",
        "timestamp": 1563290836
    },
    {
        "content": "<p>Yeah, both are valueQuantity. min &amp; max value are also different, and I don't see how put both constraints (ranges and units) in a single valueQuantity. That's why the choice</p>",
        "id": 170998414,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1563291486
    },
    {
        "content": "<p>So you're defining a profile and you're wanting to slice a non-repeating element to just say that one of two sets of constraints apply?  No real way to do that other than defining a constraint.  Slicing isn't allowed on non-repeating elements unless you're slicing by type on a polymorphic element.</p>",
        "id": 170999477,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563292183
    },
    {
        "content": "<p>What is the purpose of the min max constraint?  to prevent implementers from doing stupid things or entry errors?  Is providing all these checks in the profiles better than say in the UI?</p>",
        "id": 170999894,
        "sender_full_name": "Eric Haas",
        "timestamp": 1563292448
    },
    {
        "content": "<p>If it's a business rule for the receiving system, it's reasonable to enforce it in a profile</p>",
        "id": 171000041,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563292561
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, does FHIR allow a type slice with multiple named slices constrained to the same (single) datatype?<br>\nUsually, when a choice type element is constrained to a single datatype, then Forge automatically generates a slice name from the selected type (e.g. <code>valueBoolean</code>). However if FHIR allows multiple type slices constrained to a common single type (?), then I suppose Forge should require the author to explicitly assign custom unique slice names (e.g. <code>someBoolean</code> and <code>otherBoolean</code>).</p>",
        "id": 171001114,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1563293280
    },
    {
        "content": "<p>If I have to chose between UI or profile for enforcing a constraint I would chose profile 100% of the time :)<br>\nregarding this, I've seen profiles where this choice is simulated with the cardinality of the parent &amp; children (e.g. 5 optional items in a 4..5 container). The only difference is that this \"\"list\"\" only has one element.</p>",
        "id": 171001384,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1563293441
    },
    {
        "content": "<p>I don't think we allow multiple slices for a non-repeating polymorphic element except slicing by type.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 171001821,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563293698
    },
    {
        "content": "<p>To make things worse, one of my use cases would be sliced by the value of an extension over CodeableConcept :)</p>",
        "id": 171004549,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1563295489
    },
    {
        "content": "<p>I don't know the answer to either that question or the original question</p>",
        "id": 171807372,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564172651
    },
    {
        "content": "<p>I'm moving these alternatives constraints to expressions. Seems the only way to use the same kind of \"building blocks\" in single occurrences and multiple occurrences attributes (Observation.value[x] and Observation.component.value[x])</p>",
        "id": 172211708,
        "sender_full_name": "Diego Bosca",
        "timestamp": 1564658319
    }
]