[
    {
        "content": "<p>I know this must be discussed before. But I could not find an answer in email list. So if patient has chronic conditions, such as Diabetes, and visited hospital 20 times in the last 5 years, should one condition instance of Diabetes created for each visit? If so, how do I get full history of patient's Diabetes condition? I can see two solution</p>",
        "id": 153830956,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464790332
    },
    {
        "content": "<p>1) use Linkage resource to link all related Diabetes conditions together. I can use FluentPath to search, such as Linkage.item.contains(Codition.code = xxx).</p>",
        "id": 153830958,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464790450
    },
    {
        "content": "<p>2) use regular search Condition?code=xxx&amp;clinicalStatus=xxx. </p>",
        "id": 153830960,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464790493
    },
    {
        "content": "<p>Any suggestions?</p>",
        "id": 153830961,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464790508
    },
    {
        "content": "<p>Wouldn't a single instance of diabetes referenced by each encounter make more sense?</p>",
        "id": 153830965,
        "sender_full_name": "David Hay",
        "timestamp": 1464791012
    },
    {
        "content": "<p>Some thoughts from another discussion:  <a href=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Condition's.20Priority\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Condition's.20Priority\">https://chat.fhir.org/#narrow/stream/implementers/topic/Condition's.20Priority</a></p>\n<p>Representing all billed diagnoses as a single 'chronic' Condition (e.g. diabetes) triggers the question of what the Condition.code should be? For example, problems (in the US) are most often SNOMED, but diagnoses are ICD. When we discussed the possibility of \"translating\" SNOMED to ICD-X codes, we intentionally didn't do that because the ICD code could add inaccurate information — like initial encounter - which isn't relevant across all encounters.  Keeping these conditions separated (per encounter) allowed us to maintain the accuracy of the billed diagnosis (ICD) codes in context of a specific encounter.</p>",
        "id": 153830967,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464791437
    },
    {
        "content": "<p>But how do get all conditions for an encounter happened in 6/1/2013? I need to get certain history version of a condition.</p>",
        "id": 153830968,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464791562
    },
    {
        "content": "<p>Longer term, I would suggest Health Concern.  Per the recently balloted Health Concern domain analysis model, use cases include:</p>\n<p>Maintain a traceable record of a concern, for understanding, as the concern evolves. As providers investigate health issues, their understanding of the underlying problem often changes. However, it is sometimes important to be able to understand that today’s diagnosis is the same problem that initially presented as something else--pneumonia as the flu, or gastritis as chest pain. </p>\n<p>Associate events with concerns in order to provide a consolidated view of a concern (e.g., observations ordered in the context of caring for a particular concern).</p>\n<p>We're still discussing Health Concern representation in FHIR (e.g. one thought would be a list of concerns where each concern is a condition that links to \"concern events\" that could be conditions, observations, orders, etc.)</p>\n<p><a href=\"http://wiki.hl7.org/index.php?title=Health_Concern\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Health_Concern\">http://wiki.hl7.org/index.php?title=Health_Concern</a></p>",
        "id": 153830973,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464793380
    },
    {
        "content": "<p>Is a collection versionable? </p>",
        "id": 153831035,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464814754
    },
    {
        "content": "<p>Same issue applies to medication history... </p>",
        "id": 153831037,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464814786
    },
    {
        "content": "<p>Also need to differentiate \"problems at time X\"  from \"known problems at time X\"  and \"conditions billed for at time X\" </p>",
        "id": 153831040,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464814951
    },
    {
        "content": "<p>If you want a point-in-time snapshot, you'd either have a specific resource (Encounter, EpisodeOfCare or Claim) point to the records (or possibly specific versions of them), or you'd use a List resource if you wanted a controlled collection that could be managed independently of one of those referencing objects.  (Sometimes you might have both.)</p>",
        "id": 153831051,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464817064
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> - note that the definition of health concern given in CCDA by SD makes it clear that it's a condition like any other problem. what differentiates it is the context in which it is used. If PC introduces \"health concern\" as a new resource, that will further confuse matters. Can PC please at least consider alternative names </p>",
        "id": 153831074,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464822405
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> While no PC decisions have been made formally, my opinion based on discussions to date is what I represented earlier, which doesn't conflict with SD.  Specifically, we could use the <em>existing</em> List resource to represent a list of concerns (based on context of who has the concern).  The List.entry.item is the <em>existing</em> Condition resource -- and then the new piece to figure out (which isn't an ONC requirement, but is part of the DAM) is how we link the Condition (with category = concern) to the \"concern events\" -- meaning the related conditions, observations, orders, etc.  At one point, we wanted to use the new Linkage resource for that, but I have outstanding questions whether linking heterogeneous resources is part of the scope of Linkage (which says it is normally used to link the same type of resources; often referred to as duplicates, etc.).</p>",
        "id": 153831286,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464871678
    },
    {
        "content": "<p>agree it's not the scope of the linkage resource as defined, but I haven't found a use for Linkage yet. I keep looking at it thinking it should be what I want, but the definition is too narrow...</p>",
        "id": 153831328,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464901156
    },
    {
        "content": "<p>what you describe is still different to what SD means when they talk about concerns. I'm not saying that what you describe doesn't make sense. It's just different, and therefore has a solid prospect of creating much confusion</p>",
        "id": 153831329,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464901212
    },
    {
        "content": "<p>The initial scope of Linkage was to allow the recognition that 3 or 4 different statements about a particular problem, procedure, etc. are actually all talking about the same thing - which was one of the requirements of the Condition model that wasn't met by other capabilities.</p>",
        "id": 153831397,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464918859
    },
    {
        "content": "<p>That was the exact use case/question that started this discussion when <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> asked \"how do I get full history of patient's Diabetes condition?\" assuming there are multiple diabetes conditions -- each representing a diagnosis in context of a given visit/encounter (coded in ICD) as well as another condition that represents the problem on the problem list (coded in SNOMED).</p>",
        "id": 153831555,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464958113
    },
    {
        "content": "<p>are you accounting here for the fact that many diabetic complications (\"retinopathy\", \"renal impairment\", \"gangrene\") may not be directly linked...</p>",
        "id": 153831558,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464958342
    },
    {
        "content": "<p>Looks like CCDA says \"A Health Concern is a health related matter that is of interest, importance or worry to someone,\" which seems in line with Michelle's comment. If it weren't, I'd suggest that's an excellent reason to define requirements independently of solutions, as far as possible. </p>\n<p>The existing Condition resource tries to do something physiological rather than procedural, so it doesn't support the Concern case. List might, if linkage helped. That would be a design decision, I suppose.</p>\n<p>Eric, the Concern concept does two things: it groups stuff (supporting findings, sub-concerns, etc.) for what is basically a librarian function, and one of the things it groups is the \"identifying constituent,\" the latest of which is the current diagnosis in the case of an evolving condition. The DAM has changed a bit in the last ballot, but the foundational semantics are pretty stable.</p>",
        "id": 153831561,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1464959049
    },
    {
        "content": "<p>Condition captures physiological state, plus relationships with other physiological states (some via extensions).  List captures concern about one or more states.  Linkage allows you to tie together multiple independent views of the same \"thing\".</p>",
        "id": 153831571,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464961064
    },
    {
        "content": "<p>\"The existing Condition resource tries to do something physiological rather than procedural, so it doesn't support the Concern case\" - I don't follow that?</p>",
        "id": 153831708,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1465125905
    },
    {
        "content": "<p>As part of the QA of Condition, I logged <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10090\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10090\">GF#10090</a> to clean up the introduction/scope.  Specific changes/clarifications needed (to better align with concern) include:</p>\n<ul>\n<li>Loosen the restrictions that a condition is only in context of a clinician (e.g. \"recognized by a clinician\" or \"clinician assessment\")</li>\n<li>Loosen the restrictions that a condition is only a medical state (e.g. \"state of health\" or \"disease/illness\")</li>\n<li>Include usage for patient concern statements, such as fears, risks, or barriers (e.g. lack of transportation, travel to Africa, fear of losing a parent).</li>\n<li>Include verbiage that there may not be consensus or agreement across stakeholders (e.g. clinician doesn't agree with patient fear of being overweight;  patient doesn't agree with clinician's concern about unhealthy relationships)</li>\n</ul>",
        "id": 153831740,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1465158062
    }
]