[
    {
        "content": "<p>I need to model a journal entry to capure the information that \"&lt;patient&gt; smoked &lt;x&gt; cigarettes on &lt;date&gt; in &lt;setting&gt;  because of  &lt;reason&gt;\"  in FHIR.<br>\nMy inital idea is:</p>\n<div class=\"codehilite\"><pre><span></span><code>Observation\n .subject = &lt;patient&gt;\n .effectiveDateTime = &lt;date&gt;\n .code = ???\n .valueInteger = &lt;x&gt;\n .note= &quot;Setting: &lt;setting&gt;, Reason: &lt;reason&gt;&quot;\n</code></pre></div>\n<p>Any ideas for improvement or suggestions for .code ?</p>",
        "id": 234305752,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1618311987
    },
    {
        "content": "<p>I know the CIC WG created a common clinical registry framework document that included nicotine use. I don't think they had a generic code for something like this but you might want to reach out to them to see if they have any ideas (<a href=\"http://www.hl7.org/Special/committees/cic/leadership.cfm\">http://www.hl7.org/Special/committees/cic/leadership.cfm</a>). Jimmy Tcheng might be a good place to start.</p>",
        "id": 234318250,
        "sender_full_name": "Craig Newman",
        "timestamp": 1618318048
    },
    {
        "content": "<p>It might be difficult to find a code for  individual cigarettes, as smoking is typically measured in \"packs\". You might use code <a href=\"https://loinc.org/8663-7/\">https://loinc.org/8663-7/</a> for that and then specify the effective date. This will later also make it easier for you to sum it up into \"pack years\", which is the unit that most guidelines (onco, pneumo) care about. For the \"reason\" you can also find codes, such as \"to relieve stress\". This is from the PROMIS survey, which also has LOINC codes, such as <a href=\"https://loinc.org/8663-7/\">https://loinc.org/8663-7/</a>. Careful: This does have licensing strings attached! Rather than using the free-text note, you might make an observation with components for a valueInteger pack count, a valueCoding reason and maybe you can even find codes for the setting? Then no natural language would be involved.</p>",
        "id": 234380175,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1618339679
    },
    {
        "content": "<p>Thanks for the advice! I'm afraid, the source data on motivation/setting is only free text, so there's not much room for improvement. <br>\nThe problem is that the journal entries reflect not general/average smoking habit but more like the exceptions while trying to quit. So they are really more about the specific event of smoking one particular cigarette and what were the circumstances around it, rather than documenting a \"habit\" (which is what the LOINC codes represent). The average consumption prior to quitting is also documented. That's where I am in fact using the LOINC code.</p>",
        "id": 234458393,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1618387682
    },
    {
        "content": "<p>Understood. I guess in that case you will have to do some pioneer work. I do work with behavioural change in patients, but wouldn't know a good standard for that use-case. Potentially LOINC 96103-7 could be used with an effectiveDateTime of when it happened, but I think that would also push the boundaries for what that code was meant for, so you could probably invent your own code just as well.</p>",
        "id": 234542173,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1618421939
    },
    {
        "content": "<p>You could use component for the 'reason' to make it more computable.  (There could be a bunch of notes about the Observation, so it might be hard to extract the reason if you had a need to)</p>",
        "id": 234886669,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618591744
    }
]