[
    {
        "content": "<p>If I want to send back a simple yes or no for pre-auth checks is this the field an object to use?</p>",
        "id": 153981957,
        "sender_full_name": "Brian Foxx",
        "timestamp": 1533329944
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 153981969,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533331387
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196548\">@Brian Foxx</span> Hi Brian. Is this so that you can tell the provider whether a preauthorization is required (CoverageEligibility) or whether the indicated good/service is reimburseable. If that latter then a ClaimResponse.item[n].adjudication.category='eligible' and .amount= a non-zero amount (suggest the amount or limit you will pay).</p>\n<p>The .insurance.preAuthRef is where you would put a reference number (alphanumeric) which the provider submits when they send in the Claim to refer back to your preauthorization. This is done with a business identifier as the preAuthReference number may be provided in multiple ways including via letter or over the phone.</p>",
        "id": 153982487,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533552929
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> Hi Paul. Thank you so much for your response. I'm just looking to return a yes or not status with a few more details regarding statuses that are dependent on other variables such as diagnosis, location, etc.</p>",
        "id": 153982529,
        "sender_full_name": "Brian Foxx",
        "timestamp": 1533561038
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196548\">@Brian Foxx</span> Then .category='eligibility' with .amount=0 would be a no, otherwise a yes, and the .reason can contain codes for why or .note can contain note text.</p>",
        "id": 153982530,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533561226
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> Ok so the object to use would be  ClaimResponse.item[n].adjudication.category right?</p>",
        "id": 153982534,
        "sender_full_name": "Brian Foxx",
        "timestamp": 1533561867
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196548\">@Brian Foxx</span> Right, or the .adjudication.category of the item[n].detail[m] or .detail[m].subDetail[o]</p>",
        "id": 153982535,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533561961
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>  Thank you so much</p>",
        "id": 153982536,
        "sender_full_name": "Brian Foxx",
        "timestamp": 1533562454
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> Hello Paul, I'd like to dive in to preAuthRef with a couple of questions:<br>\n1. Would this also be the correct field to use for the preauthorization use case (in which a Payer is using the ClaimResponse resource to reply to a preauthorization request sent in the form of a Claim), to allow the requesting system to refer back to this specific authorization when they next contact the Payer? In our system we usually refer to this concept as the Auth Number or Precert Number, depending on usage.<br>\n2. If a payer wishes to include multiple preauthorization numbers (one for each service they approve) how would they go about doing so, since this field is in the Insurance section and not the item, addItem, or even adjudication sections? I suspect that we would want multiple insurance sections with each sequence value corresponding to each item section's sequenceLinkId--Is this how you would expect it to work?</p>",
        "id": 153983409,
        "sender_full_name": "Fred Switzer",
        "timestamp": 1533677404
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196571\">@Fred Switzer</span> <br>\n1) Yes, ClaimResponse.insurance.preAuthRef contains the Auth Number (or they may supply the Auth number by letter or phone) which you would later send in ClaimResponse.insurance.preAuthRef.<br>\n2) I have never heard of a separate Auth Number per service line. The current specification doesn't handle that. Are you coming to the HL7 meeting in Baltimore at the end of September or is this something which you can create a Tracker item to explain and then attend a Financial Management conference call to discuss? We meet Tuesdays at 11am Eastern.</p>\n<p>Do you mind sharing in which country you are looking to apply this?</p>",
        "id": 153983580,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533721392
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <br>\nUnfortunately, that's what I suspected. We talked a couple weeks ago at a Tuesday call about approved quantities versus monetary amounts and I got the impression then that some of the use cases here in the USA aren't supported by the FHIR spec as it stands now, at least for Preauthorization. I'll add a tracker item to explain our use cases, but in short, a few payers provide distinct Auth numbers for each service line, although they might also supply an overall reference number that I'm sure we would put in the preAuthRef field as is appropriate.</p>\n<p>Could you also answer a very similar question about a related item? Our payers also sometimes provide a date period during which the authorization will be available. This date period can also be specified at the service line level. In my investigation of the ClaimResponse resource, I was unable to find a date period field that could be used at the service level, or even one that could be specified at a higher, overall level. <br>\nWould it be better to add individual tracker items for each of these fields, or would the concept of service line authorization numbers and effective periods be better applied to a single tracker item?<br>\nThanks for your help, Paul.</p>",
        "id": 153983673,
        "sender_full_name": "Fred Switzer",
        "timestamp": 1533737878
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196571\">@Fred Switzer</span> If the payer needs to redefine the line to supply allowable date, quantity, provider etc. then they should use .additem which has your needed elements I expect.</p>",
        "id": 153983811,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533761255
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> In a ClaimResponse - which represents the actual \"preauthorization\", why are there 0..* insurance.preAuthRefs?  Wouldn't there always be a maximum of one 'string' that's used to reference a particular preauthorization?</p>",
        "id": 153984559,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533859757
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Correct,  Cut and Paste error.</p>",
        "id": 153984946,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533911608
    },
    {
        "content": "<p>So cardinality on insurance &amp; preAuthRef will both be dropped to 0..1?</p>",
        "id": 153984948,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533911660
    },
    {
        "content": "<p>No, just on preAuthRef, and the element need to be moved from .insurance to the root.</p>",
        "id": 153984950,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533911804
    },
    {
        "content": "<p>Do you need a tracker or will you take care of it?</p>",
        "id": 153984955,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533912515
    },
    {
        "content": "<p>I'm editing the tracker as we speak.</p>",
        "id": 153984957,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1533912559
    }
]