[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ,</p>\n<p>What is the correct way to convey both 'header level’ claim denial and 'service/line level’ denial via. the ClaimResponse resource?  e.g.,  A) If a given claim is completely denied or B) If a subset of the services/lines are denied  - For denied services/lines, would ClaimResponse.item.adjudication.category.coding.code (using a code other than those supported here [1]) indicate that the service is completely denied by the payer?</p>\n<p>Is there an example of the ClaimRespose resource being used to convey claim and/or service level denials?   </p>\n<p>[1] <a href=\"http://build.fhir.org/valueset-adjudication.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-adjudication.html\">http://build.fhir.org/valueset-adjudication.html</a></p>",
        "id": 158449542,
        "sender_full_name": "David Riddle",
        "timestamp": 1550071863
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span> the adjudication component occurs within the details under the item and the sub-details under the details as well as on the item. This allows you to specifiy adjudication information at the item level or for each of the details within the item or for any sub-details for each detail. Unfortunately, we did not have time to provide examples of rejections/denails prior to publication but it is on our work list. I am not sure there is a _correct_ way, as this is normally determined by you business needs. Generally, I think you bubble up the rejection/denial to the highest point. If the item was rejected, you would have the adjudication with the rejection appear on the item and not repeat this information for each detail within the item. I also think you would be using the x. adjudication.reason (ClaimResponse.item.adjudication.reason) to identify that the item/detail/sub-detail is denied. Note that the value sets for both category and reason are marked as Example and are not meant to be definitive, complete or final.</p>\n<p>Hope this helps</p>",
        "id": 158813738,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1550509111
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span>, Thank you, this is helpful.  Understood on the terminology binding/value set being examples.  I think the fact that I was looking at examples for adjudication.category vs. adjudication.reason caused me to ask a dumb question.  I am looking forward to seeing the additional examples on your work list.</p>",
        "id": 158894368,
        "sender_full_name": "David Riddle",
        "timestamp": 1550593218
    },
    {
        "content": "<p>Not a dumb question at all. Yeah, more examples is always better</p>",
        "id": 158906051,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1550601280
    }
]