[
    {
        "content": "<p>Looking at definition of Claim i see quite a few properties defined in an unconvential way</p>",
        "id": 153846303,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1472841622
    },
    {
        "content": "<p>See <a href=\"http://hl7-fhir.github.io/claim.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/claim.html\">http://hl7-fhir.github.io/claim.html</a></p>",
        "id": 153846304,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1472841669
    },
    {
        "content": "<p>properties like insurer[x], provider[x], organization[x], etc. can either be an Identifier or a ResourceReference.</p>",
        "id": 153846305,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1472841711
    },
    {
        "content": "<p>why ? A ResourceReference can be an internal reference which could simply be a fully qualified identifier (system + value)</p>",
        "id": 153846306,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1472841742
    },
    {
        "content": "<p>i'm concerned that this deviates from the pattern used everywhere else.</p>",
        "id": 153846307,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1472841768
    },
    {
        "content": "<p>I suppose i may be pushing use of internal id here, but then why not just create a resource with one identifier? and reference that?</p>",
        "id": 153846308,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1472842169
    },
    {
        "content": "<p>Same pattern in Coverage ... sigh</p>",
        "id": 153846309,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1472842577
    },
    {
        "content": "<p>yes you'll see that the FM group has simply disagreed with the overall architecture pattern, and acted accordingly</p>",
        "id": 153846321,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472848761
    },
    {
        "content": "<p>this will be discussed at Baltimore</p>",
        "id": 153846322,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472848779
    },
    {
        "content": "<p>As currently defined a ResourceReference CANNOT be a be a fully qualified identifier (system + value) and it must be referenceable. So if what you have is the business identifer (or you don't allow the resources to be referenced) you must either create a second resource or a contained resource and use internal references to those - the contained resource being more efficient in the Financial space) and shown in existing financial examples. The choice of a resource reference or identifier is even more efficient than a contained resource in these cases and we are proposing a datatype change so that we drop the choice then all resources will follow the same approach.</p>",
        "id": 153846351,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1472886534
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"grahame@healthintersections.com.au\">@Grahame Grieve</span>: FM doesn't diagree with the overall approach, we use it where it works and propose solutions where it doesn't meet the business need. What we don't do is force the business requirements to fit the solution architecture. <br>\nCome meet with FM on Wednesday in Baltimore to discuss.</p>",
        "id": 153846352,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1472886662
    },
    {
        "content": "<p>you do disagree with the overall approach, in that the overall approach is to use contained resources, which we do for good reason. As Peter references. But we will discuss</p>",
        "id": 153846362,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472939731
    },
    {
        "content": "<p>The problem with contained resources, or creating another resource, which only contains the business identifier is that inorder for that to be true we would need to require that there are no required fields other than perhaps the business identifier - which currently we don't. The reason for that restriction is that you would have the identifier but you may not know any of the currently required elements. - See the unsolicited attachment example on Communication - which FM created and which uses contained resources - it shows that we'd need to move the bar on attribute requirements on resources.</p>",
        "id": 153846370,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1472966067
    },
    {
        "content": "<p>We had used contained resources and we were told that we should not - that we should create a separate resource - so we sought a better solution. We have examples using contained resources (and none where we have a separate resource) and we have proposed also using the business identifier as have other resources not just those from FM. The difference with the FM proposed approach is that we have made it a choice using the FHIR choice mechanism, the other resources have used both attributes. The datatype proposal I'm submitting for discussion would provide for both of these without the bloat of additional semi-redundant attributes.</p>",
        "id": 153846371,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1472966418
    },
    {
        "content": "<p>so now you are defending why you are different - and we can (and will) talk about this in Baltimore.</p>",
        "id": 153846374,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472984313
    },
    {
        "content": "<p>Yes, we prefer there be a rationale. We support the approach when it works.</p>",
        "id": 153846375,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1472986193
    },
    {
        "content": "<p>I think it makes sense to allow the Reference data type to support both direct and logical references.  Logical references are a reality in a number of architectures and it seems reasonable to support that in core.</p>",
        "id": 153846412,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473042174
    },
    {
        "content": "<p>Can we discuss this Tuesday Q1 with M&amp;M, FHIR-I, ITS?</p>",
        "id": 153846417,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1473058326
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"lloyd@lmckenzie.com\">@Lloyd McKenzie</span> I agree, and I'd prefer that we add an identifier attribute to capture the logical rather than mix both in the reference attribute of the Reference data type.</p>",
        "id": 153846418,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1473058493
    },
    {
        "content": "<p>Yes.  My expectation is that the Reference data type would end up with three properties - reference, identifier and display.</p>",
        "id": 153846451,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473102792
    },
    {
        "content": "<p>we have discussed and rejected this option before. </p>",
        "id": 153846460,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473107990
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> My understanding was we were planning to discuss it in Baltimore.  I don't recall it being discussed in detail previously, nor the reasons for its rejection (though I do recall discussions about whether it should be core or a standard extension)</p>",
        "id": 153846557,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473169676
    },
    {
        "content": "<p>In a RESTful space, external reference by URI make sense.  But in a messaging or other non-RESTful space, external references by URI don't make much sense and aren't a capability many of the existing systems would have.</p>",
        "id": 153846559,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473169777
    },
    {
        "content": "<p>it was a long time ago, but we did</p>",
        "id": 153846594,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473192401
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I'm just clarifying that you're still on board with discussing and potentially revisiting that discussion in Baltimore. </p>",
        "id": 153846606,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473197159
    },
    {
        "content": "<p>open to discussing it. But there's a lot of ramifications to consider</p>",
        "id": 153846615,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473203564
    },
    {
        "content": "<p>I think we had a similar  case come up with DiagnosticReport, in that the report wants to note that it is related to a particular imaging study UID (DICOM study instance identifier), but creating an ImagingStudy resource devoid of any content except the identifier seems a little heavy. It also doesn't handle the case where the ImagingStudy resource isn't supported by the EMR (because it figures the PACS should handle those resources) or the PACS (because it doesn't have FHIR support), but we still want to include the study UID in the report.<br>\nShould DiagnosticReport.imagingStudy be changed to imagingStudy[x], where x=Reference(ImagingStudy) or Identifier (or whatever the proper way to write that is)? Is <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>'s suggestion of adding identifier to the Reference type the right way? I'm not sure.</p>",
        "id": 153846907,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1473454643
    },
    {
        "content": "<p>imagingStudy[x] ?..? Reference(ImagingStudy) | Identifier<br>\nAgree creating an ImagingStudy instacne just to contain the identifier is heavy, it also isn't valid - it would need to contain the identifier, patient, numberOfSeries and numberOfInstances to be valid.<br>\nIn FM we had proposed providing a choice as above to deal with the requirement for business identifier rather than the approach taken by other committees of using two attributes, one for the reference and one for the identifier.<br>\nWe are now proposing that  'identifier 0..1 Identifier' be added to the Reference data type. Then all of the different solutions could harmonize on that. It would mean a receiver of a reference with just an identifier could complete the reference should they know it.</p>",
        "id": 153846935,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1473533001
    },
    {
        "content": "<p>I'm suspicious of this. It seems to be making life easy for authors at the cost of making it very difficult for the readers</p>",
        "id": 153847055,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473703884
    },
    {
        "content": "<p>If all the author has is an identifier - and they cannot/will not stand up a FHIR server to host the resource at a URL, then that's the reality.  The data that's going to be exchanged is the data that's going to be exchanged.  The only question is whether it's done using wonky mechanisms like contained resources or an extension on Reference or whether it's recognized as part of core.  In a fully RESTful world, it's unnecessary and possibly inappropriate.  But much of the world isn't (and isn't going to be - at least for a long time) RESTful.</p>",
        "id": 153847119,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473710818
    },
    {
        "content": "<p>And we don't want people to put content into reference.reference which aren't valid references.</p>",
        "id": 153847306,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1473889821
    }
]