[
    {
        "content": "<p>Hi, are there any providers who are using claims data to supplement clinical data in their EHRs? I generally think of  claims and clinical data being siloed off, between the billing and the clinical data groups. But with FHIR and Claims Resources, are people seeing value in bring claims data into FHIR? </p>\n<p>Are you extracting elements from the claim to add information to say a Procedure or Diagnosis resource?<br>\nOr are you storing the full claim in FHIR -- and if so what are you doing with that?</p>",
        "id": 267664241,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1641945330
    },
    {
        "content": "<p>Our system aggregates both clinical and claim data and renders data coming from claims also as FHIR clinical resources, so if you have a claim for a patient listing some conditions and then you search for Condition for that patient you'll get back also those ones</p>",
        "id": 267666186,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1641946567
    },
    {
        "content": "<p>...and we have both payer and providers using it</p>",
        "id": 267666236,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1641946613
    },
    {
        "content": "<p>Makes sense for use cases like overtreatment reduction, prior-auth (aka DaVinci Burden reduction), patient claim/ExpanationOfBenefit viewing (DaVinci Patient Cost Transparency?), and more to be discovered in an effort to reduce cost I imagine.</p>",
        "id": 267669214,
        "sender_full_name": "John Silva",
        "timestamp": 1641948873
    },
    {
        "content": "<p>I know there have been real-world-evidence projects that have integrated clinical and financial data.  Note that whether you'll actually see financial data expressed in FHIR terms depends a bit on what jurisdiction you're in.</p>",
        "id": 267679914,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641959744
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> : Would you mind telling me more? Was curious if your system stores the claims as Claims FHIR resources?<br>\nOr are you solely parsing the claim, to extract things like ICD-10s and then creating Condition resource?<br>\nWhat else are you parsing from the claim? </p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> : Are you able to connect me with anyone working on those evidence projects? I was curious if these were in clinic settings or something else, like clinical trials or research?</p>",
        "id": 267809620,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1642034731
    },
    {
        "content": "<p>It was research.  I'm not sure it's in production yet and I don't think I'm allowed to share details.</p>",
        "id": 267823488,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642049109
    },
    {
        "content": "<p>In our system we extract Conditions from EOB.diagnosis, Procedures from EOB.procedures, MedicationDispense from EOB(Rx).item.<br>\nTechnically speaking all these resources are gathered from the claim submission, they just fill multiple resources.</p>",
        "id": 267866896,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1642079901
    },
    {
        "content": "<p>No, we do not store data as FHIR, we have our own data model. We extract Conditions for EOB.diagnosis, Procedures from EOB.procedures, MedicationDispense and Immunization from EOB.item.</p>",
        "id": 267873912,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1642083257
    },
    {
        "content": "<p>We (Epic) also use claims data to supplement clinical data.  Like Michele, we don't store things as FHIR, and I don't think we are commonly (if ever) using FHIR to transfer the claims (yet).   </p>\n<p>It seems like there are really two different questions you have:</p>\n<ol>\n<li>Is supplementing clinical data with claims data useful?  I think the answer here is a definite \"yes\". </li>\n<li>How does that claim data get shipped between systems?  FHIR is likely to be an increasingly common transmission method.  But it isn't the only way.</li>\n</ol>\n<p>You're also kinda asking about using FHIR as your internal storage format.  But that is really a question about the internals of your system, and isn't really relevant for your industry partners.  Though the question about using FHIR for storage does come up somewhat often, and there are folks who can provide the pros/cons of doing that.</p>",
        "id": 267877637,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1642084830
    }
]