[
    {
        "content": "<p>How does this work? Does the server call back to the client to read its Conformance? Or does the client somehow post it to the server?</p>",
        "id": 153828166,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1463507726
    },
    {
        "content": "<p>at the moment, the client does not communicate it's conformance statement to the server .</p>",
        "id": 153828194,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463513776
    },
    {
        "content": "<p>what would it do with it?</p>",
        "id": 153828195,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463513779
    },
    {
        "content": "<p>I could see a world one day down the road where an app/client might provide a conformance statement to declare that it conforms to specific profiles (say, US DAF or SMART-CA or whatever) as a part of being published on an app gallery.... The gallery could then tailor itself based on the profiles that a given organization/server/jurisdiction/whatever are able to support</p>",
        "id": 153828200,
        "sender_full_name": "James Agnew",
        "timestamp": 1463513935
    },
    {
        "content": "<p>yes. that's what client conformance is for - app registrys </p>",
        "id": 153828202,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463513967
    },
    {
        "content": "<p>And we have also discussed having an operation that the client can invoke (say, $conforms-to), sending the client conformance \"requirements\" as a conformance statement. The server can then do the heavy lifting, comparing the conformance statement and returning to the client whether the stuff the client conformance statement requires are all supported.   Good stuff for one of our or your students to figure out....</p>",
        "id": 153828568,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1463649040
    },
    {
        "content": "<p>I think you and I might have to work that out first </p>",
        "id": 153828772,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463692481
    },
    {
        "content": "<p>Yes, I was wondering about using client conformance to check that a server supports everything my client wants to do.</p>",
        "id": 153829220,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1463985956
    }
]