[
    {
        "content": "<p>Hi All,<br>\nI sent the next mail to fhir mail list:</p>\n<p>How the FHIR Specification is considering de Clinical Process concept?. We understand the Clinical Process as the collection of episodes of care and other healthcare activities done for differents organizations around the same health problem or desease. For example, for the treatment of a chronic desease like the diabetes, to have the ability of traceability of every activity, visit, contact, medication, procedures.. done by all participants in a Health Community: the General Practicioner, Emergency physicians and Specialist physicians in different hospitals, medical centers and Primary care.</p>\n<p>Thanks,</p>\n<p>Lloiyd's response:</p>\n<p>You can do that using a single EpisodeOfCare across all organizations if policy/technical capacity permit.  You can also link multiple EpisodeOfCare instances to say \"these are all representing the same episode\" using the Linkage resource.</p>\n<p>Dan Russler's response:</p>\n<p>You might want to use the \"episode of care\" definition use by insurance company analytic systems or the \"episode of illness\" definition that is more accurate for research analytics. The difference is that insurance company algorithms bundle all costs for all diseases into an \"episode of care\" which is labeled with the primary diagnosis. This means the costs allocated to the primary diagnosis are much higher for people with multiple illnesses. Research tries to get a true cost per illness by allocating appropriate costs to the management of each illness.</p>\n<p>Any other suggestion?</p>\n<p>How I can get all information related to a EpisodeOfCare  (Encounter, ImagingStudy, Observation, etc.) in a single request ?</p>\n<p>Thanks,</p>",
        "id": 153885431,
        "sender_full_name": "jsolana",
        "timestamp": 1492756015
    },
    {
        "content": "<p>What kind of interaction model are you using? With REST query, you won't get this in one... but if you are using a Messaging or Document model; you can describe this in an IG.</p>",
        "id": 153885471,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492780021
    },
    {
        "content": "<p>Using REST,  you would just do multiple queries. With the results of some queries triggering other queries. Sometimes _include can be used, but not always. Multiple queries are not a problem, they are a powerful thing.</p>",
        "id": 153885472,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492780077
    },
    {
        "content": "<p>We could also look at creating a Compartment for EpisodeOfCare like we have with Encounter.  In fact, I'd love someone to submit a change request asking for such a change - I think it'd make a lot of sense to be able to say \"Get me everything tied to the patient's 2nd pregnancy\"</p>",
        "id": 153885491,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492788335
    },
    {
        "content": "<p>Is that a compartment, or the $everything operation (or both)</p>",
        "id": 153886232,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1493241268
    },
    {
        "content": "<p>They tend to go together</p>",
        "id": 153886240,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493250407
    },
    {
        "content": "<p>Hi!</p>",
        "id": 153889192,
        "sender_full_name": "jsolana",
        "timestamp": 1494485831
    },
    {
        "content": "<p>Hi,<br>\nWe have the following example:</p>\n<p>1) Patient requests appointment from his General Practitioner.<br>\n2) General Practitioner Encounter's, the patient refers to pains in the area of the left kidney.<br>\n3) GP drift to nephrology service, recipe METAMIZOL NORMON EFG Cáps. 575 mg to relieve pain and diagnoses ICPC-2 U14 and ICPC-2 U08.<br>\n4) The nephrologist performs an examination and requests an abdominal ultrasound and diagnoses ICD 10 N23 Unespecifed Renal colic<br>\n5) The ultrasound shows the existence of complex calculations in the left kidney.<br>\n6) The nephrologist reviews the ultrasound and reports, diagnoses ICD-10 N20.0 kidney calculus in the left kidney and makes the decision to operate complex calculations detected in the patient's left kidney<br>\n7) The patient is hospitalized and prepared for it.<br>\n8) The intervention is performed on the patient and determines that it requires a few days of hospitalization to follow up.<br>\n9) Inpatient, the doctor visits the patient and keeps track of their evolution (diagnoses ICD 10 N30.9)<br>\n10) The patient is discharged</p>\n<p><a href=\"https://chat.fhir.org/user_uploads/2/99/yZR-Nd6OpHAOHt3QFzGlVcMX/2017_05_22_13_46_38_unnamed1_yEd.png\" target=\"_blank\" title=\"2017_05_22_13_46_38_unnamed1_yEd.png\">2017_05_22_13_46_38_unnamed1_yEd.png</a>  </p>\n<p>With the concept of clinic process we want to have:<br>\n-   Track of all diagnoses about the process (evolution of the diagnose)<br>\n-   Track of all episode of care throught the organizations about the process<br>\n-   Track relations between diagnoses and episodes of care.<br>\n-   Track all information tied to the episodes of care of the process</p>\n<p>how model this clinical process?<br>\nHow model inheritance of diagnoses between episodes of care?<br>\nHow to maintain the list of diagnoses in time?<br>\nAnd the relation of episodes with respect to that list of diagnoses?</p>\n<p>Thanks</p>\n<div class=\"message_inline_image\"><a href=\"https://chat.fhir.org/user_uploads/2/99/yZR-Nd6OpHAOHt3QFzGlVcMX/2017_05_22_13_46_38_unnamed1_yEd.png\" target=\"_blank\" title=\"2017_05_22_13_46_38_unnamed1_yEd.png\"><img src=\"https://chat.fhir.org/user_uploads/2/99/yZR-Nd6OpHAOHt3QFzGlVcMX/2017_05_22_13_46_38_unnamed1_yEd.png\"></a></div>",
        "id": 153890735,
        "sender_full_name": "jsolana",
        "timestamp": 1495453648
    },
    {
        "content": "<p>There are no \"inheritances\" of diagnoses.  Diagnoses aren't limited to a single encounter or episode, they're associated with the patient.  Encounters can link to pre-existing diagnoses.  The list of relevant diagnoses can be maintained in a List resource.  EpisodeOfCare lets you point to as many diagnoses as you like and can identify their role in the episode.  In terms of \"how to model this clinical process\", I'm not sure what you mean.  Are you wanting to define a generic workflow or are you just wondering which resources would be used for each step?  If the latter, which parts are you unclear about?</p>",
        "id": 153890751,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495461412
    },
    {
        "content": "<p>Parts of this reminds me of a Health Concern (which supports linking all diagnoses over time related to the concern), which we haven't fully flushed out using FHIR -- other than the draft Linkage resource (which is not yet complete).</p>",
        "id": 153890753,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1495461697
    },
    {
        "content": "<p>I'll try to explain myself better. I have redraw the picture with the next sequence in time:</p>\n<p>First, the appointment to general practitioner. This encounter initializes the clinic process, we will call it Kidney process.<br>\nchronologycally, the patient will have anothers encounter related to this Kidney process in other departamental organization (nephrology and hospitalization) but in the middle the patient will have another appointment no related with this Kidney process (fever diagnose).</p>\n<p><a href=\"https://chat.fhir.org/user_uploads/10155/hQmacSvkRDQPJtbhsF8mk7ia/Evolution_01.png\" target=\"_blank\" title=\"Evolution_01.png\">https://chat.fhir.org/user_uploads/10155/hQmacSvkRDQPJtbhsF8mk7ia/Evolution_01.png</a></p>\n<p>This patient will have some Conditions, som of them, related but A03 Fever represent another EpisodeOfCare.</p>\n<p>I want to  show the evolution in time of the kidney process, initi with GP EpisodeOfCare and Encounter(s)  then the EpisodeOfCare of nephrology and Encounters and finally the Hospitalization EpisodeOfCare and discharge.</p>\n<p><a href=\"https://chat.fhir.org/user_uploads/10155/IDPAK0XNBnZsucvDu-kc8eo5/Evolution_02.png\" target=\"_blank\" title=\"Evolution_02.png\">https://chat.fhir.org/user_uploads/10155/IDPAK0XNBnZsucvDu-kc8eo5/Evolution_02.png</a></p>\n<p>In FHIR, is it possible?<br>\nWich diagnose can I Use to define de clinic process? (The first and the discharge role diagnose?)</p>\n<div class=\"message_inline_image\"><a href=\"https://chat.fhir.org/user_uploads/10155/IDPAK0XNBnZsucvDu-kc8eo5/Evolution_02.png\" target=\"_blank\" title=\"https://chat.fhir.org/user_uploads/10155/IDPAK0XNBnZsucvDu-kc8eo5/Evolution_02.png\"><img src=\"https://chat.fhir.org/user_uploads/10155/IDPAK0XNBnZsucvDu-kc8eo5/Evolution_02.png\"></a></div><div class=\"message_inline_image\"><a href=\"https://chat.fhir.org/user_uploads/10155/hQmacSvkRDQPJtbhsF8mk7ia/Evolution_01.png\" target=\"_blank\" title=\"https://chat.fhir.org/user_uploads/10155/hQmacSvkRDQPJtbhsF8mk7ia/Evolution_01.png\"><img src=\"https://chat.fhir.org/user_uploads/10155/hQmacSvkRDQPJtbhsF8mk7ia/Evolution_01.png\"></a></div>",
        "id": 153890962,
        "sender_full_name": "jsolana",
        "timestamp": 1495548652
    },
    {
        "content": "<p>The hospitalization would generally be represented as an encounter rather than an episode of care.  Evolution in time would be through history - of the Condition.  Though you could also have an EpisodeOfCare that linked all of the kidney-related encounters, conditions, procedures, etc. to show the vents that happened over time.</p>",
        "id": 153890972,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495553237
    },
    {
        "content": "<p>Ok I take note about Hospitalization and model it  with Encounter Resource. Thanks :)</p>\n<p>But,  In this supose, We erase the hospitalization episodeOfCare and only have and EpisodeOfCare (Primary care) in a clinic Organization and then, through a referralRequest, one EpisodeOfCare (specialized care to Nephrology) in a Hospital Organization, both EpisodeOfCare are related under a health disease (diagnosed in each episodeOfCare) and a workflow.</p>\n<p>I want to know the evolution of the diagnoses of this disease throught the different organization involved and see the workflow evolution. </p>\n<p>Is It possible throught  the List Resource?  Each Entry reference to the Next EpisodeOfCare (ordered by date and can referente to patient and titled with principal diagnose)</p>\n<p>Exist any other form?</p>\n<p>The reason is to centralize this information easily  on a single resource o simple mechanism (avoid to consult in depth each resource to know the  the relation between EpisodeOfCare).</p>\n<p>This supose is very simple, but think about a chronic disease with multiples EpisodeOfCare (more than 10) each one with more than one Encounter and the need to explore this evolution from top (List of EpisodeOfCare related) to bottom view (for each EpisodeOfCare, list of Encounters, for each Encounters, the related information created like MedicationRequest, DiagnosticReport, ProcedureRequest and Procedures etc.) <br>\nThanks again,</p>",
        "id": 153890979,
        "sender_full_name": "jsolana",
        "timestamp": 1495559539
    },
    {
        "content": "<p>If you're doing cross-organization management, I'd probably create a single EpisodeOfCare that groups the hospitalization and primary care episodes.  You can make use of the Linkage resource to indicate that separate Condition instances created by different organizations are all representations of the same underlying condition.  \"evolution\" of a single Condition record is handled through history.</p>",
        "id": 153890983,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495563007
    },
    {
        "content": "<p>Hi, when you say, </p>\n<p>\"I'd probably create a single EpisodeOfCare that groups the hospitalization and primary care episodes\"</p>\n<p>A single EpisodeofCare and link every primary care and hospitalization related in Encounters, isnt it? Or exists any way to reference from a single parent EpisodeOfCare  to N children EpisodeOfCare?</p>\n<p>I Think, this approach does not cover other care settings like rehabilitation, nursing, hospital at home, remote assistance etc, .. or blurs the line between them, a condition evolution can be updated to existing condition, create new conditions in a further step (each condition can represent the same diagnose with a differente codesystem, for example ICPC2 and ICD-10, or represent differetent and/or complementary diagnoses) or erase existing one When some procedure discard it</p>\n<p>I think List offers an infrastructure to centralize the EpisodeOfCare's flow through care providers in time while FHIR does not provide another way  to represent  care provider flow and each provider of care can take advantage of what others have done or will do in a simple manner and to improve the way patients flow through the system of care by strengthening coordination and communication among providers </p>\n<p>Actually the only way I can see on FHIR to browse through EpisodeOfCare's flow is to follow ReferralRequest / ProcedureRequest and revInclude to obtain, or not,  the next EpisodeOfCare.</p>\n<p>Do you see the sense in modeling this sequence of EpisodeOfCare and that FHIR provides an official mechanism for it?</p>\n<p>Another example to explain this situation, Esther Project (Swedish Healthcare System):<br>\n<a href=\"http://www.ihi.org/resources/pages/improvementstories/improvingpatientflowtheestherprojectinsweden.aspx\" target=\"_blank\" title=\"http://www.ihi.org/resources/pages/improvementstories/improvingpatientflowtheestherprojectinsweden.aspx\">http://www.ihi.org/resources/pages/improvementstories/improvingpatientflowtheestherprojectinsweden.aspx</a></p>",
        "id": 153891070,
        "sender_full_name": "jsolana",
        "timestamp": 1495611502
    },
    {
        "content": "<p>Hmm, you're right.  EpisodeOfCare is defined more narrowly than I'd expected - it's also limited to care provided by a single organization, but I think that cross-organizational management of episodes is going to be more common.  @<strong>Brian Postlethwaite (new)</strong> thoughts?</p>",
        "id": 153891118,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495632345
    },
    {
        "content": "<p>The intention is that the Linkage resource would handle tracking the merging, splitting and other relationships of multiple Condition instances.  List certainly lets you group them but doesn't let you establish the relationships.</p>",
        "id": 153891119,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495632402
    },
    {
        "content": "<p>Its true, by now, with List we only can establishes an order by date's relationship althought  the best will be to define more accurately those relationship to cover different scenarios where actions could overlap under different episodes at the same time (and a only date relationship would be inaccurate).</p>\n<p>Then, is it possible to define a new Resource or update the StructureDefinition of an existing one to represent this cross-organizational management of episodes? If exists a new resource definition or update, Can I Help you?<br>\nIt Will be Avalaible in R4?</p>\n<p>Meanwhile, can I use List resource or any other idea to represent it? (For example a basic profiling to simplify a further update to the appropriaterte resource)<br>\nThanks</p>",
        "id": 153891125,
        "sender_full_name": "jsolana",
        "timestamp": 1495633996
    },
    {
        "content": "<p>Have you looked at Linkage?  It's intended to support cross-organizational management.</p>",
        "id": 153891137,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495636558
    },
    {
        "content": "<p>I think we've just talked about that :)<br>\nList is more accurate in this moment to model clinical process better than linkage for various reasons:<br>\n1) List has a title and code element to define the list motivation (for example, we can use List.title to define \"Kidney Clinical Process\"<br>\n2) Can order the items chronologycally (in this aspect, I think it necessary to re-think and add some features to allow define the relationship between EpisodeOfCare more accurately). With <a href=\"https://www.hl7.org/fhir/valueset-linkage-type.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-linkage-type.html\">https://www.hl7.org/fhir/valueset-linkage-type.html</a>, How can I model the relationship between EpisodeOfCare from primary care to a Specialized EpisodeOfCare?<br>\n3) Centralize all relations in a List and offer to simply manner to obtain all EpisodeOfCare and their relationship</p>",
        "id": 153891158,
        "sender_full_name": "jsolana",
        "timestamp": 1495638576
    },
    {
        "content": "<p>Chronological may be difficult as multiple Condition instances may all be updated over time by the different organizations.  The lack of ability to group episodes is a deficiency in the EpisodeOfCare resource.  I'd like to hear back from Brian, but I'd lean towards handling it with an extension on EpisodeOfCare for now.  You can certainly throw everything into a List, but that doesn't tell you what the relationships are.</p>",
        "id": 153891171,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495641095
    },
    {
        "content": "<p>Thanks! I'd like to hear from Brian too :)<br>\nWe interested to be aligned with FHIR and implement the solution that FHIR will define to model group of episodes.</p>",
        "id": 153891173,
        "sender_full_name": "jsolana",
        "timestamp": 1495641355
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192857\">@jsolana</span> , regarding your comment <br>\n<code> List is more accurate in this moment to model clinical process better than linkage for various reasons </code> <br>\nWhen Patient Care work group revisits using Linkage in context of Health Concerns, we <em>will</em> need to address some of your comments, such as having a title or name of the concern.  As such, if you have any interest in using Linkage, but see gaps, feel free to log a change request.</p>",
        "id": 153891283,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1495719505
    }
]