[
    {
        "content": "<p>Hi guys,<br>\nIs anyone looking at representing both meta and data from clinical studies? <br>\nIf you could let me know that would be much appreciated.<br>\nThanks,</p>",
        "id": 153813030,
        "sender_full_name": "Hugo Leroux",
        "timestamp": 1456102712
    },
    {
        "content": "<p>I'll provide some context to my previous question. We've implemented a FHIR solution (see <a href=\"http://healthinet.it.csiro.au/net/odmFhirMapping/fhirOdm.json\" target=\"_blank\" title=\"http://healthinet.it.csiro.au/net/odmFhirMapping/fhirOdm.json\">http://healthinet.it.csiro.au/net/odmFhirMapping/fhirOdm.json</a>) but this is not ideal, so we're proposing two resources for Clinical Study data capture.</p>",
        "id": 153813280,
        "sender_full_name": "Hugo Leroux",
        "timestamp": 1456367515
    },
    {
        "content": "<p>We'd love to develop resources in the clinical trials space but have been waiting for implementers to come forward.  The relevant work group at HL7 is RCRIM (Regulated Clinical Research Information Management).  To move this forward, you'll need to engage with that group.  I'm happy to support you as you walk through the process.</p>",
        "id": 153813486,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1456617349
    },
    {
        "content": "<p>Hi Lloyd,<br>\nThanks for the reply. Yes, that would be great if you could introduce me to that group. I had initiated this work late last year. At the time, I was using a CarePlan as the resource to hold metadata information and a ClinicalImpression to hold the clinical data. This preliminary work has been presented at the SWAT4LS conference (<a href=\"http://ceur-ws.org/Vol-1546/paper_18.pdf\" target=\"_blank\" title=\"http://ceur-ws.org/Vol-1546/paper_18.pdf\">http://ceur-ws.org/Vol-1546/paper_18.pdf</a>). However there are some issues with our proposed approach (e.g. we cannot link a CI to an EOC), which is what has prompted us to pursue the proposal of two new resources. I'll be happy to send you a draft of our proposed model.<br>\nI look forward to hearing from you. Thanks for your help!<br>\nKind regards,<br>\nHugo</p>",
        "id": 153813501,
        "sender_full_name": "Hugo Leroux",
        "timestamp": 1456709542
    },
    {
        "content": "<p>Note that we are including in clinical research in the scope of the Privacy Consent Directive IG. </p>",
        "id": 153813505,
        "sender_full_name": "John Moehrke",
        "timestamp": 1456751671
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191392\">@Hugo Leroux</span> Not sure what sort of introduction you're looking for.  The general practice in HL7 is to sign up for the work group's list server and send an email of introduction indicating what you're interested in.  You might also join their conference calls.  You can find information on both for RCRIM here: <a href=\"http://www.hl7.org/Special/committees/rcrim\" target=\"_blank\" title=\"http://www.hl7.org/Special/committees/rcrim\">http://www.hl7.org/Special/committees/rcrim</a></p>",
        "id": 153813873,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1456965151
    }
]