[
    {
        "content": "<p>Hi, I am in the UK looking at an implementation of FHIR, and we wish to associate outpatient Encounters with specific clinics, as in groups of appointments at the same time for a specific issue, e.g. Fracture Clinic, Electromyography Clinic etc.</p>\n<p>Would serviceProvider be an appropriate place to define such clinics (the clinic being linked back through several layers of organisation to the hospital Trust)?Clinic Defined</p>",
        "id": 161066542,
        "sender_full_name": "Will Bryant",
        "timestamp": 1552922401
    },
    {
        "content": "<p>I'm not understanding the use case - you want to list a set of clinics (/wards?) that may or have been or were associated with a particular admission?</p>",
        "id": 161088391,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552937283
    },
    {
        "content": "<p>Thanks for the response!  When a clinician/group of clinicians runs a clinic for a particular purpose, I want all encounters which are part of that clinic to be associated with the clinic, as well as where the clinic took place.</p>\n<p>Our current thinking is that the room (or set of rooms) in which the clinic takes place will be the location, and the serviceProvider will be the 'clinic', which will be associated with the clinicians running the clinic and by use of Organisation.partOf be linked to the specialty which runs the clinic.  So for an example:</p>\n<ul>\n<li>clinic = serviceProvider = 'General Cardiology Clinic',</li>\n<li>location = 'Lynx outpatients Level 1 VCB' (paediatric hospital) and</li>\n<li>clinic has Organisation.partOf reference to the 'Cardiology' specialty</li>\n</ul>\n<p>Does this make any sense?</p>",
        "id": 161124835,
        "sender_full_name": "Will Bryant",
        "timestamp": 1552977111
    },
    {
        "content": "<p>To clarify these would be outpatient visits mostly.</p>",
        "id": 161131794,
        "sender_full_name": "Will Bryant",
        "timestamp": 1552985864
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 161136091,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552989914
    },
    {
        "content": "<p>Hi, I don't know if this would be the official approach, but since your clinics are associated (defined) with a particular purpose, the encounters of these (groups of) clinicians can perhaps be clustered with EpisodeOfCare. Rooms and other physical locations are in Encounter.Location, Encounter.serviceProvider can be your clinic, but does not need to be: the managingOrganization of the Episode will be the serviceprovider responsible for the specific pathway/purpose, even if parts of it are outsourced to other service providers. This way the same approach can be used to track encounters that form part of a thematic/purposive collaboration between clinicians that does not 'exist' legally. .</p>",
        "id": 161136751,
        "sender_full_name": "Sebastiaan van Sandijk",
        "timestamp": 1552990510
    }
]