[
    {
        "content": "<p>We are looking for a FHIR resource that would map best to our health system’s concept of a Clinician Shift. We looked at the Schedule resource but it doesn’t work for us because its intention appears to represent a particular time slot on a particular date but a Shift represents recurring daily time ranges without date (e.g., morning shift is 7-3, afternoon is 3-11, evening is 11-7). We figure we need to create a new resource based on the Basic Resource but wanted to double check here first.</p>",
        "id": 153895678,
        "sender_full_name": "Marco Di Cesare",
        "timestamp": 1498759353
    },
    {
        "content": "<p>@<strong>Brian Postlethwaite (new)</strong> ?  Marco, can you describe you use \"Clinician Shift\" and what sort of attributes it has?</p>",
        "id": 153895680,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1498759784
    },
    {
        "content": "<p>We use \"Shifts\" to define the standard hours that clinicians are scheduled to work to perform tasks/interventions (e.g., morning shift is from 7am-3pm, evening from 3pm-11pm, night from 11pm to 7am). These ranges would repeat day to day. We may have overlapping shifts defined, such as 7am-3pm for nurses and 9am to 5pm for therapists. When setting up a shift, we define a start time and end time (HH:mm), as well as the shift description. Not much else. But...</p>\n<p>In our EHR system we also have the concept of Tasks and Task Schedules (Task Schedules are similar to FHIR Timing Complex Type) that allow one to define an occurrence pattern (i.e. every Monday, Wednesday and Friday). Since each task can have multiple schedules (timings), the task schedules reference the task (i.e. intervention).</p>\n<p>Tasks (through their Task Schedules) are then assigned to a particular Shift. For example, based on the shift, the nurse could see that they have tasks x, y, z to perform for the patients who occupy a bed (on that date and during that shift time) in the organization the nurse is working in. Something like: “During morning shift, on Mondays, Wednesdays and Fridays at 9am, change wound dressing for patient X”</p>",
        "id": 153895855,
        "sender_full_name": "Marco Di Cesare",
        "timestamp": 1498837859
    },
    {
        "content": "<p>It's sort of close to \"CareTeam\" - the \"7am-3pm nursing shift\" is a particular collection of people who can be assigned to do work.  It's not an exact fit, but it might work with extensions to define the time-range.</p>",
        "id": 153895856,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1498839669
    },
    {
        "content": "<p>Thanks Lloyd. I will take a look at the CareTeam resource.</p>",
        "id": 153895865,
        "sender_full_name": "Marco Di Cesare",
        "timestamp": 1498848547
    },
    {
        "content": "<p>If this is something that your practitioners do, I'd recommend looking into the use of slots. That's what I use in community care where there are no fixed slot definitions, and the workers attend appointments throughout the shift.</p>",
        "id": 153895976,
        "sender_full_name": "Brian Postlethwaite (new)",
        "timestamp": 1499126961
    }
]