[
    {
        "content": "<p>I need to send all the clinical vitals Body Temperature, Blood Pressure, Pulse, Oxygen Rate and BMI-body mass index in Observation resource. Does anybody have implemented it with all of clinical vitals. Bundle or single resource with these clinical information. I am currently sending it with Temprature.</p>",
        "id": 180742229,
        "sender_full_name": "Ali Haider",
        "timestamp": 1573746066
    },
    {
        "content": "<p>It would be inappropriate to send all of those in a single Observation.  You could send a Bundle.  Are you looking at messaging or a query response?</p>",
        "id": 180743032,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573746579
    },
    {
        "content": "<p>(or perhaps a document?)</p>",
        "id": 180743042,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573746587
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I am trying to send in Bundle, but I cannot understand it how to send, but I am sending just Temperature while sending data in Bundle. Is there anything you want to share regarding this like test json of bundle observation?</p>",
        "id": 180756582,
        "sender_full_name": "Ali Haider",
        "timestamp": 1573754633
    },
    {
        "content": "<p>There are examples of Bundle generally in the specification.  When trying to send as a Bundle, what kind of Bundle are you using?  What's driving the sending of the data?  Generally Bundles are used as query responses, RESTful transactions, messages or documents.  Do you know which of these you're doing?</p>",
        "id": 180757029,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573754897
    },
    {
        "content": "<p>I'm doing query responses when we have to send data in bulk.</p>",
        "id": 180757383,
        "sender_full_name": "Ali Haider",
        "timestamp": 1573755133
    },
    {
        "content": "<p>Have you tried executing a query for Observations against one of the test servers?  That should give you a good idea of what the results will look like.</p>",
        "id": 180762140,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573758121
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  <br>\nI have taken help from this link: <a href=\"http://fhir.cerner.com/millennium/dstu2/diagnostic/observation/#overview\" target=\"_blank\" title=\"http://fhir.cerner.com/millennium/dstu2/diagnostic/observation/#overview\">http://fhir.cerner.com/millennium/dstu2/diagnostic/observation/#overview</a><br>\nBut it is showing me History of patient and tobacco status in observation. It is showing just Blood Pressure in it's one of resource not the others like pulse, respiratory rate, BMI, weight and height etc.</p>",
        "id": 180822223,
        "sender_full_name": "Ali Haider",
        "timestamp": 1573816341
    },
    {
        "content": "<p>I have to implement observation without history and tobacco status if you can give me any idea about this.</p>",
        "id": 180822273,
        "sender_full_name": "Ali Haider",
        "timestamp": 1573816387
    },
    {
        "content": "<p>The specific data might vary based on the server you query, but that should have given you an idea of what a \"search response\" Bundle containing Observations looks like.  Namely each Observation type is captured as a distinct Observation.  You can see specific examples of pulse, respiratory rate, etc. in the core specification - look at the vital signs profiles.</p>",
        "id": 180829026,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573822644
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\ncan you send me a specific URL where I can get the idea of how to make it.</p>",
        "id": 180829827,
        "sender_full_name": "Ali Haider",
        "timestamp": 1573823276
    },
    {
        "content": "<p>The vital signs examples can be found here: <a href=\"http://build.fhir.org/observation-examples.html#10.1.8.13\" target=\"_blank\" title=\"http://build.fhir.org/observation-examples.html#10.1.8.13\">http://build.fhir.org/observation-examples.html#10.1.8.13</a></p>",
        "id": 180830577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573823855
    }
]