[
    {
        "content": "<p>what happened to ClinicalImpression.plan?</p>",
        "id": 153865383,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483496847
    },
    {
        "content": "<p>I think it got removed on the grounds that Plan can point to ClinicalImpression and in general the impression would exist before the plan and we try to avoid bidirectional references</p>",
        "id": 153865385,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1483498411
    },
    {
        "content": "<p>but one of the main things you do as a consquence of your diagnostic process is choose a plan....</p>",
        "id": 153865387,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483498542
    },
    {
        "content": "<p>Sure.  But based on FHIR design principles, it makes sense for the plan to point to the impression rather than the other way around.</p>",
        "id": 153865389,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1483501987
    },
    {
        "content": "<p>does it? that's not clear to me. especially since careplan etc don't have a slot for that, but even if they do. Which closes first? the plan, or the impression? not obvious...</p>",
        "id": 153865390,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483502082
    },
    {
        "content": "<p>It doesn't matter which closes first - what matters is which is created first.   The link from CarePlan to ClinicalImpression would be through CarePlan.support.</p>",
        "id": 153865391,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1483507987
    },
    {
        "content": "<p>The removal of plan was a result of a ballot comment (<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=11167\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=11167\">GF#11167</a>) from <span class=\"user-mention\" data-user-id=\"192135\">@Stephen Chu</span>, but this is a loaded topic.... </p>\n<p>There have been ongoing discussions/debates about the scope of the ClinicalImpression - specifically whether it represents the A (assessment) only or the full SOAP.  Patient Care WG believes it was intended to be the \"A\" (assessment) only.  </p>\n<p>I can appreciate that some systems may represent the assessment and plan together (i.e. the full SOAP note), which led some implementers (e.g. Cerner, Epic) to question which resource to use for unstructured notes that span resources (or resource is unknown).  Furthermore, I believe there is an open question on the table whether it was appropriate for Argonaut to have used CarePlan for the US-based MU CCDS Assessment &amp; Plan of Treatment.  The pending question seems to be \"if not CarePlan, can we reach consensus on which other resource to use?\".  </p>\n<p>The FHIR-I recommendation seems to be Composition narrative (per <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8780\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8780\">GF#8780</a>), but I recently heard from <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> that  </p>\n<blockquote>\n<p>In C-CDA we recently had a long discussion about notes vs documents which ultimately resulted in a new way to include unstructured notes in a structured document</p>\n</blockquote>",
        "id": 153865435,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1483540449
    },
    {
        "content": "<p>Composition is about the editorial process, not the content. The answer might very well be that you need to use both composition and care plan. </p>",
        "id": 153865471,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483560775
    },
    {
        "content": "<p>I'm fine with the general question of ClinicalImpression being the \"A\", but I believe that the question of what actions are planned as a consequence of the assessment matters, and needs to be captured somewhere. As things stand now, it's quite unclear how to make the link, and if the answer is Careplan.support, that's a little indirect, and needs better documentation, including as part of ClinicalImpression. At least, I think so.</p>",
        "id": 153865473,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483560894
    },
    {
        "content": "<p>In SD, we approved a new generic note template for C-CDA. I am sure some folks with love/hate it....here is the text:</p>",
        "id": 153865629,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1483579159
    },
    {
        "content": "<p>The Note Activity represents a clinical note. Notes require authorship, authentication, timing information, and references to other discrete data such as encounters. Similar to the Comment Activity, the Note Activity permits a more specific code to characterize the type of information available in the note. The Note Activity template SHOULD NOT be used in place of a more specific C-CDA entry. Note information included needs to be relevant and pertinent to the information being communicated in the document.</p>",
        "id": 153865630,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1483579161
    },
    {
        "content": "<p>Tried to restart conversation with <span class=\"user-mention\" data-user-id=\"191487\">@Russell Leftwich</span>  during the C-CDA implementation-a-thon. I agree the location for the planned piece is quite fuzzy -- especially when all documented together.  So...What does PC recommend for communicating a SOAP note with combined impression and plan?</p>",
        "id": 153866530,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1484323538
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"brett@riverrockassociates.com\">@Brett Marquard</span> Marquard I will take the action item to take this to PCWG for discussion and comment.  </p>",
        "id": 153866818,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1484421429
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191410\">Brett Marquard</span> <a href=\"#narrow/stream/179166-implementers/topic/ClinicalImpression/near/153865630\">said</a>:</p>\n<blockquote>\n<p>The Note Activity represents a clinical note. Notes require authorship, authentication, timing information, and references to other discrete data such as encounters. Similar to the Comment Activity, the Note Activity permits a more specific code to characterize the type of information available in the note. The Note Activity template SHOULD NOT be used in place of a more specific C-CDA entry. Note information included needs to be relevant and pertinent to the information being communicated in the document.</p>\n</blockquote>\n<p>In scope of this discussion, does it mean that the intention of the <em>Note Activity</em> template was to map it to the <em>ClinicalImpression</em> or what? At the first glance, the <em>Note Activity</em> maps better to the <em>Observation</em> with the code/valueString pair.</p>",
        "id": 278485845,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1649619431
    }
]