[
    {
        "content": "<p>Hi all,</p>\n<p>I have a maybe very specific question. As you're aware, ICD10CM contains a lot of Z-Codes dealing with \"Personal history of ...\", e.g. \"Z85.6 Personal history of leukemia\". My question: when representing this as a FHIR condition, what to set in the clinical status? Is it \"resolved\", as the patient doesn't have a leukemia any more, or is it \"active\" as the patient has an active condition of \"Personal history of leukemia\". </p>\n<p>Any help or hint who could answer me that question, greatly appreciated.<br>\nAll the best<br>\nPhilipp</p>",
        "id": 177518861,
        "sender_full_name": "Philipp Daumke",
        "timestamp": 1570455028
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 177549287,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570475050
    },
    {
        "content": "<p>Note that Condition.clinicalStatus is optional (0..1).  There is an invariant, con-3, that conditionally requires clinicalStatus (Condition.clinicalStatus SHALL be present if verificationStatus is not entered-in-error and category is problem-list-item), but it's only a guideline.  The invariant explains why it is only a guideline:</p>\n<blockquote>\n<p>This is (only) a best practice guideline because:<br>\nMost systems will expect a clinicalStatus to be valued for problem-list-items that are managed over time, but might not need a clinicalStatus for point in time encounter-diagnosis.</p>\n</blockquote>\n<p>Generally speaking, in the US, problems are codified using SNOMED whereas diagnoses are codified using ICD-10.  In short, if you don't have a clinicalStatus, then it isn't required.</p>",
        "id": 177630327,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1570550397
    },
    {
        "content": "<p>Hi Michelle,</p>\n<p>thanks a lot for your information. I understand that clinicalStatus is not required. Nevertheless, can/should an ICD-Z-Code like \"Z85.6 Personal history of leukemia\" have a clinicalStatus \"RESOLVED\" or rather \"ACTIVE\"? I would argue for \"ACTIVE\" as I would say once you had a leukemia, you always have an ACTIVE state of \"Personal history of leukemia\", but I'm not sure whether my assumption is right?</p>\n<p>Thanks a lot for your help.<br>\nPhilipp</p>",
        "id": 177915452,
        "sender_full_name": "Philipp Daumke",
        "timestamp": 1570806216
    }
]