[
    {
        "content": "<p>Why there is no option with clinical impression to keep text for Problem, Investigations, findings and Plan? Right now all are given as references whereas many time the initial writing will be always as simple text data.<br>\nIs there any profile available which match with this requirement?</p>",
        "id": 153862176,
        "sender_full_name": "Binu DGIT",
        "timestamp": 1481184297
    },
    {
        "content": "<p>if you just have text, that's ClinicalImpression.summary</p>",
        "id": 153862265,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481197467
    },
    {
        "content": "<p>It is difficult to separate out individual items problems, Investigations, finding etc. from a single  ClinicalImpression.summary text. Need to identify attributes individually but data type to be maintained as String</p>",
        "id": 153862915,
        "sender_full_name": "Binu DGIT",
        "timestamp": 1481445002
    },
    {
        "content": "<p>When you have a Reference data type, you have a Reference.display you could use to capture text.  (I wouldn't recommend using it to capture paragraphs worth of text, but a short sentence would be fine).  If you want more than that, then use the narrative of the referenced resource</p>",
        "id": 153862949,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481472001
    },
    {
        "content": "<p>(which could be contained)</p>",
        "id": 153862950,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481472009
    },
    {
        "content": "<p>As I see it, Reference.display is for identifying the reference, not for summarising it. See <a href=\"http://build.fhir.org/references-definitions.html#Reference.display\" target=\"_blank\" title=\"http://build.fhir.org/references-definitions.html#Reference.display\">http://build.fhir.org/references-definitions.html#Reference.display</a>   </p>\n<ul>\n<li>Definition: Plain text narrative that identifies the resource in addition to the resource reference.</li>\n<li>Comments: This is generally not the same as the Resource.text of the referenced resource. The purpose is to identify what's being referenced, not to fully describe it.</li>\n</ul>",
        "id": 153863376,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1481674882
    },
    {
        "content": "<p>fully describe != summarise. </p>",
        "id": 153863401,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481698952
    }
]