[
    {
        "content": "<p>I want to copy all resources on one server to another. Firstly is there an easy way to do that - without writing a lot of procedural code? Secondly, I have created a script that does it ;-) but it fails to PUT the record on the second server if the Id already exists - but is a different resource type (this is a HAPI server). The Ids don't have to all be the same, but I can't see an easy way to fix up every reference if the Ids are not the same. I want this to work an any server type, so can't rely on special operations or even Batch inserts.</p>",
        "id": 179349734,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1572368312
    },
    {
        "content": "<p>there's 2 different things here:<br>\n- see the discussion on bulk-data around import<br>\n- the logical question of id management - see <a href=\"http://hl7.org/fhir/managing.html#distributed\" target=\"_blank\" title=\"http://hl7.org/fhir/managing.html#distributed\">http://hl7.org/fhir/managing.html#distributed</a></p>",
        "id": 179365568,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572377562
    },
    {
        "content": "<p>thanks. I've found the bulk-data thread now. What i need is $import, but that's not available yet. I understand the issues of id management, and that there is no need for the ids to be the same across multiple systems. I'm still looking for a practical way to import a lot of data though. I will work on my scripts...</p>",
        "id": 179368471,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1572379399
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span> can Vonkloader load a series of Patients then a series of Observations and link them to the right patients?</p>",
        "id": 179374174,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1572383103
    },
    {
        "content": "<p>No sorry, you would have to create transactions bundles for it. Though, you could use conditional references, Vonk will create the correct ids for you</p>",
        "id": 179413537,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1572426895
    },
    {
        "content": "<p>ok thanks Alexander. I would like to use transaction bundles but some servers don't support them. My current efforts are a workaround for that exact issue in fact. So instead I am now using conditional references in my scripts. It means all Patients need a unique identifier, which may not always be the case (usually is though).</p>",
        "id": 179419443,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1572432280
    },
    {
        "content": "<p>Does you script look for the root node in a graph (mostly: patient) and then walk the graph in the direction of leaf-nodes (i.e. without inbound references)?  Circular references A-&gt;B-&gt;C-&gt;A are a nightmare if one can't use transactions. POST A,B,C and fix the references in a seconds processing step, that might do it.</p>",
        "id": 179549179,
        "sender_full_name": "René Spronk",
        "timestamp": 1572539556
    }
]