[
    {
        "content": "<p>I am working on a profile of Observation. I have restricted the cardinality of <em>code.coding</em> to \"1...*\" and also sliced this field (discriminating on system and code). I have set the slicing to be closed and have defined a single slice (with cardinality 1...1). I was under the impression that this latter combination (closed slicing + defining only a single slice, of which only one instance is allowed) should implicitly restrict the cardinality of <em>code.coding</em> to \"1...1\" (no undefined elements allowed + 1 required element defined -&gt; exactly 1 element required). However, when I run the validator on an example Observation in which the element defined by the slice AND a further element (different code &amp; system) is present in <em>code.coding</em>, it goes through without errors (but it does catch if the slice element occurs twice). Have I misunderstood the way closed slicings work?</p>\n<p>For the future: Insofar as closed slicing does actually restrict cardinality, are there any best-practice rules for how to set the cardinality of a field with a closed slicing? E.g. should it also be set to reflect the min and max no. of element the slicing allows or rather not be changed at all?</p>",
        "id": 153973303,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1530697545
    },
    {
        "content": "<p>As far as I can see, your assumption is correct. Which validator are you using?</p>",
        "id": 153973311,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1530702982
    },
    {
        "content": "<p>I am using the standard Java JAR validator, <em>org.hl7.fhir.validator.jar</em> (retrieved the latest version today).</p>",
        "id": 153973314,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1530705403
    },
    {
        "content": "<p>Sounds like a bug in the validator.  Please submit a change request.  If you can submit a minimal instance that demonstrates the issue, that'd be good too.</p>\n<p>On a separate note, restricting the number of codings in a CodeableConcept is generally not a good idea unless you're just documenting what your system will currently do.  One of the objectives of FHIR is to allow systems to design a single external interface that satisfies the needs of all of their interaction partners.  So you might spit out a local code, an ICD9 code, an ICD10 code and a SNOMED code as different codings because different consumers expect different systems.  As a consumer, you should always be prepared to handle the possibility that there are additional codings present you don't care about and support - and when that happens, you should ignore the extra codings, not raise an error.  Otherwise you're forcing your communication partner to have a special interface just for talking to your system, and that significantly raises costs.</p>",
        "id": 153973327,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530710419
    },
    {
        "content": "<p>As a comparison, you can upload your resources (profile + instance) to your Simplifier project, and validate there. It uses the C# Validator.</p>",
        "id": 153973330,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1530711028
    },
    {
        "content": "<p>Thanks for the input! <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I will try to boil the issue down to a minimal version. Where should I submit the change request (will be my first one)? Also thanks for the tip on the cardinality restriction, I will give that some more thought.</p>",
        "id": 153973662,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1530782410
    },
    {
        "content": "<p>There's a link at the bottom of each page in the specification that says \"propose a change\".  There's a one time (free) registration process where we try to confirm you're a human.  After that, you can submit changes to your heart's content :)</p>",
        "id": 153973690,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530797578
    },
    {
        "content": "<p>Now submitted to GForge as <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17469\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17469\">#17469</a> (with a minimal example included).</p>",
        "id": 153974438,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1531212186
    },
    {
        "content": "<p><a href=\"https://simplifier.net/slicebugtest/observation-example/$validate\" target=\"_blank\" title=\"https://simplifier.net/slicebugtest/observation-example/$validate\">https://simplifier.net/slicebugtest/observation-example/$validate</a></p>",
        "id": 153974465,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1531233710
    },
    {
        "content": "<p>I checked your examples. The dotnet validator agrees with you.</p>",
        "id": 153974466,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1531233711
    },
    {
        "content": "<p>Thanks! - nice to know I wasn't entirely off when reading the spec <span class=\"emoji emoji-1f604\" title=\"smile\">:smile:</span></p>",
        "id": 153974583,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1531306618
    }
]