[
    {
        "content": "<p>Is there an official rule from CMS that states that payers should use only US Core Data for Interoperability (USCDI) mentioned profiles? for the Patient Access API ?</p>",
        "id": 218547675,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1606911225
    },
    {
        "content": "<p>Can any data standard experts give me a clarification on that?</p>",
        "id": 218547796,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1606911292
    },
    {
        "content": "<p>Here is the CMS rule section (this applies to MA, but there are two other basically copy/paste sections for other payer types):  <a href=\"https://ecfr.federalregister.gov/current/title-42/chapter-IV/subchapter-B/part-422#p-422.119(a)\">https://ecfr.federalregister.gov/current/title-42/chapter-IV/subchapter-B/part-422#p-422.119(a)</a></p>",
        "id": 218558891,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1606917507
    },
    {
        "content": "<p>Im not finding a place where its written to follow which profiles we need to follow or mandatory right?</p>",
        "id": 218562933,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1606919287
    },
    {
        "content": "<blockquote>\n<p>Technical requirements. An MA organization implementing an API under paragraph (a) of this section:</p>\n<p>(1) Must implement, maintain, and use API technology conformant with 45 CFR 170.215;</p>\n</blockquote>\n<p>The 45 CFR 170.215 has a list</p>",
        "id": 218564470,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1606919882
    },
    {
        "content": "<p>In the rule itself, 42 CFR 422.119(c) is probably the best you'll get.  It points to the standards defined by ONC, which includes a list of FHIR R4, US Core, SMART, Bulk FHIR, and OIDC.  However not all of those make sense for CMS Patient Access.  I think there has been various clarification from CMS scattered around, but in terms of the actual rule language, it definitely isn't very clear.</p>",
        "id": 218564528,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1606919894
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>  I see that it is only mentioned that we should adopt the US core profiles. But it is not clear if we can do profiling on top of these US core profiles</p>",
        "id": 218565386,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1606920232
    },
    {
        "content": "<p>There are only 26 profiles mentioned in the US core profiles. For the Patient Access APi this is not sufficient to cover all the use cases needed for capturing the Encounter information</p>",
        "id": 218565526,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1606920281
    },
    {
        "content": "<p>But If we do profiling on top of the profile -- then its more like creating our own profile right?</p>",
        "id": 218565597,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1606920309
    },
    {
        "content": "<p>My understanding is that those are the minimum requirement. Server shall implement at lease what required and can support additional profiles (or more restricted profiles)</p>",
        "id": 218568976,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1606921610
    },
    {
        "content": "<p>You can re-profile the US Core profiles for your use case but you must use the USCore profiles as a base for information that is relevant to them</p>",
        "id": 218569110,
        "sender_full_name": "David Pyke",
        "timestamp": 1606921673
    },
    {
        "content": "<p>Most of CMS requires the use of the Davinci and CARIN profiles (which also are derived from USCore, where appropriate)</p>",
        "id": 218569253,
        "sender_full_name": "David Pyke",
        "timestamp": 1606921713
    },
    {
        "content": "<p>The for the claims and encounters part of the CMS patient access API, there isn't really any specific profile named since those concepts aren't included in US Core.  You can just infer FHIR R4.  You may choose to use CARIN or DaVinci profiles, but those aren't named in the CMS rule for Patient Access (yet).</p>",
        "id": 218575787,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1606924261
    },
    {
        "content": "<p>CARIN and Davinci are specifically called out in the guidance: <a href=\"https://www.cms.gov/Regulations-and-Guidance/Guidance/Interoperability/index\">https://www.cms.gov/Regulations-and-Guidance/Guidance/Interoperability/index</a></p>",
        "id": 218576716,
        "sender_full_name": "David Pyke",
        "timestamp": 1606924679
    },
    {
        "content": "<p>Thank you all for the comments. I really thank and appreciate it. I understand that I can safely suggest that, we can create our own profiles on top of the US core profiles..</p>\n<p>But I have couple one doubt on the comment of <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span>  when u mean we should use \"USCOre profiles as base profile\" does it mean we need to use only those 26 resources provided by them? or we can add extra resources as part of r4 too?</p>",
        "id": 218579122,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1606925597
    },
    {
        "content": "<p>You can use any resource but if you're using the resources that USCore profiled, you have to use the USCore profiles of those resources</p>",
        "id": 218579390,
        "sender_full_name": "David Pyke",
        "timestamp": 1606925644
    },
    {
        "content": "<p>got it. Thanks a lot for the clarification. I do see what you have mentioned is correct. In many places they have called out Davin pdex and carin bb. for clinical they're using the US core standards</p>",
        "id": 218579772,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1606925794
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> That CMS link explicitly says that the use of the IG listed on that site is not required.  Using them seems like it would probably position folks well for future rules, but I still don't believe there is any requirement for DaVinci or CARIN IGs for Patient Access API.</p>",
        "id": 218580626,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1606926124
    },
    {
        "content": "<p>No, there's no hard requirement but they're being built specifically to address the CMS rule.  Why reinvent the wheel?</p>",
        "id": 218580773,
        "sender_full_name": "David Pyke",
        "timestamp": 1606926178
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>  is there a link and line says that we can re-profile a existing US-Core profile in CMS guideline? I'm finding it hard to get that statement in CMS link anywhere</p>",
        "id": 218581065,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1606926288
    },
    {
        "content": "<p>and without that it is hard to confirm anything and we will be doing things under assumption</p>",
        "id": 218581139,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1606926319
    },
    {
        "content": "<p>You'll have to interpret on your own based on the info provided so far.  I'm very specifically <em>NOT</em> providing guidance or interpretation, and the question about re-profiling I think falls into that category.  I'm trying to be very careful to only point out what the regulatory language is.   Any clarifications or qualifications about what is allowed or not would need to come from CMS, not me.  I think you are coming to understand the joys of interpreting regulation :).  (I think ONC and CMS did a good job with the rules, but some stuff is really hard and complicated to nail down, especially with some of the targets moving during or soon after the rulemaking process).</p>",
        "id": 218586860,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1606928625
    },
    {
        "content": "<p>Take a look of FHIR profiling rules which may answer some of your questions: <a href=\"http://build.fhir.org/profiling.html\">http://build.fhir.org/profiling.html</a></p>",
        "id": 218589468,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1606929654
    },
    {
        "content": "<p>I think the <em>intent</em> is that you need to use the US Core profiles if they apply.  For example, US Core has a profile on Device, but that profile is focused on implantable devices.  It's not intended satisfy other uses for devices (e.g. representing a decision support system).  If you're using a resource for a purpose that's outside the scope of the US Core profile, it should be ok to not try to comply with the non-relevant US Core profile.  However, whether the lawyers will agree with that is a harder call to make...</p>",
        "id": 218591718,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606930596
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  thank you but I have one dumb question. Is this a matter need to be discussed with payer companies legal team ?</p>",
        "id": 218653633,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1606970973
    },
    {
        "content": "<p>I thought it is just a technical team decision</p>",
        "id": 218653646,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1606970997
    },
    {
        "content": "<p>Dunno.  I'm not a lawyer.  I'm also not extremely familiar with the regulation.</p>",
        "id": 218654766,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606972604
    },
    {
        "content": "<p>Any recommendations on testing tools to validate payer to payer APIs as part of CMS Patient Access API implementation?</p>",
        "id": 261006069,
        "sender_full_name": "Sai Valluripalli",
        "timestamp": 1636558214
    },
    {
        "content": "<p>It's delayed indefinitely</p>",
        "id": 261073589,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1636588426
    },
    {
        "content": "<p>Payer to Payer, that is</p>",
        "id": 261073597,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1636588434
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195509\">@Sai Valluripalli</span> Suggest posting your questions over on <a class=\"stream\" data-stream-id=\"235286\" href=\"/#narrow/stream/235286-Da-Vinci-PDex\">#Da Vinci PDex</a> where the implementation guide around payer-to-payer exchange is managed.  (While the requirement has been deferred, it's unlikely to be deferred forever, so working to test now isn't a bad idea.)</p>",
        "id": 261458622,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1636954043
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Thank you. I am following <a class=\"stream\" data-stream-id=\"229922\" href=\"/#narrow/stream/229922-Da.2BVinci.2BPDex.2BPlan-Net\">#Da+Vinci+PDex+Plan-Net</a> group now.</p>",
        "id": 261491158,
        "sender_full_name": "Sai Valluripalli",
        "timestamp": 1636979903
    }
]