[
    {
        "content": "<p>Hi,<br>\nWe are just starting out writing FHIR API's to provide integration with our Medications Management application and would like to know if anyone has implemented the concept of co-signatures.<br>\nThere are a few scenarios where we require co-signatures but the main one and the scenario we are currently trying to address is in regard to Medication Administration. <br>\nWhen a nurse administers certain medications e.g. infusions our application prompts for entry of a co-signature via input of a second user password.<br>\nWe are not sure of the best method for handling this type of scenario.<br>\nHas anyone had to implement something similar or does anyone have any suggestions?<br>\nMany thanks<br>\nJulia</p>",
        "id": 153894885,
        "sender_full_name": "Julia Davis",
        "timestamp": 1498091313
    },
    {
        "content": "<p>Hi Michele, <br>\nWe don't have code at the moment but what I will do is put together a document including more detail and a diagram of how we are thinking of achieving this.<br>\nCheers<br>\nJulia</p>",
        "id": 153894887,
        "sender_full_name": "Julia Davis",
        "timestamp": 1498093414
    },
    {
        "content": "<p>sounds like a provenance statement - see the Provenance resource. Do you mean digital signatures?</p>",
        "id": 153894892,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498096544
    },
    {
        "content": "<p>Hi Grahame,<br>\nNo a second signature as verification for administration</p>",
        "id": 153894910,
        "sender_full_name": "Julia Davis",
        "timestamp": 1498115652
    },
    {
        "content": "<p>I have attached a document with additional information - any assistance greatly appreciated <br>\n<a href=\"/user_uploads/10155/kb_B4Rr07jZb6k1I7glCzHTi/Discussion-Document-for-FHIR-Chat.pdf\" target=\"_blank\" title=\"Discussion-Document-for-FHIR-Chat.pdf\">Discussion-Document-for-FHIR-Chat.pdf</a> </p>",
        "id": 153894912,
        "sender_full_name": "Julia Davis",
        "timestamp": 1498115995
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> can you look at the co-sign section of that document and tell me if you think this is a provenance?</p>",
        "id": 153894916,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498117575
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"194026\">@Julia Davis</span> . I am co-chair of the Security WG, who own the Signature datatype and Provenance Resource. Your signing and co-signing need are considered within scope of Provenance.signature use-case. As you indicate at some point in the workflow a new Provenance record would be applied by 'the first nurse'. This instance would indicate the Provenance.signature.type of the reason for this signature, that being the patient details were verified and that the drug was applied. This Provenance would not be the completion of the workflow step, just the signature that is part of the workflow step. What you would need to do is define a profile for that signature. What resources, parts of resources, etc. This Provenance and signature would likely need to point at and cover the medication and task; possibly more.  Your counter-signature would do similar with different signature type (purpose), and pointing at not just the medication but also at the previous Provenance from the first nurse.   I would like to help define this, as it will be informative to my committee, it might find needed improvements, and would be a good example.</p>",
        "id": 153894929,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498134917
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-email=\"john.o.lujan@kp.org\" data-user-id=\"905\">@John</span> Moehrke , Many thanks for your reply regarding use of the Provenance Resource, I will read through the documentation and edit  the workflow today. I will post a new version once complete. I will also create a separate flow just around the co-signature so that I can provide more detail. I will also add other scenarios where we require co-signatures. I would definitely appreciate any assistance you are able to give and very happy to provide any information and examples I can. We are also working on integration with the prescribing and pharmacy modules within our application.<br>\nThanks again for your help.<br>\nJulia</p>",
        "id": 153895044,
        "sender_full_name": "Julia Davis",
        "timestamp": 1498174196
    },
    {
        "content": "<p>Hi, Sorry I got pulled off onto some web services work but have now put together a document with a couple of flows. <br>\nAny advice greatly appreciated.<br>\nThanks<br>\nJulia<a href=\"/user_uploads/10155/vo-EiWDt5LAUBXBVEHUI0YhT/Co-Sign-Document-for-FHIR-Chat.pdf\" target=\"_blank\" title=\"Co-Sign-Document-for-FHIR-Chat.pdf\">Co-Sign-Document-for-FHIR-Chat.pdf</a> </p>",
        "id": 153895267,
        "sender_full_name": "Julia Davis",
        "timestamp": 1498529022
    }
]