[
    {
        "content": "<p>How can you fetch all codes/concepts belonging to a code system that is set to not-present? Preferably with paging <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 244619102,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1625169619
    },
    {
        "content": "<p>not-present means that you can't. probably.</p>",
        "id": 244629549,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1625175158
    },
    {
        "content": "<p>it depends....</p>",
        "id": 244629558,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1625175164
    },
    {
        "content": "<p>You could try sending a <code>ValueSet/$expand</code> request with a POST body like:</p>\n<div class=\"codehilite\"><pre><span></span><code>{\n  &quot;resourceType&quot;: &quot;ValueSet&quot;,\n  &quot;compose&quot;: {\n    &quot;include&quot;: [{\n      &quot;system&quot;: &quot;http://my.code.system.url&quot;\n    }]\n  }\n}\n</code></pre></div>",
        "id": 244891873,
        "sender_full_name": "Jim Steel",
        "timestamp": 1625457554
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191376\">@Jim Steel</span> That is like starting up a car to drive when the tire is flat and assuming that when the car runs, the flat will resolve.;-)</p>",
        "id": 245087451,
        "sender_full_name": "Robert McClure",
        "timestamp": 1625599712
    },
    {
        "content": "<p>Not necessarily.  When you query the SNOMED code system, you might well get 'not present' - because while the terminology server has full awareness of all the SNOMED codes, it has no intention of trying to list them when it exposes the CodeSystem resource.  On the other hand, an expand operation might work just fine.</p>",
        "id": 245088911,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625600407
    },
    {
        "content": "<p>Exactly</p>",
        "id": 245099159,
        "sender_full_name": "Jim Steel",
        "timestamp": 1625605774
    },
    {
        "content": "<p>Its second-guessing the flat-tyre light, saying \"maybe if I start the car, I can work out if its just the warning light that's not working, and the tyres might be fine\"</p>",
        "id": 245103898,
        "sender_full_name": "Jim Steel",
        "timestamp": 1625608648
    },
    {
        "content": "<p>It does point out a short-coming in the CodeSystem resource - we can't differentiate \"this is what I'm prepared to tell you right now\" from \"this is what I actually know and am capable of telling you\"</p>",
        "id": 245104608,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625609120
    },
    {
        "content": "<p>Should we introduce an 'availableContent' element alongside 'content' that could declare what the system actually has for the code system (as opposed to what it's displaying)?</p>",
        "id": 245107762,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625611523
    },
    {
        "content": "<p>IMO, a CodeSystem resource, in tandem with a TerminologyCapabilities resource, should enable a terminology server to inform clients of what it provides with regard to a particular code system. If not - and page size/ completeness requests - may be exceptions, then extensions are required. I doubt if any Terminology Server will return all the concepts from a particular edition and version of SNOMED CT, and there may be a case of adding  a property to TerminologyCapabilities to indicate that. However, as <span class=\"user-mention\" data-user-id=\"191376\">@Jim Steel</span> says, ValueSet is the appropriate resource for requesting concepts from code systems, and the implicit ValueSet capability allows a single URI to serve as a value set definition and the basis for the expansions and other value set references.</p>",
        "id": 245108453,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1625612045
    },
    {
        "content": "<p>I'm very perplexed by this thread. If a code system resource has CodeSystem.content = not-present then by deffinition the resource does not have any content: \"None of the concepts defined by the code system are included in the code system resource.\" I hope that you are not suggesting that it is ok to have the FHIR representaation of a code system say this, but somehow in the back room the FHIR server still acts like it actually has the content. That is alarming and improper. And if you tell me it is because a value set has the content instead I'm going to work to fix that because we don't use value sets to store and serve up code systems anymore.</p>",
        "id": 245197703,
        "sender_full_name": "Robert McClure",
        "timestamp": 1625671414
    },
    {
        "content": "<p>It's not alarming <em>or</em> improper.  It's normal.  The \"no content\" is talking about \"what's present in this CodeSystem instance\".  It's not speaking at all about what capability the system has.  You'll <em>never</em> find a terminology server that exposes the SNOMED CT code system with a content value other than 'no content' or 'example only'.  But you'll certainly find lots of terminology servers that support all/most SNOMED CT codes.</p>",
        "id": 245206071,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625674904
    },
    {
        "content": "<p>Value set expansions offer a paged way to navigate through a subset of codes from a code system.  CodeSystem resources have no paging mechanism and really aren't designed to allow exposing the codes from 'large/infinite' code systems.</p>",
        "id": 245206240,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625674977
    },
    {
        "content": "<p>Yes, I agree with Lloyd.  This is expected behavior of most (probably all) FHIR terminology servers, particularly for the large code systems.  The TerminologyCapabilities resource should (assuming it is available) be able to tell you what code systems the server supports (which it obviously needs the code system contents to do) - you wouldn't necessarily be able to or want to try to rely on a CodeSystem resource instance to tell you that.</p>",
        "id": 245265225,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1625709747
    }
]