[
    {
        "content": "<p>i always thought there was a operation to get (potential) codes for a display value. Unfortunately i couldn't find such an operation.<br>\nuse case: study nurses entering diagnoses into text field. The field is autocompleting by display values of concepts of a CodeSystem (ICD 10),  when automcompletion triggered the corresponding ICD code is used to capture the diagnosis</p>",
        "id": 187354963,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1580820287
    },
    {
        "content": "<p>Perhaps the $expand on ValuseSet with the filter set to your input text</p>",
        "id": 187357264,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1580822444
    },
    {
        "content": "<p>Probably what you are thinking of, <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>, is the CodeSystem <a href=\"http://hl7.org/fhir/codesystem-operation-find-matches.html\" target=\"_blank\" title=\"http://hl7.org/fhir/codesystem-operation-find-matches.html\">$find-matches</a> operation?  If I understand what you are wanting, it seems like it would fit.  But so far I don't know of anyone who has actually used it - or if any terminology server has actually  implemented it?  Richard's suggestion of $expand on ValueSet with a filter is more mainstream and likely useful.</p>",
        "id": 187358501,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1580823393
    },
    {
        "content": "<p>Thank you both for your suggestions. $find-matches looks good (wasn't aware that i could use it for a display lookup). Also $expand is a nice workaround.<br>\nI'm still wondering why $lookup doesn't support display as an input parameter. Would be so easy and convenient.</p>",
        "id": 187359877,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1580824510
    },
    {
        "content": "<p>Ah - I was looking at STU3 and had not noticed the new operation in R4. As per the documentation, it should be noted that that operation is currently tagged as \"Trial Use\".</p>",
        "id": 187362064,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1580826169
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> I think this is a typical ValueSet use case. You have a value set expansion bound to the input field and use some logic to filter the available coding based on the user input.</p>",
        "id": 187365979,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1580828869
    },
    {
        "content": "<p>Agree with <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> . Time before I was looking a way to search by name of the concept (_display_) (<a href=\"#narrow/stream/179202-terminology/topic/search.20concepts.20by.20name\" title=\"#narrow/stream/179202-terminology/topic/search.20concepts.20by.20name\">https://chat.fhir.org/#narrow/stream/179202-terminology/topic/search.20concepts.20by.20name</a>). Nowaday, for that search I have to use a VS and $expansion + filter to get a concept.</p>",
        "id": 187552301,
        "sender_full_name": "Marcelo Cabello",
        "timestamp": 1580999479
    },
    {
        "content": "<p>I would not have expected $find-matches (which AFAIK is not a widely supported operation) to be used for this purpose.<br>\nIf you want to search for a code in a CodeSystem by designation ('display' is just a special designation), then $expand with the filter parameter is the way to go.  It requires you to either know the URI for the code system's all codes ValueSet or to POST a ValueSet with <code>compose.include.system</code> = the code system's URI</p>",
        "id": 187700332,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1581133804
    },
    {
        "content": "<p>That was my final suggestion, too - as I agree that at this point $find-matches certainly isn't widely (or at all) supported (and possibly it won't ever be?).</p>",
        "id": 187711504,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1581158002
    },
    {
        "content": "<p>the expand with filter works nice for searching a code for a display, lookup on CS is good for getting the display of a code. Still think it would be nice to have a operation which does both through string matching at the same time. <br>\nUseCase: auto-completing suggestion list input field for diagnosis codes. Some physicians enter the code, some want to search through the display values. Very dirty hack: adding the codes to the display values, so they also will be found when filter expanding.<br>\nIf $find-matches would have a display  IN property, it could be used for both.</p>",
        "id": 191357470,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1584812585
    },
    {
        "content": "<p>(Yes we also could do 2 Rest calls for every debounced entry into the input list: lookup and expand with filter. But this doubles the requests, and the js client has to merge the two concept sets</p>",
        "id": 191357538,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1584812645
    },
    {
        "content": "<p>I stumbled on this thread in a search for servers that implement <code>find-matches</code>, and couldn't find any! Neither the known terminology servers nor the common reference implementations seem to support it. Does anyone know of a server that does implement find-matches?</p>\n<p>I'm asking mostly not because I need that operation for something, but because I wanted to try it out in action to get a feel for the operation and to find use-cases for it (we are working on requirements specifications for a national terminology server in Germany, and are wondering about the merits of that operation). I've written a script to post that operation to a server, but testing proves difficult without any endpoints. The only real mention I could find are <a href=\"https://www.devdays.com/wp-content/uploads/2019/12/Rob-Hausam-Using-Terminology-Services-Further-Steps-DevDays-2019-Redmond.pdf\">these slides from DevDays 2019</a> by <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>, where you said that there is \"Very Limited  server support  and experience\". Do you know of some implementation that I haven't found? ;)</p>\n<p>I am now thinking of implementing a proof-of-concept server that exposes find-matches so we can try and get a feel for that operation. Otherwise, I would have to agree with Rob's conclusion in their presentation: if no one implements find-matches (which will only happen if implementers want it), it might need to be withdrawn.</p>",
        "id": 245418510,
        "sender_full_name": "Joshua Wiedekopf",
        "timestamp": 1625821439
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194942\">@Joshua Wiedekopf</span> Firely Server implements $find-matches. See <a href=\"https://docs.fire.ly/projects/Firely-Server/en/latest/features/terminology.html\">https://docs.fire.ly/projects/Firely-Server/en/latest/features/terminology.html</a></p>",
        "id": 245418967,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1625821683
    },
    {
        "content": "<p>Only limitation here is that it only works for CodeSystems that can upload to the administration database of Firely Server. So no LOINC or SNOMED CT support at the moment. You could try it with matching the properties for ICD-10-GM for example.</p>",
        "id": 245419092,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1625821768
    },
    {
        "content": "<p>Let me know if you need assistance in getting it up and running.</p>",
        "id": 245419124,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1625821798
    },
    {
        "content": "<p>Thanks! I'll make sure to get a new evaluation licence for firely server after my holiday ;)</p>",
        "id": 245419194,
        "sender_full_name": "Joshua Wiedekopf",
        "timestamp": 1625821815
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192900\">@Alexander Zautke</span> That's good to know that Firely Server does support $find-matches.  I'll have to take a look at that.  I am curious how you have dealt with the 'exact' parameter, and the corresponding note suggesting that setting exact=false indicates that \"potential matches based on text matching are desired\".  One issue, of course, is that we are looking at matches based on properties, and (certainly strictly speaking in FHIR) designations are not properties.  In a rather \"property-rich\" code system, like SNOMED CT, I think this actually might prove to be useful and usable.  But I wouldn't expect that a code system like ICD-10-GM (or other ICD variants) would have many (if any) properties that could be leveraged.  It would be interesting to look at a CodeSystem resource example for ICD-10-GM (is there an official one?) and see what may be available.  <span class=\"user-mention\" data-user-id=\"194942\">@Joshua Wiedekopf</span></p>",
        "id": 245439532,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1625835762
    },
    {
        "content": "<p>+1!<br>\nWell, sort of official. We (as the Medical Informatics community in Germany) are working on a proper infrastructure to distribute those resources in FHIR. Until then, your best bet if you want to take a look is: <a href=\"https://simplifier.net/medizininformatikinitiative-moduldiagnosen/codesystemicd10gm2021\">https://simplifier.net/medizininformatikinitiative-moduldiagnosen/codesystemicd10gm2021</a> , since ICD-10-GM is provided in CLaML, not FHIR by the respective federal agency...</p>",
        "id": 245440201,
        "sender_full_name": "Joshua Wiedekopf",
        "timestamp": 1625836089
    },
    {
        "content": "<p>We do have some properties on that:</p>\n<div class=\"codehilite\"><pre><span></span><code>&quot;property&quot;:  [\n        {\n            &quot;code&quot;: &quot;kind&quot;,\n            &quot;type&quot;: &quot;code&quot;\n        },\n        {\n            &quot;code&quot;: &quot;coding-hint&quot;,\n            &quot;type&quot;: &quot;string&quot;\n        },\n        {\n            &quot;code&quot;: &quot;exclusion&quot;,\n            &quot;type&quot;: &quot;string&quot;\n        },\n        {\n            &quot;code&quot;: &quot;inclusion&quot;,\n            &quot;type&quot;: &quot;string&quot;\n        },\n        {\n            &quot;code&quot;: &quot;introduction&quot;,\n            &quot;type&quot;: &quot;string&quot;\n        },\n        {\n            &quot;code&quot;: &quot;modifierlink&quot;,\n            &quot;type&quot;: &quot;string&quot;\n        },\n        {\n            &quot;code&quot;: &quot;note&quot;,\n            &quot;type&quot;: &quot;string&quot;\n        },\n        {\n            &quot;code&quot;: &quot;preferredLong&quot;,\n            &quot;type&quot;: &quot;string&quot;\n        },\n        {\n            &quot;code&quot;: &quot;text&quot;,\n            &quot;type&quot;: &quot;string&quot;\n        }\n    ],\n</code></pre></div>\n<p>I am not sure whether there are use cases that wouln't be better adressed by an appropriate ValueSet, but they are there... :)</p>",
        "id": 245440413,
        "sender_full_name": "Joshua Wiedekopf",
        "timestamp": 1625836231
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191405\">Rob Hausam</span> <a href=\"#narrow/stream/179166-implementers/topic/Codesystem.3A.20get.20code.20for.20display/near/245439532\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"192900\">Alexander Zautke</span> That's good to know that Firely Server does support $find-matches.  I'll have to take a look at that.  I am curious how you have dealt with the 'exact' parameter, and the corresponding note suggesting that setting exact=false indicates that \"potential matches based on text matching are desired\".  One issue, of course, is that we are looking at matches based on properties, and (certainly strictly speaking in FHIR) designations are not properties.  In a rather \"property-rich\" code system, like SNOMED CT, I think this could actually might prove to be useful and usable.  But I wouldn't expect that a code system like ICD-10-GM (or other ICD variants) would have many (if any) properties that could be leveraged.  It would be interesting to look at a CodeSystem resource example for ICD-10-GM (is there an official one?) and see what may be available.  <span class=\"user-mention silent\" data-user-id=\"194942\">Joshua Wiedekopf</span></p>\n</blockquote>\n<p>Sorry to disappointment. It's a rather basic implementation. Only it only returns partial or complete matches, we have no means of guessing what is a \"possible\" match.</p>",
        "id": 245444104,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1625837877
    },
    {
        "content": "<p>Except that everything excluding property.subproperty should be working. I haven't heard of anyone using it, happy to get some feedback on the implementation.</p>",
        "id": 245444244,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1625837939
    }
]