[
    {
        "content": "<p>California allows non-binary as a legal gender.  I'm exploring a extension to communicate region-specific legal sex.  However the legislation doesn't do anything to define a code system or value set for interoperability of that concept.  Who would we expect would normally be responsible for defining the code system and value set for region specific value sets?  It doesn't seem like something the legislature would own.  For other regionally defined concepts (including non-gender stuff), who have we worked with to define the value set definitions?  Any folks from Oregon, Washington DC, or California have any insight into how the government-mandated value set was implemented in the interoperability space?</p>",
        "id": 154019581,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1542640338
    },
    {
        "content": "<p>In the US, your best best is the US Realm Taskforce - <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> ?</p>",
        "id": 154019644,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542658849
    },
    {
        "content": "<p>This also seems important for the Da Vinci CRD Patient profiles.</p>",
        "id": 154022145,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1543601210
    },
    {
        "content": "<p>From my experience us-realm is really not a good place to ask /seek advice.</p>",
        "id": 154022396,
        "sender_full_name": "Eric Haas",
        "timestamp": 1543789871
    },
    {
        "content": "<p>I've been waiting for this latest sex-saga to come up. I'd be interested in helping <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> get this done. please PM me and let's see what we can do (I'm a vocab co-chair and the VSAC guy). I'm out of the country for two weeks so this will be a slow walk, hope that's ok.</p>",
        "id": 154022541,
        "sender_full_name": "Robert McClure",
        "timestamp": 1543854860
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> Do we have experience in HL7 vocab dealing with other value sets that are \"informally\" defined by legislation or other outside bodies?  I'm thinking things like provider specialty value sets (AMA, NUCC, CMS) may be a similar example.  AFAIK those value sets are just defined as a list of codes.  Did the publishers of those value sets actually registered the OIDs and URIs for the <a href=\"http://build.fhir.org/terminologies-systems.html\" target=\"_blank\" title=\"http://build.fhir.org/terminologies-systems.html\">terminology systems</a>?   Of did we (HL7) do that?</p>",
        "id": 154022542,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1543855337
    },
    {
        "content": "<p>we do that. in consultation with the owner whenever possible.</p>",
        "id": 154022579,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543866616
    },
    {
        "content": "<p>I have a package fhir.tx.support where I can distribute fhir code system sources for terminologies that HL7 does not own. this sounds like a candidate to me</p>",
        "id": 154022580,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543866654
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> FHIR is bringing some consistency to this process that has been a bit haphazard in the past, particularly across HL7 product families, let alone across SDOs. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> described the short end-result of what I'll give more detail on:  The current process is that if the entity defining the \"value set\" (list/code system/whatever) is engaged with us we work to have them be functional stewards for content that where we define the OID and url, then host the content within a standards artifact (like a pdf - but that thankfully is going away) and more recently in either VSAC or a FHIR terminology service.  In those cases we still will consider this an \"external artifact\" - Code system and value set. When the steward is not engaged, we take over more of the process and that can result in creating something that we really consider an \"internal\" HL7 artifact, but we'll note that it's dependent on content defined elsewhere. I suspect this situation would be more the latter. Given this is a value set and not a code system, what we'd be doing is defining the identifiers and the content of the value set. It is because we defined those things, it is my contention that this is an internal HL7 artifact.</p>\n<p>There are also situations where the steward is more engaged and they define some of the identifiers and hopefully are more explicit about the true scope and content logical definition of the value set, but that takes work most don't have the understanding or resources to support. Also, while not in play here perhaps, remember there are two parts: Code systems and value sets.</p>",
        "id": 154023099,
        "sender_full_name": "Robert McClure",
        "timestamp": 1544019442
    }
]