[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and others.</p>\n<p>We are having a really good discussion on and working towards some really good profiles for acute and GP care with InterOpen.</p>\n<p>I'd like your help in providing some guidance on the use of the codeableconcept data type.  </p>\n<p>Firstly, can you point me to the definition and guidance on usage of codeableconcept type element in a resource.</p>\n<p>The argument has come about because one of the InterOpen members is creatively wanting to use codeableconcepts without codes and only using the codeableconcept.text without a codeableconcept.code.   Not me, I may point out.  I believe this is stretching of the use of codeableconcept.   </p>\n<p>Final question - is it allowable/desirable usage of the the FHIR standard to have a codeableconcept defined with only a text part and no codes?</p>",
        "id": 153938153,
        "sender_full_name": "William Jones DXC",
        "timestamp": 1518777955
    },
    {
        "content": "<p>typo: \" codeableconcepts without codes and only using the codeableconcept.text with a codeableconcept.code\" ?</p>",
        "id": 153938154,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518778205
    },
    {
        "content": "<p>yes, there are a few but important cases where you have text and no codings.</p>",
        "id": 153938155,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518778219
    },
    {
        "content": "<p>that's an essential part of the definition of it.</p>",
        "id": 153938156,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518778233
    },
    {
        "content": "<blockquote>\n<p>yes, there are a few but important cases where you have text and no codings.</p>\n</blockquote>\n<p>Can you provide a use case for this and examples of this, Graham?</p>\n<p>In InterOpen it is proposed to use the condition.code codeableconcept with no codes because the codes would be different across systems.  Would this be one of the cases when it would be allowable?</p>",
        "id": 153938160,
        "sender_full_name": "William Jones DXC",
        "timestamp": 1518779288
    },
    {
        "content": "<p>our general advice across all the standards is that you should always preserve whatever codes you have, since the recipient might be able to pick them up. That's why we have both codes + text</p>",
        "id": 153938162,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518779799
    },
    {
        "content": "<p>the typical situation where you have just text is where the UI has a pick list, and 'other:' with a text box</p>",
        "id": 153938163,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518779872
    },
    {
        "content": "<p>The other is where the standard says \"this can be coded\" but a given implementation only supports free text.</p>",
        "id": 153938225,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518793835
    },
    {
        "content": "<p>Agree that you should always send what codes you have if you have any.  And also that if you send a code, you <em>should</em> send <code>.text</code> too as a fall-back for those who don't understand the code(s) provided.</p>",
        "id": 153938226,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518793905
    },
    {
        "content": "<p>the Coding inside CodeableConcept would have the display value populated with the user's selection, so CodeableConcept.text can be left blank, can it not</p>",
        "id": 153955130,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1525129390
    },
    {
        "content": "<p>well, it depends what you mean by 'the user's selection'. The Coding.display is what is fixed by the code system. If that's the text the user had, then there's no need for CodeableConcept.text. But quite often, it's not the same text</p>",
        "id": 153955134,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1525131074
    }
]