[
    {
        "content": "<p>Is there any recommendation on how to populate CodeSystem in the UI (e.g. drop down list) in general.<br>\nFor example, to populate a drop list with a list of gender, do I need to POST the valueset (<a href=\"http://http://hl7.org/fhir/valueset-administrative-gender\" target=\"_blank\" title=\"http://http://hl7.org/fhir/valueset-administrative-gender\">http://http://hl7.org/fhir/valueset-administrative-gender</a>) and CodeSystem (<a href=\"http://hl7.org/fhir/administrative-gender\" target=\"_blank\" title=\"http://hl7.org/fhir/administrative-gender\">http://hl7.org/fhir/administrative-gender</a>) to the fhir server first, then retrieve these data using a GET?</p>",
        "id": 153900459,
        "sender_full_name": "Kelvin Lok",
        "timestamp": 1501833633
    },
    {
        "content": "<p>on my server, you must post the code system first, but you can post the value set as a parameter to the $expand operation</p>",
        "id": 153900477,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501841503
    },
    {
        "content": "<p>Thanks for the reply. At first I was thinking download this zip <a href=\"http://hl7.org/fhir/examples-json.zip\" target=\"_blank\" title=\"http://hl7.org/fhir/examples-json.zip\">http://hl7.org/fhir/examples-json.zip</a> and use the codesystem-administrative-gender.json and bind to the drop down list. But I think is better to retrieve from the FHIR server which is more maintainable.</p>",
        "id": 153900479,
        "sender_full_name": "Kelvin Lok",
        "timestamp": 1501841826
    },
    {
        "content": "<p>that's the intent, yes</p>",
        "id": 153900480,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501841850
    },
    {
        "content": "<p>but you do need to maintain the TxServer. Still, there's lots of choices</p>",
        "id": 153900481,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501841866
    },
    {
        "content": "<p>Can I use the normal FHIR server mix with the TxServer. I think my question should be is there any difference with the normal FHIR server and FHIR terminology server?</p>",
        "id": 153900483,
        "sender_full_name": "Kelvin Lok",
        "timestamp": 1501842023
    },
    {
        "content": "<p>well, the question is whether the FHIR server (a) supports the terminology resources (the generic servers do) and (b) supports the reasoning the required to implement the various terminology operations</p>",
        "id": 153900484,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501842077
    },
    {
        "content": "<p>What exactly does it mean for a CodeSystem's content to be not-present vs completed? How can I have a code system that is not-present but still have valuesets expand? Is there no way to get the Concepts out of that CodeSystem (referring to the terminology uploader for HAPI). </p>\n<p>And are there limitations to expansion of a ValueSet when a CodeSystem content is not-present? (When I expand my ValueSet displays are not working in the expansion, HAPI3.1.0)</p>",
        "id": 153922334,
        "sender_full_name": "Joshua Bell",
        "timestamp": 1512067716
    },
    {
        "content": "<p>Value set expansions aren't going to work well on any code system that isn't \"complete\" as the information needed to find all relevant codes isn't necessarily going to be present.  However it's possible the terminology service might have access to the codes from some source other than FHIR.  For example, we'd never have a \"complete\" FHIR CodeSystem instance for SNOMED (it'd be way too huge), but lots of terminology servers still load FHIR content from other sources.</p>",
        "id": 153922357,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512074643
    },
    {
        "content": "<p>'.. lots of terminology servers load SNOMED CT content from other sources\" - yes. That's exactly how it works</p>",
        "id": 153922393,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512076295
    },
    {
        "content": "<p>Is there a reason why it would successfully expand the codes in a value set, but not update their displays? Regarding my issue posted in HAPI: <a href=\"https://chat.fhir.org/#narrow/stream/hapi/subject/ValueSet.20expansion.20behavior.20using.20uploaded.20terminology\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/hapi/subject/ValueSet.20expansion.20behavior.20using.20uploaded.20terminology\">https://chat.fhir.org/#narrow/stream/hapi/subject/ValueSet.20expansion.20behavior.20using.20uploaded.20terminology</a> I uploaded SNOMED and can expand a value set, but the displays in the expansion are wrong (using display from CodeSystem rather than the ValueSet). I would think that even if the CodeSystem is not complete, it at least has the two codes in that valueset and it should use the display name in the valueset. Or is it doing some special query that get's those two concepts from \"black box\" and the update doesn't happen after that process?</p>",
        "id": 153922440,
        "sender_full_name": "Joshua Bell",
        "timestamp": 1512078568
    },
    {
        "content": "<p>it should not make any difference whether the code system is explicit or implicit. Beyond that, <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span>  wrote the snomed part of the HAPI implementation, so I'm not sure.</p>",
        "id": 153922444,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512079610
    },
    {
        "content": "<p>Yea I've been reading the TerminologyUploader code, and it does a lot of extra behind the scenes stuff for uploading the CodeSystem by putting it sort of in the background after the CodeSystem has already been made. It seems to work fine, apart from the ValueSet expansions not working with it (Even when I wait to make a valueset for all the CodeSystem stuff to finish). The only thing I can think of is attempting to make an uploader that makes a CodeSystem \"normally\" - but I'm assuming that won't work well due to the size, hence the uploader service in the first place.</p>\n<p>I suppose I'll make a post on the HAPI google forum instead of here, the HAPI stream doesn't really get a lot of traffic to it. Thanks for your insights</p>",
        "id": 153922446,
        "sender_full_name": "Joshua Bell",
        "timestamp": 1512079870
    },
    {
        "content": "<p>yes the HAPI google forum has more active support. Though James is holidaying in Hanoi today, and then travelling back to Canada, so it'll be a few days</p>",
        "id": 153922447,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512079937
    }
]