[
    {
        "content": "<p>Hello - obscure question here - I noticed a delta between stu3 and r4 with regards to coding slices, like Observation.code.coding:BPCode (xref:  <a href=\"http://hl7.org/fhir/bp.html\" target=\"_blank\" title=\"http://hl7.org/fhir/bp.html\">http://hl7.org/fhir/bp.html</a>, <a href=\"http://hl7.org/fhir/STU3/bp.html\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/bp.html\">http://hl7.org/fhir/STU3/bp.html</a>, also tracker item  20409 for bug in the differ)</p>",
        "id": 158968098,
        "sender_full_name": "Nick George",
        "timestamp": 1550663585
    },
    {
        "content": "<p>in STU3, these fields are listed as 0...<em>, but in R4, they're listed as 1...1 .  Given that the slicing is open in both cases, it seems like you'd be able to have multiple codings in either case that match those profiles, so I'm curious what the effective differences is.  Those are kind of a weird case  because I dunno why you'd want multiple codings with the same system AND code, but you could imagine a different case where it were JUST system that were fixed.  It seems to me that having Coding slicing be 0..</em> and 1...1  are effectively the same, since you can always add additional Codings to a CodeableConcept, does that sound right?</p>",
        "id": 158968308,
        "sender_full_name": "Nick George",
        "timestamp": 1550663851
    },
    {
        "content": "<p>erhm, looks like stars go italics, 0...\\* above</p>",
        "id": 158968374,
        "sender_full_name": "Nick George",
        "timestamp": 1550663885
    },
    {
        "content": "<p>I guess another way to phrase this question:<br>\nif a CodeableConcept has a open slicing for a Coding with a fixed system (e.g., <a href=\"http://loinc.org\" target=\"_blank\" title=\"http://loinc.org\">loinc.org</a>), and a size of 1...1, is it <em>illegal</em> to have multiple codings with <a href=\"http://loinc.org\" target=\"_blank\" title=\"http://loinc.org\">loinc.org</a>?  I guess would be \"no\" since it's open slicing, it's just that only one of them would \"be\" the slice (and it doesn't matter which one, as long as there is at least  one.</p>",
        "id": 158968429,
        "sender_full_name": "Nick George",
        "timestamp": 1550663985
    },
    {
        "content": "<p>The intention of the slicing is to say \"there must be one code that looks like this\" - thus the correction in R4.  The upper cardinality of \"1\" will ensure that there's at most one slice with that code and system.  We want to support the possibility for other codings as well - including potentially other LOINC codings.  It's common for there to be more detailed LOINC codes that you'd want to maintain.</p>",
        "id": 158988040,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550678525
    },
    {
        "content": "<p>thanks Lloyd, that mostly makes sense.  so to be clear, when you say, \"The upper cardinality of \"1\" will ensure that there's at most one slice with that code and system.\" does that mean that a record with TWO codes with that code any system would be invalid?  I know it's a weird and unlikely case, just trying to make sure I understand the implications</p>",
        "id": 158993653,
        "sender_full_name": "Nick George",
        "timestamp": 1550682713
    },
    {
        "content": "<p>and similarly, if ONLY the system were specified but not the code (i.e., \"This code MUST have a LOINC code, but we're not saying what it has to be\"), and the slice cardinality were 1...1, would a record with TWO LOINC codes be invalid?</p>",
        "id": 158993746,
        "sender_full_name": "Nick George",
        "timestamp": 1550682786
    },
    {
        "content": "<p>The slice is matching the combination of code + system.  It's totally fine if there are other codes from the same system</p>",
        "id": 158994030,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550683039
    },
    {
        "content": "<p>it's the upper bound I'm asking about though</p>",
        "id": 158994072,
        "sender_full_name": "Nick George",
        "timestamp": 1550683076
    },
    {
        "content": "<p>if two records matched (code X system) would that be invalid</p>",
        "id": 158994183,
        "sender_full_name": "Nick George",
        "timestamp": 1550683159
    },
    {
        "content": "<p>Only if you were slicing only by system.  If you're slicing by code and system and the 1..1 slice defines a fixed value for code and system, then the cardinality constraint of the slice only applies to repetitions in the instance that match that slice.</p>",
        "id": 158994439,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550683332
    },
    {
        "content": "<p>I.e. the instance repetition would have to match the system AND the code to be considered a member of the slice and count towards the max cardinality.</p>",
        "id": 158994461,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550683361
    },
    {
        "content": "<p>ok that makes sense, so even though the slicing might be \"open\", the max cardinality constrains the max number of records that can match that slice</p>",
        "id": 158994537,
        "sender_full_name": "Nick George",
        "timestamp": 1550683436
    },
    {
        "content": "<p>thanks Lloyd!</p>",
        "id": 158994564,
        "sender_full_name": "Nick George",
        "timestamp": 1550683443
    },
    {
        "content": "<p>is there any restriction you know of that says that (code X system) must be unique? e.g., if I have two identical LOINC codes from the same system, but with potentially different other metadata (e.g., display, user_selected, etc.) would that be legal?  weird, definitely, but legal?</p>",
        "id": 158994750,
        "sender_full_name": "Nick George",
        "timestamp": 1550683570
    },
    {
        "content": "<p>(again, thank you so much for being so responsive, it makes a huge difference)</p>",
        "id": 158994759,
        "sender_full_name": "Nick George",
        "timestamp": 1550683585
    },
    {
        "content": "<p>There's no rule that prevents the same code + system pair from being present, though you could define an invariant if you wanted to.  We didn't define such an invariant because duplicate codings don't cause harm and there are theoretical use-cases where it might be useful.  For example, someone might do that because they want to convey multiple display names.  You might also have dumb code that injects translations and doesn't check to see if the code is already there.</p>",
        "id": 158995256,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550683936
    },
    {
        "content": "<p>makes sense, thanks!</p>",
        "id": 158995768,
        "sender_full_name": "Nick George",
        "timestamp": 1550684341
    }
]