[
    {
        "content": "<p>Has anyone attempted or needed to create an extension for the Coding data type to incorporate Reference Range information? For some reason (awaiting for clarification), our FHIR server designers added an extension to this data type rather than using the FHIR-provided Reference Range data type. Curious if anyone has encountered a use case to justify this kind of extension.</p>",
        "id": 153869512,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1485790147
    },
    {
        "content": "<p>I am not sure what you mean by reference range information for a code in coding.   What is the specific use case.  To me a reference range for a coding is akin to valueset for the element. </p>",
        "id": 153869546,
        "sender_full_name": "Eric Haas",
        "timestamp": 1485826919
    },
    {
        "content": "<p>if you mean to have an Observation with a coded value then the reference range could be \"not detected\" for example and that could be represented using <code>referenceRange.text</code> element</p>",
        "id": 153869547,
        "sender_full_name": "Eric Haas",
        "timestamp": 1485827137
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Good Morning! Thank you for responding. Please see the attached Word doc that contains screenshots of the extension our design team wants to implement. My role as the data analyst is to figure out why this extension is necessary given the patient-generated mobile application data we will be storing into a FHIR-based database via a FHIR API.<a href=\"/user_uploads/10155/F98-usQD4tQ4y9TVRZymsx6V/Data-Type-Extension-Example.docx\" target=\"_blank\" title=\"Data-Type-Extension-Example.docx\">Data-Type-Extension-Example.docx</a></p>",
        "id": 153869582,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1485867408
    },
    {
        "content": "<p>I can't think of why ReferenceRange would be included in the Observation.code - the purpose of that element is to capture what type of observation is occurring.  The ReferenceRange is captured elsewhere in the Observation.</p>",
        "id": 153869586,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1485870641
    },
    {
        "content": "<p>Exactly! However, ReferenceRange does not appear in other resources which is why I think the designers added this extension to this data type. Our challenge is having multiple existing and legacy mobile and web-based applications all trying to utilize the FHIR standard as it exists today without the ability to change the legacy data structures that were built before the decision to utilize the FHIR standard for patient-generated data. If anything, these kinds of extension decision continue to confuse me without clear justification from our design team.</p>",
        "id": 153869593,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1485873712
    },
    {
        "content": "<p>So I think there is some confusion here: if you want to limit a value to a set of codes then defining an Observation<a href=\"http://build.fhir.org/profiling.html\" target=\"_blank\" title=\"http://build.fhir.org/profiling.html\">profile</a> with a <a href=\"http://build.fhir.org/profiling.html\" target=\"_blank\" title=\"http://build.fhir.org/profiling.html\">valueset binding</a> would be the best approach.   Without specific examples I can't really see the need for the extensions you all have defineed.  I certainly agree with Lloyd that it doesn;t belong on Coding.  I can imagine perhaps having a set of codes ( a,b,c)  that are considered \"normal\" and perhaps you could have an extension on ReferenceRange with something like:</p>\n<p><code>normalCodes 0..*  type codeableConcept</code></p>",
        "id": 153869601,
        "sender_full_name": "Eric Haas",
        "timestamp": 1485879058
    },
    {
        "content": "<p>An actual concrete example would be great to help us understand this.</p>",
        "id": 153869602,
        "sender_full_name": "Eric Haas",
        "timestamp": 1485879102
    },
    {
        "content": "<p>Thank you for the input so far! I do apologize for the generality here, however, we are only just starting to refactor our mobile applications to utilize the HAPI FHIR API and encountering these extension decisions on a one by one basis. Also, we do not have any \"real\" data yet as we do not have access to the legacy applications. Very frustrating situation at this point. Thanks again! I may come back to this topic once we have a use case and/or example for this extension.</p>",
        "id": 153869603,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1485879307
    },
    {
        "content": "<p>I agree the the reference range shouldn't be handled as an extension on the Coding data type.</p>",
        "id": 153869728,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1485983704
    }
]