[
    {
        "content": "<p>has anyone used collibra to do data governance of a FHIR enabled enterprise?</p>",
        "id": 188491121,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1582060071
    },
    {
        "content": "<p>What do you need to achieve?</p>",
        "id": 188499261,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1582066033
    },
    {
        "content": "<p>I'm implementing Collibra in a few companies</p>",
        "id": 188499285,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1582066059
    },
    {
        "content": "<p>Depending on your scope, i may have seen something</p>",
        "id": 188499395,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1582066134
    },
    {
        "content": "<p>NHS Digital has been doing a bunch of stuff with Collibra and terminology resources<br>\n<span class=\"user-mention\" data-user-id=\"195366\">@Nicholas Oughtibridge (NHS)</span></p>",
        "id": 188502259,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1582068657
    },
    {
        "content": "<p>We have an enterprise data governance process and tool that uses Collibra.  I want to add FHIR Resources so that we can establish data lineage between the various business data and processes and the FHIR implementation.  The existing Collibra work accounted for data and processes that exist in our EMR, other systems or record, as well as our our data warehouse.  We implemented a FHIR server architecture, based on HAPI / CDR where we bidirectionally sync up all systems of record into the FHIR server, while exposing that FHIR API to all internal applications or other systems that can speak FHIR.  One of the enterprise concerns are that the definitions in FHIR may not match what has already been done / decided across all the other systems over time.  Collibra would help us align our FHIR implementation better with the enterprise data, identify missing data or concepts.  I was wondering if there is an easy way Collibra can injest the FHIR data model based on just reading from the API, or injesting some jar file, etc... so that we can kickstart the process of data lineage</p>",
        "id": 188502891,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1582069280
    },
    {
        "content": "<p>I think you need a custom integration. Funny, I was thinking of making a Collibra accelerator for FHIR resources (metadata) and code systems / value sets (ref data)</p>",
        "id": 188516532,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1582089177
    },
    {
        "content": "<p>Normally FHIR stuff is on yellow assets, but it's interesting to see you look at definitions which would be on blue assets</p>",
        "id": 188516606,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1582089336
    }
]