[
    {
        "content": "<p>Let's say I have practitioner resources at [base]/practitioner/... and organizations at [base]/organization/...<br>\nLet's assume both resources have a simple string element for name, and we want to create a corresponding parameter(s) to select resources based on name.</p>\n<p>What happens if I use a combined expression for the parameter (e.g. Practitioner.name|Organization.name), and I run a query such as GET [base]/practitioner?name=Joe.<br>\nAm I \"wasting\" computing resources by evaluating a bunch of Organizations? </p>\n<p>If I'm using similar parameters across multiple resources, what are the advantages/disadvantages of combining them into a single parameter vs. creating separate parameters?</p>",
        "id": 153976326,
        "sender_full_name": "Alex Kontur",
        "timestamp": 1532006570
    },
    {
        "content": "<p>the answer is that it all depends. We define some parameters as across resource parameters, but not otheres</p>",
        "id": 153976328,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532007679
    },
    {
        "content": "<p>it's really a matter of how to you implement it. it doesn't make any difference for performance to my server</p>",
        "id": 153976329,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532007700
    },
    {
        "content": "<p>Ok thanks. If the parameter uses a combined expression, but the server hasn't implemented one of the resources in the expression, what happens? Will it reject the query?</p>",
        "id": 153976330,
        "sender_full_name": "Alex Kontur",
        "timestamp": 1532008075
    },
    {
        "content": "<p>Well, that's up to the server; what's right depends on the local context</p>",
        "id": 153976331,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532008210
    },
    {
        "content": "<p>If I don't know how it will be implemented, sounds like it's probably safer to use separate parameters</p>",
        "id": 153976337,
        "sender_full_name": "Alex Kontur",
        "timestamp": 1532008783
    },
    {
        "content": "<p>There are many standard searchparameters having this 'or' construction, so most implementers will be able to handle it gracefully.</p>",
        "id": 153976353,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1532012017
    },
    {
        "content": "<p>In our directory product we have a specialized custom system level operation for performing specific free text searching across resource types, kinda like a google search in our directory.<br>\nBut I wouldn't be expecting us to define something like this at the International or IG level.</p>",
        "id": 153976707,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1532046931
    }
]