[
    {
        "content": "<p>I would like to get all Observations belonging to Patients who are members of a Group. My initial thought was to use a combination of chaining and reverse chaining, like GET /Observation?subject:Patient:_has:Group:member:identifier=X. The server does not accept this, but should it be a valid query? If not, what would be a way to achive this?</p>",
        "id": 263151702,
        "sender_full_name": "Abel Enthoven",
        "timestamp": 1638282247
    },
    {
        "content": "<p>It may well be a valid query.  That doesn't necessarily mean a server will support it.  You need to look at the server's CapabilityStatement to understand what includes and revIncludes it can handle.</p>",
        "id": 263152087,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638282394
    },
    {
        "content": "<p>Sorry, let me offer some context. To get what I described I could indeed start from /Patient and simply include the observations, using _has as a group filter. I would, however, like to use the above query (so with 'Observation' as the root) to construct a SMART v2 scope, like: system/Observation.rs?subject:Patient:_has:Group:member:identifier=X</p>",
        "id": 263152680,
        "sender_full_name": "Abel Enthoven",
        "timestamp": 1638282641
    },
    {
        "content": "<p>the SMART v2 scopes are just requests for an authorization token. Theory is that if you get that authorization scope, then you could ask for everything at the FHIR endpoint and the server would filter out everything that you are NOT authorized... This theory will run up against reality quickly. This is not likely to be supported by the authorization server or the resource server, as it is both a very complex authorization scope, and an unusual use of complex authorization scopes to result in a stateful search.  <br>\nTheory - Yes.<br>\nReality - Nope!</p>",
        "id": 263153221,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638282876
    },
    {
        "content": "<p><code>GET /Observation?subject:Patient._has:Group:member:identifier=X</code> should be the correct syntax. The chained parameter needs to be separated with a \".\".</p>",
        "id": 263155616,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1638283863
    },
    {
        "content": "<p>I think SMART v2 enabled a new category of issues here. If your resource server does not know anything about users / systems and what they are allowed to access (i.e. most FHIR-native reference implementations), it becomes tempting to move this complexity by trying to express more complex scopes.</p>",
        "id": 263156276,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1638284156
    },
    {
        "content": "<p>An authorization server needs to be smart enough to not issue tokens that the resource server can't enforce.</p>",
        "id": 263156918,
        "sender_full_name": "John Moehrke",
        "timestamp": 1638284418
    },
    {
        "content": "<p>Some implementation tend to enforce only a patient level scope in combination with a patient claim in the token. If you have a user-level scope you could still enforce the Observation query listed above, but it wouldn't know what Observations belong to the user. That's why a simple scope might not be enough. </p>\n<p>I fully agree that the resource server should filter it out.</p>",
        "id": 263158997,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1638285353
    },
    {
        "content": "<p>In the case above I could only imagine that the Group resource replaces the concept of \"What is the user allowed to see\".</p>",
        "id": 263159151,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1638285415
    },
    {
        "content": "<p>My point was just that this type of request is now only possible due to the new token syntax.</p>",
        "id": 263159235,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1638285456
    },
    {
        "content": "<p>Agree with the point here that just because the syntax of the scope language allows, it does not mean anyone should expect every expression to work in real life. I expect a few hardcoded expressions to be supported in the context of US core, for example, to allow for access to vital signs versus lab results.</p>",
        "id": 263160295,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638285894
    },
    {
        "content": "<p>Thanks for all your answers! And I agree with you guys that it is not to be expected that a server could apply these scopes. As <span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span> mentions, it is indeed a reference implementation I'm dealing with, which can not enforce user level scopes. Currently I know of no other way to restrict a user's access than by including narrow scopes in the token or by creating a server plugin of some kind</p>",
        "id": 263178020,
        "sender_full_name": "Abel Enthoven",
        "timestamp": 1638292843
    }
]