[
    {
        "content": "<p>Can/should a Communication resource be used to record a failed/attempted communication? The Scope and Boundaries seem to indicate no (\"a communication that has occurred.\"), but the elements seem to indicate yes.</p>",
        "id": 153879208,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1490208759
    },
    {
        "content": "<p>I think that's fine to use Communication for failed/aborted communications -- as you said, the status, notDone, notDoneReason elements all support that.  We may need to tweak the introduction to make that more clear (if you want to log a tracker).</p>",
        "id": 153879209,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1490208960
    },
    {
        "content": "<p>So, is it  reasonable to expect that each CommunicationRequest that has been acted on in some way, will have a matching Communication?</p>",
        "id": 153879210,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1490209908
    },
    {
        "content": "<p>No more than expecting every MedicationRequest will have associated MedicationDispenses.  It totally depends on the workflow.  Some systems will capture what was done in response, others won't.  And there are often exceptions that don't get tracked as well.  Certainly there's no exepctation in FHIR that there *must* be a matching Communication for each CommunicationRequest.</p>",
        "id": 153879213,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490210682
    },
    {
        "content": "<p>If a sytem was capturing what was done in response, what sort of exceptions would lead to there not being matching CRs/Cs?</p>",
        "id": 153879216,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1490211530
    },
    {
        "content": "<p>The request not getting properly delivered, the Communication getting lost, one communication covering multiple requests but getting linked to all of them.  Obviously if have a direct correlation is \"important\", exceptions can be minimized.  But I don't know that many systems treat requests for communication with the same degree of importance as med and diagnostic orders - and thus the chances of things matching up consistently is probably less.</p>",
        "id": 153879217,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490211786
    },
    {
        "content": "<p>you would expect that if the systems have a closed loop - closely linked - there would be C for every CR. But as soon as you start aggregating...</p>",
        "id": 153879229,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490213125
    },
    {
        "content": "<p>If I have a communication from A to B as result of a finding noted in a DiagnosticReport, and B wants to respond back to A, is there a way to link the follow-up CommunicationRequest and Communication to the original Communication? I assume all CRs and Communications include  the triggering DiagnosticReport as a topic. Should the second CR.topic and C.topic point at the original Communication?</p>",
        "id": 153880926,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1491325420
    },
    {
        "content": "<p>I would expect the second C to refer to the CR it is responding to. The issue, I think, is referring to the original C which resulted in a CR - I would think you would use CommunicationRequest.topic to refer to the original C and Communication.topic to refer to the CommunicationRequest.</p>",
        "id": 153880957,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1491383992
    },
    {
        "content": "<p>Communication will use \"basedOn\" to point to the CommunicationRequest that authorizes/requests/suggests it.  \"topic\" is used to describe what you're talking *about*.  So creating a CommunicationRequest with a \"topic\" of a past Communication only makes sense if you're same something like \"Please tell John Smith that last week I told something to Mary Smith\".   If you want to have a CommunicationRequest that points to a past Communication as a \"reason\" for the new Communication \"Please tell John Smith about X because last week I told something to Mary Smith\", that would be an extension right now.  Though you could certainly propose some sort of a \"sequencing\" link on Communication - say \"inResponseTo\".</p>",
        "id": 153880978,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491399799
    },
    {
        "content": "<p>The specific use case is  notifiying a referring physician to schedule a follow-up within a certain period of time, and the referring physician refusing to accept responsibility for scheduling that. So, it is a variation of your example: \"Please tell Dr. A that I'm not accepting responsibility for what she told to me last week. \" To me that feels like two CR and two C, since the operations will be done asynchronously.<br>\nI feel that the Communications should link to each other directly (not through the CR), in part since a CR seems like a transitive thing that might be purged from the system once completed, but a C is more permanent.<br>\nAdded <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13167\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13167\">GF#13167</a>.</p>",
        "id": 153881003,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1491409060
    },
    {
        "content": "<p>Sorry yes .basedOn not .topic, the examples I included in STU3 with the resource use .basedOn. Some documentation would aid implementers.</p>",
        "id": 153881076,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1491460435
    },
    {
        "content": "<p>Feel free to submit a change request around what documentation you think is needed too :)</p>",
        "id": 153881106,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491490146
    }
]