[
    {
        "content": "<p>Are there any larger scale implementations of CommunicationRequest/Communication? I've got a possible use case that looks like it might fall outside the official definition, but could fit. If there is an online interface (SPA/mobile app) where a patient is logging in, there are times where you want to engage with the person. As an example, let's say you want to recommend a diabetes prevention program. You'd then also want to capture if the person is attempting to use that program. Would using CommunicationRequest to represent the recommendation make sense? Then, to capture what action the person took (ignore/accept) use the Communication resource to capture that high level activity. Does that flow make sense or would that be outside the scope of those resources?</p>",
        "id": 226549938,
        "sender_full_name": "Matt Ping",
        "timestamp": 1613497965
    },
    {
        "content": "<p>that sounds more like CarePlan</p>",
        "id": 226556105,
        "sender_full_name": "John Moehrke",
        "timestamp": 1613500511
    },
    {
        "content": "<p>In a way yes and in a way no. This wouldn't be part of an EHR or what a doctor is interfacing with. This would be more on a payer side as part of a wellness program. The goal would be more around patient engagement from \"not a doctor\". In the idea that this fits in with helping their care, yes, CarePlan sounds right. In the way that it's not from medical professionals and something being offered as a potential help for someone, CarePlan would seem to not be right. I could also be over thinking the problem too</p>",
        "id": 226568768,
        "sender_full_name": "Matt Ping",
        "timestamp": 1613505963
    },
    {
        "content": "<p>Everything in FHIR involves 'communicating', but that doesn't mean Communication should be used.  Communication is when the focal action is one of recording that information was delivered.  If you're wanting to suggest that something be done, then you're probably looking at one of the Request resources - e.g. ServiceRequest, CarePlan, or possibly Task.</p>",
        "id": 226577411,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613510075
    },
    {
        "content": "<p>All of these resources can be authored by a variety of systems - CarePlans definitely don't have to come from a clinician.  An insurer can create a CarePlan for a patient.  A Patient can even create a CarePlan for themselves.</p>",
        "id": 226577512,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613510121
    },
    {
        "content": "<p>Ok, that makes sense then. Based on the conversation, this is sounding like it's tracking more towards Tasks/CarePlans. Appreciate the feedback from everyone.</p>",
        "id": 226580733,
        "sender_full_name": "Matt Ping",
        "timestamp": 1613511560
    },
    {
        "content": "<p>This isn't quite the same use case but the Bidirectional Service eReferral IG exists (<a href=\"http://hl7.org/fhir/us/bser/\">http://hl7.org/fhir/us/bser/</a>) for when a provider wants to recommend a patient for a community program and receive a summary of the interaction between the patient and the program. It's not really what you're describing, but seemed close enough to warrant a mention in case you could make use of it somehow.</p>",
        "id": 226655038,
        "sender_full_name": "Craig Newman",
        "timestamp": 1613568428
    },
    {
        "content": "<p>Interesting. Yes, not quite the same, but the flow does at least seem similar. Thanks!</p>",
        "id": 226685380,
        "sender_full_name": "Matt Ping",
        "timestamp": 1613579905
    }
]