[
    {
        "content": "<p>trying to profile Communication and <code>Communication.topic</code> and<code>CommunicationRrquest.topic</code> are. under-defined.  Specifically how does it differ from  .reasonReference, .supportingInformation, .basedOn and .context and .definition?  To me these other elements cover it all especially if a PC proposal to open up reasonReference to 'Any' is applied.</p>",
        "id": 153898895,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501196455
    },
    {
        "content": "<p>Context = encounter or episode this communication occurred during.  definition = protocol/order set this communication is implementing part of.  basedOn = the order/plan/proposal that led to this communication occurring.  supportingInformation = information intended to help enable the communication to occur (not sure this is in the 80% - can't think of good use cases for this being relevant).  reasonReference = reason why the communication was necessary (e.g. patient is diabetic, so sending them information about low-glycemic index diets).  topic = what the communication is talking about.  E.g. I'm asking a question about this encounter; I'm discussing a change to this medication; etc.  It's essentially the \"subject line\".</p>",
        "id": 153898952,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501220725
    },
    {
        "content": "<p>I think all of those are distinct elements and purposes</p>",
        "id": 153898953,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501220746
    },
    {
        "content": "<p>It sounds more like a string than a reference. And the definition is woefully inadequate.</p>",
        "id": 153898979,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501227711
    },
    {
        "content": "<p>Accept that the definition is inadequate.  If the communication is \"about\" a resource, it makes sense for that to be a Reference.  That way you can say \"find me all the communications made about this AdverseEvent\" or \"This condition\"</p>",
        "id": 153898984,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501230491
    },
    {
        "content": "<p>'That way you can say \"find me all the communications made about this AdverseEvent\" or \"This condition\" '  - That is <code>reasonReference</code>.  I would say subject line and reasonReference are two different things.  I will make a GForge - I don't think I am the only one who is scratching his head...  BTW thanks for responding.</p>",
        "id": 153899516,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501354130
    },
    {
        "content": "<p>reasonReference is <em>why</em> the communication was made, not what it's about.</p>",
        "id": 153899524,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501355454
    },
    {
        "content": "<p>Patient A,  Encounter B,  Dread Disease C:</p>",
        "id": 153899529,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501356051
    },
    {
        "content": "<p>Provider D tells Agency PH about Dread Disease C</p>",
        "id": 153899530,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501356105
    },
    {
        "content": "<p>reason is Condition (finding of Dread Disease).  Subject Line of Communiciation: Case report for Patient A</p>",
        "id": 153899531,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501356307
    },
    {
        "content": "<p>Is that right?</p>",
        "id": 153899532,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501356385
    },
    {
        "content": "<p>how does <code>topic</code> and  <code>payload.contentreference</code> differ then?</p>",
        "id": 153899533,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501356559
    },
    {
        "content": "<p>The use for it as a reference would be something like this: Patient admitted to hospital as hypoglycemic.  Communication sent to PCP with reason of hypoglycemia but topic is patient's insulin prescription.  The payload would just be text.</p>",
        "id": 153899534,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501356596
    },
    {
        "content": "<p>topic = payload</p>",
        "id": 153899535,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501356653
    },
    {
        "content": "<p>I'm not sending the prescription.  I'm commenting on it.  The prescription isn't the payload.</p>",
        "id": 153899552,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501385432
    },
    {
        "content": "<p>Sorry... I am lost with your example  Why are we talking about a prescription?  If want to talk about a prescription the topic would be the prescription the reason would be patients hypoglycemia.  payload would be ??   That is where is gets confusing with this resource.   I never know whether referring to the thing itself ( prescription in your example) or the talking about the thing ( the <br>\n'hey I sent a prescription note' )</p>\n<ul>\n<li>\n<p>the payload is defined as \"Text, attachment(s), or resource(s) that was communicated to the recipient.\"  To me that is the thing = prescription</p>\n</li>\n<li>\n<p>the topic is defined as the \"The resources which were responsible for or related to producing this communication.\"  when I read this I think = payload= prescription  because that is the focus of the communication i.e. what we want to communicate.</p>\n</li>\n<li>\n<p>reasonCode: \"The reason or justification for the communication.\"  are we talking about justifying the 'hey I sent a prescription note' or the original thing that was communicated. (the prescription)</p>\n</li>\n</ul>",
        "id": 153900302,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501728890
    },
    {
        "content": "<p>Agree that \"topic\" definition is poor.  A better definition would be \"a resource that is the focus of a communication but is not actually conveyed - i.e. what the discussion is 'about'\"</p>",
        "id": 153900303,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501731875
    },
    {
        "content": "<p>For example: Dr. Smith sends a letter (payload) to Dr. Jones talking about one of Dr. Jones prescriptions (topic) and his concerns about a DetectedIssue (reason)</p>",
        "id": 153900304,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501731911
    },
    {
        "content": "<p>Thanks that helps.  It possible then that  payload is empty.  e.g,  Just letting you know you sent me this report.</p>",
        "id": 153900305,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501732533
    },
    {
        "content": "<p>and is sound like reason is the reason for the secondary communication and not the prescription.</p>",
        "id": 153900306,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501732588
    },
    {
        "content": "<p>A communication is principly a record of what <em>was</em> communicated.  So \"Dr Smith sent this letter to Dr. Jones talking about one of Dr. Jones prescriptions and his concerns about a DetectedIssue\".  If you've got an empty payload, that means you don't know what was communicated.  \"Dr. Smith sent something to Dr. Jones talking about prescription x\"</p>",
        "id": 153900307,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501734504
    },
    {
        "content": "<p>Reason is definitely the reason for the communication</p>",
        "id": 153900308,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501734541
    },
    {
        "content": "<p>based upon this <code>topic</code>  is not  like a an email subject line.  that sounds like it  belongs in payload too...</p>",
        "id": 153900309,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501734817
    },
    {
        "content": "<p>What belongs in the payload?  The \"payload\" is just \"what was said/shared/provided\".</p>",
        "id": 153900376,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501772970
    }
]