[
    {
        "content": "<p>Hi guys! I just wanted to check that I have understood CommunicationRequest and Communication correctly. I want to send a simple text message from a decision support system via a healthcare provider to a user. Have I understood correctly that the CDS would issue a CommunicationRequest, the healthcare provider shows its payload and then (potentially) saves the payload in its archives as a Communication?</p>",
        "id": 153888785,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1494354694
    },
    {
        "content": "<p>That sounds right.  The CDS system creates a \"recommendation\" CommunicationRequest asking for information to be seen to the user.  When the Practitioner acts on the request, they create a record of that action as a COmmunication.</p>",
        "id": 153888800,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494355379
    },
    {
        "content": "<p>That's what I thought. Thanks!</p>",
        "id": 153888803,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1494355831
    },
    {
        "content": "<p>Hi there <br>\nI'm currently trying to create a fhir communication in .NET using the spark fhir libraries and persisting against an existing user on the furore fhir server.</p>\n<p>When I  try to create the Communication resource (making sure there are the required fields in place) it refuses to persist.  The exception tells me that data at the root level is invalid.  I serialized out the object, and it is valid JSON(but doesn't upload using ARC/Postman.</p>\n<p>Anyone faced this problem before?  I can post my code if necessary</p>",
        "id": 153890728,
        "sender_full_name": "Jim Kane",
        "timestamp": 1495442372
    },
    {
        "content": "<p>are you posting to the wrong server version?</p>",
        "id": 153890731,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495445298
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <br>\nI'm posting using the Hl7.Fhir.DSTU2.core  (Version 0.92.1.0) to the <a href=\"http://spark.furore.com/fhir/Communication\" target=\"_blank\" title=\"http://spark.furore.com/fhir/Communication\">http://spark.furore.com/fhir/Communication</a> endpoint</p>",
        "id": 153890734,
        "sender_full_name": "Jim Kane",
        "timestamp": 1495448995
    },
    {
        "content": "<p>Quick question on Communication vs CommunicationRequest.</p>\n<p>We would like to persist a record of having informed a CDS user something like \"Testing for X is unnecessary\". The user has not ordered testing for X, but we need to communicate it anyways. This user would have received this message while interacting with the CDS system (so the communication is pretty much complete), so it feels redundant to put this in a CommunicationRequest. What is the best way to accomplish this in FHIR? Communication or CommunicationRequest?</p>\n<p>Thanks</p>",
        "id": 153903020,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1503341621
    },
    {
        "content": "<p>Communication.  payload is \"Testing for X is unnecessary\"</p>",
        "id": 153903034,
        "sender_full_name": "Eric Haas",
        "timestamp": 1503342447
    },
    {
        "content": "<p>Thinking of a scenario on an ongoing text messaging (chat) between a practitioner and patient - </p>\n<p>Should each of the message going to-and-fro be modeled as a Communication object or the end to end conversation on a particular topic be modeled as a communication object. Both the options tie into an Encounter but in the former case there has to be a collection of Communication objects packaged into a container (Bundle/Composition/List/Other); In the latter, the Communication object has to be a container of multiple messages.</p>\n<p>Would love to know the thoughts from the community on this scenario and the option that fits more into the overall FHIR model.</p>",
        "id": 153937938,
        "sender_full_name": "Yogesh Mehra",
        "timestamp": 1518729823
    },
    {
        "content": "<p>Interesting question, <span class=\"user-mention\" data-user-id=\"194444\">@Yogesh Mehra</span> . I'm working on an implementation of the Communication resource and wondering the very same thing. Also considering the possibility of using the Communication resource as a mechanism for practitioners to create notes for themselves. They would be considered communications to themselves, which seems like a viable approach, but would be open to additional input.</p>",
        "id": 228460333,
        "sender_full_name": "Joe Jordan",
        "timestamp": 1614709620
    },
    {
        "content": "<p>Communication nominally reflects information that was shared from one source to one or more participants.  So it innately requires a single 'sender'.  If you're representing a 'conversation' where the primary function was delivery of information from one party to another, then a single Communication is fine - even if there's a bit of back and forth in terms of questions, clarifications, etc.  On the other hand if you want to communicate exactly what's being shared from one to another in sequence, then individual Communication instances might be better.</p>",
        "id": 228468133,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614712474
    }
]