[
    {
        "content": "<p>Currently Communication.recipient can reference Device | Organization | Patient | Practitioner | PractitionerRole | RelatedPerson | Group | CareTeam</p>\n<p>Since HealthcareService is a parallel concept to PractitionerRole in the sense of targeting a service, and similar to Organization/Group/CareTeam in the sense of targeting a non-unique individual, I suggest the HealthcareService also be a valid reference target.</p>\n<p>Conceptually, a use case could be that i am sending an inquiry to a HealthcareService about a client, and the target recipient is unknown to me. Organization is too broad, and the target does not have a Group or CareTeam concept. </p>\n<p>Yes/no? Should I submit a change request?</p>\n<p>If so, this would be directly applied immediately to the Canadian eReferral specification project for usage of the Communication resource.</p>",
        "id": 153971996,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1530063061
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 153972027,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530076839
    },
    {
        "content": "<p>Added tracker #17448 for this.<br>\n<a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17448\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17448\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17448</a></p>\n<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , thoughts?</p>",
        "id": 153973751,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1530801461
    },
    {
        "content": "<p>Seems a little strange, and would have thoughts you'd be sending a communicationRequest to the healthcareservice.<br>\nAs such I would have thought that requester and sender should be able to be completely switched between Com and ComRequest. (to handle the reply part)</p>",
        "id": 153974616,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1531311602
    },
    {
        "content": "<p>The CommunicationRequest.sender does contain the HealthcareService reference type.</p>",
        "id": 153974618,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1531311954
    },
    {
        "content": "<p>The Communication resource is the one that has the actual requested details in it, not the request side.</p>",
        "id": 153974619,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1531312044
    },
    {
        "content": "<p>By my understanding of \"CommunicationRequest\", we would be using communication instead of communication request (in the world of eReferrals). In the definition of \"CommunicationRequest\": [CommunicationRequest] is a record of a request for a communication to be performed. A communication is a conveyance of information from one entity, a sender, to another entity, a receiver</p>\n<p>The way I recall <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> explaining CommunicationRequest to me is that I'm asking somebody for information VIA somebody else. Or, when i'm asking somebody to fetch me information. (Nurse, please find the lab results for this patient). But in the case where I'm communicating or asking for information directly, I would use communication.</p>\n<p>Let's say I send a ServiceRequest out, and no provider has been assigned to that ServiceRequest yet. I might later want to send a follow-up communication about that serviceRequest to the HealthcareService with additional info about the patient. Currently, there is no mechanism to do this.</p>",
        "id": 153982176,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1533483418
    },
    {
        "content": "<p>If you want to send information \"about\" the service request, the simplest is to update the ServiceRequest instances with additional supportingInformation.  Keep in mind that everything we do in FHIR is \"communicating\".  Communication is best used when you want to just record record of what was shared (e.g. I disclosed x to the patient's mother; I provided the patient with a brochure) or when your communication event isn't handled by a straight create/update of another resource.</p>",
        "id": 153982178,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533483649
    },
    {
        "content": "<p>Updates to referrals often come with some kind of narrative. e.g.,</p>\n<p>Recipient (DoctorY): \"An AssessmentX is required to complete this referral, and is missing from the initial referral package. Please send within 7 days\".<br>\nSender: \"As requested by DoctorY, here is assessmentX\"</p>\n<p>So my thought was that these types of actions would send communications to capture the narrative, and the communication would be added to the ServiceRequest.supportingInfo. the AssessmentX would be attached to the communication.</p>",
        "id": 153982181,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1533484134
    },
    {
        "content": "<p>In the REST world, when you POST a Communication, all it does is store the communication and make it available for query.  You can't assume the information will cause an update to any other record.</p>",
        "id": 153982183,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533484309
    },
    {
        "content": "<p>Ok, to accomplish the same thing here is a re-state the last sentence:</p>\n<p>So my thought was that these types of actions would send communications to capture the narrative, and the Communication.basedOn would reference the relevant ServiceRequest. Also, AssessmentX would be attached in Communication.payload</p>",
        "id": 153982186,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1533484690
    },
    {
        "content": "<p>I think the challenge is in the use of \"I'm sending\" as opposed to simply updating something and, if relevant, capturing the \"why\" in provenance.  In REST we're in a world where multiple clients are collectively maintaining shared objects.  That's different from the world of messaging we've come from.</p>",
        "id": 153982236,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533512858
    }
]