[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , we need inputs/suggestion on how/which resources we could use for our following workflow:<br>\n1.  GP creates the referral and referral order is created (Health Information exchange (HIE) generates referralOrderID and send order to all identified recipients..)<br>\n2.  Recipients accept/reject it, HIE updates order accordingly (use referralOrderID from Step 1)<br>\n3.  Specialist schedules patient for consultation, originating referral order is updated with appointment information and new information (use referralOrderID from Step 1)<br>\n4.  Specialist completes the consultation and produces consult report (closure of originating referral order workflow) (use referralOrderID from Step 1)</p>\n<p>I want to map this workflow to FHIR which is basically communication (like email) along with exchange of documents (consult report). Also, we are looking for delivery notifications/acknowledgments as well (CommunicationRequest?).</p>",
        "id": 181866099,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1574718063
    },
    {
        "content": "<p>You can look at the Workflow area. You are looking at ServiceRequest and most likely Task.<br>\n<a href=\"http://build.fhir.org/workflow.html\" target=\"_blank\" title=\"http://build.fhir.org/workflow.html\">http://build.fhir.org/workflow.html</a></p>",
        "id": 181867030,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1574718622
    },
    {
        "content": "<p>The general approach in FHIR is that the 'order' is not updated by the system filling the order - because the filling system generally doesn't have authorization to change the order and also because there may be multiple filling systems involved - either in parallel or over time.  Instead, the ServiceRequest defines what's \"authorized\" for the referral.  It may be directed or not.  A Task is then created seeking fulfillment.  The Task might be directed or not.  Systems can then \"claim\" the Task and choose to accept it or reject it.  If rejected, a new Task can be created seeking fulfillment from other systems.  Once accepted, the Task gets updated with intermediary and eventually final results.  The workflow section Vassil pointed to talks about the different means of systems interacting in terms of finding out what has changed depending on what system it's stored on.</p>",
        "id": 181897934,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574755545
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>  and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 181938777,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1574785811
    }
]