[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> and I are working on two different IGs. One is for Birth Defects Reporting and the other is for Birth and Fetal Death Reporting.</p>\n<p>The IGs are on pretty much the same timeline - Connectathon in Sept, ballot in January.</p>\n<p>Obviously there are some overlaps in content (newborn, fetus, mother, father, various observations, etc.).</p>\n<p>We have been discussing ways to align and are not sure how to proceed. e.g. if the newborn patient profile is going to be exactly the same in both IGs, how should we deal with this? It would seem odd to have this common newborn patient in one of the IGs and referenced/used in the other IG. Would it make sense to create some kind of more generic \"Vital Records\" IG that contains the common profiles? Is that even possible seeing as it would span the two projects and not really be owned by either one. Balloting also seems like it would be problematic. Plus, is it even possible to reference profiles/add a dependency to stuff in an IG that isn't yet published (assuming the same problem would occur if we referenced between the two IGs)?</p>\n<p>We really want to align these IGs and not create duplicate profiles, but are finding it hard to figure out a way forward.</p>",
        "id": 200725531,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1591996614
    },
    {
        "content": "<p>Your options are: one IG depends on the other or both depend on a shared IG.  Are both projects sponsored by the same WG?</p>",
        "id": 200727905,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591998246
    },
    {
        "content": "<p>Because in the end, ownership is by the work group, not the project.  (The projects just provide worker-bees to get the work done.)  If you go with a single parent IG, you'll have to coordinate between the projects in terms of who's responsible for handling the reconciliation.</p>",
        "id": 200727951,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591998301
    },
    {
        "content": "<p>Yes they are both Public Health IGs. I think it would have to be <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> who is responsible for all reconciliation... Hahahahaha... <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>\n<p>Is it possible for one to have dependency on an IG that hasn't yet been published?</p>",
        "id": 200731789,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1592001002
    },
    {
        "content": "<p>There's some challenges with a profile being STU that is derived from a profile that is draft.  However, there's no issue with a profile that is STU <em>referencing</em> a profile that is draft.  We can create a frozen snapshot of an IG that can be referenced as a dependency of other IGs.  Once the referenced IG is officially published as STU, you could do an STU update on the derived IGs to point to the 'official' release.  The biggest question is whether that solution will be \"good enough\" for your implementation community.</p>",
        "id": 200743566,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592013154
    },
    {
        "content": "<p>I think that some of them would be derivations and not just simple references. The STU update thing could be an issue, will have to look into that. It's definitely something to consider though, because creating multiples of the exact same profile (like \"Father's Education Level\") in different IGs sure isn't ideal!</p>",
        "id": 200857866,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1592206947
    },
    {
        "content": "<p>Not sure if related, but I am also looking at how to share profiles across IGs. Example:<br>\nwe define Patient and CarePlan profiles on Federal level.<br>\nThen in regional or project IGs we want to </p>\n<ol>\n<li>have examples of those careplans and patients.</li>\n<li>make sure the profiles are there in a single package</li>\n</ol>",
        "id": 200858899,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1592207929
    },
    {
        "content": "<p>the most important question that is often overlooked is: what's the lifecycle? how do changes get managed? Who manages the content?</p>",
        "id": 200858947,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592207962
    },
    {
        "content": "<p>The idea of profiles is their reuse. But I see an issue with their lifecycle and maturity. Perhaps we have to separate that.m, ie.vote on those individually...</p>",
        "id": 200858961,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1592207980
    },
    {
        "content": "<p>you can do all sorts of things. The publishing structure you choose should be one that supports your life cycle. I think that the easiest to describe is that there's a common IG that the other 2 IGs depend on. This naturally defines a publishing cycle.</p>\n<p>But it's not the only approach - there's many others</p>",
        "id": 200859387,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592208235
    },
    {
        "content": "<p>I am looking at displaying them even if they are only references. - e.g. once the federal government approves a profile (e.g. Patient), regional lGs use Patient as it is - they can add examples, and even sub-profile. But if they just use the \"federal\" patient it's the same as inherited, and I'd like it displayed.</p>",
        "id": 200861464,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1592209803
    },
    {
        "content": "<p>for profiling, I don't see an issue with dependsOn. and for displaying them?</p>",
        "id": 200861577,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1592209884
    },
    {
        "content": "<p>So I'm thinking maybe I didn't explain myself properly here. <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> was saying that there shouldn't be an issue referencing (or deriving) profiles from other IGs that are not published. To be clear, all the IGs in question would be CI builds (none yet published). Apparently this is what was done with daVinci and the hrex (framework/library) IG. From what I understood the IGs would just need to have an entry in the FHIR IG registry to be able to reference each other. (Or some other magic that <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> would have to perform?). Rick didn't think there was a need for snapshots or anything like that.</p>\n<p>And then when we are ready to publish, (all STU) we would just have to be sure to publish in sequence...</p>",
        "id": 201686574,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1592886206
    },
    {
        "content": "<p>I think this all works - just use \"current\" as the version in the dependencies</p>",
        "id": 201788026,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592948840
    },
    {
        "content": "<p>Great - thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 201791550,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1592950985
    }
]