[
    {
        "content": "<p>We are working with Community Care data and have mapped about 300 of our 400 data elements to the resources AllergyIntolerance, CarePlan, CareTeam, Communication, Condition, Coverage, Flag, Goal, Immunization, Observation, Organization, Patient, Practitioner, PractitionerRole, Procedure, QuestionnaireResponse, RelatedPerson, ServiceRequest &amp; Task.</p>\n<p>We are still looking to map these types of data elements:</p>\n<ol>\n<li>Patient last updated date</li>\n<li>Food Security: concerns, details, needs, plan</li>\n<li>Psychosocial: details, strengths, spiritual practices, hobbies/interests, other needs/concerns, needs, plan</li>\n<li>Social Support/Family: details, personal relationships, family, children (Ministry involvement), needs, plan</li>\n<li>Social History</li>\n<li>Social &amp; Financial: outreach location, agreement to contact, notes, income type, stable income, livable income, receiving maximum benefits, transportation, citizenship/immigration</li>\n<li>Funding: no income, provincial income assistance, hardship/regular assistance, disability income, person with disability (PWD), employment income, full-time/part-time/casual/not reliable/supplemental income/stipend, pension income, other income, trust fund/inheritance/savings/insurance, SAFER - shelter aid for elderly renters, MNSB - monthly nutritional supplemental benefit, Employment Insurance, other</li>\n<li>Psychiatric Extended Leave - yes/no, program, start date, team, team phone #, team fax #, review date, responsible psychiatrist, case manager/care coordinator</li>\n<li>Palliative Status: wishes home death, wishes to die elsewhere, comments, date, assessed by, prognosis</li>\n<li>Palliative Performance Scale: date, assessed by, PPS %</li>\n<li>Waitlist For Service: date, program, team, team phone #, team fax #, waitlist name, status</li>\n</ol>\n<p>Does anyone have any suggestions on mapping these types of Community Care data elements?</p>",
        "id": 197884952,
        "sender_full_name": "David Reeves",
        "timestamp": 1589772061
    },
    {
        "content": "<p>I'm not a domain expert, but a few ones seem clear to me:</p>\n<ol start=\"3\">\n<li>\n<p>Observations<br>\n6 Observation<br>\n7 Observation</p>\n</li>\n<li>\n<p>probably a Basic resource with a reference to CareTeam</p>\n</li>\n<li>Appointment with status = waitlist, CareTeam</li>\n</ol>",
        "id": 197896480,
        "sender_full_name": "René Spronk",
        "timestamp": 1589785523
    },
    {
        "content": "<ol>\n<li>Provenance (if you want to capture \"functional\" content changes) or meta (if technical record change)</li>\n</ol>",
        "id": 197904698,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589790843
    },
    {
        "content": "<ol start=\"2\">\n<li>d) plan - NutritionOrder</li>\n</ol>",
        "id": 197904902,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589790975
    },
    {
        "content": "<ol start=\"9\">\n<li>We have a Patient Will, mapped it to Consent, but your scope seems broader</li>\n</ol>",
        "id": 197904980,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589791048
    },
    {
        "content": "<ol start=\"9\">\n<li>for you may have a CarePlan on top of (or instead of) patient consent</li>\n</ol>",
        "id": 197905052,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589791084
    },
    {
        "content": "<p>For Food Security (and any other social determinants of health) you should be looking at what the Gravity project is doing.</p>",
        "id": 197929038,
        "sender_full_name": "Craig Newman",
        "timestamp": 1589806175
    },
    {
        "content": "<ol>\n<li>What does it mean to update a Patient - touch their demographics or touch anything in their record?  Generally 'update' will be captured on a per record basis</li>\n<li>a mixture of Condition, Observation, CarePlan.  Maybe also ClinicalImpression</li>\n<li>Same as 2</li>\n<li>Same as 2</li>\n<li>Observation</li>\n<li>Encounter, Observation, Patient, maybe some others</li>\n<li>Coverage, Account, Observation</li>\n<li>ServiceRequest</li>\n<li>Observations</li>\n<li>Observation</li>\n<li>Appointment and/or ServiceReqeust</li>\n</ol>",
        "id": 197948969,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589814825
    },
    {
        "content": "<p>Thanks everyone! I didn't expect such prompt responses, especially in the middle of a long weekend (in Canada anyway)...<br>\nBy \"Patient last updated date\" I am referring to the date displayed at the top of a Summary Report indicating when the patient was last \"seen\" so a provider would know whether to ask the patient if this is their most up-to-date information.</p>",
        "id": 198089372,
        "sender_full_name": "David Reeves",
        "timestamp": 1589904648
    },
    {
        "content": "<p>Is this the last visit you had with the patient (in which case it would be the date of the most recent encounter) or the date of the most recent data you've received (inbound lab, drug or other information can happen between visits, and providers might occasionally review records and update them outside of a patient visit - e.g. adjusting a care plan based on new best practices.</p>",
        "id": 198091124,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589905469
    },
    {
        "content": "<p>Also, assuming that all data was reviewed during an appointment and is therefore \"up to date\" is sometimes a stretch :)</p>",
        "id": 198091192,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589905504
    },
    {
        "content": "<p>You may also want to look at the eLTSS FHIR IG.  While set for a US based LTC use case, it may give you pointers to how you might address these</p>",
        "id": 198103647,
        "sender_full_name": "David Pyke",
        "timestamp": 1589910925
    },
    {
        "content": "<p>Thank you David, it looks very, very interesting and helpful!... <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 198121877,
        "sender_full_name": "David Reeves",
        "timestamp": 1589919957
    },
    {
        "content": "<p>A few more questions:</p>\n<ol>\n<li>\n<p>Which resource should case notes / encounter notes / progress notes be mapped to?  Communication?  ClinicalImpression? Or should they ideally be parsed out to different resources using a cNLP (clinical natural language processing) tool?</p>\n</li>\n<li>\n<p>We have a number of assessments mapped to QuestionnaireResponse, but that seems like a bit of a cop-out to just throw all that information in there when related data might be in other resources simply because it wasn't entered through an assessment. Should we map each assessment data element to a more relevant resource? The data in general would then perhaps be mapped better but it would no longer be possible to recreate intact assessments.</p>\n</li>\n<li>\n<p>Same with Observations. We could map many things to it but it seems to me that anything we put in there other than height, weight, BP, lab results, etc. would need to be clearly documented in our IG and this would not lead to the best interoperability results.</p>\n</li>\n</ol>\n<p>(I worry that too many data elements in QuestionnaireResponse and Observation in some ways makes our data not much more interoperable than it currently is in our source systems... perhaps I'm a bit naive to think FHIR will automagically clean up our 25 years of data in three somewhat messy source systems... <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span>)</p>\n<ol start=\"4\">\n<li>Is there a committee working on developing resources for Community Care data?</li>\n</ol>",
        "id": 198256804,
        "sender_full_name": "David Reeves",
        "timestamp": 1590008477
    },
    {
        "content": "<ol>\n<li>DocumentReference is the solution the implementation community has landed on</li>\n<li>QuestionnaireResponses are good means to capture data, but is not great for searching/analysis.  So if you want data searchable, it'll need to be mapped</li>\n<li>\n<p>Most assessment scores, etc. will end up being Observations.  We've nailed down the codes for 10 vital signs.  If you want guaranteed interoperability, you'll definitely have to nail down the codes for the observations you care about.<br>\n(yes - we're still trying to figure out how best to implement the 'magically clean up my data' operation :&gt;)</p>\n</li>\n<li>\n<p>Patient Care would be the primary work group, though Orders and Observations and certain others might also be relevant</p>\n</li>\n</ol>",
        "id": 198268178,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590015756
    },
    {
        "content": "<p>Just Curious  to know what is the correct place to capture Insurance Authorization  information in coverage resource?</p>",
        "id": 199297433,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1590915117
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 199308555,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590936088
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"202825\">@Vibin_chander</span> You don't store an authorization on your coverage details (essentially card details), you would have the info on the response to the prior authorization - a ClaimResponse resource with use=preauthorization.</p>",
        "id": 199441551,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1591060692
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>  the authorization of an insurance should  be a part of coverage right</p>",
        "id": 199452614,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1591077219
    },
    {
        "content": "<p>Like the isnurance is athorized for a patient.</p>",
        "id": 199452662,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1591077246
    },
    {
        "content": "<p>For the patient resource it is very important to capture the financial Number / Account number of the patient. But i dont see any FHIR element having the Account number.</p>",
        "id": 199525809,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1591118971
    },
    {
        "content": "<p>What is the best plalce to capture the account number of the patient in the Patient Reosurce?</p>",
        "id": 199525839,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1591118988
    },
    {
        "content": "<p>Did you look at the Account resource?</p>",
        "id": 199526924,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591119459
    },
    {
        "content": "<p>Reality is that a single patient can have multiple accounts (of different types).  Accounts also have a lot more data associated with then than just a number.  So Account is treated as a distinct business object, not a simple characteristic of Patient (which is focused on demographics).</p>",
        "id": 199527098,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591119535
    },
    {
        "content": "<p>ok . I thought the Account resource is direct mapping for guarantor</p>",
        "id": 199703075,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1591243405
    },
    {
        "content": "<p>Account includes information about guarantor - because some accounts have guarantors.  But many accounts won't.  Some won't even be tied to patients.</p>",
        "id": 199703480,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591244037
    },
    {
        "content": "<p>ok</p>",
        "id": 199703538,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1591244104
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"202825\">@Vibin_chander</span> If by Account number you mean the patient's member id with their insurance, that goes in Coverage.identifier, in not then I'd need more definition on what you mean by account number.</p>",
        "id": 201660269,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1592859613
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Community.20Care.20Resources/near/198268178\">said</a>:</p>\n<blockquote>\n<ol>\n<li>DocumentReference is the solution the implementation community has landed on</li>\n</ol>\n</blockquote>\n<p>Could you clarify, why not ClinicalImpression resource?</p>\n<p>I've been developing a telemedicine system, chat between Patient and Practitioner, where ChatBot gathers initial data to suggest chief complaint and provide it to the Practitioner with related notes. And I was thinking to put those notes and Practitioner's notes into ClinicalImpression.note and ClinicalImpression.summary before closing the Encounter. And now I'm a bit confused, what to chose.</p>",
        "id": 201977097,
        "sender_full_name": "Vlad Ganshin",
        "timestamp": 1593095726
    },
    {
        "content": "<p>After extensive discussion, the community has decided to use DocumentReference for notes.  The decision was driven by both what information systems typically capture as well as the different ways they capture them.  ClinicalImpression wouldn't be suitable for many types of notes and has a lot of information that most systems don't have in the portions of their system that captures 'notes'.</p>",
        "id": 201978195,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593096180
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> As I understood DocumentReference is only reference to external file and metadata for it. Where should I put my text notes? Is the discussion you mentioned available?</p>\n<p>The only place I found is <a href=\"http://hl7.org/fhir/datatypes-definitions.html#Attachment.data\">DocumentReference.content.attachment.data</a>. But it's base64 encoded field, and it seems super weird to put note there. And I found only one DocRef.type which could be suitable for. It's <a href=\"https://loinc.org/51848-0/\">Assessment note</a>.</p>\n<p>Another resource which is similar to DocRef but not pointing to an external url is Composition. It has reference to encounter and narrative field in Composition.section[*].text. But I can't find <a href=\"http://hl7.org/fhir/valueset-doc-typecodes.html\">suitable type</a> for it to show that it's just a note.</p>",
        "id": 202076135,
        "sender_full_name": "Vlad Ganshin",
        "timestamp": 1593169183
    },
    {
        "content": "<p>DocumentReference.content.attachment can contain the content - and often will.  It would generally only reference an external Binary if the content was exceptionally large.</p>",
        "id": 202094374,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593180282
    }
]