[
    {
        "content": "<p>As a result of some discussions within the Da Vinci project, I've written up some proposed guidance around the use of Task, messaging, Communication and CommunicationResponse.  It's had some initial review and I'm now opening it up for broader review and feedback.  The objective is to get some additional guidance into the FHIR core spec that advises people on how best to ask for information to be communicated and how to manage the delivery of that information.  The discussion document is here.  Feedback in this chat or as comments within the document are both welcome.  <a href=\"https://docs.google.com/document/d/1OHfFcJ-OZvC81OFOOFudmcG3Lg5Wrrwo4n0dA09z40o\" target=\"_blank\" title=\"https://docs.google.com/document/d/1OHfFcJ-OZvC81OFOOFudmcG3Lg5Wrrwo4n0dA09z40o\">https://docs.google.com/document/d/1OHfFcJ-OZvC81OFOOFudmcG3Lg5Wrrwo4n0dA09z40o</a></p>",
        "id": 179202670,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572238692
    },
    {
        "content": "<p>Great document. </p>\n<p>A question about \"Tasks also differ in that they are not typically retained as part of the medical record.\".</p>\n<p>I've been using a task to track the detailed status of processing a ServiceRequest e.g., businessStatus=waitlisted, and the eventual outcome of the referrals such as \"Discharged to Long Term Care. This outcome status information in particular is something I would consider part of the medical record... at the very least it's a very important part of our metrics &amp; reporting. </p>\n<p>Am I putting this outcome (or status) information into the wrong spot by using Task?</p>",
        "id": 179615545,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1572605294
    },
    {
        "content": "<p>=====================<br>\nRegarding general structure of the document: </p>\n<p>First sentence for Documents: Posting documents causes the document to be stored “as is”. <br>\nFirst sentence for Transactions: Transactions allow multiple RESTful actions to be completed at once.<br>\nFirst sentence of Messaging: Like transactions and batches, messaging allows directing behavior of the receiving system beyond simply storing the Bundle.</p>\n<p>As a general piece of feedback, I feel like most sections are missing a clear opening sentence. In my head, when I enter each section the question I'm asking is, \"What IS a Transaction/Document/Collection\" and/or \"what is the purpose of a Transaction/Document/Collection\"  etc..., but instead, I'm a bit disoriented after the first sentence.</p>",
        "id": 179616371,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1572606179
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193959\">@Tim Berezny</span> Typically the result of the Task would be the outputs (Encounter, DiagnosticReport, etc.) - and they would point to the Request.  However, there are absolutely situations where Tasks are part of the medical record.  It's really one of those \"it depends\" situations.  A provider's \"to-do\" list isn't generally retained long-term.  However if Task is the sole record of something important having been done, then it will absolutely be retained.</p>",
        "id": 179623658,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572613373
    }
]