[
    {
        "content": "<p>Trying to clarify the distinction between the sender and requester in the CommunicationRequest resource.<br>\nIs this to cover cases where a Dr (requester) asks a receptionist (sender) to send some information to a patient?</p>",
        "id": 153932221,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1517170728
    },
    {
        "content": "<p>A requests B to send C to D</p>",
        "id": 153932233,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517171323
    },
    {
        "content": "<p>Requester should never be the same as sender (no need to request yourself, you can just do it.)</p>",
        "id": 153932234,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517171357
    },
    {
        "content": "<p>Could be patient asking clinician to send something to themselves or another clinician.  One clinician asking another clinician to send something to them or to the patient, etc.</p>",
        "id": 153932236,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517171389
    },
    {
        "content": "<p>Makes sense, but the element definitions obscure that.</p>",
        "id": 153932541,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1517186780
    },
    {
        "content": "<p>Change request proposing clarifications to the definitions is certainly welcome :)</p>",
        "id": 153932687,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517207534
    },
    {
        "content": "<p>So in the base case where, It just A communicating with B, would i be using .sender then? (and leaving requester blank)? ... or the other way around?</p>",
        "id": 153932939,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1517245098
    },
    {
        "content": "<p>In that case, you'd be using Communication, not CommunicationRequest</p>",
        "id": 153932986,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517248909
    },
    {
        "content": "<p>Ah my brain just exploded. Re-orienting myself...</p>\n<p>So using Communication for my use case would be ok, here is the scenario:</p>\n<p>Person A is asking Person B for some information (e.g., \"When should i expect the lab result to arrive\"). The key factor about this is I am asking for a response. So, I was previously interpreting \"CommunicationRequest\" resource to mean, Person A is requesting a communication from person B(i.e., asking a question) and expecting a response in return with the answer (in the form of a communication).</p>\n<p>If i send the initial question as just a Communication resource (instead of a communicationRequest), is there a way for me to flag that I'm expecting a response to it?</p>",
        "id": 153933021,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1517254175
    },
    {
        "content": "<p>Hope it didn't make too much of a mess :)</p>\n<p>If you're using Communication for \"email/texting over FHIR\", there isn't currently a way to say \"I expect a response\".  If you're actually wanting to say \"please do something\", you might look at Task - that's the way of asking for something to be done (and supports tracking of agreement to do it and linking to whatever was eventually done)</p>",
        "id": 153933025,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517256097
    },
    {
        "content": "<p>Communication is an \"event\"  where you are representing the question. It stands alone and not part of request-response chain.   If you want - you can create an extension for that flag.</p>",
        "id": 153933027,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517256114
    },
    {
        "content": "<p>Actually, it can chain using Communication.inResponseTo, which identifies which Communication this one is replying to. But there is no way to indicate that you want a response.</p>",
        "id": 153933029,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1517256321
    },
    {
        "content": "<p>Alright so:</p>\n<p>Instead of using a \"Communication Request\" to \"ask\" a question, I could use a task to \"ask\" a question, i would expect a \"communication\" in response, which would be \"based on\" the task. <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> I see communication.basedOn but not .inResponseTo on the resource, am i missing something?<br>\n<a href=\"https://www.hl7.org/fhir/communication.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/communication.html\">https://www.hl7.org/fhir/communication.html</a> </p>\n<p>(Or create an extension for communication with an \"expect response\" flag)</p>",
        "id": 153933089,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1517259649
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\n<a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14959\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14959\">#14959</a></p>",
        "id": 153933148,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1517267984
    },
    {
        "content": "<p>Think of Task as throwing an item in someone's \"todo\" list.  Think of Communication as sending someone an email.  You can query tasks, see which are complete, mark them as done or on hold, etc.  With communication, the message could contain anything under the sun - including a question (or 5 questions) and might be responded to or not and the responses might contain answers to some or all or none or questions back or all sorts of other things.</p>",
        "id": 153933184,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517271678
    },
    {
        "content": "<p>Both can be useful, but their behavior is going to be fairly distinct.</p>",
        "id": 153933185,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517271696
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193959\">@Tim Berezny</span> If I want you to send me something then I'd send you a CommunicationRequest and you would send me a Communication (which would probably refer to my CommunicationRequest) which would contain or reference the thing being communicated.</p>",
        "id": 153940591,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1519651249
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193959\">@Tim Berezny</span>, just noticed your comment to me -- inResponseTo was added about a year ago. It isn't in STU3, but will be in release 4</p>",
        "id": 153940658,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1519671839
    },
    {
        "content": "<blockquote>\n<p>A requests B to send C to D</p>\n</blockquote>\n<p>I'm still puzzled by this: is \"C\" a payload representing the body of a message for D, or is it the body of the request for B to read/process? The documentation seems to suggest that <code>payload</code> can somehow be used for both -- and indeed The only example uses payload to say \"Please provide the accident report and any associated pictures to support your Claim# DEF5647.\" -- which is presumably the message that B would read in order to prepare the content in C... But the documentation indicates this would be the payload for C.</p>",
        "id": 166873314,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559180914
    },
    {
        "content": "<p>Should I be reporting an issue on the resource, or am I just confused about how this is supposed to work?</p>",
        "id": 166873317,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559180925
    },
    {
        "content": "<blockquote>\n<p>When using contentCodeableConcept, the CodeableConcept is what is being communicated and is not a categorization of the content. </p>\n</blockquote>\n<p>Is not clearing things up for me</p>",
        "id": 166873402,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559181021
    },
    {
        "content": "<p>C can either be the explicit content to send or a description of the type of content to send.  If you think further clarification is needed, feel free to submit an issue.</p>",
        "id": 166874606,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559182653
    },
    {
        "content": "<p>I'm not sure I understand the intent -- \"description of the type of content to send\" would be \"Accident report\" (in some... codified way?). What the example shows is actually a message written from A to B.</p>",
        "id": 167026394,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559330952
    },
    {
        "content": "<p>I submitted <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22648\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22648\">GF#22648</a></p>",
        "id": 167026796,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559331242
    },
    {
        "content": "<p>Is is right to save sent e-mails, for example calling for telemedicine, as CommunicationRequest resources? The e-mail itself should be represented as Communication resource?</p>\n<p>Example: A main Practitioner send a link by e-mails to a Patient and a Specialist.<br>\nIn this case, I would have 1 CommunicationRequest (2 recepients) and 2 Communication (each e-mail itself).</p>\n<p>Thanks =)</p>",
        "id": 191619718,
        "sender_full_name": "Luan Garrido",
        "timestamp": 1585061258
    },
    {
        "content": "<p>Typically in FHIR, when you want to send information, you just send information - no need to wrap it in Communication.  Communication is about maintaining a clinical record (as opposed to audit record) that data was shared.  However, if you're trying to represent an email exchange using FHIR, Communication is the appropriate mechanism.  In your scenario, there's no obvious need for CommunicationRequest.  The email could be represented with a single Communication as multiple recipients are allowed within a single Communication.</p>",
        "id": 191621207,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585061784
    }
]