[
    {
        "content": "<p>The Identifier Systems page lists 6-7 identifier systems and says that the HL7 FHIR registry may have more registered there.  I'm assuming that this is <a href=\"http://registry.fhir.org\">registry.fhir.org</a>, but I am unable to figure out how to search for registered identifier systems on that platform, if indeed there are any registered there.  I am currently trying to find out if there is an agreed upon system for Organization DUNS numbers (<a href=\"https://www.dnb.com/duns-number.html\">https://www.dnb.com/duns-number.html</a>) and NDC Labeler Code (<a href=\"https://www.fda.gov/industry/structured-product-labeling-resources/ndcnhric-labeler-codes\">https://www.fda.gov/industry/structured-product-labeling-resources/ndcnhric-labeler-codes</a>).  If there isn't an agreed system, is there an HL7 process for requesting one similar to HTA and terminology system ids?</p>",
        "id": 226845221,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1613668248
    },
    {
        "content": "<p>The registry for this stuff would be <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a>.  That's where the active management process is - and where you'd submit requests for new ones.  That then triggers the HTA process.</p>",
        "id": 226873057,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613679292
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>  old thread, but is there a proposal for a DUNS number system?</p>",
        "id": 271004096,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1644251254
    },
    {
        "content": "<p>i didn't make a proposal for these two.  We are using OIDs as the identifier systems for both DUNS and NDC Labeler Code.</p>",
        "id": 271004930,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1644251606
    },
    {
        "content": "<p>so for DUNS was it urn:oid:1.3.60?</p>",
        "id": 271009342,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1644253490
    },
    {
        "content": "<p>If you don't have a proposal and the identifier isn't in the UTG list, then you're not safe.  Also, it's a <em>really bad</em> idea to use OIDs in FHIR.  If you want an identifier system, please use submit a request to the HTA.  They can ensure that one is established that will be used across all FHIR standards and will meet our objectives of human-readability and, ideally, resolvability.</p>",
        "id": 271020940,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644258197
    }
]