[
    {
        "content": "<p>Hello FHIR community. <br>\nNew here, really appreciate the FHIR evolvong standard.<br>\nWe are trying to implement a Python/Django based FHIR server (and EMR), and currently are struggling through the FHIR docs. There are some problems we(I don't understand as FHIR in the first place seems to be very easy and straight forward, after a second glance really complex to get through. I often see things where I admire: \"whow, they even thought about <em>that</em> cornercase...\"</p>\n<p>But, there are downsides too: My most challenging question is: how is it supposed to implement Complex data types within the database? As example: the \"Quantity\" type has value as decimal field. But as has a \"implicit\" precision, I can't use that in a database as \"decimal\". How is tat supposed to be saved? As string?<br>\nDo you  recommend to hold a simple, straight forward data model in the DB, and just use FHIR as REST API, with an adapter upon it? Or do you recommend to save all the FHIR objects directly in the DB as they are?<br>\nFYI: we are using a relational DB model. With a NoSQL, this would be easy, just throw the JSON onto a MongoDB etc.<br>\nBut with *SQL - I am really confused how to implement resources  like \"Reference\"  and Complex Types.<br>\nAny help welcome, thanks.</p>",
        "id": 153952510,
        "sender_full_name": "Christian González",
        "timestamp": 1523883424
    },
    {
        "content": "<p>Depends on the purpose of database, there could be different solution. Most of Reference can be treated as foreign key. For example, my Condition table has a foreign key column to Patient table. Though Quantity has implicit precision during transfer, your should be able to decide the precision your database need. There is no conflict.</p>",
        "id": 153952534,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1523888894
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195669\">@Christian González</span> stian, have a look at the similar discussion at <a href=\"#narrow/stream/social/subject/Implement.20FHIR.20with.20existing.20database\" title=\"#narrow/stream/social/subject/Implement.20FHIR.20with.20existing.20database\">https://chat.fhir.org/#narrow/stream/social/subject/Implement.20FHIR.20with.20existing.20database</a></p>",
        "id": 153952545,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1523892635
    },
    {
        "content": "<p>Thanks. Yes, I thought I can't be the first one with this problems. I'll ask there more specific.<br>\nIf anyone is interested joining an Open Source EMR + FHIR server with Django/Python, feel free: <a href=\"https://gitlab.com/nerdocs/medux/MedUX\" target=\"_blank\" title=\"https://gitlab.com/nerdocs/medux/MedUX\">https://gitlab.com/nerdocs/medux/MedUX</a></p>",
        "id": 153952564,
        "sender_full_name": "Christian González",
        "timestamp": 1523904805
    }
]