[
    {
        "content": "<p>I'm curious what thoughts folks have on the use of Composition.confidentiality versus the confidentiality code described by security labels (<a href=\"http://build.fhir.org/security-labels.html\" target=\"_blank\" title=\"http://build.fhir.org/security-labels.html\">http://build.fhir.org/security-labels.html</a>) is there a particular reason why Composition has an explicit element for confidentiality? Is it better to use it than the security labels? Thanks</p>",
        "id": 156879620,
        "sender_full_name": "Craig Newman",
        "timestamp": 1548445941
    },
    {
        "content": "<p>I know Structured Documents has been asked to remove the Composition.confidentiality element on the grounds that it's unnecessary and redundant with the security label capability.  I don't know where that landed though.  <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ?</p>",
        "id": 156880080,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548446327
    },
    {
        "content": "<p>The Composition.meta element is the place for security tags about THE Composition. The Composition.confidentiality element holds the sum of all the security tags for all of the things that would be included in a document made from the Composition. My argument to remove it was that the sum total is just combining the total of the parts, but the group indicated that there may be a need to have an adjustment or manually set tag for the whole document that is not simply the combination of the parts. Thus the whole is greater than the sum of the parts... :-)</p>",
        "id": 156977485,
        "sender_full_name": "John Moehrke",
        "timestamp": 1548605826
    },
    {
        "content": "<p>Given that Composition is a DomainResource and can therefore have a meta node with a confidentiality code, what do you do with a Composition resource that contains both its own confidentiality code and a meta confidentiality code ?</p>\n<p>For bonus points, what do you do when the codes are conflicting ?</p>",
        "id": 171656936,
        "sender_full_name": "David Moorhouse",
        "timestamp": 1564019022
    },
    {
        "content": "<p>I see no one knows the answer to this question. <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> can you take this to SD?</p>",
        "id": 171764842,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564138889
    },
    {
        "content": "<p>There's also an ability to put a security tag on the overall document Bundle.</p>",
        "id": 171777697,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564151001
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span> I seem to remember that SDWG had a tracker about this. Was there a disposition?</p>",
        "id": 171786722,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1564157911
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> I believe you are referring to this: <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17301&amp;start=0\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17301&amp;start=0\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17301&amp;start=0</a></p>",
        "id": 171789745,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1564160330
    },
    {
        "content": "<p>We need to pick the discussion back up in SDWG.. we left off on it quite a while back saying we needed to reach out to the security WG to see what they thought. I didn't realize that <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> had commented on that ticket. I need to review his lengthy ;) comment and figure out where to go with it in SDWG.</p>",
        "id": 171789811,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1564160387
    },
    {
        "content": "<p>I'm going to put it on next week's agenda in SDWG, if anyone would like to attend</p>",
        "id": 171789923,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1564160445
    },
    {
        "content": "<p>Thanks for the follow up - look forward to the update from the SDWG</p>",
        "id": 172005013,
        "sender_full_name": "David Moorhouse",
        "timestamp": 1564462052
    },
    {
        "content": "<p>sorry for the delayed response. I have been away at the IHE face-to-face.  This all is related to a concept often referred to as \"high water mark\", in that any container needs to represent the \"high water mark\" of the things within the container. This is not always simple math, but is often influenced by policy.  Sometimes these policies do enable for down grading some tags because of the target of a communication, or authorization by the patient or sender.  I did see some movement on the comment I put into Bundle to express that the concept of \"high water mark\" should be added to Bundle. This would apply to query results, messages, documents, and any other use of Bundle to contain other resources. <br>\nSO, the answer to the original question is not a question for SD, but a question for Security workgroup.</p>",
        "id": 172061151,
        "sender_full_name": "John Moehrke",
        "timestamp": 1564509623
    },
    {
        "content": "<p>Deleted</p>",
        "id": 252393776,
        "sender_full_name": "David Moorhouse",
        "timestamp": 1631064382
    }
]