[
    {
        "content": "<p>Hello,<br>\nWe are currently using Composition to organize our Lab Compendiums. We wish to allow for a single Composition to be shared by multiple organizations. We were thinking of using the author field to do this, however, the description has us a little wary. Is there an existing standard for achieving this?</p>",
        "id": 173979871,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566575898
    },
    {
        "content": "<p>A single instance needs to live on a single server.  You could synchronize an instance across servers.  You could also allow authors from a variety of clients to edit an instance on a single server.  Do either of those address your need?</p>",
        "id": 173985230,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566580135
    },
    {
        "content": "<p>Sorry, I meant several organizations. I had a typo. All resources reside on the same server. We want to be able to assign compendiums to organizations.</p>",
        "id": 173986200,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566580824
    },
    {
        "content": "<p>What do you mean by \"assign\"?</p>",
        "id": 173986615,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566581168
    },
    {
        "content": "<p>We want to be able to list the profiles that a particular Organization is allowed to Order.</p>",
        "id": 173987129,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566581593
    },
    {
        "content": "<p>Compositions aren't really things you can order...</p>",
        "id": 173987777,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566582107
    },
    {
        "content": "<p>We use Compositions to organize what can be ordered through the list of Catalog Entries. It is only used to define what profiles are possible to be ordered under a particular compendium. In our case, we have a couple of compendiums and we want to be able to define on an Organization level  which compendium of Profiles can be used by that organization.</p>",
        "id": 173988099,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566582318
    },
    {
        "content": "<p>The \"who can order\" would typically be tied to the CatalogEntry, not the Composition.  A Composition is a convenient way of organizing/displaying the CatalogEntries, but information on the Catalog can't cascade into the CatalogEntries the Composition points to.</p>",
        "id": 173988258,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566582474
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/maB8RCmt4WMmDaZJoVjp-Vy2/6UZ22966\" target=\"_blank\" title=\"6UZ22966\">6UZ22966</a> </p>\n<p>We are using that structure to build our compendiums, now, we have some compendiums available only to some organizations.Some compendiums can even share profiles as Catalog Entries. We manage what an organization can order at the compendium level, so we have \"Compendium A\" for \"Organization P\" and \"Compendium B\" for \"Organization Q\" sharing some profiles, with some extra metadata.</p>",
        "id": 173988942,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566583043
    },
    {
        "content": "<p>You will need to propagate the \"who can order what\" to the CatalogEntry level.  You can certainly create Compositions that are organization-specific, but the Composition a CatalogEntry is attached to doesn't drive who can order it (and you can have CatalogEntries that drive ordering without having Compositions at all).</p>",
        "id": 173991162,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566584557
    },
    {
        "content": "<p>In FHIR, you can't ever presume that information tied to a linked resource propagates across the link.  Everything needs to be declared explicitly</p>",
        "id": 173991191,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566584592
    },
    {
        "content": "<p>How is that explicit link established in Catalog Entry?</p>",
        "id": 174170470,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566848251
    },
    {
        "content": "<p>Currently we are defining our Catalog Entry by referencing the Activity Definition. Our problem is that since we do that there does not seem to be a clear way of defining who can actually order the Catalog Entry.</p>",
        "id": 174176624,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566853403
    },
    {
        "content": "<p>That looks like an omission in CatalogEntry.  I'd suggest submitting a change request.  But it needs to be on the CatalogEntry.  Having it on Composition won't impact the interpretation of the entry.</p>",
        "id": 174196291,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566880870
    },
    {
        "content": "<p>We could add an \"orderableBy\" or \"target\" next to catalogEntry.orderable.</p>",
        "id": 174198489,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1566884713
    },
    {
        "content": "<p>it should be a category. I do not know if it is good practive to allow for an individual person or organisation. <span class=\"user-mention\" data-user-id=\"197394\">@Richard Bagley</span> what are your requirements on that? \"Who can order\" is a person, or a group?</p>",
        "id": 174198546,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1566884814
    },
    {
        "content": "<p>We would like to specify that by Organization as we group practitioners by that. So there is not an already defined method for doing this?</p>",
        "id": 174230110,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566913472
    },
    {
        "content": "<p>Thanks! I will do it.</p>",
        "id": 174236751,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566917672
    },
    {
        "content": "<p>Can you give an example of your organization?</p>",
        "id": 174243760,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1566921972
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> organization that can order would be on catalog entry level. But we can also have an organisation on catalog level, right?<br>\nMeaning : on catalog level = \"who can get this\"; on catalogentry = \"who can order this\".</p>",
        "id": 174244093,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1566922184
    },
    {
        "content": "<p>For example, we are a Laboratory and the Organizations we are allowing to create Service Requests are Healthcare providers. We need to limit the Catalog Entries to certain ones and we are thinking we should do that by the association of the Organization.</p>",
        "id": 174244235,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566922260
    },
    {
        "content": "<p>For Composition, you can indicate who the composition was written for - but that generally doesn't keep others from downloading and reading it.</p>",
        "id": 174244289,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566922298
    },
    {
        "content": "<p>The  documentation had a possible option for relating in the author property but that seemed wrong based on how the property suggests it should be used.</p>",
        "id": 174244582,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566922472
    },
    {
        "content": "<p>Also we din't want to have create a composition for each Organization.</p>",
        "id": 174245205,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566922866
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Should we move forward with the orderableby property?</p>",
        "id": 174255025,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566929835
    },
    {
        "content": "<p>Sounds like a reasonable thing to submit as a change request</p>",
        "id": 174256251,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566930677
    },
    {
        "content": "<p>How do I do that? Sorry, I am new to this.</p>",
        "id": 174256415,
        "sender_full_name": "Richard Bagley",
        "timestamp": 1566930792
    },
    {
        "content": "<p>No worries :)  At the bottom of every page in the spec is a \"propose a change\" link.  You need to register, but after we confirm you're a real human-being, you'll be able to submit changes at will.</p>",
        "id": 174258035,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566931874
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span>  <span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span>  Should we move forward with the orderableby property?</p>\n</blockquote>\n<p>Yes,  but not sure about the property name \"orderableBy\" implies that catalog is for ordering purposes, but it may be for non-orderable items. Is there a better, broader name? Target?</p>",
        "id": 174317597,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1566947077
    },
    {
        "content": "<p>I think the use-case here would be for orderable items.  I don't think specifying an organization would make a whole lot of sense for items that can't be ordered.</p>",
        "id": 174317958,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566947471
    }
]