[
    {
        "content": "<p>Hi,</p>\n<p>I currently have a FHIR messaging model based on the v1.4 specification. I would like to do an analysis of what it would take to upgrade to v3.0. I would like to determine the breakage points, vocabulary changes and determine if the newer version mitigates use of the profiles that were created when developing with v1.4. What would be a good starting point?</p>\n<p>Any advice is appreciated</p>",
        "id": 153891348,
        "sender_full_name": "Joel Francis",
        "timestamp": 1495806025
    },
    {
        "content": "<p>There's a tab in each resource showing differences between DSTU2 and STU3.  That's probably a reasonable place to start, though obviously there will be some differences that are already reflected in 2016May and there may have been some changes in 2016May that got reversed or further changed before STU3 was published.</p>",
        "id": 153891356,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495811512
    },
    {
        "content": "<p>If you want to drink from the firehose,<a href=\"http://hl7.org/fhir/stu3/history.html#3.0.1\" target=\"_blank\" title=\"http://hl7.org/fhir/stu3/history.html#3.0.1\">http://hl7.org/fhir/stu3/history.html#3.0.1</a> gives a high level view and <a href=\"http://hl7.org/fhir/stu3/diff.html\" target=\"_blank\" title=\"http://hl7.org/fhir/stu3/diff.html\">http://hl7.org/fhir/stu3/diff.html</a> is detailed to resource. As Lloyd said, it's hard to tell what was changed at that level from 2016May</p>",
        "id": 153891361,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1495814926
    },
    {
        "content": "<p>Thanks Lloyd and Jenni</p>",
        "id": 153891404,
        "sender_full_name": "Joel Francis",
        "timestamp": 1495828447
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> presented an analysis of terminology related and RESTful API changes between 1.4.0 and 3.0.1 at the Connectathon. Is the presentation something that can be shared?</p>",
        "id": 153891451,
        "sender_full_name": "David Cai",
        "timestamp": 1496013985
    },
    {
        "content": "<p>Sure, this was specific to NCTS which is focussed on the terminology resources but is still interesting. I'll just confirm that I'm OK to post it here.</p>",
        "id": 153891452,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1496014483
    }
]