[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span> in regard to <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15906\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15906\">GF#15906</a> - you know, from the compartment definition, that patient is a Patient, so the fact that target.patient and target.subject may target more than patients is ok - they ust  don't count. No?</p>",
        "id": 153969325,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528938264
    },
    {
        "content": "<p>No. Let's take the first link, target.patient:<br>\nThe link is from Provenance -&gt; target (Any resource) -&gt; patient.<br>\nSo this implies an extra search argument of /Provenance?target.patient=&lt;the patient in the compartment&gt;.<br>\nBut most of the allowed resourcetypes for Provenace.target do not have a patient search parameter. <br>\nI might be able to infer which of the resourcetypes would be in scope for this (probably the other types listed in the CompartmentDefinition linked through a patient parameter), but that leads to 2 problems:<br>\n1. You may run into \"Servers SHOULD reject a search where the logical id refers to more than one matching resource across different types.\" <a href=\"http://build.fhir.org/search.html#chaining\" target=\"_blank\" title=\"http://build.fhir.org/search.html#chaining\">Chained Parameters</a>. This happens to be ok on Vonk because we use GUIDs, but that is not always the case.<br>\n2. Different resourcetypes may have different searchparameters, incidentally with the same name:<br>\n- Observation.patient, where the searchparameter is clinical-patient;<br>\n- MedicationRequest.patient, where the searchparameter is medications-patient.<br>\nI'm not sure whether that is allowed. At least it is unclear.</p>\n<p>For target.subject the same problems arise.</p>",
        "id": 153969591,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1528974937
    },
    {
        "content": "<p>Is it reasonable to expect that Provenance exists within the patient compartment? Seems the usecases for Provenance start with the other object (source or target), and desire to learn more (aka Provenance).  Provenance must be useable when the other resource is not patient specific, or is patient specific but not directly (Binary). Thus should we not just remove Provenance from the patient compartment?</p>",
        "id": 153969957,
        "sender_full_name": "John Moehrke",
        "timestamp": 1529004219
    },
    {
        "content": "<p>Provenance can live in multiple compartments simultaneously.  It doesn't mean you can't search it outside of any compartment.  Lots of compartment-specific resources won't always live in all compartments they're associated with.  For example, an Observation made about a Location won't be in the Patient compartment, but the resource type is still associatable with that compartment.  All the compartment link does is allow you to search using that compartment if the necessary relationship exists.</p>",
        "id": 153969958,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529004650
    },
    {
        "content": "<p>Lloyd, I recognize that. I am just wondering what the use-case is for having Provenance be in the compartments? If declaring that Provenance is not in any compartment simplifies things, then why not do that? I am also fine with Provenance being in compartments. Are we doing similar gymnastics for AuditEvent? I see really good reason for AuditEvent to be declared as not to be included in compartments given the sensitive nature of ALL the auditEvents relative to those useful to a common user (signal to noise problem, as well as privacy/security issues).</p>",
        "id": 153969960,
        "sender_full_name": "John Moehrke",
        "timestamp": 1529004857
    },
    {
        "content": "<p>Provenance is intended to be user-facing and needs to be subject to the same compartment-specific access controls as clinical resources.</p>",
        "id": 153969965,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529006353
    },
    {
        "content": "<p>I think audit events are outside compartments because they're expected to be highly sensitive and highly restricted.  Though that doesn't mean we couldn't put them in the compartments too I guess</p>",
        "id": 153969966,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529006400
    },
    {
        "content": "<p>AuditEvent is in the patient compartment, as is Provenance. Mixing access control issues into the syntax consideration is weird, to me</p>",
        "id": 153969980,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529008315
    },
    {
        "content": "<p>back to <span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span>'s point: I think #1 is an issue. Doesn't arise for me because I resolve the index late.</p>",
        "id": 153969981,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529008475
    },
    {
        "content": "<p>I'll have to review the way this is generated into CompartmentDefinition</p>",
        "id": 153969982,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529008526
    },
    {
        "content": "<p>FHIR-I wants this conversation to continue: <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> <span class=\"user-mention\" data-user-id=\"191351\">@Chris Grenz</span></p>",
        "id": 153975560,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531771658
    },
    {
        "content": "<p>I've always thought there's some tension/inconsistencies in how compartments are described.  The combination of</p>\n<blockquote>\n<p>The following resources are never in this compartment:</p>\n</blockquote>\n<p>on the compartment definition page (e.g. <a href=\"http://hl7.org/fhir/compartmentdefinition-patient.html\" target=\"_blank\" title=\"http://hl7.org/fhir/compartmentdefinition-patient.html\">http://hl7.org/fhir/compartmentdefinition-patient.html</a>) with the verbiage in the last paragraph <a href=\"http://hl7.org/fhir/compartmentdefinition.html#use\" target=\"_blank\" title=\"http://hl7.org/fhir/compartmentdefinition.html#use\">here</a>, especially</p>\n<blockquote>\n<p>Servers will need to make arrangements to make these resources available to the clients that are limited to particular compartments.</p>\n</blockquote>\n<p>means that the definition of the compartment is admittedly (and intentionally?) inadequate.  I would expect the test of the breadth of a compartment to be the $everything call on that compartment:  <code>[base]/Patient/123/$everything</code> should logically return all the contents of the compartment.  And if it's part of $everything, it's \"in\" the compartment, no?</p>\n<p>While the meaning of \"in\" might be semantics, the technical definition leaves \"making arrangements\" an area of inconsistency.</p>",
        "id": 153975773,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1531836259
    },
    {
        "content": "<p>To this specific issue, I agree with <span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span> that the spec wording is a problem. Personally, I'd relax the chained search wording and put the error mode under the control of the prefer header directive.  A strict query would fail on this type of chaining, a lenient would simply ignore it when searching resources that don't have the parameter.</p>",
        "id": 153975774,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1531836520
    },
    {
        "content": "<p>server can decide to include things in $everything that are referenced from the compartment, but not part of it.</p>",
        "id": 153975853,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531862673
    },
    {
        "content": "<p>we discussed saying that the server had to return absolutely everything in the patient compartment as part of $everything, but backed away from that. but in principle, it should be</p>",
        "id": 153975854,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531862716
    },
    {
        "content": "<p>But I'm not sure how this makes them inconsistent</p>",
        "id": 153975855,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531862770
    },
    {
        "content": "<p>this is orthogonal to the question though</p>",
        "id": 153975856,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531862777
    },
    {
        "content": "<p>I'm not sure it's orthogonal as it goes to what's \"in\" the compartment, the technical definition of that set, and ultimately, the use case of a compartment.</p>",
        "id": 153976064,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1531923812
    }
]