[
    {
        "content": "<p>Hi all. Structured Documents is considering modifying the Composition resource such that Composition.section would become it's own datatype, much like the Dosage datatype. This would allow the creation of reusable section profiles that could be reused consistently across different document types. Before we decide to make that change though, we wanted to gather feedback from implementers to see if anyone could think of major issues with this approach. This should not be a breaking change for existing Composition instances, but definitely has implications for profiling tools. </p>",
        "id": 153888848,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1494394594
    },
    {
        "content": "<p>most of us who maintain profile tooling have already thought about this here, and are in favour of it. </p>",
        "id": 153888892,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494406453
    },
    {
        "content": "<p>Actually, I think an external datatype is easier to implement.</p>",
        "id": 153888927,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1494411055
    },
    {
        "content": "<p>Why make section a datatype, and not a resource like list? Are some of the Resource and DomainResource attributes a problem?</p>",
        "id": 153889175,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1494456710
    },
    {
        "content": "<p>Is it because a DataType can easily substitute for a BackboneElement, but a Resoure cannot?</p>",
        "id": 153889176,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1494456870
    },
    {
        "content": "<p>Resources have their own status, identity and can live and be maintained independently.  There's no ineritance between resources.  In practice, sections are generally authored in the context of a specific document and you need all of the context elements present on Composition for a section to make sense.</p>",
        "id": 153889180,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494480060
    },
    {
        "content": "<p>That doesn't mean we <em>couldn't</em> make Section a resource, but we'd need to think very carefully about the impact of making it \"stand-alone\" and whether that reflects how document-authoring systems actually behave.</p>",
        "id": 153889181,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494480115
    },
    {
        "content": "<p>that would create a lot of problems</p>",
        "id": 153889189,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494484952
    },
    {
        "content": "<p>Doesn't the problem lie with the use of backbone element itself?  Since the backbone isn't a datatype subject to profiling, we can't slice section.  </p>",
        "id": 153889277,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494502253
    },
    {
        "content": "<p>well, one solution is to allow profiling to start inside a resource, not only at the root. That's complexity I didn't want to have, and this avoids that</p>",
        "id": 153889281,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494503473
    },
    {
        "content": "<p>One man's complexity is another man's parsimonious reuse. </p>",
        "id": 153889282,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494503539
    },
    {
        "content": "<p>The lack of typing associated with backbone elements actually causes some problems in the solution I showed you yesterday. </p>",
        "id": 153889283,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494503594
    },
    {
        "content": "<p>well, tell me more about that</p>",
        "id": 153889284,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494503616
    },
    {
        "content": "<p>It gets very technical, and <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> would be better able to explain the details. </p>",
        "id": 153889286,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1494503687
    },
    {
        "content": "<p>ok</p>",
        "id": 153889287,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494503697
    }
]