[
    {
        "content": "<p>I am working with an ECG device that can simultaneously generate a PDF file, a proprietary raw data file, and an AI-based interpretation. In addition to having the proprietary raw data file I also want to convert the raw data to something non-proprietary, but keep the original raw data. Is there any guidance on how to best use the facilities of FHIR to express such a data structure? Should I create a Bundle containing 1. DocumentReference with attachment for the PDF, 2. a Binary for the proprietary raw data, and then 3. also incl. an Observation with the FHIR-based sample data and an interpretation? It seems SNOMED-CT has appropriate codes for the things that the AI could detect.</p>",
        "id": 277413101,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1648817880
    },
    {
        "content": "<p>Perhaps a DiagnosticReport instead of an Observation(??), but IMHO a DocRef with these three expressions of one and the same document would work. Only hesitation is the AI generated data, is this also contained in the PDF ? If the PDF doesn't contain it, could it then be said that the third expression is the same (in terms of information content) as the other two expressions ? (that's  a judgement call)</p>",
        "id": 277414015,
        "sender_full_name": "René Spronk",
        "timestamp": 1648818226
    },
    {
        "content": "<p>The other option is that you have a separate instance for the interpretation with 'derivedFrom' links back to the source.</p>",
        "id": 277423795,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648822217
    },
    {
        "content": "<p>thanks for the ideas! I was starting out my thought process with the Observation, because the FHIR ECG example is based on Observation. Both the PDF and the proprietary raw data contain the AI result, so I think they are equivalent in content. I had not looked at DiagnosticReport before, that seems to be a good way to combine a few binary media objects and a \"conclusionCode\". I'm admittedly a bit hesitant with the FHIR ECG example, as numerous other formats seem to have a head-start when it comes to ECG storage (DICOM ECG, aECG, ISHNE, etc.).</p>",
        "id": 277862705,
        "sender_full_name": "Tilo Christ",
        "timestamp": 1649158367
    },
    {
        "content": "<p>If I remember right, the HL7v2 has a Waveform datatype for representing ECG (and other) waveform data; that has been standardized.  I wonder if the folks on the <a class=\"stream\" data-stream-id=\"179188\" href=\"/#narrow/stream/179188-v2-to-FHIR\">#v2 to FHIR</a> stream would have insights on how to map that to FHIR?<br>\nThe IHE also has a PCD profile for defining waveform content:  <a href=\"https://wiki.ihe.net/index.php/PCD_Profile_Waveform_Content_Module_(WCM)\">https://wiki.ihe.net/index.php/PCD_Profile_Waveform_Content_Module_(WCM)</a><br>\n(also seem to remember reading somewhere that IHE is moving towards defining their profiles in FHIR; not sure of the timeline for that though.  Maybe someone here knows about that.)</p>",
        "id": 277889807,
        "sender_full_name": "John Silva",
        "timestamp": 1649170064
    }
]