[
    {
        "content": "<p>The composition resource identifier has a cardinality of (0..1). My project has a need for multiple identifiers for the same instance of composition as there are multiple stakeholders for the composition and each stakeholder assigns it their own identifier in addition to the identifier assigned by the original author. Has anyone else had the need to have more than one instance of composition.identifier? If so, how did you get around the (0..1) cardinality constraint?</p>",
        "id": 154019381,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1542480821
    },
    {
        "content": "<p>Maybe DocumentReference, thought that only mentions documents and not compositions.</p>",
        "id": 154019488,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1542584809
    },
    {
        "content": "<p>Don't know what is your workflow. Is this resource passed to different stakeholder at different stage? Sounds like you can use AuditEvent.</p>",
        "id": 154019499,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1542593374
    },
    {
        "content": "<p>The composition is passed from one stakeholder to another. The recieving stakeholder then assigned its own identifier to the composition.</p>",
        "id": 154019501,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1542593662
    },
    {
        "content": "<p>Do you need to know who assigned an identifier?</p>",
        "id": 154019503,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1542593833
    },
    {
        "content": "<p>What kind of document is it?</p>",
        "id": 154019507,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542595001
    },
    {
        "content": "<p>Yes, I do need to know who assigned the identifier. But I can get that from Identifier.assigner</p>",
        "id": 154019524,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1542608703
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> It is the Death Certificate. It is assigned an identifier by the author (medical examiner or coroner) and when received by the Public Health Agency it is assigned an additional identifier.</p>",
        "id": 154019525,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1542608842
    },
    {
        "content": "<p>if a recipient is assigning an identifier, this would be a typical use of DocuementReference. They would own the DocumentReference, so they can put whatever .identifier on it they want. The one true identifier, Composition.identifier, would be stored in DocumentReference.masterIdentifier... as it is the master identifier of the Binary... the Composition...</p>",
        "id": 154019564,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542636715
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> . That is the solution I went with. I did not think of repeating the Composition.identifier as the DocumentReference.masterIdentifier, but it sound like a good idea. Thanks. <a href=\"/user_uploads/10155/BdMnoMq_RyAWpTutiI6N2yRz/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/BdMnoMq_RyAWpTutiI6N2yRz/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/BdMnoMq_RyAWpTutiI6N2yRz/pasted_image.png\"></a></div>",
        "id": 154019586,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1542641239
    },
    {
        "content": "<p>yes, see the mapping between Composition and DocumentReference -- <a href=\"http://build.fhir.org/documentreference-mappings.html#fhircomposition\" target=\"_blank\" title=\"http://build.fhir.org/documentreference-mappings.html#fhircomposition\">http://build.fhir.org/documentreference-mappings.html#fhircomposition</a></p>",
        "id": 154019592,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542642256
    },
    {
        "content": "<p>Having both Composition and DocumentReference need to be shared to tell the full story is odd.  DocumentReference is supposed to be an index of the information in the document.  It actually doesn't make sense for the \"index\" resource to allow more identifiers than the base resource.  Do we have any idea why this is the case?</p>",
        "id": 154019705,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542675827
    },
    {
        "content": "<p>The Identifier in a DocumentReference is the identifier of the DocumentReference... NOT of the document. The identifier of the document is the DocumentReference.masterIdentifier.</p>",
        "id": 154019787,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542721545
    },
    {
        "content": "<p>That also seems weird to me.  In what situations do you assign \"extra\" identifiers to an index entry that aren't considered to be identifiers of the target of the index entry?</p>",
        "id": 154019821,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542729232
    },
    {
        "content": "<p>Well specifically, XDS separates the two, recognizing that the metadata can be updated and tracked separately from the document itself. You can also index the same content in more than one context--once for the mother, once for the child; once when supplied by one system, once when supplied by another; etc. (I'm not suggesting that the latter is a good pattern, but one that is supported.)</p>",
        "id": 154019838,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1542734708
    },
    {
        "content": "<p>So if you have a document whose subject is the mother, you could have an index indicating that the subject of the document is the child?  And add extra identifiers?</p>",
        "id": 154019850,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542738411
    },
    {
        "content": "<p>A perinatal document would be relevant to the health of both the mother and baby, and should be added to the record of both. However the indexing information -- such as subject -- might be different.</p>",
        "id": 154019851,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1542739006
    },
    {
        "content": "<blockquote>\n<p>The Identifier in a DocumentReference is the identifier of the DocumentReference... NOT of the document.</p>\n</blockquote>\n<p>DocumentReference.identifier is 0..* and there is no business identifier for the DocumentReference. </p>\n<p>The definition of <a href=\"http://build.fhir.org/documentreference.html\" target=\"_blank\" title=\"http://build.fhir.org/documentreference.html\">DocumentReference</a>.identifier is \"Other identifiers associated with the document, including version independent identifiers.\", and the short is \"Other identifiers for the document\".<br>\nThat text conflicts with <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> 's explanation.</p>",
        "id": 154019973,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1542779199
    },
    {
        "content": "<p>I don't know that it conflicts, as an identifier of the metadata is indirectly an identifier of the thing the metadata describes. The use of .identifier is available in this way, it does not need to be used this way. The zulip chat stream started with a specific usecase, that is the use-case I was responding to. -- I would be happy for you to submit a change request with recommendations.<br>\nIn xds the equivalent (and mapped)  .identifier is just a technical identifier (That is the XDS entryUUID, a guid that is assigned by the registry). Much like the _id is in FHIR.</p>",
        "id": 154020176,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542808458
    },
    {
        "content": "<p>thus .identifier is much like all FHIR Resources with regards to the equivalent business identifier, at 0..*. This pattern is demanded by the FHIR core modeling. So, I just offered a method to address the use-case that started this stream.</p>",
        "id": 154020177,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542808738
    },
    {
        "content": "<p>As Elliot points out, it is not uncommon for a unique document to be registered in various ways. Mostly because it is registered by multiple parties as a document they have in their possession (presuably the non-author does indicate the proper author). The mother/child is unique, and has other characteristics to differentiate and align.  There is also the case of documents that are not single-patient based. A document from the scene of an accident, etc. There are many reasons why a document might need to be registered multiple times. The model enables these, it does not demand that you must support or ever use it that way.</p>",
        "id": 154020178,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542808992
    }
]