[
    {
        "content": "<p>We noticed in the transition from STU3 to R4, the Composition.class changed to Composition.category, while the description remained the same. However, the example binding changed from <a href=\"https://www.hl7.org/fhir/valueset-doc-classcodes.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-doc-classcodes.html\">https://www.hl7.org/fhir/valueset-doc-classcodes.html</a> (LOINC parts) to <a href=\"https://build.fhir.org/valueset-document-classcodes.html\" target=\"_blank\" title=\"https://build.fhir.org/valueset-document-classcodes.html\">https://build.fhir.org/valueset-document-classcodes.html</a> (LOINC categories). Was this change intended, and if so, does that break any mappings from CDA? We felt the example mapping to LOINC parts made a lot more sense, so the new change was confusing to us. Looking to this group for guidance, thank you!</p>",
        "id": 154027065,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1545674399
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ?</p>",
        "id": 154027068,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1545681037
    },
    {
        "content": "<p>I think that change was done when aligning the .category elements of both Composition and DocumentReference. I don't see in those change requests a position on the valuesets, other than my observation that the valusets given should only be Example. As Example binding they are only there to give an impression of how to use the element. So there should be no problem with mapping from any vocabulary. <br>\nThe valueset given is one created many years ago in the USA by the HITSP government sponsored group. That group is defunct, so it is not a managed valueset.  Strange but this history seems to have been removed in R4, while the linage (OID) is still intact...</p>",
        "id": 154027085,
        "sender_full_name": "John Moehrke",
        "timestamp": 1545752041
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> ?</p>",
        "id": 154027086,
        "sender_full_name": "John Moehrke",
        "timestamp": 1545752061
    },
    {
        "content": "<p>interesting, the LOINC parts do look decent -- I don't remember a discussion to make the value set binding. A discussion on SDWG would be good</p>",
        "id": 154027171,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1545964249
    },
    {
        "content": "<p>While evaluating this with our terminologist, we felt that LOINC Document Ontologies map very well the Composition.category and DocumentReference.category, allowing documents to be assigned up to 5 LOINC Document Ontology attributes (Subject Matter Domain, Role, Setting, Type of Service, Kind of Document) to assist in searching/indexing and categorizing. The R3 valueset-document-classcode were LOINC part codes taken from the Kind of Document attribute -- we feel that LOINC part codes from some of the other attributes should also be added, so that even as an example, readers can see the different types of categorization available.<br>\nShould we join an upcoming SDWG call, and should open a gforge tracker ticket for this suggested change? <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span></p>",
        "id": 154201317,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1546463236
    },
    {
        "content": "<p>A tracker would be great, will you be at the working group meeting in san antonio?</p>",
        "id": 154419132,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1546619133
    },
    {
        "content": "<p>Tracker 19873 created. <br>\nUnfortunately, eHealth Ontario will not be able to attend the San Antonio WGM.</p>",
        "id": 154439989,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1546638687
    }
]