[
    {
        "content": "<p>When using Forge to profile COMPOSITION we are slicing the \"section\" so as to profile the primary sections in the COMPOSITION. We do however have requirements to also have some SubSections. When you Slice a child section it does not reveal all of the properties for the section.</p>\n<p>Does anyone else create profiles with \"subSection\" requirements in COMPOSITION and if so how do they do it? <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> </p>\n<p><a href=\"/user_uploads/10155/Skx_0P8SVcImLSEzKr4kKX8W/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Skx_0P8SVcImLSEzKr4kKX8W/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/Skx_0P8SVcImLSEzKr4kKX8W/pasted_image.png\"></a></div>",
        "id": 153869785,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1486039753
    },
    {
        "content": "<p>Hi, thanks for reporting this. We would love to have Forge handle recursive delarations the way you indicate. The new snapshot generator is capable of handling it, it's just the Forge UI that doesn't reflect that yet. It is on our roadmap to be implemented.</p>",
        "id": 153869788,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1486040230
    },
    {
        "content": "<p>I'm afraid for now you'll have to do this by hand. You can make some changes to the top-level section, save the XML and then change the XML paths to Composition.section.section. If that is done correctly and you reload the XML in Forge, Forge will then be able to show you the sub-elements of the sub-section.</p>",
        "id": 153869789,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1486040424
    },
    {
        "content": "<p>Would we change that in the \"Differential\" or \"Snapshot\"?</p>",
        "id": 153869792,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1486044229
    },
    {
        "content": "<p>I've tried it in the differential, because that's easier to read. It's a bit of a hassle, but it worked.</p>",
        "id": 153869887,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1486116343
    }
]