[
    {
        "content": "<p>Hi, can I get some advise from poeple who use concept map actively for their codeSystems. How you store and how you retrieve. To give you an example if you have your own codeSystem (codesystem1) and your consumer for the same concept uses a different codesystem (codeSystem2) and then you create a conceptMap to support the mapping from CodeSystem1&lt;=&gt;CodeSystem2, then when the same consumer is uses its own CodeSystem2 when POSTing a new resource (doesnt matter what resource), then you would potentially invoke the conceptMap to map the code to your codesystem and potentially to store it in your DBs with your codesystem. When the same consumer is calling for the same resource, would you use the same conceptmap to retrieve it to the same original format as it was published or you send the resource with the codesystem1 value as how you stored it??!!</p>",
        "id": 205977527,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1596587893
    },
    {
        "content": "<p>You should, ideally, always store the received code in addition to any translation you've added - because otherwise you're likely to lose information (translations are rarely exact).  However, there's no <em>requirement</em> to do so.  However, if you echo back a copy of the record on a successful add/update, you should indicate what you've actually stored - including any translations you've added, any data you've changed and any data you've removed</p>",
        "id": 205977897,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596588462
    },
    {
        "content": "<p>Thanks, so in my example; resourceA is posted with codesystem1 =&gt; ResoruceA with both codesystem is stored =&gt; GET resourceA will result in sending the resource with both codesystem? and thats achievable in FHIR as long the datatype is codeableconcept and if coding is not profiles for be 0..1 .. right?</p>",
        "id": 205979515,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1596590728
    },
    {
        "content": "<p>Right.  (And profiling CodeableConcept.coding to be 0..1 would be a pretty poor practice.)</p>",
        "id": 205980248,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596591900
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> #</p>",
        "id": 205980274,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1596591948
    }
]