[
    {
        "content": "<p>Does anyone know about or have ConceptMaps tooling? I was thinking about something which can pull in some source and target file, allows one to search those and (visually) create mappings, and produces a ConceptMap. Preferably open source (or at least no USD 10.000+ proprietary solution). It's in scope of this: <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Tooling_Eco-system\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Tooling_Eco-system\">http://wiki.hl7.org/index.php?title=FHIR_Tooling_Eco-system</a>, but not clear if any of the mentioned projects already have it.</p>",
        "id": 153856330,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1478786458
    },
    {
        "content": "<p>Snapper has such tooling. In principle, it is available, but we haven't got our duycks in a row yet</p>",
        "id": 153856366,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478804658
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192440\">@Marc de Graauw</span>  Hope aidbox will be able provide such service  in near future (couple of months). Now we've aggregated some popular terminologies, most of them has a lot of mappings (we are working on translate them to FHIR), next step - custom code systems, value sets &amp; mappings. </p>",
        "id": 153856414,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1478813396
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> @<strong>nicola</strong> Both interesting. Is it possible to get a sneak preview at DevDays?</p>",
        "id": 153856499,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1478853274
    },
    {
        "content": "<p>Yes, definitely </p>",
        "id": 153856502,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1478856702
    },
    {
        "content": "<p>I'll see what I can doo</p>",
        "id": 153856504,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478858021
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Happy for you to demo Snapper at DevDays</p>",
        "id": 153857614,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1479433680
    },
    {
        "content": "<p>It should be borne in mind that Snapper's prime goal is not to be a general purpose or complete editing tool.  It's instead intended to cover the simple case (where people may not even care/know about FHIR) and base cases of FHIR CodeSystem, ValueSet, and ConceptMap authoring.  It's also very much a work-in-progress</p>",
        "id": 153857615,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1479433875
    },
    {
        "content": "<p>Someone told me here at DevDays that they couldn't use it because they're not Australian?</p>",
        "id": 153857644,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479449983
    },
    {
        "content": "<p>The version hosted by ADHA is only licensed for use in Australia (you don't have to be a citizen :)<br>\nWe are temporarily hosting a public instance that is a work-in-progress, unsupported, will go away, other disclaimers, etc for demonstration purposes.<br>\nWe're happy to discuss licensing with anyone</p>",
        "id": 153857645,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1479450324
    },
    {
        "content": "<p>where's the public instance?</p>",
        "id": 153857646,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479450531
    },
    {
        "content": "<p><a href=\"http://ontoserver.csiro.au/snapper2-dev/#/\" target=\"_blank\" title=\"http://ontoserver.csiro.au/snapper2-dev/#/\">http://ontoserver.csiro.au/snapper2-dev/#/</a></p>",
        "id": 153885747,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1493045684
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> what's the latest on Snapper and STU3?</p>",
        "id": 153885748,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1493045700
    },
    {
        "content": "<p>Snapper is currently \"mostly STU3\" compatible, but there's a few things that need tidying up and that's part of our agenda for the next couple of sprints.  If there are any specific things that you're running in to, please let us know.</p>",
        "id": 153888565,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1494294340
    },
    {
        "content": "<p>Is there a good way to distribute conceptmaps with V2 or FHIR so that they can manage the substitution of terminologies between something like inbound V2 and outbound FHIR on the fly? </p>\n<p>We've been managing these mappings and transforms in house for the last few years and we'd like to open-source the work that we've done. While ConceptMaps seem like the right way to structure the build, I'm not sure the \"FHIR endorsed\" way to bundle those in with our transforms so that we can provide the community a relatively turnkey way to convert v2 to FHIR. </p>\n<p>Curious to see what other folks are doing. We're willing to spearhead something like this, but interested to see what other approaches are.</p>",
        "id": 153889977,
        "sender_full_name": "Mark Olschesky",
        "timestamp": 1494880068
    },
    {
        "content": "<p>bundling with what?</p>",
        "id": 153890159,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495000670
    }
]