[
    {
        "content": "<p>I fully realize this topic has been discussed many times before so don't necessarily want to rehash this but is there any way to truly represent an Organization Role in R4? I know that OrganizationRole was being proposed for R4 that very much resembled PractitionerRole but without the practitioner aspect. At some point in time OrganizationRole morphed into OrganizationAffiliation and officially became part of R4. The definition of OrganizationAffiliation clearly states that it defines some sort of affiliation/association/relationship between 2 distinct organizations so this does not seem to fit the mold of a single organization role like practitioner role does for a single practitioner. Our current use case which revolves around capturing an entire online public-facing provider directory for a health plan/payer requires us to capture medical vendor roles as well as individual practitioner roles. Some business rules require us to roll up associated practitioner roles to a vendor level and in that instance we would only display a vendor role and not the individual practitioners that should not display in a public-facing provider directory. Thus we need the ability to represent and capture roles at an organization level. We are currently leveraging HealthcareService to represent a vendor role as that seems the best fit but ideally would like to use something akin to PractitionerRole with same attributes minus practitioner aspects. Will there ever be any consideration again to truly create an OrganizationRole? Thanks.</p>",
        "id": 177724526,
        "sender_full_name": "Wayne Williams",
        "timestamp": 1570634603
    },
    {
        "content": "<p>It's possible to have PractitionerRole that doesn't point to Practitioner.  I.e. you can have an instance that represents \"Cardiologist at Good Health Hospital\" and not specify the individual.  However, implicitly you're still talking about an individual acting on behalf of the organization, not the organization acting in a capacity.</p>",
        "id": 177727072,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570635943
    },
    {
        "content": "<p>Thanks Lloyd. We considered that but felt that it would be too confusing to use PractitionerRole in that way as you noted that implicitly it still refers to an individual.</p>",
        "id": 177731631,
        "sender_full_name": "Wayne Williams",
        "timestamp": 1570638884
    },
    {
        "content": "<p>It refers to \"some individual\" - there could well be multiple individuals who would fit the role.</p>",
        "id": 177748051,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570649725
    },
    {
        "content": "<p>Got it, this makes a lot of sense and provides clarity. Looking back our vendor role use case should be leveraging a PractitionerRole where it implicitly refers to some individual(s) whom fit the role but are not explicitly referenced. We are not necessarily capturing an Organization Role where the org is acting in full capacity in that role but rather a group of \"hidden\" practitioners acting in the same role at that vendor and location and needs to be on our online provider directory. Thanks.</p>",
        "id": 177752224,
        "sender_full_name": "Wayne Williams",
        "timestamp": 1570652393
    },
    {
        "content": "<p>Org Role was renamed to orgAffiliation. So yes, please use that.<br>\nThe role is the relationship, something that one org does/provides for another.<br>\nOr do the anonymous prac role, but I think you're probably describing org roles.</p>",
        "id": 177761445,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1570659755
    },
    {
        "content": "<p>Thanks Brian- our use case actually falls more inline with the anonymous prac role rather than org role. We are trying to convey a role/location/specialty/services to a member from a single org rather than on behalf or to another org. In other words there is no other organization to reference here. We currently do not have any business use cases where an org provides services to another org but if/when we do we'll be sure to leverage OranizationAffiliation to capture that.</p>",
        "id": 177803169,
        "sender_full_name": "Wayne Williams",
        "timestamp": 1570709788
    },
    {
        "content": "<p>Could you please differentiate that from the HealthcareService then?<br>\nGot some example instances to share?</p>",
        "id": 177860769,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1570747384
    }
]