[
    {
        "content": "<p>When referring to a concept as an MPUU/MPP etc, do you use 'concept type' or something else? I have been using concept type for years. I note the nehta guide mentions 'product class' however if dealing with something like an MPP, it's a Pack, and FHIR models Product and Package differently, so I don't want to confuse the two notions. WDYT?</p>",
        "id": 153874347,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488425772
    },
    {
        "content": "<p>This is about putting codes in the Medication resource?</p>",
        "id": 153874348,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488425822
    },
    {
        "content": "<p>We are looking for a suitable extension name in medication to signal, MP, MPUU, MPP, TPUU etc</p>",
        "id": 153874349,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488425870
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> what did you do nbout this?</p>",
        "id": 153874350,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488425908
    },
    {
        "content": "<p>if one exists already then i will definitley use that.</p>",
        "id": 153874351,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488425931
    },
    {
        "content": "<p>FWIW, I've implemented NZMT (which has the same '7 boxes' structure as AMT) as a Code System so it's possible to get that information, and other properties, by doing a lookup operation on the code itself.</p>",
        "id": 153874356,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1488430443
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> can you post an example?</p>",
        "id": 153874357,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488430497
    },
    {
        "content": "<p><code>http://its.patientsfirst.org.nz/RestService.svc/Terminz/CodeSystem/$lookup?system=http://nzmt.org.nz&amp;code=10348841000116107&amp;property=substance</code>  <br>\nStill WIP and I need to refine property names and return values when I next visit the NZMT/NZULM Team.</p>",
        "id": 153874358,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1488430951
    },
    {
        "content": "<p>So I'm not sure I entirely understand the question...what is the context for referring to the MPUU/MPP?</p>\n<p>BTW...I'm not sure how relevant this is but...</p>\n<p>I have done work creating a FHIR Medication resource rendering of AMT concepts. Some of these are Product (MP, MPUU, TPUU) and some are Package (MPP, TPP, CTPP)  Medication resources. I'll post an example if anyone is interested, the idea was that we could expose AMT/PBS/TGA data all merged into a set of Medication resources which are searchable and easier to dig out the attributes (easier than RF2) of each concept such as ingredients and strengths. As part of doing this I was asked to create links between the resources so that if you had a CTPP Medication resource you could find its TPP medication resource for example.</p>",
        "id": 153874367,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488437128
    },
    {
        "content": "<p>Here's an example of Panadeine Caplet (CTPP)</p>\n<p><a href=\"/user_uploads/10155/dJNuWUOAsKZvzpnt8cZM56Ws/Panadeine-Caplet-tablet-film-coated-12-blister-pack_61176011000036107\" target=\"_blank\" title=\"Panadeine-Caplet-tablet-film-coated-12-blister-pack_61176011000036107\">Panadeine-Caplet-tablet-film-coated-12-blister-pack_61176011000036107</a></p>",
        "id": 153874369,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488437533
    },
    {
        "content": "<p>This is corresponding TPUU...ignore the leading extension part which is experimenting with providing those links within the AMT \"7 boxes\". The extension that is interesting is the BoSS, which I've created a tracker item about. This is all a bit of a thought experiment at present.</p>\n<p><a href=\"/user_uploads/10155/qM_qL8xP3BxoUSz-tZt1c5m_/Panadeine-Caplet-tablet-film-coated_54205011000036101\" target=\"_blank\" title=\"Panadeine-Caplet-tablet-film-coated_54205011000036101\">Panadeine-Caplet-tablet-film-coated_54205011000036101</a> </p>",
        "id": 153874370,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488437725
    },
    {
        "content": "<p>That's a really interesting approach, which was mooted during last year's Snappathon at the SCT Expo in Wellington. At the persistence layer, there's not doubt that shoehorning AMT/NZMT into the RF2 format is problematic, so I'll continue to place NZMT in a relational schema. At the HIE layer, it's a question of whether it's easier to obtain the attributes and relationships from a Medication Resource or by querying the properties of a Code System. I suspect the former might be more efficient if you don't have to do anything too nasty to create those links.</p>",
        "id": 153874377,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1488443633
    },
    {
        "content": "<p>the serious terminologies - loinc, sct, rxnorm, amt etc - are all a combination of  an information model, a dictionary, a grammar, and a set of terminologies</p>",
        "id": 153874381,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488446228
    },
    {
        "content": "<p>they should expect to manifest in FHIR in multiple different ways </p>",
        "id": 153874382,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488446249
    },
    {
        "content": "<p>IDMP defines a model with Pharmaceutical Product, Medicinal Product, and Packaged Product.</p>",
        "id": 153874383,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488446410
    },
    {
        "content": "<p>We know that there are many notions, and we just finished a project to analyze how these global concepts can align with the existing codes.</p>",
        "id": 153874384,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488446512
    },
    {
        "content": "<p>for FHIR this comes down to 2 things IMO:<br>\n1. Align the Medication definitional resource with IDMP and supporting other product concepts<br>\n2. in the Catalog discussions, implement the relations between the several concepts. i.e. allow explaining that this package is related to this product</p>",
        "id": 153874386,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488446794
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> \"what is the context for referring to the MPUU/MPP?\" We have a Medication that contains the data and we need to include the 'concept type', ie MPP, MPUU etc, so that our systems know how to handle them and trying to settle on a name for the extension.</p>",
        "id": 153874526,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488497265
    },
    {
        "content": "<p>I think that both Dion and Peter have argued that you don't need to include the concept type since it's inherent in the definition of the code</p>",
        "id": 153874528,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488497653
    },
    {
        "content": "<p>I don't follow. There is not enough data in Medication to differentiate the types.</p>",
        "id": 153874530,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488497850
    },
    {
        "content": "<p>Especially if some terminologies are missing data (they are). I mean, you could check for a combination of data (isBrand, product.form) etc to infer this, but if any of that data is missing then you can't tell between MP and MPUU for example.</p>",
        "id": 153874531,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488497939
    },
    {
        "content": "<p>Our systems behave differently based on the concept type so it would be far simpler to add this since we already have it, rather than rely on inference based on other fields that may or may not be populated.</p>",
        "id": 153874533,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488498024
    },
    {
        "content": "<p>the AMT code itself tells you whether it's a MP MPUU etc. But I think that's not the answer you want?</p>",
        "id": 153874536,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488499549
    },
    {
        "content": "<p>So <span class=\"user-mention\" data-user-id=\"191477\">@Steve Swinsburg</span> I guess you're saying that you have a Medication resource that has an AMT code, and the Medication resource may or may not be populated with the defining attributes of the AMT code like the examples I provided. So if you can't rely on the Medication resource's data to determine the type of the AMT code because it may not be populated sufficiently to tell. Did I get that right?</p>\n<p>In that case I think you've only got two options. You can do as you are suggesting and expect a baked in tag (extension) in the resource that tells you which one of the 7 boxes it is. But doesn't that only work when you are receiving Medication resources that someone has put that tag in? What do you do if you get a Medication resource that doesn't have your extension?</p>\n<p>The alternative is to ask a terminology server. You can determine if a concept is an MP by doing a validate code operation on the MP implicit value set. For example<br>\n<a href=\"http://ontoserver.csiro.au/stu3/ValueSet/%24validate-code?system=http://snomed.info/sct&amp;code=21433011000036107&amp;identifier=http%3A%2F%2Fsnomed.info%2Fsct%2F32506021000036107%3Ffhir_vs%3Drefset%2F929360061000036106\" target=\"_blank\" title=\"http://ontoserver.csiro.au/stu3/ValueSet/%24validate-code?system=http://snomed.info/sct&amp;code=21433011000036107&amp;identifier=http%3A%2F%2Fsnomed.info%2Fsct%2F32506021000036107%3Ffhir_vs%3Drefset%2F929360061000036106\">http://ontoserver.csiro.au/stu3/ValueSet/%24validate-code?system=http://snomed.info/sct&amp;code=21433011000036107&amp;identifier=http%3A%2F%2Fsnomed.info%2Fsct%2F32506021000036107%3Ffhir_vs%3Drefset%2F929360061000036106</a></p>\n<p>You could issue a batch that did a validate code on each of the 7 box implicit value sets and then inspect which one returned true.</p>\n<p>That's what you'd have to do if you received an AMT coded Medication resource that didn't have any indicators/extensions on it which you'd probably have to account for? If you have to write that logic as a fall back for that case, then why not dispense with the indicator extension and simply use the terminology server all the time?</p>",
        "id": 153874539,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488501971
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>, what/where are the Catalog discussions? What is being proposed?</p>\n<p>I think there are still issues with Medication package/product. I've tried to explain them in <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12396&amp;start=0\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12396&amp;start=0\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12396&amp;start=0</a> but essentially the Medication resource has a bit of a split personality with respect to product/package.</p>\n<p>Because a Medication can still have ingredients, strengths etc AND a package element which references a code or Medication there's room for inconsistency. What does it mean if I populate a Medication resource's ingredient and strengths and also populate the package element and reference a Medication with another set of ingredients?</p>\n<p>I think the definition of Medication needs to be tightened so it can represent a thing with ingredients and strengths OR a package of things that in turn have ingredients. But as currently defined it is possible to create a Medication resource that attempts to be both at the same time.</p>",
        "id": 153874542,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488502693
    },
    {
        "content": "<p>So the use case here is showing a list of medications that match a number of types (ie give me all of the MPP, MPUU, TPP and TPUU). Suppose that returns 100. I wouldnt want to individually lookup each code to get the type - I already know it as it is in our Global Drug Model and came from the terminolgoy itself.</p>",
        "id": 153874543,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488502708
    },
    {
        "content": "<p>I am not too concerned with write operations at the moment</p>",
        "id": 153874544,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488502717
    },
    {
        "content": "<p>What I am really after is concesus on the naming of that extension. I might be able to skip it altogether but I'd prefer to add it in since we know the data.</p>",
        "id": 153874545,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488502831
    },
    {
        "content": "<p>so, the way this is intended to work is </p>",
        "id": 153874547,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488505861
    },
    {
        "content": "<p>1. you define the value set of AMT codes you are interested in. </p>",
        "id": 153874548,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488505871
    },
    {
        "content": "<p>in your case, import from snomed-ct all codes that is-a with [MPP], [MPUU], [TPP], [TPUU]</p>",
        "id": 153874549,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488505904
    },
    {
        "content": "<p>then, search for all medications in the value set </p>",
        "id": 153874550,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488505916
    },
    {
        "content": "<div class=\"codehilite\"><pre>GET [base]/Medication?code:in=[valueset-id]\n</pre></div>",
        "id": 153874551,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488505931
    },
    {
        "content": "<p>that assumes that your terminology server is hooked up to your search engine. </p>",
        "id": 153874552,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488505956
    },
    {
        "content": "<p>if it's not, then denormalising with an extension is the way to go. </p>",
        "id": 153874553,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488505976
    },
    {
        "content": "<p>we haven't defined an extension for this purpose. I guess you would take this request to the 'australia' channel and ask <span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> &amp; co for one</p>",
        "id": 153874554,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488506010
    },
    {
        "content": "<p>Yeah we don't have a terminology server yet. So I think denormalising with the extension is what we need for now</p>",
        "id": 153874557,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488507280
    },
    {
        "content": "<p>This is global though, not necessarily Australia. Other terminologies have similar concept types</p>",
        "id": 153874558,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488507315
    },
    {
        "content": "<p>But will get into the Au channel</p>",
        "id": 153874559,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488507333
    },
    {
        "content": "<p>however the overall concerns are different for each terminology</p>",
        "id": 153874565,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488507567
    },
    {
        "content": "<p>Well it is kind of the same. DM+D has VMP == MPUU. RxNorm has SCD == MPUU also. Other terminologoies have the same sorts of modelling which we map into our model.</p>",
        "id": 153874567,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488507638
    },
    {
        "content": "<p>Having a Terminology Server, I took the approach as per Grahame's intention and created a value set for each of the '7 boxes' in NZMT (plus a few others for prescribing terms - generic, trade and all); then facilitated lookups, with various properties,  and code validation from NZMT as a whole. In practical terms, I do see some challenges in implementing medication lookup functionality without a Terminology Service - given the frequency of NZMT/AMT updates. Exchanging and persisting details of medications that have been prescribed/dispensed/administered is, of course, another matter.</p>",
        "id": 153874576,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1488509817
    },
    {
        "content": "<p>We have an internal system that we import the monthly updates into (weekly for DM+D). It isn't a true terminology service, but it serves the drug data for our medication and problem list products. Now adding FHIR on top. So we have solved that problem for drug data, just need to get the data out in a sensible way in FHIR.</p>",
        "id": 153874577,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1488509968
    },
    {
        "content": "<p>I'd love to have that problem - try using CDA!  For several years, I've been the custodian of the  NZePS Data Model and CDA specifications and long for the day when I can upgrade to the medication resource models in FHIR.</p>",
        "id": 153874578,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1488510226
    },
    {
        "content": "<p>Just a comment on what <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  said with the value sets - if you rely on is-a relationships for the implicit value sets you'll get some (maybe) unexpected results. So \"Panadeine tablet (TPUU)\" is a subtype of MP, and if you use the \"is-a MP\" implicit value set you'll get that behaviour.</p>\n<p>If you want to get a value set that is all of the MPs but not including MPUUs or TPUUs you need to use the implicit value set based on the AMT published reference set for MP. Each of the 7 boxes has such a reference set, and my earlier validate-code example used one of those.</p>",
        "id": 153874878,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488777182
    },
    {
        "content": "<p>or you can use exclude in the value set definition.</p>",
        "id": 153874881,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488777275
    },
    {
        "content": "<p>true, but the definitions are a bit more complicated</p>\n<p>MP = MP - MPUU - TPUU<br>\nMPUU = MPUU - TPUU<br>\nMPP = MPP - TPP - CTPP<br>\nTPP = TPP - CTPP<br>\nCTPP = CTPP</p>\n<p>Or you can just use the reference sets published for each of these which already apply that logic and filter to active content. Probably also less work for the terminology server.</p>",
        "id": 153874884,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488777804
    },
    {
        "content": "<p>it's certainly simpler. </p>",
        "id": 153874886,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488778147
    },
    {
        "content": "<p>What is the \"well-known phrasing\" used to describe the 7 boxes? AMT documentation used the phrase \"Product Class.\" Is that accurate?</p>",
        "id": 153875162,
        "sender_full_name": "David Teirney",
        "timestamp": 1488856973
    },
    {
        "content": "<p>I'd be worried \"product class\" could be misinterpreted to mean a class of pharmaceuticals like \"antibiotics\".. but sorry, don't have any better suggestions either!</p>",
        "id": 153875171,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488864952
    },
    {
        "content": "<p>The dm+d documents refer to their boxes as \"components\"</p>",
        "id": 153875172,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488864966
    },
    {
        "content": "<p>quoting \"Each component (represented as a box in the diagram below) describes a product at different levels of granularity to support various use cases. \"</p>",
        "id": 153875173,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488864995
    },
    {
        "content": "<p>Hi. Cathing up:  the definitions above make sense, and of course they are not universal.<br>\nThere was no standard termiology, until IDMP. IDMP provides a reference model: A very clear definition of Pharmaceutical Product, Medicinal Product, and Packaged Product, and which data elements belong to each.</p>",
        "id": 153875213,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488886158
    },
    {
        "content": "<p>Each country will of course implement their own concept.</p>",
        "id": 153875214,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488886216
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> : for Catalogs, the current idea is that we'd have an entry, that is has: a) characteristics, and b) relation to other entries.</p>",
        "id": 153875215,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488886346
    },
    {
        "content": "<p>All these \"classes\" are not something that we should fix. The only anchors I'd use is the IDMP concepts.</p>",
        "id": 153875216,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488886465
    },
    {
        "content": "<p>and I agree that we should look at the medication resource to see how it covers (and whether changes are needed) these aspects. For example the \"isBrand\" may not be sufficient with several implementations.</p>",
        "id": 153875217,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488886534
    },
    {
        "content": "<p>Bottom line: IMO, these things are not flat, and perhaps not hierarchical but polyhierarchical. I see it as a graph.<br>\nOne substance is produced as two medicinal products, but one medicinal product may contain two substances.</p>",
        "id": 153875218,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488886652
    },
    {
        "content": "<p>I think that if we have to convey an MP and a PhP (Pharmaceutical Product), we would have two resources, even if they have the same type.<br>\nWe can then update one or the other independently.</p>",
        "id": 153875219,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488886784
    },
    {
        "content": "<p>Catalog discussions are on wednesdays at 19:00 CET</p>",
        "id": 153875220,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488886970
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I'll dial in to those meetings to get my head around it. Do you mean adding a Catalog element to the Medication resource with this information?</p>",
        "id": 153875344,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488924650
    },
    {
        "content": "<p>There's also a related discussion at <a href=\"https://chat.fhir.org/#narrow/stream/australia/subject/concept.20type.20extension\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/australia/subject/concept.20type.20extension\">https://chat.fhir.org/#narrow/stream/australia/subject/concept.20type.20extension</a></p>",
        "id": 153875346,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488924713
    },
    {
        "content": "<p>Specifically a comment I made which is sort of relevant. I'm not claiming this a perfect answer, but it illustrates the issue.</p>\n<blockquote>\n<p>I have played with the notion of indicating generically what sort of thing a Medication is. Essentially AMT has 7 things which (mostly) map to Medication resources.<br>\nMP = unbranded product with no strengths or form<br>\nMPUU = unbranded product with strengths and form<br>\nMPP = unbranded package with no container<br>\nTP - no translation<br>\nTPUU = branded product with strengths and form<br>\nTPP = branded package with no container<br>\nCTPP = branded package with container<br>\nWe could have some sort of indicator for the things on the right hand side which we could then map the various medicines dictionaries to. For example an indicator that means \"unbranded product with no strengths or form\" could have MP and VTM mapped to it.<br>\nI've also experimented with indicating \"branded parent\" and \"unbranded parent\" references for Medication resources to indicate the links between them that you get from medicines terminology. Again looking for non-terminology specific names.</p>\n</blockquote>",
        "id": 153875350,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488924842
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span>  The idea is more that any medication with its characteristics can be in a \"catalog entry\", with the Catalog being a composition of these catalog entries</p>",
        "id": 153875357,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488925815
    },
    {
        "content": "<p>like \"here is a catalog which contains: <br>\n1)Paracetamol 500 mg tabs, <br>\n2) Paracetamol 500 mg caps, <br>\n3) medicationX, containing 1), brand A,...<br>\n4) medicationY, containing 1), brand B,..<br>\n5) medicationZ, containing 2, brand C,...</p>",
        "id": 153875359,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488926018
    },
    {
        "content": "<p>where \"containing\" is:<br>\nthis entry has a relation \"contains\" (or \"packaged as\", or \"groups\" or whatever) with the other entry in this catalog.</p>",
        "id": 153875360,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488926103
    },
    {
        "content": "<p>each entry can indicate a related entry and the type of relation</p>",
        "id": 153875361,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488926131
    },
    {
        "content": "<p>Right, so do you mean that Catalog would be a new resource that references Medication resources? Sorry, I'm just trying to understand where this information would be held - i.e. existing resources, new resources or a bundle like composition thing.</p>",
        "id": 153875362,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488926279
    },
    {
        "content": "<p>Catalog would actually a Catalog entry, but yes, that is the idea</p>",
        "id": 153875367,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488927176
    },
    {
        "content": "<p>If I was to take a stab at summarising the initial problem that the Orion health guys have (<span class=\"user-mention\" data-user-id=\"191477\">@Steve Swinsburg</span>/ <span class=\"user-mention\" data-user-id=\"191709\">@David Teirney</span>  correct me if wrong):</p>\n<p>--<br>\nThe are wrapping an existing system with a FHIR API that allows access to Medication resources - the existing system knows that each Medication is either a product or a package or generic or branded via whatever terminology source they have. However, the downstream consumers of these Medication resources don't have access to terminology services and therefore they'd like some attributes/extensions they can put into a Medication resource to help the downstream system out in determining if something was a branded package or a unbranded unit of use etc (ala isBrand but more comprehensive). Very specifically, they are happy to put an extension in but literally don't know what the call the extension or values in a way that is globally understood and is not specific to one terminology instance (perhaps IDMP helps here?).<br>\n--</p>\n<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I get that IDMP seems like some international effort to standardise naming/models etc (which sounds good) - but having some sort of Catalog grouping of Medication resources doesn't seem like it solves their issues - if their end system can't make terminology service calls, then presumably they also can't make calls to fetch Catalogs either. It just seems like inventing a terminology service but calling it something else.</p>\n<p>Unless you mean as <span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span>  says, that the Medication resource itself holds a 'Catalog' back pointer - effectively that Medication \"paracetamol 500 mg tab\" would have attributes saying it belongs to the catalog \"AMT MPUU\", or catalog \"non-branded\"(??) or catalog \"IDMP class named XXX\".</p>",
        "id": 153875381,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488934904
    },
    {
        "content": "<p>Yes that's why I suggested the labels</p>\n<ul>\n<li>unbranded product with no strengths or form</li>\n<li>unbranded product with strengths and form</li>\n<li>unbranded package with no container</li>\n<li>branded product with strengths and form</li>\n<li>branded package with no container</li>\n<li>branded package with container</li>\n</ul>\n<p>That way you can tell what granularity of thing you have without being AMT specific. Each of these correlate to AMT and would to other meds terminologies, although there may be others like unbranded/branded product with form and no strengths which AMT doesn't have.</p>\n<p>So what I was suggesting is for the Orion guys to rather than create something at is \"concept type\" and the values be AMT specific, create something more general which could be used for other terminologies too. That way the client code that doesn't have the terminology server but can react to these labels would work with dm+d as well as AMT for example.</p>",
        "id": 153875390,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1488939048
    },
    {
        "content": "<p>Yep, I mostly agree with your suggestions <span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> .. was just summarising for <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> . It's possible that some of the words could better align with IDMP - branded, non-branded etc - I don't know what the preferred wording from an IDMP perspective is (I don't know anything about IDMP to be honest).</p>",
        "id": 153875395,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488941124
    },
    {
        "content": "<p>Drilling into your suggestion though <span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span>, I'm not 100% convinced by the \"package with container\" and \"package with no container\" distinction.. I think we'd find that that distinction is an artifact that is peculiar to AMT? But I like the \"no strengths or form\" distinctions and the branded v non-branded.</p>",
        "id": 153875397,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488941326
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191649\">@Andrew Patterson</span> If i understand well your point: <br>\nI think that any medication catalog entry would indeed have something that says whether it is a branded product or a Pharmaceutical Product or an MPUU...<br>\nI don't know if that needs to be a pointer (to an entry in a \"list of concepts\"?) or simply an identifier, or more simply, just a code set identifier..</p>",
        "id": 153875471,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488960936
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> These labels do make sense conceptually, but maybe they are insufficiently clear, or cannot apply to different regions. I am defending that other labels may make sense in different contexts. And we should adhere to IDMP firsthand.</p>",
        "id": 153875472,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488961039
    },
    {
        "content": "<p>e.g. What do we do with branded generics? <br>\nOr clusters?<br>\nOr national product coding systems where there is a code for \"Paracetamol 500 mg tabs, 20 per box, regardless of the brands\"</p>",
        "id": 153875473,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488961132
    },
    {
        "content": "<p>IDMP Concepts: <br>\n1. PhP - Pharmaceutical Product, which incorporates a Substance, Route of Administration, Administerable Dose Form, Strength, and medical device associated if any. There are other attributes, but if and only if any of these 5 attributes changes, then we are dealing with another product.<br>\n2. MP - Medicinal Product, which points to 1..* PhPs and has a manufacturer, brand name, Pharmaceutical Dose Form, Classification, indication..<br>\n3. PC - Packaged Product, which points to 1 MPID and has a package,..</p>",
        "id": 153875474,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488961482
    },
    {
        "content": "<p>Check page 9 of this for a list of the attributes<br>\n<a href=\"http://www.open-medicine.eu/fileadmin/openmed/deliverables/643796_d2.2_comprehensive_set_of_openmedicine_identifying_and_descriptive_attributes_of_medicinal_products_and_the_available_standards.pdf\" target=\"_blank\" title=\"http://www.open-medicine.eu/fileadmin/openmed/deliverables/643796_d2.2_comprehensive_set_of_openmedicine_identifying_and_descriptive_attributes_of_medicinal_products_and_the_available_standards.pdf\">http://www.open-medicine.eu/fileadmin/openmed/deliverables/643796_d2.2_comprehensive_set_of_openmedicine_identifying_and_descriptive_attributes_of_medicinal_products_and_the_available_standards.pdf</a></p>",
        "id": 153875475,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488961633
    },
    {
        "content": "<p>My suggestion would be to <br>\n1. Define  a strucure of attributes that reflects or at least supports IDMP levels<br>\n2. Use the medication resource to convey such attributes, <br>\n3. Use a label ConceptType to define, LOCALLY (i.e. no mandatory binding) what is the product concept type (i.e. does this instance define a PhP, or a MPUU, or ...)<br>\n4. Use global (IDMP) profiles or local (everything else) to define what attributes should be present for a given concept type</p>",
        "id": 153875477,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488961936
    },
    {
        "content": "<p>pinging pharmacy co-chairs <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"192080\">@John Hatem</span> <span class=\"user-mention\" data-user-id=\"191402\">@Scott Robertson</span> <span class=\"user-mention\" data-user-id=\"191432\">@Marla Albitz</span> for a pointer to this discussion</p>",
        "id": 153875486,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488964624
    },
    {
        "content": "<p>I was just trying to bring it back to the original source of the discussion - which was that they have a list of FHIR Medication resources but no access to a terminology service - and they want to discriminate the branded packages from the unbranded units (for instance). What I'm thinking you are saying is that you'd propose extensive additions to the FHIR Medication resource so that it has all attributes from the IDMP model (or realign existing FHIR properties to match the IDMP attributes)? Is that right?<br>\nAnd then people could work out whether it was a PhP or whatever because by definition if attribute X,Y and Z are present then that means it must be a PhP, but if attribute W, X are present it must be a MP etc?</p>",
        "id": 153875502,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1488970477
    },
    {
        "content": "<p>Speaking for myself, not HL7 Pharmacy or the other co-chairs.  Please, please, please do NOT replicate all, or even a significant portion, of IDMP and other descriptive information into the Medication resource.  Granted something like \"brand/generic\" may be a reasonable addition (once you nail down the definition ... it is not binary), much more than that would break the 80% rule of FHIR - much of IDMP and other similar classification schemes, are not used in the vast majority of ordering, administration, and dispensing.   </p>",
        "id": 153875610,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1489009378
    },
    {
        "content": "<p>EHRs are not drug knowledgebases, but EHRs (and other HIT systems need access to such information.  Terminology Services would be the better route for that detailed information (or possibly specialize resources?)</p>",
        "id": 153875611,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1489009737
    },
    {
        "content": "<p>Bear in mind, i'm coming in late to this conversation and have not read the entire thread</p>",
        "id": 153875612,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1489009893
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191402\">@Scott Robertson</span> : the point 2 above is not to convey the full IDMP description in the resource, but to convey \"this is an MP\", or \"This is a PhP\" and the already existing characteristics of the medication.</p>",
        "id": 153875725,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1489054972
    },
    {
        "content": "<p>so indeed we should not force idmp down to the medicatoin resource which intends to be sufficient for clinical use.</p>",
        "id": 153875726,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1489055003
    },
    {
        "content": "<p>Sorry for the silence, long weekend here. Yes, accurate summary. Here's a screenshot of our mappings. I am sure we could some up with a set of codes to represent these globally. Internally we use the AMT (+ING) acronyms - seems to make sense across the ones we handle. Ignore the ? symbols. X means not implemented in that terminology.<a href=\"/user_uploads/10155/kzUwaVYV2r3zPG1zfzrD2S0f/Screen-Shot-2017-03-15-at-12.39.56-PM.png\" target=\"_blank\" title=\"Screen-Shot-2017-03-15-at-12.39.56-PM.png\">Screen-Shot-2017-03-15-at-12.39.56-PM.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/kzUwaVYV2r3zPG1zfzrD2S0f/Screen-Shot-2017-03-15-at-12.39.56-PM.png\" target=\"_blank\" title=\"Screen-Shot-2017-03-15-at-12.39.56-PM.png\"><img src=\"/user_uploads/10155/kzUwaVYV2r3zPG1zfzrD2S0f/Screen-Shot-2017-03-15-at-12.39.56-PM.png\"></a></div>",
        "id": 153876781,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1489542090
    },
    {
        "content": "<p>Catching up: <span class=\"user-mention\" data-user-id=\"191649\">@Andrew Patterson</span> Yes, that is a good summary, except that we'd not support all the attributes of the IDMP model, but only a small part. The IDMP model is used to describe the medication, whereas in clinical scenarios we typically need to specify it , i.e. give enough information so that everyone can understand what is meant. In an example, the IDMP model describes the substances, salts, all their regulatory relevant properties, and the product names, and the materials of packaging..... where we may live with an ID - substance, a PhP, an MP, a PackageID... or some of the attributes like strength, brand name, Marketing authorization number, package size...</p>",
        "id": 153877963,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1489824185
    },
    {
        "content": "<p>And you are spot on what we called the Identifying attributes: If attributes Ph1, Ph2, Ph3, Ph4 are present(substance, strength, form), it is a PhP, but if the attributes M1, M2,.. (Brand name, Marketing Authorization holder,...) it is a MP, and if the attributes PC1, PC2 (Package size, ...) then it is a Packaged Product.</p>",
        "id": 153877964,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1489824305
    },
    {
        "content": "<p>And here is the link from IDMP to the concepts shown in the table from <span class=\"user-mention\" data-user-id=\"191477\">@Steve Swinsburg</span> and to the other national concepts - which we must support, but not crop or limit in any way:<br>\nIn several countries, Sometimes the \"product\" is defined as a unique combination of attributes Ph1, Ph2, Ph3   +  PC1. Example: there is a code that represents \"Paracetamol 500 mg tablets, Box of 20\". This is the only code allowed in prescriptions, or it is used for billing and reimbursement,...<br>\nSo None of the IDMP identifiers are sufficient. But in that country, the \"product\" can still be represented by a unique identifier that still maps to IDMP identifiers.</p>",
        "id": 153877965,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1489824659
    },
    {
        "content": "<p>Sorry for the details, but after an extensive analysis, I realized that there is no \"single terminology\" that will fit all purposes, and things like \"is this a brand or generic\" do not hold globally. There many moving parts, and one big gear turning all the others: Whatever concept type is used for national authorizations, reimbursement... etc. - that is the concept type that matters. And that varies widely. <br>\nSo any standard must support different concepts - not sticking to a few, but actually having a flexible mechanism.<br>\nReducing the machine to a couple of gears is going to clash with reality - which would mean that different implementers would have different implementations, which is what we are trying to avoid.</p>",
        "id": 153877966,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1489825049
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> do you think it would be reasonable to create a set of concept types based on the set in the table above as a base set? bear in mind this is for an extension.</p>",
        "id": 153878474,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1489991281
    },
    {
        "content": "<p>As for extensions, I'd not have any insight. My point is that  with IDMP there are 4 standardized levels of \"products\" : Substance, Pharmaceutical Product, Medicinal Product, packaged Product. The identifiers will be assigned/monitored by regulators (EMA / FDA), and they have a very clear meaning, which is intended to be global.<br>\nAny local scope can defie thigs like \"brand product\" or \"generic\" but that does not hold well across borders. </p>",
        "id": 153878642,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490042961
    },
    {
        "content": "<p>so, yes, concept types - as extensions - should be ok, i guess. <span class=\"user-mention\" data-user-id=\"191477\">@Steve Swinsburg</span> How would that look like?</p>",
        "id": 153878643,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490043037
    },
    {
        "content": "<p>Note that I'm only looking at concept types. I do not want to look at code sets, nor the hundreds of attributes that can be associated with each concept. As Scott said, that is not relevant. in clinical space, we only need a very small subset of attributes. In openMedicine, we had loooooong discussions on whether a prescription should fully describe a medication, or just point to whatever-code-is-commonly-understood. The latter won :)</p>",
        "id": 153878644,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490043138
    },
    {
        "content": "<p>my advice in any case would be to try to list the identifying attributes of each concept type - <br>\ne.g. <br>\nwhat distinguishes a TPP from a CTPP is a) the packaging quantity and b) packaging type <br>\nwe had huge discussions to explain why. so you can try to read the documents if you want to see why we needed this for cross-border prescription.</p>",
        "id": 153878645,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490043282
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> re the extension. Current thinking is that we go with an extension name of medication-type with a set of Codes as MP, MPUU, MPP, TPUU, TPP, CTPP, as per the mapping above.</p>",
        "id": 153878682,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1490057361
    },
    {
        "content": "<p>and TP</p>",
        "id": 153878683,
        "sender_full_name": "Steve Swinsburg",
        "timestamp": 1490057403
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191477\">@Steve Swinsburg</span>  I was thinking that the valueset would suffice. You say \"here's a code, and btw, it is a code of type MP\". (I think in openMedicine we concluded it'd have be a rather unambiguous  code, or have an OID, or a uri. \"MP\" in itself is not that unambiguous.)</p>",
        "id": 153878740,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490101974
    },
    {
        "content": "<p>there is an attribute called \"isBrand\" but perhaps that is too limited being a boolean.</p>",
        "id": 153878741,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490102057
    },
    {
        "content": "<p>If you need that extension, i don't see why not use it. Many countries will define their product concept type. And then we have groups and clusters...</p>",
        "id": 153878742,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490102135
    },
    {
        "content": "<p>the only thing I wonder is if those concepts would be global. I would start looking at the global concepts from IDMP.</p>",
        "id": 153878743,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490102223
    },
    {
        "content": "<p>every other seems national/regional.</p>",
        "id": 153878744,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490102241
    },
    {
        "content": "<p>if you join a catalog discussion, I can ask for a discussion around that. We're looking at things like relations between concepts. Complementing (not replacing) the base resource which is Medication</p>",
        "id": 153878745,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490102314
    },
    {
        "content": "<p>or we can discuss in Madrid. Sorry if my description is too spread out there, but I am trying to connect distant dots. and we did have long discussions to reach something that could work.</p>",
        "id": 153878746,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490102379
    },
    {
        "content": "<p>I can jump on a call at a decent time for you if you want and think that is helpful. I live in Europe but I spend lots of time in insomnia-land, so surely we can arrange for a slot.</p>",
        "id": 153878747,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490102717
    },
    {
        "content": "<p>I would ask that discussions that are relevant to a medication are discussed on a Pharmacy WG call rather than in the catalog project call.  IMHO the types being discussed here are attributes of the medication resource.</p>",
        "id": 153878899,
        "sender_full_name": "Melva Peters",
        "timestamp": 1490127385
    },
    {
        "content": "<p>I will describe in today's Pharmacy call. This is related to Medication, Catalog and the IDMP alignment. Perhaps this is a good way to combine the discussion. </p>",
        "id": 153879929,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490642011
    },
    {
        "content": "<p>So sorry I missed all this discussion...I guess what I'm looking for is to provide a way of tagging the way <span class=\"user-mention\" data-user-id=\"191477\">@Steve Swinsburg</span> is suggesting with a level of abstraction matching the underlying terminology for the identity of that medication. I'm not keen on aligning that to IDMP because the medication terminologies don't and they express much more levels than IDMP does.</p>\n<p>If we can come up with a superset of the levels expressed  by the major medication terminologies (there's not that many and the levels are a pretty finite list with strong overlap between the terminologies) then someone writing code against a medication resource doesn't need to care if it is AMT, RxNorm, NZMT or dm+d if they need to key some logic off that level. So if we declare some codes matching these levels and define the mappings between those codes and the major medication terminologies it gives developers a chance to write code that is agnostic of the particular medicines terminology they are using...a good thing.</p>\n<p>That's why I think the codes themselves should not be specific to one of the terminologies in particular - I don't think using a code \"MP\" is a good idea, but call it something else.</p>\n<p>BTW <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> the difference between TPP and CTPP is only that CTPP specifies a container and TPP does not, both specify pack sizes.</p>\n<p><span class=\"user-mention\" data-user-id=\"191649\">@Andrew Patterson</span> I don't think it is a big deal that some of these levels are only specific to one terminology. The coverage of these levels across the terminologies will vary, some will have some levels while others don't. It would be a problem if there were hundreds or even tens of these, but there isn't. I think creating the superset across all the medicines terminologies and mapping them is the way to go, then you will see where they line up and where they don't, and in future they may converge.</p>",
        "id": 153880352,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1490847927
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span> this being an extension, of course you'd have a superset. What I am saying is that there is no global superset that fits all cases. The minimum set should be IDMP because that is a global, precisely defined set.<br>\nAnd there are quite a few of terminologies and \"levels\" (they are not always hierarchical, so \"level\" may not be a good word). </p>",
        "id": 153880359,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490857260
    },
    {
        "content": "<p>but this seems to be the discussion that we should not be pushing in HL7 -what are the terms to use. That will always need to be defined locally, so why would we attempt to limit that diversity? Sorry but this seems deja vu from other projects, where we end up discussing for years what is the right set of terminologies and concepts, adn we arrive at the same conslusion: it varies, but thatnks to IDMP, it now varies in a structured way.</p>",
        "id": 153880360,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490857443
    },
    {
        "content": "<p>as for the solution (i think): Either make it an extension with \"concept type\" or even better, use the value set. That seems sufficient</p>",
        "id": 153880361,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490857534
    },
    {
        "content": "<p>I guess my point is that from a global developers perspective, if I can write some code that will work across multiple jurisdictions then that's a good thing.</p>\n<p>If we have \"levels\" (I agree that's not a good word) that can be consistent and useful across multiple jurisdictions which enable that and aren't limited to IDMP, then why not have them?</p>\n<p>Ultimately the extension will work...but it seems like there's an opportunity passing by...</p>",
        "id": 153880362,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1490857913
    },
    {
        "content": "<p>The code will always work the same way. Putting the value set will enforce that if the concept is not understood on the other side, the system will at least know something is wrong</p>",
        "id": 153880363,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490858001
    },
    {
        "content": "<p>Sure, but only if the extension is known about and used, and there aren't other extensions and methods invented to do the same thing creating islands of interoperability...</p>",
        "id": 153880364,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1490858108
    },
    {
        "content": "<p>thus: medication.code.coding.code=123, medication.code.coding.system=MPP<br>\nThis is supported at core.</p>",
        "id": 153880365,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490858198
    },
    {
        "content": "<p>yes, you point to the right problem, so I pointed to a global solution for that: IDMP as a core set of concepts</p>",
        "id": 153880366,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490858255
    },
    {
        "content": "<p>medication.code.coding.system=MPP isn't right, the system will be the URI appropriate to AMT, RxNorm, dm+d...etc. So that doesn't help determine what \"concept type\" it is...that's essentially <span class=\"user-mention\" data-user-id=\"191477\">@Steve Swinsburg</span>'s problem<br>\nregarding IDMP, my understanding is it is driven from regulatory use cases, so that may shed some light on why it has far fewer \"levels\" that the medicines terminologies which have far broader use cases. In short, I suspect it will be insufficient</p>",
        "id": 153880367,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1490858542
    },
    {
        "content": "<p>ok for the system vs concept. I'd expect that a terminology would handle different codes for different levels.</p>",
        "id": 153880369,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490859633
    },
    {
        "content": "<p>if i read you correctly, code.coding.system=IDMP and you'h have to know from the code whether it is one or another concept type.</p>",
        "id": 153880370,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490859693
    },
    {
        "content": "<p>i think my point is that every concept set is going to be insufficient.</p>",
        "id": 153880371,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490859725
    },
    {
        "content": "<p>and we've seen that when analyzing this for openMedicine. Conclusion: we cannot set on one or a few concepts in Europe. so, whatever we have has to be a subset, and people will extend</p>",
        "id": 153880372,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490859826
    },
    {
        "content": "<p>as for the extension. Medication has a \"isBrand\" - and that is where I would start addressing it. It is currently boolean, but perhaps that would be the example binding that we need.</p>",
        "id": 153880373,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490859871
    },
    {
        "content": "<p>as in \"conceptType\" and that can be either \"IDMP MP, IDMP PhP, IDMP PC, Country1 Hospital code set, Country code cluster code set...\"</p>",
        "id": 153880374,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1490859937
    }
]