[
    {
        "content": "<p>Hi<br>\nI was in the last days wondering, if there are any best practices how to minimize the data that is accessible by an Application or User on a Attribute base. If (as example) if have an Application that needs only to show a very limited amount of attributes of Patient (e.g. First, Last Name and DOB), what would be the proposed way to do so if i want to avoid the possiblity to any additional data at all.<br>\nBecause just opening the FHIR Api, as i understand it, would lead to two problems<br>\n- Performance (i would transfer by far too much data), which could be mitigated using the elements field for querying<br>\n- Data Privacy (i do not want to transfer more data that is required in any case, to reduce the risk of leaking data)<br>\nFor the second one i currently have not seen any solution, as form my understanding most security concepts are to be interpreted on application level or are much more coarse graing. </p>\n<p>Is there any proposal/best practice how to configure the security in a way, that only certain attributes of resources will be shown to a user, or would we rather see the FHIR server in such scenarios more as a SQL database, i.e. it should not be reachable by the application user, but only by the application which filters the results provided to the enduser? Which would mitigate the problem somehow, but still render the solution vulnerable if either the isolation breaks, or your application has an injection vulnerability.</p>",
        "id": 167361976,
        "sender_full_name": "Christopher Schildt",
        "timestamp": 1559716584
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191351\">@Chris Grenz</span> has been using profiles for this. I think it's too complex for people, but there's a writeup somewhere...</p>",
        "id": 167373705,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559728713
    },
    {
        "content": "<p>See here: <a href=\"https://github.com/chrisgrenz/FHIR-Primer/wiki/Profile-Governed-API\" target=\"_blank\" title=\"https://github.com/chrisgrenz/FHIR-Primer/wiki/Profile-Governed-API\">https://github.com/chrisgrenz/FHIR-Primer/wiki/Profile-Governed-API</a></p>",
        "id": 167374159,
        "sender_full_name": "Chris Grenz",
        "timestamp": 1559729120
    }
]