[
    {
        "content": "<p>Hey, have been looking into the condition concept code bindings:<br>\n<a href=\"https://build.fhir.org/condition-mappings.html#sct-concept\">https://build.fhir.org/condition-mappings.html#sct-concept</a><br>\nSpecifically:<br>\n(&lt; 404684003 |Clinical finding| MINUS (<br>\n&lt;&lt; 420134006 |Propensity to adverse reactions| OR<br>\n&lt;&lt; 473010000 |Hypersensitivity condition| OR<br>\n&lt;&lt; 79899007 |Drug interaction| OR<br>\n&lt;&lt; 69449002 |Drug action| OR<br>\n&lt;&lt; 441742003 |Evaluation finding| OR<br>\n&lt;&lt; 307824009 |Administrative status| OR<br>\n&lt;&lt; 385356007 |Tumor stage finding|))<br>\nOR &lt; 413350009 |Finding with explicit context|<br>\nOR &lt; 272379006 |Event|<br>\nAs a potential way of helping sanity check Condition data.<br>\nI was wondering if there was more information or discussion anywhere about how this query was reached (or someone I could ask about it); as it definitely seems to exclude many things that are conditions (at least  in my mind) and would be interested in the justifications and rationale.<br>\nFor example, Psoriasis is excluded due to being a Hypersensitivity condition and Gout is excluded due to being an Evaluation Finding.<br>\nAnd on the other side, Event includes many things it probably should not.<br>\nThanks</p>",
        "id": 240037161,
        "sender_full_name": "Jack Burnett",
        "timestamp": 1621855066
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 240058301,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621866356
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"260074\">@Jack Burnett</span>  I probably had a hand in creating at least part of this mapping (it's been long enough ago that I actually don't recall).  I agree, particulary in the psoriasis example that you gave, that in that case it's overly restrictive.  The rationale for excluding <code>Hypersensitivity</code> was that <strong>primarily</strong> that SNOMED CT subhierarchy represents allergic conditions, which in FHIR should be represented using the AllergyIntolerance resource, not Condition.  But obviously that's not always and entirely the case, and Psoriasis certainly isn't an allergic hypersensitivity and it shouldn't be excluded (the SNOMED CT modeling for hypersensitivity and allergies has been improved since we first did this, and probably the value set could be more accurately defined now, but I'm sure that hasn't been looked at).  On the other hand, the fact that <code>Gout ( disorder)</code> has a parent of <code>Blood urate raised (finding)</code>, which then leads to it probably erroneously being grouped under and therefore excluded as an <code>Evaluation finding (finding)</code> likely doesn't represent the best modeling on the SNOMED CT side.  The SNOMED CT \"Concept Domain Binding\" isn't necessarily expected to be complete or perfectly accurate in all cases (especially as it requires being maintained over time).  But as you've aptly pointed out, it may be of help to \"detect potential inconsistencies\" (on either side).</p>",
        "id": 240112477,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1621890649
    },
    {
        "content": "<p>Thanks for the insight Rob, helpful to know the thinking behind it, including regarding Allergies <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> I think we will probably tweak it a little for our use-case but will be a good base for detecting issues.</p>\n<p>I think there are other Evaluation Findings that are incorrectly excluded. I wonder if there could be a way to re-include them (for example, ADDing all children of Disease back in). Something to think about if/when it gets revisited I suppose.</p>",
        "id": 240299783,
        "sender_full_name": "Jack Burnett",
        "timestamp": 1622022312
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"260074\">@Jack Burnett</span> Yes, I think that we can (and would want) to refine the binding expression to more accurately include or exclude concepts.  If that can be done, as you suggest, by adding the children (actually all descendants) of Disease, then it would make sense to do it.  If you or someone wants to update the expression (and probably verify it with the SNOMED on FHIR group or another SNOMED CT authority) we could certainly make that update in the CI build and then at least have it in our future FHIR R5 balloted and published versions.</p>",
        "id": 240319703,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1622033929
    }
]