[
    {
        "content": "<p>I am working on a example mapping a list of conditions from CDA observation-condition to FHIR condition. One of the condition has priorityCode primary, others are non-primary. How do I say the same in FHIR?</p>",
        "id": 153830546,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464624618
    },
    {
        "content": "<p>what's the definition of 'primary'? </p>",
        "id": 153830551,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464635573
    },
    {
        "content": "<p>I am doing an example for China FHIR group from one of their CDA document. The value in the priorityCode is, translated as, primary diagnosis (or major diagnosis). And other conditions have the value of \"other diagnosis\".</p>",
        "id": 153830552,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464636645
    },
    {
        "content": "<p>This is usually in the context of an encounter, episode of care or claim.  All of those should allow (either in core or via extension) the ability to assign a sequence to the condition.  Standing outside the context of one of those things, I've never seen a use case for any particular condition being \"primary\" for the patient overall, regardless of what practitioner/individual is looking at the data.</p>",
        "id": 153830556,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464639008
    },
    {
        "content": "<p>both Encounter and EpisodeOfCare allow you reference conditions, but not to indicate primary/secondary/complicating. But that differentiation exists in all CDA document problem lists I've ever found </p>",
        "id": 153830560,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464640416
    },
    {
        "content": "<p>it's not clear to me that this isn't Condition.category</p>",
        "id": 153830561,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464640467
    },
    {
        "content": "<p>Condition.category is a very different thing.  It allows you to differentiate symptoms from diagnoses, etc.  Encounter has an extension to allow indication of the \"primary\" diagnosis - <a href=\"http://hl7-fhir.github.io/extension-encounter-primarydiagnosis.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/extension-encounter-primarydiagnosis.html\">http://hl7-fhir.github.io/extension-encounter-primarydiagnosis.html</a>.  EpisodeOfCare doesn't yet, but I think it's definitely reasonable to ask for one.</p>",
        "id": 153830567,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464640826
    },
    {
        "content": "<p>There is an extension available to indicate primary diagnosis in context of an encounter (e.g. <a href=\"http://hl7-fhir.github.io/extension-encounter-primarydiagnosis.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/extension-encounter-primarydiagnosis.html\">http://hl7-fhir.github.io/extension-encounter-primarydiagnosis.html</a>), but I would personally prefer to have this (as well as <a href=\"http://hl7-fhir.github.io/extension-encounter-relatedcondition.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/extension-encounter-relatedcondition.html\">http://hl7-fhir.github.io/extension-encounter-relatedcondition.html</a>) be an element of the condition.  While I agree that these classifications are in context of an encounter, there is a condition.encounter element that specifies the encounter-specific context for that specific condition.</p>",
        "id": 153830713,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464699676
    },
    {
        "content": "<p>FHIR China also had a similar discussion this morning if the extension should be in Encounter or Condition.</p>",
        "id": 153830714,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464699823
    },
    {
        "content": "<p>Example definition:<br>\nPrimary diagnosis ICD code<br>\nIdentifies diagnosis for which the patient is receiving care and its ICD-9-CM code. The primary diagnosis should be the condition that is the chief reason for providing care.</p>\n<p>Related LOINC Code: 46511-2 Primary diagnosis ICD code [OASIS]<br>\nSource: Regenstrief LOINC</p>",
        "id": 153830722,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1464708322
    },
    {
        "content": "<p>To complicate things, \"chief compliant\" could be communicated via <a href=\"http://hl7-fhir.github.io/extension-encounter-relatedcondition.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/extension-encounter-relatedcondition.html\">http://hl7-fhir.github.io/extension-encounter-relatedcondition.html</a> whereas \"primary diagnosis\" or priority/rank = 1 could be communicated via <a href=\"http://hl7-fhir.github.io/extension-encounter-primarydiagnosis.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/extension-encounter-primarydiagnosis.html\">http://hl7-fhir.github.io/extension-encounter-primarydiagnosis.html</a>.  Our system treats both of these (role and rank) as attributes of the condition (more specifically, attributes for the subset of conditions that have a category of diagnosis, which is often billed in context of an encounter) </p>",
        "id": 153830729,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464714464
    },
    {
        "content": "<p>We've seen these indicators (primary or principal) used fairly often in quality measures.  While I can understand the desire to put such a tag on the Condition itself, I agree with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> that it's fairly meaningless outside of the context of the encounter to which it pertains.  It also becomes a bit troublesome when working with chronic conditions.  For example, consider a Condition for diabetes that had an onset 5 years ago.  The patient has had 20 encounters since then.  If the condition is flagged as <code>primary</code>, which encounter (or encounters) was it the primary for?  Flagging the Condition only works if you're going to create a separate Condition entry for every encounter in which it is addressed (which you might do, but I don't think we should force people to do it just to support this particular use case).</p>",
        "id": 153830731,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1464719223
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> , in the example of a chronic condition that was treated in context of 20 encounters, we would have 21 condition instances.  A single condition instance #1 for the chronic condition with category = problem, and no encounter specified.  Condition instances #2 through #21 would each have a category = diagnosis and a specific Condition.encounter populated.  Condition.encounter has a cardinality of 0..1, so there shouldn't be any question about which encounter the Condition.role/rank (if supported) applies  to.  </p>",
        "id": 153830737,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464722765
    },
    {
        "content": "<p>Per the usage note on Condition.encounter.....  \"This record indicates the encounter this particular record is associated with. In the case of a \"new\" diagnosis reflecting ongoing/revised information about the condition, this might be distinct from the first encounter in which the underlying condition was first known.\"  Thus, Condition.encounter is NOT constrained to the onset encounter when the chronic condition was first diagnosed.</p>",
        "id": 153830738,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464722949
    },
    {
        "content": "<p>Thanks for the info, <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>.  I wondered if something like that might be the case, but was confused by the fact that the \"preferred\" value set for <a href=\"http://hl7-fhir.github.io/valueset-condition-category.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/valueset-condition-category.html\">Condition.category</a> does not have any <code>problem</code> code.  It has only <code>complaint</code>, <code>symptom</code>, <code>finding</code>, and <code>diagnosis</code>.  So using the preferred value set, there isn't as obvious a way to distinguish between the longitudinal problem and the encounter diagnosis.  There also isn't a good way to tie the encounter diagnoses to the longitudinal problem so that it's clear they are all referencing the same underlying problem.</p>",
        "id": 153830739,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1464724250
    },
    {
        "content": "<p>That said, I'm not surprised that it works as you described -- as that seems to be a better match to how current systems and workflows do it today (despite any shortcomings).</p>",
        "id": 153830740,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1464724383
    },
    {
        "content": "<p>Albeit a work in progress, the current Argonaut (US-based) IG includes an additional Condition.category code for problem (and concern) per <a href=\"http://argonautwiki.hl7.org/index.php?title=Problems_and_Health_Concerns#Mandatory_Data_Elements\" target=\"_blank\" title=\"http://argonautwiki.hl7.org/index.php?title=Problems_and_Health_Concerns#Mandatory_Data_Elements\">http://argonautwiki.hl7.org/index.php?title=Problems_and_Health_Concerns#Mandatory_Data_Elements</a></p>",
        "id": 153830741,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464724430
    },
    {
        "content": "<p>Regarding the consequence of representing all billed diagnoses as a single 'chronic' Condition might trigger the question of what the Condition.code should be?  For example, problems (in the US) are most often SNOMED, but diagnoses are ICD.  When we discussed the possibility of \"translating\" SNOMED to ICD-X codes, we intentionally didn't do that because the ICD code could add inaccurate information—like initial encounter -- which isn't relevant to all billed diagnoses across all encounters.</p>",
        "id": 153830743,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464724686
    },
    {
        "content": "<p>Good points on all.  The difference in coding systems does make that problematic, doesn't it?  When something happens, like the condition resolves, are all of the individual diagnosis records updated?  I would guess that is not the case, but then it makes the tail end of this guidance on abatementDate less relevant: \"If there is no abatement element, it is unknown whether the condition has resolved or entered remission; applications and users should generally assume that the condition is still valid\".  Modeling health info is tough stuff!</p>",
        "id": 153830744,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1464725403
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> Condition.encounter is reference type. Do you add extension  <a href=\"http://hl7-fhir.github.io/extension-encounter-relatedcondition.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/extension-encounter-relatedcondition.html\">http://hl7-fhir.github.io/extension-encounter-relatedcondition.html</a> into that encounter reference?</p>",
        "id": 153830745,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464725944
    },
    {
        "content": "<p>I agree <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> -- there are a subset of Condition attributes that are either more or less applicable depending on whether it is a diagnosis or problem (abatement being a representative example of an attribute we only maintain/populate for problems, not diagnosis)</p>",
        "id": 153830750,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464728138
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>  -- we haven't actually implemented the encounter extensions yet.    </p>",
        "id": 153830751,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464728626
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> If we're talking about multiple records of the same Condition, I think the priority belongs on something like Linkage - so that the context of the priority is clear.</p>",
        "id": 153830789,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464745619
    },
    {
        "content": "<p>Hi all. In China FHIR community, we just had an extensive discussion regarding how to properly represent multiple conditions using FHIR, and there is no clear answer. </p>\n<p>The use case is that one system (SysA) needs to send a patient's active problem list to another system (SysB) for whatever reasons.  The patient has AMI, Hypertension, and Diabetes. Of whcih, AMI is the primary diagnosis (a.k.a the key condition) and is the main reason of current hospital stay and care service. During FHIR data exchange, SysA needs to specifically tell sysB that the AMI is primary diagnosis(key-condition) and the rest diagnosis are none-key-conditions .</p>\n<p>To make it more complex, each diagnosis (AMI, Hypertension, Diabetes) has additional flag to indicate whether the diagnosis was confirmed when patient was first admitted. (1 = confirmed, 2 = not sure, 3=unknown, 4=no ). </p>\n<p>hopfully I clearly explained the use case.  The question is: does FHIR has a clear way to express above information?  Thanks.</p>\n<p>JD</p>",
        "id": 153830790,
        "sender_full_name": "Jingdong(JD) Li",
        "timestamp": 1464746882
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192102\">@Jingdong(JD) Li</span> - I think you provide a good example of a common real world situation that FHIR <code>condition.verificationStatus</code> is not currently able to deal with. The current values being <code>provisional | differential | confirmed | refuted | entered-in-error | unknown</code>. </p>",
        "id": 153830793,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464747346
    },
    {
        "content": "<p>The problem is that for any given problem there maybe a <code>provisional</code> and a set of <code>differential</code> diagnoses. But often patients have a set of \"possible\" co-morbidites that are important but yet to be confirmed.</p>",
        "id": 153830796,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464747507
    },
    {
        "content": "<p>It seems to me that the <code>provisional | differential</code> pair really belong in clinical impression</p>",
        "id": 153830797,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464747547
    },
    {
        "content": "<p>and that <code>condition.verificationStatus</code> should include <code>possible</code></p>",
        "id": 153830798,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464747689
    },
    {
        "content": "<p>In <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> 's example, should that be 1 condition instance with 20 history version or 20 condition instances ? </p>",
        "id": 153830800,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464748311
    },
    {
        "content": "<p>what's the relationship between a patient's problem list, and their ongoing encounters? The scenario from JD above, that's an encounter specific perspective on the problem list, yes?</p>",
        "id": 153830803,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464750111
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> The patient's problem list is based on a specific encounter. Within an encounter,  can FHIR reprensent the multiple problems with different clinical priority? </p>",
        "id": 153830896,
        "sender_full_name": "Jingdong(JD) Li",
        "timestamp": 1464766821
    },
    {
        "content": "<p>there are 2 relevant extensions defined by the spec itself: primaryDiagnosis and relatedCondition. </p>",
        "id": 153830898,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464766987
    },
    {
        "content": "<p>what about the additional flag that <span class=\"user-mention\" data-user-id=\"192102\">@Jingdong(JD) Li</span> mentioned? ie \" (1 = confirmed, 2 = not sure, 3=unknown, 4=no )\"</p>",
        "id": 153830899,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464767762
    },
    {
        "content": "<p>There's no extension for those, no. That's make you own up space, then. or make a task and see what the committee thinks about it </p>",
        "id": 153830903,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464772133
    },
    {
        "content": "<p>or both</p>",
        "id": 153830904,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1464772135
    },
    {
        "content": "<p>yes sorry - agree i must stop rambling and attempt to be productive (note to self)</p>",
        "id": 153830907,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464773192
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> can you elaborate on why Linkage is preferred?  In the example mentioned earlier, we could have one condition with Condition.category = problem and no Condition.encounter.  We would have 20 more conditions with Condition.category = diagnosis, each with a distinct Condition.encounter.  I can see Linkage being used to link all 21 diabetes-related conditions together, but using Linkage to represent priority is where you lost me.  I didn't think the scope of Linkage was encouraging links between different types of resources (e.g. Encounter and Condition).  Additionally, the priority/rank/primary is still within the context of a single encounter (meaning all 20 diabetes diagnoses could all have a priority/rank/primary = 1), so I'm not sure why the Linkage resource is preferable to the encounter extension (even though I still wish it were an extension on condition instead of encounter)? </p>",
        "id": 153830943,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464785327
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> I agree. If the purpose of using Linkage is to link all records for the same chronic condition, it can be also achieved by search Condition?code=xxx&amp;clinicalStatus=xxx. Back to the topic, since priority is still within context of a specific encounter, I think the extension should be on Encounter.indication. If you need to know the priority of in a specific encounter, you can either go through Condition.encounter reference link to Encounter.indication.</p>",
        "id": 153830953,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464789083
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> My understanding of what you were describing was linking multiple instances of the same condition together, but distinguishing one as primary.  Linkage lets you do that.  If you want to distinguish primary vs. secondary for different diagnoses, that has to be done in the context of an Encounter, EpisodeOfCare, Claim or something else.</p>",
        "id": 153830981,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464801152
    },
    {
        "content": "<p>We're creating different conditions (each with their own <a href=\"http://Condition.id\" target=\"_blank\" title=\"http://Condition.id\">Condition.id</a>) to represent each billed diagnosis for 'diabetes' at different points in time (encounter).  Each encounter would have its own primary/principal diagnosis, such that each condition could be primary for its encounter.  </p>\n<p>By contrast, we aren't creating a single diabetes condition to represent both the billed diagnosis (ICD code) and chronic problem (SNOMED) on the problem list.</p>\n<p>Looking forward to Health Concerns, I could see Linkage being valuable when linking all of the diabetes-related conditions together.</p>",
        "id": 153830988,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1464803732
    },
    {
        "content": "<p>this is possibly ok - but it omits coping with uncertainty in the background problem list</p>",
        "id": 153831111,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464825887
    },
    {
        "content": "<p>the fundemental issue is that <code>Condition.verificationStatus</code> uses these \"provisional/differential\" notions that are intwined with implied meaning (ie a mutally excluse set of options to explain a focus issue)</p>",
        "id": 153831112,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464825887
    },
    {
        "content": "<p>a \"problem list\" rolls from one encounter to another - although everyone will have a slightly different take on it</p>",
        "id": 153831113,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464825887
    },
    {
        "content": "<p>the notion of a conditions priority for a given encounter is often very arbitrary - they often dont let doctors choose these but delegate to specialist coders who can choose the best one based on which code will be most lucrative for the hospital</p>",
        "id": 153831114,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464825887
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I think <span class=\"user-mention\" data-user-id=\"192102\">@Jingdong(JD) Li</span> 's requirement applies to all problem lists</p>",
        "id": 153831115,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464825887
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192001\">@Erich Schulz</span>  You are right. The use case  I gave is a common realworld scenario, it applies to all problem lists.</p>",
        "id": 153831126,
        "sender_full_name": "Jingdong(JD) Li",
        "timestamp": 1464832219
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192102\">@Jingdong(JD) Li</span>, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> has indicated that getting the \"possible\" added to the <code>Condition.verificationStatus</code> needs a case opened in the issue tracker. It is on my todo list - but it sounds like your need is more urgent than mine (I mainly have an academic interest)</p>",
        "id": 153831174,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464839514
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192001\">@Erich Schulz</span> I don't get why the priority is related to Condition.verificationStatus.</p>",
        "id": 153831175,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464840233
    },
    {
        "content": "<blockquote>\n<p>Lloyd McKenzie: Encounter has an extension to allow indication of the \"primary\" diagnosis - <a href=\"http://hl7-fhir.github.io/extension-encounter-primarydiagnosis.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/extension-encounter-primarydiagnosis.html\">http://hl7-fhir.github.io/extension-encounter-primarydiagnosis.html</a>. EpisodeOfCare doesn't yet, but I think it's definitely reasonable to ask for one.</p>\n</blockquote>\n<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10578&amp;start=0\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10578&amp;start=0\">GF#10578</a>  'Summary: Add an extension for primary diagnosis in the context of EpisodeOfCare' has been logged</p>",
        "id": 153846525,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1473157628
    }
]