[
    {
        "content": "<p>Out of curiosity, why is an encounter linked to an episode of car instead of a condition linked? An encounter can have multiple conditions, but each one of those conditions could be a different thing (e.g condition for hayfever and condition for a broken leg) where each condition would be ongoing so need an episode of care? Or am I totally confused about this?</p>",
        "id": 153861416,
        "sender_full_name": "Nate Walker",
        "timestamp": 1481083010
    },
    {
        "content": "<p>Encounters can be linked to both EpisodeOfCare and Condition (via indication).</p>",
        "id": 153861417,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481083433
    },
    {
        "content": "<p>Yes, I get that. But</p>\n<p>I go to the doctor - encounter<br>\nfor my hayfever refill script - condition and episode of care<br>\nand a rash on my leg - condition and separate episode of care</p>\n<p>2 days later I am back - encounter<br>\nfor an allergic reaction to the rash medication - new condition, continued episode of care</p>",
        "id": 153861419,
        "sender_full_name": "Nate Walker",
        "timestamp": 1481083687
    },
    {
        "content": "<p>Would I have to have 2 separate encounters for the first encounter?</p>",
        "id": 153861420,
        "sender_full_name": "Nate Walker",
        "timestamp": 1481083716
    },
    {
        "content": "<p>Or is that what the 'part of' field is used for?</p>",
        "id": 153861421,
        "sender_full_name": "Nate Walker",
        "timestamp": 1481083866
    },
    {
        "content": "<p>That is 2 seperate encounters (or visits)</p>",
        "id": 153861422,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1481084000
    },
    {
        "content": "<p>A single encounter can cover multiple conditions, and multiple episodes of care can be applicable to an encounter (for differing reasons).</p>",
        "id": 153861423,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1481084057
    },
    {
        "content": "<p>So visit 1 = 2 encounters, each with one condition and 1 episode of care? Or 1 encounter with 2 conditions and 2 episodes of care?</p>",
        "id": 153861426,
        "sender_full_name": "Nate Walker",
        "timestamp": 1481084165
    },
    {
        "content": "<p>Former: if I am looking up an episode of care I only see encounters and conditions related<br>\nLatter: if I am looking up an episode of care I then see conditions that are unrelated because they were presented at the same time as a condition that is related</p>",
        "id": 153861427,
        "sender_full_name": "Nate Walker",
        "timestamp": 1481084269
    },
    {
        "content": "<p>An encounter is the visit. There could be multiple things dealt with at the same time. (as a GP)<br>\nHowever if this was an inpatien visist and was co-ordinating treatments and different pracitioners were treating different things, then this could be multilpe encounters (admission encounter, treatment A, ...) linked via partOf.<br>\nThe episode of care referencing an encounter that treated multiple things, not sure on the potential issue there. There is a standard extension that covers the sequencing of the conditions on the encounter (so you can get the primary one if that's important for billing ;))</p>",
        "id": 153861441,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1481088817
    },
    {
        "content": "<blockquote>\n<p>if I am looking up an episode of care I then see conditions that are unrelated because they were presented at the same time as a condition that is related</p>\n</blockquote>\n<p>The EpisodeOfCare.condition conveys which conditions/problems/diagnoses that this episode of care is intended to be providing care for regardless of how many other diagnoses reference the same encounter.</p>",
        "id": 153861857,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1481121315
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191964\">@Bettina Lieske</span> :  wenn in IS-H ein Fall angelegt wird, wird dann automatisch auch ein Debitor angelegt, oder hängt der an den Versicherungsverhältnissen ?</p>",
        "id": 153861878,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481125409
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191546\">@Peter Scholz</span> Wrong thread?</p>",
        "id": 153861882,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481125998
    },
    {
        "content": "<p>mixed up threads, sorry Lloyd</p>",
        "id": 153862189,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1481187698
    }
]