[
    {
        "content": "<p>Hello people,</p>\n<p>In our systems we capture diagnosis and condition as two different entities.<br>\nThe criteria for  diagnosis is something which will be part of just one encounter, e.g.- a person diagnosed with cholera.<br>\nConditions are the one which will be present across the encounters, e.g.- A person having diabetes. In first encounter it will be entered as a condition  and in subsequest visits it will be marked as a followup to the condition.</p>\n<p>We wanted to map both as condition but we are not sure how we will differintiate between after mapping. Can you guys help me knowing what could be right way to go about it ?</p>",
        "id": 153893099,
        "sender_full_name": "Mritunjay Dubey",
        "timestamp": 1497008774
    },
    {
        "content": "<p>Condition.category is intended for this purpose</p>",
        "id": 153893109,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1497015559
    },
    {
        "content": "<p>so is the addition of PractitionerRole something that will be done in bulk? Or does each workgroup need to stumble upon that it is missing in their Resources and add specific CR for each?</p>",
        "id": 153893112,
        "sender_full_name": "John Moehrke",
        "timestamp": 1497015742
    },
    {
        "content": "<p>Workflow will shortly be updating the patterns and seeking feedback from all work groups.  (We're going to try to have a report available that shows deltas too.)  After feedback, we'll adjust the patterns, then ask work groups to review their resources for alignment as makes sense for each resource</p>",
        "id": 153893114,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1497015842
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Thanks for the help. I had one more question</p>\n<p>In our systems there are 4 states of a condition<br>\n1) When the condition was entered in system =&gt; active condition<br>\n2) Since conditions are present across visits, in our systems the doctor can just say, this visit is the follow-up of an existing condition. =&gt; follow-up condition<br>\n3) Once the patient is cured of that problem we can mark a condition as history-of conditions of patient. This means the condition is inactive right now but this is important to know that patient had this problem at some point of time.<br>\n4) Inactive conditions</p>\n<p>Is there a field which can accomodate these states ?</p>",
        "id": 153893712,
        "sender_full_name": "Mritunjay Dubey",
        "timestamp": 1497434422
    },
    {
        "content": "<p>Condition.category is 0..* and has an example binding, which means you can have other category codes if you'd like.<br>\nInactive conditions should be conveyed with the Condition.clinicalStatus = inactive (or resolved or remission if that distinction is known)</p>",
        "id": 153893722,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1497447286
    },
    {
        "content": "<p>Difference between \"in history\" and just \"inactive\" is handled by whether a Condition is included in a problem List instance.</p>",
        "id": 153893789,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1497457120
    }
]