[
    {
        "content": "<p>The Condition resource (<a href=\"https://www.hl7.org/fhir/condition.html\">https://www.hl7.org/fhir/condition.html</a>) opens by saying \" It can be used to record information about a disease/illness identified from application of clinical reasoning over the pathologic and pathophysiologic findings (diagnosis), or identification of health issues/situations that a practitioner considers harmful, potentially harmful and may be investigated and managed (problem), or other health issue/situation that may require ongoing monitoring and/or management (health issue/concern).\"</p>\n<p>I think it would be very useful to be able to distinguish which of those things it is - is it a diagnosis or a problem?<br>\nBut I'm not clear how to do that in the resource.</p>\n<p>The category field has the following two values;<br>\n<a href=\"https://www.hl7.org/fhir/valueset-condition-category.html#expansion\">https://www.hl7.org/fhir/valueset-condition-category.html#expansion</a><br>\nproblem-list-item and encounter-diagnosis.<br>\nBut my reading is that these are more to do with the way the data is treated than differentiating between types of condition (e.g. diabetes could be either category, depending on if it had just been diagnosed or was a long-term entry on a problem list). Could be wrong about this though?</p>\n<p>So my question is, how should I differentiate between a diagnosis and a problem (a condition that is not a diagnosis)</p>",
        "id": 241508550,
        "sender_full_name": "Jack Burnett",
        "timestamp": 1622797662
    },
    {
        "content": "<p>A Condition could indeed fall into multiple categories - that's intentional and in keeping with how existing systems work.  In many environments 'problem' is not mutually exclusive with 'diagnosis'.</p>",
        "id": 241540750,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622815919
    },
    {
        "content": "<p>Does that answer the question?   In HL7v2 the DG1 (Diagnosis) segment was part of the Financial Management chapter and as such has to do with billing (using coding system used for billing, e.g. ICD-9/ICD-10) whereas PRB (Problem Details) segment was part of Patient Care chapter, which has to do more with the management of the patient's problem(s), not the billing aspect of them.   Is there a similar dichotomy in the FHIR Condtion.category coding?</p>",
        "id": 241547784,
        "sender_full_name": "John Silva",
        "timestamp": 1622818664
    },
    {
        "content": "<p>The category codes aren't mandated.  So you could have categories that are used that way, but in the core spec, there's no expectation you necessarily would.  I think there's a bit more guidance - and an additional code - provided in US Core</p>",
        "id": 241550489,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622819739
    },
    {
        "content": "<p>Thanks, have looked at us-core;<br>\n<a href=\"https://www.hl7.org/fhir/us/core/StructureDefinition-us-core-condition.html\">https://www.hl7.org/fhir/us/core/StructureDefinition-us-core-condition.html</a><br>\nIt seems that by adding the third category they have mapped them to the three types (problem, diagnosis, concern).</p>\n<p>Perhaps we will also use the category code like us-core does (I suppose the alternative is adding an extension to convey this).</p>",
        "id": 241742958,
        "sender_full_name": "Jack Burnett",
        "timestamp": 1623053966
    },
    {
        "content": "<p>Interesting -- we just noticed that the Epic APIs require the additional category search parameter when searching on Conditions!<br>\nHere's the API documentation for health-concerns:  <a href=\"https://fhir.epic.com/Specifications?api=985\">https://fhir.epic.com/Specifications?api=985</a><br>\nand another for problem-list0item : <a href=\"https://fhir.epic.com/Specifications?api=953\">https://fhir.epic.com/Specifications?api=953</a>. (both based on USCDI)</p>",
        "id": 241851726,
        "sender_full_name": "John Silva",
        "timestamp": 1623106483
    },
    {
        "content": "<p>Hmm, from reading those epic APIs it looks like they are using the category more in the sense of being about where it's collected from rather than as a way of grouping codes</p>",
        "id": 241887749,
        "sender_full_name": "Jack Burnett",
        "timestamp": 1623142422
    }
]