[
    {
        "content": "<p>Hi guys, </p>\n<p>I've a question regarding the Condition resources in the US-Core profile.</p>\n<p>If the Clinical-Status and Verficatation-status is unknown,<br>\nwhat should be the value that needs to be added to the above attributes to be conformant with the US-Core Condition profile.</p>\n<p>Thanks in Advance</p>",
        "id": 264341821,
        "sender_full_name": "saran",
        "timestamp": 1639073267
    },
    {
        "content": "<p>According to HL7 a condition cannot exist without a known clinicalStatus (unless the verification status is entered-in-error).</p>",
        "id": 264358468,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1639080151
    },
    {
        "content": "<p>According to US Core General Guidance <a href=\"http://hl7.org/fhir/us/core/STU3.1.1/general-guidance.html#missing-data\">Missing Data</a>:</p>\n<blockquote>\n<p>For the following status elements no appropriate “unknown” concept code is available, therefore the element must be populated:<br>\n...<br>\n    Condition.clinicalStatus<br>\n...<br>\nIf one of these a status code is missing, a 404 http error code and an OperationOutcome SHALL be returned in response to a query for the resource.</p>\n</blockquote>",
        "id": 264361408,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1639081659
    },
    {
        "content": "<p>Sort of.  Technically, you can still specify a \"dataAbsentReason\" or some other extension and still satisfy the cardinality - but you may find challenges with interoperability if doing that.</p>",
        "id": 264361411,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639081660
    },
    {
        "content": "<p>Thanks everyone for these inputs.<br>\nSo in the below case, what would be the ideal fit to be conformant without having much Interoperability Challenges?<br>\nTo give a little bit background of the condition resource being implemented,<br>\nwe get the data from the Medicaid claims - the primary &amp; secondary diagnosis is being converted to the Condition Resource,<br>\nunfortunately we don't have a way to map the Clinical-Status or Verification-Status since that information is not present. (Would it be okay to deduce that the Clinical-Status was active and Verification-Status as confirmed for the Claims that are paid and adjudicated? - just a thought.)</p>",
        "id": 264370368,
        "sender_full_name": "saran",
        "timestamp": 1639085943
    },
    {
        "content": "<blockquote>\n<p>Would it be okay to deduce that the Clinical-Status was active and Verification-Status as confirmed for the Claims that are paid and adjudicated?</p>\n</blockquote>\n<p>I think it might depend on how the resource is going to be used. Maybe consult a lawyer?</p>",
        "id": 264371599,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1639086510
    },
    {
        "content": "<p>For example, wouldn't a claim be paid and adjudicated for services that result in the condition being ruled out? Or is that information present in the claim?</p>",
        "id": 264376044,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1639088590
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 264384304,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639093909
    },
    {
        "content": "<p>We took the same stance, since claims don't state clinical status or verification status of the diagnosis elements. We said, since the patient received treatment for the diagnosis we can assume that it's active (could be resolved in some cases). You could also take CMS guidance and NOT derive conditions from claims, making them just claim data not condition data. (I don't have the reference handy.)</p>",
        "id": 264443490,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1639141478
    },
    {
        "content": "<p>This was recently discussed in Patient Care as a result of <a href=\"#narrow/stream/294552-Patient-Care.20WG/topic/US.20Core.20Condition.20Status\">https://chat.fhir.org/#narrow/stream/294552-Patient-Care.20WG/topic/US.20Core.20Condition.20Status</a></p>\n<p>Specifically, Patient Care focused on the invariant that intentionally only required clinicalStatus for problem list items (<strong>not</strong> diagnoses).  This invariant had the claim use case in mind when updated in the base spec.</p>\n<blockquote>\n<p>con-3: Condition.clinicalStatus SHALL be present if verificationStatus is not entered-in-error <strong>and category is problem-list-item</strong> (: clinicalStatus.exists() or verificationStatus.coding.where(system='<a href=\"http://terminology.hl7.org/CodeSystem/condition-ver-status\">http://terminology.hl7.org/CodeSystem/condition-ver-status</a>' and code = 'entered-in-error').exists() or category.select($this='problem-list-item').empty())</p>\n</blockquote>\n<p>As such, Patient Care felt that US Core should update their textual guidance (e.g. <a href=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-condition.html#mandatory-and-must-support-data-elements\">http://hl7.org/fhir/us/core/StructureDefinition-us-core-condition.html#mandatory-and-must-support-data-elements</a>) to be more consistent with the underlying invariant.</p>\n<blockquote>\n<p>The status element has the following constraints: SHALL be present if verification status is not entered-in-error and SHALL NOT be present if verification Status is entered-in-error.</p>\n</blockquote>",
        "id": 264648036,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1639349178
    },
    {
        "content": "<p>In sum, Patient Care doesn't endorse defaulting or inserting values for clinicalStatus since the field should have cardinality 0..1 and con-3 invariant isn't applicable for non-problem list items, like encounter diagnoses.</p>",
        "id": 264648107,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1639349305
    },
    {
        "content": "<p>This really helps, Thank you for providing a clarity to this.</p>",
        "id": 264764501,
        "sender_full_name": "saran",
        "timestamp": 1639426883
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Condtion.20Resource/near/264361411\">said</a>:</p>\n<blockquote>\n<p>Sort of.  Technically, you can still specify a \"dataAbsentReason\" or some other extension and still satisfy the cardinality - but you may find challenges with interoperability if doing that.</p>\n</blockquote>\n<p>That is not how we understand it for this conditionally <em>required</em>  binding and the guidance there is normative.</p>",
        "id": 264771713,
        "sender_full_name": "Eric Haas",
        "timestamp": 1639430557
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  can post ballot comment against US Core?</p>",
        "id": 264771938,
        "sender_full_name": "Eric Haas",
        "timestamp": 1639430663
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  Sure thing, logged as <a href=\"http://jira.hl7.org/browse/FHIR-34468\">J#34468</a></p>",
        "id": 264781758,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1639435500
    }
]