[
    {
        "content": "<p>Patient Care is discussing the Condition criticality extension and would like to know if any implementers are using it.  <br>\nFor context, the discussion started due to <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13004\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13004\">GF#13004</a> (missing binding to value set), but led into a much larger discussion of whether this extension should be removed.</p>",
        "id": 153879606,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1490308958
    },
    {
        "content": "<p>(cross posting from Cancer-DTR stream)<br>\nI'm trying to sort out Grade and Stage (in the context of oncology) in relation to Condition.severity and the concept of Criticality that appears in AllergyIntolerance and as an extension in Condition. Working definitions:<br>\nSeverity is the degree of harshness or extent of a symptom, disorder, or problem.<br>\nCriticality is potential clinical harm associated with a condition. (Some conditions may be relatively severe, but not critical, such as severe hot flashes.)<br>\nStage is the relative advancement in the course of an disease.<br>\nGrade represents the clinical significance (e.g., 1 = mild not requiring intervention; 2 = moderate, typically requiring non-invasive intervention, 3 = severe but not life-threatening, indicating hospitalization and impacting activities of daily living, 4 is life-threatening requiring immediate intervention, 5 is death)<br>\nMy question is, is Grade synonymous with Severity or Criticality? For hot flashes, CTCAE lists Grade 1, 2, and 3, but not 4 or 5, since people don't die from hot flashes. Grade 3 cites \"severe [hot flash] symptoms\". Therefore, I conclude Grade aligns more with Criticality, not Severity. Is that correct?</p>",
        "id": 153894873,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1498082032
    },
    {
        "content": "<p>The question, to me, is rather, whether there will be the concepts of severity and criticality at the same time within the same resource.<br>\nSince, in your example, CTCAE only has grade, and grade is (imho) a mix-up of both concepts, why constrain severity out and add an extension?</p>",
        "id": 153894908,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1498113053
    },
    {
        "content": "<p>The Condition criticality extension (in STU3) has since been removed per <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13004\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13004\">GF#13004</a> because it wasn't describing an attribute of a specific condition.  Patient Care felt that what <em>was</em> being described should instead be represented as an Observation of the patient's \"medical state\" or \"patient status\", which can be used in an ED workflow to triage patients.</p>\n<p>Thus, going forward, there is only the Condition.severity = A subjective assessment of the severity of the condition as evaluated by the clinician</p>",
        "id": 153894976,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1498151093
    },
    {
        "content": "<p>Patient Care briefly discussed \"grade\" today during our conference call and we don't believe that severity should be used for grade.  Condition.code can be precoordinated with severity.  Grade is pathology and is more objective versus severity is more subjective.  Patient Care recommends logging a tracker for a proposed change to add grade.</p>",
        "id": 153895037,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1498170256
    }
]