[
    {
        "content": "<p>Consider in oncology where there is diagnosis stage and pathological stage of a patient's problem. The Condition FHIR resource has one stage. So would this be best represented as two Condition resources for the patient, one with a category of 'diagnosis', and the other with a category of 'pathological' (adding that item to the condition-category valueset)?</p>",
        "id": 153834485,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1466696826
    },
    {
        "content": "<p>I think the existing \"stage\" element represents that diagnosis stage.  Pathological stage would be an extension.</p>",
        "id": 153834725,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1466736251
    },
    {
        "content": "<p>to me cancer staging feels almost like an observation...</p>",
        "id": 153834780,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1466755516
    },
    {
        "content": "<p>like a GCS or Apgar score its made up of componenents then has a value \"I, IIa, IIb, III, IV\" etc</p>",
        "id": 153834781,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1466755573
    },
    {
        "content": "<p>and for the same cancer there can be different competing (or evolving) stage classifications</p>",
        "id": 153834782,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1466755622
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192001\">@Erich Schulz</span>  According to analysts I spoke to, staging is semantically part of the patient's condition.</p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> what would the semantics behind category mean (considering one of the items in the valueset is 'diagnosis')?</p>",
        "id": 153846785,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1473363843
    },
    {
        "content": "<p>One idea is to make a condition 0-* stage, and add to stage a category or kind.</p>",
        "id": 153846786,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1473364508
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191782\">@Brian Kaney</span> I think stage and category are very different things.  Would it ever make sense to state a condition and convey both the diagnosis stage and the pathological stage?  Could you give an example or two?</p>\n<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Condition is a special sort of Observation - the stage, the severity, the verification status, etc. could all be considered observations, but it makes sense to group them all in Condition because in the end, it's really a single statement - \"confirmed severe stage 3 whatever\"</p>",
        "id": 153846795,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473366911
    },
    {
        "content": "<p>forwading to <span class=\"user-mention\" data-user-id=\"192001\">@Erich Schulz</span> </p>",
        "id": 153846799,
        "sender_full_name": "Eric Haas",
        "timestamp": 1473367957
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> The proposal would be to allow a Condition to have multiple Stagings, each with a kind. Our analyst listed a few, 'clinical', 'pathologic', 'recurrent', etc.</p>",
        "id": 153846800,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1473368101
    },
    {
        "content": "<p>That could work.  Feel free to submit the change proposal</p>",
        "id": 153846813,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473370300
    },
    {
        "content": "<p>Hey, all -- as one of the analysts <span class=\"user-mention\" data-user-id=\"191782\">@Brian Kaney</span> spoke to, some thoughts:<br>\n(ah - straight return submits a comment; good to know ... )<br>\n1. \"Staging\" could be an observation; is currently in Condition, and could leave it there just fine.<br>\n2. For sending complete info in oncology, could easily have a Stage at Diagnosis, a Clinical Stage, and a Pathologic Stage:<br>\nPt examined by Provider A; Provider A determines (clinically/pre-surgically) Stage IIA Breast Cancer.<br>\nTime passes (life happens); Pt examined again, new clinical stage = IIB.<br>\nSurgery happens.<br>\nPathologist looks at surgical specimen, nodes, etc., determines Pathologic tumor &amp; node classifications that result in Pathologic stage IIIA.<br>\nThree stages, one pt., all changes plausible.</p>",
        "id": 153847392,
        "sender_full_name": "Thomas Wicker",
        "timestamp": 1473960493
    }
]