[
    {
        "content": "<p>I am looking for guidance on the appropriate resource to use for the patient reported signs and symptoms (including chief complaint) - which would constitute the \"Subjective\" section of a SOAP note. The resourceguide page of the specification (<a href=\"https://www.hl7.org/fhir/resourceguide.html\">https://www.hl7.org/fhir/resourceguide.html</a>) states Condition as the resource for these but the \"Boundaries and Relationships\" section of the Condition resource page (<a href=\"http://hl7.org/fhir/R4/condition.html\">http://hl7.org/fhir/R4/condition.html</a>) appears to contradict this. How has the community been implementing these?</p>",
        "id": 197372481,
        "sender_full_name": "Amrit",
        "timestamp": 1589350687
    },
    {
        "content": "<p>IMHO Observations are mostly O, but could be S. Conditions are kind of a A summary/conclusion based on O and S. That's why Condtion has a 'evidence' reference to Observation.</p>",
        "id": 197372650,
        "sender_full_name": "René Spronk",
        "timestamp": 1589350959
    },
    {
        "content": "<p>We had this recently: patient is addicted to alcohol = condition. Patient is drinking or has alcohol in blood = observation<br>\n<a href=\"#narrow/stream/179166-implementers/topic/Addiction\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Addiction</a></p>",
        "id": 197372744,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589351046
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 197445367,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589389980
    },
    {
        "content": "<p>Thanks for the responses. I will go ahead and build Observation for complaints and symptoms. I strongly feel that the FHIR documentation should be updated to uniformly reflect one choice or the other, otherwise different parties may end up implementing this in different ways. (And newer people would most likely look at the resourceguide page first because it is part of the certification reading list.)</p>",
        "id": 197523472,
        "sender_full_name": "Amrit",
        "timestamp": 1589445027
    },
    {
        "content": "<p>The reality is that systems will actually capture this in multiple places.  Sometimes something is considered a complaint/symptom, sometimes it's considered a diagnosis.  So it's best to search for it in both Observation and Condition.</p>",
        "id": 197554274,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589463263
    }
]