[
    {
        "content": "<p>Hi all, is it necessary to capture the date of diagnosis in the past medical history of a patient?</p>",
        "id": 153884978,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1492520074
    },
    {
        "content": "<p>Assuming you are asking about the Condition resource, the elements for both assertedDate and onset have cardinality of 0..1, which means they are both optional.</p>",
        "id": 153884980,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1492521333
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>   Ok Thank You</p>",
        "id": 153884983,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1492521692
    },
    {
        "content": "<p>Hi all, may I know the purpose of each extension in the resource condition? For instance, if a patient is ill, there may be many possible reasons for  his/her illness. Which extension shall I use to list out all the possible reasons? Also,  which extension should be used to list out the causes of illness which are incorrect? Thank you</p>",
        "id": 153894307,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1497853101
    },
    {
        "content": "<p>The HL7 extensions are summarized here:  <a href=\"http://build.fhir.org/condition-extensions.html\" target=\"_blank\" title=\"http://build.fhir.org/condition-extensions.html\">http://build.fhir.org/condition-extensions.html</a><br>\nThe relevant ones for your consideration would be:</p>\n<ul>\n<li>\"dueTo\" used to convey what caused or triggered the Condition (but there isn't a degree of certainty to convey \"possible\" or \"ruled out\")</li>\n<li>\"occurredFollowing\"  used to convey what preceded the Condition (no causality implied)<br>\nOf course, there is always the possibility that these reasons were part of the Condition.note (annotation) and not fully codified and structured, which is why dueTo and occurredFollowing are extensions.</li>\n</ul>",
        "id": 153894952,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1498138278
    },
    {
        "content": "<p>Patient Care discussed this today and wanted to clarify the intent of the original question, <span class=\"user-mention\" data-user-id=\"193568\">@Pranitha Sruthi</span> <br>\nAre you asking about the Condition.verificationStatus with possible values of Differential or Refuted?<br>\nOr, are you asking about the reason for the condition, such as whether pneumonia was caused by bacteria or a virus?</p>",
        "id": 153895039,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1498170931
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  I'm not asking about the condition.verficationStatus. It's the second case. Which extension can be used  to sort out all the possible reasons for a particular condition or illness (differential diagnosis) ? Thank you</p>",
        "id": 153895064,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1498209415
    },
    {
        "content": "<p>The Condition \"dueTo\" HL7 extension can be used to reference what caused the condition, but it doesn't include a degree of certainty (e.g. \"possible reason\").  As such, if you need that degree of certainty, then you may need to create your own extension.  Otherwise, other systems may simply capture that information using the Condition.note.text.</p>",
        "id": 153895067,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1498223107
    }
]