[
    {
        "content": "<p>Our Problem/Diagnosis model (which matches the FHIR <code>Condition</code> element) has 2 data elements for notes: one for general comments akin to the <code>note</code> element in <code>Condition</code> and another which is specifically for capturing the clinical description of the condition.  The latter is by far the more important, but there is no apparent match in the <code>Condition</code> resource.  We could map both data elements to <code>Condition.note</code>, but that doesn't feel right.  We could add an extension, but for something that could contain signficant clincial information that shouldn't be ignored, that would not seem to be a safe choice.  The other thought was to map it to <code>Condition.stage.assessment.as(ClinicalImpression).description</code>, but that would appear to be quite a stretch.  Anyone got any suggestions?</p>",
        "id": 153841590,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469756758
    },
    {
        "content": "<p>One thought was to create a slice of <code>Condition.note</code>, but making that unique from the other instances would be challenging, what discriminator(s) we'd use.</p>",
        "id": 153841592,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469757479
    },
    {
        "content": "<p>Did you look at Condition.code.text?</p>",
        "id": 153841596,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469760127
    },
    {
        "content": "<p>Oh?  We are using <code>Condition.code</code> for the Problem/Diagnosis Identification (type) as a code.  Are you suggesting that the text component of the code can contain more comprehensive information than just a display name?</p>",
        "id": 153841597,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469760246
    },
    {
        "content": "<p>It represents the full human description of the concept that is then encoded in the coding.  It could be just the display name of what the human selected.  But if the human typed a bunch of text and then picked the appropriate code (or someone else picked the appropriate code), Condition.code.text would be appropriate.</p>",
        "id": 153841598,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469760336
    },
    {
        "content": "<p>Suite! <img alt=\":grin:\" class=\"emoji\" src=\"static/third/gemoji/images/emoji/grin.png\" title=\":grin:\"> </p>",
        "id": 153841599,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469760380
    },
    {
        "content": "<p>How can we put that into a profile?</p>",
        "id": 153841600,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469760547
    },
    {
        "content": "<p>Hmmm .. this may not work in general. <img alt=\":disappointed:\" class=\"emoji\" src=\"static/third/gemoji/images/emoji/disappointed.png\" title=\":disappointed:\"> </p>",
        "id": 153841606,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469766656
    },
    {
        "content": "<p>There are at least 2 possible problems with using <code>Condition.code.text</code>:</p>",
        "id": 153841607,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469766702
    },
    {
        "content": "<p>1. <code>Condition.code</code> classifies the condition, but if the user were to type in a free text classification (_not_ decsription) then there's nowhere to  put the description.</p>",
        "id": 153841608,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469766764
    },
    {
        "content": "<p>2. The clincial description we envisage here is _much_ fuller than just a description of the chosen code.  It might include a discussion of the presenting symptoms, relevant past history, &amp;c. i.e. it's really a full clinical synopsis of the condition.  In v3 speak, it would be equivalent to <code>Observation.text</code>.</p>",
        "id": 153841609,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469766968
    },
    {
        "content": "<p>it sounds like the narrative for the resource</p>",
        "id": 153841615,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469769069
    },
    {
        "content": "<p>That did cross our minds, but we don't think it is.  It's more like <code>Condition.note</code> with the scope constrained to describing the  condition.  We wouldn't, for instance, expect that it would contain information that could be expressed in other ways, such onset/abatement dates, severity, etc. (although with narrative those things might be needed to support language flow).  Also, we figured that the data in the narrative still had to have a home in the structure (unlike CDA), but perhaps we're wrong about that.  If it were the narrative, can we map to <code>Condition.text</code>?  And how would you handle the fact that the narrative would contain other data derived from the structure that is not part of the clinical description.</p>",
        "id": 153841617,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1469770775
    }
]