[
    {
        "content": "<p>I have the following problem: When trying to populate the <code>active</code> element in a Patient resource, which is an entry in a Bundle, my tool (integration engine operating on the JSON schema for Bundle) errors due to a data type mismatch.</p>\n<p>After some debugging, I found the cause of the problem:<br>\nAll resources that have an <code>active</code> attribute use data type <code>boolean</code>, except for one: Account.<br>\nAccount uses active with data type <code>Period</code>. Apparently the schema can't differentiate between these attributes, since Bundle.entry.resource is just an enumeration of all attributes of all resources. So the tool just picks the first <code>active</code> element it can find, which happens to be the one in Account.</p>\n<p>Is that an issue that needs to be handled by the tool, or do we need to pay attention when building the spec to avoid such conflicts?</p>",
        "id": 153927603,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1515069839
    },
    {
        "content": "<p>I suppose the problem occurs when using generic JSON path language, because  Bundle.entry.resource.active can't differentiate by resource type...</p>",
        "id": 153927605,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1515072773
    },
    {
        "content": "<p>Sounds like a limitation of the tooling/path language.  It's certainly not something we would consider changing the models for - the same name in different contexts can mean very different things and can certainly have different data types.</p>",
        "id": 153927610,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515079992
    },
    {
        "content": "<p>I'm not sure. I'll talk to the JSON schema tooling guys when I meet with them in a couple of months</p>",
        "id": 153927676,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515099090
    },
    {
        "content": "<p>you should be able to cast to the type that you're interested in though</p>",
        "id": 153927830,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1515193885
    },
    {
        "content": "<p>(assuming FHIRPATH)</p>",
        "id": 153927831,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1515193901
    }
]