[
    {
        "content": "<p>Hi, I am an experienced programmer, but I am new to this topic, so I need some basic advice to get things going.</p>\n<p>So far I got, in paper, some sketchy project specs where I read that <em>somehow</em> it shoud be possible to use FHIR and/or HL7 through either Web-Technology (JSON) or the MLLC protocol to query patient and location data. </p>\n<p>First question: is this possible using HL7 or FHIR at all? I read a lot about HL7 which shows its use to \"push\" messages from a server, saying that, for instance, patient x was given treatment y at location z, but found no clues that retrieving, for instance, a list of all patients or a list of all locations was part of the standard. For the project to function I'd need kind of a \"pull\" interface so I can specify what data I need. I found no trace of such an interface so far, did I miss something?</p>\n<p>I did also spent almost a week now trying to find detailed specs for this \"interface\" from a network perspective. Things like IP ports, authentifcation  required, data encryption, in other words the basics required to connect to any server service and query some data. Where is, in technical terms, any documentation for all levels above OSI level 7? Is this standardized in HL7/FHIR at all?</p>\n<p>As soon as the bytes keep dropping in I think I am on safe ground, since there is plenty of information around concerning the individual data structures. </p>\n<p>Thanks very much for your help,</p>\n<p>Armin.</p>",
        "id": 267864765,
        "sender_full_name": "Armin Linder",
        "timestamp": 1642078745
    },
    {
        "content": "<p>FHIR specifies the API methods and the constructs with which it operates. \"You shall have a /Encounter endpoint\", \"The encounter endpoint shall accept these params\", \"The encounter endpoint shall return data in this format (Encounter Resource)\".<br>\nThings around security of your data is defined in other specs like HIPPA and HI-TECH. <br>\nTypically a FHIR server will be on https (port 443) and will expect an oauth token to prove access (US, bound by interoperability rules). But the server doesn't have to, the server controls its security in a manner they want to.<br>\nIf you are not bound by other regulations then you are free to host your FHIR server on any port using any security (or none at all if that's legal for you).</p>",
        "id": 267867900,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1642080446
    },
    {
        "content": "<p>Armin. Your \"First question\" is about HL7 messaging. Which there are three different protocols that have been defined by HL7 over the years. V2 is uses the \"MLLP\" network protocol and a byte encoding. V3 uses mostly SOAP network protocol and XML. FHIR is the newest, that is a data model that leverages json and xml encoding, and is designed with RESTful principles. I say designed with RESTful principles, because FHIR can be used in multiple different ways including \"Messaging\", \"Documents\", \"Operations\", and  http REST.</p>",
        "id": 267868831,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642080958
    },
    {
        "content": "<p>did you read the executive overview within the FHIR specification?<br>\n<a href=\"https://hl7.org/fhir/summary.html\">https://hl7.org/fhir/summary.html</a></p>",
        "id": 267868907,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642080976
    },
    {
        "content": "<p>Thanks for your helpful input. </p>\n<p>The long and the short of it seems (to me), that neither HL7 nor FHIR goes beyond OSI level 7, so any kind of transport two parties agree upon may be used [as long as it does not violate common security standards, of course]. </p>\n<p>Furthermore it seems that neither HL7 nor FHIR specifies any query language nor any network communication protocols, they both cover only specifications of data formats for objects.</p>\n<p>Right?</p>",
        "id": 267873431,
        "sender_full_name": "Armin Linder",
        "timestamp": 1642083055
    },
    {
        "content": "<p>no exactly. no</p>",
        "id": 267873939,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642083268
    },
    {
        "content": "<p>FHIR - when using http REST, there both a transport and a very strong query language -- <a href=\"https://hl7.org/fhir/http.html\">https://hl7.org/fhir/http.html</a></p>",
        "id": 267874038,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642083319
    },
    {
        "content": "<p>Note that FHIR \"core\" is just the definition of the Resources... Around the core are many Implementation Guides. Implementation Guides take a use-case and constrain the standards for that use-case.</p>",
        "id": 267874178,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642083374
    },
    {
        "content": "<p>There are Security and Privacy Implementation Guides <a href=\"https://hl7.org/fhir/secpriv-module.html\">https://hl7.org/fhir/secpriv-module.html</a></p>",
        "id": 267874226,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642083401
    },
    {
        "content": "<p>And HL7v2 messages have two defined wire protocols in common use, MLLP (over TCP), and HL7 over HTTP. Both can support TLS.</p>",
        "id": 267880800,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1642086213
    },
    {
        "content": "<p>Returning to your original question, it is possible to query using FHIR V2 and MLLP. The details are in the V2 specification (don’t recall the chapter), but luckily IHE has extracted and standardized the parts into their PLQ (Patient Location Tracking) profile, which can be found <a href=\"https://www.ihe.net/resources/technical_frameworks/\">https://www.ihe.net/resources/technical_frameworks/</a>. </p>\n<p>HL7 FHIR also can be used to query for location. The trick would be that neither Location nor Patient refer directly to each other, so you’d need to devise a query that uses a linking resource like Encounter. </p>\n<p>As for standardizing on ports, etc. No, there’s no standard because many systems will have multiple ports with multiple settings available to serve different capabilities to different clients.  For V2, each company making a product should have an Interface Specification document that details how they implement the spec, and how ports, etc can be configured. Then you need to talk to the actual customer to find out which of the ways their vendor allows, they have actually chosen to do. For FHIR, similar information Is available from the /metadata endpoint, but getting there does mean you need to know the rest of the URL.</p>",
        "id": 267891284,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1642090559
    },
    {
        "content": "<p>With FHIR, the 'traditional' HTTP and HTTPS ports will most commonly be used, but for a variety of technical reasons, some servers much listen on other ports.  (The same is true for any HTTP connection - you can specify a port when you hit an address with your browser.  However typically, everyone uses the default one because needing to specify a port number is annoying.  With v2, there's no \"standard\" port.  (In fact, I believe that TCP/IP hadn't even been landed on as the defacto networking protocol at the time HL7 was introduced.)</p>",
        "id": 267909920,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642098238
    }
]