[
    {
        "content": "<p>Welcome to the stream to support the patient track at Connectathon 12</p>",
        "id": 153824940,
        "sender_full_name": "David Hay",
        "timestamp": 1462617272
    },
    {
        "content": "<p>When a server receives a Patient Create interaction, and determines that the POSTed payload matches an existing patient - if the server opts to interpret the create as an update (i.e. sort of like a server-side conditional create), should the server return 200-success (as is appropriate for an update) or 201-created (as appropriate for a create).</p>",
        "id": 153825127,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1462634716
    },
    {
        "content": "<p>is there any circumstance under which the difference matters to a client? </p>",
        "id": 153825190,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462640124
    },
    {
        "content": "<p>Hard to imagine why it would...</p>",
        "id": 153825193,
        "sender_full_name": "David Hay",
        "timestamp": 1462641331
    },
    {
        "content": "<p>I suppose it might matter if the client knows that the two patients are \"known non-duplicates\" (i.e. twins with similar names).  In that case, a 200 would indicate that the server may have not been smart enough to recognize a known non-duplicate.  Though instead of addressing that via HTTP status codes, the solution to that problem may be allowing clients to indicate known non-dups via an included reference</p>",
        "id": 153825197,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1462641785
    },
    {
        "content": "<p>once you've got to this point, you need to stop thinking about the RESTful operations and start thinking about choreography and the $match operation</p>",
        "id": 153825198,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462641869
    },
    {
        "content": "<p>Hi guys - didn't hear too much from you so assume all went well! Would be great to have a quick update on progress (perhaps just a comment on this chat)  - and is there anyone who would like to present tomorrow? We'll have time for one only I'm afraid...</p>",
        "id": 153825385,
        "sender_full_name": "David Hay",
        "timestamp": 1462656341
    },
    {
        "content": "<p>Does anyone have anything they particularly want to present? Given that these are relatively simple use cases, I'm thinking that we let some of the other tracks have the time...</p>",
        "id": 153825511,
        "sender_full_name": "David Hay",
        "timestamp": 1462715339
    },
    {
        "content": "<p>And does anyone have anything in particular that they wish me to talk about in my Track Lead preso?</p>",
        "id": 153825513,
        "sender_full_name": "David Hay",
        "timestamp": 1462715382
    }
]