[
    {
        "content": "<p>I am looking for a possibility to connect a person to an organization similarly to how a person is connected to a patient using RelatedPerson. We need this to model persons who are employed by an organization without them being health personnel. For example, lawyers, employees in insurance companies, embassies or the directorate of health. There is a possibility to add a contact on the organization but then you will have to maintain all information about this person manually, so this is not useful. </p>\n<p>Is there a profile we can use to connect a person to an organization?</p>",
        "id": 164160064,
        "sender_full_name": "Ellen Gregusson",
        "timestamp": 1556189554
    },
    {
        "content": "<p>Lawyers, etc. are all Practitioners.</p>",
        "id": 164173328,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556201468
    },
    {
        "content": "<p>Anyone who is acting in their professional capacity - whether a 'clinician' or not is a Practitioner.  So the linkage to Organization is through PractitionerRole</p>",
        "id": 164173387,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556201507
    },
    {
        "content": "<p>\"Person\" is <em>never</em> an actor in FHIR.  It's only used to link between Patients, Practitioners and RelatedPersons</p>",
        "id": 164173475,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556201538
    },
    {
        "content": "<p>When I look at PractitionerRole the listed values for Code and Speciality are health care related. Are you planning on using other codesets for these values in order to use PractitionerRole for non-health care related persons?</p>\n<p>We need to be able to separate health care practitioners from other practitioners. How do we best get this distinction?</p>\n<p>We were thinking of using \"Person\" in the same way as for RelatedPerson by for example creating a new object for ConnectedPerson which can have information about the relationship between the person and the organization. We just need information about the relationship and do not need to have information about qualifications for the person. The use of Practitioner and PractitionerRole seems to require a lot more information than what we need and will make it hard for us to distinguish health care persons from administrative employees.</p>\n<p>Is there any possibility that a ConnectedPerson or a similar object could be created in order to keep track of non-health personnel?</p>",
        "id": 164243777,
        "sender_full_name": "Ellen Gregusson",
        "timestamp": 1556268563
    },
    {
        "content": "<p>Person isn't linked to any resource as an actor - they can't perform, author or be the subject of anything.  We don't have good terminologies for things like receptionists, taxi drivers, etc. - which is why the binding is extensible.  That said, you're free to propose enhancements to the code systems in use.  If you need to separate health care practitioners from others, first you'll need to figure out what that means - does it include nursing assistants?  dental technicians?  Physio therapists?  Massage therapists?  An EMT whose contracted to drive patients from hospital to hospital?  There isn't necessarily a clean dividing line.  If a dividing line exists, it's often tied to state/provincial/territorial regulation that enumerates specific license types - and you can use those same license types from Practitioner to make your division.  Alternatively, you could use an extension.  However, using Person for anything other than maintaining common demographics across Patient/Practitioner/RelatedPerson instances would be inappropriate.</p>",
        "id": 164265727,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556288422
    },
    {
        "content": "<p>Is it possible to add an object like RelatedPerson which can be used to make a link between a person and an organization in the same way as RelatedPerson is making a link between a person and a patient?</p>",
        "id": 164268077,
        "sender_full_name": "Ellen Gregusson",
        "timestamp": 1556290012
    },
    {
        "content": "<p>RelatedPerson doesn't link a Person and a Patient.  Typically there won't be a Person.  RelatedPerson simply indicates person who acts on behalf of their relationship with the Patient (friend, relative, neighbor, etc.).   A relationship between Person and Organization would have to be a relationship that spanned all of that Person's roles (as Patient, Practitioner and/or RelatedPerson).  What sort of relationship do you have in mind?</p>",
        "id": 164269861,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556291089
    },
    {
        "content": "<p>The relationship we have in mind in the first place is employee.</p>",
        "id": 164528406,
        "sender_full_name": "Ellen Gregusson",
        "timestamp": 1556621141
    },
    {
        "content": "<p>Maybe we could make an object similar to ConnectedPerson which is not related to Person but which is made in order to show a relationship with an Organization?</p>",
        "id": 164528576,
        "sender_full_name": "Ellen Gregusson",
        "timestamp": 1556621328
    },
    {
        "content": "<p>If you are talking about employees in the wider context of medicine: these should be represented in Practitioner resources, as Lloyd pointed out.<br>\nThat includes not only doctors and nurses, but also all other kinds of staff, like house keepers, system administrators, administrative people etc.</p>\n<p>See <a href=\"https://www.hl7.org/fhir/practitioner.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/practitioner.html\">https://www.hl7.org/fhir/practitioner.html</a> :<br>\n\"Practitioners include (but are not limited to): <br>\n[...]<br>\n- receptionists handling patient registration<br>\n- IT personnel merging or unmerging patient records<br>\n- Service animal (e.g., ward assigned dog capable of detecting cancer in patients)\"</p>\n<p>To connect these to an organization, PractitionerRole is what you are looking for. You are free to fill PractitionerRole.code with codings for all roles you might imagine.</p>",
        "id": 164530520,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1556623666
    },
    {
        "content": "<p>You might look at the three types of individuals that are defined in FHIR as:<br>\n- the type of person why all this is happening (Patient)<br>\n- the non-professional type of person who support these for various reasons/in various ways (RelatedPerson)<br>\n- the professional type of person who act on or for the patient, be it the treatment of a disease or keeping the floor of the room clean (Practitioner)</p>",
        "id": 164531036,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1556624196
    },
    {
        "content": "<p>What we need is to register for example lawyers who are helping people get the reimbursements they need from the government. We need employees in embassies handling cases for Norwegians needing health care outside Norway, and we need employees in insurance companies that should be reimbursed for the payment they have made to their customer. These people are not employed by health care institutions, they are not health care personnel and we do not need to know anything about their qualifications. All we need to know is that they are employed by a given organization.</p>",
        "id": 164539668,
        "sender_full_name": "Ellen Gregusson",
        "timestamp": 1556631766
    },
    {
        "content": "<p>A lawyer is a Practitioner in FHIR</p>",
        "id": 164543981,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556634923
    },
    {
        "content": "<p>A practitioner is someone who is acting in their professional capacity, independent of any personal relationship (relation, friend, neighbor) with a patient.</p>",
        "id": 164544067,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556634976
    },
    {
        "content": "<p>A Person <em>can't</em> ever be an actor in FHIR - all relationships from other resources must point to Patient, Practitioner or RelatedPerson.  The sole purpose of Person is to maintain shared demographics that span multiple Patient/Practitioner/RelatedPerson instances.</p>",
        "id": 164544148,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556635041
    },
    {
        "content": "<p>I think that's a common misconception, maybe especially with non-native English speakers. It also took me a moment to get it.<br>\nThe primary translation of \"practitioner\" is often the equivalent of \"medical doctor\". But the meaning of \"practitioner\" also includes \"(any professional) expert\".</p>",
        "id": 164544346,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1556635200
    },
    {
        "content": "<p>Also: while the lawyers, or embassy employees are not employed at a medical organization, they still fulfill a role in the (administrative|financial|medical) proceedings of a patient or a medical organization.</p>\n<p>Basically, even a car dealer selling ambulance coaches would be represented as a Practitioner in FHIR.</p>",
        "id": 164544880,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1556635530
    },
    {
        "content": "<p>As would a cab driver or elevator repair person.</p>",
        "id": 164544991,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556635596
    },
    {
        "content": "<p>OK. <br>\nHow do I then easily find if a practitioner is health personnel or not? We have more than 30 qualification types which are health personnel. A lot of functionality in our solutions is only available to health personnel so we need to be able to separate them from other employees easily.</p>",
        "id": 164547237,
        "sender_full_name": "Ellen Gregusson",
        "timestamp": 1556637148
    },
    {
        "content": "<p>Use PractitionerRole.code or Practitioner.qualification.code - with  a coding system with only two code 'health personnel', 'not health personnel' (or even just one - and if it is missing it means the other one)</p>",
        "id": 164548057,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1556637708
    },
    {
        "content": "<p>The notion of what constitutes a \"healthcare practitioner\" is highly variable and driven by jurisdiction-specific regulations and/or organizational policy.   Agree that <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>'s solution is reasonable.  The alternatives would be to use an extension or to infer whether someone is considered a \"healthcare\" practitioner by looking at what other qualifications they have (e.g. if a practitioner has one of these 30 license qualifications, they're considered a health care practitioner).</p>",
        "id": 164549974,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556639217
    },
    {
        "content": "<p>I agree with Lloyd. You probably need these 30 healthcare qualifications for other purposes, so either filter on these or for the ease of implementation introduce something like a \"class\" extension with two codes</p>",
        "id": 164572075,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1556654850
    },
    {
        "content": "<p>Both PractitionerRole.code and Practitioner.qualification.code are CodeableConcept - they can hold both the complete healthcare qualification and the special 'health personnel' code at the same time in two different codings, no extension needed</p>",
        "id": 164572343,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1556655012
    },
    {
        "content": "<p>In this case you can also have multiple qualifications and multiple PractitionerRole.code repetitions, so you can choose to treat it as a distinct qualification/role or as a translation for one of the qualifications/roles already listed</p>",
        "id": 164574426,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556656545
    },
    {
        "content": "<p>Right, no extension needed. Putting it into two different codings within the same qualification/code seems a bit like overstraining the idea of synonyms to me. So I would probably go with multiple PR.code / P.qualification</p>",
        "id": 164575343,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1556657319
    },
    {
        "content": "<p>Wow -- that is a strange notion from a human communication perspective (a cabbie is a Practitioner?).  It might make sense for FHIR experts but doesn't make sense from a normal human conceptual basis.  Now I understand why this question about Practitioner is causing confusion.   I too only thought of a Practitioner as a 'medical professional' not anyone who happens to show up at the hospital, especially if not employed by the hospital.   The dictionary definition is something that would lean most people to this 'common sense' definition:</p>\n<p>a person actively engaged in an art, discipline, or profession, especially medicine.</p>",
        "id": 164597358,
        "sender_full_name": "John Silva",
        "timestamp": 1556682115
    },
    {
        "content": "<p>Do you have a suggestion for alternative name that would be clearer?</p>",
        "id": 164597665,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556682580
    },
    {
        "content": "<p>The v3 equivalent is AssignedEntity - but that's intuitive to pretty-much no-one...</p>",
        "id": 164597719,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556682621
    },
    {
        "content": "<p>Actor and ActorRole?<br>\nI think that \"Actor\" is different to but no better than \"Practitioner\".</p>",
        "id": 164600064,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1556686298
    },
    {
        "content": "<p>Patients and RelatedPersons are actors too.</p>",
        "id": 164600682,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556687226
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span> ping</p>",
        "id": 165159962,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1557320214
    },
    {
        "content": "<p>If we have to use Practitioner, is there a possibility that we can have two practitioner profiles existing at the same time? One practitioner profile for health personnel and one profile for non-health personnel? We would then need to have two profiles also for PractitionerRole.</p>",
        "id": 167001333,
        "sender_full_name": "Ellen Gregusson",
        "timestamp": 1559312737
    },
    {
        "content": "<p>You can have as many profiles as you like against whatever resources you wish :)</p>",
        "id": 167004105,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559314793
    }
]