[
    {
        "content": "<p>Hi @<strong>Lloyd</strong>  , I am trying to understand Consent constraints applied through provision element. We have following scenarios which I am trying to map in Consent resource:<br>\n1.  Patient giving consent to access their Lab, Rad and Transcribed  documents<br>\n2.  Patient giving access to Lab and Rad, but not Transcribed<br>\n3.  Patient withdrawing consent to disclose Lab, Rad and Transcribed.<br>\nAny suggestions?</p>\n<p>Also, I have been also looking at Consent resource example ‘Withhold or withdraw consent for disclosure of records related to specific domain (e.g. DI, LAB, etc.)’<br>\n<a href=\"https://www.hl7.org/fhir/consent-example-notThis.json.html\">https://www.hl7.org/fhir/consent-example-notThis.json.html</a><br>\nAre these specific domains (DI, LAB, etc.) are represented in the example through provision.data element?</p>",
        "id": 201882467,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1593021764
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span></p>",
        "id": 201895049,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593028257
    },
    {
        "content": "<p>The data can be blocked via a deny and then listing the types of data via LOINC or SNOMED (or other) codes in provision.code and/or using specific resource types in provision.data.reference and then selecting related as provision.data.meaning  E.g., information related to a specific Encounter, etc. If you're trying to block all Lab or all Radiology information, that would be difficult.  We didn't  see that an entire type of information would be needed.  That may be something we need to examine if your use case is that broad.</p>",
        "id": 201901412,
        "sender_full_name": "David Pyke",
        "timestamp": 1593031560
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span>  I am thinking we could use LOINC or SNOMED, or other codes - to represent the data (or its category). But how to represent both deny and permit in a consent, for example - Patient giving access to <em>Code1</em>, <em>Code2</em>, but not <em>Code3</em>.  Provision cardinality won't allow that..</p>",
        "id": 202006528,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1593109624
    },
    {
        "content": "<p>It will, through nested provisions.  The provision element is a tree structure so you can set a base Permit/Deny in the root provision and then have exceptions in sub-trees.</p>",
        "id": 202006738,
        "sender_full_name": "David Pyke",
        "timestamp": 1593109726
    },
    {
        "content": "<p>Ahh got it. Thanks :)</p>",
        "id": 202025290,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1593119342
    }
]