[
    {
        "content": "<p>I am trying to understand when to use consentingParty versus Actor in the case of an Advance Directive.  Would a consentingParty be anyone contractually bound to the agreement (e.g., Patient, Physician, Hospital, etc.) and an Actor is the consentingParty along with others that do not require knowledge of the agreement nor signature, such as an emergency contact?  Is there a list of things that are considered consentingParty and a list of those considered Actor somewhere?  Thanks in advance!</p>",
        "id": 244727409,
        "sender_full_name": "Shaan R",
        "timestamp": 1625243713
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span></p>",
        "id": 244727861,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625243961
    },
    {
        "content": "<p>ACtor is the person who would be directly affected by any limitation set and is entered in <a href=\"http://Consent.provision.actor\">Consent.provision.actor</a>, you can see who is considered an actor in that element.  ConsentingParty may be the Subject.  For other participants, you may want to have them listed in the Contract or other document that is attached to Consent</p>",
        "id": 244728524,
        "sender_full_name": "David Pyke",
        "timestamp": 1625244254
    },
    {
        "content": "<p>David, Thank you!  However, I failed to mention that I am using FHIR STU3.  As an example, I have John Doe who provides an advance directive while at Fictitious Hospital.  He assigns Healthcare Agent to his brother Frank Doe and his friends Sarah Johnson and Sam Riley as his emergency contacts.  He names Sarah Johnson as his first Healthcare agent and Thomas Little as his second Healthcare agent.  Is Sara listed as both a consentingParty and an Actor while Sam Riley is listed as an Actor only?  Thanks in advance .... again!</p>",
        "id": 244730722,
        "sender_full_name": "Shaan R",
        "timestamp": 1625245374
    },
    {
        "content": "<p>Consent really wasn't designed for anything but information sharing for STU3.  So, you're blazing a trail here.  I think you can safely define it as your use case needs.</p>",
        "id": 244730974,
        "sender_full_name": "David Pyke",
        "timestamp": 1625245471
    }
]