[
    {
        "content": "<p>Hi all,</p>\n<p>I am looking for some guidance on how to best represent a research consent document. Our consent documents at MSK contain a bunch of text that research participants must read and agree to. Some consent documents ask the participants questions that they respond to.  Our consent documents are also logically broken into \"sections\" (typically a table of contents).</p>\n<p>The 3 resources that seem obvious to me are Consent, Questionnaire, and QuestionnaireResponse. Can these be tied to one another to represent what I described above? Keep in mind that I am talking about storing the content of a consent document itself, separated out from the fact that a Patient consented and provided Questionnaire responses.</p>",
        "id": 167878164,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1560278566
    },
    {
        "content": "<p>Questionnaire provides a mechanism to present prompts to a user for a set of data elements and then gathers those data elements (as a QuestionnaireResponse).  It can do that for data elements for <em>any</em> resource - including Consent.  So it may make for a useful presentation layer for consent information.  However, in the end you're going to want that information represented in a Consent resource where you can actually execute logic, search, filter, etc.  The Structured Data Capture IG provides guidance on designing Questionnaires where it's straightforward to converta a QuestionnaireResponse into another FHIR resource or set of resources (e.g. Consent).</p>",
        "id": 167878563,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560278825
    },
    {
        "content": "<p>OK, I will have to look into this. SDC sounds familiar. Is this the link? <a href=\"http://hl7.org/fhir/us/sdc/index.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/sdc/index.html\">http://hl7.org/fhir/us/sdc/index.html</a> Is it ready for R4?</p>\n<p>One question I have (probably conceptual) - A consent for an oncology study can be long and contain lots of text, and some don't ask questions (they just want a signature.) Just wondering how this could be best represented.</p>",
        "id": 167880176,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1560279808
    },
    {
        "content": "<p>That's a good question for the BRR workgroup, but if you're looking for that kind of thing, a Contract is your best as it handles signatures.</p>",
        "id": 167970765,
        "sender_full_name": "David Pyke",
        "timestamp": 1560361749
    },
    {
        "content": "<p>Once you have the signature, we are working toward having the Consent resource manage the consent internally</p>",
        "id": 167970804,
        "sender_full_name": "David Pyke",
        "timestamp": 1560361788
    },
    {
        "content": "<p>I see no evidence that Contract handles signatures any better than any Resource. Besides in this case the signature is likely across the Questionnaire Response as that signature would be easily recorded in a Provenance on that Questionnaire Response instance.  That Questionnnaire Response would be the evidence found in the Consent.source[x]. The signature would not be on the Consent (or Contract) resource.</p>",
        "id": 167975759,
        "sender_full_name": "John Moehrke",
        "timestamp": 1560365249
    },
    {
        "content": "<p>Reviving this because I have another question <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - Could we in theory just use a FHIR Document that includes content in the form of text, questionnaires, etc? <a href=\"https://www.hl7.org/fhir/documents.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/documents.html\">https://www.hl7.org/fhir/documents.html</a></p>",
        "id": 183860954,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1576772617
    },
    {
        "content": "<p>Not sure why you'd need to wrap it in a document.  You can use QuestionnaireResponse, but those aren't searchable based on their contained data and wouldn't be recognized by anyone else.  QuestionnaireResponse is useful for capturing and displaying data, but unless you're in a closed system where everyone recognizes them, they're of limited use for business process.</p>",
        "id": 183861896,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576773152
    },
    {
        "content": "<p>We are trying to send a representation of a document itself, which includes (but is not limited to) questionnaires. In addition to questionnaires we have a lot of consent document content we want to represent in a FHIR resource, if possible. This specific use case is not yet dealing with questionnaire response, only the structure and content of a document not yet associated with patient input.</p>",
        "id": 183861959,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1576773225
    },
    {
        "content": "<p>that is similar to what I wrote up lately <a href=\"https://healthcaresecprivacy.blogspot.com/2019/11/fhir-consent-mapped-with-bppc.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2019/11/fhir-consent-mapped-with-bppc.html\">https://healthcaresecprivacy.blogspot.com/2019/11/fhir-consent-mapped-with-bppc.html</a></p>",
        "id": 183862738,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576773838
    },
    {
        "content": "<p>That post talks about DocumentReference, which could be useful once we capture informed consent. I'm talking about before that happens, just representing a document.</p>",
        "id": 183863167,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1576774113
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> just wanted to hear your thoughts, is Document / Composition something we can potentially use in this scenario? The document we're trying to represent is relatively simple, so it seems that they would work, e.g. a Composition resource with a bunch of section(s), where each section has text, etc.</p>",
        "id": 184062597,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1577036146
    },
    {
        "content": "<blockquote>\n<p>That post talks about DocumentReference, which could be useful once we capture informed consent. I'm talking about before that happens, just representing a document.</p>\n</blockquote>\n<p>as in publishing the overall policy? Yes, that is possible with DocumentReference. Simply don't fill out the .subject as the overall policy is not patient specific. (Or fill out .subject with the Organization, as it is about the organization).  This is in IHE covered in the NPFS (Non-Patient File Sharing) implementation guide.</p>",
        "id": 184109869,
        "sender_full_name": "John Moehrke",
        "timestamp": 1577113277
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>That post talks about DocumentReference, which could be useful once we capture informed consent. I'm talking about before that happens, just representing a document.</p>\n</blockquote>\n<p>as in publishing the overall policy? Yes, that is possible with DocumentReference. Simply don't fill out the .subject as the overall policy is not patient specific. (Or fill out .subject with the Organization, as it is about the organization).  This is in IHE covered in the NPFS (Non-Patient File Sharing) implementation guide.</p>\n</blockquote>\n<p>One quick clarification, I thought DocumentReference was supposed to refer to a document that already \"exists\" in some binary form. What I'm talking about is sort of representative of a data transfer object between two systems - so the idea of having a Document bundle wrapping a composition object with other references seems more apt.</p>",
        "id": 184115592,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1577118683
    },
    {
        "content": "<p>DocumentReference can exist alone.  (The name is misleading.). Documents aren't typically the preferred way to share information in FHIR.  What is it about your use case that you think makes documents necessary?</p>",
        "id": 184118627,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1577121469
    },
    {
        "content": "<p>We have two systems. One is used to author consent documents, which is used to create the content (e.g. the actual stuff patients read, along with images, etc.) of a consent document related to a clinical trial. The other system is used as a presentation layer for said content, and is used to capture actual consent to the trial for which the consent was authored. The first system needs to \"send\" information to the second, and a document seems like an appropriate package/mechanism for this, e.g.: </p>\n<div class=\"codehilite\"><pre><span></span>{\n  &quot;resourceType&quot;: &quot;Bundle&quot;,\n  &quot;type&quot;: &quot;document&quot;,\n  &quot;entry&quot;: [\n    {\n      &quot;fullUrl&quot;: &quot;https://test&quot;,\n      &quot;resource&quot;: {\n        &quot;resourceType&quot;: &quot;Composition&quot;,\n        &quot;section&quot;: [\n          {\n            &quot;title&quot;: &quot;Section 1 Title&quot;,\n            &quot;text&quot;: {\n              &quot;div&quot;: &quot;Section 1 html&quot;\n            }\n          },\n          {\n            &quot;title&quot;: &quot;Section 2 Title&quot;,\n            &quot;text&quot;: {\n              &quot;div&quot;: &quot;Section 2 html&quot;\n            }\n          },\n          {\n            &quot;title&quot;: &quot;Section 3 Title&quot;,\n            &quot;text&quot;: {\n              &quot;div&quot;: &quot;Section 3 html&quot;\n            }\n          }\n        ]\n      }\n    },\n    {\n      &quot;fullUrl&quot;: &quot;http://testURL&quot;,\n      &quot;resource&quot;: {\n        &quot;resourceType&quot;: &quot;ResearchStudy&quot;,\n        &quot;title&quot;: &quot;MED-1234&quot;\n      }\n    }\n  ]\n}\n</pre></div>\n\n\n<p>This is the direction we've been going in. It seems to be valid FHIR, so to us it makes sense as a simple representation of a document for our use case.</p>",
        "id": 184280992,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1577391679
    },
    {
        "content": "<p>Now that I look at both, perhaps <code>Contract</code> is a good option as <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> suggested...</p>",
        "id": 184281465,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1577392407
    },
    {
        "content": "<p><code>Contract</code> can reference<code> Composition</code> in the same way as <code>Document</code> can (via the<code>friendly</code> and <code>legal</code> attributes)  so I think that may be a better option, now that I am digging in. Thanks! Let me see where we go with this.</p>",
        "id": 184282251,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1577393466
    },
    {
        "content": "<p>Many things that are called \"documents\" in a clinical environment don't necessarily have to be represented as documents in FHIR.  Document is used when you need to package a bunch of resources together and store them as a frozen snapshot.  If you can get away with a single resource and not bother bringing Composition into the mix, that's generally better.  However, if you need the additional packaging and/or rendering rules that documents provide, they're available for use.</p>",
        "id": 184284044,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1577395733
    },
    {
        "content": "<p>Ok so what I’m hearing is stick to the explicit resources when possible as a rule, use the more abstract stuff when it makes sense. I get that - thanks!</p>",
        "id": 184289792,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1577404923
    },
    {
        "content": "<p>After considering our basic use case I think we’ll pursue the document route after all, due to the flexibility it provides re:composition and the fact that it seems to map very closely to what we’ve got already modeled. If contract makes more sense down the line we will consider.</p>",
        "id": 184427578,
        "sender_full_name": "Matthew Koch",
        "timestamp": 1577637500
    }
]