[
    {
        "content": "<p>Before Patient healthcare data is sent to a healthcare provider, an admissibility check needs to be performed to check if a healthcare professional wants to receive the data. How to express this in FHIR, any experiences?</p>\n<p>Is the Consent resource suitable for this? So a query on the Consent endpoint with the Patient identifier is performed to possible receive a Consent resource that states a healthcare professional has given consent to receive the patient data. Wrong use of the Consent? Would Task / ServiceRequest be better?</p>\n<p>Any advice is welcome!</p>",
        "id": 183768806,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1576688538
    },
    {
        "content": "<p>I don't think that Consent is the right solution. Consent is about the 'patient' expression of consent and rules of that consent. It sounds like you have a similar function where the clinician is expressing their interest (disInterest) and the rules. Is this right?</p>",
        "id": 183770983,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576690102
    },
    {
        "content": "<p>There is some interest in creating a general purpose Permission resource. It would look similar to parts of the Consent resource, but be more focused on permissions and not be specific to Patient Privacy Consent. The security workgroup is discussing this, but have not yet prototyped the Resource.</p>",
        "id": 183771079,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576690187
    },
    {
        "content": "<p>An alternative for your use-case might be a use of the Group, List, or CareTeam resources. Where a Practitioner would publish a list of the Patient(s) they are responsible for. I am not sure which of these three are best, as this is not something have focused on. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ?</p>",
        "id": 183771390,
        "sender_full_name": "John Moehrke",
        "timestamp": 1576690377
    },
    {
        "content": "<p>Knowing what patients a Practitioner is responsible for is different from who they want to receive data about.  At the complex end, you could have a PlanDefinition that sets the rules for what types of information should flow to which individuals in which circumstances.  However, if the intention is that you ask the question \"would you like to receive data of type X about patient Y\" before you actually send that information, the closest I can think would be CommunicationRequest.  The trick is that the acceptance/rejection of the CommunicationRequest is generally done by the expected performer, not by the expected recipient.  <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> - thoughts?</p>",
        "id": 183780796,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576696496
    },
    {
        "content": "<p>subscription?</p>",
        "id": 183787381,
        "sender_full_name": "Eric Haas",
        "timestamp": 1576700944
    },
    {
        "content": "<p>That's a technical mechanism to ask for data to be pushed.  It's not quite the same thing as \"do I have permission to send\"</p>",
        "id": 183789999,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576702986
    },
    {
        "content": "<p>This seems a case for Permission.</p>",
        "id": 183823571,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576742158
    },
    {
        "content": "<p>Permission would state \"this party has permission to get the data\". It would also include what and how would be done with the data, and justification like a policy or a contract.</p>",
        "id": 183823822,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576742435
    },
    {
        "content": "<p>and the evidence which could be the physician's statement that they have agreed to receive the data</p>",
        "id": 183823868,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576742487
    },
    {
        "content": "<p>Thnx all for your thoughts! </p>\n<ul>\n<li>I agree that Consent is not suitable for this purpose... too Patient-focused.  </li>\n<li>Group/CareTeam for the purpose of showing which practitioner has which patient is also not correct for this use case.</li>\n<li>Subscription sounds like the other way around indeed. </li>\n<li>Permission sounds ok! But doesn't exists yet.</li>\n<li>I will have a look at the CommunicationRequest.</li>\n</ul>",
        "id": 183849132,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1576765352
    },
    {
        "content": "<p>But how about Task? That a healthcare provider / professional system creates Task resources that can be queried to check if data can be sent?</p>",
        "id": 183849278,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1576765447
    },
    {
        "content": "<p>Other two options would be to do this with the Basic resource or to do it not in FHIR at all.</p>",
        "id": 183849414,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1576765543
    },
    {
        "content": "<p>Task lets you say \"please do\", so I suppose you could say \"please authorize me sending you data of type x about patient y\".  The result really should be some resource that represents the authorization, not just a completed Task.</p>",
        "id": 183853491,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576768007
    },
    {
        "content": "<p>The ask was...</p>\n<blockquote>\n<p>check if a healthcare professional wants to receive the data. How to express this in FHIR, any experiences?</p>\n</blockquote>\n<p>I don't think this is a permissions thing as asserted above</p>\n<blockquote>\n<p>It's not quite the same thing as \"do I have permission to send\"</p>\n</blockquote>\n<p>The provider has access to more patient data than they want to see.  So why not use subscriptions to pair it down to what they want to see?  The provider doesn't have subscribe herself it could be done by some algorithm or something?</p>",
        "id": 183862240,
        "sender_full_name": "Eric Haas",
        "timestamp": 1576773426
    },
    {
        "content": "<p>Subscription requires a subscription infrastructure and query capability on both sides.  It's a very different workflow.</p>",
        "id": 183862739,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576773839
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> your first comment makes sense, but I was assuming that we wanted to consider the \"permission granted - as in, after the request, the physician grants/is granted the right to receive the data\". Which I believe is a permission thing.</p>",
        "id": 183862868,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576773918
    },
    {
        "content": "<p>My opinion is that we seem to be missing a Permission resource.</p>",
        "id": 183862949,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576773968
    },
    {
        "content": "<blockquote>\n<p>Before Patient healthcare data is sent to a healthcare provider, an admissibility check needs to be performed to check if a healthcare professional wants to receive the data. How to express this in FHIR, any experiences?</p>\n<p>Is the Consent resource suitable for this? So a query on the Consent endpoint with the Patient identifier is performed to possible receive a Consent resource that states a healthcare professional has given consent to receive the patient data. Wrong use of the Consent? Would Task / ServiceRequest be better?</p>\n<p>Any advice is welcome!</p>\n</blockquote>\n<p>In thinking about this a bit longer... This usecase is exactly what the Oauth flow addresses. It isn't publishing the rules for others to read and hopefully execute correctly, it is a decision making service that is given parameters of a request, and results in a deny or a permit with a security token proof of permit. <span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span></p>",
        "id": 184058640,
        "sender_full_name": "John Moehrke",
        "timestamp": 1577028688
    },
    {
        "content": "<p>In the OAuth model, there is no need to standardize the rules. One only needs to standardize the parameters and the decisions. Behind the OAuth service API could be proprietary or standards or both. This should be considered first. But sometimes encoding the rules in a standard way is also useful, hence we have Consent and are considering Permission.</p>",
        "id": 184058831,
        "sender_full_name": "John Moehrke",
        "timestamp": 1577028967
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , I believe this admissibility check is part of establishing an OAuth token. The admissibility check can almost be seen as a boolean check, in our proof of concept phase. If a healthcare provider gave 'permission' for a certain patient to send him any kind of information this boolean would be true or a FHIR resource would exist. Below a very simplified and quickly to English translated overview of the location of this check.<br>\n<a href=\"/user_uploads/10155/xOhX31KSNGTvHiF0dNMYndBb/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/xOhX31KSNGTvHiF0dNMYndBb/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/xOhX31KSNGTvHiF0dNMYndBb/pasted_image.png\"></a></div>",
        "id": 184100220,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1577102976
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> , I believe I share your opinion about missing a Permission resource. Is there already any info available on this possible future resource? I am interested to follow the progression and possibly share our experiences.</p>",
        "id": 184100335,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1577103116
    },
    {
        "content": "<p>For now, we are thinking of using the Basic resource.  It looks like we could meet all our requirements with defining only one extension and selecting the right terminology for the .code.</p>",
        "id": 184100493,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1577103317
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span> . My initial thoughts are here: <a href=\"http://zeora.net/blog/2019/11/19/permission-is-key/\" target=\"_blank\" title=\"http://zeora.net/blog/2019/11/19/permission-is-key/\">http://zeora.net/blog/2019/11/19/permission-is-key/</a></p>",
        "id": 184103518,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577107021
    },
    {
        "content": "<p>Please do join us in the Security WG. We cover FHIR Security on Mondays (starting up again in 2020).</p>",
        "id": 184105256,
        "sender_full_name": "John Moehrke",
        "timestamp": 1577108857
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> , I believe this admissibility check is part of establishing an OAuth token. The admissibility check can almost be seen as a boolean check, in our proof of concept phase. If a healthcare provider gave 'permission' for a certain patient to send him any kind of information this boolean would be true or a FHIR resource would exist. Below a very simplified and quickly to English translated overview of the location of this check.<br>\n<a href=\"/user_uploads/10155/xOhX31KSNGTvHiF0dNMYndBb/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n</blockquote>\n<p>I am confused as to why you need a FHIR resource. It seems like the need is satisfied by OAuth. What is the communication need for the FHIR Resource? What is your extension on Basic? What actors are accessing it?</p>",
        "id": 184105965,
        "sender_full_name": "John Moehrke",
        "timestamp": 1577109471
    }
]