[
    {
        "content": "<p><a href=\"https://hl7.org/FHIR/codesystem-consent-scope.xml.html\">https://hl7.org/FHIR/codesystem-consent-scope.xml.html</a> defines 4 codes in the codesystem while the 'official' URI <a href=\"http://terminology.hl7.org/CodeSystem/consentscope\">http://terminology.hl7.org/CodeSystem/consentscope</a> has only 3 codes. Resulting in validation errors for me... a bug somewhere?</p>",
        "id": 257418719,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1634151400
    },
    {
        "content": "<p>it should not exist in both places. You'll have to ask CBCC which is authoritative and to remove it from FHIR and make changes to the UTG version</p>",
        "id": 257424416,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634153761
    },
    {
        "content": "<p>We removed Advance Directives from the codelist for R5 so, UTG is correct but R4 still has ADR</p>",
        "id": 257424593,
        "sender_full_name": "David Pyke",
        "timestamp": 1634153827
    },
    {
        "content": "<p>That being said, we have people asking us to put it back...</p>",
        "id": 257424740,
        "sender_full_name": "David Pyke",
        "timestamp": 1634153883
    },
    {
        "content": "<p>CarePlan for R5 states:<br>\n\"Self-maintained patient or care-giver authored plans identifying their goals and an integrated understanding of actions to be taken. This does not include the legal Advance Directives, which should be represented with either the Consent resource with <strong>Consent.category = Advance Directive</strong> ...\"</p>",
        "id": 257426940,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1634154826
    },
    {
        "content": "<p>That's going to be a problem.  I'll have to talk to them</p>",
        "id": 257427391,
        "sender_full_name": "David Pyke",
        "timestamp": 1634154982
    },
    {
        "content": "<p>The PACIO project for ADR is asking for the scope code to be replaced but as we're merging scope and category together, it might not be an issue</p>",
        "id": 257427492,
        "sender_full_name": "David Pyke",
        "timestamp": 1634155033
    },
    {
        "content": "<p>Thank you David, indeed you do have people questioning the removal of ADR.  What the perception was in 2019 for how successful an advance directive/advance care plan initiative that leverages the Consent Resource might be should be a vastly different perception today.  We understand use of R4 today, but removal of an R5 concept based on what we knew then as opposed to what we know now should probably queue re-visiting the decision.</p>",
        "id": 257433476,
        "sender_full_name": "Maria D Moen",
        "timestamp": 1634157343
    },
    {
        "content": "<p>I would simply offer to Ardon that the business of standards-based data exchange should treat jurisdictional bias toward what is legal and what isn't separately from enablement of the information exchange.  Person-authored information about what the goals, preferences, and priorities for treatment are during a time when the person can't communicate those values for himself/herself should be liberated from decades-old paper document processes.  The evolution to digital information exchange will be iterative, as you'd expect, but barriers related to varied stances on what is legal and what isn't shouldn't be barriers to hindering the march forward - people have a tendency to slow the adoption of technology but changing behaviors isn't in scope of standards development (as a rule).  My thoughts.</p>",
        "id": 257434509,
        "sender_full_name": "Maria D Moen",
        "timestamp": 1634157791
    },
    {
        "content": "<p>Thnx for your comments!<br>\nI am not completely sure if we are allowed to use the Advance Directive code for R4? I guess we are?<br>\nSo <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> , I see you are part of CBCC: are you able to change the UTG version for R4? Or what would be the plan?</p>",
        "id": 258161182,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1634633284
    },
    {
        "content": "<p>Since we're merging Scope and Category for R5, I should be able to revert the codelist.</p>",
        "id": 258188313,
        "sender_full_name": "David Pyke",
        "timestamp": 1634647834
    },
    {
        "content": "<p>Does this have a tracker item? Or something I can point to in our profiles/ig? <br>\nNot sure if I can fill a regular FHIR ticket for this.</p>",
        "id": 259991003,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1635857763
    },
    {
        "content": "<p>I need a Jira ticket so I can open a UTG ticket to add the code back</p>",
        "id": 259992360,
        "sender_full_name": "David Pyke",
        "timestamp": 1635858448
    },
    {
        "content": "<p>Cool! Here it is :) <a href=\"https://jira.hl7.org/browse/FHIR-34215\">https://jira.hl7.org/browse/FHIR-34215</a></p>",
        "id": 259997748,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1635861205
    },
    {
        "content": "<p>Great! Thank you</p>",
        "id": 259997782,
        "sender_full_name": "David Pyke",
        "timestamp": 1635861223
    }
]