[
    {
        "content": "<p>The consent resource is currently not usable for anything other than patient.<br>\nSo it can't be used to provide consent to access other data (such as restricted content related to an organization or worker)</p>",
        "id": 153925190,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1513261181
    },
    {
        "content": "<p>The consent.verfication.verifiedWith doesn't permit a Practitioner, or Organization to be referenced<br>\nDo others think this is a miss (will then log a change request)</p>",
        "id": 153925194,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1513264385
    },
    {
        "content": "<p>The Consent resource is designed to handle Consent. It is not a general purpose access-control-rules resource.  To this scope, the Consent is to be used for all kinds of consent including consent to treat, consent to advanced directives, consent to participate , etc...</p>",
        "id": 153925195,
        "sender_full_name": "John Moehrke",
        "timestamp": 1513264949
    },
    {
        "content": "<p>The use-case you identify seems more like a normal OAuth flow... These kind of rules don't often need to be described in an interoperable way, just the results of an authorization decision. Which is the model OAuth uses.</p>",
        "id": 153925196,
        "sender_full_name": "John Moehrke",
        "timestamp": 1513265011
    },
    {
        "content": "<p>Possibly a Contract resource could be used if you really need something in FHIR for this.</p>",
        "id": 153925197,
        "sender_full_name": "John Moehrke",
        "timestamp": 1513265028
    },
    {
        "content": "<p>Its metadata tags on content to indicate how it should be shared, and to what type of person (not actual person) essentially what you have in consent.<br>\nThese 2 restrictions on it are the only 2 things making it not work for me.<br>\nI'm almost done updating the IG to show how we planned to use it.<br>\n(rather than creating another new resource which essentially has the same stuff in it)</p>",
        "id": 153925199,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1513265618
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/ig/HL7/VhDir/StructureDefinition-usage-restriction.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/VhDir/StructureDefinition-usage-restriction.html\">http://build.fhir.org/ig/HL7/VhDir/StructureDefinition-usage-restriction.html</a><br>\nThis is the current (non consent) based definition (which is currently modeled as a complex extension in this IG)<br>\nUpdate will be coming tomorrow - on R4 - once its !@#$ building</p>",
        "id": 153925202,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1513265976
    }
]