[
    {
        "content": "<p>I am trying to understand how the STU3 <code>Consent</code> resource could be applied to a use case in which a patient explicitly opts in to granting a particular organization access to certain information. After reading through the documentation for <code>Consent</code>, two questions regarding the use of specific fields remained:</p>\n<p>1. <strong>Specifying the recipient of granted rights:</strong> On an initial reading, I would have assumed that  the recipient of the granted rights (in my case, the organization that is granted access to patient PHI) should be specified in the <em>actor</em> field. However, in the simple opt-in <a href=\"https://www.hl7.org/fhir/consent-example.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/consent-example.html\">General Consent example</a>, the <em>actor</em> field is not used - indeed, it is not quite clear to me who the recipient is and where this is specified at all (through the link in <em>policyRule</em>? through the <em>sourceAttachment</em>?). So my question is: given that the recipient of rights granted already exists as a FHIR resource, is <em>actor</em> indeed the right place to specify him/her/it as the recipient of the granted rights?</p>\n<p>2. <strong>Use of source[x] vs policy</strong> Though they are of course different, both <em>source[x]</em> and <em>policy</em> seem to provide ways of stating what the consent actually means, broadly speaking. Are there any simple rules of thumb for when to use one vs. the other vs. both? E.g. is the difference that  <em>policy</em> should refer to what the consent says in general (\"consent template\") whereas <em>source[x]</em> should refer to a specific instance of a consent signed by a particular patient? Or is it rather than <em>policy</em> will be general applicable laws whereas <em>source[x]</em> is the particular formulation with which the patient is asked to grant specific related rights?</p>\n<p>I know <code>Consent</code> isn't exactly the easiest of resources, but I was hoping there may be some broadly applicable rules-of-thumb....</p>",
        "id": 153946798,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1521624768
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span></p>",
        "id": 153946812,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521631085
    },
    {
        "content": "<p>For 1.  you'd  use actor with a reference to the organization.  Perhaps we should examine the definition (\"Who|what controlled by this consent (or group, by role)\") of that.</p>\n<p>For 2. The simple rule of thumb is: Source is the document/resource/etc. that shows the actual consent language that has been signed by the patient.  Policy is the relevant laws/regulations that the patient's consent is subject to.  For the latest version, in <a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">build.fhir.org</a> we've cleaned up the codelists a bit for policy.</p>",
        "id": 153946815,
        "sender_full_name": "David Pyke",
        "timestamp": 1521631876
    },
    {
        "content": "<p>I think the use-case that Morten expresses in 1. is has not been fully reviewed. The use-cases so far have been a case where the Organization obtaining the consent is the organization authorized by the consent. So it would be good to define a use-case that explicitly is captured by a different organization, but where the consent captured will authorize other(s) organizations.  This would be a good example to analyze, and to express for readers to understand. (similar use-case was brought up by Grahame yesterday on the security call).</p>",
        "id": 153946868,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521647282
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> Thanks for the tips, that was very helpful!</p>\n<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Yes indeed, we are considering usecases where a single consent could cover multiple organizations, of which only one would be the obtaining org. For me, an important overarching question is how to use <code>Consent</code> to make the the relation between the involved entities (represented as FHIR resources) as explicit as possible - for humans and machines - without using <em>policyRule</em> &amp; XACML etc.</p>",
        "id": 153949743,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1522657226
    },
    {
        "content": "<p>I recommend you write a paragraph explaining your use-case and critical factors. Submit that as a ballot comment or gForge tracker item. The committee will then work on improving the Consent resource, and your example will become one of the examples forever in the specification.</p>",
        "id": 153949792,
        "sender_full_name": "John Moehrke",
        "timestamp": 1522673078
    },
    {
        "content": "<p>Interesting idea - we still need to nail down the details of the use case ourselves, but maybe once we are done, we can submit it.</p>",
        "id": 153950861,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1522916131
    }
]