[
    {
        "content": "<p>I am looking into the SearchParameter 'composition' on Bundle  and it has a constraint that that is only expressed textually: <em>The first resource in the bundle, if the bundle type is \"document\" - this is a composition, and this parameter provides access to search its contents</em>.</p>\n<p>As far as I see it should be trivial to express this as a constraint on the SearchParameter using i.e. FhirPath. For me it would make sense to use this constraint primarily when indexing the resource.<br>\nSo I am wondering if there has been a discussion to add such a constraint attribute to the SearchParameter resource or if I am overlooking something in the specification that would enable this?</p>",
        "id": 166986491,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1559299649
    },
    {
        "content": "<p>GForge <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22653\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22653\">#22653</a></p>",
        "id": 167163607,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1559548017
    },
    {
        "content": "<p>I've been looking at Bundle-composition and Bundle-message in detail recently - they're quite unusual search parameters. They are the only place I can find where an explicit array index appears as part of a search param (in the base spec), they specifically index contained resources, and their definitions depend on the bundle type and express very specific requirements/assumptions about what the bundle type implies.</p>\n<p>If the spec had richer support for this case, would it be used in more places? If not, would a more simple spec be better with these unusual cases relaxed to something like \"composition: searches the contents of any Composition in the bundle\"?</p>",
        "id": 167206039,
        "sender_full_name": "Paul Church",
        "timestamp": 1559578665
    },
    {
        "content": "<p>We don't want any composition inside the Bundle.  The first Composition in a document Bundle has special meaning.  It represents the metadata for \"This\" document.  Any other Compositions would be content of the document but wouldn't describe the document.</p>",
        "id": 167208735,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559580338
    },
    {
        "content": "<p>The only places where the first resource has special meaning are for documents and messages.  It's certainly possible we could come up with another usecase in the future, but we don't have any specific plans as yet</p>",
        "id": 167209027,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559580535
    },
    {
        "content": "<p>Discussed on FHIR-I today, but decided we need more input from server vendors.</p>",
        "id": 167222418,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1559589726
    },
    {
        "content": "<p>Example of a SearchParameter with the attribute 'constraint' added:</p>\n<div class=\"codehilite\"><pre><span></span>{\n    &quot;resourceType&quot;: &quot;SearchParameter&quot;,\n    &quot;id&quot;: &quot;Bundle-composition&quot;,\n    &quot;name&quot;: &quot;composition&quot;,\n    &quot;code&quot;: &quot;composition&quot;,\n    &quot;base&quot;: [\n        &quot;Bundle&quot;\n    ],\n\n    // Proposing to add this attribute\n    &quot;constraint&quot;: &quot;Bundle.type = &#39;document&#39; and Bundle.entry[0].resource.resourceType = &#39;Composition&#39;&quot;,\n\n    &quot;type&quot;: &quot;reference&quot;,\n    &quot;expression&quot;: &quot;Bundle.entry[0].resource&quot;,\n    &quot;xpath&quot;: &quot;f:Bundle/f:entry[0]/f:resource&quot;,\n    &quot;xpathUsage&quot;: &quot;normal&quot;,\n    &quot;target&quot;: [\n        &quot;Composition&quot;\n    ],\n    &quot;multipleOr&quot;: true,\n    &quot;multipleAnd&quot;: true,\n    &quot;modifier&quot;: [\n        &quot;missing&quot;,\n        &quot;type&quot;,\n        &quot;identifier&quot;\n    ]\n}\n</pre></div>",
        "id": 167224429,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1559591259
    },
    {
        "content": "<p>Is the evaluation of the constraint essential to the document/message use case? If Bundle-composition searched any bundle whose entry[0].resource was a Composition, the client could add &amp;type=document to their query.</p>\n<p>If constraints are needed, then I agree they should be explicit and encoded as fhirpath to be evaluated by the server.</p>\n<p>I'm not convinced that constraints are a good idea, based on the balance of complexity vs. usefulness. Arbitrary fhirpath constraints are very broad and would be a big door to open just to support this. Are there more use cases than just Bundle, or use cases where the constraint is not something trivially expressed with an extra search term like &amp;type=document?</p>",
        "id": 167224590,
        "sender_full_name": "Paul Church",
        "timestamp": 1559591394
    },
    {
        "content": "<p>In theory we could have squished both parameters into one - at the expense of everyone using the new search parameter always needing to filter on Bundle type.  However, Bundle is now normative, so we're past the point where we can debate whether that would be a good idea or not.</p>",
        "id": 167227250,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559593136
    },
    {
        "content": "<p>To be able to evaluate the SearchParameter in the document/message use case the constraint is very much needed from my point of view. So, although we could use the target attribute to infer what types are allowed in <code>entry[0].resource</code>, there is no way to express <code>type=document</code> or <code>type=message</code> without the constraint attribute. There is also the option of modifying the expression in the <code>expression</code> attribute to use an <code>iif</code>, but that would probably break current implementations.</p>",
        "id": 167232477,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1559596216
    },
    {
        "content": "<p>hello, please i am new to fhir, i am a developer, our team would like to implement fhir in our health application, can someone please help me with the step my step procedure of how to comply with hl7 fhir, i have read so many documents and cant make any sense of it. please help if you can</p>",
        "id": 167776020,
        "sender_full_name": "okyere sharaf deen",
        "timestamp": 1560186044
    },
    {
        "content": "<p>there's no real general introduction because the kind of problems you might encounter vary so wildly. Do you have a relational database? what platform is the application in?</p>",
        "id": 167778240,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560187769
    },
    {
        "content": "<p>Complying with FHIR can be done in a wide variety of ways.  Do you know who you want to operate with and in what context?  There are often additional implementation guides that provide further expectations in different countries and for different use cases.</p>",
        "id": 167780488,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560189367
    }
]