[
    {
        "content": "<p>Hello, I am writing custom profiles and use References that reference offical  profiles like Range. Is it possible to constrain the unit or range of these ranges in the definition of the StructureDefinition of my custom profile ?</p>",
        "id": 154024028,
        "sender_full_name": "Georg Fette",
        "timestamp": 1544430286
    },
    {
        "content": "<p>I think it's possible, but I am confused about you saying \"references that reference official profiles like Range\".  References reference Resources, not datatypes.    In any case, your custom profile CAN constrain the basic types:</p>\n<ul>\n<li>create a separate \"type profile\" that constrain that type (here: Range)</li>\n<li>In the profile that you are writing now (and that uses Range), make the \"typeRef\" part of the ElementDefinition (depends a bit on the tool you are using how to do that) point to that \"type profile\".</li>\n</ul>",
        "id": 154024048,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1544444492
    },
    {
        "content": "<p>ah, thank you.<br>\nYour right with References referencing Resources. But could be said that the definition of the Reference in the StructureDefinition references a datatype?</p>",
        "id": 154024057,
        "sender_full_name": "Georg Fette",
        "timestamp": 1544447340
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span>, basically you have two options:<br>\n1) Create a custom type profile, derived from a standard datatype profile, with additional constraints. Now other custom profiles can refer to this custom datatype via an ElementDefinition.type.profile constraint.<br>\n2) Alternatively, a custom profile can specify inline constraints on referenced external type/resource profiles. For example, your custom profile could further constrain an element with (default) datatype Range by limiting the low/high values.<br>\nThe first approach is a bit involved, but facilitates re-use.<br>\nForge, the FHIR profile editor, supports both approaches, so you could experiment a bit before deciding which approach suits best.</p>",
        "id": 154024068,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1544450927
    }
]