[
    {
        "content": "<p>Has anyone implmented the concept of ContactPoint for audiences? - i.e. a HealthcareService offers a phone number for Patients to call, and another for \"Professionals\" to call?If so how did you implment this? I'm guessing that the answser is going to be a ContactPoint extension with a coding to hold the \"Patient\"; \"Professional\"? Or is there a better way of doing this?</p>",
        "id": 246732217,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1626879672
    },
    {
        "content": "<p>For an Organization, you would use the .contact.purpose field for that.  The binding is extensible so if it can't/doesn't match any of the precoded ones, you can use your own.</p>",
        "id": 246732758,
        "sender_full_name": "David Pyke",
        "timestamp": 1626879849
    },
    {
        "content": "<p>It may be worthwhile to raise a change proposal to add \"Provider\" to the valueset.</p>",
        "id": 246732914,
        "sender_full_name": "David Pyke",
        "timestamp": 1626879924
    },
    {
        "content": "<p>Thanks David - it looks a bit \"messy\" around contact points for various resources. The Organization resource that you refer to has a couple of address &amp; telecom elements (a set outside the contact backbone element, and a set in the contact backbone element) that look as though they could have been amalgamated given the optionality of purpose &amp; name. And for some reason the contact backbone element wasn't carried forward into other resources like HealthcareService &amp; Location. I guess the way forward would be to create an extension as a copy of the <a href=\"http://Organization.contact\">Organization.contact</a> backbone element &amp; use that in HealthcareService.</p>",
        "id": 246818818,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1626940878
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 246864228,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626968278
    },
    {
        "content": "<p>Check the current <a href=\"http://build.fhir.org\">build.fhir.org</a> pages, we've done some refinements in this area. (not sure if all have been applied though)<br>\nWe're applying the same style across all those provider directory resources.</p>",
        "id": 247041074,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1627080236
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>  Does that mean that HealthcareService will get a contact backbone element the same as Organization?</p>",
        "id": 247187532,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1627296804
    }
]