[
    {
        "content": "<p>We have a FHIR server with a MedicationDispense resource available for Read, which references Contained Patient and Practitioner resources, since we only have fragments of these entities, and the entity info is captured as point-in-time of the drug dispensation, so it doesn't make sense for these contained resources to exist independently.<br>\nSo a Read on this MedicationDispense will return a MedicationDispense resource, with the Contained Patient and Practitioner resources. A Search against this MedicationDispense resource will return a Searchset Bundle resource, with multiple MedicationDispense resources as Bundle.entry.resource -- but the previously contained Patient and Practitioner resources are now also found as Bundle.entry.resource.<br>\nIs this correct? <br>\nIf feels like the logic required to return a Searchset is a lot more work, as the server has to disassemble and flatten all the containment, and the requester has to look across all elements within the bundle rather than just looking at MedicationDispense.contained as in the Read.<br>\nFollow-up question - does this mean that the fragment/contained Patient and Practitioner resources in Bundle.entry.resource will need to have Bundle.entry.search.mode=\"include\" (even though this was not a result of a _include search parameter -- though that's just semantics and nitpicking).</p>",
        "id": 183208196,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1576102736
    },
    {
        "content": "<blockquote>\n<p>Is this correct? </p>\n</blockquote>\n<p>no. if they're contained resources, you leave them as contained resources</p>",
        "id": 183214638,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576108023
    },
    {
        "content": "<p>Contained entries should remain contained. If you have enough patient identity to know that multiple dispenses are for the same patient or by the same practitioner, then those shouldn't be contained.  Contained is for resources that have no identity outside the containing resource.</p>",
        "id": 183223856,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576118342
    },
    {
        "content": "<p>Thank you -- We ran into validation errors when using HAPI for validation, and the errors were related to referencing the contained resources. The same sample message ran fine in HL7 FHIR Validator, so we're checking in with the HAPI forums.</p>",
        "id": 183288535,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1576176337
    },
    {
        "content": "<p>there was a bug that was fixed there - might be a version issue with the validator - the HAPI one runs behind the snapshot</p>",
        "id": 183292924,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576179004
    }
]