[
    {
        "content": "<p>Hello all,  I'm new to FHIR and I'm trying to tramsform my raw text data file into the FHIR resource format. I'm having some questions and need guidance to see my approach is appropriate. Thank you veru much in advance!</p>\n<ol>\n<li>If I can't find controlled terminology code (for example, SNOMED or LOINC) for my measurements, I use text instead to describe the measurement. The measurements including: Rotation rate (x,y,z axis), acceleration (x,y,z axis) from apple watch accelerometer and gyroscope, type of utensil (fork, hand, ...) used during the meal and datetime the meal was started/end. I couldn't find appropriate controlled terminology for my measurements so I use text to describe, for example:</li>\n</ol>\n<p>\"code\": {<br>\n    \"text\": \"acceleration\"<br>\n}</p>\n<ol start=\"2\">\n<li>Use observation resource for meal time and utensil records.<br>\nMy raw data in txt file (Time:Event observed):<br>\n2019-05-23 17:01:31 +0000: meal started<br>\n2019-05-23 17:10:37 +0000: meal completed<br>\n2019-05-23 17:16:07 +0000: utensil used is 3</li>\n</ol>\n<p>This data is saying the subject started meal at 17:01 and completed the meal at 17:10, the utensil he used is 3 (coded value, I also couldn't find a ideal controlled terminology code for the utensil, we have fork, spoon, knife, glass, hand, chopstick). <br>\nFor FHIR version, as the 3 records belongs to the same session. I use 4 components to store all the information (Datetime meal started and completed, datetime when type of utensil was recorded, and type of utensil been used).</p>\n<p>\"component\": [<br>\n    {<br>\n        \"code\": {<br>\n            \"text\": \"meal started\"<br>\n        },<br>\n        \"valueDateTime\": \"2019-05-23T17:01:31+00:00\"<br>\n    },<br>\n    {<br>\n        \"code\": {<br>\n            \"text\": \"meal completed\"<br>\n        },<br>\n        \"valueDateTime\": \"2019-05-23T17:10:37+00:00\"<br>\n    },<br>\n    {<br>\n        \"code\": {<br>\n            \"text\": \"datetime, untensil used\"<br>\n        },<br>\n        \"valueDateTime\": \"2019-05-23T17:16:07+00:00\"<br>\n    },<br>\n    {<br>\n        \"code\": {<br>\n            \"text\": \"utensil\"<br>\n        },<br>\n        \"valueString\": [<br>\n            \"3\"<br>\n        ]<br>\n    }</p>",
        "id": 187950333,
        "sender_full_name": "Christi Yuting Kao",
        "timestamp": 1581452273
    },
    {
        "content": "<p>Typically you're better to define your own code system than to use text.  'text' isn't considered computable - it's just for humans to look at.  If you want other systems to recognize your data, you're going to want to have codes of some sort, even if the code system is one you define yourself.</p>",
        "id": 187968650,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581465055
    }
]