[
    {
        "content": "<p>Yes I know there's no context conduction in FHIR. But as part of a 'data cleansing' strategy one may wish to at least verify if it's reasonable (given the business rules) that if A references B (A-B for short), and B-C, does this imply A-C ? Or: if A-B and C-B, does that perhaps imply A-C or C-A ?<br>\nIf that;s too abstract for your taste: if I have an encounter for a patient (E-P), and an observation for a patient (O-P), and [business rule part] the observation date lies within the date range of the encounter, and the observation was made by the same organization involved in the encounter, then as part of the data cleansing / enrichment strategy I could add O-E if not present in the data already. <br>\nI would imagine this to be very useful when it comes to linking all sorts of resources to the correct Encounter, Patient or CarePlan if such links are missing in an instance. Any thoughts ?</p>",
        "id": 225957325,
        "sender_full_name": "René Spronk",
        "timestamp": 1613029909
    },
    {
        "content": "<p>I would expect that if a relationship is important, it should be explicit. These (n) step relationships you are describing will happen but shouldn't be seen as anything other than a fact that the universe is a connected thing.</p>",
        "id": 225990073,
        "sender_full_name": "John Moehrke",
        "timestamp": 1613050545
    },
    {
        "content": "<p>attacks on privacy often use these (n) step relationships. Hence why de-identification is so hard.</p>",
        "id": 225990225,
        "sender_full_name": "John Moehrke",
        "timestamp": 1613050595
    },
    {
        "content": "<p>Well, if references aren't required by a profile, clients may choose to do the minimalist thing, forcing one to add these references at the receiving end.  \"importance\" is a relative thing.</p>",
        "id": 225990797,
        "sender_full_name": "René Spronk",
        "timestamp": 1613050855
    },
    {
        "content": "<p>Doing all sorts of things is possible in data cleansing.  Whether it's reasonable is going to depend on context - what sort of assumptions are safe and what the ramifications of getting it wrong would be.  Is there something you think the core spec needs to say about this?</p>",
        "id": 226006943,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613057190
    },
    {
        "content": "<blockquote>\n<p>if I have an encounter for a patient (E-P), and an observation for a patient (O-P), and [business rule part] the observation date lies within the date range of the encounter, and the observation was made by the same organization involved in the encounter, then as part of the data cleansing / enrichment strategy I could add O-E if not present in the data already.</p>\n</blockquote>\n<p>I don't think you have enough information to add O-E. In my mind, this looks like a huge liability issue. One way around that is to flag it, and let a person make the judgement if the link can be added.</p>",
        "id": 226018658,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1613061241
    },
    {
        "content": "<p>I agree there are risks associated with this, as always with any data enrichment strategy. That's why I stated there'd have to be 'business rules' as to when adding such references would be acceptable (also from a risk perspective).</p>",
        "id": 226106332,
        "sender_full_name": "René Spronk",
        "timestamp": 1613116430
    }
]