[
    {
        "content": "<p>Question from a noob :)<br>\nI work for a mobile ultrasound company  (Sonocare, LLC, Edge); we perform ultrasounds for 80 plus offices but often only one half day per week (every day at some offices and some only as-needed) </p>\n<p>We want to automate patient registration (ADT incoming), ultrasound orders (ORM incoming) and reports (ORU outgoing). I have been looking into automation for over a year now and below is what I have found.</p>\n<p>We do a little business with a lot of offices. The cost of integration / interface is the same (high) but we don't make enough money from each office to warrant the cost for most of these offices.</p>\n<p>So I looked at interfaceware (iguana) in which we code our own interfaces in lua but this still leaves each office with the expense and hassle of integration; they don't even HL7 to the local hospitals for diagnostic testing but they do send to pharmacies. </p>\n<p>So I had the idea of becoming certified in HL7 so I could assist them on behalf of my employer as this would benefit us in streamlining and automation; perhaps, if I am certified, I would be allowed by them and their EMR  provider to assist in this way.</p>\n<p>This led me to <a href=\"http://HL7.org\">HL7.org</a> and the educational and certification offerings. I emailed Sadhana Alangar and he referred me to this chat.</p>\n<p>I know this is out of the box but out of the box is our only option as far as I can see.</p>\n<p>I think a year and $2500 from now I could be certified in HL7 V2. </p>\n<p>My skill set is as follows. I am a sonographer x27 years. I also manage the cardiovascular side of our PACS (Infinitt), manage user accounts, set up all our laptops and perform ultrasounds when staff is short. In my personal life, I am an intermediate-level developer in c#.</p>\n<p>Any advice or direction would be much appreciated :)</p>",
        "id": 219350315,
        "sender_full_name": "Danny Woodring",
        "timestamp": 1607527266
    },
    {
        "content": "<p>Welcome to the community :)  I think the notion that \"I'm certified, therefore I'll be allowed by clinics and their EMR vendors to help set up an interface\" is a bit of a stretch.  It'd be awesome if HL7 certification had that much market influence, but I'd be incredibly surprised for that to happen in practice.  Certification might help you ensure you'd have the skills to effectively help, but you'd still have the challenge of EMRs not having interfaces, or having completely different ways of exposing/configuring interfaces.  You'd also have the challenge that once configured, there's still on-going maintenance.</p>\n<p>I think the core of your issue is the financial model issue, not the technical issue.  I.e. How do you form a business case where there's a sufficient return on investment for the parties who need to be involved in ensuring data can flow appropriately.  It may be that having someone from outside who can help configure the interface will be part of that solution because that could, in theory, lower the financial and recruitment barriers to action.  But certification/non-certification isn't going to be the primary lever that gets the boulder to start rolling.  (Not discouraging you from pursuing certification, just don't want you to pursue it with the assumption it will magically solve your problem.)</p>",
        "id": 219353224,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607528399
    },
    {
        "content": "<p>Thanks so much for the feedback, very helpful.</p>",
        "id": 219357741,
        "sender_full_name": "Danny Woodring",
        "timestamp": 1607530136
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"370461\">@Danny Woodring</span>, on the technical side of this, I suggest you look at the IHE Radiology (and to a lesser degree, the IT Infrastructure) profiles, and in particular SWF. These profiles clearly identify the particular role and messaging expected of interoperable solutions. You can say to your partners, \"We implement the SWF DSS/Order Filler actor. You need to conform to the SWF Order Placer actor.\" This simplifies the situation, since IHE has already thought through many of the complexities, and allows you to back up your request by pointing at a \"standard\".</p>",
        "id": 219372192,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1607536211
    },
    {
        "content": "<p>Thanks very much <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  , looking at IHE Radiology right now.</p>",
        "id": 219376269,
        "sender_full_name": "Danny Woodring",
        "timestamp": 1607537964
    }
]