[
    {
        "content": "<p>The generic question I think applies to all instances where source material for FHIR communications uses classic codes and therefore classic OIDs for the code system identifier (e.g. XDS, CDA, HL7 v2 messages, HL7 v3 messages, DICOM, etc). I specifically am focused on XDS DocumentEntry metadata being converted to DocumentReference metadata. In MHD I have been silent hoping for some good Trial Implementation to drive the decision and guidance. However I am interested in asking the larger audience. If the source material (e.g. XDS DocumentEntry.typeCode which is commonly LOINC) should use code system identifier OID should be ( a) copied as the OID it is (e.g. urn:oid:2.16.840.1.113883.6.1), or (b) converted to the FHIR friendly URI (e.g. <a href=\"http://loinc.org\" target=\"_blank\" title=\"http://loinc.org\">http://loinc.org</a>) ... I recognize the desire to be URLs and not OIDs... but in the case I am referencing, where source material uses the OIDs... the translation might not always be possible?  In some cases the app might want the OID for app reasons (e.g. DICOM), or for processing sake (e.g. will be processing a referenced CDA)</p>",
        "id": 153938697,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519077770
    },
    {
        "content": "<p>I just added this:</p>",
        "id": 153938699,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519078135
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/namingsystem-operation-preferred-id.html\" target=\"_blank\" title=\"http://build.fhir.org/namingsystem-operation-preferred-id.html\">http://build.fhir.org/namingsystem-operation-preferred-id.html</a></p>",
        "id": 153938700,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519078155
    },
    {
        "content": "<p>The general guidance I provide is that, while it's work to come up with meaningful human-readable URIs (ideally URLs) to use in place of OIDs, there's a significant long-term benefit for ease of implementation and reduction in the likelihood of errors.  There's significant infrastructure in place that supports automated translation once you've come up with the human-readable equivalents.  That said, there will absolutely be some cases where translation isn't possible.</p>",
        "id": 153938720,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519081353
    },
    {
        "content": "<p>In my case I want guidance in the absence of infrastructure. I appreciate and would be glad to point at the namingsystem operation.  I am not getting a clear picture from <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , but it seems a tendency for -- don't convert just for conversion sake. If the source is OID, keep it OID. Is that right?</p>",
        "id": 153938951,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519137450
    },
    {
        "content": "<p>My guidance is \"take all reasonable steps to avoid OIDs appearing in FHIR instances\".  It's absolutely appropriate to define human-readable URLs for things that already have OIDs.  It's extra work up front, but there's significant benefit in the readability of the instances once you do.  The cost is one-time.  The benefit accrues forever.</p>",
        "id": 153939000,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519147600
    },
    {
        "content": "<p>So convert unless it's simply not possible (e.g. because you're receiving OIDs and have no way of knowing what they mean and no one has provided mapping to URLs)</p>",
        "id": 153939004,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519147654
    },
    {
        "content": "<p>oh. I didn't understand that from your first text... Drat.</p>",
        "id": 153939069,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519156641
    },
    {
        "content": "<p>so for MHD... the degenerate form where there is a FHIR app that is an end-user consumption, will cause all metadata translation in the MHD server for DocumentReference, but the document bits (e.g. CDA) will stay original (we can't change the document bits).</p>",
        "id": 153939070,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519156716
    },
    {
        "content": "<p>I guess that is reasonable stance to go forward with... and I can point at the operation as a tool the server can use to convert as necessary.</p>",
        "id": 153939071,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519156766
    }
]