[
    {
        "content": "<p>Hi Everyone,</p>\n<p>I am new to FHIR Format and have certain queries.</p>\n<p>In our Application, we have patient's prescription data saved in the different tables in the database. For a single prescription, there are several columns including physical examination &amp; history, allergies, medication, advice, diagnosis, etc for a specific patient.</p>\n<p>I need to write a c# code where I can convert all this prescription information including patient information into FHIR format. I had tried writing c# code but I faced some issues:-</p>\n<p>We don't have any FHIR server implemented but just have to map the data from the database in FHIR, in this case, certain terminologies I don't understand are taken from the FHIR server. For example<br>\n\"entry\": [<br>\n{<br>\n\"fullUrl\": \"Composition/3b990853-f0fa-4046-8388-d71dd93a0fa1\",<br>\n\"resource\": {<br>\n\"resourceType\": \"Composition\",<br>\n\"id\": \"3b990853-f0fa-4046-8388-d71dd93a0fa1\",<br>\n\"identifier\": {<br>\n\"system\": \"<a href=\"https://www.max.in/document\">https://www.max.in/document</a>\",<br>\n\"value\": \"3b990853-f0fa-4046-8388-d71dd93a0fa1\"<br>\n},<br>\nIn the above-mentioned example, I don't have any Composition in the FullURL parameter.</p>\n<p>In the prescription format specified in SNOMED CT, this is the code for Prescription 440545006. And in the JSON structure of prescription, there is an only practitioner, patient, and medication however there is no information regarding allergies or diagnosis or complaints. How to include all this information in prescription FHR<br>\nI tried to create a model class from JSON, but certain parameters remain null which doesn't make a valid FHIR format.</p>\n<p>Anyone who had implemented Converting raw data into prescription in c# kindly help.</p>",
        "id": 245959631,
        "sender_full_name": "jagjot singh Wadali",
        "timestamp": 1626269557
    },
    {
        "content": "<p>Is there a reason you are starting with a Composition? May be better to look at MedicationRequest for a prescription</p>",
        "id": 245963414,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1626271281
    },
    {
        "content": "<p>From a FHIR perspective, it sounds like you're doing more than what we would typically call a \"prescription\" - you're capturing a full set of information for an encounter.  Drug prescriptions in most of the world typically don't link to allergies, physical, etc.  You <em>could</em> potentially link some of that information in using MedicationRequest.supportingInformation.  Conveying allergies there would make sense if you were justifying the use of a specific \"non-preferred\" med due to an allergy, but you generally wouldn't convey all allergies, just the one or set that was relevant to that specific order.  Similarly, you might convey height, weight, liver function or other observations that are relevant to the order.  Providing all details from a examination &amp; history would be unusual.  Diagnosis would generally go in MedicationRequest.reason</p>",
        "id": 245979053,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626277822
    },
    {
        "content": "<p>if your data is sourced from multiple tables, look  into creating a view with a union, or using linq's union method</p>",
        "id": 246002919,
        "sender_full_name": "Brian Beatty",
        "timestamp": 1626288690
    }
]