[
    {
        "content": "<p>As the site implementation, we want to convert the DSTU2 JSON Version to STU3 JSON Version. Can someone suggest me if it is done already or if you have any ideas on how to implement in Javascript?</p>",
        "id": 156529557,
        "sender_full_name": "Murari Kirankumar",
        "timestamp": 1548069728
    },
    {
        "content": "<p>StructureMaps to convert between DSTU2 and STU3 (independent of syntax) are published as part of the STU3 spec.  However, I'm not aware of anyone who's implemented the StructureMap $transform operation in Javascript yet.  The FHIRPath engine was only recently implemented.  You could either work on $transform to leverage the existing mappings or use them to inform hand-coded transformations of the things you care about.</p>",
        "id": 156542395,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548083550
    },
    {
        "content": "<p>To sort of piggy back on this question. Is there any tools/engines out there that developers can use to do the translation from DSTU2 to STU3 in Java? Or maybe even a plugin like I see Eclipse has for HL7 V2 to V3 Mapping and Transformation. Thank you in advance!</p>",
        "id": 177246552,
        "sender_full_name": "Gina",
        "timestamp": 1570111083
    },
    {
        "content": "<p>Can anyone comment on what the options are to convert DSTU2 to STU3?  I understand that there are StrucutreMaps containing the mappings published with the spec.  Is there tooling that can interpret these and actually perform the conversions?  I'm assuming yet, but having a difficult time finding anything.   Are there other options as well ? Perhaps FHIR Mapping Language (mappings/tooling available)?  Thanks!</p>",
        "id": 177278638,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1570131223
    },
    {
        "content": "<p>HAPI includes an engine that can run those conversions - see StructureMapUtilities. And it also includes an example for how to run it (it's a little tricky to set up. It's on my todo list with James to can a conversion service that does all that)</p>",
        "id": 177280890,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570132482
    },
    {
        "content": "<p>that'd be really cool...</p>",
        "id": 177281604,
        "sender_full_name": "James Agnew",
        "timestamp": 1570132813
    },
    {
        "content": "<p>I think we have a stub somewhere to fill out....</p>",
        "id": 177289394,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570137597
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <br>\nI'm trying to make sense of this and could use a nudge in the right direction. <br>\nMy end goal is to be able to convert R2 to R3 resources.   </p>\n<p>I am not finding any StrucutreMap resources published with the spec, but do see FML defintions. </p>\n<p>In HAPI, I found a StructureMapUtilities.parse(..) method that appears to convert FML into a StructureMap. </p>\n<p>I found the StructureMapUtilities.transform(..) method: <br>\npublic void transform(Object appInfo, Base source, StructureMap map, Base target)<br>\nThat sort of looks like what I'd need, except the source and target are fixed to a specific package/fhirversion so likely won't work for moving between versions. </p>\n<p>I have not found the example mentioned on how to run it. <br>\nCan you point me in the right direction and/or clear up any misunderstandings I've stated above?</p>",
        "id": 177716865,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1570630050
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 177726822,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570635794
    },
    {
        "content": "<p>the class org.hl7.fhir.convertors.R2R3ConversionManager in HAPI brings all this together</p>",
        "id": 178240540,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571178188
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  (or others). The R2R3ConversionManager class references this file: <br>\n<a href=\"http://hl7.org/fhir/r2r3maps.zip\" target=\"_blank\" title=\"http://hl7.org/fhir/r2r3maps.zip\">http://hl7.org/fhir/r2r3maps.zip</a><br>\nI can't access it there, any idea where to get it? </p>\n<p>Thanks again.</p>",
        "id": 178808022,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1571786270
    },
    {
        "content": "<p>the source is here: <a href=\"https://github.com/FHIR/interversion\" target=\"_blank\" title=\"https://github.com/FHIR/interversion\">https://github.com/FHIR/interversion</a></p>",
        "id": 178999413,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571952326
    }
]