[
    {
        "content": "<p>On <a href=\"http://hl7.org/fhir/directory.html\">http://hl7.org/fhir/directory.html</a> one can download the corexml package for 4.0.1 at <a href=\"http://hl7.org/fhir/hl7.fhir.r4.corexml.tgz\">http://hl7.org/fhir/hl7.fhir.r4.corexml.tgz</a><br>\nUnfortunately, after downloading and unzipping it, it looks like this is still only 4.0.0 and not 4.0.1. The FHIRVersion-list entry in xml/fhir-base.xsd does NOT contain an entry for 4.0.1 and also all the xsds contain a remark that says \"Generated on Thu, Dec 27, 2018 22:37+1100 for FHIR v4.0.0 \".</p>\n<p>Our code generated from these xsds now can't decode a CapabilityStatement that contains \"fhirVersion\":\"4.0.1\", since it doesn't see \"4.0.1\" as a valid FHIRVersion.</p>",
        "id": 269751447,
        "sender_full_name": "Eli-Jean Leyssens",
        "timestamp": 1643383023
    },
    {
        "content": "<p>well, that's unfortunate. Because I don't have a way to release a new package. But here's a fixed one: <a href=\"/user_uploads/10155/FOR0iIDLZOtg7QTX9tpIg1cX/hl7.fhir.r4.corexml.tgz\">hl7.fhir.r4.corexml.tgz</a></p>",
        "id": 269799793,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643402672
    },
    {
        "content": "<p>Thank you very much Grahame. I see that the only proper difference in the xsd files is in fhir-base.xsd where the 4.0.1 version got added. Since all the \"Generated on\" messages now include the text \"and modified by hand for 4.0.1\" I'm wondering if this is a correct reflection of the 4.0.1 specification. That is, are you sure there are no other changes in the model in 4.0.1 except for the actual version number? If I look at <a href=\"http://hl7.org/fhir/R4/history.html#v4.0.1\">http://hl7.org/fhir/R4/history.html#v4.0.1</a> it looks like quite a few changes, but it's just hard for me to understand whether any of those changes should have an impact on  the xsd files.</p>",
        "id": 269924653,
        "sender_full_name": "Eli-Jean Leyssens",
        "timestamp": 1643538123
    }
]