[
    {
        "content": "<p>In the Dutch realm, we use ConceptMap resources to map codes from one ValueSet to the other. Mostly used on elements where the FHIR core ValueSet has a required binding but our information models (after this: zib) use a different (or broader) set of (required) concepts. </p>\n<p>Our current ConceptMaps all define the zib ValueSet as <code>.source</code> and the FHIR core ValueSet as <code>.target</code>. A way of looking at this is from the perspective of a system that translates from data entered by a user in zib format and exchanged in FHIR format. We also make use of the <a href=\"http://hl7.org/fhir/StructureDefinition/concept-bidirectional\">concept-bidirectional</a> extension to indicate that the mappings can be reversed, or not.</p>\n<p>On elements/ValueSets where ConceptMaps apply, we add the <a href=\"https://www.hl7.org/fhir/extension-11179-permitted-value-conceptmap.html\">permitted-value-conceptmap</a> extension which states: </p>\n<blockquote>\n<p>The source for the concept map is the value set the extension appears on. The target is the permitted-value-valueset.</p>\n</blockquote>\n<p>This indicates that the way we design our ConceptMaps now is \"the wrong way around\". However, this is based on just the comment in the extension. The <a href=\"https://www.hl7.org/fhir/conceptmap.html\">ConceptMap resource</a> makes no specific statements on source and target. </p>\n<p>Before we  make the effort of converting all of our ConceptMaps: can someone help us out? We would like to know if there is consensus or any best practices on the use of ConceptMaps for use cases like ours?</p>",
        "id": 262307164,
        "sender_full_name": "Niek van Galen",
        "timestamp": 1637580662
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 262335977,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637595816
    },
    {
        "content": "<p>you know, I'm not sure of the answer to this. I don't recall the discussion around making the definition of permitted-value-conceptmap so directional (and in a way that doesn't really feel right to me either). I expect that I defined it, and early, though it's possible that <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> did. Though since he tagged me... probably it wasn't him.</p>",
        "id": 262417306,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637648476
    },
    {
        "content": "<p>but also , the 11179 definition of permitted value isn't quite what you're doing. So I wonder whether you should do what you suggest. </p>\n<p>Anyway, here's the options I think you have </p>\n<ol>\n<li>ask HL7 to change the definition of the extension (might not be possible - constrained by 11179)</li>\n<li>ask HL7 to define an alternative extension that isn't encumbered by 11179-ness</li>\n<li>define your own extension</li>\n<li>flip your concept maps over </li>\n<li>do what I did in this <a href=\"https://github.com/HealthIntersections/australian-fhir-support/blob/main/fhir/ConceptMap/covid-cvx-air-mapping.json\">value set</a>, and have it both ways rather than using the bi-directional extension. </li>\n</ol>\n<p>Honestly, I prefer 5. It means that if suddenly you run into a screwy mapping which isn't quite the same both ways, you don't need to restructure. Sure, it's more verbose (less than I thought at first because you also drop the extension URL), but it's also computationally simpler. Are you concept maps so big that the increase in size matters that much?</p>",
        "id": 262417500,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637648734
    },
    {
        "content": "<p>though you could do 1|2|3 as well as 5 too</p>",
        "id": 262417569,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637648780
    },
    {
        "content": "<p>Doing option 5 does make a lot of sense, the increase in size won't matter imho. Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, I'll discuss this with the Nictiz team.</p>",
        "id": 262448984,
        "sender_full_name": "Niek van Galen",
        "timestamp": 1637670730
    },
    {
        "content": "<p>If you're not doing 11179, you shouldn't be using permitted-value-conceptmap.  It's about converting between \"what you share\" and \"what you store\" - which I don't think is what you're doing.</p>",
        "id": 262464516,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637678569
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> a (delayed) question regarding option 5:<br>\nThe <a href=\"https://github.com/HealthIntersections/australian-fhir-support/blob/main/fhir/ConceptMap/covid-cvx-air-mapping.json\">ConceptMap you mention</a> does not contain a source[x] and target[x]. However, the definition of source[x] states: \"If there is no source or target value set, there is no specified context for the map (not recommended).\"</p>\n<p>I can imagine that source[x] and target[x] are absent because the mapping is bidirectional thus it's hard to point either a source or a target because they can be both, however it would in my opinion be preferable to reference the ValueSets the ConceptMap is designed for. What's your opinion on that?</p>\n<p>Also created an example of a bidirectional ConceptMap where source[x] and target[x] ValueSets are not included anymore (which feels a bit odd imho): <a href=\"https://github.com/Nictiz/Nictiz-R4-zib2020/blob/195/resources/zib/terminology/conceptmap-GeslachtCodelijst-to-AdministrativeGender.xml\">https://github.com/Nictiz/Nictiz-R4-zib2020/blob/195/resources/zib/terminology/conceptmap-GeslachtCodelijst-to-AdministrativeGender.xml</a></p>",
        "id": 269114054,
        "sender_full_name": "Niek van Galen",
        "timestamp": 1643035056
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"198646\">@Niek van Galen</span> a (delayed) answer:</p>\n<p>That's a reasonable question and I don't really know the answer. But I think we could assume that the source and target are implicitly reversible if the map contains both directions. I don't really like that answer a lot, but I don't have a better one</p>",
        "id": 271040814,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644267522
    },
    {
        "content": "<p>Sounds like a possible outcome, which we might want to document on the <code>purpose</code> element of the ConceptMap. Can you take this in consideration for the improvement of the ConceptMap resource?</p>",
        "id": 271097031,
        "sender_full_name": "Niek van Galen",
        "timestamp": 1644310362
    },
    {
        "content": "<p>yes we can but it would be great if you create the task for that and reference this dsicussion</p>",
        "id": 271106305,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644315395
    },
    {
        "content": "<p>Task is created: <a href=\"https://jira.hl7.org/browse/FHIR-36020\">https://jira.hl7.org/browse/FHIR-36020</a></p>",
        "id": 271707682,
        "sender_full_name": "Niek van Galen",
        "timestamp": 1644696952
    }
]