[
    {
        "content": "<p>Hey everybody,</p>\n<p>we are currently implementing a FHIR solution that serves different organizations. We create a dedicated FHIR organization resource for each organization and use the id of the fhir resource as part of our identifier set for other resources to see which organization sent a resource, like this:</p>\n<p>organization  id: ff9c7e42-6e68-47c3-b7df-20be15f8a499</p>\n<p>\"identifier\": [<br>\n                    {<br>\n                        \"system\": \"<a href=\"https://random_name/fhir/ff9c7e42-6e68-47c3-b7df-20be15f8a499\">https://random_name/fhir/ff9c7e42-6e68-47c3-b7df-20be15f8a499</a>\",<br>\n                        \"value\": \"0\"<br>\n                    }<br>\n                ]</p>\n<p>With that approach we have a different system for each organization and therefore no overall same system for the organizations.</p>\n<p>Another approach would be to do something like this:</p>\n<p>\"identifier\": [<br>\n                    {<br>\n                        \"system\": \"<a href=\"https://random_name/fhir/\">https://random_name/fhir/</a>\",<br>\n                        \"value\": \"0\",<br>\n                       \"assigner\": \"ff9c7e42-6e68-47c3-b7df-20be15f8a499\"<br>\n                    }<br>\n                ]</p>\n<p>Here we would use the same system for the different organizations, but have the problem, that the actual values that are used within the system are not the same over all organizations, meaning that the value of \"0\" in one organization defines something else than in the other organization. </p>\n<p>So to summarize my questions are:</p>\n<ol>\n<li>How can we state distinguish between resources that are sent to the FHIR server from different organizations best?</li>\n<li>How should we use the system/value logic to point out, that they are in fact using the same idea of the system (they want to describe patients for example), but that it could be possible that different organizations use the same value and mean a different patient?</li>\n<li>Is it mandatory that if we use the same system for different resources that the same used value should represent the same \"real\" resource?</li>\n</ol>\n<p>Thanks in advance for your help! </p>\n<p>Lukas</p>",
        "id": 245310688,
        "sender_full_name": "Lukas Rupprecht",
        "timestamp": 1625750160
    },
    {
        "content": "<p>Have you looked at Meta.source ? That would seem a more appropriate way to capture what system/organization sent a particular resource.</p>",
        "id": 245318601,
        "sender_full_name": "René Spronk",
        "timestamp": 1625753549
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/resource.html#Meta\">http://build.fhir.org/resource.html#Meta</a></p>",
        "id": 245318645,
        "sender_full_name": "René Spronk",
        "timestamp": 1625753565
    },
    {
        "content": "<p>Identifier.system indicates the \"namespace\" in which an identifier is unique.  It doesn't indicate where a given resource came from.</p>",
        "id": 245319189,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625753807
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191372\">René Spronk</span> <a href=\"#narrow/stream/179166-implementers/topic/correct.20usage.20of.20FHIR.20identifier/near/245318601\">said</a>:</p>\n<blockquote>\n<p>Have you looked at Meta.source ? That would seem a more appropriate way to capture what system/organization sent a particular resource.</p>\n</blockquote>\n<p>I will have a look into that, thank you!</p>",
        "id": 245402306,
        "sender_full_name": "Lukas Rupprecht",
        "timestamp": 1625807797
    },
    {
        "content": "<p>I have a similar kind of challenge.  We have a lot of Identifiers that are effectively internal system IDs. They only make sense to the source EMR or Labs system that originated the data.  There is no public URI to define the <a href=\"http://system.name\">system.name</a>.  We could point to the website of the source EMR, or the host Hospital... what is best identifier system name in this kind of case?</p>",
        "id": 245467678,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1625849432
    },
    {
        "content": "<p>If you are making up values just to \"fill a slot\" where that value has no meaning to a consumer, why bother including it at all?<br>\nIf labcorp sends you result 123245515242312, you should contact labcorp to tell you the unique system value, that way labcorp (hopefully) tells every consumer of their data the same value. LabCorp is the assigning authoriy, labcorp should state what their assigning authority name (url is). When they have the same value then consumers can correlate with other consumers of labcorp data.</p>",
        "id": 245473823,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1625852363
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192548\">@Alan Pinder</span> yes you can make one up using the appropriate domain name e.g. <a href=\"http://myhospital.nhs.org/lab/accession\">http://myhospital.nhs.org/lab/accession</a>. That is specific to you, unless someone else starts using your domain, so you can control it and make it unique and consistent and that is all you need. <br>\nTechnically it has no semantic meaning and is just a unique string of bytes, but using the uri makes it manageable and readable. Ideally keep a register of them, and/or tell a regional entity about them, so they can be looked up and people can know what it refers to should that ever be necessary. You can use a NamingSystem resource on a FHIR server if you want to record them that way.</p>",
        "id": 245483888,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1625857319
    },
    {
        "content": "<p>The purpose of the URI isn't necessarily to resolve (though it's nice if it does), it's to provide a unique namespace such that the combination of URI + value is globally unique and can be safely matched.  It means that when data flows via multiple paths, you can know that you're looking at the same thing as opposed to something at coincidentally happens to share the same number sequence.  Without a system, the best you can do when comparing values is flag them as 'candidate matches'.</p>",
        "id": 245484222,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625857537
    },
    {
        "content": "<p>We're supplying the medicare beneficiary id (MBI) as one of the identifiers in the Patient resource, using \"<a href=\"http://hl7.org/fhir/sid/us-mbi\">http://hl7.org/fhir/sid/us-mbi</a>\" as the .system value, as specified by the <a href=\"http://www.hl7.org/fhir/identifier-registry.html\">identifier registry</a>.  Two questions:  1. The FHIR validator throws an error (\"URL xxx does not resolve\").  Given Lloyd's comment above that URI doesn't necessarily have to resolve and is just a namespace, why does the Validator throw an error instead of an Information or Warning?  2. It seems like the <a href=\"http://hl7.org/fhir/sid\">hl7.org/fhir/sid</a> URL should resolve but is broken - it reports an error: \"Internal Error - unknown id us-mbi (from crsid.asp) .\"  Thanks as always for any insights.</p>",
        "id": 265320470,
        "sender_full_name": "Bill Harty",
        "timestamp": 1639757718
    }
]