[
    {
        "content": "<p>Our clients send encrypted subscriber id. However, there is no way to know that it's been encrypted. Has anyone dealt with this by adding extensions? Should the base FHIR element be changed to indicate this?</p>",
        "id": 261830109,
        "sender_full_name": "Debra Mangum",
        "timestamp": 1637174883
    },
    {
        "content": "<p>that is a very \"interoperability hostile\" act by them. Best solution is to \"stop doing that\"... it does not stop coorelation, as n encrypted id is still unique.</p>",
        "id": 261831686,
        "sender_full_name": "John Moehrke",
        "timestamp": 1637175602
    },
    {
        "content": "<p>Saying the member id is A721s8721L instead of 12356789 essentially means they're lying.  If you send a value in Identifier.value, that <em>must</em> actually be the identifier.  If you want to send something else (a truncated value, a partial value, an encrypted value, a mnemonic for the value, whatever), then that should be done as an extension.</p>",
        "id": 261950276,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637252326
    },
    {
        "content": "<p>Not sure if this is compliant or 'in the spirit' but I've seen obfuscated (masked) data like *'ed SSNs in Patient.identifiers, e.g. <code>***-**-1234</code>, seems to make sense from a patient privacy (PHI) perspective to some degree but then what can you do with that other than partial SSN matching?</p>",
        "id": 261958662,
        "sender_full_name": "John Silva",
        "timestamp": 1637255576
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298707\">@John Silva</span> that is different. In that case the resource (Patient) .meta.security can indicate that the data has been redacted, and even that element could be indicated as having been redacted (if you use the DS4P IG extension for element tagging).</p>",
        "id": 261964660,
        "sender_full_name": "John Moehrke",
        "timestamp": 1637258063
    },
    {
        "content": "<p>For SSN, there is a <a href=\"https://build.fhir.org/extension-rendered-value.html\">rendered-value extension</a> for masking.  You shouldn't be sending the masked SSN in the actual value property.</p>",
        "id": 261977495,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1637263627
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> - yes, that's exactly where I saw it, in Epic's Patient resource:</p>\n<p><code>        {\n            \"use\": \"usual\",\n            \"system\": \"urn:oid:2.16.840.1.113883.4.1\",\n            \"_value\": {\n                \"extension\": [\n                    {\n                        \"valueString\": \"xxx-xx-9999\",\n                        \"url\": \"http://hl7.org/fhir/StructureDefinition/rendered-value\"\n                    }\n                ]\n            }\n</code></p>",
        "id": 261980147,
        "sender_full_name": "John Silva",
        "timestamp": 1637264670
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298707\">@John Silva</span> this further corroborates Lloyd's point that</p>\n<blockquote>\n<p>If you send a value in Identifier.value, that must actually be the identifier</p>\n</blockquote>",
        "id": 261984518,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1637266699
    }
]