[
    {
        "content": "<p>Given that the current vaccine for COVID takes two doses... How does that get recorded? Is there an indication in the Immunization record that only 1 of 2 was given? When the second dose is given is that a second Immunization record? Or is it expected that the first Immunization record is updated? If it is updated, does that mean that a human MUST get their second dose from the same provider?</p>",
        "id": 219251312,
        "sender_full_name": "John Moehrke",
        "timestamp": 1607456034
    },
    {
        "content": "<p>I expect a new immunization instance for each attempted immunization administration</p>",
        "id": 219255697,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1607458158
    },
    {
        "content": "<p>Immunization indicates the administration of a single dose of a vaccine.  It does <em>not</em> on its own indicate the presence of immunity.  ImmunizationForecast would tell you whether you are 'due' for any immunizations.  If it comes back and says you're good, then according to the protocol used by the decision support engine that generated the forecast, you've met the requirements of the protocol - and have a percentage chance of immunity as the vaccine protocol delivers.</p>",
        "id": 219256316,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607458457
    },
    {
        "content": "<p>protocolApplied can be used to inform whether it is a first or second dose, but I am not sure if countries will issue a MedRequest to trigger the process</p>",
        "id": 219256806,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1607458670
    },
    {
        "content": "<p>ImmunizationEvaluation holds the result of evaluating a single event (an Immunization resource) against a selected schedule (usually done by CDS software (stand alone or integrated into another systems like an EHR or IIS). If that  system generates recommendations (which most will), then ImmunizationRecommendation is used to suggest any required doses. In the case of COVID, the person doesn't have to go back to the same provider, but they must get the same type of vaccine (either Pfizer or Moderna) as the first dose, so access to that information (either in electronic form or on paper) from the first dose will be important.</p>",
        "id": 219333106,
        "sender_full_name": "Craig Newman",
        "timestamp": 1607519233
    }
]