[
    {
        "content": "<p>Hello everyone, I joined this community maybe a month ago because I was working on a iOS/Android(Native) application that will allow users to maintain their covid-19 status (last known test days and symptoms) and show healthcare providers the types of blood types of covid donors available to healthcare providers that sign up through a map or list view.  Proud to say that while working with google on FHIR and all the resources given here that we are gearing up for our first pitch! Thank you to everyone here you guys are great! <br>\nThe current website is <a href=\"http://lavendalehealth.com\">lavendalehealth.com</a><br>\nany advice is greatly appreciated! Im 22 years old, still in college and feel overwhelmed by this industry but want to give it all I got and need guidance.</p>",
        "id": 197772085,
        "sender_full_name": "Quin'darius Lyles-Woods",
        "timestamp": 1589596732
    },
    {
        "content": "<p>I have zero advice to give on making a pitch, but welcome and glad you're finding the community helpful :)</p>",
        "id": 197773338,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589598632
    },
    {
        "content": "<p>I think you've got a great start with a good color scheme.  I'd block out the company logo stuff until you hve something to put there</p>",
        "id": 197774001,
        "sender_full_name": "David Johnson",
        "timestamp": 1589599625
    },
    {
        "content": "<p>And if you're going to collect email addresses, get a privacy policy up there before you do anything alerting users of what it's used for.</p>",
        "id": 197774016,
        "sender_full_name": "David Johnson",
        "timestamp": 1589599653
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> haha well if you know anyone please dont hesitate to send them over!</p>",
        "id": 197788639,
        "sender_full_name": "Quin'darius Lyles-Woods",
        "timestamp": 1589624344
    },
    {
        "content": "<p>Thank you so much <span class=\"user-mention\" data-user-id=\"193461\">@David Johnson</span>  doing that now!</p>",
        "id": 197788654,
        "sender_full_name": "Quin'darius Lyles-Woods",
        "timestamp": 1589624393
    }
]