[
    {
        "content": "<p>A few discussions into the topic, and we (Belgium) see a previous issue appearing: </p>\n<ul>\n<li>We have an extension for AdministeredProduct, where we store the actual administered product (i.e. which brand name, which serial number). This is really not just a coding translation. It's a different set of information.</li>\n</ul>",
        "id": 213128271,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602580049
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> I mentioned this before - for \"simple\" vaccination registers, I can understand we just want the code of the vaccine + lot; for COVID, especially this being a cross-border issue, I think this gap in Immunization is relevant. How do you see it?</p>",
        "id": 213128463,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602580140
    },
    {
        "content": "<p>We have cross-border supply, and also cross-border case follow up, like patient gets a vaccine in country 1, then must be followed in country 2</p>",
        "id": 213128627,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602580232
    },
    {
        "content": "<p>I may have forgotten the details from when we discussed earlier this year, but what is there in Medication that isn't already in the Immunization resource? Lot Number, Expiration Date and Manufacturer are all available. Are you concerned about the potentially large number of different COVID vaccines under development that might need to be kept separate?</p>",
        "id": 213149717,
        "sender_full_name": "Craig Newman",
        "timestamp": 1602593895
    },
    {
        "content": "<p>the discussion was about a clear(er) separation between the code of the vaccine (HPV, MMR) and the code of the product.</p>",
        "id": 213156123,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602596861
    },
    {
        "content": "<p>One important argument is that, indeed - a code for \"COVID19 vaccine\" doesn't mean much, since you will have many different types of vaccines</p>",
        "id": 213156389,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602596971
    },
    {
        "content": "<p>I hope we also need to add serial numbers there</p>",
        "id": 213156446,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602596999
    },
    {
        "content": "<p>It depends on how granular the vaccine codes are. In some locations (<strong>warning US-bias coming up</strong>), the code is very granular (eg. the NDC) and can be used to populate Immunization.code. I don't know if that is the rule or the exception in other countries.</p>",
        "id": 213165896,
        "sender_full_name": "Craig Newman",
        "timestamp": 1602600420
    },
    {
        "content": "<p>Is serial number available in Medication? Do you know how a serial number varies from the lot number?</p>",
        "id": 213165967,
        "sender_full_name": "Craig Newman",
        "timestamp": 1602600449
    },
    {
        "content": "<p>There is the serialization directive that mandates medications to have a serial number</p>",
        "id": 213175988,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602604091
    },
    {
        "content": "<p>Having a serial number is one of the supporting factors to check for a drug authenticity - which I fear is going to be a big problem for COVID vaccines</p>",
        "id": 213176067,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602604135
    },
    {
        "content": "<p>The lot number changes with every production batch. The serial number is different for each physical item on a shelf</p>",
        "id": 213176170,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602604185
    },
    {
        "content": "<p>Sounds like the \"serialization\" might be similar to the NDC concept we use in the US? It identifies a specific product that has been approved for use in the country. </p>\n<p>In our current model the immunization administered may be a generic indication of \"Polio\" or \"COVID-19\" or a specific indication of the actual product. The \"National Drug Code\" NDC indicates itself the manufacturer, the product, and sometimes even differentiates from packaging. In the US we would expect that the sender to indicate either/both the generic and specific drug code. </p>\n<p>This is a bit different than the recommendation one where we have two different places, one to indicate the general concept of the vaccination being prevent and another to indicate the specific vaccine to give.</p>",
        "id": 213188927,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1602609829
    },
    {
        "content": "<p>serialization is a EU initiative to put a serial number on each individual medication package</p>",
        "id": 213191882,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602611265
    },
    {
        "content": "<p>so, my covid vaccine cannot have the same serial number as your covid vaccine. if it does, we can be pretty sure that at least one of them is not legitimate</p>",
        "id": 213192090,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602611368
    },
    {
        "content": "<p>Would the serial number than be an occurrence of Medication.identifier? Can Medication be used to identify a single instance of a medication (as opposed to an orderable class of medication)? In R5 it looks like there is a new AdministerableProductDefinition, but that seems to define a class of thing rather than an instance of something.</p>",
        "id": 213206250,
        "sender_full_name": "Craig Newman",
        "timestamp": 1602617624
    },
    {
        "content": "<p>Medication.identifier is indeed to identify a single instance - either an actual serial number on a vial - or even a capsule, or a numbered 'baggie' issued by a dispensing system.</p>",
        "id": 213208017,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602618509
    },
    {
        "content": "<p>AdministrableProductDefinition does not apply here,</p>",
        "id": 213214726,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602622163
    },
    {
        "content": "<p>but actually what you mention <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> is what we did: We added an extension called administeredProduct which is a reference to a Medication, where we do all the details we want.</p>",
        "id": 213215078,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602622348
    },
    {
        "content": "<p>(IIRC that was the addition we suggested to immunization)</p>",
        "id": 213215116,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602622375
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/COVID.20Immunization/near/213208017\">said</a>:</p>\n<blockquote>\n<p>Medication.identifier is indeed to identify a single instance - either an actual serial number on a vial - or even a capsule, or a numbered 'baggie' issued by a dispensing system.</p>\n</blockquote>\n<p>That is exactly why we added identifier to Medication.  It didn't use to have an identifier but the serial number use case made us add it.</p>",
        "id": 213215167,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602622400
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> There are conceptual differences in Medication and Immunization.  Most of the similarities end with manufacturer, lot, expiration.  Immunizations are once (or a short series) and then track reactions for a long period.  Medication may start stop, change lot, manufacturer.</p>",
        "id": 213239118,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1602640775
    },
    {
        "content": "<p>The immunization resource does not track reactions for a long period.</p>",
        "id": 213253543,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602659782
    },
    {
        "content": "<p>In terms of product handling / description, a vaccine is just another medicinal product (and that is missing from the immunization)</p>",
        "id": 213253590,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602659840
    },
    {
        "content": "<p>FYI, related interest to people reading this thread: <a href=\"https://www.who.int/groups/smart-yellow-card-working-group\">https://www.who.int/groups/smart-yellow-card-working-group</a></p>",
        "id": 213255557,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602661418
    },
    {
        "content": "<p>To avoid going off on a tangent here, I created a new thread to ask a questions about the scope of Medication. If you have a chance, please take a look at <a href=\"#narrow/stream/179166-implementers/topic/Medication.20Resource.20Scope\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Medication.20Resource.20Scope</a></p>",
        "id": 213279945,
        "sender_full_name": "Craig Newman",
        "timestamp": 1602678114
    },
    {
        "content": "<p>The Immunization resource is about the administration of a vaccine to a patient. The question is whether or not the vaccine itself should be described with a Medication resource. I'm still not clear what (other than the serial number) Medication provides that isn't already in Immunization. How does any additional information in Medication facilitate cross border supply? I agree that an immunization series for any COVID vaccine is likely to have to be the same product (vaccines won't be interchangeable in a multi-dose series for a given patient) but if the product code (Immunization.vaccine) is granular to a product, would that be sufficient?</p>",
        "id": 213280518,
        "sender_full_name": "Craig Newman",
        "timestamp": 1602678445
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> what vaccine code system is used in Europe? Is it SNOMED or is there a European set of codes equivalent to US CVX and NDC codes?<br>\n<span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> Canada uses SNOMED for vaccine right?</p>",
        "id": 213280659,
        "sender_full_name": "Craig Newman",
        "timestamp": 1602678511
    },
    {
        "content": "<p>Yes, we do.</p>",
        "id": 213304521,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602688528
    },
    {
        "content": "<p>I expect Belgium will use SNOMED for the vaccine code, not for the product codes. I understand some other countries are going to do that too. But I don't know for the entire continent.</p>",
        "id": 213524316,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602831574
    }
]