[
    {
        "content": "<p>Is there a way to create a JSON representation for a profile? As far as I understand the excel sheets provided for FHIR are for making an XML version, and I was wondering if there was a way to save the output from this file as JSON or if there is a recommended way to convert it?</p>\n<p>Thanks in advance.</p>",
        "id": 153863435,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1481731868
    },
    {
        "content": "<p>Everything in FHIR has both an XML and a JSON representation. If you look at the StructureDefinition this is actually how Profiles are described and the StructureDefinition (like any other Resource) can be represented in both XML and JSON</p>",
        "id": 153863436,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1481732131
    },
    {
        "content": "<p>Thanks for your response Andy.</p>\n<p>I am not sure if I made my question clear. As far as I understood from your response I can view the JSON representation of existing profiles/resources. My question was about creating a new profile or resource in JSON format. As far as I understand, the excel templates for this will output an xml format, but not in the JSON format. Is there a proper way to do generate a new profile/resource directly into JSON or a good way to convert between xml and JSON?</p>",
        "id": 153863444,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1481736571
    },
    {
        "content": "<p>Ah. My understanding of the build is that there is a transform that takes the Excel spreadsheet in XML form and converts it into a FHIR StructureDefinition in XML format. I have not examined this part of the build, so you would want to verify that my statement is actually true. Theoretically, you could produce a JSON StructureDefintion and submit it to one of the JSON-&gt;XML conversion app that are out there to convert your JSON into an XML version.</p>\n<p>Also AFAIK the Excel spreadsheet is an input gathering tool. I believe (and this is totally a guess on my part, need to confirm with Furore) Forge deals only with XML/JSON StructureDefinitions and not the initial Excel format at all. </p>",
        "id": 153863446,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1481737161
    },
    {
        "content": "<p>Thanks again for taking the time to respond.</p>\n<p>So just to clarify, your suggestion is that I use the Excel form to generate an XML version and then use a converter to go from XML -&gt; JSON?</p>\n<p>If so, are there any tools you could recommend for doing so?</p>",
        "id": 153863447,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1481737345
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193151\">@Sadiq Saleh</span> Sorry, I may not have been clear. The Excel template file is to enable people a way to produce profiles but the recommended tool to use is Forge. The Excel template file does not produce a FHIR StructureDefinition in XML (it produces an Excel 2003 XML file) which would need to be run through a conversion to produce the proper structure definition.</p>\n<p>Again the recommended tool for producing profiles is Forge. I believe that once you have defined your profile using Forge, you should be able to get the JSON representation of it (as a StructureDefinition resource)</p>",
        "id": 153863448,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1481737996
    },
    {
        "content": "<p>Perfect, that clarified things completely! Thanks again Andy.</p>",
        "id": 153863449,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1481738045
    },
    {
        "content": "<p>If you then let Forge upload your profile to <a href=\"http://Simplifier.net\" target=\"_blank\" title=\"http://Simplifier.net\">Simplifier.net</a>, you can view it from there in xml, json or rendered as a tree, just as you (or anyone else) sees fit.</p>",
        "id": 153863450,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1481739277
    },
    {
        "content": "<p>Thanks for the reply Christiaan. I looked at the webpage for Forge and noted that it is configured for the DSTU2 implementation, whereas we are working with DSTU3. Are there any tools available for DSTU3 or should I build in Forge and edit to make the output DSTU3 compliant?</p>",
        "id": 153863451,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1481739451
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193151\">@Sadiq Saleh</span> Excel spreadsheets are not converted directly to XML.  The FHIR build process parses them directly into memory as part of the build process.  The build process then produces XML, JSON and TTL representations.  The spreadsheet mechanism will be retired once Forge supports the complete set of functionality needed by all profile builders.  (In practice, spreadsheets have limitations too, so some profilers author directly in XML or JSON.  The publication tooling will take any of the syntaxes as input and will generate the other representations.</p>",
        "id": 153863627,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481817443
    },
    {
        "content": "<p>Thank you all for your responses. They have helped me gain a better understanding of the process, and answered my questions.</p>",
        "id": 153863700,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1481896523
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193151\">@Sadiq Saleh</span> (apologies for the slow response...) Forge does not yet support STU3. We will update all our tools for STU3 after final publication. As a workaround, you could convert existing profiles from DSTU2 to STU3, either manually or using a transform.</p>",
        "id": 153864253,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1482229746
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> <br>\nI have been working with the excel templates to try and build it that way. Could you point me in the direction of a resource that could elaborate on transforming from DSTU2 to 3? I have seen mention of a converter in GForge but haven't managed to find it yet.</p>",
        "id": 153864291,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1482248430
    },
    {
        "content": "<p>@Sadiq I am not aware of any official tooling that supports DSTU2 &lt;=&gt; STU3 conversion. Maybe the FHIR profiling community can help you out?</p>",
        "id": 153864298,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1482249234
    },
    {
        "content": "<p>Thanks for the follow up. I will keep searching.</p>",
        "id": 153864299,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1482249398
    },
    {
        "content": "<p>there is java code in org.hl7.fhir.convertors.VersionConvertor_10_20 in the Java  Reference implementation. Then there is a project to define StructureMap transforms for all the DSTU2 resources that is just getting underway</p>",
        "id": 153864347,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1482265215
    },
    {
        "content": "<p>Thanks Grahame. I will take a look at those resources.</p>",
        "id": 153864406,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1482267488
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span> sap.comMFHIRZPw2016</p>",
        "id": 174965679,
        "sender_full_name": "Bettina Lieske",
        "timestamp": 1567684313
    },
    {
        "content": "<p>??</p>",
        "id": 174986172,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1567698033
    }
]