[
    {
        "content": "<p>Hello,<br>\nI have resources mocked up on our internal FHIR server that we have used to test code we are planning to bring to the Connectathon.  How do I export out a bundle of those resources so that they can be loaded onto a public server? <br>\nThank you!</p>",
        "id": 153990838,
        "sender_full_name": "Angie Romano",
        "timestamp": 1535141351
    },
    {
        "content": "<p>You could query for them and then tweak your Bundle to turn it into a Batch or Transaction.</p>",
        "id": 153990870,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535149693
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>!  I'm working on tweaking a Bundle to a transaction.  I have a couple of questions.  I have a number of resource types in my dataset.  Many of the resources contain references to other resources.  Can I specify the resource _id like I can with the PUT command so my references don't break?  </p>\n<p>Second question: For the \"fullurl\" for each entry.  I found an example on the hl7 site that reference urn:uuid.  Do I just generate a uuid for each record?</p>",
        "id": 153991055,
        "sender_full_name": "Angie Romano",
        "timestamp": 1535397007
    },
    {
        "content": "<p>Hi again <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>!  I answered my own questions and I think I'm good.  Thank you!</p>",
        "id": 153991067,
        "sender_full_name": "Angie Romano",
        "timestamp": 1535399072
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195175\">@Angie Romano</span> Great!  If you like, you can post your answers here so anyone who comes across this question when searching the forum can benefit from your work too :)</p>",
        "id": 153991071,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535404154
    },
    {
        "content": "<p>Sure <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>!</p>\n<p>I queried my FHIR server to create a bundle of the resources I needed.  Then I tweaked that bundle to create a bundle-transaction using the example found here: <br>\n<a href=\"https://www.hl7.org/fhir/bundle-transaction.json.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/bundle-transaction.json.html\">https://www.hl7.org/fhir/bundle-transaction.json.html</a><br>\nI generated uuid's for the fullURL of each resource<br>\nI also wanted each resource to use a specific id so I had to change the request section from:<br>\n\"request\": {<br>\n        \"method\": \"POST\",<br>\n        \"url\": \"Organization\"<br>\nto:<br>\n \"request\": {<br>\n                \"method\": \"PUT\",<br>\n                \"url\": \"Organization/xxxx11111\"</p>",
        "id": 153991679,
        "sender_full_name": "Angie Romano",
        "timestamp": 1535571268
    },
    {
        "content": "<p>That works - but only if the server allows client id assignment.   (Many do not...)</p>",
        "id": 153991680,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535571625
    },
    {
        "content": "<p>Hello, <span class=\"user-mention\" data-user-id=\"195175\">@Angie Romano</span>, how many patients with how many other resource instances does your mockup include ? I am currently looking for something like such a mockup. Do you plan to publish your bundle/transaction after the connectathon ?<br>\nGreetings</p>",
        "id": 153991826,
        "sender_full_name": "Georg Fette",
        "timestamp": 1535617542
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span>!  It's a small dataset built exclusively for the Clinical Trial RWE use case that we will be working on at the Connectathon in September.  We will make the data available publicly and it will be loaded on an HSPC sandbox.  It consists of 5 Organizations, 5 Patients, 3 Practitioners, 1 ResearchStudy, 4 ResearchSubjects, 3 Encounters, and 14 Observations records.  When we have them published, I'll reply with the Github information.  Thank you! Angie</p>",
        "id": 153991898,
        "sender_full_name": "Angie Romano",
        "timestamp": 1535634154
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> .Good point!..in the real world I wouldn't need the ID's to be hard coded, but I do for the test data I'm generating for the Connectathon since they are all tied together and don't have time to write an API to look them up before adding them  :)</p>",
        "id": 153993143,
        "sender_full_name": "Angie Romano",
        "timestamp": 1536090007
    }
]