[
    {
        "content": "<p>Is it possible to create a profile of DomainResource using Forge, i.e. a custom FHIR resource that does not inherit from any existing resource definitions?</p>\n<p>DomainResource is not present on the Create new Resource profile screen. I tried to use Derived profile option, using the DomainResource StructureDefinition within the \"definitions.json\" pack, but it doesn't seem to load the base profile. No error message is displayed.</p>",
        "id": 156736928,
        "sender_full_name": "John Grimes",
        "timestamp": 1548288480
    },
    {
        "content": "<p>No, that's not possible.  However, you can profile Basic.</p>",
        "id": 156742051,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548294771
    },
    {
        "content": "<p>(Basic is the intended resource to use when creating 'custom' resources.)</p>",
        "id": 156742064,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548294789
    },
    {
        "content": "<p>Ok, thanks, I didn't know about Basic.</p>",
        "id": 156747864,
        "sender_full_name": "John Grimes",
        "timestamp": 1548303969
    },
    {
        "content": "<p>Forge explicitly prohibits you from creating profiles on core types Resource, DomainResource, Extension, ElementDefinition and BackboneElement. In theory, the application could allow and support this scenario. However FHIR explicitly disallows this and most systems (including our own Firely tools) will not be capable of handling them.</p>",
        "id": 156760095,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1548322626
    },
    {
        "content": "<p>Technically, Forge does allow creating profiles on Extension - it just uses a different interface for doing so to make sure the rules are followed.  (A profile on Extension is just an extension definition)</p>",
        "id": 156781914,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548344615
    },
    {
        "content": "<p>Of course - thanks for clarification Lloyd</p>",
        "id": 156782371,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1548344889
    }
]