[
    {
        "content": "<p>When creating a new Patient, we expect the server to generate a Patient.identifier.value (e.g. MRN).  Since our server supports multiple organizations (i.e. assigners/systems), we need to know which organization should be the assigner of any new/auto-created identifiers for the patient.  We can derive the system once we know the assigner.</p>\n<p>We discussed Patient.managingOrganization, but dislike that approach since there isn't a single organization that acts as the custodian of the Patient record in our system.</p>\n<p>Is it standard practice to interpret a Patient.identifier with assigner, but without value as an ask of the assigner to issue a value?</p>",
        "id": 153916281,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1509034350
    },
    {
        "content": "<p>I think you mean \"leaving identifier value empty but fill in an assigner, and then the assigner will know to assign a value\". Could work in some cases, but perhaps not standard practice.<br>\nCould you also not resort to an operation?</p>",
        "id": 153916298,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509042124
    },
    {
        "content": "<p>I think the standard interpretatin would be \"I don't know the value of the identifier assigned by XYZ\".  There's no way using standard REST to say \"please make the following modification to this record\".  That doesn't mean you couldn't adopt a local convention, but you'd need site-specific agreement for anyone to adhere to it.  As Jose says, operations are your best bet for this sort of functionality</p>",
        "id": 153916299,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1509043227
    },
    {
        "content": "<p>Wouldn't use of an operation also need a site-specific agreement for everyone to adhere to? I'm not suggesting one way is better than the other, just that I don't see an obvious advantage of a operation. You could also use a data-not-present extension to say \"not yet assigned, please assign it.\"</p>",
        "id": 153916346,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1509057136
    },
    {
        "content": "<p>Well, with an operation, declaration of support or not is clear.  And the definition of the expected behavior is clear.  If you see a server supports the operation, no negotiation is required.  Treating special partially populated data \"specially\" on the other hand is absolutely going to require site-by-site negotiation.</p>",
        "id": 153916349,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1509061519
    },
    {
        "content": "<p>Seems like this might be a common use case (to request a new MRN or other identifier), so I may log a tracker to get some official guidance in the spec.</p>",
        "id": 153916473,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1509118996
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14099\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14099\">GF#14099</a> has been logged asking for guidance on a consistent approach to requesting an identifier from a given assigner (often MRNs when creating the Patient)</p>",
        "id": 153916475,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1509119621
    },
    {
        "content": "<p>Specifically: This is essentially the patient registration process, which would be very common, correct?</p>",
        "id": 153916476,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1509119654
    },
    {
        "content": "<p>I wouldn't mind having a standard operation for that...</p>",
        "id": 153916514,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1509123467
    },
    {
        "content": "<p>Sounds fairly common (for Encounters, too)</p>",
        "id": 153916515,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1509123485
    },
    {
        "content": "<p>options / Ideas: <br>\n$generate_identifier?assigner=&lt;assigner_here&gt;  (explicit generate an identifier)<br>\n$obtain_identifier?assigner=&lt;assigner_here&gt;  (can be used to obtain and also to lookup an identifier)<br>\nDepends on the scope we need, i guess</p>",
        "id": 153917058,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509538822
    },
    {
        "content": "<p>Interesting. Normally the workflow to obtain an identifier is much more elaborate that just asking for a number, right?</p>",
        "id": 153917065,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1509546939
    },
    {
        "content": "<p>yes, the operation is assuming that the workflow is \"hidden\" behind it. That is what I understand from Michelle's problem and the idea of a standard operation.</p>",
        "id": 153917143,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509554101
    },
    {
        "content": "<p>can we define an operation without specifying its implementation details? I assumed so.</p>",
        "id": 153917144,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509554143
    },
    {
        "content": "<p>My main concern about the operation: some systems won't let you assign the identifier without the patient being in the system. This also makes registration (just creating the patient) at least a 2 step process.</p>",
        "id": 153917149,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1509554551
    },
    {
        "content": "<p>What you really want is \"here is this patient I want to register, the identifiers that are automatically assinged should come from X system?\"</p>",
        "id": 153917152,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1509554708
    },
    {
        "content": "<p>you mean when you do the first POST, you provide some data to generate an identifier?</p>",
        "id": 153917153,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509554783
    },
    {
        "content": "<p>And then in the future: \"here is this patient that already has some identifiers, I would like some more/for this patient to be recognized by a new system as well\"</p>",
        "id": 153917154,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1509554791
    },
    {
        "content": "<p>Yes, but as Grahame has pointed out on the tracker, I think there are \"create both patient and identifier\" and \"create new identifiers for existing patient\"</p>",
        "id": 153917155,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1509554838
    },
    {
        "content": "<p>i see two things: create patient and create ID.</p>",
        "id": 153917156,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509554865
    },
    {
        "content": "<p>requiring them to actually be implemented in the API separately seems unfortunate</p>",
        "id": 153917157,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1509554903
    },
    {
        "content": "<p>\"let me write this patient with no identifiers, trust me, I'll come back and give you real identifiers eventually...\" :)</p>",
        "id": 153917158,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1509554926
    },
    {
        "content": "<p>seems less efficient, but i would not say unfortunate for that fact. It's easier to combine functionality than to split.</p>",
        "id": 153917160,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509555054
    },
    {
        "content": "<p>tracker says: An Identifier.assigner populated without Identifier.value populated</p>",
        "id": 153917161,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509555082
    },
    {
        "content": "<p>That could be an interesting option locally, as said above in this thread. <br>\nTo make it global, this would mean that provider an assigner would ALWAYS create an identifier, right?</p>",
        "id": 153917163,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509555157
    },
    {
        "content": "<p>(sorry for caps)</p>",
        "id": 153917164,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509555167
    },
    {
        "content": "<p>this means that we would never support \"here is a patient, i know his ID is a SSN but I don't know it now\", right?</p>",
        "id": 153917165,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509555235
    },
    {
        "content": "<p>I don't think there's anything in the actual spec that prevents that right now, btw</p>",
        "id": 153917168,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1509555365
    },
    {
        "content": "<p>this all comes down to business logic in the server or client itself. Technically, I <em>could</em> write something like \"i bet he has an SSN but I don't know the actual value\"</p>",
        "id": 153917169,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1509555408
    },
    {
        "content": "<p>i am just saying that my reading of the option \"An Identifier.assigner populated without Identifier.value populated\" is \"whenever we have an assigner and no ID,  please create an ID\"</p>",
        "id": 153917170,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509555435
    },
    {
        "content": "<p>and if my logic is correct, this means that we would not support \"whenever we have an assigner and no ID, please lookup the ID\"</p>",
        "id": 153917171,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509555519
    },
    {
        "content": "<p>I think there are currently 3 options (knowing there could be a better option still), one is unpopulated. One mentions operations, one mentions DAR with a special value asking the server to populate...</p>",
        "id": 153917172,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1509555579
    },
    {
        "content": "<p>(on the actual tracker)</p>",
        "id": 153917173,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1509555588
    },
    {
        "content": "<p>I agree just leaving it blank seems to leave intent open for interpretation</p>",
        "id": 153917174,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1509555605
    },
    {
        "content": "<p>what _could_ be more global is <br>\n\"if a resourceX has an assigner and no ID for that assigner, the system is in charge of finding out whether this  needs to be created or looked up\"</p>",
        "id": 153917175,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509555628
    },
    {
        "content": "<p>but i think even this could be challenged, e.g. if you just want to leave it as is.</p>",
        "id": 153917176,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509555645
    },
    {
        "content": "<p>this reasoning is for option 3 in the tracker (leaving empty implying some behaviour)</p>",
        "id": 153917177,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1509555721
    },
    {
        "content": "<p>we can define an operation to issue an identifier without requiring that it be a separate step. But if we want to describe a standard API for registering a patient... that's more than just 'create a patient resource'</p>",
        "id": 153917254,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1509576131
    },
    {
        "content": "<p>Do we want to include identifier assignment for national IDs?  That might lean more toward a registration operation, since some national IDs encode patient demographics in the ID (I'm looking at you Denmark).  P.S. I'm not endorsing or encouraging demographic encoding in IDs... just saying that it's a thing.</p>",
        "id": 153917365,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1509647506
    },
    {
        "content": "<p>I guess that could also be related, where there is a national identifier, and the need to start the process for getting one in maternity. But I suspect this is outside of this scope anyway.</p>",
        "id": 153918795,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1510300987
    },
    {
        "content": "<p>I like the way <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> has worded it. Seems to cover Michelles case ok.</p>",
        "id": 153918796,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1510301021
    },
    {
        "content": "<p>This has been floating around for a bit, and we should discuss in person at the Jan WGM</p>",
        "id": 153926297,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1513714865
    },
    {
        "content": "<p>What do folks think of the option of adding a new value of \"request-to-generate\" to Identifier.use to indicate that an Identifier should be issued for the specified system/assigner/type?</p>",
        "id": 153933094,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1517260287
    },
    {
        "content": "<p>This seemed to make sense to several folks in the PA discussion, as (excepting \"official\"), the Identifier.use values basically track the workflow steps involved in managing the lifecycle of an identifier.</p>",
        "id": 153933095,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1517260352
    },
    {
        "content": "<p>do we have a difference between  \"request-to-generate\" and \"an-identifier-was-requested-but-it-was-not-yet-given-so-i-can't-really-capture-it-here\" ?</p>",
        "id": 153933099,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1517261694
    },
    {
        "content": "<p>So for now, PA is not going to pursue the Identifier.use.  It was something we were considering at the end of Q3, but that was soooo last quarter.  We've moved on.  But if we had, I think the\"an identifier-was-request-but-not-yet\" scenario would just be an absent identifier.  Since you aren't asking for any <em>change</em> to the identifier state.</p>",
        "id": 153933100,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1517261869
    },
    {
        "content": "<p>\"soo last quarter\"... excellent</p>",
        "id": 153933104,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517262922
    }
]