[
    {
        "content": "<p>Question I've been asked:<br>\nif an Observation refers to both a Patient and Encounter, does the Encounter have to refer to the same patient.</p>",
        "id": 153867650,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484595360
    },
    {
        "content": "<p>my usual answer to this is : probably, but it's very difficult to say that absolutely must</p>",
        "id": 153867651,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484595370
    },
    {
        "content": "<p>but is there anywhere in the spec where we really have to have consistent references like this?</p>",
        "id": 153867652,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484595391
    },
    {
        "content": "<p>I think it is best practice, but not always enforceable. Patient is optional on encounter. What happens if you create the Encounter first (without a patient), then create the Patient, and finally the Observation that points to both. </p>",
        "id": 153867653,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1484595592
    },
    {
        "content": "<p>If we go by the 80-20 rule, wouldn't you say that they must match, and outliers need an extension?</p>",
        "id": 153867654,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1484595619
    },
    {
        "content": "<p>I understand the question for the cases when the reference to patient is present in both places</p>",
        "id": 153867655,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1484595680
    },
    {
        "content": "<p>80-20 rule - have to understand this: it is about design disagreement</p>",
        "id": 153867658,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484596705
    },
    {
        "content": "<p>it's not just patient, but patient is probably the most iportnat</p>",
        "id": 153867661,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484596725
    },
    {
        "content": "<p>If the encounter and the observation \"almost always\" point to the same patient, that is 80+% of the cases. This also allows cases of encounter without patient to default implicitly to the patient in the observation. A \"third-party encounter\" is explicitly placed in an extension.</p>",
        "id": 153867665,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1484597192
    },
    {
        "content": "<p>it's not whether the encounter+observation pointing to the same patient is 80% of cases, it's about whether 80+% of systems require them to to be the same in all cases</p>",
        "id": 153867668,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484597305
    },
    {
        "content": "<p>I would guess that 95+% of systems expect the patient to be the same.</p>",
        "id": 153867669,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1484597756
    },
    {
        "content": "<p>Should we make them check to verify?</p>",
        "id": 153867672,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1484597792
    },
    {
        "content": "<p>Scenario:<br>\nThere are duplicate Patients A &amp; B in the system.<br>\nThey're being merged by referencing B --&gt; A, <br>\nPatient B is set to \"inactive\"<br>\nThe encounter E has been created before the merge and still points at B<br>\nThe observation is created after the merge and points at the active Patient A and the Encounter E</p>",
        "id": 153867742,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1484607016
    },
    {
        "content": "<p>The assumption that Encounter and Observation always reference the same patient is only safe if merging Patients means updating all references. </p>",
        "id": 153867743,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1484607193
    },
    {
        "content": "<p>Same patient is not the same as the identical patient resource. I think it is important to be the same patient.</p>",
        "id": 153867752,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1484608863
    },
    {
        "content": "<p>This potential problem isn't just about patients. Given the ability to create a network of referenced resources, the pattern where resource A references resource B and resource C, and resource B also references resource C is quite common (e.g., duplicate references to patient, provider, organization, encounter, condition or any other common resource). I agree that in most cases, the reference from A to C should be the same as the reference from B to C ( i.e., both A and B point to the same instance of C), but there are times where this may not be true. The problem is that I don't know of any way in FHIR to express when duplicate references should resolve to the same instance or not. If it is intentional for A to reference a different instance of C than B does, how do you communicate this? Further, if the references to C from A and B are meant to be the same, I believe we should be able to enforce this to avoid data quality issues that may arise. </p>",
        "id": 153867769,
        "sender_full_name": "Bo Dagnall",
        "timestamp": 1484611794
    },
    {
        "content": "<p>so I have 2 questions in this space:<br>\n- is there anywhere in the spec itself where we need to enforce consistent references<br>\n- what are the requirements for a language that makes statements about this?</p>",
        "id": 153867776,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484614543
    },
    {
        "content": "<p>so we'll talk about this Wed breakfast. 7:30 am - get some breakfast downstairs, then come up to room 1146 and we'll discuss this</p>",
        "id": 153867781,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484617314
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> We could probably grab a room from Lillian that's a bit closer than having everyone go all the way up to your room if you want - shall I ask?</p>",
        "id": 153867785,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484618518
    },
    {
        "content": "<p>sure</p>",
        "id": 153867786,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484618541
    },
    {
        "content": "<p>thx</p>",
        "id": 153867787,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484618544
    },
    {
        "content": "<p>reminder - if you're interested in this topic, we'll be talking about it 7:30 am in room 1146 (bring your breakfast upstairs). If you can't get to floor 11, PM me directly and I'll come down and bring you up</p>",
        "id": 153868006,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484718632
    },
    {
        "content": "<p>Can someone post a summary of this discussion after tomorrow morning? Thanks.</p>",
        "id": 153868009,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1484719111
    },
    {
        "content": "<p>Summary:<br>\n- yes, we need to provide some framework to allow the conformance layer to make statements about consistency<br>\n- mostly, what you want to make is statements about the compartments we already have defined - most critically, patient<br>\n- we're going to add some warning wording associated with the patient compartment explaining the kind of cases that cause record sets to cross patients (mother/baby, transplants/tranfusions, family history (genetics), family counseling)<br>\n- we will create a new resource that describes networks or clusters of resources. This will describe a tree of resources, and indicate, for each reference/target combination, what the rules are. <br>\n- an example of the kind of thing that this resource is dealing with can be seen here: <a href=\"http://fhir.hl7.org.au/fhir/rcpa/cprofiles.html\" target=\"_blank\" title=\"http://fhir.hl7.org.au/fhir/rcpa/cprofiles.html\">http://fhir.hl7.org.au/fhir/rcpa/cprofiles.html</a><br>\n- when we make rules about the join between resources, we can make simple rules about compartments, or complex rulues using fhirpath<br>\n- this 'PackageDefinition' resource (working name) will also find use in several other places, including the _include parameter. <br>\n- you might see some drafts of this in the current build before R3, but it won't be part of R3</p>",
        "id": 153868101,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484756768
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Thanks!</p>",
        "id": 153868133,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1484762266
    }
]