[
    {
        "content": "<p>As far as I understand, the 21CC cures act, all providers must provide a FHIR endpoint until April 5th 2021 which has passed.<br>\nIf I’m correct, they must publish an available FHIR endpoint which we can access.<br>\nDid I understand correctly?<br>\nIf so, I see that a lot of providers that don’t have a valid FHIR endpoint or their authentication website is down.<br>\nWhile integrating with OpenEpic I found out that about 50 out of their ~380 providers don’t work.<br>\nWhen talking to OpenEpic, I understood that it’s under the provider’s responsibility and not their.<br>\nContacting 50 providers by email is a lot of work and it sounds like there should be an easier way to do so if they must provide an API by law.<br>\nAm I missing anything?</p>",
        "id": 233325251,
        "sender_full_name": "Itay Goren",
        "timestamp": 1617718308
    },
    {
        "content": "<p>ONC delayed the onsent due to COVID.  So, it's still in progress</p>",
        "id": 233328125,
        "sender_full_name": "David Pyke",
        "timestamp": 1617719389
    },
    {
        "content": "<p>The April 5 date is when Info Blocking rules go into effect.  The <em>explicit</em> FHIR endpoint publishing requirement is tied to certification <a href=\"https://ecfr.federalregister.gov/current/title-45/subtitle-A/subchapter-D/part-170#p-170.404(b)(2)\">45 CFR 170.404(b)(2)</a>, which is later.  Though there is a tie-in for endpoint publishing for Info Blocking, it is less well defined.  For certification the requirement is technically for certified HIT vendors to publish URLs for their customers.  Which is tricky if the customer's FHIR endpoint uses non-certified tech in front (e.g. API manager facades), but we'll figure that out...</p>",
        "id": 233355212,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1617728742
    },
    {
        "content": "<p>EHRs <em>will</em> be responsible for publishing FHIR endpoints when certification timelines hit.  However, for Info Blocking (4/5), the providers can choose how they intend to comply.  Because EHRs don't need to support all USCDI in FHIR until certification, providers likely can't meet USCDI Info Blocking obligations with FHIR alone until they move to a certified version (and even then, Info Blocking isn't just about FHIR).</p>",
        "id": 233356097,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1617729102
    },
    {
        "content": "<p>Also, I do want to temper expectations around FHIR endpoints.  The certification part of the rule only requires certified EHRs to publish endpoints associated with certified HIT Modules.  Many providers use dozens or hundreds of HIT systems, and most of those won't be certified.  So USCDI data that is stored outside the certified EHR may not be available via FHIR, or it might be available, but from a different FHIR endpoint that may have different publishing requirements.  So if you are looking to get all USCDI data from an organization, you may need to query multiple FHIR endpoints, and use other channels for data not available via FHIR at all.  The ONC FAST endpoint directory project may eventually help with the non-certified HIT endpoint publishing challenge, but you'll still have non-FHIR USCDI data scattered around.</p>",
        "id": 233356546,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1617729311
    },
    {
        "content": "<p>From an Info Blocking perspective, providers will likely <em>eventually</em> publish all their FHIR URLs, both for certified and non-certified HIT, but many non-certified HIT don't have a lot of FHIR support yet, so there <em>aren't</em> endpoints to publish.  So their Info Blocking obligations will likely involve content and manner discussions to get you the data you need from those systems via non-FHIR channels.</p>",
        "id": 233356743,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1617729407
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"378903\">Itay Goren</span> <a href=\"#narrow/stream/179166-implementers/topic/Cures.20act.20effects/near/233325251\">said</a>:</p>\n<blockquote>\n<p>if they must provide an API by law.</p>\n</blockquote>\n<p>Also, this isn't really the right way to look at things.  Info Blocking rules means that if a provider has an API, then they shouldn't block access to it.  However there isn't anything that actually requires them to have an API in the first place.  There are upcoming incentive programs that encourage the use of certified HIT, however some providers may choose not to participate in those incentive programs, so they don't need to use certified HIT, so they don't need to have an API at all.  They still need to not Info Block, but that doesn't necessarily imply they need an API.</p>",
        "id": 233359372,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1617730613
    },
    {
        "content": "<p>Is anyone aware of a concise/specific summary of the Cures Act requirements as they related to providers/EMRs?  CMS did a pretty good job summarizing the requirements for payers, but the ONC site is still fairly vague (to me) as to the specific hard requirements for providers.</p>",
        "id": 264064306,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1638907755
    },
    {
        "content": "<p>The ONC has a whole subset of their website about it.  <a href=\"https://www.healthit.gov/curesrule/\">https://www.healthit.gov/curesrule/</a>  Unless you have specific questions, it's all there</p>",
        "id": 264067724,
        "sender_full_name": "David Pyke",
        "timestamp": 1638909310
    },
    {
        "content": "<p>Perhaps I'm not looking in the correct place on the ONC site. I see it talking about the goals and benefits, but not so much the specific requirements. <br>\nFor example, under Patient Access it says things like: <br>\n<strong>The core goal of the health IT portion of the Cures Act is to provide patients with control of their health care and their medical record through smartphones and modern software apps.</strong></p>\n<p>But I don't see where it says specifically what is required and for whom. </p>\n<p>The CMS site very specifically lays out that one must expose these FHIR APIs by this date if you participate in these programs. I was hoping to find something similarly simple to point to re: provider systems - short of reading the entire final rule in the federal register. </p>\n<p>I've clicked all through the ONC site and can't seem to find a similar summary or fact sheet.</p>",
        "id": 264079536,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1638914504
    },
    {
        "content": "<p><a href=\"https://www.healthit.gov/cures/sites/default/files/cures/2020-10/Highlighted_Regulatory_Dates_All.pdf\">https://www.healthit.gov/cures/sites/default/files/cures/2020-10/Highlighted_Regulatory_Dates_All.pdf</a></p>",
        "id": 264079689,
        "sender_full_name": "David Pyke",
        "timestamp": 1638914552
    },
    {
        "content": "<p><a href=\"https://www.healthit.gov/cures/sites/default/files/cures/2020-03/TheONCCuresActFinalRule.pdf\">https://www.healthit.gov/cures/sites/default/files/cures/2020-03/TheONCCuresActFinalRule.pdf</a></p>",
        "id": 264079760,
        "sender_full_name": "David Pyke",
        "timestamp": 1638914589
    },
    {
        "content": "<p>There are many more under the Resources tab on that page</p>",
        "id": 264079918,
        "sender_full_name": "David Pyke",
        "timestamp": 1638914646
    },
    {
        "content": "<p>Appreciate the help <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> . Perhaps I'm dense. The intent is very clear, but not the hard requirements.</p>\n<p>Likely a dumb example - but suppose I develop a simple charting app for a local Mom &amp; Pop doctors office who works on primarily on paper today. Would I be required to expose public FHIR APIs from that system for Patients to access? I'm not certain. </p>\n<p>I was hoping to see something that plainly says 'if you meet criteria X,Y,Z; you MUST expose FHIR R4 USCDI APIs by this date. I feel like I'm missing something obvious.</p>",
        "id": 264090643,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1638920400
    },
    {
        "content": "<p>If your charting app is a Certified EHR product or module, you'll need to pass all the test procedures at <a href=\"https://www.healthit.gov/topic/certification-ehrs/2015-edition-cures-update-test-method\">https://www.healthit.gov/topic/certification-ehrs/2015-edition-cures-update-test-method</a>. But your \"mom and pop\" app won't be a  Certified EHR without your deciding to make it one.</p>",
        "id": 264091655,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638920996
    }
]