[
    {
        "content": "<p>Hi all, I might have missed this in the specification but I couldn't figure out whether it is expected that implementers will define custom Resource Types by extending <strong>Domain Resource</strong> or just <strong>Resource</strong>.  Is this level of freedom expected in situations where highly specialized needs must be met or is there an expectation that a system would only ever support a resource if it has been added to the official list? </p>\n<p>Just to clarify, I'm asking if it would be acceptable to create <a href=\"http://myServer/MyEndpoint/myCustomResource\" target=\"_blank\" title=\"http://myServer/MyEndpoint/myCustomResource\">http://myServer/MyEndpoint/myCustomResource</a> rather than attempting to extend an existing resource as described by extensions and modifier extensions.</p>",
        "id": 153968077,
        "sender_full_name": "Aaron",
        "timestamp": 1528478091
    },
    {
        "content": "<p>My understanding is that you are extending a Basic resource <a href=\"http://www.hl7.org/fhir/basic.html\" target=\"_blank\" title=\"http://www.hl7.org/fhir/basic.html\">http://www.hl7.org/fhir/basic.html</a>, which is based on DomainResource with a few additional common elements</p>",
        "id": 153968078,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1528479256
    },
    {
        "content": "<p>This is exactly what I was looking for. Not sure how I missed it.  Thanks!</p>",
        "id": 153968079,
        "sender_full_name": "Aaron",
        "timestamp": 1528479985
    },
    {
        "content": "<p>At present, there's no ability to define your own resources.  Profiling Basic and adding extensions for whatever elements you like is the current (somewhat ugly) solution.  We're exploring allowing custom resources in a way that can actually be supported by reference servers and won't break reference implementations, but that's not landed yet.</p>",
        "id": 153968086,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528481393
    },
    {
        "content": "<p>If you have something you'd like to see added to the spec, feel free to submit a change proposal.</p>",
        "id": 153968087,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528481418
    },
    {
        "content": "<p>to be specific: </p>\n<ul>\n<li>you can extend by adding your own resources that extend either of the abstract resources</li>\n<li>HAPI as support for that</li>\n<li>but we don't have a governance /policy or tooling framework for doing it, or any consensus of the community about its viability or goodnesss</li>\n</ul>",
        "id": 153968106,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1528488687
    },
    {
        "content": "<p>Can = technically possible, not \"currently considered a conformant FHIR instance\"</p>",
        "id": 153968128,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528493543
    },
    {
        "content": "<p>The above having been noted, I have to ask (because I have been, and will be asked in FHIR training courses that I provide): who has created Custom resources in their project, and why did you choose to do so instead of extending Basic? What (technical/tooling) stumbling blocks did you encounter ?<br>\nPlease respond here or via DM, your feedback will be shared anonymously ;-)</p>",
        "id": 153986299,
        "sender_full_name": "René Spronk",
        "timestamp": 1534250839
    },
    {
        "content": "<p>Hi all, <br>\nI'm trying to create a custom resource in my application, which should includes informations like the TNM staging system etc. in the Diagnosis. I don't know if I got it right in the documentation or if this chat is the right place to ask. Anyway, I would be very glad if I got help as a FHIR-newbie. :)<br>\nIs there already a resource for cancer classification and if not - am I correct in extending the Basic Resource or is it always the DomainResource? Is there a significant difference in the use of either of those resources (except of what's written on the homepage about Basic) ? </p>\n<p>Thanks in advance!</p>",
        "id": 176945092,
        "sender_full_name": "lashan_123",
        "timestamp": 1569858450
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"242265\">@lashan_123</span> Can you be more specific about your question?</p>",
        "id": 176946022,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1569859041
    },
    {
        "content": "<p>Typically you would use Condition and Observation for this sort of thing.  If you define a custom resource, you won't be consistent with how other systems represent the same information, won't be FHIR-conformant and won't work well with FHIR tooling (validation tools, reference implementations, test servers, etc.)</p>",
        "id": 176946713,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569859449
    }
]