[
    {
        "content": "<p>Hi all,<br>\nwhat are the steps to create a Custom Resource? Should I  use the Basic Resource or the StructureDefinition Resource? I would like have a Custom Resource with the set of attributes, search parameters and the the REST API (such as baseUrl/CustomResource/). <br>\nPlease let me know if it's possible and how I can build it.</p>",
        "id": 153881263,
        "sender_full_name": "Domenico",
        "timestamp": 1491557511
    },
    {
        "content": "<p>Hi all,<br>\nwhat are the steps to create a Custom Resource? Should I use the Basic Resource or the StructureDefinition Resource? I would like have a Custom Resource with the set of attributes, search parameters and  the REST API (such as baseUrl/CustomResource/). <br>\nPlease let me know if it's possible and how I can build it.</p>",
        "id": 153881265,
        "sender_full_name": "Domenico",
        "timestamp": 1491558264
    },
    {
        "content": "<p>it's not possible right now. We've talked about it, but we haven't landed on how to manage it, and it's pretty controversial</p>",
        "id": 153881274,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1491561600
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  can you explain me because it is not possible to build a custom resources ? Even through Basic Resource?</p>",
        "id": 153881280,
        "sender_full_name": "Domenico",
        "timestamp": 1491562141
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"martinodomenico.eng@gmail.com\">@Domenico</span> Basic Resource is used when you need to convey a narrative-only construct that doesn't neatly correspond to one of the other resources.</p>",
        "id": 153881282,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1491564766
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193653\">@Sunanda Veeraganti</span> Thank you for your reply. So do you confirm that I can't build a custom resource? I read on this link <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Custom_Resources\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Custom_Resources\">http://wiki.hl7.org/index.php?title=FHIR_Custom_Resources</a> that it is possible.</p>",
        "id": 153881285,
        "sender_full_name": "Domenico",
        "timestamp": 1491565428
    },
    {
        "content": "<p>It depends on what you consider Custom. You certainly can use StructureDefinition to add  to Basic and end up with functionally what you want, something that doesn't exist today. BUT it will not be a named 'resource', it will be Basic... The only way you will differentiate your custom functionality from others on the same server is through tags and element values.</p>",
        "id": 153881287,
        "sender_full_name": "John Moehrke",
        "timestamp": 1491566049
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"martinodomenico.eng@gmail.com\">@Domenico</span> As Grahame Grieve said in his reply that it was discussed.  For now custom resource is not possible.</p>",
        "id": 153881289,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1491566483
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"johnmoehrke@gmail.com\">@John Moehrke</span> I consider as Custom a new Resource for handling a concept not yet defined in FHIR. It will have its attributes (including the cardinalities), its search paramenters, its profile, its REST APIs and so on.</p>",
        "id": 153881290,
        "sender_full_name": "Domenico",
        "timestamp": 1491566588
    },
    {
        "content": "<p>if you think that there is a new concept which is not yet defined in FHIR then you can suggest and it will be discussed. Probably a new resource will be created. Manging custom resource will be hard. And the conformance to such resource will be vague</p>",
        "id": 153881294,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1491566882
    },
    {
        "content": "<p>Now is an especially easy time to bring a new use-case to FHIR, but anytime in the future is also good. We can always add Resources that the community find as useful and needed. We know we are not done creating new Resource types. You can pilot your idea using Basic, and a pilot would be useful when you present your need and solution proposal. </p>",
        "id": 153881296,
        "sender_full_name": "John Moehrke",
        "timestamp": 1491567204
    },
    {
        "content": "<p>The wiki link you referred to is a proposed policy that was never endorsed. In fact, some committees declined to discuss it, and others never even started to get consensus about it</p>",
        "id": 153881297,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1491568064
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193653\">@Sunanda Veeraganti</span> <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Thank you very much for your replies. I made this question  because reading the scope and usage of the Basic Resource (<a href=\"https://www.hl7.org/fhir/basic.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/basic.html\">https://www.hl7.org/fhir/basic.html</a>) I understood that, by means it, I could create new Custom Resources not yet defined in FHIR.</p>",
        "id": 153881298,
        "sender_full_name": "Domenico",
        "timestamp": 1491568328
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"martinodomenico.eng@gmail.com\">@Domenico</span> The purpose of FHIR is to improve interoperability. Yes, you could create custom resource but the new resource need to be accepted and managed by FHIR community as a whole. So if you have a use case for new FHIR resource, you can raise the request and discuss with FHIR-I WG. The we will see if a new source is required or an existing resource can be adapted.</p>",
        "id": 153881299,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1491568967
    },
    {
        "content": "<p>Basic is currently the \"approved\" mechanism to represent resources that aren't otherwise supported in FHIR.  Basic + extensions allows you to convey any concept you wish.  But it means that almost all of the data you care about will be sent as an extension, which is pretty ugly.  The challenge we have with allowing \"true\" custom resources (where you could actually have a custom schema for the resource) is that it's very hard to keep the notion from being abused and fragmenting the community and it's hard to do in a \"safe\" way that lets clients that might not be familiar with the resource still function.  These are 'hard' problems, but not necessarily insurmountable problems.  It's my belief we'll figure out a path eventually - hopefully before R4.  But for right now, you're stuck with using Basic or being non-conformant.</p>",
        "id": 153881323,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491572168
    },
    {
        "content": "<p>(Being non-conformant means that you won't work with any of the public test servers, the standard validation or testing tooling, won't be able to use the standard IG tooling, etc.  And any existing FHIR systems won't be able to talk to you without customization.  So it's a bit more painful than just \"oh well, I'm not conformant\".</p>",
        "id": 153881325,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491572263
    },
    {
        "content": "<p>But that is a solution within \"closed\" communities - at least while we're still in the \"trial use\" phase of FHIR.  As well, you're always free to propose a new resource to HL7.  If we agree it's appropriate, it'll probably show up in the continuous integration build within a few weeks to a few months and start showing up in the more stable Connectathon releases thereafter.</p>",
        "id": 153881326,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491572341
    },
    {
        "content": "<p>Hello, I created a new resource extending it from DomainResource, btw I'm using HAPI FHIR (Java).<br>\nWhen I output the MethodOutcome (based on this resource) or try to print the resource the only attribute printed is \"resourceType\". <br>\nMy resource has only two attributes, both annotated as \"child\".<br>\nWhat do I need to do to have the inner children attributes printed?</p>",
        "id": 181016399,
        "sender_full_name": "Luan Garrido",
        "timestamp": 1574084905
    },
    {
        "content": "<p>I <em>think</em> HAPI supports 'custom' resources, but be aware that your system won't be FHIR conformant.  (Only HL7-defined resources are permitted in conformant systems.)  <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> ?</p>",
        "id": 181017369,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574085639
    },
    {
        "content": "<p>Hello @<strong>Lloyd McKenzie </strong>, I know, this resource won't be FHIR conformant.<br>\nThe problem I'm facing is related to not have subclasses attributes printed. Example:</p>\n<p>Class A<br>\n---StringType first<br>\n---B second<br>\n------StringType third</p>\n<p>In this example, only first get printed.</p>",
        "id": 181018067,
        "sender_full_name": "Luan Garrido",
        "timestamp": 1574086116
    },
    {
        "content": "<p>The class B is annotated as \"@Block\" in the above example.</p>",
        "id": 181018302,
        "sender_full_name": "Luan Garrido",
        "timestamp": 1574086314
    },
    {
        "content": "<p>You might want to raise this on the <a class=\"stream\" data-stream-id=\"179167\" href=\"/#narrow/stream/179167-hapi\">#hapi</a> stream.  (Responses this week might be a bit slow due to DevDays)</p>",
        "id": 181029313,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574093654
    },
    {
        "content": "<p>This should work, although for the reasons everyone gives here it's a risky thing to do- you certainly won't get any interoperability that way.</p>\n<p>Make sure you register your custom type against your FhirContext, and your resource provider should also declare it via the getResourceType() method.</p>\n<p>Also make sure you are using the HAPI FHIR <code>ca.uhn.fhir.model.api.annotation.Child</code> annotation and not one from some other package- if nothing is being serialized I would suspect that your fields are not correctly annotated.</p>",
        "id": 181034268,
        "sender_full_name": "James Agnew",
        "timestamp": 1574096612
    },
    {
        "content": "<p>Hello all, <br>\nI have a problem with fitting in the FHIR Standard. Let’s say I have a bunch of attributes that didn’t really fit in any given FHIR Resource. I could extend a resource but I wouldn’t need 95% of the base content in that resource and just extend it with 3 more fields. Therefore, this would be more an abuse of that resource just to fit in the FHIR Standard. That’s how I specified my use case in this moment but I’m curious if there is a better way to handle this. <br>\nI saw something about Custom Resources but don’t know how to use them properly (how to profile a resource to fit my needs). Is there any good documentation with examples etc. <br>\nSo basically my question is what should I do if my data model don’t fit in the given FHIR Resources.</p>",
        "id": 244149499,
        "sender_full_name": "Theodor Szymkowiak",
        "timestamp": 1624889245
    },
    {
        "content": "<p>Use the  Basic resource, adding the data you need as extensions</p>",
        "id": 244151165,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1624889893
    },
    {
        "content": "<p>Yes, <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>'s suggestion to create a profile on <code>Basic</code> (adding extensions for what you need) is the recommended approach -- and it adresses your concern about not needing \"95% of the base content in that resource\" since <code>Basic</code> has no significant base content.</p>\n<p>Although you can create custom resources, it is not encouraged because custom resources do not work with most of the FHIR tooling that currently exists (e.g., IG publisher, validators, registries, clients, etc).  If you were to create custom resources, you'd also need to create a custom software stack to work with them (and you wouldn't be able to exchange them with others).</p>",
        "id": 244163182,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1624894585
    },
    {
        "content": "<p>I'd note that \"not needing 95% of the base content in a resource\" isn't a problem. In almost every case anything in a resource that you might not need for some use is optional. There is no need to bloat your instance filling in elements that you have no need for; leave them out. There is no harm in filling in a resource only with what is needed for your use.</p>\n<p>On the other hand, if the 95% of the content needed by your use case isn't represented in a resource (or combination of resources), then looking at Basic is an option, although extensions to existing resources are also an option.</p>",
        "id": 244168761,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1624896838
    },
    {
        "content": "<p>Thanks for all the answers. How can I use the Basic Resource properly? It seems quite strange to use CRUD Operations on this (GET /Resource/123). Maybe let’s get more specific on my needs. <br>\nRight now, I use the “ChargeItem” Resource to handle the billing process for my patients. But mainly I need just 3 attributes in this resource that I could extend or abuse in “supportingInformation”. These attributes are 3 Bundles, that I get from another system and have to store and handle in my system. The only other Fields that I use in this resource are “status” and “subject”. All other fields don’t belong to my needs (even the “code” parameter that I have to use because it is mandatory). <br>\nI can stick to that plan but somehow it feels like I’m abusing FHIR and the “ChargeItem”. On the other hand, I need to use CRUD Operations and other FHIR tooling like Chris sad.</p>",
        "id": 244250660,
        "sender_full_name": "Theodor Szymkowiak",
        "timestamp": 1624956891
    },
    {
        "content": "<p>If you are using ChargeItem then just extend it. It's fine. This is not abusing FHIR. Of course your extensions, no matter what proportion of the resource they are, will not be standard FHIR, understandable by others without some special knowledge. But that is to be expected. It's still better to do this within FHIR. <br>\nYou only need to use Basic if you have a new concept that doesn't exist in FHIR and is a standalone entity (with its own lifecycle) in your system. Basic is not meant for adding a few properties to another resource.</p>",
        "id": 244264260,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1624965012
    },
    {
        "content": "<p>If you're using Basic, you'd be doing GET [base]/Basic/123, not Resource/123</p>",
        "id": 244279592,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624973156
    },
    {
        "content": "<p>If the billing process requires Bundles of additional information that is not currently available in ChargeItem, it will be probably useful to try to improve ChargeItem to support the information within the Bundles...</p>",
        "id": 244298024,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1624979659
    },
    {
        "content": "<p>Hello everyone!<br>\nI'm new to HAPI. I understand correctly, if I create a completely custom resource that extends the DomainResource and the provider for it, then I still won't be able to create my custom resource on the server and perform operations (read, update, delete, etc.) on it.<br>\nInstead, I have to use the Basic resource and add extensions to it in order to get my custom resource with which I can perform CRUD operations on the server.</p>",
        "id": 252440333,
        "sender_full_name": "Pavel Khromov",
        "timestamp": 1631098838
    },
    {
        "content": "<p>I've just chanced upon this and seems to answer a query I have.</p>\n<p>I want to represent custom aggregate medication data (KPIs) grouped by Organisation. End users will collate the KPIs by organisation for benchmarking. It doesn't fit as an attribute to the Organisation, just merely medication management outcomes within that organisation. From the above, I can use Basic with extensions ?</p>",
        "id": 252448966,
        "sender_full_name": "S. K MEDE",
        "timestamp": 1631103184
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"364805\">@Pavel Khromov</span> From an interoperability perspective, Basic is the correct solution.  However, if you have a concept you can't find a home for in the existing resources, it's always best to raise a question here to see if there's a recommended way to use the standard resources.  (Sometimes a use-case is already supported, just not with the name/approach you might have expected.)  If you have specific questions about HAPI's custom resource capabilities, that's best asked on <a class=\"stream\" data-stream-id=\"179167\" href=\"/#narrow/stream/179167-hapi\">#hapi</a></p>",
        "id": 252456085,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631106523
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"438630\">@S. K MEDE</span> This sounds like either Observation or Measure - have you looked at both of those?</p>",
        "id": 252456174,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631106562
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Thanks for reply!</p>",
        "id": 252468900,
        "sender_full_name": "Pavel Khromov",
        "timestamp": 1631111140
    },
    {
        "content": "<p>can we create custom resource in fhir?</p>",
        "id": 252577865,
        "sender_full_name": "Saad Naseem",
        "timestamp": 1631169409
    },
    {
        "content": "<p>see Basic  <a href=\"http://hl7.org/fhir/basic.html\">http://hl7.org/fhir/basic.html</a></p>",
        "id": 252615957,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631190277
    },
    {
        "content": "<p>To be conformant to FHIR, you're limited to only the resources defined in the core specification.  What concepts are you trying to represent <span class=\"user-mention\" data-user-id=\"438854\">@Saad Naseem</span> that you want a new resource for?</p>",
        "id": 252642388,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631200137
    },
    {
        "content": "<p>Thanks for the reply sir</p>",
        "id": 252986968,
        "sender_full_name": "Saad Naseem",
        "timestamp": 1631453666
    }
]