[
    {
        "content": "<p>I’ve been working in HL7 v2 for many years but I'm new to FHIR.  I haven’t quite figured out how to best go about applying basic transformations or how to best modify application-specific workflows based on the source system of a message.  I’m reaching out to this group to see how would handle simple scenarios that in HL7 v2 would likely just be solved by filtering on sending application or sending facility. </p>\n<p>As an example, let’s say I have two systems requesting that I store documents via the DocumentReference resource. Each system has a document identifier that spans all versions of the document.  So each system will add their unique document identifier to the DocumentReference.identifier list.  Now let’s say that I need my application to track this one particular identifier in a special manner, so I need to know which of the identifiers is of interest for the given application. Therefore, I would think that I need to create rules that say based on who is sending me this document, treat one of the identifiers in a special way.  </p>\n<p>One thought that I had was to require all sending applications that have such a need to include a custom Is Modifier element, but that feels overkill for such a simple need.   Is there a common approach to solving this type of problem that I’m just missing out on?  Any thoughts are appreciated. Customizing Processing Logic per Source Ssystem?Customizing Application Workflow per Source System?</p>",
        "id": 153897684,
        "sender_full_name": "Aaron",
        "timestamp": 1500644773
    },
    {
        "content": "<p>how are you identifying the applications? Do they have to authenticate somehow?</p>",
        "id": 153897690,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500646426
    },
    {
        "content": "<p>The intention is to rely on OAuth2 for authentication.  I'm not sure if we could obtain system information with the authentication process or if we'd just know which user is making the request.  </p>\n<p>This kind of brings me to another thought that I had, potentially spin up different endpoints for different applications to hit. (This approach seems like it would suffer from some scaling and maintainability issues.)</p>",
        "id": 153897700,
        "sender_full_name": "Aaron",
        "timestamp": 1500647636
    },
    {
        "content": "<p>if you're using OAuth2 with the smart on fhir profile, you'll definitely know the system they are using as well as their identity - that's part of the establishing of the context. I think that's true for all other approaches using OAuth2 as well, but I can't be sure.</p>",
        "id": 153897750,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500669826
    },
    {
        "content": "<p>it's pretty common for a FHIR server to be a facade server that does processing based on the information in the request and the user session, and to route differently internally. What you're describing sounds like that.</p>",
        "id": 153897751,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500669891
    }
]