[
    {
        "content": "<p>How come the CompartmentDefinition.code is not extensible? If compartmentDefinitions are meant to be of use in some authorization use cases, and eg. the part that grants access to a certain set of resources goes through eg. a CareTeam, it's sort hard to do currently.</p>",
        "id": 160655900,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1552477590
    },
    {
        "content": "<p>At the moment, because compartment definitions drive code so much, we've said that only HL7 can define and change them.  That doesn't mean we couldn't revisit that decision though.</p>",
        "id": 160672082,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552488682
    },
    {
        "content": "<p>That would still be the case if the set is extensible.</p>",
        "id": 160722060,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1552507018
    },
    {
        "content": "<p>I think a GraphDefinition is more capable of expressing authorization rules than a CompartmentDefinition. Anyone else's thoughts on that?</p>",
        "id": 163083390,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1554974082
    },
    {
        "content": "<p>Realistically: Security and Privacy will leverage anything they can when it comes to rules writing and rules enforcing. This is why there is no singular binding of a security model to FHIR.</p>",
        "id": 163093586,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554985046
    },
    {
        "content": "<p>Compartment in terms of REST is related to Compartment in terms of Security; but they are not the same thing. As I said above, security is happy to leverage the REST (CompartmentDefinition) compartment mechanism. However Security-labels include the concept of compartment as a tag. Local domains will identify compartments, and put that tag on all the data that is to be considered within that compartment. This concept of compartment as a tag is the Security domain concept of Compartment. This concept of compartment is what you will see in a government system, like military.  These security compartment tags are completely dynamic, and universally supported in the FHIR specification.</p>",
        "id": 163093812,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554985284
    },
    {
        "content": "<p>On GraphDefinition, I would agree this is also a good tool for Privacy and Security. I would love to see someone propose this as a model for writing the rules of a Privacy-Consent.  The nice part of this is that the graph definition is managed independent of the data, and thus is more flexible to changes in policy. <span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span> do you have an example?</p>",
        "id": 163093924,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554985415
    },
    {
        "content": "<p>No, I haven't - I have not left the theoretical phase yet.</p>",
        "id": 163094004,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1554985492
    },
    {
        "content": "<p>I was interested in community thoughts on this because it would mean that custom CompartmentDefinitions (that <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> requested) are not that neccessary.</p>",
        "id": 163094033,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1554985541
    },
    {
        "content": "<p>Compartments in the REST domain are far less dynamic, much more like FHIR has today.</p>",
        "id": 163094179,
        "sender_full_name": "John Moehrke",
        "timestamp": 1554985650
    },
    {
        "content": "<p>When I was talking about Compartment from a security perspective, I was referring to the RESTful compartments.  I.e. a practitioner might have access to data in one patient's Compartment, but not another.  Or a Practiioner might always have access to data that's in their Compartment.  This use of Compartment is more common than using it as a query mechanism</p>",
        "id": 163103734,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554992446
    },
    {
        "content": "<p>also, this use is implicit not explicit</p>",
        "id": 163225842,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555102337
    },
    {
        "content": "<p>Compartments are very challenging when they are based on indirect references. I don't see how we'd make a CareTeam compartment work</p>",
        "id": 163225873,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555102363
    },
    {
        "content": "<p>Right - having thought about it, Careteams is probably not a good fit. As I see it, compartments more or less works as a set of restrictions for an entity (machine or person) that in some unspecified way can act as a user to the system. In that perspective, a Careteam is not part of that definition as it more or less consists of a group of entities</p>",
        "id": 163983874,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1556022289
    },
    {
        "content": "<p>Here how we do custom compartments - <a href=\"https://docs.aidbox.app/tutorials/compartments\" target=\"_blank\" title=\"https://docs.aidbox.app/tutorials/compartments\">https://docs.aidbox.app/tutorials/compartments</a></p>",
        "id": 164029137,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1556053047
    }
]