[
    {
        "content": "<p>Hey guys, so I have some patient data which has the following fields (name, age, image, sex, hasDementia, hospitalID). I want to create a FHIR resource out of it. most fields are in base FHIR patient resource, but I don't know how to deal with custom fields (such as hasDementia, hospitalID ) if anyone has an example would be great. I am using JSON</p>",
        "id": 209292649,
        "sender_full_name": "Ahmad Ramin",
        "timestamp": 1599483469
    },
    {
        "content": "<p>Hi Ahmad. <br>\nThe hospitalID is one of the identifiers of the patient. You need to define a naming system for the hospitalIDs, and the then you can use this as system. The ID is the value.<br>\nWhether or not a patient has dementia is a Condition. The dementia is the code and the presence is verification status (you might also have a look at the clinicalStatus).</p>",
        "id": 209293032,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1599483699
    },
    {
        "content": "<p>I would not recommend the use of an extension for the dementia for a simple reason: Then others might think it's a good option to do that, and then all the \"problems\" a patient might have, extensions might be used in addition to conditions. It leads to double documentation which might lead to inconsistencies. And: Extensions might not be known by servers getting the data. Therefore the information might get lost, which would be a pity.</p>",
        "id": 209293322,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1599483875
    },
    {
        "content": "<p>Thanks, but in our case hospitalID is an identifier for a hospital where a patient relates to.</p>",
        "id": 209293762,
        "sender_full_name": "Ahmad Ramin",
        "timestamp": 1599484172
    },
    {
        "content": "<p>Sorry, misunderstanding. The hospital caring for a patient is an organization. If the hospital is custodian of the data, then you can reference this organization via \"managingOrganization\" in Patient.</p>",
        "id": 209294416,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1599484591
    },
    {
        "content": "<p>how about another field called userID, which respresent a person caring for the patient?</p>",
        "id": 209294873,
        "sender_full_name": "Ahmad Ramin",
        "timestamp": 1599484882
    },
    {
        "content": "<p>If it is a health care professional, it is a practitioner. If it is a relative or a friend, it's a relatedPerson.</p>",
        "id": 209295069,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1599484999
    },
    {
        "content": "<p>ok thanks, but relatedPerson is not defined in FHIR patient resource. is it?</p>",
        "id": 209295939,
        "sender_full_name": "Ahmad Ramin",
        "timestamp": 1599485552
    },
    {
        "content": "<p>you can link via link.other.</p>",
        "id": 209296014,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1599485605
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"196115\">@Mareike Przysucha</span></p>",
        "id": 209296952,
        "sender_full_name": "Ahmad Ramin",
        "timestamp": 1599486167
    },
    {
        "content": "<p>Is that the right use for link.other? I thought any references in in Patient.link had to be the same person as the Patient (to point to other Patient records for the same person or the case where the person is a RelatedPerson for someone else (eg.  a Mother is a Patient but also a RelatedPerson to her newborn infant)).  RelatedPerson.patient (which is 1..1) points back from the RelatedPerson to the Patient.</p>",
        "id": 209405932,
        "sender_full_name": "Craig Newman",
        "timestamp": 1599580318
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 209411671,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599582733
    },
    {
        "content": "<p>It looks like the only way to express that a person is a caregiver is through CareTeam:<br>\nCareTeam.participant[i].member -&gt; RelatedPerson<br>\nRelatedPerson.patient -&gt; Patient</p>",
        "id": 209412430,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1599583159
    },
    {
        "content": "<p>link goes from RelatedPerson to Patient, not other way around. (as noted by Craig above)</p>",
        "id": 209478496,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1599635783
    },
    {
        "content": "<p>has Dementia is more likely going to be represented by the existence of an EpisodeOfCare relating to the dementia (which you can then use to track data related to that), or possibly the existence of a condition for the dementia.<br>\nIt's not really something you'd expect to find on the patient resource itself.</p>",
        "id": 209478566,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1599635880
    },
    {
        "content": "<p>And yes, the caregiver can be on the team, or it could be through the values in the RelatedPerson.relationship - depends what you really want to say about it.</p>",
        "id": 209478650,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1599635935
    }
]