[
    {
        "content": "<p>\"code\": {<br>\n    \"coding\": [<br>\n      {<br>\n        \"system\": \"<a href=\"http://loinc.org\" target=\"_blank\" title=\"http://loinc.org\">http://loinc.org</a>\",<br>\n        \"code\": \"8310-5\",<br>\n        \"display\": \"Body temperature\"<br>\n      }<br>\n    ],<br>\n    \"text\": \"Body temperature\"<br>\n  },</p>\n<p>Can I use my url system and defined own code ?</p>",
        "id": 172574271,
        "sender_full_name": "Dongtu",
        "timestamp": 1565085047
    },
    {
        "content": "<p>Yes you can do this. To maximize interoperability, the use of common codes systems is preferred.</p>",
        "id": 172578172,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1565089237
    },
    {
        "content": "<p>In the case of body temperature, the use of the LOINC code isn't just preferred, it's mandatory.  (We do that only for about 10 vital signs observations.)  So you should follow the pattern below.  (This pattern is actually a good one to follow even for other types of Observations, such as lab results, etc. but there you're allowed to omit the LOINC code if it's too hard to translate.)</p>\n<div class=\"codehilite\"><pre><span></span>&quot;code&quot;: {\n  &quot;coding&quot;: [\n    {\n      &quot;system&quot;: &quot;http://loinc.org&quot;,\n      &quot;code&quot;: &quot;8310-5&quot;,\n      &quot;display&quot;: &quot;Body temperature&quot;\n    },\n    {\n      &quot;system&quot;: &quot;http://some-other-system.org/fhir/CodeSystem/foo&quot;,\n      &quot;code&quot;: &quot;ABC-123&quot;,\n      &quot;display&quot;: &quot;Hotness indication&quot;\n    }\n   ],\n   &quot;text&quot;: &quot;Body temperature&quot;\n}\n</pre></div>",
        "id": 172591259,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565100239
    },
    {
        "content": "<p>Note that it doesn't matter which of the codings comes first</p>",
        "id": 172591310,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565100254
    },
    {
        "content": "<p>This page shows the list of observation types where there are mandatory LOINC codes: <a href=\"http://build.fhir.org/observation-vitalsigns.html\" target=\"_blank\" title=\"http://build.fhir.org/observation-vitalsigns.html\">http://build.fhir.org/observation-vitalsigns.html</a></p>",
        "id": 172591406,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565100329
    },
    {
        "content": "<blockquote>\n<p>In the case of body temperature, the use of the LOINC code isn't just preferred, it's mandatory. </p>\n</blockquote>\n<p>I would say it's only mandatory if you derive your profile from <code>http://hl7.org/fhir/StructureDefinition/vitalsigns</code>. Sure it makes absolutely sense to derive from vitalsigns in such a case but you don't have to.</p>",
        "id": 172592667,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1565101140
    },
    {
        "content": "<p>From the spec:<br>\n<code>The following core profiles for the Observation resource have been defined as well. If implementations use this Resource when expressing the profile-specific concepts as structured data, they SHALL conform to the following profiles:</code></p>\n<p>That means \"If you are sharing the concept of Body Temperature (or any of the other covered concepts) using Observation, you SHALL conform to the listed profiles\"</p>",
        "id": 172593451,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565101670
    },
    {
        "content": "<p>So if you're sending Body Temperature, Height, Weight or one of the other vitals using Observation (as opposed to say DocumentReference with a wrapped PDF), then you're obligated to comply with the profile, which means you're obligated to use the specified LOINC code - though you're free to send any other Codings you like too.</p>",
        "id": 172593589,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565101749
    },
    {
        "content": "<p>HL7 has done this because vital signs are so critical to patient care and because we believe that hard-coding mappings in these limited cases is both achievable and that the resulting interoperability is worth the cost it imposes on implementers.</p>",
        "id": 172593713,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565101813
    },
    {
        "content": "<p>What should I do, if I have a vitalsign which has no LOINC code?</p>",
        "id": 172595591,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1565103004
    },
    {
        "content": "<p>Presuming that there's a code at all that identifies it as being a vital sign (and what kind of vital sign), then do a lookup and add the LOINC code too.  (Similar to the example above.)</p>",
        "id": 172597151,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565103997
    },
    {
        "content": "<p>The only ones you have to translate are the ones explicitly listed in the FHIR spec.</p>",
        "id": 172597174,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565104019
    },
    {
        "content": "<p>But if you have a code that corresponds to any of those (even if your code might be more specific), then a translation to the mandated LOINC code is needed.   (In fact a translation is required even if you have a LOINC code but it's more specific than the ones listed.)</p>",
        "id": 172597262,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565104076
    },
    {
        "content": "<p>But what if I measured the body height with shoes on. For sure there is no LOINC code for that. In this case I should be allowed to have an \"vitalsign\" observation, which doesn't inherit from vitalsigns and uses no LOINC code. </p>\n<p>The example of body height with shoes on might be not the best, because nobody would count that as vitalsign. But there are for sure observations which would count as vitalsign but have no LOINC code or the meaning behind the LOINC doesn't fit my observation practise.</p>",
        "id": 172600024,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1565105849
    },
    {
        "content": "<p>I think that one is covered --  8352-7   <a href=\"http://r.details.loinc.org/LOINC/8352-7.html?sections=Comprehensive\" target=\"_blank\" title=\"http://r.details.loinc.org/LOINC/8352-7.html?sections=Comprehensive\">http://r.details.loinc.org/LOINC/8352-7.html?sections=Comprehensive</a></p>",
        "id": 172600401,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565106080
    },
    {
        "content": "<p>Height with shoes on is still a subtype of \"height\".  The accuracy of height, weight, blood pressure, etc. will vary depending on the measurement mechanism and circumstance.  But they're still height, weight and blood pressure and are expected to use the standard (and generic) LOINC codes.</p>",
        "id": 172600539,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565106158
    },
    {
        "content": "<p>Ok that is interesting. How do I specify the LOINC code 8352-7 in an Observation?</p>",
        "id": 172601148,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1565106628
    },
    {
        "content": "<p>You would send the required LOINC of 29463-7 (Body weight) and would also send 8352-7 (Body weight - Clothing worn during measure) as an additional Coding.</p>",
        "id": 172601876,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565107148
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> doesn't that imply that there is equivalence between the codes (but there isn't)?</p>",
        "id": 172615704,
        "sender_full_name": "Rute Martins",
        "timestamp": 1565115922
    },
    {
        "content": "<p>It implies that both codes are encodings of the actual measurement taken (which they are).  There's no expectation that all codings have identical granularity (and thus are not necessarily equivalent in meaning) however all should be encoding the same concept.</p>",
        "id": 172616627,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565116523
    },
    {
        "content": "<p>As a different example, you might send an ICD9, an ICD10, a bare SNOMED code and a post-coordinated SNOMED code all for the same Condition.  They wouldn't be equivalent, but they would all be appropriate encodings of the underlying condition.</p>",
        "id": 172616737,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565116596
    },
    {
        "content": "<p>In the case of body temperature, the use of the LOINC code isn't just preferred, it's mandatory.</p>\n<p>How about other situations? Are there any difficulties with partners when I use my own Coding? <br>\nIs it accepted? If one partner send LOINC code and my fhir server isn't accept. Then they will say my server do not follow the hl7 standard? is that True ?</p>",
        "id": 172643155,
        "sender_full_name": "Dongtu",
        "timestamp": 1565140940
    },
    {
        "content": "<p>The base HL7 standard sometimes mandates codes.  For Observations, the only time we mandate is for very specific vital signs codes (see the spec).  However, countries or organizations might define additional constraints.  For example, in the U.S., the expectation is that Observations will use LOINC if a code exists.  In the UK, the expectation is that you'll use SNOMED.  Other countries have not made any determinations (at least not yet).</p>",
        "id": 172643335,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565141265
    },
    {
        "content": "<p>That mean the coding is uniformly used in a country or an organization . If one system in US send msg to system in UK, it must use SNOMED instead of LOINC.<br>\nThank you!</p>",
        "id": 172643788,
        "sender_full_name": "Dongtu",
        "timestamp": 1565141922
    },
    {
        "content": "<p>Codes are sent uniformly within the set of applications that are bound by (or choose to comply with) an implementation guide.  In some places, compliance may be regulated.  In other cases, it might be tied to payment.  In many cases, it's voluntary.  And in the majority of cases if you look world-wide, no implementation guides exist that are intended for the scope the application is intended for (though there may be implementation guides from other jurisdictions, disciplines or areas that could be informative/useful).</p>",
        "id": 172644067,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565142449
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"230970\">@Dongtu</span> </p>\n<blockquote>\n<p>If one system in US send msg to system in UK, it must use SNOMED instead of LOINC.</p>\n</blockquote>\n<p>Almost. The UK system might not prohibit LOINC, so :<br>\nIf one system in US send msg to system in UK, it must use SNOMED, it may also send LOINC.</p>",
        "id": 172649597,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1565152688
    },
    {
        "content": "<p>(And for certain vital signs, it <em>must</em> send LOINC).</p>\n<p>As a general rule, you can always send more codes than are required.  If you have different recipients who expect different codes, it's generally fine (and a whole lot cheaper) to build a single interface and expose all of the different translations of the relevant concept and let the receiver grab the one they recognize/prefer out of the instance.</p>",
        "id": 172651269,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565155750
    },
    {
        "content": "<p>How does this principal work when the codes from one coding system don't \"directly match\" those from another?   There are many coding systems that do not have a one-to-one match with codes in another system; it has been this way since medical coding systems were invented.  The NLM metathesaurus tries to do this code system mapping but inevitably there are cases where the mapping isn't complete and definitely not one-to-one.</p>",
        "id": 172663883,
        "sender_full_name": "John Silva",
        "timestamp": 1565171128
    },
    {
        "content": "<p>Yes, this is certainly true and isn't going to change.  The idea with sending multiple codes from different code systems is that the code that you send from each code system should be the one that most closely matches the intended meaning of the instance (or that is used to meet a specific requirement, as with the specific required LOINC codes for vital signs).  This allows (and anticipates) that there almost always will be differences in the granularity and closeness of the match if you compare across the different code systems, but in each case the match should be the closest that the code system provides (with some additional allowances, such as whether SNOMED CT post-coordinated expressions will be used, or not).</p>",
        "id": 172677084,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1565184197
    },
    {
        "content": "<p>The objective isn't to send equivalent codes.  The objective is to encode the concept in an appropriate way in each system.  One code system might say \"metabolic disorder\".  Another might say \"diabetes\".  Another might say \"uncontrolled early-onset diabetes\".  All would be appropriate encodings for the same concept in their respective code systems.  But we're not saying that \"uncontrolled early-onset diabetes\" is equivalent to \"metabolic disorder\"</p>",
        "id": 172682368,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565187974
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  this doesn't make any sense to me (\"metabolic disorder\" vs \"diabetes\" vs \"uncontrolled early-onset diabetes\") since each of these are obviously different medical conditions in terms of severity and treatments; the only thing that they seem to have in common is that have a common 'parent concept'.   If someone were doing a clinical study on 'early onset diabetes' or 'type 1 diabetes' these other codes wouldn't do them much good unless the codes are at the required level of specificity was available in the list of codes (CodeableConcept).  Also, more importantly, someone treating type-1 diabetes vs 'diabetes' (unspecified) needs to use a completely different treatment plan.</p>",
        "id": 172729354,
        "sender_full_name": "John Silva",
        "timestamp": 1565225818
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span>  this doesn't make any sense to me (\"metabolic disorder\" vs \"diabetes\" vs \"uncontrolled early-onset diabetes\") since each of these are obviously different medical conditions in terms of severity and treatments; the only thing that they seem to have in common is that have a common 'parent concept'.   </p>\n</blockquote>\n<p>I think Lloyd's point was that if you had three different code systems and you were trying to represent a condition using all three that you would have to do the best you can.  If you have equivalent codes, then you could send those.  But if you wanted to encode \"uncontrolled early-onset diabetes\" and all you had in your code system was \"diabetes\" or \"metabolic disorder\", then that's what you'd have to go with.<br>\nWe have probably all dealt with different code systems that have different levels of granularity.  Even if you're just trying to send codes in ICD-9-CM and ICD-10-CM, you have to struggle to find the best equivalence sometimes.  And that (I think) was Lloyd's point.</p>",
        "id": 172729510,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1565226030
    },
    {
        "content": "<p>Different codes are appropriate to different types of use.  A large-grained code system may be sufficient for reporting/categorization purposes.  A medium-grained code system is typically what's needed for billing.  Finer-grained code systems are often ideal for clinical purposes (though not always used/available).  The same resource might be shared for all three purposes and all three types of codes may need to be present.  (And even within a particular use, granularity can vary.  ICD-9 and ICD-10 are both used for billing, but they have different degrees of specificity.  The key point is that it's fine to send all the codes you have as alternate codings and it's fine if they aren't equivalent - what matters is that they're all appropriately representing the same concept.</p>",
        "id": 172731478,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565229247
    },
    {
        "content": "<p>where appropriate is a bus sized hole... but there's no way to come up with better language until the whole world converges on a single terminology. Don't hold your breath...</p>",
        "id": 172739847,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565242857
    },
    {
        "content": "<p>Hmm, are those rules are going to interact badly with Extensible binding disallowing subsumed codes?  Or does that constraint also have a hole with the interpretation of \"cover the concept (based on human review)\"?</p>",
        "id": 172741868,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1565245457
    },
    {
        "content": "<p>that increases the difficulty in practice, but in principle the rules are orthogonal</p>",
        "id": 172744542,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565249351
    },
    {
        "content": "<p>Circling back to an old discussion, I fail to understand how this works:</p>\n<blockquote>\n<p>You would send the required LOINC of 29463-7 (Body weight) and would also send 8352-7 (Body weight - Clothing worn during measure) as an additional Coding.</p>\n</blockquote>\n<p>As far as I can see, LOINC 8352-7 is not a statement _that_ there were clothes worn during measurement, but is used to define the question \"what can you tell me about the clothes were worn during measurement?\", where the answer can be \"fully clothed with shoes\", \"fully clothed without shoes\", etc. If you just send 8352-7 as an additional coding to your Observation, you still don't know much about the actual state of clothing. Can anyone enlighten me?</p>",
        "id": 240234946,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1621969537
    },
    {
        "content": "<p>You're right.  8352-7 is not a body weight observation.  It would be appropriate for use as an Observation.component.code within a Body weight measure.  While it could be captured as an independent observation, it would be less useful as such as it's providing essential context for the weight measurement and all essential information for the interpretation of an Observation is supposed to be within or directly linked from the Observation.</p>",
        "id": 240258119,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621981564
    },
    {
        "content": "<p>Thanks for the clarification <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>.</p>\n<p>The VitalSigns IG states in this particular case:</p>\n<blockquote>\n<p>Body weight - To supplement this vital sign observation, 8352-7 - Clothing worn during measure and 8361-8 - Body position with respect to gravity MAY be included as additional observation codes.</p>\n</blockquote>\n<p>Wouldn't it be more appropriate to say \"... included as additional observation components\"?</p>",
        "id": 240287847,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1622014142
    },
    {
        "content": "<p>I think so.  Feel free to submit a change request.  (And post a link here so I can watch it :))</p>",
        "id": 240321564,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622034710
    },
    {
        "content": "<p>Here you go: <a href=\"https://jira.hl7.org/browse/FHIR-32787\">https://jira.hl7.org/browse/FHIR-32787</a></p>",
        "id": 240379117,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1622057847
    }
]