[
    {
        "content": "<p>Does FHIR support the concept of \"late binding\" data to terminologies? Specifically, we're interested in being able to store a coded value exactly as it was originally transmitted, and only mapping to a more standard terminology in a downstream process. The benefit here is the ability to re-map concepts more easily as understanding/usage changes. This is especially helpful in our use cases, as we are aggregating data from various sources, most of which are not FHIR-based.</p>\n<p>For coded data elements which have only a Preferred or Example binding, this is a non-issue in FHIR. One can simply define a custom code system/value set, which includes any and all coded values needed, and use that when creating FHIR resources from non-FHIR data sources. However, when a data element has an Extensible or Required binding, the solution is no longer trivial.</p>\n<p>A prevalent example of this in the US is Patient gender. Often, gender is captured with more granularity than the AdministrativeGender value set provides (e.g., transgender male, transgender female, etc.). Our goal is to be able to capture these coded elements exactly as transmitted, and only map to a more standard value set in a downstream system. However, because the Patient gender data element has a Required binding to the AdministrativeGender value set, there does not appear to be a straightforward way to preserve the original coding.</p>\n<p>The only solution that seems reasonable to me is to define an extension which allows the use of any value set to represent patient gender and store the original coding there. Has anyone else run into this issue before? Are there alternative solutions of which I’m unaware? Any and all feedback is appreciated.</p>",
        "id": 188462643,
        "sender_full_name": "Matt Rouhana",
        "timestamp": 1582041386
    },
    {
        "content": "<p>In Germany we had the same issue with patient gender. Male and female were okay, but we now have \"diverse\" and \"undetermined\". We created an extension for this, but in this case the gender.value is set to \"other\" together with the extension. An example can be seen on <a href=\"https://simplifier.net/guide/basisprofil-de-r4/Patient#Geschlecht\" target=\"_blank\" title=\"https://simplifier.net/guide/basisprofil-de-r4/Patient#Geschlecht\">https://simplifier.net/guide/basisprofil-de-r4/Patient#Geschlecht</a> (I know, the text is German, but the example is nearly totally international).</p>",
        "id": 188463398,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1582041891
    },
    {
        "content": "<p>So long as the element is minOccurs=0, you can omit the element and use an extension.  If the element is mandatory (min=1) and the binding is required or extensible, then late binding isn't possible while remaining compliant to the standard.  Depending on the software being used, it may be possible to have a front end system producing non-compliant instances that get turned into conformant instances further downstream, however some reference implementations might not be able to parse such instances and obviously standard test tools won't work, so there will be more challenges pursuing such a solution.</p>",
        "id": 188464007,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582042271
    },
    {
        "content": "<p>Thanks to you both for the prompt responses. We've considered the extension approach, as well as creating non-conformant \"pseudo-FHIR\" in an upstream process, so I'm glad we're on roughly the same page. Also good to know that we're not missing a more obvious solution.</p>",
        "id": 188466746,
        "sender_full_name": "Matt Rouhana",
        "timestamp": 1582043786
    },
    {
        "content": "<p>HI All,</p>\n<p>May I know which FHIR Resource and Element can represent <strong>Admission Confirmation Status </strong>such as Completed, Pending, cancelled etc. My initial thought was it should be something related to Encounter.hospitalization data element. But I could not find any status type of field. Should I add this as an extension?</p>\n<p>Regards,<br>\nAritra</p>",
        "id": 188990848,
        "sender_full_name": "Aritra Kundu",
        "timestamp": 1582605182
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"247235\">@Aritra Kundu</span> Can you explain what Admission Confirmation Status means?  What are the definitions of the codes?  What does the element mean in business terms?</p>",
        "id": 188991635,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582606520
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Data.20Binding/near/188991635\" title=\"#narrow/stream/179166-implementers/topic/Data.20Binding/near/188991635\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"247235\">Aritra Kundu</span> Can you explain what Admission Confirmation Status means?  What are the definitions of the codes?  What does the element mean in business terms?</p>\n</blockquote>\n<p>Sure Lloyd. </p>\n<p>From a business point of view it suggest that the confirmation status of a patient admission. In a typical scenario when patient wants to get admitted as per doctor advice, he checked with  the nearest hospital and came to know that Bed is not available or some other issue happened ; due to that he might need to wait for a day. In this scenario, his admission status can be denoted as <strong>Pending</strong>. Whenever he got the bed, his status can be changed to <strong>Confirmed</strong>. If the hospital does not have the required facility, the status can be denoted as <strong>Cancelled </strong>and indicate the proper reason code. Hope this helps to identify the business requirement.</p>\n<p>Regards</p>",
        "id": 188992062,
        "sender_full_name": "Aritra Kundu",
        "timestamp": 1582607125
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"247235\">Aritra Kundu</span> <a href=\"#narrow/stream/179166-implementers/topic/Data.20Binding/near/188992062\" title=\"#narrow/stream/179166-implementers/topic/Data.20Binding/near/188992062\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Data.20Binding/near/188991635\" title=\"#narrow/stream/179166-implementers/topic/Data.20Binding/near/188991635\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"247235\">Aritra Kundu</span> Can you explain what Admission Confirmation Status means?  What are the definitions of the codes?  What does the element mean in business terms?</p>\n</blockquote>\n<p>Sure Lloyd. </p>\n<p>From a business point of view it suggest that the confirmation status of a patient admission. In a typical scenario when patient wants to get admitted as per doctor advice, he checked with  the nearest hospital and came to know that Bed is not available or some other issue happened ; due to that he might need to wait for a day. In this scenario, his admission status can be denoted as <strong>Pending</strong>. Whenever he got the bed, his status can be changed to <strong>Confirmed</strong>. If the hospital does not have the required facility, the status can be denoted as <strong>Cancelled </strong>and indicate the proper reason code. Hope this helps to identify the business requirement.</p>\n<p>Regards</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nCould you please help me with this.</p>\n<p>Regards,<br>\nAritra</p>",
        "id": 189086429,
        "sender_full_name": "Aritra Kundu",
        "timestamp": 1582693203
    },
    {
        "content": "<p>This seems more like an appointment or referral sort of thing rather than a characteristic of the Encounter itself.</p>",
        "id": 189086812,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582693975
    },
    {
        "content": "<p>If your concept of Confirmation Status differs from <a href=\"http://build.fhir.org/encounter-definitions.html#Encounter.status\" target=\"_blank\" title=\"http://build.fhir.org/encounter-definitions.html#Encounter.status\">http://build.fhir.org/encounter-definitions.html#Encounter.status</a> then you may need to explain again, as I don't see the difference right now. Encounters that haven't started as of yet can also be modeled as an Appointment.</p>",
        "id": 189091927,
        "sender_full_name": "René Spronk",
        "timestamp": 1582702837
    }
]