[
    {
        "content": "<p>Hello! We have this use case that we would like to enrich\\clean data coming back from our FHIR server using an external service and include the new data in the FHIR response. Did anyone have any thoughts on what will be the best way to communicate what elements in the resource were enriched? <br>\nSome thoughts are using a custom tag in the metadata and perhaps a provenance resource or an extension. <br>\nAny comments/thoughts/suggestions would be highly appreciated!</p>",
        "id": 243949169,
        "sender_full_name": "Amit Cudykier",
        "timestamp": 1624643804
    },
    {
        "content": "<p>Is the scenario one of someone POSTs or PUTs an instance and you enrich before storing or is this enrichment that happens at some subsequent time?  (There are different ramifications for things like _lastUpdated, meta.version and eTags.)</p>",
        "id": 243969874,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624654667
    },
    {
        "content": "<p>The scenario is mainly for GET.  The enrichment will happen subsequent after the resource is returned from the FHIR server and before the client sees it. I saw your comment on my other posts and I can see how it will get complex with the lastUpdated, meta.version and eTags.<br>\nWonder what will be the most accepted why do achieve something like this. Perhaps a provenance resource as you mentioned with an extension to denote what was changed by the external service.</p>",
        "id": 243997339,
        "sender_full_name": "Amit Cudykier",
        "timestamp": 1624687591
    },
    {
        "content": "<p>if you need Provenance to point to specific attributes that were enriched, instead of just the whole resource, you can use this proposed standard extension <a href=\"http://hl7.org/fhir/StructureDefinition/targetElement\">http://hl7.org/fhir/StructureDefinition/targetElement</a> (see <a href=\"https://jira.hl7.org/browse/FHIR-21284\">https://jira.hl7.org/browse/FHIR-21284</a>).</p>",
        "id": 244038333,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1624748136
    },
    {
        "content": "<p>great theory, but that extension does not yet exist and has not been drafted... unless I am missing where it has been defined.</p>",
        "id": 244073115,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624809919
    },
    {
        "content": "<p><a href=\"#narrow/stream/179166-implementers/topic/Source.20of.20information/near/206442700\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Source.20of.20information/near/206442700</a> suggests that there's at least a strawman out there</p>",
        "id": 244085196,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1624828369
    },
    {
        "content": "<p>It's an approved change request, that is just waiting to be put in the build.</p>",
        "id": 244217264,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1624922921
    },
    {
        "content": "<p>Thank you. we will define an extension based on what we found in those threads.  I will share what we came up with</p>",
        "id": 244589581,
        "sender_full_name": "Amit Cudykier",
        "timestamp": 1625155214
    }
]