[
    {
        "content": "<p>Hi, I would like to know how to search or really if you had information to instruct me how to map data from a google sheets so I can dump them to FHIR resources, I am somewhat lost at that point.</p>",
        "id": 154016181,
        "sender_full_name": "Andrea del Pozo Ferreira",
        "timestamp": 1541600898
    },
    {
        "content": "<p>In terms of \"search\", read through the search.html page and, ideally, try some of the examples using one of the test servers listed in the link of the bottom of the home page (e.g. <a href=\"http://test.fhir.org/r3\" target=\"_blank\" title=\"http://test.fhir.org/r3\">http://test.fhir.org/r3</a>).  You can also google to find a wide variety of FHIR education videos.  If you have specific questions with how to do a specific type of search, that would be an appropriate question to raise here. </p>\n<p>In terms of converting data from a Google sheet, you'll need to save the sheet data into something you can parse with software (CSV or XML, most likely) and then write software to map into the relevant FHIR resource structures - perhaps a Transaction Bundle if you're touching multiple resources.  You may find one of the reference implementations in the downloads.html page helpful for this. </p>\n<p>I'd also recommend reading the <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions\">FHIR Rules for asking questions</a>.  The community is a welcoming place, but your initial question seems to fall in the \"please do my homework for me\" category, and those are frowned upon.</p>",
        "id": 154016185,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541601596
    },
    {
        "content": "<p>Good morning, thank you for your response and I clarify what I had thinking should be done, and before the last comment let me say that this out of place as I was not looking for that. Again I say thank you for your answer clear my doubts.</p>",
        "id": 154016192,
        "sender_full_name": "Andrea del Pozo Ferreira",
        "timestamp": 1541602688
    },
    {
        "content": "<p>Hi All,</p>\n<p>I am new to this forum. I have some question regarding mapping data from your backend DB to the FHIR persistent store.<br>\nI can see 2 situations here:<br>\n1. One has a \"non-fhir\" repository as SoR<br>\n2. For a brand new project, one can have the repository as \"fhir enabled\"</p>\n<p>I wonder if for case #1, you could share any best practices , tools, information etc for mapping an existing data source to FHIR resources.</p>\n<p>1. Are there any tools that help with data mapping ? <br>\n2. Anybody used Smile CDR ? Do they have any such mapping tools ?</p>",
        "id": 154016664,
        "sender_full_name": "Ovidiu Girlan",
        "timestamp": 1541687101
    },
    {
        "content": "<p>We use Dapper to map result from no-FHIR SQL database to FHIR resource. <a href=\"https://www.nuget.org/packages/Dapper\" target=\"_blank\" title=\"https://www.nuget.org/packages/Dapper\">https://www.nuget.org/packages/Dapper</a>.<br>\nI believe any ERM library/tool can do that.</p>",
        "id": 154016674,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1541687749
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> can comment on Smile. </p>\n<p>In terms of tools, one common strategy is to use something like Hybernate to map between the object representation and your particular database.</p>",
        "id": 154016676,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541687762
    },
    {
        "content": "<p>Thank you guys.<br>\nLloyd, if using Hybernate that will create object classes based on the layout/schema of the source DB, right ? Assume that clinical data is spread across various tables and user schemas. I assume that you need a processing layer that will manipulate Hybernate classes/objects, create fhir resources (assume one uses happi-fhir) and then persist those in FHIR server persistent store ?<br>\nWhat is the approach to create the fhir DB schema, before being able to persist resources ?</p>\n<p>Thanks !</p>",
        "id": 154016684,
        "sender_full_name": "Ovidiu Girlan",
        "timestamp": 1541688580
    },
    {
        "content": "<p>If you're designing a FHIR-based persistence layer, there's lots of discussion in the history of this stream.  There's also a new-ish stream devoted to <a class=\"stream\" data-stream-id=\"134\" href=\"/#narrow/stream/134-storage-for-FHIR\">#storage for FHIR</a></p>",
        "id": 154016689,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541688977
    },
    {
        "content": "<p>If you're using Java / HAPI FHIR, you have two options. The HAPI FHIR <a href=\"http://hapifhir.io/doc_rest_server.html\" target=\"_blank\" title=\"http://hapifhir.io/doc_rest_server.html\">Server framework</a> can be used to provide a FHIR Server on top of your own database design. In other words, you write the storage logic, HAPI handles the FHIR server part (this is situation 1 you note above). If you want HAPI FHIR to provide the database schema, you could use the <a href=\"http://hapifhir.io/doc_jpa.html\" target=\"_blank\" title=\"http://hapifhir.io/doc_jpa.html\">HAPI FHIR JPA Server</a>. This is situation 2.</p>\n<p>Smile CDR certainly supports both of these options if you need commercial support. It also includes an <a href=\"https://smilecdr.com/docs/current/bulk/etl_import_module.html\" target=\"_blank\" title=\"https://smilecdr.com/docs/current/bulk/etl_import_module.html\">ETL Module</a> that can be used to bulk import CSV/spreadsheet data and a bunch of other converters and the like.</p>",
        "id": 154016698,
        "sender_full_name": "James Agnew",
        "timestamp": 1541689688
    },
    {
        "content": "<p>Thanks James !<br>\nIn my case, we do have the \"MDM like source of truth\" repository that is read only (cannot be updated via FHIR). This is like a warehouse where data is updated via ETL and batch process.<br>\nOn top of that there is a FHIR server which should expose DW data as fhir resources. So the FHIR platform will have its own persistence module (DB) where resources are stored. External clients  are able to update or create new resources, however the root DW can not be updated in real time.<br>\nSo FHIR persistence module/DB can be FHIR enabled as long as DW data can be imported.</p>",
        "id": 154016855,
        "sender_full_name": "Ovidiu Girlan",
        "timestamp": 1541706270
    },
    {
        "content": "<p>Greetings,</p>\n<p>I am an Computer Science Master degree student in the University of Porto, in Portugal.</p>\n<p>My thesis research topic is about \"HL7-v2 to FHIR Mappings\", I wonder if someone could please advise me some literature about the subject(articles, books).</p>\n<p>Or at least give me some orientation were I should start, because about what I have been reading, this is very complex subject.</p>\n<p>Thanks,<br>\nMarcos Pais.</p>",
        "id": 154017444,
        "sender_full_name": "Marcos Pais",
        "timestamp": 1541927713
    },
    {
        "content": "<p>It is indeed a complex subject :)  Certainly look at the v2 comparison (<a href=\"http://build.fhir.org/comparison-v2.html\" target=\"_blank\" title=\"http://build.fhir.org/comparison-v2.html\">http://build.fhir.org/comparison-v2.html</a>) and at the v2 mappings (e.g. <a href=\"http://build.fhir.org/patient-mappings.html#v2\" target=\"_blank\" title=\"http://build.fhir.org/patient-mappings.html#v2\">http://build.fhir.org/patient-mappings.html#v2</a>).  There's also a stream devoted to v2 and FHIR that might be helpful: <a class=\"stream\" data-stream-id=\"32\" href=\"/#narrow/stream/32-v2-to-FHIR\">#v2 to FHIR</a>.  I'm not sure how much - if anything - is formally documented in articles or books yet.</p>",
        "id": 154017453,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541935639
    }
]