[
    {
        "content": "<p>Most of what we do has a V3 background. Most ValueSets for that reason contain exceptional values i.c. NullFlavors. Almost always these are UNK and OTH, but MSK/ASKU/NASK could happen. If no specific NullFlavor is specified, any NullFlavor can happen.</p>\n<p>When I take a ValueSet like that to FHIR, I get into questions I cannot answer in STU3 and R4 makes it worse. I hope someone can shed some light.</p>\n<p>Consider this V3 fragment:</p>\n<div class=\"codehilite\"><pre><span></span>&lt;value xsi:type=&quot;CD&quot; nullFlavor=&quot;UNK&quot;/&gt;\n</pre></div>\n\n\n<p>In FHIR this could lead to:</p>\n<div class=\"codehilite\"><pre><span></span>&lt;valueCodeableConcept&gt;\n  &lt;extension url=&quot;http://hl7.org/fhir/StructureDefinition/iso21090-nullFlavor&quot;&gt;\n    &lt;valueCode value=&quot;UNK&quot;/&gt;\n  &lt;/extension&gt;\n  &lt;extension url=&quot;http://hl7.org/fhir/StructureDefinition/data-absent-reason&quot;&gt;\n    &lt;valueCode value=&quot;unknown&quot;/&gt;\n  &lt;/extension&gt;\n  &lt;coding&gt;\n    &lt;system value=&quot;http://hl7.org/fhir/v3/NullFlavor&quot;/&gt;\n    &lt;code value=&quot;UNK&quot;/&gt;\n    &lt;display value=&quot;unknown&quot;/&gt;\n  &lt;/coding&gt;\n&lt;/valueCodeableConcept&gt;\n</pre></div>\n\n\n<p>Suppose the ValueSet behind this element would specify the exceptional value UNK, then any validator would require UNK to be in coding. Suppose the ValueSet did not list UNK, then any validator would forbid UNK in coding (likely pointing the implementer towards the extension).</p>\n<p>This is really inconvenient, and it does not answer how UNK relates to DataAbsentReason which sort of duplicates what UNK is trying to say.</p>\n<p>Matters get worse in R4 where the NullFlavor extension in FHIR has been updated to say that I should not use OTH, PINF, NINF and TRC anymore.</p>\n<p>Is there any guidance in when to use what?</p>",
        "id": 168393331,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1560859541
    },
    {
        "content": "<p>Best practice is that where the notion of \"unknown\" is relevant for a coded element, it should be part of the value set.  If it's not part of the bound value set, but the binding strength is example, preferred or extensible, you can still use  the UNK as a code value.  If the binding is <em>required</em>, you're out of luck.  It's not permissible to have the element included in the instance unless a code is chosen from the value set.  There must either be a coding from the bound value set or the element must be omitted.  (And if it's a min=1 element, you may be in a situation where you can't send an instance at all.)</p>",
        "id": 168420097,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560877050
    },
    {
        "content": "<p>For non-coded elements, best practice is probably to use DataAbsentReason as it's more FHIR-specific.  However, sending NullFlavor instead for ease of conversion isn't necessarily wrong.  Sending both is sort of redundant, but may also ease reverse conversion/preserve source information better.</p>",
        "id": 168420246,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560877131
    },
    {
        "content": "<blockquote>\n<p>OTH, PINF, NINF and TRC</p>\n</blockquote>\n<p>there a specific reasons for each of these, and if it's a problem, then there's an underlying problem, I think</p>",
        "id": 168438834,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560880585
    },
    {
        "content": "<blockquote>\n<p>OTH, PINF, NINF, TRC</p>\n</blockquote>\n<p>I can see how OTH + originalText from V3 would end up being just CodeableConcept.text (potentially with coding.userSelected=true) but I fail to see why having NullFlavor OTH would be advised against. </p>\n<p>Same for PINF/NINF/TRC. I must say I've never seen those in practice, but suppose they are true in V3, what would you do in FHIR?</p>\n<p>It's a pity that the discussion that must have led to the updated wording in the extension was not captured with the extension so I could understand. I've looked for the tracker item, but could not find it. Would you happen to know?</p>",
        "id": 168460757,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1560896617
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Thanks I think that could work for us. After inspection of our profiles, I believe there's only 1 occasion where we might run into trouble because of an element 1..1, binding required, no NullFlavors in set, and reason to believe there should have been. But that would be our thing to look into. Thanks again.</p>",
        "id": 168461843,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1560897567
    },
    {
        "content": "<p>OTH, TRC, PINF and NINF all have only valid uses in V3 that have no equivalent in FHIR - they're  methodology things</p>",
        "id": 168463297,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560898940
    },
    {
        "content": "<p>If the extension NullFlavor is about bringing that functionality to FHIR, why leave them out? Isn't the extension about the same thing which is to state your reason for not having a value? Suppose I truly have:</p>\n<div class=\"codehilite\"><pre><span></span>&lt;value xsi:type=&quot;PQ&quot; nullFlavor=&quot;TRC&quot; unit=&quot;mmol&quot;/&gt;\n</pre></div>\n\n\n<p>What would I do?</p>",
        "id": 168463948,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1560899669
    },
    {
        "content": "<p>how can you truly have that?</p>",
        "id": 168464125,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560899942
    },
    {
        "content": "<p>I assert that the value of this is positive infinity (with no units...). That is not a meaningful statement. The only place that PINF (and NINF) are meaningful statements are where they are assigned an arbitrary meaning of \"not, actually, when it comes to it, [X}INF\" in IVL</p>",
        "id": 168464250,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560900033
    },
    {
        "content": "<p>Like I said: I've not seen NINF/PINF/TRC in practice, but R4 deemed it necessary to say \"do not use here\". So what would I do when I see them? If there is no real life use case for ever using those NullFlavors in V3, then I should just assume they occur.</p>",
        "id": 168502316,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1560948087
    },
    {
        "content": "<p>When you see them, you need to figure out what they're trying to represent and then decide what the appropriate way to represent that in FHIR is - which could be context-specific.</p>",
        "id": 168509496,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1560953112
    }
]