[
    {
        "content": "<p>Hello everyone! <br>\nI was wondering if anyone is focusing on the area of data accuracy, specifically data obtained from other provider/entities' APIs of the healthcare system and how you're handling any such case like so</p>",
        "id": 245577921,
        "sender_full_name": "Susheel Palakurthi",
        "timestamp": 1625960915
    },
    {
        "content": "<p>In any case, also wanted to check in the industry and get to know what others are working on with FHIR and other healthcare/healthtech systems -- whatever you're willing to share, aha <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 245578786,
        "sender_full_name": "Susheel Palakurthi",
        "timestamp": 1625962486
    },
    {
        "content": "<p>Can you explain what you mean by accuracy?  What exactly are you trying to measure?</p>",
        "id": 245582698,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625969317
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/data.20accuracy/near/245582698\">said</a>:</p>\n<blockquote>\n<p>Can you explain what you mean by accuracy?  What exactly are you trying to measure?</p>\n</blockquote>\n<p>While we were doing our research on the FHIR APIs, we got to know some problems with the current implementation guide and features. For example, when accessing any data, how can we be sure about the integrity of the data? Ex. an insurance provider enters the physician's name for the name of the organization/clinic. Or is there data validation we can do on our end, as 3rd party apps?</p>",
        "id": 245583247,
        "sender_full_name": "Susheel Palakurthi",
        "timestamp": 1625970260
    },
    {
        "content": "<p>There isn't typically a lot you can do.  If you have multiple sources, you can cross-check the data, but it's possible for multiple sources to have the same error if the data originated from the same original source.  If there are specific rules that can allow you to reliably check string values, you can try that.  You can also do sanity checks on dates and numeric values.</p>",
        "id": 245584371,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625972187
    },
    {
        "content": "<p>not uncommon for a recipient to consider the source. but that is business rules, not something that would show on the interop standard.</p>",
        "id": 245676809,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626091638
    },
    {
        "content": "<p>There is a way that a sender can declare a level of integrity, they could tag the data with .meta.security element using the valueSet that has a bag of integrity statements -- <a href=\"http://hl7.org/fhir/v3/SecurityIntegrityObservationValue/vs.html\">http://hl7.org/fhir/v3/SecurityIntegrityObservationValue/vs.html</a><br>\nthis is not typical, and is a decaration the sender would be expected to place on the data. (The recipient could decorate the data upon receipt too, possibly using some algorithm).</p>",
        "id": 245676924,
        "sender_full_name": "John Moehrke",
        "timestamp": 1626091693
    },
    {
        "content": "<p>I would hope to handle data quality in meta, but not in security.</p>",
        "id": 245700402,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1626102770
    },
    {
        "content": "<p>One foremost case for data quality is MeasureReport</p>",
        "id": 245700492,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1626102816
    }
]