[
    {
        "content": "<p>This is probably a basic question...<br>\nI'm working on a scenario where we're populating a US Core Patient and would like to include a medical record number received in an related exchange. We can't ensure that we'll have a system for that MRN... and the US Core Patient requires identifier.system.</p>\n<p>Is it kosher to use identifier.type to characterize the identifier as an MRN, and use a data-absent-reason in place of the system? Like...</p>\n<p>\"identifier\": [<br>\n  {<br>\n    \"type\": {<br>\n      \"coding\": [<br>\n        {<br>\n          \"system\": \"<a href=\"http://terminology.hl7.org/CodeSystem/v2-0203\">http://terminology.hl7.org/CodeSystem/v2-0203</a>\",<br>\n          \"code\": \"MR\",<br>\n          \"display\": \"Medical record number\"<br>\n        }<br>\n      ]<br>\n    },<br>\n    \"_system\": {<br>\n      \"extension\": [<br>\n        {<br>\n          \"url\": \"<a href=\"http://hl7.org/fhir/StructureDefinition/data-absent-reason\">http://hl7.org/fhir/StructureDefinition/data-absent-reason</a>\",<br>\n          \"valueCode\": \"unknown\"<br>\n        }<br>\n      ]<br>\n    },<br>\n    \"value\": \"30455\"<br>\n  }<br>\n]</p>\n<p>Thanks in advance</p>",
        "id": 229931074,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1615498823
    },
    {
        "content": "<p>I guess that's sort of what US Core pushes you into.  You might submit a change request to them and suggest that they make system 'mustSupport' rather than mandatory.  You can also use Identifier.text to convey more detail.  E.g. \"text\":\"Hospital XYZ MRN\" (if you have at least that) so that a system can use that for human display.</p>",
        "id": 229932233,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615499287
    },
    {
        "content": "<p>Thanks Lloyd. I think we'll have something we could put into text... I hadn't thought of that</p>",
        "id": 229932398,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1615499364
    },
    {
        "content": "<p>Just create a system</p>",
        "id": 229943505,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1615503585
    },
    {
        "content": "<p>Based on what you know of that MRN</p>",
        "id": 229943614,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1615503616
    },
    {
        "content": "<p>If it's <em>your</em> MRN, sure.  If it's someone else's, creating your own 'system' for it is problematic</p>",
        "id": 229944829,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615504256
    },
    {
        "content": "<p>It will be the situation that Lloyd mentions... the MRN will be owned by the sender of a  previous message--in a data standard that doesn't include a system qualifier for the MRN value. It just comes across as \"patient's MRN\". </p>\n<p>One thought we had was to use the data-absent-reason in the identifier.system element and also include another extension with a fixed value that indicates the element in the transaction it came from (the NCPDP new prescription message's Patient MRN field). </p>\n<p>The goal is to enable those that implement the profile to use the value systematically with confidence that it's the one supplied in the earlier message.</p>\n<p>What do you think of that idea?</p>",
        "id": 230055322,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1615565360
    },
    {
        "content": "<p>We create our own systems - combining a root URL specific to our system + a segment specific to the origin</p>",
        "id": 230064174,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1615568597
    },
    {
        "content": "<blockquote>\n<p>It will be the situation that Lloyd mentions... the MRN will be owned by the sender of a previous message--in a data standard that doesn't include a system qualifier for the MRN value. It just comes across as \"patient's MRN\".</p>\n<p>One thought we had was to use the data-absent-reason in the identifier.system element and also include another extension with a fixed value that indicates the element in the transaction it came from (the NCPDP new prescription message's Patient MRN field).</p>\n</blockquote>\n<p>If you resolve the provider from the NCPDP message to a known organization, you could indirectly determine the identifier system. I had no idea until now that NCPDP does not have a proper patient identifier structure in their specifications.</p>",
        "id": 230068429,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1615570446
    },
    {
        "content": "<p>That's right... you can have a valid electronic prescription with just patient demographics and no patient identifier.</p>",
        "id": 230082679,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1615576495
    },
    {
        "content": "<p>And the prescriber's practice location is also optional... so you might just receive their name and individual NPI. For most prescriptions in the US, there will also be a proprietary routing ID assigned by the prescribing network that represents the prescriber+practice+system, but that isn't guaranteed to be fixed over time.</p>",
        "id": 230083377,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1615576826
    },
    {
        "content": "<p>The routing ID received in the prescription can be used to route a response through the network, though.</p>",
        "id": 230084592,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1615577427
    }
]