[
    {
        "content": "<p>Hi All, there are a lot of models I'm running across... QUICK, DAF, FHIM, etc... does anyone have any thoughts? The context is that I'm trying to just start by representing vital signs (systolic/diastolic BP, for example). I'd like to use QUICK, but I can't really find any specific examples...</p>",
        "id": 153816262,
        "sender_full_name": "Angelo Kastroulis",
        "timestamp": 1458245124
    },
    {
        "content": "<p>bp example  in base spec</p>",
        "id": 153816265,
        "sender_full_name": "Eric Haas",
        "timestamp": 1458245175
    },
    {
        "content": "<p>thx eric. any of those models carry more weight than the others?</p>",
        "id": 153816274,
        "sender_full_name": "Angelo Kastroulis",
        "timestamp": 1458245428
    },
    {
        "content": "<p>Not sure what you mean by weight and sure I'm not qualified to pick one.  In US realm ?</p>",
        "id": 153816277,
        "sender_full_name": "Eric Haas",
        "timestamp": 1458245668
    },
    {
        "content": "<p>Each of the QUICK profiles has an example, is there something in particular you're looking for?</p>",
        "id": 153816280,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1458245693
    },
    {
        "content": "<p>Yes, in the US Realm... just wondering how to interpret/navigate all these... not knowing their history and etymology</p>",
        "id": 153816282,
        "sender_full_name": "Angelo Kastroulis",
        "timestamp": 1458245723
    },
    {
        "content": "<p>Just starting with vital signs in quick to get my feet wet</p>",
        "id": 153816283,
        "sender_full_name": "Angelo Kastroulis",
        "timestamp": 1458245759
    },
    {
        "content": "<p>FHIM is the Federal Health Information Model, it's an aggregate model that aims to incorporate the models used by many different Federal Health Systems. It's completely different than FHIR, but there are efforts underway to be able to translate between them.</p>",
        "id": 153816289,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1458245824
    },
    {
        "content": "<p>QUICK and DAF are sets of profiles on top of the base FHIR specification that introduce constraints and/or extensions to enable interoperability within a specific area. QUICK is focused on quality measurement and decision support, while DAF is focused on the meaningful use data set.</p>",
        "id": 153816294,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1458245902
    },
    {
        "content": "<p>hopefully we'll just have one representation of a vital signs, irrespective of the underlying models</p>",
        "id": 153816299,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458246113
    }
]