[
    {
        "content": "<p>Hello guys, I'm new to FHIR and interoperability in health care. <br>\nPlease, can anyone point me to the best way on how to use data dictionary (elements) to map fhir resource. A video link would be much appreciated. <br>\nThank you.</p>",
        "id": 231444129,
        "sender_full_name": "Chinedu Ethelbert",
        "timestamp": 1616492945
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"399945\">@Chinedu Ethelbert</span> I've changed your topic name because your post wasn't related to the topic you had posted under.</p>\n<p>I'm not really understanding the question.  You're trying to map FHIR to an existing data dictionary?  You're trying to create a net new data dictionary for FHIR?  You're trying to figure out how to represent a data dictionary using FHIR resources?</p>",
        "id": 231467995,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616505455
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . Yes, I'm trying to figure out how best to represent a data dictionary using FHIR resources.</p>",
        "id": 231601592,
        "sender_full_name": "Chinedu Ethelbert",
        "timestamp": 1616576782
    },
    {
        "content": "<p>If you want to represent a data dictionary - you can use a Logical Model</p>",
        "id": 231609483,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616580802
    },
    {
        "content": "<p>the Logical Model is an abstract representation of data elements, consistent wtih a Data Dictionary.</p>",
        "id": 231615080,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616583551
    },
    {
        "content": "<p>Right.  StructureDefinition allows you to define data elements at varying levels of granularity.  You can define collections of elements or individual elements and you can define complex elements like address or simple ones like birth date.  The more granular you get, the higher the overhead per element.  You might take a look at the <a href=\"http://hl7.org/fhir/us/sdcde\">SDC-DE</a> implementation guide.  It's pretty out-of-date and somewhat unloved, but it tries to map ISO 11179 data elements to StructureDefinition.</p>",
        "id": 231628453,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616590719
    },
    {
        "content": "<p>Thank you Lloyd! Appreciated.</p>",
        "id": 232155335,
        "sender_full_name": "Chinedu Ethelbert",
        "timestamp": 1616924235
    }
]