[
    {
        "content": "<p>DId anyone build or know of a DataElement Viewer / Browser? I think this resource can be a great backend for a MetaDataRegistry.</p>",
        "id": 243153062,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1624019374
    },
    {
        "content": "<p>Not sure if this would work but ClinFhir has a bundle viewer; maybe it could be used?<br>\n<a href=\"http://clinfhir.com/bundleVisualizer.html\">http://clinfhir.com/bundleVisualizer.html</a></p>",
        "id": 243153865,
        "sender_full_name": "John Silva",
        "timestamp": 1624019845
    },
    {
        "content": "<p>I am looking for a viewer that actually \"understands\" the DataElement. The ClinFhir bundle viewer just shows the contents of a bundle. But maybe <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span>  Has some thoughts..</p>",
        "id": 243354270,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1624265287
    },
    {
        "content": "<p>What does 'understand' a data element mean? Are you referring to the elementDefinition model of the element?</p>",
        "id": 243354879,
        "sender_full_name": "David Hay",
        "timestamp": 1624265760
    },
    {
        "content": "<p>The specs say \"DataElement is an infrastructure resource that supports the defining individual pieces of data that might be collected or stored. While these definitions might apply to elements found in FHIR resources and profiles, they can also apply to questionnaire questions, elements in data stores, and non-FHIR specification (HL7 v2 , CDA , CDISC, etc.) I.e. the definitions aren't FHIR-specific.\"<br>\nI am looking for a viewer were I can search the DataElements in a FHIR server that than presents the DE and also the profiles and other DEs the DE is mapped to and the associated other things like ValueSets, in some smart view.</p>",
        "id": 243398084,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1624288706
    },
    {
        "content": "<p>Do you mean the DataElement resource in R3? It was dropped in R4...</p>",
        "id": 243420669,
        "sender_full_name": "David Hay",
        "timestamp": 1624298810
    },
    {
        "content": "<p>Hah. I just read the notice in STU3. It is now rolled into StructureDefinition as a Logical Model.</p>",
        "id": 243421154,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1624299039
    }
]