[
    {
        "content": "<p>When I visited Mitre this week, <span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> expressed the belief that the cascade of Questionnaire, DataElement, and ElementDefinition is confusing </p>",
        "id": 153847336,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473932704
    },
    {
        "content": "<p>I don't see a standard extension to link a question with a data element. </p>",
        "id": 153847337,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473932801
    },
    {
        "content": "<p>and I think it's time for me to ask why we don't collapse Data Element into StructureDefinition</p>",
        "id": 153847338,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473932820
    },
    {
        "content": "<p>So, DataElement is also intended for Observation masterfile type stuff.  Are we going to want to add that into StructureDefinition?</p>",
        "id": 153847365,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473947206
    },
    {
        "content": "<p>I don't think we do, but I don't think it does that well</p>",
        "id": 153847366,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473947240
    },
    {
        "content": "<p>We should think about and get some consensus around how we're going to solve that use-case before doing the merge.</p>",
        "id": 153847369,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473947501
    },
    {
        "content": "<p>agree. it would be good to be clear about what the scope of observation master file is</p>",
        "id": 153847370,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473947541
    },
    {
        "content": "<p>yes we (OO) have been looking at this using labtestcatalog.  So far have seen very little overlap between this use case and DE  we are also looking at ActivityDefinition as an alternative - not much overlap there either as far as I can tell.   Besides ---at least to me-  it makes more sense conceptually to define a service item with a activity than a DE.  Jose is looking at the drug formulary use case. Was the expectation that DE be used there as well?</p>",
        "id": 153847400,
        "sender_full_name": "Eric Haas",
        "timestamp": 1473964782
    },
    {
        "content": "<p>We use <code>DataElement</code> as a means of recording data element definition externally to <code>StructureDefinition</code> to ensure consistency of meaning where the same element is used in 2 (or more) <code>StructureDefinitions</code>.  Personally, I think a <code>StructureDefinition</code> should never be able to define a data element itself, but only reference a pre-existing one that's defined in a data dictionary.  I know that'll never happen because it's deemed \"too hard\" to do proper data modelling for resources, but if the <code>DataElement</code> is ditched, those of us who do want to do it properly in our logical models are stuffed.</p>",
        "id": 153847436,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1474009501
    },
    {
        "content": "<p>Aside from the implementation, what I've found is that clinicians think in terms of data elements. Discussions of data exchange, particularly on the research side, are often phrased in terms of which data elements to exchange.  In addition, there are large existing libraries of common data elements found at US NIH and many other places. It seems a pity not to have a formulaic way to build FHIR profiles out of these libraries. </p>",
        "id": 153847480,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1474030642
    },
    {
        "content": "<p>The extension for questionnaire that links a question to the dataelement is here: <br>\n<code>http://hl7.org/fhir/extension-questionnaire-dereference.html</code></p>",
        "id": 153847502,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1474066102
    },
    {
        "content": "<p>And if not embedding directly in the Questionnaire, then there is this extension to point it to a ConceptMap<br>\n<code>http://hl7.org/fhir/extension-questionnaire-demap.html</code></p>",
        "id": 153847503,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1474066218
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> we certainly need to be clear about it how that works, yes. </p>",
        "id": 153847512,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474067269
    },
    {
        "content": "<p>@Stephen Royce - you've jumped the gun here. I wouldn't propose removing data element if I didn't think there were other solutions to acehive the same outcome. As for defining data elements directly - I think that's wrong; data elements are defined in a context, and not reused elsewhere </p>",
        "id": 153847515,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474067506
    },
    {
        "content": "<p>So what are the the \"other solutions\"?  We need a context-independent means of defining data elements.  (Which doesn't mean that context is ignored when doing so, that wouldn't make any sense, but, nonetheless, the concepts exist in their own right regardless of how they are used.  Think of \"Name\" if you want an example.  We all know what name means despite the fact that name can be used for a person, for an organisation and for a cat.  These are all different contexts, probably with their own concept that is a subclass of name, but the idea of \"Name\" is still very useful.)</p>",
        "id": 153849279,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1474248313
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Before I worked in healthcare, I saw corporate data dictionaries with what I'd call data elements everywhere (insurance, justice, governmental). Those would be (re)used in a certain context, usually a message-like construct. In Dutch healthcare we're doing the same - setting up data dictionaries with elements like smoking behaviour, education etc. I fail to see what's wrong with such an approach, though I may misunderstand your remark about data elements not being reused and only defined in context.</p>",
        "id": 153849501,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1474278515
    },
    {
        "content": "<p>I was referring to the data elements defined as part of FHIR resources. I agree that the higher level data elements you refer to are intended for re-use. But I also observe that these things called 'data elements' are usually clusters of information, with some (variable) provenance information as well as the actual focus value, and sometimes several fields of data (not always corresponding to a type)</p>",
        "id": 153849503,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474278897
    },
    {
        "content": "<p>There's always some ontological commitment (smoking behaviour pertains to persons, not devices) and that is context too. And you need some type-level \"elements\" too. (Or looser aggregations, if that's what you refer to.) It would be nice to be able to capture those in some FHIR artefact - either the DataElement resource or something else. Problem is there are lots of definitions from healthcare professionals out there, not based on FHIR, and we need some way to relate those to FHIR resources. Currently I was thinking of expressing those in Data Elements, aggregate them in Logical Models and use Concepts Maps to relate to FHIR resources. But I'm in the process of figuring out what and how, so maybe that's not the best approach.</p>",
        "id": 153849506,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1474279823
    },
    {
        "content": "<p>we're in about the same place as you, though I have something specific to illuminate my thinking - see <a href=\"http://fhir.hl7.org.au/fhir/rcpa/explanation.html\" target=\"_blank\" title=\"http://fhir.hl7.org.au/fhir/rcpa/explanation.html\">http://fhir.hl7.org.au/fhir/rcpa/explanation.html</a>. This is a current matter of focus for us</p>",
        "id": 153849507,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474280159
    },
    {
        "content": "<blockquote>\n<p>When I visited Mitre this week, <span class=\"user-mention\" data-user-email=\"mark@catalyze.io\">@Mark Olschesky</span> Kramer expressed the belief that the cascade of Questionnaire, DataElement, and ElementDefinition is confusing</p>\n</blockquote>\n<p>And I heard someone at the connectathon say that the fact that Questionnaire is not part of the StructureDefinition/ElementDefinition framework, makes it harder to write Implementation Guide and validation for Quesionnaires - or it will cause duplicate work for tooling.</p>",
        "id": 153849514,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1474285911
    },
    {
        "content": "<p>I hope that's not a bad approach because that was pretty much what we're (starting to) do here in Australia!</p>",
        "id": 153850070,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1474430799
    },
    {
        "content": "<p>we'll be working on this over the next few weeks to calrify how this all works. I'll be providing a worked example (one that you'll find quite familiar!)</p>",
        "id": 153850076,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474453170
    },
    {
        "content": "<p>So where are we with master files?... I am moving forward from the ground up on a <a href=\"http://ig.fhir.me/Healthedata1/fhirlabtestcatalog/labtestcatalog.html\" target=\"_blank\" title=\"http://ig.fhir.me/Healthedata1/fhirlabtestcatalog/labtestcatalog.html\">labtestcatalog</a> and still don't see a clear link to data element.    GG can we resurface your  \"data dictionaires\" somewhere  so I can try to connect the dots?</p>",
        "id": 153850723,
        "sender_full_name": "Eric Haas",
        "timestamp": 1474854001
    },
    {
        "content": "<p>This has bearing on ActivityDefinition as well, is that resource as defined a good fit for a lat test catalog? And if not, why not?</p>",
        "id": 153851265,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1475167554
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> Here is <a href=\"http://ig.fhir.me/Healthedata1/fhirlabtestcatalog/labtestcatalog-mappings.html#fhir-mapping\" target=\"_blank\" title=\"http://ig.fhir.me/Healthedata1/fhirlabtestcatalog/labtestcatalog-mappings.html#fhir-mapping\">my preliminary (= first draft) mapping to ActivityDef</a>.   I don't see a lot of overlap with either DataElement or ActivityDef - i.e need lots of extensions. for this admittedly narrow use case.   There are other people approaching lab catalogs from different angles.     </p>",
        "id": 153851309,
        "sender_full_name": "Eric Haas",
        "timestamp": 1475170439
    },
    {
        "content": "<p>hope to get some more input on this from others</p>",
        "id": 153851310,
        "sender_full_name": "Eric Haas",
        "timestamp": 1475170483
    }
]