[
    {
        "content": "<p>Hello, <br>\nCan someone guide me how to map the following data-elements to FHIR? <br>\nTreatment Plan, Pain Scale, Call Reason, Vitals, Lab Results, Consent, Drugs Adherence, Images .  <br>\nThanks</p>",
        "id": 239559251,
        "sender_full_name": "Oded Sofer",
        "timestamp": 1621502430
    },
    {
        "content": "<p>You can start by looking at this <a href=\"http://hl7.org/fhir/R4/resourceguide.html\">Guide to resources</a> for an overview over where some typical types of data go. The <a href=\"http://hl7.org/fhir/R4/resourcelist.html\">overall resource index</a> also sorts the resource into categories which can help narrow down the search for the right resource type. The documentation of the individual resources then contains information about which data pieces go where.</p>",
        "id": 239563466,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1621504605
    },
    {
        "content": "<p>thank you, I will try to find there</p>",
        "id": 239571033,
        "sender_full_name": "Oded Sofer",
        "timestamp": 1621508530
    },
    {
        "content": "<p>BTW, it's easy to miss on a first visit but the documentation pages for individual FHIR resources all have an \"Examples\" tab near the top. There you can find official examples of how a resource instance might look in different scenarios - very helpful for getting a feel for them.</p>",
        "id": 239577943,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1621511939
    },
    {
        "content": "<p>The core spec also has a search feature that might be helpful for at least some of your targets.</p>",
        "id": 239588527,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621516399
    },
    {
        "content": "<p>Relatedly, <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span>, do you know how to map these formulary and drug CMS Rule requirements to FHIR v4? I'm not seeing an overlap in terminology from the list you shared: <a href=\"http://hl7.org/fhir/us/davinci-drug-formulary/STU1.0.1/\">http://hl7.org/fhir/us/davinci-drug-formulary/STU1.0.1/</a>.</p>",
        "id": 239787227,
        "sender_full_name": "Merlyn Albery-Speyer",
        "timestamp": 1621618695
    },
    {
        "content": "<p>I'm afraid I don't know anything about Da Vinci or CMS. However, there are several streams dedicated to specific Da Vinci topics, I imagine posting your question there would be the best way to get an answer.</p>",
        "id": 239891003,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1621708079
    }
]