[
    {
        "content": "<p>Not sure if this topic has been already discussed, wanted to know what databases are to be looked at when we are looking to save and retrieve FHIR resources. We are evaluating MongoDb, Postgress,...any suggestions and comments will be helpful... Two factors that are of major importance for us are 1) Integrity issues and Transaction concerns 2) Since the DSTU2 to DSTU3 structures and upcoming releases indicate considerable changes in the FHIR resources the database should be flexible to accomodate and should not pose a challenge while migrating..</p>",
        "id": 153858527,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1480109358
    },
    {
        "content": "<p>Definitely postgresql :) Transnational, jsonb , advanced indexing, SQL, plv8, fast batch update operations  (take a look at fhirbase)</p>",
        "id": 153858528,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1480109490
    },
    {
        "content": "<p>fundamental choise = relational vs post-relational. post-relational has many advantages, but chained search with transactional integrity turns out to be hard in that case</p>",
        "id": 153858531,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480111100
    },
    {
        "content": "<p>but structure changes won't be solved by any different choice in database structures. You'll have the same problems whatever</p>",
        "id": 153858532,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480111135
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  By post-relational do you mean document databases like mongo, couchdb, rethinkdb? They are usually called NoSQL :) Here is a notion of NewSQL databases <a href=\"https://en.wikipedia.org/wiki/NewSQL\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/NewSQL\">https://en.wikipedia.org/wiki/NewSQL</a>. PostgreSQL could simulate consistent document database until you have terabytes of data (i.e. CAP).</p>",
        "id": 153858533,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1480111440
    },
    {
        "content": "<p>yes i meant nosql, but I have also worked with - and still do - relational databases that have nosql because theys are pre-sql. so I find post-relational a better description of the idea. Postgres is trying to be jack-of-all-trades here, and you could use it either way</p>",
        "id": 153858534,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480111536
    },
    {
        "content": "<p>but you stll have a choice</p>",
        "id": 153858535,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480111542
    },
    {
        "content": "<p>With document databases there are real problems with transnational integrity, most of them provide transactions only on document level. A lot of problems with joins and query language expensiveness, some of them usually build materialized views to handle it.</p>",
        "id": 153858536,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1480111694
    },
    {
        "content": "<p>Better keep name \"post-relational\" for logical databases like datomic (datalog) :)</p>",
        "id": 153858537,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1480111800
    },
    {
        "content": "<p>Just be aware of precision loss on decimals in whatever solution you're considering. FHIR is pretty strict about it (<a href=\"http://hl7.org/fhir/2016Jan/datatypes.html#precision\" target=\"_blank\" title=\"http://hl7.org/fhir/2016Jan/datatypes.html#precision\">http://hl7.org/fhir/2016Jan/datatypes.html#precision</a>) and understandably so</p>",
        "id": 153859350,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1480543790
    },
    {
        "content": "<p>+1 for PostgreSQL. There are even benchmarks telling that it is faster than MongoDB  when it comes to JSON handling. Plus: a relational database is more performant when it comes to aggregations. PostgreSQL can easily simulate anything you could do in MongoDB and outperform it most of the time while still being capable of doing all the relational stuff where you need it.</p>",
        "id": 153859363,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1480544830
    }
]