[
    {
        "content": "<p>We are using Basic resource type to support Notes. But we are surprised because created element isn't a datetime. It is expecting a date. Why?</p>",
        "id": 154021155,
        "sender_full_name": "Hedrie Cid Díaz",
        "timestamp": 1543352700
    },
    {
        "content": "<p>That's the level of detail most other resources use</p>",
        "id": 154021189,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1543360860
    },
    {
        "content": "<p>The consensus in the community seems to be around using DocumentReference for notes, with small notes captured using Observation.</p>",
        "id": 154021190,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1543360889
    },
    {
        "content": "<p>Thanks for your answer. We will use the resource type you are suggesting.</p>",
        "id": 154021365,
        "sender_full_name": "Hedrie Cid Díaz",
        "timestamp": 1543430692
    },
    {
        "content": "<p>We were reviewing DocumentReference but we are not sure if it's the best resource to represent our notes since they are plain text and don't have a hard copy stored elsewhere. About the Observations, as you say they can only be used in very specific cases for small notes. So, what is the best way to represent these more extensive plain text notes?</p>",
        "id": 154021834,
        "sender_full_name": "Hedrie Cid Díaz",
        "timestamp": 1543525439
    },
    {
        "content": "<p>DocumentReference can point to a \"contained\" attachment.  <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> can you provide more guidance?</p>",
        "id": 154024305,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544486994
    },
    {
        "content": "<p>The best place to read up on storing retrieving clinical notes is in the <a href=\"https://argonautproject.github.io/clinicalnotes/\" target=\"_blank\" title=\"https://argonautproject.github.io/clinicalnotes/\">Argonaut Clinical Notes</a> implementation guide. We didn't end up using observation, and I am not aware of using observation for notes unless it's for a specific observation.</p>",
        "id": 154024396,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1544533435
    },
    {
        "content": "<p>DocumetReference uses the datatype Attachment. Attachment has two methods: .url which usually points at a Binary (but could be anything), and .data that holds base64ed copy of the attachment.  For the reader of a DocumentReference, the .data will need to be expanded; where as the url can be retrieved and that retrieve supports http negotiation.  Thus you have options.<br>\nAs with all FHIR resources the degenerate minimal form is very small. The metadata elements are there for when that functionality is needed.</p>",
        "id": 154024418,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544536824
    },
    {
        "content": "<blockquote>\n<p>We were reviewing DocumentReference but we are not sure if it's the best resource to represent our notes since they are plain text and don't have a hard copy stored elsewhere. About the Observations, as you say they can only be used in very specific cases for small notes. So, what is the best way to represent these more extensive plain text notes?</p>\n</blockquote>\n<p>There is no expectation that a DocumentReference has anything to do with hard copy stored elsewhere. A Binary can hold very small or very large amount of data. So it seems reasonable to use of DocumentReference to minimally describe (metadata) your clinical note, like the Argonaut spec describes, and a Binary holding the note.</p>",
        "id": 154024421,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544539671
    }
]