[
    {
        "content": "<p>I'm confused as to how I can express the timezone in the 'Date' Header as per this statement in the spec: <a href=\"http://build.fhir.org/http.html#return\" target=\"_blank\" title=\"http://build.fhir.org/http.html#return\">http://build.fhir.org/http.html#return</a>   \"Server should always return the default timezone for date searches in the HTTP Response headers using the Date header.\"<br>\nMy reading of the 'Date' HTTP header format is that it must always be GMT, so how does that tell someone the default timezone unless it is mandatory that default always be GMT?</p>\n<p>\"Greenwich Mean Time. HTTP dates are always expressed in GMT, never in local time.\" <br>\nRef:<a href=\"#narrow/stream/4-implementers/search/server.20timezone.20header\" title=\"#narrow/stream/4-implementers/search/server.20timezone.20header\">https://chat.fhir.org/#narrow/stream/4-implementers/search/server.20timezone.20header</a> </p>\n<p>An HTTP-date value represents time as an instance of Coordinated    Universal Time (UTC).  The first two formats indicate UTC by the three-letter abbreviation for Greenwich Mean Time, \"GMT\", a predecessor of the UTC name; values in the asctime format are assumed to be in UTC.  A sender that generates HTTP-date values from a local clock ought to use NTP ([RFC5905]) or some similar protocol to synchronize its clock to UTC. <br>\nRef: <a href=\"https://tools.ietf.org/html/rfc7231#section-7.1.1.1\" target=\"_blank\" title=\"https://tools.ietf.org/html/rfc7231#section-7.1.1.1\">https://tools.ietf.org/html/rfc7231#section-7.1.1.1</a></p>",
        "id": 153997940,
        "sender_full_name": "Angus Millar",
        "timestamp": 1537331605
    },
    {
        "content": "<p>........ and I don't know</p>",
        "id": 153997952,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537339493
    },
    {
        "content": "<p>Sounds like a change request is in order.  <span class=\"user-mention\" data-user-id=\"191391\">@Angus Millar</span>, can you submit one?</p>",
        "id": 153998072,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537363535
    },
    {
        "content": "<p>See Also <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16550\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16550\">GF#16550</a></p>",
        "id": 153998279,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1537377488
    },
    {
        "content": "<p>It looks like Grahame submitted some changes, but not sure if it addressed concerns around the term \"time zone\" and how it's used in the spec</p>",
        "id": 153998280,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1537377529
    },
    {
        "content": "<p>but that Gforge did deal with the date header (at least there was some discussion of that in comments)</p>",
        "id": 153998281,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1537377574
    },
    {
        "content": "<p>but I think I also was looking at the wrong date format on that :) Didn't realize it specifically required GMT</p>",
        "id": 153998285,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1537378313
    },
    {
        "content": "<p>well, the comments assumed that the date header did indicate the timezone</p>",
        "id": 153998890,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537500650
    },
    {
        "content": "<p>as did I</p>",
        "id": 153998891,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537500664
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> I don't understand something from your comments:</p>",
        "id": 153998892,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537500686
    },
    {
        "content": "<blockquote>\n<p>Time zone != offset. We've had issues in prod where the offset is ambiguous and the wrong time zone was chosen. This comes into play more on \"math\" on dates than direct comparison</p>\n</blockquote>",
        "id": 153998893,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537500701
    },
    {
        "content": "<p>that doesn't make sense - if you use timezone, and the offset is ambiguous, then you can have maths problems (been there, done that). That's why offsets are better.</p>",
        "id": 153998894,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537500736
    },
    {
        "content": "<p>there's an extension for timezone</p>",
        "id": 153998895,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537500760
    },
    {
        "content": "<p>though, of course, the subject here is really http headers, not extensions</p>",
        "id": 153998896,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537501283
    },
    {
        "content": "<p>so the thing is that this candidate normative statement is simply wrong:</p>\n<blockquote>\n<p>If the server has a default timezone, it SHOULD return the default timezone in the HTTP Response headers using the \"Date\" header.</p>\n</blockquote>",
        "id": 153998897,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537501324
    },
    {
        "content": "<p>I would very much not like the whole ballot process to fail on this issue. But I would also like to fix this. Perhaps we can adjust the text to :</p>",
        "id": 153998898,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537501372
    },
    {
        "content": "<p>If the server has a default timezone, it SHOULD return the default timezone in the HTTP Response headers using a XXX  header.</p>",
        "id": 153998899,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537501924
    },
    {
        "content": "<p>I just wrote to the chair of the HTTP WG asking him for comment....</p>",
        "id": 153998900,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537501935
    },
    {
        "content": "<p>but I think we can change that text as a technical correction because no one can conform to it at all now</p>",
        "id": 153998901,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537501979
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>   For math, I mean things like calculating dose times in the future or from a date. Offsets don't work for this, timezones are the only thing that will have all the DST rules so that you can land things at the correct local time. This is true of things that have to happen at 8/20 as well as \"weird\" intervals. </p>\n<p>Example of weird intervals: we have situations where a med is every 2 hours, but when it crosses DST, that isn't treated as a hard interval, it's flexed either to continue with previous times (which is weird, you ask \"then why didn't they make it times of day\" ... :) ) or actually be the hard 2 hours (and so the \"time of day\" will change). If it's the hard 2 hours, you're correct, the exact time zone probably doesn't matter. But if the goal is to maintain local time, it is important to get the correct time zone.</p>",
        "id": 153999046,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1537546423
    },
    {
        "content": "<p>The other place getting the correct time zone matters is for display to the user. We have systems that cross time zones, and have requirements for some situations to display some times in the local users zone, and other times <em>in the zone in which they were recorded</em> - we actually record the time zone. We've already had 1 scenario which had a med passed in with an ambiguous offset via FHIR. When it displayed to the user, the wrong time zone was chosen, and it was reported by the user.</p>",
        "id": 153999048,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1537546553
    },
    {
        "content": "<p>ok that's clearer. I wonder whether this is something to add to the resource in meta - the timezone of the local user for the resource?</p>",
        "id": 153999146,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537567482
    },
    {
        "content": "<p>Is there a reason not to add the server timezone to the servers CapabilityStatement at [base]/metadata?</p>",
        "id": 153999688,
        "sender_full_name": "Angus Millar",
        "timestamp": 1537845715
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191391\">@Angus Millar</span>  In our case, our server is always UTC, but the data is not the same and varies by the location of the user and patient.</p>",
        "id": 153999732,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1537879549
    },
    {
        "content": "<p>So which problem are we trying to solve, I see two problems. <br>\n1. How do I know a servers timezone, the FHIR standard does not state that UTC is mandatory for servers.<br>\n2. What is the timezone the resource creator was intending, if not supplied in a Date or DateTime.<br>\nAre these not both issues which each require different solutions.</p>",
        "id": 153999864,
        "sender_full_name": "Angus Millar",
        "timestamp": 1537931445
    },
    {
        "content": "<blockquote>\n<p>ok that's clearer. I wonder whether this is something to add to the resource in meta - the timezone of the local user for the resource?</p>\n</blockquote>\n<p>that'd be nice,  for sure! I've been looking at <a href=\"http://build.fhir.org/extension-tz-code.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-tz-code.html\">http://build.fhir.org/extension-tz-code.html</a> for this -- but it'd be nice not to have to say it separately on every datetime in a given resource, and it'd be nice to avoid extensions for this.</p>",
        "id": 153999865,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1537932375
    },
    {
        "content": "<p>(Not necessarily \"local user\" but perhaps something more like \"the timezone as which dates/datetimes in the resource should be interpreted\")</p>",
        "id": 153999866,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1537932434
    },
    {
        "content": "<p>well, to pursue <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span>'s answer....  at what level can you state the tz? can a resource contain mixed applicable timezones?</p>",
        "id": 153999874,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537938944
    },
    {
        "content": "<p>Right. If you have this kind of \"default timezone context\" flowing down from Resource.meta, and it gets overridden in extensions on specific datetimes... you have to be really careful about the whole thing.</p>",
        "id": 153999950,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1537972086
    },
    {
        "content": "<p>hmm</p>",
        "id": 153999958,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537973102
    },
    {
        "content": "<p>I'm talking about an http header  with the ietf http-wg. Not a lot of interest... seems they think it's a content issue, not protocol. Makes me lean towards adding timezone to meta. we could do an extension for R2-R4, and make it a core element in R5 if it proves useful</p>",
        "id": 153999960,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1537973232
    },
    {
        "content": "<p>A bit of a brain dump trying to think through this...</p>\n<p>Internally, we have some variation on how this is handled, and it depends on context. A specific date can have a zone tied to it. This is <em>usually</em> to capture context of the user that entered data, so that an app can choose to display that later. That would lean towards the extension. And I can see that this may not be 80% logic :)</p>\n<p>In addition, we have a location that captures the local zone of the patient. This is so you can translate from a \"local time\" to a real instant in time correctly - like the med dosages. This is most common (for us) in inpatient scenarios. However, I would imagine that a consumer-facing app would need to do something similar when there is no encounter (for example) that would have a location tied to it. Note: we don't have a \"zone\" on the Location in FHIR, so another extension? Right now, someone would have to extrapolate this from geolocation, if it existed. (another option here would be to use the meta data like Grahame indicated so that non-encounter based as well as encounter-based zone info could be found in the same place)</p>",
        "id": 154000045,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1537983246
    },
    {
        "content": "<p>Finally, we have apps where the use case makes more sense to convert all times to the local user's time zone. This is \"client side\" logic usually. From a server perspective, this isn't normally an issue it has to deal with <em>except</em> for the Narrative and other displays we return. I know we have a translation extension + the capability to add language tags to narratives now. It would be nice if I could only choose to return the \"original\" + the requested translation, and this is the main scenario I can think of that would start to push for headers</p>",
        "id": 154000049,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1537983741
    },
    {
        "content": "<p>The assumption being that the \"translation\" would take Locale as well as zone preferences into consideration</p>",
        "id": 154000050,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1537983775
    },
    {
        "content": "<p>But now we may be veering into uncharted waters :)</p>",
        "id": 154000051,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1537983932
    },
    {
        "content": "<p>comment form the chair of the HTTP WG:</p>\n<blockquote>\n<p>This has come up a few times. While getting it into Web browsers would be difficult (thanks to the inherent privacy issues, as well as the existence of other solutions), defining it for non-browser applications simplifies the problem somewhat, and based on the number of times it's come up, might see some take-up.<br>\nPersonally, I like the proposal in:<br>\n<a href=\"http://www.w3.org/mid/DBDF1A48B00F2042B20953D2ACE4968806A0ADE526@sha-exch14.shared.ifeltd.com\" target=\"_blank\" title=\"http://www.w3.org/mid/DBDF1A48B00F2042B20953D2ACE4968806A0ADE526@sha-exch14.shared.ifeltd.com\">http://www.w3.org/mid/DBDF1A48B00F2042B20953D2ACE4968806A0ADE526@sha-exch14.shared.ifeltd.com</a><br>\nIf you (or someone else) wanted to sketch out a proposal in an Internet-Draft, we could discuss it and decide whether there's consensus to adopt.<br>\nThat said, the gating factor is likely to be finding someone who's willing to put in the work of editing a document. If we can find people to help in that process, would you be willing to do so?</p>\n</blockquote>",
        "id": 154003578,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538390728
    },
    {
        "content": "<p>is anyone interested in taking this up?</p>",
        "id": 154003579,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538390739
    }
]