[
    {
        "content": "<p>Hi, I have a question about returning the Date header for HTTP responses. <a href=\"https://www.hl7.org/fhir/http.html#return\" title=\"https://www.hl7.org/fhir/http.html#return\">https://www.hl7.org/fhir/http.html#return</a> that page says \"If the server has a default timezone, it SHOULD return the default timezone in the HTTP Response headers using the \"Date\" header.\" so it seems that we should be using whatever timezone our servers are using. However if you look at the spec from IETF (<a href=\"https://tools.ietf.org/html/rfc7231#section-7.1.1.2\" title=\"https://tools.ietf.org/html/rfc7231#section-7.1.1.2\">https://tools.ietf.org/html/rfc7231#section-7.1.1.2</a>) it seems to be saying that the Date header should be in UTC/GMT. My team is debating whether to go with EST (which is unfortunately what many of our database date-times are stored in) or UTC. Does anyone know which we should be using?</p>",
        "id": 195210123,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1587744517
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span></p>",
        "id": 195225693,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587752107
    },
    {
        "content": "<p>I don't think there's a good answer to this question (or any other question involving time zones and HTTP). </p>\n<p>I read the base HTTP specification several times trying to decide whether it mandates that the data must have a UTC header. I can't decide - it clearly says that the server must be able to correctly calculate the UTC time, but it doesn't explicitly say that it has to state it in that timezone</p>\n<p>the HTTP committee is dedicated to demonstrating that timezone doesn't matter; they say that you should just use javascript (private communication between me and the HTTP chair MNot), but when you are delivering application functionality over an HTTP interface (which they also endorse) that doesn't cut it. But they've declined to actually endorse proposals for a timezone header....</p>",
        "id": 195249564,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1587765681
    },
    {
        "content": "<p>Could the server publish it's TimeZone as part of the CapabilityStatement?</p>",
        "id": 225007302,
        "sender_full_name": "Dunmail",
        "timestamp": 1612354811
    },
    {
        "content": "<p>it could. but it's the client timezone that's more useful in practice</p>",
        "id": 225073704,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612382788
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179166-implementers/topic/Date.20Header/near/225073704\">said</a>:</p>\n<blockquote>\n<p>it could. but it's the client timezone that's more useful in practice</p>\n</blockquote>\n<p>Our concern is that the server needs to know which timezone it is operating in when interpreting dates e.g. 2020-06-01T10:00 in the UK has daylight saving applied. There are scenarios where a client is operating in a different timezone to the server e.g. misconfiguration | different locale, and consequently the client and server interpret dates differently.<br>\nWhere this is a risk, the client could at least check and amend behaviour accordingly e.g. translating date search parameters with implied precision into explicit date range searches.</p>\n<p>Our internal solution will be to add an extension to CapabilityStatement.implementation but don't want to do this if there is a standard change in the pipeline!</p>",
        "id": 225138211,
        "sender_full_name": "Dunmail",
        "timestamp": 1612432094
    },
    {
        "content": "<p>duplicate respnse</p>",
        "id": 225138910,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1612432509
    }
]