[
    {
        "content": "<p>In looking at the date search rules, it's not terribly clear how they work when the target element is missing entirely.  For example, what's the result of a search on \"le1980\" for a patient whose birthdate element is completely missing?  Do all of the comparison types match?  not-match?  (Related to <a href=\"http://community.fhir.org/t/search-dates-by-range-in-medicnalproductauthorization/3570\">http://community.fhir.org/t/search-dates-by-range-in-medicnalproductauthorization/3570</a>, which is triggering issues because there are specific searches for start and end, rather than doing the 'normal' thing and just having a search that works against the range.</p>",
        "id": 276624854,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648217789
    },
    {
        "content": "<p>In my server if the resource does not have a date with which to compare on then the item is excluded. A null value cannot be asserted as being &gt; or &lt; than anything. <br>\nLet's say you do the opposite.<br>\nSearch &gt; 1980 ..... resource null is included<br>\nSearch &lt; 1980 ..... resource null is included<br>\nSearch = 1980 ..... resource null is included<br>\nThis seems wrong to me. Whenever there is a criteria then a resource with a null value is excluded.<br>\nIt also happens to be what the :missing modifier would be used for. (now applying a :missing to a date value is a different thing.)</p>",
        "id": 276631517,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1648220534
    },
    {
        "content": "<p>Lloyd: file a ticket?  =)</p>\n<p>I <em>think</em> the intention is that null values do not match against parameters with values (unless specifically designed by the Search Parameter).  If you want to search for resources that do not have a value, the <code>:missing</code> modifier can be used.  Assuming that <code>:missing=true</code> and <code>:missing=false</code> are complements, value searches against those elements should not return those records.</p>\n<p>If we wanted to get really fancy, we could propose modifiers for R5 like <code>:includenull</code>/<code>:excludenull</code> in addition to clarifying the default behavior.</p>",
        "id": 276637133,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1648222734
    },
    {
        "content": "<p>Additional note: this should be clarified in the context of the <code>ne</code> prefix specifically.<br>\n(e.g., trying to work through the differences between <code>?date=ne20220325&amp;date:missing=false</code> and <code>?date=ne20220325</code>.  <code>?date=ne20220325&amp;date:missing=true</code> can be reduced to <code>?date:missing=true</code>.)</p>",
        "id": 276637359,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1648222824
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-36646\">FHIR#36646</a></p>",
        "id": 276685646,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648246232
    }
]