[
    {
        "content": "<p>I am adding a new feature to hapi-fhir that allows users to search for dates in the future.  I'm thinking of using %now as a value for now.  Loosely inspired by the fhirpath environment variable syntax.  Any recommendations for a better syntax?  Should something like this make it into the fhir standard?</p>",
        "id": 175256868,
        "sender_full_name": "Ken Stevens",
        "timestamp": 1568045426
    },
    {
        "content": "<p>So, the server would substitute %now with the current DateTime?  Why not have the client do that, and then you wouldn't need the syntax?</p>\n<p>Slightly related is embedded FHIRPath in FHIR queries (see 5.4 in <a href=\"http://build.fhir.org/ig/HL7/sdc/expressions.html#x-fhir-query-enhancements\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/sdc/expressions.html#x-fhir-query-enhancements\">http://build.fhir.org/ig/HL7/sdc/expressions.html#x-fhir-query-enhancements</a>).  But the running of that FHIRPath happens before the query is issued.</p>",
        "id": 175262324,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1568049194
    },
    {
        "content": "<p>Who or how should the query deal with timezone differences between client and server?  The client may not know how the server stored the date (UTC or local or other).   Would it be the server's or the client's responsibility to get the timezone (offset) right?</p>",
        "id": 175263042,
        "sender_full_name": "John Silva",
        "timestamp": 1568049677
    },
    {
        "content": "<p>A DateTime passed by the client can include the timezone offset.</p>",
        "id": 175264429,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1568050606
    },
    {
        "content": "<p>see our discussion on timezones here:  <a href=\"#narrow/stream/179175-argonaut/topic/Language\" title=\"#narrow/stream/179175-argonaut/topic/Language\">https://chat.fhir.org/#narrow/stream/179175-argonaut/topic/Language</a>  halfway through the stream we swtiched from languages to tz and in the end we punted on making any specific guidance in US Core.</p>",
        "id": 175264685,
        "sender_full_name": "Eric Haas",
        "timestamp": 1568050791
    },
    {
        "content": "<p>This is used by subscriptions where the value of %now is different every time it's run, e.g. to filter on appointments that haven't happened yet.  <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span></p>",
        "id": 175268634,
        "sender_full_name": "Ken Stevens",
        "timestamp": 1568053111
    },
    {
        "content": "<p>I see.  So, the Subscription.criteria field, which is a query, needs to be stored with \"%now\".  So, then either the general search function of the server has to know about %now, or the part of the server that handles subscriptions has to know about \"%now\" (and replace it before handing it to the search function).  I don't know which would be better, and it would probably be better to hear from others who are writing servers.  <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> ?</p>",
        "id": 175271278,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1568054874
    },
    {
        "content": "<p>But in case there are more of these things, it might be better to use embedded FHIRPath (see link above).</p>",
        "id": 175271448,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1568054991
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> and I came up with the %now suggestion together.  I have it working in my hapi-fhir branch now.  I expect it to be merged into hapi-fhir later this week.  I posted here as this is a placeholder solution until we can find a more standards based solution.  I'm coding it now because people need this functionality \"now\"...</p>",
        "id": 175272221,
        "sender_full_name": "Ken Stevens",
        "timestamp": 1568055539
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> I'd think that if we had now in FHIRPath it would be now() or DateTime.now()? (not %now which is for external concepts)</p>\n<p>But this is a search question, not a FHIRPath question, right? Do we have anything like this in search? or is it a subscription question? there's an applicable format defined in CDS hooks?</p>",
        "id": 175278005,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568059601
    },
    {
        "content": "<p>Yes, we currently define current date/time functions in FHIRPath here: <a href=\"http://hl7.org/fhirpath/2019May/#current-date-and-time-functions\" target=\"_blank\" title=\"http://hl7.org/fhirpath/2019May/#current-date-and-time-functions\">http://hl7.org/fhirpath/2019May/#current-date-and-time-functions</a></p>",
        "id": 175278962,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1568060315
    },
    {
        "content": "<p>We have now(), timeOfDay(), and today()</p>",
        "id": 175278991,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1568060333
    },
    {
        "content": "<p>And we don't have a way to do this in the CDS hooks spec now, at least as part of prefetch, it would have to be done as part of a search against the endpoint passed in the request.</p>",
        "id": 175279681,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1568060784
    },
    {
        "content": "<p>And I'm not seeing anything in the FHIR search either. You can search based on passed in dates, but not based on a \"within\".</p>",
        "id": 175279701,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1568060819
    },
    {
        "content": "<p>You can express it with a DataRequirement, if you specify a Duration for the dateFilter, where it is interpreted as \"those data items that fall within Duration before now\".</p>",
        "id": 175279916,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1568060958
    },
    {
        "content": "<blockquote>\n<p>we don't have a way to do this in the CDS hooks spec now</p>\n</blockquote>\n<p>there's a syntax: Observation?patient={{context.patientId}}. e.g. using liquid syntax... that would seem to be applicable to the subscription context</p>",
        "id": 175280065,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568061050
    },
    {
        "content": "<p>Agreed, and suggest using \"Simple\" FHIRPath within the Liquid token: <a href=\"http://hl7.org/fhir/fhirpath.html#simple\" target=\"_blank\" title=\"http://hl7.org/fhir/fhirpath.html#simple\">http://hl7.org/fhir/fhirpath.html#simple</a></p>",
        "id": 175280470,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1568061338
    },
    {
        "content": "<p>With the exception that you could reference the current date and time functions. (And should we consider adding the current date and time functions to \"Simple\" FHIRPath?)</p>",
        "id": 175280557,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1568061372
    },
    {
        "content": "<p>Hasn't come up yet in the Argonaut subscriptions to my knowledge.  We are keying off Search for filter parameters/types so far, but our use-cases don't expose any dates yet, so it makes sense that it hasn't.<br>\nI can see expressing this for a Topic in FHIRPath since it has the concepts already there, but it would likely need to be present in a filter parameter as well.<br>\n<span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> thoughts?</p>",
        "id": 175280678,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1568061461
    },
    {
        "content": "<p>If the goal is to filter based on appointments that haven't happened yet, of course Appointment status values are probably useful ;-)</p>\n<p>But more generally, if the goal is to subscribe to changes that can't be expressed in </p>\n<p>1. a static fhirpath expression that generates candidate events + <br>\n2. a set of pre-defined search parameters expressions that further filter this candidate set<br>\n... then we don't currently have an approach. (i.e., we didn't in R4, and we haven't proposed to introduce one in R5.)</p>",
        "id": 175281256,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568061815
    },
    {
        "content": "<p>No reason we <em>couldn't</em> do so, but we'd probably want to introduce this at the level of FHIR's generic search capabilities, rather than doing something special for Subscriptions.</p>",
        "id": 175281450,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568061933
    },
    {
        "content": "<p>subscription is different. it doesn't make sense to talk about a format for talking about things in the future when now has a known vlaue</p>",
        "id": 175283029,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568063132
    },
    {
        "content": "<p>Agreed that the need for current-time-as-a-variable doesn't arise in one-shot queries, since the client knows the current time (although on fine time scales, client doesn't know the network latency / when a query will actually arrive at a server, so <em>even there</em> the semantics of a \"now\" variable aren't totally useless). But what I wanted to say is: the general concept of variables probably does apply to search outside of subscriptions (e.g., in a search that incorporates server context variables like warning/debug levels, startup times, etc).</p>",
        "id": 175284145,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568064054
    },
    {
        "content": "<p>So I'd rather lay a framework for variables in search, and then decide which specific variables matter in a subscription.</p>",
        "id": 175284173,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568064075
    },
    {
        "content": "<p>It's true that \"now\" is known at the time of execution, but there are other \"saved search\" types of scenarios ourside of  subscriptions where you need to search dates relative to \"now\" and it would be handy not to have to rewrite those queries at search time.</p>",
        "id": 175286881,
        "sender_full_name": "Ken Stevens",
        "timestamp": 1568066184
    },
    {
        "content": "<p>I leaned towards the %environment syntax because I can imagine installs where there are many fhir servers that share stored searches across them and want to set search parameters based on local configuration, e.g. Organization?identifier=%local_clinic_id</p>",
        "id": 175287002,
        "sender_full_name": "Ken Stevens",
        "timestamp": 1568066297
    },
    {
        "content": "<p>I could also imagine searches based on information available in the session  e.g. /Patient?identifier=%user_id</p>",
        "id": 175287059,
        "sender_full_name": "Ken Stevens",
        "timestamp": 1568066371
    },
    {
        "content": "<p>Yes, these are great examples of the kinds of capabilities where server-based variables <em>might</em> be useful in regular searches (not just subscription notifications).</p>",
        "id": 175287426,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568066723
    },
    {
        "content": "<p>there's yet another syntax to consider, from here, where we're doing this already: <a href=\"http://hl7.org/fhir/lifecycle.html#current\" target=\"_blank\" title=\"http://hl7.org/fhir/lifecycle.html#current\">http://hl7.org/fhir/lifecycle.html#current</a></p>\n<p><code>GET [base]/AllergyIntolerance?patient=42&amp;_list=$current-allergies</code></p>",
        "id": 175294964,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568074304
    },
    {
        "content": "<p>I think we should rationalise all this and use liquid syntax in the search format</p>",
        "id": 175294977,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568074320
    },
    {
        "content": "<p>That's a great idea (though <a href=\"https://handlebarsjs.com\" target=\"_blank\" title=\"https://handlebarsjs.com\">https://handlebarsjs.com</a> might be what I'd call it for broader compatibility; for simple expressions, same deal).</p>",
        "id": 175297934,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568078112
    },
    {
        "content": "<p>We talked about using <code>$now</code> as the syntax for this, but had decided against it given that $ is used as the composite parameter separator so it'd presumably need to be escaped</p>",
        "id": 175337033,
        "sender_full_name": "James Agnew",
        "timestamp": 1568123084
    },
    {
        "content": "<p>We also talked about coming up with a syntax to allow FHIRPath expressions (e.e. <code>date={{now()}}</code> ) which seemed neat, but at first blush I figured that seems misleading since I don't know how you could use the rest of FHIRPath as a part of a parameter value, but people would surely try and complain when they couldn't..</p>",
        "id": 175337210,
        "sender_full_name": "James Agnew",
        "timestamp": 1568123173
    },
    {
        "content": "<p>Right would be tricky to explain that it doesn’t look in the target resources but it’s just a pre-process thing</p>",
        "id": 175341758,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568125703
    }
]