[
    {
        "content": "<p>Hello - I was looking at the regex for some datatypes, and noticed that the significant figures for fractional seconds for datetime (and similar) are essentially unbounded: /\\.[0-9]+/</p>\n<p>Then there is the caveat that the regexs are informative rather than authoritative... is there any authoritative position on fractional seconds?</p>",
        "id": 213808864,
        "sender_full_name": "Nick George",
        "timestamp": 1603123864
    },
    {
        "content": "<p>May want to see this caveat too \"Seconds must be provided due to schema type constraints but may be zero-filled and may be ignored at receiver discretion.\"</p>",
        "id": 213861626,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603152124
    },
    {
        "content": "<p>From <a href=\"http://hl7.org/fhir/datatypes.html#dateTime\">http://hl7.org/fhir/datatypes.html#dateTime</a> to make sure we're talking about the same thing</p>",
        "id": 213861710,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603152202
    },
    {
        "content": "<p>I didn't actually realize that fractional seconds were supported, given that seconds themselves were ignorable</p>",
        "id": 213861735,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603152230
    },
    {
        "content": "<p>but I believe it's inherited from the xs:dateTime requirements, which also has unbounded fractional seconds</p>",
        "id": 213862134,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603152554
    },
    {
        "content": "<p>I think that the reference implementations only support nanoseconds, but I haven't actually checked e.g. the validator past that point</p>",
        "id": 213873442,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1603166674
    },
    {
        "content": "<p>Just came across this thread after actually misinterpreting the spec to say that the second precision is limited <span aria-label=\"grimacing\" class=\"emoji emoji-1f62c\" role=\"img\" title=\"grimacing\">:grimacing:</span>. I read the <a href=\"http://build.fhir.org/datatypes.html#dateTime\">DateTime documentation</a> which says</p>\n<blockquote>\n<p>The format is YYYY, YYYY-MM, YYYY-MM-DD or YYYY-MM-DDThh:mm:ss+zz:zz (...)</p>\n</blockquote>\n<p>In such format strings, I would interpret each character as standing for exactly one character/number and I read the sentence as giving a complete list of allowed formats - in which case it looks like only whole seconds are allowed. I actually deliberate ignored the RegExps due to the warning <span class=\"user-mention\" data-user-id=\"196561\">@Nick George</span> pointed out above. Might it be worth updating the documentation text to make this clearer (I'd be happy to open a ticket but just wanted to rule out that I'm grossly misreading smt.).</p>",
        "id": 241895612,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1623147062
    },
    {
        "content": "<p>Ticket sounds like a good idea.  Please submit one <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> :)</p>",
        "id": 241920305,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623159528
    },
    {
        "content": "<p>Ticket <a href=\"https://jira.hl7.org/browse/FHIR-32883\">FHIR-32883</a></p>",
        "id": 242021676,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1623219158
    }
]