[
    {
        "content": "<p>Hiya - this one is for <span class=\"user-mention\" data-user-id=\"192192\">@Donna Truran</span> but I think it may interest others as an interesting test case:</p>",
        "id": 153835370,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467086475
    },
    {
        "content": "<p><a href=\"http://riskcalculator.facs.org/RiskCalculator/index.jsp\" target=\"_blank\" title=\"http://riskcalculator.facs.org/RiskCalculator/index.jsp\">http://riskcalculator.facs.org/RiskCalculator/index.jsp</a></p>",
        "id": 153835371,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467086476
    },
    {
        "content": "<p>this took is getting a lot of buzz from my colleagues currently</p>",
        "id": 153835372,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467086505
    },
    {
        "content": "<p>several have indicated that they will take the time while with patients to sit down and enter in the data to generate the risk profile for proposed procedures</p>",
        "id": 153835373,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467086568
    },
    {
        "content": "<p>they are severely in violation of their CPT license, but ok. Other than that we could FHIR-ise that - worth doing as an example, <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> ?</p>",
        "id": 153835397,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467097175
    },
    {
        "content": "<p>CPT license?</p>",
        "id": 153835400,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467097504
    },
    {
        "content": "<p>oh the procedure codes...</p>",
        "id": 153835401,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467097579
    },
    {
        "content": "<p>drives me bonkers when folk try to own the ontology</p>",
        "id": 153835402,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467097613
    },
    {
        "content": "<p>y. I haven't got a license for it yet, since i don't live in USA</p>",
        "id": 153835403,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467097621
    },
    {
        "content": "<p>Interesting.... but not what excites me as an example of CDS.  This resembles a lot of 'eligibility for xyz\", used commonly in CRT cohort identification and sign up protocols.... and to be quite narrow (and self interested) about it, there is very little dynamic use of terminology here  (and nothing of SNOMED) , mostly radio buttons yes/no choices and only one 'descriptor' that is free to vary, and that's a   proscribed drop down list... (and of CPT..... )  I'm sure it's useful, but so are a lot of 'guidelines and protocols' whether they are in widgets like this or not</p>",
        "id": 153835408,
        "sender_full_name": "Donna Truran",
        "timestamp": 1467101939
    },
    {
        "content": "<p>so that is our challenge :-)</p>",
        "id": 153835409,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467101985
    },
    {
        "content": "<p>but even to do something \"boring\" like this is very hard</p>",
        "id": 153835410,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467102017
    },
    {
        "content": "<p>the challenge is to be able to express/derive those values from FHIR observation/condition resources</p>",
        "id": 153835411,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467102055
    },
    {
        "content": "<p>very hard</p>",
        "id": 153835412,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467102059
    },
    {
        "content": "<p>being able to do the automated transformation would tax FHIR, CQL and snomed/whatever to the limit</p>",
        "id": 153835413,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467102194
    },
    {
        "content": "<p>Not boring if someone finds it helpful.... but I think it's possible (perhaps not immediately probable tho') to achieve something a bit more sophisticated....  I'm not yet convinced it's as hard or as taxing as you imagine</p>",
        "id": 153835414,
        "sender_full_name": "Donna Truran",
        "timestamp": 1467102342
    },
    {
        "content": "<p>two elements that leap out at me as challenging to reliably extract are \"Disseminated Cancer\" and \"Hypertension requiring medication\" - but on second look I agree that none is too bad</p>",
        "id": 153835416,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467102921
    },
    {
        "content": "<p>the challenge is to build a system that reliably captures the unpderpinning data</p>",
        "id": 153835418,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467102947
    },
    {
        "content": "<p>While you can't fully automate filling an NSQIP, there's a lot that can be prefilled. We're doing that in a medical calculator tool on iOS, \"LOINCifying\" the input we can and leaving the rest to fill manually.</p>",
        "id": 153835426,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1467112612
    },
    {
        "content": "<p>my thought is to try use CQL to attempt to standardise (and make shareable) the necessary transformations</p>",
        "id": 153835428,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467112908
    },
    {
        "content": "<p>and i get excited (i need to get out more) about idea of using this kind of risk-stratification dataset allow comparison between different institutions </p>",
        "id": 153835429,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467113036
    },
    {
        "content": "<p>Yes, that use-case is definitely exciting!</p>\n<p>As for NSQIP it will be rather hard to automate \"ASA Class\" of a patient, though, if that's not been clinically evaluated.</p>",
        "id": 153835431,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1467113128
    },
    {
        "content": "<p>well its not hard really...</p>",
        "id": 153835432,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467113172
    },
    {
        "content": "<p>(that's my day job)</p>",
        "id": 153835433,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467113185
    },
    {
        "content": "<p>if you can quantify someones functional capacity that goes a long way...</p>",
        "id": 153835434,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467113233
    },
    {
        "content": "<p>but I guess your probably looking at a few hundred lines of CQL...</p>",
        "id": 153835435,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1467113335
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Yes, that would be a great example, I'll work something up.</p>",
        "id": 153835464,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1467124301
    },
    {
        "content": "<p>thx!</p>",
        "id": 153835511,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467142879
    },
    {
        "content": "<p>Hi.. I am new to FHIR standards. I need urgent help to create CLAIM FHIR request. I am facing issue to co-relate procedure (CPT codes) with diagnosis(ICD Codes) while create the sample request.. Apprciate help.</p>",
        "id": 153841354,
        "sender_full_name": "Supriya Arora",
        "timestamp": 1469654081
    },
    {
        "content": "<p>Each Claim line item, claim.item, contains the billing code, claim.service, and a link to the relavent diagnosis, claim.item.diagnosisLinkId which matches by value into the claim.diagnosis list in the body of the claim (claim.diagnosis.sequence == claim.item.diagnosisLinkId).</p>",
        "id": 153841355,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1469654357
    },
    {
        "content": "<p>Thank you so much Paul.. do you have any sample json for claim which has ICD and CPT code co-related...</p>",
        "id": 153841356,
        "sender_full_name": "Supriya Arora",
        "timestamp": 1469654536
    },
    {
        "content": "<p>I am using STU3 version and don't see billing code in item</p>",
        "id": 153841357,
        "sender_full_name": "Supriya Arora",
        "timestamp": 1469654829
    },
    {
        "content": "<p>claim.item.service</p>",
        "id": 153841359,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1469656049
    },
    {
        "content": "<p>I'll try to put up an example on the current build in the next few days or on the weekend - can you send me some sample ICD and CPT combinations</p>",
        "id": 153841360,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1469656106
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> Thanks for the explanation above. I know this thread is old, but I had a follow-up question.</p>\n<p>What is the conceptual difference between claim.item.service and claim.procedure.procedure?</p>\n<p>My current understanding is that these elements would often reference the same code for many types of billed services; e.g. a new patient visit (CPT 99201) where the provider performed a colonoscopy (CPT 44389). Is it correct that the primary case where you would include something in claim.item.service and not claim.procedure.procedure is when the billed code is not semantically a procedure (e.g. many CPTII codes)?</p>",
        "id": 160239770,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1551994503
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195380\">@Kenny Blanchette</span> if you look at R4 the claim.item.service is now called productOrService, as well the description has also been improved, so hopefully this will make the differentiation more clear.</p>\n<p>Even when the claim.items are only for services there may not be a one to one correlation between the procedure and the claim.item.productOrService. The claim.procedure.procedure[x] is the clinically significant item whereas the claim.item.productOrService is the billing code from the fee schedule. As an example, the procedure would differentiate between a laproscopic versus an abdominal appendectomy whereas there may be only a single billing code for all appendectomies. This will also vary from payor to payor and jurisdiction to jurisdiction.</p>",
        "id": 160386374,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1552170155
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span> - that helps!</p>",
        "id": 160510055,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1552332648
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span> </p>\n<blockquote>\n<p>Even when the claim.items are only for services there may not be a one to one correlation between the procedure and the claim.item.productOrService. The claim.procedure.procedure[x] is the clinically significant item whereas the claim.item.productOrService is the billing code from the fee schedule. As an example, the procedure would differentiate between a laproscopic versus an abdominal appendectomy whereas there may be only a single billing code for all appendectomies. This will also vary from payor to payor and jurisdiction to jurisdiction.</p>\n</blockquote>\n<p>On claims for physician billing in the U.S., is it appropriate to include all of the line level HCPCS codes as claim.item.productOrService instances and not include them in claim.procedure.procedure[x]?  Or does each line level HCPCS code need to be semantically evaluated to determine if it is ‘clinically significant’ and should instead (or also) be included in claim.procedure.procedure[x]?   In the <span class=\"user-mention\" data-user-id=\"195380\">@Kenny Blanchette</span> example, should colonoscopy (CPT 44389) be considered ‘clinically significant’ and thus only be include/expressed as claim.procedure.procedure[x] vs. claim.item.productOrService?  Or is it acceptable to just map any line level HCPCS code only to claim.item.productOrService, agnostic of the specific code’s meaning?</p>",
        "id": 168870943,
        "sender_full_name": "David Riddle",
        "timestamp": 1561399283
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span>, the quoted section was to answer the question, why would these items be different. The question \"Can these two things contain the same value?\" would be answered with YES. Next let me state, I am not authoritative on  the coding for products or services for professional claims in the US but I think the answer can be derived from going back to the primary purpose of the claim which is to request a payor to determine the amounts to be reimbursed for a list of products and services. This list of products and/or services is in my experience finite (you don't get to send your own made codes, there is a list and it is THE list). The payor specifies the list, though a national organization is often responsible for the definition of the list, the payor will  adopt and then further restrict if necessary. The list may be very broad such 'all of HCPCS and ICD-10-PCS' or it could be very specific such as 'these 200 values from ICD-10-PCS'. The Claim.item.productOrService is the attribute that will most tightly constrained (and may be further constrained by business rules tied to practitioner, their specialties and their location). The Claim.procedure is additional information for the items on the Claim, it provides context. It tells the story to enable you to understand the individual items. If I could provide an analogy, submitting a list of items:  10 hours labour, 2 boxes of nails, and x sheets of plywood you may not have enough information. But if I provide a 'procedure' of 'Build a garden shed', you can understand the list of claim items.</p>\n<p>The question of whether you would repeat the HCPCS code that appears  in the Claim.item.productOrService in the Claim.procedure can only be answered by the entity that you are submitting the Claim to. If you are submitting for adjudication purposes, and the payor requires the inclusion of Claim.procedure, then you would provide the values that you have, even if it is a duplicate. To provide a ludicrous example, if the entity that you are submitting the Claim to requires the colour of the shoes the practitioner was wearing when the services were provided, you will submit that information. Fortunately, I have not come across any payors that have added practitioner shoe colour to their adjudication engines, so we don't submit it and if you did try, I think the payor might reject the claim.</p>\n<p>Hopefully this addresses your questions but don't hesitate to follow up</p>",
        "id": 168954702,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1561481095
    }
]