[
    {
        "content": "<p>In Provenance, target has type Reference(Any). \"Any\" is not defined; where it links, it links to a resource list. </p>\n<p>Could a target be a property within a resource? </p>\n<p>We have a \"reaction date entered.\" Constraining the Provenance activity to \"reaction date entry\" is not sufficient, as the Allergy may have more than one reaction. I think we need to be able to refer inside the resource. Otherwise, we'll need to create an extension.</p>",
        "id": 159159412,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1550845151
    },
    {
        "content": "<p>Any must be a resource - or more specifically, a specific version snapshot of a resource.  Given that all changes that are part of a single transformation must share the same metadata in terms of who made the change, when it was made, etc. this is usually sufficient.  If you need to differentiate reason or reviewer or something for changes to different elements made as part of a single update, you'll need to use extensions.</p>",
        "id": 159164586,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550849629
    },
    {
        "content": "<p>as lloyd indicates, the modeling for Provenance have been remedial so far, so all we can point at today is full Resource. The expectation so far is that the FHIR model is defining Resources at a level of detail that is appropriate for referencing. There have been some discussions about being able to point at a character location within a document. I have recommended this be discussed and an extension defined for testing at FHIR Connectathons.  It is logical for a data blob like an unstructured document that portions based entity pointers are useful.<br>\nI recommend similar in your case for pointing at specific portions of a Resource. The use-case must be made very clear as to the need and justification for that need. Then a reasonable mechanism can be attempted using extensions. If we find enough interest we can elevate that extension into the core specification as a core extension, or even to defined elements in Provenance. <br>\nConcerning that there seems to be a need to have Provenance linkages to sub-Resource elements, would seem to indicate that the Resource being referenced might not be defined properly, it might need to be broken down further. Hence the need to outline the use-case. The resolution of the use-case might be a change to Provenance, or might be uncovering a weakness in the referenced Resource.</p>",
        "id": 159167896,
        "sender_full_name": "John Moehrke",
        "timestamp": 1550851933
    },
    {
        "content": "<p>we talked about making an extension to point inside the resource that target points to, but apparently we didn't execute on that</p>",
        "id": 159193360,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550871432
    },
    {
        "content": "<p>Thanks. I'm not a developer, and won't be at a connectathon; is there a way to put such a request on the docket, or do I need to get my client to send someone to try it out?</p>",
        "id": 159199603,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1550877043
    },
    {
        "content": "<p>Also, the type is \"reference\"; it's not clear one couldn't put a url in there with a path in it. Two questions, really: what will validate, and what's the intent.</p>",
        "id": 159199952,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1550877388
    },
    {
        "content": "<p>Reference has to resolve to a resource (as per <a href=\"http://hl7.org/fhir/references.html\" target=\"_blank\" title=\"http://hl7.org/fhir/references.html\">http://hl7.org/fhir/references.html</a>.  You'll get an error from the validator if you do anything else.</p>",
        "id": 159201198,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550878782
    },
    {
        "content": "<p>You could submit a change request for a standard extension</p>",
        "id": 159201203,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550878792
    },
    {
        "content": "<blockquote>\n<p>the type is \"reference\"; it's not clear one couldn't put a url in there with a path in it</p>\n</blockquote>\n<p>you can put a path in but it has to reference a resource, so you can only reference a contained resource. You need the extension if you want to indicate a part of a resource</p>",
        "id": 159201998,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1550879561
    },
    {
        "content": "<p>Thanks. I'll see if there's an appetite for that.</p>",
        "id": 159339187,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1551103527
    },
    {
        "content": "<p>In the VerificationResult resource we've added a fhirpath expression to point to the element(s) similar to the way that OperationOutcome does it.</p>",
        "id": 164582913,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1556663799
    }
]