[
    {
        "content": "<p>Does anybody know of any work done in the area of defining derived Observations?  </p>\n<p>For example, take the concept of BMI.  BMI is a derived value based off of height and weight and this value could be calculated using something along the lines of CQL.   Is there a way to define not the specific instance of a BMI Observation, but more along the lines of a definition of the Observation along with the CQL that would be used to calculate the value for a specific instance? </p>\n<p>I see ObservationDefintion in the spec and would imagine that applying an extension or 2 could enable this type of use.  Is there any reason not to use ObservationDefinition for this?  Has anyone done anything similar to this using ObservationDefintion or another means?</p>",
        "id": 213034551,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1602507676
    },
    {
        "content": "<p>What do you want to define? The code/concept of BMI, or its calculation formula?</p>\n<p>Related Links:</p>\n<p><a href=\"https://cql.hl7.org/examples.html\">https://cql.hl7.org/examples.html</a><br>\n<a href=\"https://cds.ahrq.gov/cdsconnect/authoring\">https://cds.ahrq.gov/cdsconnect/authoring</a><br>\n<a href=\"https://github.com/ahrq-cds/ahrq-cds-connect-authoring-tool\">https://github.com/ahrq-cds/ahrq-cds-connect-authoring-tool</a></p>",
        "id": 213040694,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602510708
    },
    {
        "content": "<p>I understand how to define CQL so that is not the issue.  What I'm looking for is a way to define a template for an Observation along with the CQL the would be used to populate the value for the Observation.  ObservationDefinition seems like this would be a logical fit as I could define the code/concept of an Observation and add an extension to it to define the CQL that would be used to derive the value.</p>",
        "id": 213042269,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1602511435
    },
    {
        "content": "<p>Does anybody see a reason why ObservationDefinition shouldn't be used like this?</p>",
        "id": 213583187,
        "sender_full_name": "Rob Dingwell",
        "timestamp": 1602865870
    },
    {
        "content": "<p>In terms of representing the answer, unfortunately Observation.derivedFrom is limited to Reference(DocumentReference | ImagingStudy | Media | QuestionnaireResponse | Observation | MolecularSequence). That would work for your BMI example, but would not work for many other derived Observations.</p>",
        "id": 213616761,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1602883925
    }
]