[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nIs there a particular reason why NamingSystem doesn't have a url or version like all of the other resources that map to the definition pattern:<br>\n<a href=\"http://hl7.org/fhir/definition.html\" target=\"_blank\" title=\"http://hl7.org/fhir/definition.html\">http://hl7.org/fhir/definition.html</a></p>",
        "id": 175822550,
        "sender_full_name": "John Timm",
        "timestamp": 1568647410
    },
    {
        "content": "<p>Yes.  NamingSystem can have multiple URLs and uses the 'preferred' flag to indicate which is the appropriate one for use.  It's also not something one can bind to or declare conformance to, so 'version' isn't really necessary.  (We do have 'period' on each identifier to indicate when they were valid.)  The purpose of having a canonical is that it's a single reliable identifier that can't change.  With naming systems, sometimes it could change.  (We don't <em>like</em> it when that happens, but sometimes business processes make it unavoidable - e.g. when two systems independently define different URLs for the same system and then later one of them needs to migrate.)  Also, having a distinct canonical URL that's independent from the actual URLs to use in the instances would have been confusing.</p>",
        "id": 175825844,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568649513
    },
    {
        "content": "<p>please make a task. It's reasonable for NamingSystem to be consistent, and to have a url for tracking the registration</p>",
        "id": 175827184,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568650357
    },
    {
        "content": "<p>We've had a task.  And rejected that task.  If we're going to revisit, we need considerations not covered by the previously submitted request and would need to vote to re-open the discussion.</p>",
        "id": 175848859,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568665437
    },
    {
        "content": "<p>the canonical would be the URL of the <em>registration</em> not the actual system. that apparently is not a consideration from the previous request.</p>",
        "id": 175862178,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568676148
    },
    {
        "content": "<p>I do not understand why NamingSystem is somehow different in terms of it's own handling and publishing and why we refuse to acknowledge the frequent requests to normalise these</p>",
        "id": 175862234,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568676226
    },
    {
        "content": "<p>NamingSystem's whole purpose is to manage URLs - and the one that's \"preferred\" is dynamic.  Creating <em>yet another</em> URL for the system purely for consistency's sake is invariably going to create confusion and mis-use.  If we give guidance that that canonical URL should be the preferred URL, what happens if the preferred URL changes?  How do you merge two NamingSystems when you realize that they're talking about the same thing?  If we give guidance that the canonical URL for the naming system should be distinct from the preferred URL, how do we prevent people from using it by accident?  What happens if people want to use the [base]/NamingSystem/id as their canonical URL?  (Which I consider best practice in many cases)</p>",
        "id": 175862801,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568676923
    },
    {
        "content": "<p>Adding NamingSystem.url is going to cause pain for the users in order to save pain for tool-smiths.  I'd much rather cause pain to tool-smiths and save pain for those who are using NamingSystem to manage systems.</p>",
        "id": 175862883,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568676978
    },
    {
        "content": "<blockquote>\n<p>Creating yet another URL for the system </p>\n</blockquote>\n<p>That's exactly what I didn't say.</p>",
        "id": 175862919,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568677022
    },
    {
        "content": "<p>If the NamingSystem.url is the \"preferred\" URL, what happens when the preferred URL changes?  It's the <em>same</em> NamingSystem.  We don't allow that to happen for anything else that has a canonical URL.  Also, what sense does \"version\" make for a NamingSystem?</p>",
        "id": 175863799,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568677939
    },
    {
        "content": "<p>NamingSystem.url would be the url of the naming system record, not the system. And version makes sense, so that you can talk about which version of the registration you have - which is most recent</p>",
        "id": 175863844,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568678008
    },
    {
        "content": "<p>Can the NamingSystem.url be one of the NamingSystem.identifier.values?</p>",
        "id": 175864023,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568678170
    },
    {
        "content": "<p>Just as a follow-up, this section of the spec:<br>\n<a href=\"http://hl7.org/fhir/references.html#canonical\" target=\"_blank\" title=\"http://hl7.org/fhir/references.html#canonical\">http://hl7.org/fhir/references.html#canonical</a><br>\nmentions NamingSystem as something that has a \"defined url element\"</p>",
        "id": 175915748,
        "sender_full_name": "John Timm",
        "timestamp": 1568733033
    },
    {
        "content": "<blockquote>\n<p>Can the NamingSystem.url be one of the NamingSystem.identifier.values?</p>\n</blockquote>\n<p>I think it shouldn't be. It isn't the system that it identifies, it's the registration record. So it shouldn't be the same identifier</p>",
        "id": 175916062,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568733234
    },
    {
        "content": "<p>Ideally, you want the canonical URL to resolve to something - and you want it to resolve stably and reliably.  Having the url be the instance URL for the NamingSystem registry ensures that.</p>",
        "id": 175947378,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568753186
    },
    {
        "content": "<p>But that would prevent you from having several repos with distributed copies of the NamingSystem artifacts. That's why you resolve these by searching on url in a repo - and you would not be able to do so if NamingSystem did not have an url.</p>",
        "id": 175965595,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1568773135
    },
    {
        "content": "<p>\"Lloyd McKenzie 19:52   <br>\nIf the NamingSystem.url is the \"preferred\" URL, what happens when the preferred URL changes? It's the same NamingSystem.\"</p>\n<p>That's the <em>perfect</em> argument for having a canonical and NOT using the preferred URL for it.  The real key of a NamingSystem is an independent canonical, not one of the (possibly changing) uniqueIdentifiers.</p>",
        "id": 175965690,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1568773238
    },
    {
        "content": "<p>If the preferred URL of a NamingSystem is the url of the NamingSystem on the registry where it lives, you don't have to worry about it changing - because it's not subject to the organizational changes and/or website redesign of the system owner.  It's a stable FHIR-specific URL.</p>",
        "id": 175966679,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568775100
    },
    {
        "content": "<p>You can search for the NamingSystem by URL now - it would match on the URLs that are 'identifiers' for that NamingSystem</p>",
        "id": 175966723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568775145
    },
    {
        "content": "<p>No, I mean that it's almost never the url of the registry.  I would not want a namingsystem to have \"simplifier\" in its canonical for example. We are looking for a stable canonical that can remain the same across registries for the same NamingSystem, and that does not change when the list of identifiers or the preferred identifier changes, since this canonical might be used in other artifacts to refer to the NamingSystem.</p>",
        "id": 176006285,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1568814438
    },
    {
        "content": "<p>In Canada, most of our entries have \"<a href=\"http://infoway-inforoute.ca/fhir/NamingSystem\" target=\"_blank\" title=\"http://infoway-inforoute.ca/fhir/NamingSystem\">http://infoway-inforoute.ca/fhir/NamingSystem</a>\" as the root of their canonical URLs - for provincial licensing bodies, etc.  Not all (if someone has a URL and are confident it'll be consistent, we'll use that instead), but that's the default.</p>",
        "id": 176008203,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568815741
    }
]