[
    {
        "content": "<p>Hi All, Can any one suggest me , How to define our own Policy(URI)  in Consent.</p>",
        "id": 153993371,
        "sender_full_name": "Lakshmi Thrivarna",
        "timestamp": 1536141208
    },
    {
        "content": "<p>It is just a URI. The thinking we had is that an organization (hospital) would have their overall privacy policy somewhere posted on their web site. The persistant URL on that web site could be one possibility as the URI. alternatively that organization might have a document management system, where they manage their formal documents, and a URI into that might be a good URI. alternatively they might encode their policy into XACML, and thus the XACML policy set ID might be a good URI...  So, it is up to the organzation to identify what their URI is, and how they manage it. The world is wide open.</p>",
        "id": 153993460,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536156577
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  Thank you for your information</p>",
        "id": 153993465,
        "sender_full_name": "Lakshmi Thrivarna",
        "timestamp": 1536156865
    },
    {
        "content": "<p>Were you asking about .policyRule, or were you asking about policy.uri?  They are different purpose.</p>",
        "id": 153993466,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536157033
    },
    {
        "content": "<p>My response was specific to .policyRule</p>",
        "id": 153993467,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536157047
    },
    {
        "content": "<p>the .policy element, if you chose to use it, would hold the motivating regulations that caused your policy to exist. I don't think this will be common to be populated in thousands of patient specific Consent resources. I would expect that your consent policy (.policyRule) would explain ONCE in that legal text the motivating regulations for the policy. However there was interest in having the .policy element for a very focused kind of consent.</p>",
        "id": 153993469,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536157218
    },
    {
        "content": "<p>for example in the USA there is a specific regulation that covers mental-health data captured under specific treatment clinics that are federally funded. A very specific case. This regulation (42-CFR Part 2), requires a specific Consent that is independent of other Consents. So by populating the .policy element on one can see that fact. (This can also be known by having multiple .policyRule URI)</p>",
        "id": 153993470,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536157525
    }
]