[
    {
        "content": "<p>New to FHIR so please forgive my ignorance. </p>\n<p>Just going through the example workflow models, it seems that task represents a unit of work a filler system can do.  If the task to be performed was a long lived automated task with input and outputs, a ServiceDefinition/OperationDefinition seem to be better resources to describe such as task rather than ActivityDefinition which does not contain any formal description of inputs and outputs. </p>\n<p>Am I missing something?</p>",
        "id": 154006941,
        "sender_full_name": "Parnesh Raniga",
        "timestamp": 1539060131
    },
    {
        "content": "<p>Task is a mechanism of saying \"please do\".  Tasks can reference a Request resource that represents the authorization to be acted on.  If doing so, the Task might limit the amount of the authorization to act on.  E.g. Dispense 30 days worth, perform only one repetition of the ordered monthly tests, etc.</p>",
        "id": 154006942,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539062702
    },
    {
        "content": "<p>I assume it is a mechanism of saying \"please do x using inputs y to produce outputs z\". But how do you formally describe what x,y &amp; z are? We are particularly interested in the case where x is a computational workflow for example. </p>\n<p>While Task has inputs and outputs, there are no matching  definitions in ActivityDefinition.</p>",
        "id": 154006943,
        "sender_full_name": "Parnesh Raniga",
        "timestamp": 1539063503
    },
    {
        "content": "<p>They can be set using the dynamicValue capabilities of both ActivityDefinition and PlanDefinition, though I agree that adding some examples of how this works would be useful.  Can you submit a change request for that piece?  The order that you point to (if any) is in Task.focus if the Task.code is saying \"please fulfil\".  Task can also be used for things like \"please cancel\" or \"please suspend\", where the set of things allowed in Task.focus would be wider.</p>",
        "id": 154006994,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539094222
    },
    {
        "content": "<p>That should work and happy to submit change request. However that still feels clunky compared to say OperationDefinition which is also used in the CDS system. I wonder if there is room to merge some of these things together?</p>",
        "id": 154007161,
        "sender_full_name": "Parnesh Raniga",
        "timestamp": 1539122097
    },
    {
        "content": "<p>OperationDefinition is about a RESTful capability.  ActivityDefinition is about protocols and order sets.  Fairly different worlds...</p>",
        "id": 154007177,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539125494
    },
    {
        "content": "<p>Gotcha, but that is why it is a bit confusing. ServiceDefinition, which I think of as short, interactive time frame, automated task  (albeit for  a specific use case of CDS) indeed wraps an operation definition with more meta-data. However the confusion might be due to my lack of familiarity with FHIR and the differentiation of the clinical workflow from the computational one. Will do more reading ...</p>",
        "id": 154007188,
        "sender_full_name": "Parnesh Raniga",
        "timestamp": 1539128898
    },
    {
        "content": "<p>I see that this has been raised in the STU notes for workflow overview:</p>\n<p><a href=\"https://www.hl7.org/fhir/workflow.html#issues\" target=\"_blank\" title=\"https://www.hl7.org/fhir/workflow.html#issues\">https://www.hl7.org/fhir/workflow.html#issues</a></p>",
        "id": 154007196,
        "sender_full_name": "Parnesh Raniga",
        "timestamp": 1539130931
    }
]