[
    {
        "content": "<p>Hi,<br>\nwe want to define a CareTeam that is on duty for period of time (CareTeam.period) based on recurring shifts</p>\n<p>Since we don't build a full blown rostering system, in our case a shift should only have a few properties:<br>\n- name<br>\n- start (data type: time)<br>\n- end (data type: time)<br>\n- status (active, inactive as defined in code system <a href=\"http://build.fhir.org/codesystem-resource-status.html\" target=\"_blank\" title=\"http://build.fhir.org/codesystem-resource-status.html\">http://build.fhir.org/codesystem-resource-status.html</a>)<br>\n- organization (for which this shift is defined)</p>\n<p>Example: Morning shift from 8:00 am to 2:00 pm,...</p>\n<p>When it comes to create a CareTeam the start/end time would be combined with the current date and copied into CareTeam.period (e.g.  CareTeam.period.start = 2018-12-06T08:00+02:00 and so on)</p>\n<p>My question is now how to model a shift with FHIR?</p>\n<p>Existing resources like slot or schedule seem not be a fit for shifts since they always refer to an instant or a datetime.<br>\nIs there an existing resource that we've missed?<br>\nIf not what's your recommendation on how to proceed? Create a profile on Basic or even create our own custom resource?</p>",
        "id": 154023477,
        "sender_full_name": "Wolfgang Kronseder",
        "timestamp": 1544105272
    },
    {
        "content": "<p>Seems you want a structure like what is found in MedicationRequest.dispenseRequest  ?</p>",
        "id": 154023544,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544119214
    },
    {
        "content": "<p>Thanks for your answer John, but I don't see that such a structure could help here.</p>\n<p>The goal is being able to express, that a group of people is working this morning in a hospital departement with use of a CareTeam. So no connection to a patient or any workflow at this moment. The concept of a shift should just save time when creating such a CareTeam by being a template for the time period the are present in the hospital.<br>\nIf I got your Idea wrong, could you please expand on your suggestion?</p>",
        "id": 154023568,
        "sender_full_name": "Wolfgang Kronseder",
        "timestamp": 1544127702
    },
    {
        "content": "<p>I was not suggesting that you use MedicationRequest. I was refering to a pattern as comprehensive as you seem to be desiring. The point is that you could define a structure such as that as an extension on CareTeam, and recommend in a Change Request that your structure be considered for the core.</p>",
        "id": 154023579,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544129525
    },
    {
        "content": "<p>Ok, now I got your point. <br>\nHaving it as a structure within a CareTeam means, that we couldn't define shifts<br>\nas an independent object to reuse it across multiple CareTeams, right?. So I thought of having it as separate structure (as defining a shift might get more features in future like to be only active on weekends etc.). </p>\n<p>What's the best way of having it as an independent entity?<br>\nI've read about Profile on basic vs. creating a new resource. <br>\nWhile suggesting such a structure to the work groups makes certainly sense , how can I continue best in the mean time in my project?</p>",
        "id": 154023672,
        "sender_full_name": "Wolfgang Kronseder",
        "timestamp": 1544166107
    },
    {
        "content": "<p>See <a href=\"http://simplifier.net\" target=\"_blank\" title=\"http://simplifier.net\">simplifier.net</a>, there is an extension on Basic to represent the concept of shift.</p>",
        "id": 154023692,
        "sender_full_name": "René Spronk",
        "timestamp": 1544174707
    },
    {
        "content": "<p>Hi René, in fact that's my own  <span class=\"emoji emoji-1f642\" title=\"simple smile\">:simple_smile:</span>  <br>\nI 've played around with forge tried some things out.</p>\n<p>My conclusion for the process of modelling would be<br>\n1) to start with extensions and create  a profile on Basic. Start using it in my project<br>\n2) suggest my use case to the FHIR working groups and request a new resource<br>\n3) if it gets adopted in the standard to migrate to the standard representation</p>\n<p>Is that the recommended way to go?</p>",
        "id": 154023699,
        "sender_full_name": "Wolfgang Kronseder",
        "timestamp": 1544177066
    },
    {
        "content": "<p>Yes</p>",
        "id": 154023704,
        "sender_full_name": "René Spronk",
        "timestamp": 1544179537
    },
    {
        "content": "<p>By the way: I use your Shift example (extension to Basic) in our European FHIR training courses, for it is a realistic example which can be easily understood by the attendees of such courses.</p>",
        "id": 154023705,
        "sender_full_name": "René Spronk",
        "timestamp": 1544179662
    },
    {
        "content": "<p>Cool, glad that somebody else can get some use out of it.</p>\n<p>Thanks to you and John for answering to my question, it's appreciated a lot.</p>",
        "id": 154023708,
        "sender_full_name": "Wolfgang Kronseder",
        "timestamp": 1544180680
    },
    {
        "content": "<p>You could use a slot instance to represent the shift too.</p>",
        "id": 154023728,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1544189905
    },
    {
        "content": "<p>That's stretching it IMHO, and Slot has 1 ..1 reference to Schedule, and no support for \"shift name\"..</p>",
        "id": 154023732,
        "sender_full_name": "René Spronk",
        "timestamp": 1544190657
    },
    {
        "content": "<p>You name a shift?</p>",
        "id": 154023778,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1544214613
    },
    {
        "content": "<p>\"Early shift\", \"night shift\" - there's a limited number of shifts AFAIK.</p>",
        "id": 154023852,
        "sender_full_name": "René Spronk",
        "timestamp": 1544257573
    }
]