[
    {
        "content": "<p>We are working on a solution for <a href=\"https://www.cochrane.org/CD011682/AIRWAYS_self-management-interventions-including-action-plans-patients-chronic-obstructive-pulmonary-disease\">self-management plan for patients</a> - a concept for empowering patients to take actions based on their actual condition. </p>\n<p>In this concept we need to define and store individual refrence values for patients. E.g. for COPD patients, the patient should take specific actions if the saturation is below a certain threshold/reference value. The value needs to be individual to the patient, since the patient will have actual values that are way out of any standard reference ranges. </p>\n<p>We are currently struggling to find in which FHIR-resource this kind of information should be best stored. Any input on this?</p>\n<p>In an actual observation, I would imagine that this information is a natural part of the ReferenceRange. But we are here looking for a concept to store the \"individual referenceRange\" for the patient.</p>",
        "id": 214147438,
        "sender_full_name": "Ingvar Sørlien",
        "timestamp": 1603347766
    },
    {
        "content": "<p>After going through a lot of history, I came over this thread, describing similar problem to what we are facing.</p>\n<p><a href=\"#narrow/stream/179166-implementers/topic/observation.2EreferenceRange/near/197989109\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/observation.2EreferenceRange/near/197989109</a></p>",
        "id": 214178215,
        "sender_full_name": "Ingvar Sørlien",
        "timestamp": 1603369153
    },
    {
        "content": "<p>Theoretically, reference ranges are lab/performing entity soecific.  And more reasonably, they also should be patient-specific.  So that would need some kind of normalization for comparability.</p>",
        "id": 214189981,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1603374854
    },
    {
        "content": "<p>There are two things you'd want.  One would be to establish what the ranges for a given patient are - as they would presumably change over time (and could even vary by lab).  I think that would be Observation, though we could look at ObservationDefinition with a patient extension.  Then you'd want a way of designating that the ranges conveyed with an actual Observation were patient-specific.</p>",
        "id": 214244375,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603398740
    },
    {
        "content": "<p>Thank you for the input. I see I need to add a little bit to the usecase here. We are primarily not talking about lab results here, but mostly about vital signs in connection to Remote Patient Monitoring. For example oxygene saturation, heart rate and body weight. The values will change over time, but they are much more static than defined for each observation. The vitals are measured daily and evaluated if they are within normal (for the patient) range, abnormal, or critical. They are changed if needed, but they are relatively static to the patient.<br>\nSo my conclusion for now is that ObsesrvationDefinition seems conseptually suited for the purpose, even if it is not a perfect fit without extensions.</p>",
        "id": 214274071,
        "sender_full_name": "Ingvar Sørlien",
        "timestamp": 1603429388
    }
]