[
    {
        "content": "<p>Hello,</p>\n<p>I am having trouble with how to represent a deleted element in an AuditEvent.</p>\n<p>Currently, I am populating <br>\nentity.detail.type = {name of element modified}<br>\nentity.detail.value = {value it was modified to}</p>\n<p>However, both entity.detail.type and entity.detail.value are cardinality 1..1 ,<br>\nso I can't leave entity.detail.value blank to communicate a delete.</p>\n<p>Is there a better way to structure this so that deletes can be communicated?</p>\n<p>I would like to keep this info in the entity BackboneElement so that I can point to the relevant Resource, and since I'd like to specify which element was deleted, just populating action=\"Delete\" on the AuditEvent seems incorrect.</p>",
        "id": 224890036,
        "sender_full_name": "James Jahns",
        "timestamp": 1612281135
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 224900323,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612284963
    },
    {
        "content": "<p>I happen to be writing an IG on basic auditEvent profiles for REST.. i am not yet to Delete... but will get there.</p>",
        "id": 224901955,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612285535
    },
    {
        "content": "<p>The notional concept is that you just put the former resource id into the .entity.what</p>",
        "id": 224902019,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612285555
    },
    {
        "content": "<p>My problem is that it's not an entire resource that's deleted, but rather just some element/field of it. So there is still a valid Resource ID but some of its data has been removed; I'm not sure where I can best put the name of this element. (at any rate, an IG for this sounds helpful!)</p>",
        "id": 224912749,
        "sender_full_name": "James Jahns",
        "timestamp": 1612289841
    },
    {
        "content": "<p>Removing some information from a resource is just an update.</p>",
        "id": 224922819,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612293964
    },
    {
        "content": "<p>Right; does that mean I can't provide the details of this update however? Ideally I'd like to specify the element that was changed. For example, \"User X has deleted the value of Observation.note\" or similar. Using AuditEvent.entity.detail works for most updates, but not for updates that don't have a value.</p>",
        "id": 224926152,
        "sender_full_name": "James Jahns",
        "timestamp": 1612295404
    },
    {
        "content": "<p>As lloyd mentions. that is an Update. The AuditEvent (and Provenance) is there to indicate that an update happened. Where it is important for the before and after to be known, the solution recommended in FHIR core is to use a versioning FHIR service implementation. In that case the version specific id is recorded for the old resource. Thus you can always compare that version with the version that followed it. Replicating these differences within the AuditEvent or Provenance is not the intent of the model.</p>",
        "id": 224932691,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612298151
    },
    {
        "content": "<p>Okay, that makes sense; thanks for the explanation!</p>",
        "id": 224936833,
        "sender_full_name": "James Jahns",
        "timestamp": 1612300090
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"364028\">@James Jahns</span> I have taken a first crack at an IG for AuditEvents for REST. I only have Create, Read, Update, and Delete done.  I will now work no Query. I welcome comments. I do have some open questions to myself, so adding others questions would be good.<br>\n<a href=\"http://build.fhir.org/ig/JohnMoehrke/BasicAudit/branches/main/index.html\">http://build.fhir.org/ig/JohnMoehrke/BasicAudit/branches/main/index.html</a></p>\n<p>This is not a formal project, I wanted to exercise the concept before proposing it as formal. It is based on the intention noted on the AuditEvent core page, but it does deviate a bit.</p>",
        "id": 224939697,
        "sender_full_name": "John Moehrke",
        "timestamp": 1612301491
    }
]