[
    {
        "content": "<p>Hi all, if I retrieve the list of medications for a particular patient to plot a medication graph, I get only the latest list but not the previous medications which were discontinued  by the patient. How can I get the list of all medications i.e., the previous discontinued medications and current medications? Thank you</p>",
        "id": 153926632,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1513839446
    },
    {
        "content": "<p>What's the query you're using to retrieve medications now?</p>",
        "id": 153926635,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513839709
    },
    {
        "content": "<p>The current behaviour you describe and the desired behaviour are both depending on the way you query for data. How are you getting the \"latest list\"?</p>",
        "id": 153926636,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1513839743
    },
    {
        "content": "<p>Which one  of the following approach shall I opt to retrieve the list of all the medications  (both current and previous medications)<br>\n1. using the list resource (with help of version history) <br>\n2.  using  the list of MedicationStatements</p>",
        "id": 153926787,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1513921011
    },
    {
        "content": "<p>It depends. Some lists will only show current meds.  Other lists might provide medication history as well.  In either case, they'll be curated to filter out duplicates - either by a human or some sort of algorithm.  Querying MedicationStatement directly will give you everything, but will also give you duplicate and potentially obsolete records</p>",
        "id": 153926830,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513962044
    },
    {
        "content": "<p>As well, not all servers will necessarily expose List views of medications</p>",
        "id": 153926831,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513962066
    }
]