[
    {
        "content": "<p>Why doesn't FHIR specify the If-Match Header for Delete analogously to Update and Patch? (It's missing from <a href=\"http://hl7.org/fhir/r4/http.html#summary\" target=\"_blank\" title=\"http://hl7.org/fhir/r4/http.html#summary\">http://hl7.org/fhir/r4/http.html#summary</a>). A possible use case is undoing a delete action. If the resource was modified in the meanwhile, recreating it would create an old version.</p>",
        "id": 189801840,
        "sender_full_name": "Johannes Höhn",
        "timestamp": 1583421612
    },
    {
        "content": "<p>So \"only delete this if it hasn't changed since I last looked\"?  That's probably less relevant than updates - typically if you want something gone, you want it gone regardless of whether it's been changed.  However, I can see situations where you'd want to force someone to look at the most recent version before confirming a delete.  Can you submit a change request?</p>",
        "id": 189811911,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583427159
    },
    {
        "content": "<p>Is there anywhere documented how to create a change request? Do I need to file an issue on the Jira tracker?</p>",
        "id": 189867471,
        "sender_full_name": "Johannes Höhn",
        "timestamp": 1583478134
    },
    {
        "content": "<p>That's right; there's a \"propose a change\" link in the footer of every specification page that takes you to Jira.</p>",
        "id": 189891070,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583500556
    },
    {
        "content": "<p>Regarding this particular feature request, I think it makes perfect sense and is worth submitting.</p>",
        "id": 189891117,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583500568
    },
    {
        "content": "<p>As far as the process goes, there is detailed guidance at <a href=\"https://confluence.hl7.org/display/HL7/Specification+Feedback\" target=\"_blank\" title=\"https://confluence.hl7.org/display/HL7/Specification+Feedback\">https://confluence.hl7.org/display/HL7/Specification+Feedback</a> (but honestly probably too detailed; it would be good to get feedback on this).</p>",
        "id": 189891283,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583500718
    }
]