[
    {
        "content": "<p>Have any other implementers defined security or privacy tags for either Patient or Coverage to denote that a dependent is either over- or under-the-age-of-majority (also known as the age of consent)?  These age limits vary by state of residence and occasionally by contract situs. When a dependent is underage, the Cardholder automatically has access to that dependent. But upon reaching the Age of Majority, that automatic access is shut off and the dependent must supply their own consent to let others have access to their data. We are looking for ideas on how to denote the current over-age or under-age designation of a patient.  I don't see anything obvious in the <a href=\"http://meta.security\">meta.security</a> codes for this. That's where are thinking we could add this (always with the patient). Curious if other entities have addressed this? Thanks for any feedback!</p>",
        "id": 268470553,
        "sender_full_name": "Kate Dech",
        "timestamp": 1642547939
    },
    {
        "content": "<p>This is something you typically <em>wouldn't</em> want to put in <a href=\"http://meta.security\">meta.security</a> because it's not a \"static\" statement.  They might be under age today and hit majority tomorrow - and you can't reasonably update every record about the patient everywhere they're stored when the date ticks across to midnight.  So to enforce rules like this, you'd generally retrieve the Patient record associated with whatever other records you're interested and check the date-of-birth (and addresses) of the patient to determine what set of rules applies.</p>",
        "id": 268494289,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642570481
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>.  What we would prefer (as the payer/implementer-serving-the-resources) is to be the authority of what is or isn't over or under-age, because of the variability of rules (rather than having the clients have to determine this themselves).  The other thing that we are looking into is  an additional relationship code within coverage.  We understand that the value is point-in-time...at the time we surface up the coverage/patient, they are underage.</p>",
        "id": 268546330,
        "sender_full_name": "Kate Dech",
        "timestamp": 1642602291
    },
    {
        "content": "<p>You can be the authority when you're providing data, but you can't (or shouldn't) set a permanent flag on the record based on its state today that downstream systems would have to comply with when the assertion you're making is a temporally dependent one.</p>",
        "id": 268638517,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642651270
    }
]