[
    {
        "content": "<p>I'll ask here, let me know if there is a better stream.<br>\nI know that implementation guides are prevented from relaxing restrictions of the parent definition.<br>\nie. FHIR R4 says... 1..4, CARIN is NOT allowed to change to 0..4 But CARIN can say 2..4 Understood.</p>\n<p>But can CARIN relax other constraints defined in the profile that are not part of the resource itself?<br>\nFor instance US Core says you must support Patient?name=xxx search param BUT CARIN says, \"Patient, Practitioner, and Organization are US Core Profiles. Since these are supporting / reference profiles (rather than a focus profile) in CARIN IG for Blue Button®, the alignment with the US Core is on the content of these profiles, but not on the search parameters.\"</p>\n<p>It seems odd that CARIN would be allowed to relax profile constraints like search parameters but not relax profile constraints regarding the resource.</p>",
        "id": 227806261,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1614274647
    },
    {
        "content": "<p>There's an issue with how US Core publishes their search parameter expectations.  Search and profiles have nothing to do with each other.  Profiles are data constraints.  Search expectations are actually part of the CapabilityStatement.  So you're free to use US Core profiles and completely ignore the US Core capability statements (presuming you're not required to comply with those statements under regulation).</p>",
        "id": 227808289,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614275389
    },
    {
        "content": "<p>I don't see this as an issue with US Core - the IG involves a use case, actors , fhir structures, and  interactions.  If you claim conformance to US Core IG you conform to both the structures and the search. This is different than conforming to an individual US Core artifact which is also OK.  We will be making this clarification in the specification.</p>",
        "id": 227850006,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614291953
    },
    {
        "content": "<p>You can inherit from US Core profiles without inheriting from US Core CapabilityStatements.  If you do that, you <em>do not</em> inherit any of US Core's rules on search.  Profiles cannot define any expectations around search, only around static data element support.</p>",
        "id": 227856723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614295444
    },
    {
        "content": "<p>I agree and will make that clearer in the Quick starts</p>",
        "id": 227863697,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614299701
    },
    {
        "content": "<p>Is there a way to inherit from CapabilityStatements?</p>",
        "id": 227863800,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1614299767
    },
    {
        "content": "<p>CapabilityStatement.instantiates or CapabilityStatement.imports</p>",
        "id": 227873803,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614307249
    },
    {
        "content": "<p>Imports will grab whatever the referenced CapabilityStatement says.  import says that all the things you've already declared or imported cover off the mandatory requirements of whatever you instantiate.  (So only 'imports' really does  inheritance.)</p>",
        "id": 227884666,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614317373
    }
]