[
    {
        "content": "<p>Hi All, </p>\n<p>We're trying to derive Observation from QuestionnaireResponse. </p>\n<p>We're currently thinking of assigning the Observation.effective with the QuestionnaireResponse.authored date. I'd like to know if that's clinically sound or if you guys have any better suggestions? The effective date is technically optional in FHIR Observation (so is the authored date in QuestionnaireResponse) but how important is that date for an Observation?</p>",
        "id": 153913182,
        "sender_full_name": "Kevin Varela",
        "timestamp": 1507582667
    },
    {
        "content": "<p>That really depends on the nature of the Observation code.  Observation.effective is \"when the code was held to be true\".  So if the question was \"how many meds were you on last year\" and the Observation.code was \"number of concurrent medications\", then the effectiveTime should be last year.  On the other hand, if the Observation.code was \"number of concurrent medications, prior year\", then the effective time would be when the questionnaire was filled out.</p>",
        "id": 153913217,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507607089
    },
    {
        "content": "<p>Thanks, I guess this is just reinforcing the fact that we can't just simply use the Authored date of the QuestionnaireResponse as the effective date of the Observation derived from it.</p>",
        "id": 153913368,
        "sender_full_name": "Kevin Varela",
        "timestamp": 1507662517
    },
    {
        "content": "<p>You can sometimes - but it's dependent on how closely tied the Question is to the Observation.code.  It's certainly not something you can do blindly.</p>",
        "id": 153913370,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507666887
    },
    {
        "content": "<p>That's true. In our use case though, we're planning on plainly assigning the authored date of the QuestionnaireResponse as the effective date, for all the Questions, because of limited time and scope. As you've said, that we can't just use this for all questions, as it would depend as well on the Observation code. But we are trying to reach a proper solution for it.</p>",
        "id": 153913372,
        "sender_full_name": "Kevin Varela",
        "timestamp": 1507667165
    },
    {
        "content": "<p>If you can't determine the effectiveTime, you may have no choice but to omit it.  That will somewhat lessen the value of the data expressed in Observations, but that may be the only safe thing you can do if you don't have time to review the Questionnaire questions and figure out what makes sense.</p>",
        "id": 153913374,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507667554
    },
    {
        "content": "<p>That said, in order to know that the answers should be exposed as Observation values in the first place - and to know what Observation.code values apply, you're going to have to do a reasonable amount of question-specific mapping and analysis anyhow - perhaps you can incorporate the effectiveTime determination into that?</p>",
        "id": 153913376,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507667625
    }
]