[
    {
        "content": "<p>Some medicinal products have the descriptions in multiple languages (e.g. in Belgium).</p>\n<p>Where a resource already has a 0..1 description as a plain string, how would this best be handled?</p>\n<p>I am considering an extension that adds a new backbone element with a string plus a code (for the language of the string). </p>\n<p>Then using that for the “extra” languages, which are different from resource.language.</p>\n<p>But this does creates an asymmetry between the “first” language and the others. This is not elegant for software and not good politically either.</p>\n<p>Other ideas: <br>\nHave the backbone extension, but put all the languages in there, don’t use the original description.<br>\nExtend string to allow a language code and use that in a non-backbone extension. <br>\nUse xml:lang somehow (only applies to xhtml though?)</p>\n<p>We don't want to repeat the entire resource in a different language. Also, this is not about html for the resource, but discrete data items.<br>\nDescriptions in multiple languages</p>",
        "id": 169571502,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1562164418
    },
    {
        "content": "<p>There's a translation extension already defined that can be used for any string</p>",
        "id": 169590897,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562178604
    },
    {
        "content": "<p>perfect. thanks</p>",
        "id": 169598375,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1562184579
    },
    {
        "content": "<p>I am also looking at the political sensitivity of putting any one of the 3 languages first  while the rest are translations. <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> what would be be your approach there?</p>",
        "id": 169685233,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562303071
    },
    {
        "content": "<p>Any way we can ensure all languages are treated equally?</p>",
        "id": 169685242,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562303106
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Is this a worthy concern in Canada? And in Switzerland <span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span> ?</p>",
        "id": 169685304,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562303238
    },
    {
        "content": "<p>(for code values, which is a technical thing, I just put English as a lingua franca, the rest are equal translations for display. But for descriptions, etc.. English may not work)</p>",
        "id": 169685361,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562303341
    },
    {
        "content": "<p>Use Klingon as the first language? ;-)</p>",
        "id": 169695811,
        "sender_full_name": "René Spronk",
        "timestamp": 1562318689
    },
    {
        "content": "<p>there's no way to treat all languages equally syntactically - one is the base language of the resource. But if you specify a base language, then they are all semantically equal</p>",
        "id": 169696672,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562319760
    },
    {
        "content": "<p>As a former snomed person....... why not just use coded values? Then the terminology is responsible for the translations....</p>",
        "id": 169697750,
        "sender_full_name": "Adam Flinton",
        "timestamp": 1562320973
    },
    {
        "content": "<p>actually, I think we're mainly talking about coded values in CodeSystems here, though there are a few others places that the belgians are interested in that don't work like that</p>",
        "id": 169698950,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1562322387
    },
    {
        "content": "<p>The first language is the one you started with.  If someone authors in French, then that's the root and the translation would be English.  If someone authors in English, then the translation would be French.  Authors are free to pick which language they author in.  And source-of-truth is always what the author wrote.  Even with ISO or the UN, the text is always written in one language first, though I think sometimes there's iteration as translation uncovers nuances in the original language that are unclear.</p>",
        "id": 169711658,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562335939
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> in switzerland if you register a medicinal product you have to choose one of the official languages and you can provide the other languages, so for this case the fhir model fits well.</p>",
        "id": 169733290,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1562357608
    },
    {
        "content": "<p>Thanks . Code value definitions are multilanguage. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> you mention authoring as part of the clinical data entry?</p>",
        "id": 169734501,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562358961
    },
    {
        "content": "<p>Not following the question <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> ?</p>",
        "id": 169734556,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562359012
    },
    {
        "content": "<p>\"authors\" : authors of a profile/codeset? or authors of an observation?</p>",
        "id": 169734584,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562359066
    },
    {
        "content": "<p>in other words, are you saying that what matters is the resource.language, and a patient can have a prescription in french and a dispense in dutch, and anything other than the original language is translations?</p>",
        "id": 169734779,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562359309
    },
    {
        "content": "<p>(when you mention ISO and UN authors,  i was thinking about authors of profiles / definitions. That is not what i am looking at. I am looking  at the people that author the different content in a clinical scenario)</p>",
        "id": 169734931,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562359446
    },
    {
        "content": "<p>In principle, translations could appear on anything.  In practice, the only thing I expect will be formally translated in Canada are code designations and (occasionally) profiles.  If a translation is needed of a clinical record, clinicians would make use of a service that has access to the record, though I expect Google will be used occasionally as well.</p>",
        "id": 169735071,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562359656
    },
    {
        "content": "<p>ok so language on \"clinical\" resources is to-be-left-as-is: language can be decided by the hospital, or even according to the practitioner's language. thanks.</p>",
        "id": 169735313,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562359932
    },
    {
        "content": "<p>Correct.  The language of clinical artifacts is whatever the clinician or administrative person chooses to write them as.  In places where the staff is bilingual, there may be policy that dictates a preferred language for consistently.  But if the author only speaks one language, that's what they're going to write in...</p>",
        "id": 169735340,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562360001
    },
    {
        "content": "<p>ok. Just for context, my edge case was Brussels which is officially a bilingual city, and everything is in 2 languages. It makes sense that we don't need to do anything there then - content is in the language in which data was entered.</p>",
        "id": 169735824,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562360717
    }
]