[
    {
        "content": "<p>Hi all, my question is if in FHIR terminology service we are able to search specific designation and retrieve corresponding code and codeSystem for it. Apparently, lookup operation for codeSystem doesn't support this. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  suggested to initiate this discussion here.</p>\n<p>More elaboration: one may extend designation lookup for enabling fuzzy search since it's string search but let's consider a simple case and matching with exact existing designation. Also we may need to filter it based on different parameters like designation.use for getting only synonyms.</p>",
        "id": 153894129,
        "sender_full_name": "Hamid R. Laleh",
        "timestamp": 1497604627
    },
    {
        "content": "<p>we don't really offer lookup directly on code systems at all. should we? </p>",
        "id": 153894209,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497619931
    },
    {
        "content": "<p>and we don't make any rules about searching on designations. I do in LOINC and SNOMED but not on normal code systems...</p>",
        "id": 153894210,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497619963
    },
    {
        "content": "<p>It would be great to have it. This was a requirement that we got for terminology service. <br>\nThe question is do we need to extend current lookup operation for codeSystem as a solution? </p>\n<p>About rules for searching on designations, in NCBI (and maybe more ontologies) we also see different designation.use like: Symbol, synonyms and ... which this was also a requirement to be able to provide this lookup functionality with filtering on diffrent designation properties. In general for representation aspect we need to be able to filter designation. One can pass all designations as a respond and let the consumer filter it but I don't think this can be a good solution. </p>",
        "id": 153894221,
        "sender_full_name": "Hamid R. Laleh",
        "timestamp": 1497622300
    },
    {
        "content": "<p>As an example, I found shrimp from ontoserver(<a href=\"http://ontoserver.csiro.au/shrimp/\" target=\"_blank\" title=\"http://ontoserver.csiro.au/shrimp/\">http://ontoserver.csiro.au/shrimp/</a>) which has this lookup functionality(search terms) only for SNOMED and LOINC and I think they are using FHIR in general but I'm not sure if they used FHIR also in SHRIMP. My impression is apps like Ontology browsers/Editors will need more functionalities to use FHIR.</p>",
        "id": 153894225,
        "sender_full_name": "Hamid R. Laleh",
        "timestamp": 1497623978
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> is the lead for Shrimp</p>",
        "id": 153894255,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497646743
    },
    {
        "content": "<p>Sorry <span class=\"user-mention\" data-user-id=\"193992\">@Hamid R. Laleh</span> , a little late to this one...Shrimp uses only FHIR APIs and is able to browse any CodeSystem that is available in the particular FHIR server it is talking to (by default this is an instance of Ontoserver, but you can enter your own endpoint if you want).<br>\nThe search uses <code>$expand</code> with the text passed as the <code>filter</code>parameter.  If you select a ValueSet, that is expanded, but if not, then the default \"all values\" ValueSet specified in the CodeSystem Resource is used.<br>\nIn Ontoserver we match against all designations in the CodeSystem with, essentially, a word-prefix any order strategy.  We then do a custom scoring to rank the matches.</p>",
        "id": 153896274,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1499386551
    }
]