[
    {
        "content": "<p>If I'm doing some sort of CDS operation and the input code is wrong or out of date -to me  that is a technical error but I think would still be reported using <em>DetectedIssue</em>.  The <a href=\"http://hl7.org/fhir/STU3/detectedissue.html#bnr\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/detectedissue.html#bnr\">DetectedIssues Boundaries</a> suggest is limited to clinical issues and to use <em>OperationOutcome</em> instead.  I think that some more clarity is the documentation needed here.   I had assumed  that  OO is constrained to a direct response to an interaction and not some other issue discovered downstream in the workflow.  ( for example I successfully post a resource ...yay...  and it is discovered later that it is using a deprecated code..drat!... )</p>",
        "id": 153922682,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512237289
    },
    {
        "content": "<p>DetectedIssue is something that's part of the patient's clinical record.  I wouldn't expect the fact you'd used an obsolete code to be captured in the patient record.</p>",
        "id": 153922683,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512239298
    },
    {
        "content": "<p>My use case is public health case reporting it and the determination of reportability and using trigger codes.   So (thinking out loud) I think that in a restful approach it would be OO to the post.   Reversing my earlier position.  thanks Lloyd</p>",
        "id": 153922705,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512317167
    },
    {
        "content": "<p>So if I have a <em>Communication</em> that I am sharing with clinical partners and I want to say \"hey... the Sender sent this and it failed and here is why\"  I would have a status of 'aborted'  and a .statusReason extension ( assuming R3) which could reference the OO resource.  (There are lots of overlap with <em>AuditEvent</em> here but is being used in a clinical context)</p>",
        "id": 153922706,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512319965
    }
]