[
    {
        "content": "<p>I work for GP Connect which is an API to provide access to data in GP systems in England. We are considering the use of the detectedIssue resource in the context of the MedicationRequest resource and I want to check that I have the correct understanding of how it should be used.</p>\n<p>We are looking to use detectedIssue/date and detectedIssue/detail to record the date and reason a medication in the GP system was discontinued. An example scenario when this would be recorded in the GP system is if a clinician has issued a repeat mediction to a patient they have had on issue dispesed but when they have taken the medication have had a reaction to it. The GP would then stop the medication so no further authorisations were dispensed and record a date and a reason why the medication was stopped.</p>\n<p>They may also record an allergy but this would be represented separately and if exported would be in an allergyIntolerance resource.</p>\n<p>Is this use case the correct use of the detectedIssue resource?</p>",
        "id": 153940632,
        "sender_full_name": "Pete Salisbury",
        "timestamp": 1519665189
    },
    {
        "content": "<p>The DetectedIssue is typically used to represent some sort of manifested contraindication/issue.  You can note that you managed the contraindication by discontinuing one of the involved meds/procedures/whatever.  However actually stopping the medication (and why) would be handled by changing the MedicationRequest.status to \"stopped\" and specifying a status reason.</p>",
        "id": 153940639,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519666039
    },
    {
        "content": "<p>Thanks for the speedy reply.</p>\n<p>In the above we would change the status to stopped as you suggested but are looking for somewhere to put the date it was stopped and the reason. I thought that the detectedIssue may be a good place. If it's not should we just use the note and an end date in dispenseRequest/validityPeriod? If not would we need to extend?</p>",
        "id": 153940640,
        "sender_full_name": "Pete Salisbury",
        "timestamp": 1519666446
    },
    {
        "content": "<p>You have MedicationRequest.statusReason.  For the date of the change (and who made it), you'd need to look at MedicationRequest.eventHistory.  It's not wrong to capture the information in DetectedIssue, it's just that querying DetectedIssue isn't the first place people would expect to find that information.  And the MedicationRequest does have standard ways of capturing it.</p>",
        "id": 153940643,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519666919
    },
    {
        "content": "<p>We're going to be using STU3 so the statusReason doesn't exist in the version that we are looking to get people to develop against. I suppose that we could add it as an extension but all of the systems suppliers we are dealing with only capture the reason for stopping the medication as a string of text so we wouldn't be able to easily convert it to any type of code.</p>",
        "id": 153940655,
        "sender_full_name": "Pete Salisbury",
        "timestamp": 1519671213
    },
    {
        "content": "<p>that's why it's a CodeableConcept - you can use just .text</p>",
        "id": 153940671,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519675160
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"193998\">@Pete Salisbury</span> so in a workflow process would the following be appropriate:</p>\n<p>GP creates an order for a medicatoin: MedicationRequest.status = active; MedicationRequest.intent = order; authoredOn = date GP creates the order</p>\n<p>THEN</p>\n<p>GP STOPS the order (new FHIR instance): MedicationRequest.status = stopped; MedicationRequest.intent = order; authoredOn = date GP stops order</p>\n<p>My point being, for workflow between primary care and an electronic prescription service in the community, and audit purposes, we need two instances, with status and intent values helping to distinguish the context of the authoredOn date.</p>",
        "id": 153941458,
        "sender_full_name": "Amir Mehrkar",
        "timestamp": 1519907566
    },
    {
        "content": "<p>MedicationRequest.authoredOn would not change when the order was stopped.  Information about when it was stopped ans by whom would be in MedicationRequest.eventHistory.</p>",
        "id": 153941469,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519914646
    },
    {
        "content": "<p>The eventHistory would convey all relevent status and other events throughout the order's history.</p>",
        "id": 153941470,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519914692
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> so would this be different then, as in the INTEROPen UK FHIR profiling work we have said:</p>\n<p>GP creates a plan for the medication: MedicationRequest.status = active; MedicationRequest.intent = plan; authoredOn = Date GP creates the plan</p>\n<p>THEN</p>\n<p>GP creates an order for that medication (new instance): MedicationRequest.status = active; MedicationRequest.intent = order; authoredOn = Date GP creates the order</p>\n<p>Here a \"active - plan\" goes to an \"active - order\" and the authoredOn date changes. </p>\n<p>Is MedicationRequest.eventHistory involved here too or different this time?</p>\n<p>And in the previous example, of \"active - order\" to \"stopped - order\", is it wrong to use the authoredOn date to distinguish (instead of eventHistory)</p>",
        "id": 153941556,
        "sender_full_name": "Amir Mehrkar",
        "timestamp": 1519929306
    },
    {
        "content": "<p>That use would be fine as you have two different MedicationRequests - one a plan and one an order</p>",
        "id": 153941557,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519929817
    },
    {
        "content": "<p>You don't transition plan to order, you create a new instance</p>",
        "id": 153941558,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519929834
    },
    {
        "content": "<p>MedicationRequest.intent is immutable</p>",
        "id": 153941559,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519929848
    },
    {
        "content": "<p>What is it (in the spec) that makes the intent immutable?</p>",
        "id": 153941656,
        "sender_full_name": "David Hay",
        "timestamp": 1519944323
    },
    {
        "content": "<p>Apparently nothing.  Added <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15686\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15686\">GF#15686</a></p>",
        "id": 153941666,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519946442
    },
    {
        "content": "<p>Im scratching my head and confused still - sorry if im being stupid <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> <span class=\"user-mention\" data-user-id=\"193998\">@Pete Salisbury</span> because I dont see how the two use cases Ive mentioned are different as workflow concepts, yet the answers seem different. </p>\n<p>1a GP adds a drug to the system (ready to be ordered) MedicationRequest.intent = plan .status = active<br>\n1b GP now orders the drug (ie authorises / orders the prescription) MedicationRequest.intent = order .status = active</p>\n<p>The authoredOn date distinguishes event 1a and 1b</p>\n<p>2a GP orders a drug (this message is sent) MedicationRequest.intent = order .status = active<br>\n2b. GP decides to stop that drug (this message is sent) MedicationRequest.intent = order . status = stopped</p>\n<p>Why is it wrong for there to be two fhir instances here, with the authoredOn date also distinguishes event 2a and 2b.</p>\n<p>(also, suppose we choose NOT to use eventHistory)</p>",
        "id": 153942576,
        "sender_full_name": "Amir Mehrkar",
        "timestamp": 1520324765
    },
    {
        "content": "<p>1a and 1b represent different things.  The first says \"I plan for the patient to be on Med X for 6 months\".  The second says \"I have ordered the patient to be on Med X for 3 months\".  The first statement remains effective and in force when the second is created.</p>\n<p>However, if you stop the medication, you want to terminate the statement that's in force.  In fact, you probably want to terminate both statements and indicate that both the plan and the order have been revised.</p>",
        "id": 153942604,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1520350527
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thanks for your replies. Let me check my understanding: </p>\n<p>MedicationRequest.intent eg plan or order, that has status changes must have the status changes managed by the eventHistory element? Is that correct? Thus when an “intent” is created, the authoredOn date never changes, but the intent’s status changes are logged in EventHistory?</p>\n<p>If that is correct, assume this is a well understood rule for the use of this resource? </p>\n<p>We hadn’t anticipated to use eventHistory to track changes in the Request’s status. And given eventHistory’s  0..* cardinality this would capture all such status changes over time? <span class=\"user-mention\" data-user-id=\"193998\">@Pete Salisbury</span> <span class=\"user-mention\" data-user-id=\"192158\">@Dave Barnet</span> FYI</p>",
        "id": 153951638,
        "sender_full_name": "Amir Mehrkar",
        "timestamp": 1523367202
    },
    {
        "content": "<p>\"Well-understood\" is hard to evaluate when writing a spec.  It's certainly the intention.  If it's not clear, feel free to submit change requests and we can try to improve the language.  Not all systems will capture eventHistory.  So it's possible you'll have a medication that's on-hold with no indication of who placed it there or why or when - or perhaps only see that as non-computable inofrmation in the comments or narrative.  But if systems <em>do</em> support that information computably, then eventHistory would be where that information would be expected.</p>",
        "id": 153951642,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523367829
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - we may need to review our INTEROPen UK FHIR profiles localisations (named CareConnect) for MedicationRequest given this intended use of the resource and eventHistory. It’s not something we had taken into account during our “curation” calls ie when we profile the resource as a General Parent UK FHIR profile. </p>\n<p>There was a proposal to create an extension “DateStopped” - it would seem this might be a “quick fix” and whilst not a breaking chain, seems against intended usage.... would<br>\nyou advise against this?</p>\n<p><span class=\"user-mention\" data-user-id=\"193998\">@Pete Salisbury</span> <span class=\"user-mention\" data-user-id=\"192158\">@Dave Barnet</span> <span class=\"user-mention\" data-user-id=\"192396\">@Jennifer Ellison</span>  in the use case for GPConnect, when “plans” or “orders” change from status “active” to “stopped”, we need to look at this element to be conformant with FHIR usage. What is your advice?</p>",
        "id": 153951675,
        "sender_full_name": "Amir Mehrkar",
        "timestamp": 1523382659
    },
    {
        "content": "<p>If you're going to go with an extension, I might go with \"statusDate\" as that would also let you communicate held date if you don't want to capture the full status history.</p>",
        "id": 153951678,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523386229
    },
    {
        "content": "<p>But it would certainly be better to use eventHistory - even if you only capture the most recent \"history\" event.</p>",
        "id": 153951679,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523386258
    }
]