[
    {
        "content": "<p>What is the difference between the <a href=\"http://hl7.org/fhir/ValueSet/device-kind\">FHIR Device kind</a> and <a href=\"http://hl7.org/fhir/ValueSet/device-type\">FHIR Device type</a> vocabularies? As far as I can tell, they are identical.</p>",
        "id": 239970342,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1621795445
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span> <span class=\"user-mention\" data-user-id=\"192181\">@John Rhoads</span> <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span></p>",
        "id": 239972685,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621797977
    },
    {
        "content": "<p>Yes, Todd and the Devices on FHIR folks should be able to answer this.  I believe it has a tie-in with the ISO/IEEE 11601 MIB device hierarchy.   It also has a \"heritage\" from the IHE PCD-01 profile work.</p>",
        "id": 239972965,
        "sender_full_name": "John Silva",
        "timestamp": 1621798318
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298707\">@John Silva</span>  ... I've added this topic to the HL7 DEV WG agenda for Q2 Wed (tomorrow) ... I think <span class=\"user-mention\" data-user-id=\"192181\">@John Rhoads</span>  answered too but we will sync up as a group tomorrow.  Stay tuned ...</p>",
        "id": 240190830,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1621950978
    },
    {
        "content": "<p>This is an area of conspicuous unclarity in the specification (and mea culpa, I haven't taken opportunities to speak out about this in Healthcare Products O&amp;O meetings). @Elliot Silver (@Lloyd McKenzie, many thanks for drawing attention to this question!) you are right that Device.type and DeviceDefinition.kind refer to the same set of SNOMED concepts. But note that this is only an example binding. The use cases of Device and DeviceDefinition are quite different. In the HL7 Devices Work Group, the focus is on devices that communicate with other healthcare IT systems and our IGs are built around reporting and managing specific observations and other data coming from and going to point-of-care regulated devices (and also personal health devices). We tend to use the IEEE 11073 Medical Devices Communications 11073-10201 Domain Information Model standard and, especially in the Devices.type field, the 11073-10101 Nomenclature standard, which is, unlike SNOMED CT, pretty exclusively about the nitty-gritty of actual communicating devices. DeviceDefinition.kind encompasses a lot more use cases, particularly in the supply chain realm, including a lot of kinds of devices that don't communicate. This kind of distinction needs to be brought into the FHIR field definitions to give readers some useful help in understanding what is going on!</p>",
        "id": 240333197,
        "sender_full_name": "John Rhoads",
        "timestamp": 1622039366
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 240333343,
        "sender_full_name": "John Rhoads",
        "timestamp": 1622039419
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192181\">John Rhoads</span> <a href=\"#narrow/stream/179166-implementers/topic/Device.20type.20vs.20kind/near/240333197\">said</a>:</p>\n<blockquote>\n<p>... Device.type and DeviceDefinition.kind refer to the same set of SNOMED concepts. But note that this is only an example binding. The use cases of Device and DeviceDefinition are quite different... We tend to use the IEEE 11073 Medical Devices Communications 11073-10201 Domain Information Model standard and, especially in the Devices.type field, the 11073-10101 Nomenclature standard...</p>\n</blockquote>\n<p>I understand that they're only example bindings, but it seems that if the use cases are quite different, then the example binding (as well as the definition) should be different. I'd say this is especially true if you have existing nomenclature that you could point to for your example.</p>",
        "id": 240339855,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1622041768
    },
    {
        "content": "<p>FWIW - We have this as one of the topics queued up for the start of the HL7 DEV meetings Q2 this Friday (0700 U.S. Eastern start) <br>\n<span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  great if you or others in this topic can participate - we will also have some representatives in the OO session Thursday Q1 ... that I believe includes this topic</p>",
        "id": 240360517,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1622050011
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span> , unfortunately I'm not atttending the WGM, so I can't join you. Thanks for looking at it though.</p>",
        "id": 240368789,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1622053616
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  FWIW - This morning on the HL7 DEV Friday Q2 session, we took an action item to open a JIRA issue on this topic and propose updates to these two value set descriptions (at the top of this thread) to provide a clearer and more complete (aligned with our reality!) picture for those trying to noodle down the details ... thanks for bringing this up!</p>",
        "id": 240606246,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1622209735
    }
]