[
    {
        "content": "<p>I was somewhat disappointed when I saw that the Device.type codes are not FHIR defined codes but SNOMED codes. It appears one needs a license to use them but I am not sure (the use seems pretty limited in this case). With the new Device resource and the new Device.specializations element, I thought it would be good to have the Device.type indicate a generic type. Ideally there would be a code for  PHD (Personal Health Device). However, the codes turned out to be SNOMED codes and even through there is a 6365300 code for 'Medical Device' I am hesitant to use it as it requires licensing and probably $$$. Does the use of that code actually require a financial commitment and/or license?</p>",
        "id": 153993540,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1536173658
    },
    {
        "content": "<p>That's just an example binding - you're free to use any codes you like.  An example binding just says \"these are the kind of concepts that might be used here\" but is in no way advocating for the use of those particular codes.  We have a strict policy that says that the FHIR core specification will never have a required or extensible binding to a non-free code system and we're generally pretty cautious about even calling one \"preferred\".</p>",
        "id": 153993541,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536173824
    },
    {
        "content": "<p>If you <em>do</em> decide to use SNOMED, then you'll need a license if you're not implementing in a jurisdiction that already pays for a country-wide license.  (The US, UK, Canada, Netherlands and quite a few other countries have such a license, so you'll see stricter bindings to SNOMED CT in the profiles specific to those countries.)</p>",
        "id": 153993542,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536173918
    },
    {
        "content": "<p>Thank you Lloyd. Given the international scope of this IG I think it better NOT to use it. I will see if I can find some generic option in the MDC codes (I don't think so). If not I simply wont include a type. The Device.specializations cover the bases!</p>",
        "id": 153993543,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1536174041
    },
    {
        "content": "<p>Something like UPC/EAN codes might work</p>",
        "id": 153993544,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536174141
    },
    {
        "content": "<p>Would the Rosetta Terminology Mapping (RTM) codes help here?   Aren't those the codes used by the IHE Devices folks?<br>\n<a href=\"https://wiki.ihe.net/index.php/PCD_Profile_Rosetta_Terminology_Mapping_Overview\" target=\"_blank\" title=\"https://wiki.ihe.net/index.php/PCD_Profile_Rosetta_Terminology_Mapping_Overview\">https://wiki.ihe.net/index.php/PCD_Profile_Rosetta_Terminology_Mapping_Overview</a></p>",
        "id": 153993551,
        "sender_full_name": "John Silva",
        "timestamp": 1536174813
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span>  I use those codes in the Device.specializations element. I'm looking for something that gives a generic description of the device (Personal Health Device would be ideal) and the Device.specializations give the specifics (blood pressure cuff, glucose monitor, weight scale, etc.) The MDC codes are perfect for the latter. In fact, the specializations element was put in there to support that.</p>",
        "id": 153993552,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1536174977
    }
]