[
    {
        "content": "<p>Is the DeviceUseStatement at a maturity where it can be used in profiles? We want to capture devices used by patients at the time of the observation and/or assessment. This seems like a good fit, just wondering if it is ready for use.</p>",
        "id": 194934644,
        "sender_full_name": "Sean Mahoney",
        "timestamp": 1587564011
    },
    {
        "content": "<ol>\n<li>I don't think anyone has challenged the concept for DeviceUseStatement (using or not a device is not a very complex concept), so I personally don't expect any major redesign there - even if we would (just for sake of example) change the name, the resource still makes sense.</li>\n</ol>",
        "id": 194937113,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587564967
    },
    {
        "content": "<ol start=\"2\">\n<li>Looking at Jira, I'd guess the structure of the device is not likely to change in the near future (there are a few issues that will result in some changes for R5 but they are not enormous)</li>\n</ol>",
        "id": 194937278,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587565037
    },
    {
        "content": "<ol start=\"3\">\n<li>Your use case seems to be right in the resource's intended scope (it doesn't seem like an edge case) so any changes should still not impact the applicability of the resource to your use case.</li>\n</ol>",
        "id": 194937519,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587565129
    },
    {
        "content": "<p>With this information, I would say that your risk level is pretty low - you should be OK to profile the resource.</p>",
        "id": 194937609,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587565168
    },
    {
        "content": "<p>Any resource - regardless of maturity - can be used in profiles.  However, until the resource is normative, there's always a risk of change - or even the resource going away/being merged into something else/etc.  Typically lower maturity resources have less implementation experience, which increases the risk of change</p>",
        "id": 195009191,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587603535
    }
]