[
    {
        "content": "<p>Hi, We are from Dialysis World and we want to capture the machine setting like Temperature, BloodFlow rate when we write the prescription. We checked DeviceMetric but it does not seem to be for this purpose. Can somebody help us and point us to use the right resource to be used when we want to record the dialysis parameters that are used while writing the prescriptions. Some of the dialysis parameters we have are: 1) Machine Temp 2) Blood Flow Rate 3) Dialysate Flow Rate 4) Estimated Dry Weight 5) Sodium Profiling - Start Level , End Level, Modeling Time. etc.  Thanks</p>",
        "id": 153909745,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1506012545
    },
    {
        "content": "<p>So this is about ordering dialysis and specifying what the characteristics of what the settings on the machine should be when dialysis is performed?</p>",
        "id": 153909753,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506016531
    },
    {
        "content": "<p>Good catch I thought was part of the report</p>",
        "id": 153909756,
        "sender_full_name": "Eric Haas",
        "timestamp": 1506016634
    },
    {
        "content": "<p>We have been looking at adding instructions to ProcedureRequest but never discussed machine settings in particular</p>",
        "id": 153909757,
        "sender_full_name": "Eric Haas",
        "timestamp": 1506016747
    },
    {
        "content": "<p>Yes, some of these are device settings although the order would also contain instructions about the sodium modeling and UFR profiling and Dialysate concentrations  to be used in the Procedure. What we have noticed is that the value and reference range in observation resource actually capture the information that we currently have on the order form. We were wishing if these fields could be accommodated as a repeatable structures under instructions in ProcedureRequest.</p>",
        "id": 153909759,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1506017358
    },
    {
        "content": "<p>I suspect that device settings might also be part of orders for radiation therapy and certain other procedures as well.  One of my questions is whether we'd ever need to deal with settings for different types of devices within a single order.  Similarly, would there ever be a dynamic component to settings - e.g. make the setting X for 10 minutes, then change the setting to Y.</p>",
        "id": 153909760,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506017673
    },
    {
        "content": "<p>Thinking this through... ProcedureRequest.supportingInfo with reference to the appropriate resource would be the way to go but I see your point that <code>DeviceMetric</code>doesn't seem to handle your needs.</p>",
        "id": 153909761,
        "sender_full_name": "Eric Haas",
        "timestamp": 1506017687
    },
    {
        "content": "<p>For now, I'm afraid you'll need to use extensions.  We're going to need to think carefully about how to handle this in a generalizable way (and figure out whether we want to handle it as core elements or standard extensions)</p>",
        "id": 153909762,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506017729
    },
    {
        "content": "<p>There is a project in OO w/ DEV WG support on dialysis devices and it is a regular topic of discussion - should sync up with the DoF team on your needs and proposal</p>",
        "id": 153909763,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1506017815
    },
    {
        "content": "<p>One would hope that the approach taken would be analogous to what is needed for medication orders (e.g., using an infusion pump) or ventilator settings or other therapeutic devices</p>",
        "id": 153909764,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1506017989
    },
    {
        "content": "<p>In terms of settings vs. reporting (observations) of settings, the terminology should be consistent</p>",
        "id": 153909765,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1506018069
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span>  , could you please provide the links to the support group you are referring to. Thanks</p>",
        "id": 153909807,
        "sender_full_name": "ravi.kuchi",
        "timestamp": 1506028984
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192784\">@ravi.kuchi</span>  For FMC you should probably give Teri Neal &lt;<a href=\"mailto:Teri.Neal@fmc-na.com\" title=\"mailto:Teri.Neal@fmc-na.com\">Teri.Neal@fmc-na.com</a>&gt; a ping.  She was the main person involved the last I checked.  There is a terminology component and a (currently) V2 focused element, but from what I heard reported (indirectly) from the San Diego meetings last week, they will be moving toward FHIR sometime soon.  So good timing to connect some dots ... sooner than later!</p>",
        "id": 153910017,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1506121845
    }
]