[
    {
        "content": "<p>I am looking for a way to store changing device information (like settings, parameters, status changes) to the PHR. Current PHR is using STU3, but hopefully R4 in the future. <br>\nIn my understanding DeviceMetric is the resource designed for this purpose, but it seems to be quite limited. I can store status change by this resource, but I do not know how to store the information itself (like reason of status change or possible new settings/parameters or information, that sterile part of the device has changed).<br>\nWhat is good way to store information like this? Should I use for example some extension?</p>",
        "id": 175039721,
        "sender_full_name": "Hannu Hyttinen",
        "timestamp": 1567752170
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span> I'm not sure where we got with this?</p>",
        "id": 175040054,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567752697
    },
    {
        "content": "<p>I haven't met with Devices for a while, but I cannot recall that there is work on the parameters side.  Best is probably for Hannu to explain his case on gForge, so we can discuss it in the upcoming Atlanta WGM.  <span class=\"user-mention\" data-user-id=\"201375\">@Hannu Hyttinen</span> - if you're not familiar with gForge, we can enter a request for change on your behalf.</p>",
        "id": 175248164,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1568040331
    },
    {
        "content": "<p>I'm not familiar with gForge yet, but I'd like to learn it. What would it sound like if I put the following enhancement issues on gForge?</p>\n<hr>\n<p>We suggest the adding a new item for device operational status to the DeviceMetric resource. Currently, this information can be provided by the statusReason item of the Device resource.</p>\n<p>We look at this from the perspective of an insulin pump. We understand that a new device should be defined as a Device item when it is added to the system. At this point the status of the devices is for example “in stock | in use”. When an insulin pump defined in the system is in use, its operational status changes quite often. This status can be “online | paused | standby | offline | not-ready | transduc-discon | hw-discon | off”</p>\n<p>The current implementation does not support thinking like this, as the exact state of the device can only be described in the Device item. The current implementation leads to a situation where the entire Device item has to be updated quite often in case of insulin pump.</p>",
        "id": 175406059,
        "sender_full_name": "Hannu Hyttinen",
        "timestamp": 1568184988
    },
    {
        "content": "<p>that's the sort of thing to put on gForge. <span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span> should there be more discussion or a better place?</p>",
        "id": 175406500,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1568185654
    },
    {
        "content": "<p>Yep, that is the PERFECT place to put the proposal.  We will be reviewing these in Atlanta.  If you are at the FHIR CAT this Saturday / Sunday, stop by!  We're around all week (through Friday afternoon) too, including some who have worked with insulin pumps.</p>",
        "id": 175443722,
        "sender_full_name": "Todd Cooper",
        "timestamp": 1568215710
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192176\">@Todd Cooper</span> I'd be very interested in cooperation around modeling insulin pump data in FHIR. Please ask the people you referred to whether there could be some kind of a task force, work group, or chat stream for that?</p>",
        "id": 175593718,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1568349970
    },
    {
        "content": "<p>gForge item #24449 added.</p>",
        "id": 175805302,
        "sender_full_name": "Hannu Hyttinen",
        "timestamp": 1568635316
    }
]