[
    {
        "content": "<p>When an Observation is generated by a computer who reads a questionnaire response and produces one value, isn't the device the observation.performer?</p>",
        "id": 210680408,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600628954
    },
    {
        "content": "<p>We could use performer  for the person that enters the data in the computer, but shouldn't we have an idea of the device that performed the calculation?</p>",
        "id": 210680475,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600629029
    },
    {
        "content": "<p>the best we have is device-code (standard extension) but that is only a code...</p>",
        "id": 210680478,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600629050
    },
    {
        "content": "<p>Isn't there the device-field for telling which device made the measurement?</p>",
        "id": 210690453,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1600644278
    },
    {
        "content": "<p>I think there's a difference between \"device used by person/org to make the measurement\" vs. \"device that determined the value on its own\"</p>",
        "id": 210693610,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600649706
    },
    {
        "content": "<p>try provenance</p>",
        "id": 210698075,
        "sender_full_name": "Eric Haas",
        "timestamp": 1600657989
    },
    {
        "content": "<p>I don't think that's an appropriate answer.  Observations can be created by devices without human involvement - so why isn't performer allowed to be a Device?  It's reasonable to want to search for all Observations created by a particular piece of software.</p>",
        "id": 210698572,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600658884
    },
    {
        "content": "<p>my case is that the software is the one doing the calculations. Humans only provide input.</p>",
        "id": 210721427,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600682318
    },
    {
        "content": "<p>agree, provenance could say where the original data comes from but does not assert who/what created the observation</p>",
        "id": 210721492,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600682360
    },
    {
        "content": "<p>I think if you add Device to  .performer( which is what I think this conversation is about) there will be unending confusion as to which element to use that no amount of documentation will alleviate.</p>",
        "id": 210750975,
        "sender_full_name": "Eric Haas",
        "timestamp": 1600699382
    },
    {
        "content": "<p>That's better than not being able to say what's necessary.  If a device has the responsibility for doing the work/making the decision, that needs to be reflected.  Provenance isn't viable and using Observation.device would be wrong.</p>",
        "id": 210751622,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600699651
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191401\">Eric Haas</span> <a href=\"#narrow/stream/179166-implementers/topic/device-issued.20observations/near/210750975\">said</a>:</p>\n<blockquote>\n<p>I think if you add Device to  .performer( which is what I think this conversation is about) there will be unending confusion as to which element to use that no amount of documentation will alleviate.</p>\n</blockquote>\n<p>confusion as to which element to use for what?</p>",
        "id": 210779672,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600712134
    },
    {
        "content": "<p>I can expect a difference between: <br>\na) when a computer is used by a user to enter the result<br>\nb) when a computer makes the actual computation</p>\n<p>that boundary does not seem very difficult to assert. Am I missing something outside these?</p>",
        "id": 210780259,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600712422
    },
    {
        "content": "<p>A concrete version (of the question) would be: how do you write \"AI Algorithm X\" <em>made</em> this Observation?</p>",
        "id": 210902855,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1600795173
    },
    {
        "content": "<p>Yep</p>",
        "id": 210906380,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600796695
    },
    {
        "content": "<p>This  would support another topic (next door )- It would be interesting to go \"This observation was made on date D by AI Algorithm X, version Y, trained with data set Z\"</p>",
        "id": 210980336,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600854540
    },
    {
        "content": "<p>I'm not convinced that .performer (expressing responsibility) is appropriate still.  Clearly the AI (at whatever level of granularity appropriate) needs to be documented using Observation.device, but the responsibility for its performance (that is .peformer) is the organization that owns and manages that AI.  The equivalent would be the LIS where the analyzer (perhaps not using AI, but certainly fully automated) is used to create a result, but the Observation.performer is the technician validating the result and the medical director who is responsible that the analyzer did its part correctly according to maintenance schedule, calibration, etc.  The technician may not be there, but the medical director is.  The analyzer is not documented as part of Observation.performer.  There seems to be no reason that this is different for an AI component.</p>",
        "id": 257090774,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1633971394
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> are there other threads discussing the AI Algorithm attributes that would be interesting for the Device to express?  I think these 'next door' topics are becoming important.</p>",
        "id": 257176295,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1634032183
    }
]