[
    {
        "content": "<p>Given the cardinality of DiagnosticReport.code is [1..1] it seems that when multiple codes are to be reported e.g. <a href=\"http://build.fhir.org/diagnosticreport-example-ghp.xml.html\">Diagnosticreport-example-ghp</a> the value of the code becomes \"broader\" to accommodate the content e.g. &lt;display value=\"General Health Profile\"/&gt;  for this example.  <br>\nWhat are people doing when a full blood count (FBC) plus an erythrocyte sedimentation rate (ESR) are reported?  These tests are reported on the same lab report, so is the DiagnosticReport.code.text = \"General Haematology\" (or an appropriate code)?<br>\nSimilarly if UE's and LFT's which are reported together, does the DiagnsoticReport.code.text = \"General Chemistry\" with the first Observation.code = \"UE\" with the appropriate hasMember Observations for the UE elements (Na, K, CL etc) and the second Observation.code = \"LFT\" with appropriate hasMember Observations for the LFT elements (Total Protein , Albumin,  Globulin etc)?    This would keep the UE &amp; LFT elements together.<br>\nOr do many implementers use the extension <a href=\"http://build.fhir.org/extension-diagnosticreport-extends.html\">diagnosticReport-extends</a>  which seems to be meant for sibling reports with the description of \"The report references related (\"sibling\") reports.\"  In the examples above FBC &amp; ESR and UE &amp; LFT these are on the same lab report or is that what the extension is meant for (tests on the same report)?<br>\nHence my query is to:<br>\n1)  Have the one DiagnosticReport.code and just use a broader term to encompass all the tests on the report in which case a UE when ordered on it's own the DiagnosticReport.code = \"UE\" or if ordered with an LFT will be part of a DiagnsoticReport.code = \"General Chemistry\"?; OR<br>\n2)  Use the extension (if it is appropriate to use in these cases) to accommodate all the tests/panels e.g. UE, LFT that appear on the one report? OR<br>\n3)  Any other suggestions?<br>\nThanks</p>",
        "id": 201956365,
        "sender_full_name": "David McKillop",
        "timestamp": 1593084116
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 201977766,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593096004
    },
    {
        "content": "<p>I am also interested in what is out there in the wild.   WE have had several modeling discussions regarding adding sections to DR but nothing firm yet.</p>",
        "id": 201980104,
        "sender_full_name": "Eric Haas",
        "timestamp": 1593097003
    },
    {
        "content": "<p>A related question which follows on from query 1) above - what is the feedback on  the content of DiagnosticReport.code  that relates to the report rather than the specific contents of that report, e.g.:<br>\nOption 1 - DiagnosticReport.code relates to the specific contents being reported:</p>\n<table>\n<thead>\n<tr>\n<th>Report</th>\n<th>Reported Test(s)</th>\n<th>DiagnosticReport.code</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>Potassium (element of UE)</td>\n<td>Potassium</td>\n</tr>\n<tr>\n<td>2</td>\n<td>Urea and Electrolytes (UE)</td>\n<td>Urea and Electrolytes</td>\n</tr>\n<tr>\n<td>3</td>\n<td>Liver Function Test (LFT)</td>\n<td>Liver Function Tests</td>\n</tr>\n<tr>\n<td>4</td>\n<td>UE &amp; LFT</td>\n<td>General Chemistry</td>\n</tr>\n<tr>\n<td>5</td>\n<td>UE, LFT, Glucose, Mg, Ca, Phos</td>\n<td>General Chemistry</td>\n</tr>\n</tbody>\n</table>\n<p>Option 2 - DiagnsoticReport.code relates to the report no matter what component elements are being reported:</p>\n<table>\n<thead>\n<tr>\n<th>Report</th>\n<th>Reported Test(s)</th>\n<th>DiagnosticReport.code</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>Potassium (element of UE)</td>\n<td>General Chemistry</td>\n</tr>\n<tr>\n<td>2</td>\n<td>Urea and Electrolytes (UE)</td>\n<td>General Chemistry</td>\n</tr>\n<tr>\n<td>3</td>\n<td>Liver Function Test (LFT)</td>\n<td>General Chemistry</td>\n</tr>\n<tr>\n<td>4</td>\n<td>UE &amp; LFT</td>\n<td>General Chemistry</td>\n</tr>\n<tr>\n<td>5</td>\n<td>UE, LFT, GLucose, Mg, Ca, Phos</td>\n<td>General Chemistry</td>\n</tr>\n</tbody>\n</table>\n<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> , <span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span>  and any others?</p>",
        "id": 202028515,
        "sender_full_name": "David McKillop",
        "timestamp": 1593121134
    },
    {
        "content": "<p>Your threads have several aspects.  </p>\n<ol>\n<li>\n<p>Regarding structure of lab results.  The simple structure of order-result(s) and as panels are defined by the performing lab must be preserved.  Often there are calculations and other \"results\" like interpretations that are context specific.  This can be achieved by using service request for the order.  Tiered/physician convenience panels, such as the General Health Profile noted, and reflex orders are more complex and it's even more important from a patient safety aspect to keep the structure in place.  Have yet to see complex panels and reports completely modeled out in FHIR.  Have asked O&amp;O for correct examples for implementers.  <span class=\"user-mention\" data-user-id=\"191969\">@John David Larkin Nolen</span>  has shared a Bone Marrow Report to help jumpstart the process.</p>\n</li>\n<li>\n<p>There is work on overall DR with <span class=\"user-mention\" data-user-id=\"191718\">@Richard Esmond</span>  leading charge on radiology DR and overlap of common elements with pathology DR.  Work has been on and off for structuring the common sections found from each specialty in a typical DR.  The Bone Marrow report touches on many aspects, including parts of the CBC from the clinical lab, as well as pathology aspects, and genomics aspects would touch several areas and be a great example.  </p>\n</li>\n<li>\n<p>For the GHP, it can be coded as original request and the CBC and Urinalysis can also be modeled as a request linked to the original request.  Appropriate specimens for each also need to be linked to each as well as procedure for collections for each, such as venipuncture for CBC, but clean catch collection for Urinalysis.  </p>\n</li>\n<li>\n<p>Each result (observation) can refer back to the service request, but each order is necessary to provide additional context for the laboratory \"test\" performed, but also keep observations \"grouped\" together that are in panels and retain the report structure from the performing lab.  It's not like 52 pick up where  a random order of observations are reported. </p>\n</li>\n<li>\n<p>That said, the DiagnosticReport.code is often the LOINC order code, which represents each panel order (i.e. CBC, Urinalysis) and the required results which are part of the panel.  There are different LOINC order codes for CBC with differential and CBC without differential/hemogram, for example. [image.png](/user_uploads/10155/AmZF38TDaiz37ebzVEddaqor/image.png  Keep in mind folks should be mapping LOINCS accurately uding the most specific/detailed LOINC as accurately describes the order or result.  If the UA is reflexive, a reflexive LOINC shoudl be mapped.  Having these maps at the service request level can allow for a single query of the CBC or other panel, instead of querying each of the individual results (observations) that are usually part of a CBC.</p>\n</li>\n<li>\n<p>In addition, each laboratory has their own mnemonics and ordering codes for referring to an order.  Some countries also have defined panels and the order LOINCs that should be used.   Service Request also supports a \"code.\"  Where results of an order are all reported together as the same panel in a Diagnostic Report, such as CBC order reported as results of the CBC referring to the order in the DR, the codes should be the same, whether LOINC or performing laboratory code.  The items are the same.  A single order for a Potassium, may have a different result code for the resulted potassium, permitting distinctions when the same naming conventions are used for orders and results.  They would have the same LOINC code.  What gets tricky is the reflex or physician convenience orders.  The GHP panel or other customer physician convenience panels like a stroke panel may not have a LOINC.  Regenstrief has indicated they will not create LOINCs for every single panel, such as those that vary by a result component, but guidance is in place with a design that allows flexibility with optional items.</p>\n</li>\n<li>\n<p>There are laboratory \"sections\" as used by CMS in the US,  CLIA Proficiency Testing (PT), many laboratories to indicate which \"benches\" or areas of the laboratory a test is performed in, and many EHR and LIS vendors to \"group\" lab results by whether they are hematology, chemistry, pathology as you seem to indicate.  These are able to be represented by FHIR observation category.  It allows all the chemistries to be \"grouped\" together or orders to be listed together for CPOE.</p>\n</li>\n</ol>\n<p>Hope that helps!  Andrea</p>",
        "id": 202084434,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1593175422
    },
    {
        "content": "<p>Hi  <span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span>  , thanks greatly for your detailed and considered reply.  Greatly appreciated.  We'll digest what you've said and use it to reflect on our models.<br>\nCheers</p>",
        "id": 202264710,
        "sender_full_name": "David McKillop",
        "timestamp": 1593393699
    },
    {
        "content": "<p>You're welcome.  Thank you for sharing.  This is fantastic!  Reviewing and Digesting.</p>\n<p>Could you clarify what pathology and laboratory entail in Australia, as different countries use the terms with different meanings?</p>\n<p>Do you anticipate the DR will be used for surgical pathology reports (and have you/will you model the RCPA cancer checklists in FHIR)?  Have/will you also model genetics and molecular reports in the FHIR DR?  Or are there areas (any of these) excluded from scope of use of the FHIR DR?  Trying to get a better idea of use case scope.</p>\n<p>Also shared the thread with others working on the same problems</p>",
        "id": 202594110,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1593622392
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192323\">@David McKillop</span>  reviewing the fbc DR html and it looks beautiful :)  I'd expect to see the units to the right of the numeric values and units with the reference range values in case there are any differences.  Also a numeric value for microbiology sensitivity testing may include a numeric result value for the antibiotic followed with an interpretation of Susceptible, Resistant, Intermediate.   </p>\n<p>Are these considered publically available and can they be referenced in presentations/education to the laboratory community on what FHIR implementations may look like?</p>",
        "id": 202595237,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1593622904
    },
    {
        "content": "<p>On the Breast Radiology Report IG we used a Fhir Document (Bundle with a Composition as the first element 'index) as the base structure. You can add one or more Diagnostic Reports (with associated observations) to this, so possibly have one Diagnostic Report for each order? Having the whole shabang (technical term) in the fhir document also allows the report to be signed with a hash so you can better show provenance.<br>\nHere is a link to the base structure<br>\n<a href=\"http://build.fhir.org/ig/HL7/fhir-breast-radiology-ig/StructureDefinition-BreastRadiologyComposition.html\">http://build.fhir.org/ig/HL7/fhir-breast-radiology-ig/StructureDefinition-BreastRadiologyComposition.html</a></p>",
        "id": 202597766,
        "sender_full_name": "Kurt Allen",
        "timestamp": 1593624263
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192611\">@Kurt Allen</span>   One of the challenges discussed is some labs will report separate DRs resulting from an order (usually reflexive, add on, but may be individually ordered), while others may report in a single integrated report (which wouldn't have the performing lab, CLIA#, address repeated).</p>",
        "id": 202611052,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1593630611
    },
    {
        "content": "<p>In reference to <span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span>  comment <code>Thank you for sharing. This is fantastic! Reviewing and Digesting.</code>, it's in reference to a separate communication (non Zulip) containing the <a href=\"https://www.digitalhealth.gov.au/\">Australian Digital Health Agency</a>’s Diagnostic Report FHIR implementation guide is <a href=\"https://github.com/AuDigitalHealth/ci-fhir-r4/releases/tag/DR-1.0.0-2020JUN\">released for stakeholder engagement and review</a> supporting pathology reports, diagnostic imaging reports, and specialist and other diagnostic reports.</p>\n<p>This draft release has been developed with a suite of draft profiles (derived from <a href=\"https://build.fhir.org/ig/hl7au/au-fhir-base/index.html\">HL7 AU</a>) and some early examples in order to form a basis for engagement with industry and other stakeholders. <br>\nThere have been a number of modelling decisions made including:<br>\n1) We separated the domains of pathology, diagnostic imaging and specialist &amp; other diagnostics with each having their own set of Compositions, DiagnosticReport and Observation profiles; <br>\n2) We’ve split each domain to suit our use cases of:<br>\na) <a href=\"https://www.myhealthrecord.gov.au/\">My Health Record</a> content – which includes a pdf and some meta data (results values may be included, but not accepted in the current My Health Record CDA content)<br>\nb) atomic content – capable of exchanging a diagnostic report with atomic data.<br>\n3) When sending a report of a multi-test study or panel:<br>\n•   result is sent with the Observation representing the study / panel<br>\n•   code is sent with the same code in that study / panel Observation<br>\n•   the individual component tests are referenced by that Observation (Observtion.hasMember) and not directly referenced by the DiagnosticReport<br>\nNumber 3) allows for structure of the test group/panel to be as the diagnostic provider intended, thereby improving clinical safety, though I’m sure it will stimulate discussion for those familiar with HL7 V2 messaging.</p>\n<p>There are some examples present including “FBC + ESR” and a “COVID” for pathology and an “Echocardiography Report” (complex report with multiple hasMember observation layers) in the other diagnostic report.  More examples need to be developed to demonstrate the profiles, but current time constraints meant that more examples will need to be in future development.</p>",
        "id": 202643784,
        "sender_full_name": "David McKillop",
        "timestamp": 1593655845
    },
    {
        "content": "<p>In response to <span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span> 's questions refer to the following:</p>\n<blockquote>\n<p>Could you clarify what pathology and laboratory entail in Australia, as different countries use the terms with different meanings?</p>\n</blockquote>\n<p>In Australia, the term “pathology” covers both:<br>\n•   - Laboratory (Clinical Chemistry, Hematology, Microbiology, etc.)<br>\n•   - Pathology / Histopathology / related disciplines</p>\n<blockquote>\n<p>Do you anticipate the DR will be used for surgical pathology reports (and have you/will you model the RCPA cancer checklists in FHIR)?  </p>\n</blockquote>\n<p>Back in 2015, the <a href=\"https://www.rcpa.edu.au/Library/Practising-Pathology/PTIS/PITUS-15-16\">RCPA PITUS 15-16</a>  had a project “report modelling” to produce structured reporting of cancer where Grahame was primarily involved with the output found <a href=\"http://fhir.hl7.org.au/fhir/rcpa/index.html\">here</a>.  This content was a demonstration and wasn’t progressed.  The current <a href=\"https://www.rcpa.edu.au/Library/Practising-Pathology/PTIS/PITUS-18-20\">RCPA PITUS 18-20</a> has a project 4. “SPRC Infostructure and Conformance will develop a model and terminology for four protocols and undertake Informatics External Quality Assurance (IEQA) trial for one protocol” which <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  is doing and I believe he is close to finalising this content.  I’ll let you know when it becomes available.  FYI - Grahame’s structured reporting of cancer protocol content will be separate to the Agency profiles.  </p>\n<blockquote>\n<p>Have/will you also model genetics and molecular reports in the FHIR DR?  Or are there areas (any of these) excluded from scope of use of the FHIR DR?  Trying to get a better idea of use case scope.</p>\n</blockquote>\n<p>No, we haven’t modelled genetics or molecular content.  I have seen lots of chatter on the Zulip genomics channel and we don’t have the same subject matter expertise involved here in AU, so we’ve excluded it from out scope at this stage.  We’ll see what comes out of the USA developments for this content. <br>\nSo, our use case for the 3 domains which we’ve treated separately – 1) pathology (not specific structured cancer reporting as per the RCPA protocols), 2) diagnostic imaging and 3) specialist &amp; other diagnostics, is for both the:<br>\n-   My Health Record which is a pdf with some meta data (e.g. service section id, test name)<br>\n-   DR with atomic content for exchange.</p>",
        "id": 202647244,
        "sender_full_name": "David McKillop",
        "timestamp": 1593660831
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192611\">@Kurt Allen</span>  I see that your Composition has a slice on Composition.section with a section for the various content including DR's which allows you to do what you need.<br>\nIn the <a href=\"https://github.com/AuDigitalHealth/ci-fhir-r4/releases/tag/DR-1.0.0-2020JUN\">Diagnostic Report FHIR implementation guide</a> we have the option for using a Composition (within a Bundle) as a wrapper for the DR, but the DR can be sent in a Bundle without the Composition.  For our use case of the <a href=\"https://www.myhealthrecord.gov.au/\">My Health Record</a>, both the Composition.section and Composition.section.entry have been constrained to [1..1]. <br>\nFor pathology it also makes sense to constrain the Composition similarly as the attached report is linked in the DR.presentedForm and the reportable codes need to be associated with that report. <br>\nOne of our queries/issues is with the cardinality of DR.code of [1..1]:<br>\nIn the case with pathology in AU, the <a href=\"https://www.rcpa.edu.au/Home\">RCPA</a> are very concerned that the results are interpreted as the diagnostic provider intended.  The RCPA have developed  <a href=\"https://www.rcpa.edu.au/getattachment/ed0da9c5-af61-4c5a-ace4-a06812911407/SPIA-(APUTS)-Standards-for-Pathology-Informatics-i.aspx\">Standards for Pathology Informatics in Australia (SPIA)</a> which has a standard:<br>\n<code>S10.1  Data must be sent in a rendered format and may be accompanied by atomic results which must be coded.</code><br>\nso in the case where there are multiple requested codes that appear on the same report (pdf) e.g. UE, LFT, Mg, Urate, etc the problem becomes one at the DR level as the DR.code has a cardinality of [1..1].  The problem is what do you have for DR.code is it a generic term eg \"General Chemistry\" (refer to scenario in table earlier in this thread) which is no more specific than DR.category. Ideally, all the reported codes (e.g. UE, LFT, Mg, Urate etc) that appear in the same attached pdf would be \"grouped\" together in the same DR.  There are options to deal with this including:<br>\n1)  Use of a generic code at the DR.code level e.g. \"General Chemistry\"<br>\n2) Use the extension <a href=\"http://build.fhir.org/extension-diagnosticreport-extends.html\">extends</a> where each code is listed via the extension<br>\n3) Any other suggestions?<br>\nWhat is the logic/reasoning for DR.code being [1..1] ?</p>",
        "id": 202650256,
        "sender_full_name": "David McKillop",
        "timestamp": 1593665614
    },
    {
        "content": "<p>It is true that panel orders need to retain their \"grouping\" as defined by the performing laboratory.  It's a patient safety issue if they are not.  Where multiple diagnostic reports are integrated into a single report, the interpretation for each needs to be associated with each as there is important clinical context (i.e. wouldn't want negative cytogenetics interpretation on a positive flow cytometry for a bone marrow biopsy for leukemia diagnosis)</p>",
        "id": 202675199,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1593688799
    },
    {
        "content": "<p>yes I am working on the cancer protocols, but I don't know yet know when I'll be able to publish it - the intent is there but waiting for some procedural issues to be resolved</p>",
        "id": 202766790,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1593748906
    },
    {
        "content": "<p>A main item of the above (TL;DR) :  \"What's the reasoning for the cardinality of DiagnosticReport.code = [1..1]?\"<br>\nThis is particularly relevant for reports that have aggregate tests  (e.g. UE, LFT, Mg, Urate etc) where a relaxed cardinality of [1..*] would accommodate them.</p>",
        "id": 203058883,
        "sender_full_name": "David McKillop",
        "timestamp": 1594084644
    }
]