[
    {
        "content": "<p>Based on WGM discussions, here is a proposal to handle complex structured reports using DiagnosticReport and Composition. Feedback please! <a href=\"https://jira.hl7.org/browse/FHIR-29258\">https://jira.hl7.org/browse/FHIR-29258</a></p>",
        "id": 213200112,
        "sender_full_name": "John David Larkin Nolen",
        "timestamp": 1602614997
    },
    {
        "content": "<p>Hey all,<br>\nWhen converting CDAs to FHIR, how does one distinguish whether to turn an Observation into a FHIR Observation (like vitals) vs generating a DiagnosticReport and Observation(s)?</p>",
        "id": 253267062,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1631631868
    },
    {
        "content": "<p>A FHIR Observation is usually about a single thing while a DiagnosticReport is based on one or more tests or is a derivative of one or more tests.   In  short, an Observation can be (But isn't always) a simple statement of a single thing while a DiagnosticReport is for a panel or a complex diagnostic event.  So, if it's a simple \"this is that\", use Observation.  If it's a complex \"these things point to this\", then DiagnosticReport.  I've oversimplified but you get the jist.</p>",
        "id": 253267766,
        "sender_full_name": "David Pyke",
        "timestamp": 1631632097
    },
    {
        "content": "<p>Perhaps if the observations are in the vital signs section, you don't group them into a DiagnosticReport and if the Observations are in the results section you make DiagnosticReports (1 per organizer). [Haven't done CDA in over a year, memory might be fuzzy.]</p>",
        "id": 253268086,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1631632217
    },
    {
        "content": "<p>Oh yeah, duh</p>",
        "id": 253268898,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1631632528
    },
    {
        "content": "<p>Thanks</p>",
        "id": 253268904,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1631632530
    }
]