[
    {
        "content": "<p>I want to implement Diagnostic Medicine Module using hapi fhir but i don't know where to start. I have studied all the material provided @ the linke   <a href=\"http://hl7.org/fhir/stu3/diagnostics-module.html\" target=\"_blank\" title=\"http://hl7.org/fhir/stu3/diagnostics-module.html\">http://hl7.org/fhir/stu3/diagnostics-module.html</a>  and implemented Patient, ProcedureRequest and DiagnosticReport Resources, when anybody requests a report my system returns report and when requests Procedure request i create a procedure request in my system and return an id. Kindly advise correct way to implement this module.</p>",
        "id": 157339834,
        "sender_full_name": "muhammad arshad",
        "timestamp": 1549012756
    },
    {
        "content": "<p>What types of systems are you hoping to interact with?</p>",
        "id": 157339994,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549013004
    },
    {
        "content": "<p>Other labs and hospitals can send orders to our hospital to perform laboratory or Radiology tests and we also can send orders to other labs and hospitals. When tests are performed other labs/hospitals can request for results. I have confusion how orders are mapped with respective results? when tests are performed these results automatically will sent to respective labs/hospitals or they have to request to get results. Kindly guide me to implement this module step by step.</p>",
        "id": 157341423,
        "sender_full_name": "muhammad arshad",
        "timestamp": 1549014680
    },
    {
        "content": "<p>The answer to that question will depend on where you're implementing.  In most of the world, labs are primarily handled by v2 (where an electronic interface exists at all).  There isn't much FHIR implementation for labs that I'm aware of.</p>",
        "id": 157359171,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549033742
    },
    {
        "content": "<p>I want to implement in Pakistan, I just want to send orders and want to receive results.</p>",
        "id": 157369912,
        "sender_full_name": "muhammad arshad",
        "timestamp": 1549042660
    },
    {
        "content": "<p>Ok, and are you in communication with the developers of the systems you're wanting to communicate with?</p>",
        "id": 157370541,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549043209
    },
    {
        "content": "<p>yes, I am with communication with the developers and i am also a developer</p>",
        "id": 157421199,
        "sender_full_name": "muhammad arshad",
        "timestamp": 1549109775
    },
    {
        "content": "<p>Ok, so the situation is that both the ordering systems and the lab systems involved are interested in setting up a new interoperability interface, have decided to use FHIR and are now busy figuring out how it should work?  If so - awesome.  Next question - have you taken a look at the \"workflow\" portions of the specification?  It provides guidance for how to ask for things to be done.</p>",
        "id": 157437217,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549139177
    },
    {
        "content": "<p>(And managing responses)</p>",
        "id": 157437219,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549139185
    },
    {
        "content": "<p>I have taken a look at the link <a href=\"http://hl7.org/fhir/stu3/diagnostics-module.html\" target=\"_blank\" title=\"http://hl7.org/fhir/stu3/diagnostics-module.html\">http://hl7.org/fhir/stu3/diagnostics-module.html</a> and implemented ProcedureRequest and DiagnosticReport Resources. When other labs request to perform any laboratory tests i create order in our system and send back order id to requesting labs and when lab requests DiagnosticReport i send complete repost to that lab. Is it a correct way to implement this module?</p>",
        "id": 157456848,
        "sender_full_name": "muhammad arshad",
        "timestamp": 1549177588
    },
    {
        "content": "<p>There isn't a \"correct\" way - there are a number of architectural approaches depending on what you need.  Take a look at the <a href=\"http://hl7.org/fhir/stu3/workflow.html\" target=\"_blank\" title=\"http://hl7.org/fhir/stu3/workflow.html\">http://hl7.org/fhir/stu3/workflow.html</a> pages.  It'll present some of the options.  You need to decide if there's a need for someone to ask you to hold or cancel an order after you've started, if there's a need to be able to check on the progress of the order,  if there's a need to \"push\" results to the requesting lab or whether you're ok with them regularly polling to see \"are you done yet?\".  You also need to think about how they'll receive amended results (if the initial report was in error).</p>",
        "id": 157474173,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549211195
    },
    {
        "content": "<p>thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  for your quick response and guidance</p>",
        "id": 157493499,
        "sender_full_name": "muhammad arshad",
        "timestamp": 1549245059
    }
]