[
    {
        "content": "<p>Give the DiagnosticReport resource how do we broadly type instances as Pathology or Diagnostic Imaging or other types such as a Sleep Study?  I do appreciate we have the diagnostic-service-sections codes in the category property of the resource, however, these are quite granular and one would need a mapping table to group each into the broader types. We could use multiple categories for instance  ('Chemistry' and 'Laboratory') but there is not a broad code for Diagnostic Imaging, e.g we can't do this ('Radiology Ultrasound' and 'Diagnostic Imaging').<br>\nAny thoughts?</p>",
        "id": 188691427,
        "sender_full_name": "Angus Millar",
        "timestamp": 1582242497
    },
    {
        "content": "<p>Category repeats, so you can have larger-grained categories too if you like.  If you think the existing example binding isn't ideal, you could also propose a different one</p>",
        "id": 188699689,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582253700
    },
    {
        "content": "<p>There are others who think the category codes aren't granular enough  :-).</p>",
        "id": 188710859,
        "sender_full_name": "Eric Haas",
        "timestamp": 1582272543
    },
    {
        "content": "<p>Another way we were thinking of representing the broader categories of \"Pathology\" (in Aus we lump Laboratory - Chem, Haem, Micro, etc together with Pathology - Histopathology under the one banner of \"Pathology\") , \"Diagnostic Imaging\" and \"Other\" (cardiology, sleep studies, lung function tests etc)  was to wrap the diagnostic report in a composition and indicate the the broader category in composition.type (11526-1 Pathology study; 18748-4 Diagnostic imaging study) .   For the contents of \"Other\" will use specific codes available in LOINC eg 28633-6 Polysomnography (sleep) study.<br>\nIs that a reasonable approach or any other suggestions?</p>",
        "id": 188890412,
        "sender_full_name": "David McKillop",
        "timestamp": 1582502911
    }
]