[
    {
        "content": "<p>From the beginning, the DICOM code system has had the canonical URL <a href=\"http://nema.org/dicom/dicm\" target=\"_blank\" title=\"http://nema.org/dicom/dicm\">http://nema.org/dicom/dicm</a>, which is actually a typo (so I discovered when investigating).<br>\nIt should actually be <a href=\"http://nema.org/dicom/dcm\" target=\"_blank\" title=\"http://nema.org/dicom/dcm\">http://nema.org/dicom/dcm</a></p>\n<p>though something else is possible. I'm talking to DICOM about what URL it should be</p>\n<p>but does anyone thing we can not or should not change it at this point?</p>",
        "id": 153874333,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488415763
    },
    {
        "content": "<p>I have no concerns with changing the URL. </p>\n<p>But, I do have a concern about the interplay of FHIR releases with releases of external code systems and value sets. My specific concern is with respect to DICOM codes, but I expect this will hit other code systems as well.</p>\n<p>FHIR documents a DICOM code system at <a href=\"http://build.fhir.org/codesystem-dicom-dcim.html\" target=\"_blank\" title=\"http://build.fhir.org/codesystem-dicom-dcim.html\">http://build.fhir.org/codesystem-dicom-dcim.html</a> (or wherever it will move to when published). This currently points to the always-most-recent version of the DICOM terminology. Similarly, the value set described at <a href=\"http://build.fhir.org/valueset-dicom-cid29.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-dicom-cid29.html\">http://build.fhir.org/valueset-dicom-cid29.html</a>, says it is defined in terms of <a href=\"http://medical.nema.org/medical/dicom/current/output/html/part16.html#sect_CID_29\" target=\"_blank\" title=\"http://medical.nema.org/medical/dicom/current/output/html/part16.html#sect_CID_29\">http://medical.nema.org/medical/dicom/current/output/html/part16.html#sect_CID_29</a>, which is the always-most-recent version of that value set.</p>\n<p>The FHIR pages listed above contain the values in the code system and the value set, respectively.</p>\n<p>DICOM publishes updates approximately 5 times a year. FHIR expects to publish, lets say, every 18 months. That means there could be about 8 updates to DICOM vocabulary between FHIR publications.  As far as I am aware, DICOM does not rev changes to the code scheme, as it is currently at 01. However, they do version each change of the value set, with the revision being the change date.</p>\n<p>What is the intent of FHIR with respect to tracking changes to the code system and value sets between FHIR releases? Is the “official” FHIR code system/value set the one published at the time FHIR is published? Is it the latest DICOM published version? Is it some fixed release of DICOM (2017a, 2016d, etc.)? It seems wrong to point to something that can change, but then include a specific version of the content in the code system/value set expansions. </p>",
        "id": 153874556,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1488506716
    },
    {
        "content": "<p>this is why it is better for DICOM to publish the code system and the value sets; this means that DICOM is in control of the versioning, life cycle, and releases. </p>",
        "id": 153874560,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488507385
    },
    {
        "content": "<p>well, at least the code system. </p>",
        "id": 153874561,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488507416
    },
    {
        "content": "<p>we would make the value sets version-less, but since the only apparatus is to define the value sets by enumeration, that doesn't buy us very much. That really means that it would be best for DICOM to publish the value sets, and we'll just bind to them. </p>",
        "id": 153874562,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488507482
    },
    {
        "content": "<p>So far, we've got agreement from NEMA/DICOM to put up the redirect; it would be even better if dicom also hosted the code system and the value sets. But given the time line, that might be too much this time around, and we can aim for that next time</p>",
        "id": 153874564,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488507530
    },
    {
        "content": "<p>So, my guess is that from DICOM's point of view, they are \"hosting\" the code system and value sets.</p>",
        "id": 153874581,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1488512045
    },
    {
        "content": "<p>wekll, they're not. but I think you mean, it's what should happen</p>",
        "id": 153874587,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488514212
    },
    {
        "content": "<p>No, what I mean is that DICOM is publising the code system and value sets, in the way that meets their needs. I expect other SDOs are doing the same. What is unclear to me is how FHIR would like to align with updates, and what FHIR's expectation of what an SDO's hosting of code system and value sets would mean.</p>\n<p>(I'm also unsure if the redirect NEMA put in place is actually to what FHIR wants.)</p>",
        "id": 153874670,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1488565542
    },
    {
        "content": "<p>well, here is what I'd like: <br>\n- DICOM publishes the code system and any of the value sets they want to change in an ongoing fashion<br>\n- each of them has a canonical URL that points to a DICOM maintained web site (e.g. <a href=\"http://nema.org\" target=\"_blank\" title=\"http://nema.org\">nema.org</a>)<br>\n- when a user (web browser, accept type = text/html) accesses the canonical URL, they get some useful presentation of the content of the code system or value set (a bridging page that explains language differences,(e.g. value set vs concept group),  a link to the correct that place in the DICOM standard, and manual download of the relevant resource)<br>\n- when an app (accept type = application/fhir+xml|json) access the canonical URL, they get back the resource directly </p>",
        "id": 153874672,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488566942
    },
    {
        "content": "<p>- we just reference the value sets by canonical URL in the resource definitions</p>",
        "id": 153874673,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488566968
    },
    {
        "content": "<p>That's what I was afraid of. FHIR would like another SDO to present their content in a FHIR-friendly way (bridging page, multiple ways to download a FHIR resource, etc.). I expect DICOM won't mind doing this, but is work that is being imposed on another organization.</p>",
        "id": 153874678,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1488567455
    },
    {
        "content": "<p>well, right now, we're doing that, but it has to be at our life cycle. You can't have your cake and eat it too</p>",
        "id": 153874692,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488571929
    },
    {
        "content": "<p>the II committee can keep the current build as up to date as it likes though</p>",
        "id": 153874693,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488571965
    },
    {
        "content": "<p>the real question is, 'whose content is it'? </p>",
        "id": 153874694,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488571989
    }
]