[
    {
        "content": "<p>Hello,</p>\n<p>Just wondering if anyone can shed some light on the  DICOM RT implementation and the use of FHIR  resources to support the additional attributes that DICOM RT requires.</p>\n<p>Many thanks!</p>",
        "id": 163569854,
        "sender_full_name": "Radhika Verma",
        "timestamp": 1555513937
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> ?</p>",
        "id": 163571902,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555515166
    },
    {
        "content": "<p>To date, DICOM and HL7 Imaging have taken the view that the specialized DICOM RT structure is the best vehicle for conveying RT information, accessed in FHIR through the ImagingStudy resource.</p>\n<p>We recognize that there is certain information that might be useful in an EMR or reporting context which could be exposed as extensions to ImagingStudy, or as Observations, but we lack engagement from the medical physicists and registry owners who could identify what is important to capture and how to express it. A simple, single “dose” on a study incorrect.</p>\n<p>On the other hand, if your question is about extracting information from FHIR, instead of HL7 v2, that can be used to populate DICOM RT objects, I expect most of the capability is already there, but no one has profiled it. I’m sure HL7 Imaging Integration would be happy to work with you to pursue that.</p>\n<p>One final note, another obvious gap is the lack of a FHIR equivalent to IHE SWF. <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  was asking about that recently. If that is a priority, I suggest connecting with him and IHE Radiology to see where that idea is. </p>\n<p><span class=\"user-mention\" data-user-id=\"191960\">@Brad Genereaux</span>, <span class=\"user-mention\" data-user-id=\"197037\">@Jonathan Whitby</span>, <span class=\"user-mention\" data-user-id=\"202389\">@Kevin O'Donnell</span></p>",
        "id": 163578579,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1555519349
    },
    {
        "content": "<p>Thanks a lot Elliot for providing the insights. For now, my question was just FHIR related and I was also looking into the ImageStudy resource with extensions (for DICOM RT specific attributes that cannot be directly mapped to a FHIR resource).  </p>\n<p>The extraction capability from FHIR that you've mentioned is quite interesting. I would like to dig into this further.</p>\n<p>Thank you once again for your quick response. Have a nice day ahead!</p>",
        "id": 163587409,
        "sender_full_name": "Radhika Verma",
        "timestamp": 1555525249
    }
]