[
    {
        "content": "<p>This is the first time post, please guide me if this is not the right forum / etiquette ! </p>\n<p>Im trying to sync an Upstream DICOM instances to the local DICOM server for a given patient (ID). ie. Bring all the studies, series and instances. Also converting the study into ImagingStudy metadata object, basically converting the DICOM Tags. My question is </p>\n<p>(1) how / where do I store the Patient Infromation in ImagingStudy ? \"subject\"?  The mapping as described in the resouce is  \"  subject (0010/*)\" . can someone help me with the JSON that will be pushed into the subject ? <br>\nThese are  the fields of interest <br>\n        \"patientName\": \"{{ study.random_dicom.read_property(\"0x10\", \"0x10\") }}\",<br>\n        \"patientID\": \"{{ study.random_dicom.read_property(\"0x10\", \"0x20\") }}\",<br>\n        \"patientBirthDate\": \"{{ study.random_dicom.read_property(\"0x10\", \"0x30\") }}\",<br>\n        \"patientSex\": \"{{ study.random_dicom.read_property(\"0x10\", \"0x40\") }}\",<br>\n        \"patientAddress\": \"{{ study.random_dicom.read_property(\"0x10\", \"0x1040\") }}\"<br>\n(2) If the patient is not available in the downstream server, what should be workflow that I should adopt to create the patient?</p>",
        "id": 173444577,
        "sender_full_name": "Shantha Andrews",
        "timestamp": 1566052928
    },
    {
        "content": "<p>Yes you use the Patient resource.... Hmm, there should be a DICOM mapping in the Patient resource. Could you make a Change Request (CR) to add this to Patient. Your guess right now is a good start. Others from the Imaging Workgroup will help with details -- <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> <span class=\"user-mention\" data-user-id=\"197037\">@Jonathan Whitby</span> <span class=\"user-mention\" data-user-id=\"191960\">@Brad Genereaux</span></p>",
        "id": 173494290,
        "sender_full_name": "John Moehrke",
        "timestamp": 1566147858
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  much appreciated</p>",
        "id": 173537319,
        "sender_full_name": "Shantha Andrews",
        "timestamp": 1566215289
    },
    {
        "content": "<p>I think we (II/WG-20) discussed adding mappings between various resources and DICOM, but got push back from DICOM WG-06 because of concerns about how \"official\" and complete mappings are. In the absence of mappings, though, creating a Patient resource should not be too challenging, although there will need to be some transformations: DICOM PN to FHIR HumanName, etc.</p>\n<p>The question of who should create the Patient, where it (and the ImagingStudy) should live, what the workflows are, how updates are detected/managed, etc. are open. I think practical experience is needed before we have answers on these.</p>",
        "id": 173563352,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1566236573
    }
]