[
    {
        "content": "<p>First foray into the Claim FHIR resource, and wondering if there's a significant difference between the Restful Create Claim vs the Claim$Submit operation, if we're only using the Claim resource and (contained) Patient resource, with no requirements for processing/submitting multiple Claims at once.</p>",
        "id": 198950384,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1590612136
    },
    {
        "content": "<p>RESTful create of a Claim resource means that there is a Claim resource in existence. There is no expectation or obligation that the claim is to be processed. The creation of the Claim resource is likely to occur on the system that is later going to submit the claim. Only through the $submit operation is the processing of the claim initiated.</p>",
        "id": 198957922,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1590616190
    },
    {
        "content": "<p>There are actually 3 ways to ask a system to process a request.  One is to post the request resource (Claim in this case) to the target system with a special meta.tag indicating that the resource is 'actionable'.  However, that gives no ability to negotiate about the processing of the request or to monitor status.  The second approach is to create the request (Claim) resource and then create a Task that asks for fulfillment of that request.  The Task allows negotiation, an explicit accept/reject, monitoring of progress, etc.  The third approach is a custom operation like Claim/$submit.  In that case, there's no requirement for the Claim to be exposed at any RESTful endpoint at all.  As well, the submission of the claim and getting back the response can happen in a single call (if the operation completes synchronously). The financial space has generally focused on custom operations for their processing requirements because exposing the resources to RESTful search/manipulation doesn't generally fit with historical business models.  For other types of requests (e.g. ServiceRequest), the other mechanisms are more common.  You can find more discussion on the FHIR workflow pages: <a href=\"http://build.fhir.org/workflow-communications.html\">http://build.fhir.org/workflow-communications.html</a></p>",
        "id": 198972756,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590627786
    }
]