[
    {
        "content": "<p>Minor complaint - the structure definitions in standalone files (e.g., StructureDefinition-CodeableConcept.json) are not identical to the ones in the bundles like Bundle-types.json, due to formatting in the div.  E.g., <br>\n&lt;div xmlns=\\\"http://www.w3.org/1999/xhtml\\\"&gt;&lt;table ...<br>\nvs<br>\n&lt;div xmlns=\\\"http://www.w3.org/1999/xhtml\\\"&gt;\\n            &lt;table ...</p>",
        "id": 165753598,
        "sender_full_name": "Nick George",
        "timestamp": 1557953406
    },
    {
        "content": "<p>yay for whitespace issues in xhtml.</p>",
        "id": 165763002,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557961480
    },
    {
        "content": "<p>this is a problem because?</p>",
        "id": 165763004,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557961485
    },
    {
        "content": "<p>(well, it's a string stored in json, not in xhtml.)</p>\n<p>Obviously not a huge issue but I'd argue that there should be a single unique structure definition for a given url, across all of the spec.  Right now if I asked you \"what is the string value of text.div for the structure definition of CodeableConcept?\" the answer would be \"depends which definition in the spec you're looking at\"</p>",
        "id": 165763912,
        "sender_full_name": "Nick George",
        "timestamp": 1557962390
    },
    {
        "content": "<p>Is it feasible to convert all xhtml to Cannonical XML before assigning it to the JSON property?</p>",
        "id": 165825689,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1558024491
    },
    {
        "content": "<p>It's feasible.  The question is whether the benefit of doing so is worth the cost.  Given that the two different strings of XHTML are semantically, canonically and behaviorally identical, I'm not seeing the benefit.</p>",
        "id": 165827507,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558025866
    },
    {
        "content": "<p>fair enough.  I'm just a bit surprised they don't come from the same source - that the string isn't generated by the same process in both cases. then would never be any question of inconsistencies, or needing to do any conversions.</p>",
        "id": 165833386,
        "sender_full_name": "Nick George",
        "timestamp": 1558029748
    },
    {
        "content": "<p>but yeah, probably not worth worrying about</p>",
        "id": 165833660,
        "sender_full_name": "Nick George",
        "timestamp": 1558029951
    },
    {
        "content": "<p>They do come from the same source, but some fluke of the serialization process is causing them to behave differently.  We could probably chase it and fix it, but it'd fall pretty far down the priority list.</p>",
        "id": 165840681,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558034515
    },
    {
        "content": "<p>I'll add it to my list at some stage</p>",
        "id": 165855048,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558046016
    }
]