[
    {
        "content": "<p>Some languages (e.g. Arabic, Hebrew, etc.) can express their words using the western alphabet.  They can also be expressed in their native script.  E.g.  \"sajal almarid\" vs.  \"سجل المريض\".  Is there a way to flag a particular <a href=\"http://Patient.name\" target=\"_blank\" title=\"http://Patient.name\">Patient.name</a> as one form vs. the other?  I know we have ISO extensions for ideographic vs. syllabic vs. alphabetic (<a href=\"http://hl7.org/fhir/valueset-name-v3-representation.html\" target=\"_blank\" title=\"http://hl7.org/fhir/valueset-name-v3-representation.html\">http://hl7.org/fhir/valueset-name-v3-representation.html</a>).  However, this isn't ideographic - we don't have symbols that reflect a word or concept.  Would the scripted version be alphabetic and the westernized version be syllabic?  Do we need a new code for \"script\"?</p>",
        "id": 174468113,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567094942
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>, is this something you've encountered?</p>",
        "id": 174468126,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567094956
    },
    {
        "content": "<p>Interesting... Aren't Western, Arabic and Hebrew just different forms of alphabets? I find the term \"script\" somewhat confusing.</p>",
        "id": 174468732,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1567095422
    },
    {
        "content": "<p>They are different alphabets.  But there's also a roman alphabet representation of the name (which is used in many places where there are limitations on character types).  The question is how to differentiate the representations.</p>",
        "id": 174471510,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567097607
    },
    {
        "content": "<p>I'd asked for this to be explicit years ago. You differentiate by character set, so if the name is expressed using the Arabic character set it is assumed to be in Arabic, and if in the roman character set then in English. There is no way to know if the two forms of text are phonetic (the case in Arabic - which is what leads to multiple spellings in English for the same work in Arabic for both people and street names) or semantic (rose in the original language and 'Rose' in English) equivalents.</p>\n<p>From a usage perspective you simply display or print the characters - and machine translation between phonetic forms is highly inaccurate and would likely need homophone or related encoding to support lookups.</p>",
        "id": 174479006,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1567102772
    },
    {
        "content": "<p>In FHIR, the character set is always UTF</p>",
        "id": 174479274,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567102954
    },
    {
        "content": "<p>Are you saying to just check the UTF range?  Should we just leverage the existing ABC (alphabetic) code for the Arabic script and the SYL (syllabic) code for the English, or do we need some sort of new code?</p>",
        "id": 174479514,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567103118
    },
    {
        "content": "<p>The reason for computable differentiation is the same as for the original use of these codes in Asia - different formats are appropriate for display/printing/exchange in different contexts</p>",
        "id": 174479599,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567103168
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/languages.html##names\" target=\"_blank\" title=\"http://hl7.org/fhir/languages.html##names\">http://hl7.org/fhir/languages.html##names</a></p>",
        "id": 174492555,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567112702
    },
    {
        "content": "<p>Perfect.  Thank you!</p>",
        "id": 174497168,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567116842
    }
]