[
    {
        "content": "<p>Would it be a bad idea to have different profiles for one resource type, depending on the method used, in this case GET versus POST?<br>\nThe business rules aren't quite the same and we would like to validate against the profile to check that the resource is OK . Or any ideas on how to achieve that, keeping just one profile?</p>",
        "id": 259397929,
        "sender_full_name": "Barbro Vessman",
        "timestamp": 1635431779
    },
    {
        "content": "<p>Is the difference between Read and Create, or between the two different ways to execute a Search?</p>",
        "id": 259398951,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1635432172
    },
    {
        "content": "<p>It is between Read and Create</p>",
        "id": 259402737,
        "sender_full_name": "Barbro Vessman",
        "timestamp": 1635433569
    },
    {
        "content": "<p>It's totally fine to say that what you accept in and what you provide out are slightly different.  You might allow stuff through your front door that you don't support (and will throw away) and you may supplement information you've received or may have data from other sources that will have different behavior than what you take in over your FHIR interface.</p>",
        "id": 259406166,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635435029
    },
    {
        "content": "<p>That said, CapabilityStatement doesn't provide good ways of making these distinctions, so you'd be looking at some sort of supplemental documentation/extensions to point at differentiated profiles per operation.</p>",
        "id": 259406258,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635435062
    },
    {
        "content": "<p>(Note that Vassil's question is because search can happen via POST in addition to GET.)</p>",
        "id": 259406303,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635435080
    },
    {
        "content": "<p>US core has different profiles for read and write on some elements</p>",
        "id": 259463389,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635462058
    },
    {
        "content": "<p>Like what other than mandatory write for the DocumentReference and DiagnosticReport (for Notes)?</p>",
        "id": 259468648,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1635466122
    },
    {
        "content": "<p>I think the mime types supported are different for read and write</p>",
        "id": 259468693,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635466187
    },
    {
        "content": "<p>in US Core we have focused on read and search and don't have separate profiles for writes.  In the Argonaut Argo-write project we have discussed making 'mixin' profiles ( my term) to add the stuff we think is useful for client writes to EHR on top of a US Core profile.  In other words the union of 2 profile like an Observaition write 'mixin' profile  + US Core Weight.   This is untested and not settled.</p>",
        "id": 259480276,
        "sender_full_name": "Eric Haas",
        "timestamp": 1635480152
    },
    {
        "content": "<p>Great answers, thanks everyone!</p>",
        "id": 259488629,
        "sender_full_name": "Barbro Vessman",
        "timestamp": 1635490399
    }
]