[
    {
        "content": "<p>Hi,   I am very new to FHIR and exploring how to begin stepping into this world and had a basic question on data from different sources.    If we are sending data for Patient A to, lets say CMS, and other entities are also sending data for the same patient, does this data get mingled?   I.e., if I searched for this patient, would I see data from source A, source B, etc. or only the data that I/our organization created?    I am just trying to wrap my head around how resources are assigned to a particular ogranization and what the rules/security are involved in who gets to see what data.</p>",
        "id": 246643513,
        "sender_full_name": "Rob Kr",
        "timestamp": 1626812169
    },
    {
        "content": "<p>What CMS does with the resource you send it is completely up to CMS. If you send the data to somebody else they may do something completely different. </p>\n<p>When you query CMS what you get back is defined by CMS. CMS could say, as UserX you are authorized to see all resources that UserX submitted. (Not very useful). Assuming CMS consolidated all data about Patient X from all sources and you are authorized to see Patient X data, then I would expect you'd see the consolidated values.</p>",
        "id": 246643861,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1626812338
    },
    {
        "content": "<p>There are different ways of 'sending' data with FHIR.  If you're 'submitting' claims or prior authorizations or similar things using FHIR, then you're doing that by invoking operations (e.g. Claim/$process).  When you do that, there's no expectation that the system you're sending data to will expose your data for query on a FHIR interface at all.  It'll process the operation and send you a response, but it's entirely possible that the system won't support 'search' at all.</p>\n<p>On the other hand, if you put data on a server using the 'create' (POST) mechanism, then the expectation is that that data will be stored there and, in most cases, the server will support search.  When you search, you'll see all data that's posted to the server that you're allowed to see.  In some cases, a server might 'partition' data such that certain users are only authorized to see data that they themselves have created.  However, if you've got permission, you'll see all data.</p>",
        "id": 246652360,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626815933
    }
]