[
    {
        "content": "<p>I have 2 care plan profiles on a server (HomeCarePlan and MedicationPlan\"), and I need to allow a client to ask a server for distinguish \"this type of CarePlan is not supported by this server\" vs \"there are no instances of this type of CarePlan\". How can the client make that distinction?</p>",
        "id": 218995535,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1607275225
    },
    {
        "content": "<p>So, more generically, when you perform a search, distinguishing between \"there are currently no records that match those criteria\" from \"there's no hope of there ever being any records that match those criteria\".  I suppose a server <em>could</em> include an OperationOutcome with a warning along with its 0-record response.</p>",
        "id": 219007173,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607285246
    },
    {
        "content": "<p>Yes. I suppose I'd make it a bit more assertive - more like \"no records for you\"  vs \"you really came to the wrong place\".<br>\nWhat would be needed to have this solution?</p>",
        "id": 219008833,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1607285785
    },
    {
        "content": "<p>\"wrong place\" is a hard call to make.  Maybe they came to the right place but asked the wrong question.  To have the solution, the server would just need to inspect the search parameters and identify that some would never be satisfiable and decide to populate the OperationOutcome with a warning.  It's not a generic behavior that's defined in the spec or that you could expect most servers to support.</p>",
        "id": 219009166,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607285894
    },
    {
        "content": "<p>yeah, \"wrong place\" is more \"wrong question\". Is there a standardized way to specify that behaviour?<br>\nI see CapStatement. rest.resource.supportedProfile - if the profile is NOT in there, should the server respond with a 418 or something?</p>",
        "id": 219013390,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1607287267
    },
    {
        "content": "<p>You could specify comments in your search parameters, but no computable way.</p>",
        "id": 219018125,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607288742
    },
    {
        "content": "<p>never ever? I mean, isn't this something that should be computable?</p>",
        "id": 219051262,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1607329060
    },
    {
        "content": "<p>There's extension space.  I'm not sure we're looking to add yet more complexity to CapabilityStatement in this area, though it's possible the new profiling approach to CS might help.</p>",
        "id": 219084527,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607350617
    }
]