[
    {
        "content": "<p>How can I represent ' code' values (eg Patient.gender) in a different language? </p>",
        "id": 153850196,
        "sender_full_name": "David Hay",
        "timestamp": 1474469206
    },
    {
        "content": "<p>Codes don't have a language...  they're just coded terms that we agree, by convention, should mean something (ideally, their meaning is some language-independent concept like \"glucose\", or \"female\" — though of course I recognize that these aren't as straightforward as we like to pretend.)</p>",
        "id": 153850208,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1474471106
    },
    {
        "content": "<p>Do you mean, you want the over-the-wire representatation to look different?</p>",
        "id": 153850209,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1474471120
    },
    {
        "content": "<p>we can add trnslations to the code system or value set, and the terminology server can serve them in a language of your choice</p>",
        "id": 153850220,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474472257
    },
    {
        "content": "<p>I'd hope that Josh's answer is the final word - Codes don't have a code system or translation. If you need that it needs to be something else.</p>",
        "id": 153850329,
        "sender_full_name": "Robert McClure",
        "timestamp": 1474543433
    },
    {
        "content": "<p>I think there's a difference between what goes over the wire and what your system does.  With a \"code\", the expectation is that all implementations have a complete copy of the code system locally and are capable of mapping it to an appropriate display.  In theory, we can define a variety of language specific display values for those codes as part of the code system, but that won't affect what goes over the wire.</p>",
        "id": 153850337,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474547754
    },
    {
        "content": "<p>btw - this was a question that came up in my tutorial yesterday.  I'm certainly not proposing that the wire representation should change, but it was an interesting question. And the fact that the responses came so quickly certainly helped my assertion about community responsiveness! Thanks all!</p>",
        "id": 153850518,
        "sender_full_name": "David Hay",
        "timestamp": 1474586736
    },
    {
        "content": "<p>\"In theory, we can define a variety of language specific display values for those codes as part of the code system, but that won't affect what goes over the wire.\"</p>\n<p>There are now language specific display values for codes as part of the code systems. What does this mean: \"that won't affect what goes over the wire\"? What display value shall be used over the wire? Only \"main display\" CodeSystem.concept.display? Or could there alternatively be CodeSystem.concept.designation.value (where the translation of the display is). </p>\n<p>I ended this contemplation when I researched International Patient Summary Implementation Guide. There is an extension StructureDefinition-coding-uv-ips ( <a href=\"http://hl7.org/fhir/uv/ips/StructureDefinition-coding-uv-ips.html\" target=\"_blank\" title=\"http://hl7.org/fhir/uv/ips/StructureDefinition-coding-uv-ips.html\">http://hl7.org/fhir/uv/ips/StructureDefinition-coding-uv-ips.html</a>): \"This profile extends the capabilities of the coding data type to support multi-language designations (display). It relies oon the Translation extension.\"</p>\n<p>Should this extension be used to to put translation of the display over the wire?</p>",
        "id": 153955925,
        "sender_full_name": "Mika Tuomainen",
        "timestamp": 1525423884
    },
    {
        "content": "<p>That wording is poor.  What it should say is \"..., but that won't affect the code sent that provides computable interoperability\".  Also, ips should <em>not</em> be defining an extension to support multi-language designations given that there's already an extension for all strings that would serve this purpose.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 153955950,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525435449
    }
]