[
    {
        "content": "<p>so say I'm a client holding a FHIR document bundle. And it's got a signature, and I want to verify the signature. And I have a handy-dandy FHIR server at my beck and call. How do I get the server to verify it for me?</p>\n<p>presumably an operation...? Any inputs other than the document? Output is boolean true|false? or is there more?</p>",
        "id": 153889239,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494495242
    },
    {
        "content": "<p>which signature are you trying to validate? What purpose are you trying to assure? It could validate as many signatures as possible and return an operationOutcome for each found, indicating what identity the signature was from, success/failure, date/time of that signature, purpose of that signature, and if certificate chain was fully validated. --- There are general IT signature validation services... we should not need to re-invent, but if we do then we should be respectful of their lessons-learned...</p>",
        "id": 153889665,
        "sender_full_name": "John Moehrke",
        "timestamp": 1494583771
    },
    {
        "content": "<p>Well, the first and most obvious use is 'has this document been tampered?' - I'd stick to just that for ow</p>",
        "id": 153889703,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494589274
    },
    {
        "content": "<p>that is what a timestamp signature service does. It just create a digital signature (XML-Sig) for the bits it is given. The purpose is to sign the bits to detect change, and apply a timestamp within the XML-Sig blob, which is part of the signed stuff. So the who-signs is the service, and the purpose of signature is timestamp signature.</p>",
        "id": 153889981,
        "sender_full_name": "John Moehrke",
        "timestamp": 1494880983
    },
    {
        "content": "<p>these services exist on the internet...  aka Digital Postmark  --   <a href=\"https://en.wikipedia.org/wiki/Digital_Postmarks\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/Digital_Postmarks\">https://en.wikipedia.org/wiki/Digital_Postmarks</a> </p>",
        "id": 153889983,
        "sender_full_name": "John Moehrke",
        "timestamp": 1494881133
    },
    {
        "content": "<p>well... they did exist... hard to support a business ahead of the demand...  </p>",
        "id": 153889987,
        "sender_full_name": "John Moehrke",
        "timestamp": 1494881334
    }
]