[
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"195299\">@Luis Maas</span> <span class=\"user-mention\" data-user-id=\"194368\">@Julie Maas</span> I've just run into an issue with my direct implementation. For background, see this page: <a href=\"http://build.fhir.org/versioning.html\" target=\"_blank\" title=\"http://build.fhir.org/versioning.html\">http://build.fhir.org/versioning.html</a>. Sending resources by direct is one of those cases where there's no applicable capability statement on which to determine the version. We can do one of 2 things:<br>\n- require that destinations have different direct destinations for different versions of FHIR<br>\n- require that direct messages include the fhirVersion parameter on the mime type</p>",
        "id": 153971348,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529741807
    },
    {
        "content": "<p>I think the second makes way more sense than the first, so propose that we make the fhirVersion parameter mandatory for direct. Does that make sense to you?</p>",
        "id": 153971349,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529741834
    },
    {
        "content": "<p>yes both would work. you could also express the version in the resource metadata as per the link you provided. the mime type version parameter might be preferable so version doesn't need be an column in directories. If the endpoint supports Direct context, one could also request the capability statement via Direct and use the same versioning semantics as in the above link.</p>",
        "id": 153971384,
        "sender_full_name": "Luis Maas",
        "timestamp": 1529886538
    },
    {
        "content": "<p>good. version in the mime type it is</p>",
        "id": 153971475,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529922332
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195299\">@Luis Maas</span> <span class=\"user-mention\" data-user-id=\"194368\">@Julie Maas</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> the version in the mime type is fine but I would also expect the version to be in the resource.meta so that it isn't lost one the transport wrappers are removed.</p>",
        "id": 153974612,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1531310752
    },
    {
        "content": "<p>you can expect that, but not everyone will</p>",
        "id": 153974615,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531311468
    },
    {
        "content": "<p>You're free to add it in on receipt if you need it too.</p>",
        "id": 153974645,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531317739
    },
    {
        "content": "<p>(And doing it yourself is better for overall interoperability than rejecting data from other systems until they all customize to save you writing a few lines of code...)</p>",
        "id": 153974647,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531317804
    }
]