[
    {
        "content": "<p>Hi,<br>\nCan I ask the community how they are using the diagnosticReport.code element within a pathology lab ? FHIR has this as a mandatory element that uses a LOINC codes as the preferred valueset. We have various use cases that require coded and non-coded values, in addition to 1..* requirements (which we can't support using this element as its 1..1) .  We don't want to enforce the use of any specific Terminology either.<br>\nAny info would be appreciated.<br>\nDave</p>",
        "id": 158042609,
        "sender_full_name": "Dave Henderson",
        "timestamp": 1549902030
    },
    {
        "content": "<p>You can use non-coded with DiagnosticReport.code.text.  If the usecase for multiple codes is representation of the concept in multiple code systems, that's handled by DiagnosticReport.code.coding which is 0..*.  If not, can you expand on having a single report that has multiple codes?  If the codes represent the results within the report, those would be on the Observation.code for the observations contained within the report.</p>",
        "id": 158043010,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549902312
    },
    {
        "content": "<p>The choice of terminology is preferred, but not mandated.  You're free to use what codes are appropriate in your jurisdiction.</p>",
        "id": 158043037,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549902343
    },
    {
        "content": "<p>There are standard extensions to link the DR ( DiagnosticReports) together as well.   <a href=\"http://build.fhir.org/diagnosticreport-profiles.html\" target=\"_blank\" title=\"http://build.fhir.org/diagnosticreport-profiles.html\">http://build.fhir.org/diagnosticreport-profiles.html</a><br>\n I too would like to know the use case for 0..* codes as well since a report is typically about one thing.</p>",
        "id": 158053298,
        "sender_full_name": "Eric Haas",
        "timestamp": 1549910596
    },
    {
        "content": "<p>Thanks for the replies guys. I'll feed back how I've used the diagnoticReport.code within our implementation once it's been agreed. Hopefully this will help others that may be looking at pathology messaging.</p>",
        "id": 158522409,
        "sender_full_name": "Dave Henderson",
        "timestamp": 1550144267
    },
    {
        "content": "<p>Is your pathology report structured or unstructured data (text blob, pdf, etc.)?  If structured, each observation should be LOINC or other code system encodable.  Do you have another code system required in your area?  Are you talking questions or answers too?</p>",
        "id": 160135679,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1551907307
    }
]