[
    {
        "content": "<p>I'm trying to determine the best resource to use to request a list of all medications on the hospital medication discharge list provided to the patient - i.e., some include new prescriptions, still others are to continue at home (either over-the-counter or based on prescriptions previously filled).</p>",
        "id": 170578786,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1562791934
    },
    {
        "content": "<p>best resource to ask for the list, or the best resource to contain that list?</p>",
        "id": 170584898,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562797647
    },
    {
        "content": "<p>Right - so how do I model that in FHIR R4? Is the list a MedicationStatement with a status = community [note that MedicationStatement.category references Medication status codes (one of which is \"community\" - <a href=\"http://hl7.org/fhir/medicationstatement-definitions.html#MedicationStatement.category]\" target=\"_blank\" title=\"http://hl7.org/fhir/medicationstatement-definitions.html#MedicationStatement.category]\">http://hl7.org/fhir/medicationstatement-definitions.html#MedicationStatement.category]</a> and assure the expression requests that MedicationStatement  with dateAsserted as the time of discharge from the hospital?</p>",
        "id": 170593035,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1562806103
    },
    {
        "content": "<p>So what list would I request?</p>",
        "id": 170593041,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1562806137
    },
    {
        "content": "<p>I guess I would expect to ask for the \"list\" referencing the best resource to contain it - or am I missing something?</p>",
        "id": 170593058,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1562806180
    },
    {
        "content": "<p>If you are looking for orders for medications, then you should use the MedicationRequest resource.  This is a list on discharge of all of the medications a patient is supposed to be taking.</p>",
        "id": 170593929,
        "sender_full_name": "Melva Peters",
        "timestamp": 1562807518
    },
    {
        "content": "<p>Agree - but the list I'm seeking contains meds that have been ordered to be taken as outpatient after discharge AND meds that are to be continued at home for which new orders are not being written (some of them are over-the-counter and don't require orders).  So my first approach was to use MedicationRequest with Medication.Request.intent =  plan or order - i.e., the \"plan\" indicates the meds on the list recommended to the patient and the \"order\" includes those with actual prescriptions - hence a full list of all meds with those criteria (and with category = community).  Today I presented that option to our quality measure group and received considerable feedback that there has to be an easier way and that hospitals aren't necessarily implementing that way.  The group wants something comparable to a CDA discharge medication list.  Hence, my question seeking an alternative.</p>",
        "id": 170594171,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1562807838
    },
    {
        "content": "<p>HL7 AU has a profile for a medication list. <a href=\"http://build.fhir.org/ig/hl7au/au-fhir-base-stu3/StructureDefinition-au-medlist.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/hl7au/au-fhir-base-stu3/StructureDefinition-au-medlist.html\">http://build.fhir.org/ig/hl7au/au-fhir-base-stu3/StructureDefinition-au-medlist.html</a> <br>\nYour list could be populated with MedicationRequests. The list resource could be created, curated and stored with a link to the discharge encounter.</p>",
        "id": 170598827,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1562815946
    },
    {
        "content": "<p>I was thinking of it as a list but now I see this as a composition which contains <br>\n- medRequests (if that is what your requirements say you should keep), <br>\n- MedDispenses (if that is what your requirements say you should keep, and keeping the link to the Requests), <br>\n- MedAdmins(if your requirements say it is desirable and/or you can link those to requests/dispenses), <br>\n- MedStatements (to complement the others)<br>\nWe should be looking at an IHE profile on this - later. This is my current preference from prior research and discussions</p>",
        "id": 170618297,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562838637
    },
    {
        "content": "<p>. I do have one open question: How would we capture the notion of a \"treatment\" as a glue between the different elements?<br>\nsome treatments are known from the existence of a prescription, others are from the existence of a dispense, others from a statement.. if we do not have a \"treatment\" object, the reconciliation is harder.</p>",
        "id": 170618370,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562838717
    },
    {
        "content": "<p>this notion of \"treatment\" is not a common requirement in pharmacy workflows. Or rather, it gets confused with the prescription, this is why we abusively say \"status of this prescription is complete\" when we should say \"status of the treatment initiated by this prescription is complete\".</p>",
        "id": 170618473,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562838796
    },
    {
        "content": "<p>going back to the list: Normally any Medication List would have some need for authorship / context / coherence so it is more in the space of Composition than List IMO.</p>",
        "id": 170618591,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562838904
    },
    {
        "content": "<p>Discharge Medication list sounds like an example of something that has an author and clinical context and validity.</p>",
        "id": 170618630,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562838946
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> <br>\nSometimes people want a list as a document and sometimes as a list. We are working on a design for a medication list resource that uses Medication.source as author and can be included in various documents, including a medication list document. Using List allows recording information about changes.<br>\nSee <a href=\"https://github.com/AuDigitalHealth/ci-fhir-stu3/tree/master/output/SharedMedicinesList\" target=\"_blank\" title=\"https://github.com/AuDigitalHealth/ci-fhir-stu3/tree/master/output/SharedMedicinesList\">https://github.com/AuDigitalHealth/ci-fhir-stu3/tree/master/output/SharedMedicinesList</a></p>",
        "id": 170696785,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1562910778
    },
    {
        "content": "<p>in IHE we had some discussions, perhaps complementing this. here are some points:<br>\n1. We expect there to be a process for reconciliation and producing a \"formal medication list\". if you are performing that process, your input is more likely a list, output more likely a document/composition.</p>",
        "id": 170701126,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562916517
    },
    {
        "content": "<p>2. \"Medication.source\"? You mean \"List.source\"?<br>\nin the cases where we want composition, composition.attester should be equivalent. I would like to see device as a possible attester in composition.</p>",
        "id": 170701135,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562916536
    },
    {
        "content": "<p>3. Indeed it seems List is richer in terms of change tracking. And Composition is more about the \"finished\" document. i think there may be a middle ground there to explore</p>",
        "id": 170701398,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562916858
    },
    {
        "content": "<p>btw, <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> I like that IG. which template / framework did you use? Lloyd's ? Eric's?</p>",
        "id": 170705792,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562921655
    },
    {
        "content": "<p>Composite is always an option for sharing data, but should never be a requirement</p>",
        "id": 170815853,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563074006
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> </p>\n<blockquote>\n<p>2. \"Medication.source\"? You mean \"List.source\"?</p>\n</blockquote>\n<p>Yes I meant List.source <span aria-label=\"embarrassed\" class=\"emoji emoji-1f633\" role=\"img\" title=\"embarrassed\">:embarrassed:</span></p>\n<blockquote>\n<p>which template / framework did you use? </p>\n</blockquote>\n<p>We started from Eric's <a href=\"https://github.com/Healthedata1/IG-Template\" target=\"_blank\" title=\"https://github.com/Healthedata1/IG-Template\">Healthdata1 IG-Template</a>.</p>",
        "id": 170855123,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1563149642
    },
    {
        "content": "<p>Back to <span class=\"user-mention\" data-user-id=\"192672\">@Floyd Eisenberg</span> :<br>\n1. if you want something like a \"CDA discharge medication list\" then you are picking a flavour of a list - and flavours are context-dependent and may not be that interoperable. The International Patient summary may have another way to form such a list, and many countries have their own rules for that. For example if you make a list based on prescribed meds, and I make a list with actually dispensed meds, they may match or not.<br>\n2. For this reason, in IHE we have a Medication List transaction which is just \"get the raw data, I will filter and reconcile on my side\". <br>\nAs long as there is no universal flavour of \"what should be in a medicatino list\" you must prepare for the fact the only semantically solid ground is the \"ingredients\" - prescription, dispense... and these have different meanings. <br>\nIf you want to see how different those medication lists are, here is one overview:<br>\n<a href=\"https://www.nist.gov/sites/default/files/nist_ncpdp_medication_rec_and_stds_overview.pdf\" target=\"_blank\" title=\"https://www.nist.gov/sites/default/files/nist_ncpdp_medication_rec_and_stds_overview.pdf\">https://www.nist.gov/sites/default/files/nist_ncpdp_medication_rec_and_stds_overview.pdf</a></p>",
        "id": 171050564,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1563342025
    },
    {
        "content": "<p>If you want to make a list, perhaps start checking the International Patient Summary.</p>",
        "id": 171050566,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1563342040
    },
    {
        "content": "<p>IHE will be implementing this, once the FHIR resources are a bit more stable</p>",
        "id": 171050587,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1563342110
    }
]