[
    {
        "content": "<p>Does anyone have any advice on how to capture both the time a discharge is ordered <em>and</em> when the discharge actually occurred? </p>\n<p>I'm assuming representing the actual discharge <em>event</em> as <code>Encounter.period.end</code> makes the most sense, but I'm less clear on the discharge order. Utilizing the <code>ServiceRequest</code> Resource makes some sense, but doesn't quite fit the description given in the Boundaries/Relationships section of the documentation:</p>\n<blockquote>\n<p>ServiceRequest is a record of a proposal/plan or order for a service to be performed that would result in a <code>Procedure</code>, <code>Observation</code>, <code>DiagnosticReport</code>, <code>ImagingStudy</code> or similar resource</p>\n</blockquote>\n<p>None of those Resources would result from the discharge order, unless the discharge itself is considered a <code>Procedure</code>.</p>\n<p><code>Task</code> also seems like a potential fit, but appears to be more commonly used in application workflows. Anyone have a recommendation?</p>",
        "id": 212710768,
        "sender_full_name": "Matt Rouhana",
        "timestamp": 1602172433
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 212713334,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602173445
    },
    {
        "content": "<p>Still looking for some direction here, if anyone has suggestions. I'm leaning towards either using <code>ServiceRequest</code> or creating an <code>Encounter</code> extension for the time of discharge order.</p>",
        "id": 215855715,
        "sender_full_name": "Matt Rouhana",
        "timestamp": 1604674242
    },
    {
        "content": "<p>preface to say that I'm not going to have any useful advice, but how are application workflows different from administrative workflows?</p>",
        "id": 215856583,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1604674595
    },
    {
        "content": "<p>If the only data element missing were to be 'dateTimeOrdered' then an extension may be in order. If you're also capturing who ordered it, if that order could potentially be cancelled or modified, then some separate FHIR resource may be called for. Note that seriveRequest only captures the fact that there is a request, but doesn't actually ask any party to do something, so you'd need Task in addition to ServiceRequest.</p>",
        "id": 215857012,
        "sender_full_name": "René Spronk",
        "timestamp": 1604674769
    },
    {
        "content": "<p>And to add another wrinkle to this, there are discussions about a Patient Movement resource that would potentially capture more details about a discharge well beyond what is in Encounter.</p>",
        "id": 215866239,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1604678650
    },
    {
        "content": "<p>That would get my thumbs down - way too exotic to be part of the \"80%\".</p>",
        "id": 215866807,
        "sender_full_name": "René Spronk",
        "timestamp": 1604678898
    },
    {
        "content": "<p>\"Too exotic\" in what sense? Current existing functionality for discharge management seems to be already beyond anything Encounter can manage by itself. Adding ServiceRequest(s) and Task(s) may be able to approximate it, but whether that, or a possible PatientMovement is \"too exotic\" is hard to determine, I think...</p>",
        "id": 215869516,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1604680062
    },
    {
        "content": "<p>I'm just speaking from my own experience, so consider my thumbs down a starter opinion (which could change). In some European systems they manage movements, but there are only a very few systems where these would need to be archived. But we may be talking about different \"movements\" anyway..</p>",
        "id": 215870146,
        "sender_full_name": "René Spronk",
        "timestamp": 1604680330
    },
    {
        "content": "<p>Yes, \"movement\" has many different meaning. <a href=\"https://confluence.hl7.org/display/PA/Encounter+History+and+Movements\">This is what is under discussion</a>, in early stages...</p>",
        "id": 215870644,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1604680552
    },
    {
        "content": "<p>Thanks for the feedback. In my case, the only missing element is the time the discharge was ordered, so I think I'm going to go with an extension. In the event that we need to capture additional detail, I'll reconsider.</p>",
        "id": 216094579,
        "sender_full_name": "Matt Rouhana",
        "timestamp": 1604933706
    }
]