[
    {
        "content": "<p>Hello everyone,<br>\nin my implementation i have modeled several diagnosis as Observation, due to the fact that it is part of an enrollment in a clinical trial and i have the need to model the presence/absence/suspect/unknown of the diagnosis. In the case of a confirmed present condition, i also have the need to model several other informations about the particular diagnosis, such as severity or presence of a symptom. What is the recommended way to model these informations?</p>\n<p>Thanks in advance, and sorry for my broken english!</p>",
        "id": 278530503,
        "sender_full_name": "Armando De Chiara",
        "timestamp": 1649670734
    },
    {
        "content": "<p>Your English is great! Have you considered using the condition resource here? It allows you to say things like this condition has been confirmed or refuted, and it also allows you to  directly indicating severity  (<a href=\"https://www.hl7.org/fhir/condition.html\">https://www.hl7.org/fhir/condition.html</a>)</p>",
        "id": 278553920,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1649684081
    },
    {
        "content": "<p>I guess the question will boil down to the difference in using <em>Observation</em> vs. <em>RiskAssessment</em>.</p>",
        "id": 278556153,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1649685060
    },
    {
        "content": "<p>Again, why not Condition? Just want to make sure this has been ruled out for some clearly stated reason.</p>",
        "id": 278557290,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1649685526
    },
    {
        "content": "<p>While TS is not answering, my impression is Armando wanted to discuss <em>Condition.stage</em> vs. <em>Observation</em> vs. <em>RiskAssessment</em>. <br>\nFor example males have higher risk of having a cardiac disease.  How to code that?</p>",
        "id": 278561482,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1649687221
    },
    {
        "content": "<p>RiskAssessment is quite specialized - it's about the probability of developing a condition, which doesn't sound like Armando's use-case.</p>\n<p>Condition sounds like the right resource.</p>",
        "id": 278567215,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649689459
    },
    {
        "content": "<p>I had considered Condition as the resource. The problem is that for every disease considered in my application i have to convey not only that the condition has been refuted or confirmed, but also that the condition was only suspected and never confirmed, and the case where the clinician simply does not have any information about that particular diagnosis. This last bit of information is the one that makes me wonder about the use of the Condition resource.</p>\n<p>Also in the documentation it is stated that the assertion of condition absence, common in checklists for clinicial trials \"should NOT be captured using the Condition resource but should instead be captured using QuestionnaireResponse or Observation\" (i'm quoting the documentation).</p>\n<p>That is why i had ruled out the use of Condition and was using the Observation instead.</p>",
        "id": 278572849,
        "sender_full_name": "Armando De Chiara",
        "timestamp": 1649691573
    },
    {
        "content": "<p>So more of a checklist of conditions where, for each condition, you can say \"Has it\", \"Doesn't have it\", \"Might have it\", \"No clue\"?</p>\n<p>In that case, the initial data capture would probably be a QuestionnaireResponse as part of a CRF, and the data would then propagate to Observation.</p>",
        "id": 278574376,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649692171
    },
    {
        "content": "<p>Ok, so i'll continue to use Observation. Thanks.</p>\n<p>I'm going to take advantage of the occasion and ask another thing. How do i capture disease severity using Observation resource? It is recommended to use another Observation or to use the Observation.component attribute?</p>",
        "id": 278665009,
        "sender_full_name": "Armando De Chiara",
        "timestamp": 1649753843
    },
    {
        "content": "<p>It depends.  If the assertion of disease and severity are being made simultaneously by the same individual and same 'method', then component is appropriate.  If the severity might be determined later and/or there might be multiple determinations of severity, then a distinct Observation with a 'focus' of the original condition Observation is better.  A third option is to pre-coordinate the severity into the Observation value.</p>",
        "id": 278716075,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649780259
    }
]