[
    {
        "content": "<p>(This issue is the subject of <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15123\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15123\">GF#15123</a> and <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=18064\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=18064\">GF#18064</a>. It is better presented in the latter. Earlier discussions on this can be found at <a href=\"#narrow/stream/65-ihe/subject/Request.20for.20DICOM.20identifier.20type\" title=\"#narrow/stream/65-ihe/subject/Request.20for.20DICOM.20identifier.20type\">https://chat.fhir.org/#narrow/stream/65-ihe/subject/Request.20for.20DICOM.20identifier.20type</a>)</p>\n<p>According to the requirements of the Identifier datatypes, identifiers which are OIDs must use the urn:ietf:rfc:3986 system, and encode the value as uri:oid:1.2.3. (The equivalent applies to UUIDs and URI identifier values as well.) This means that if a resource could be identified by more than one OID (for example, an ebRIM ExternalIdentfier, a CDA id, a DICOM UID) there is no way to distinguish those OIDs based on system.</p>\n<p>In ImagingStudy, knowing which of potentially multiple OIDs is the DICOM Study Instance UID is important, as that OID is then used to query the image archive for retrieving the image. In other cases, I expect that knowing what a particular OID identifies will be similarly useful. </p>\n<p>There are two general approaches being discussed to address this: use Identifier.type to recognize that a specific OID has a particular use (the solution proposed in <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=18064\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=18064\">GF#18064</a> to address the ImagingStudy issue), or relax the requirement on Identifier system to allow systems other than RFC3896 for OIDs (and UUIDs and URIs).</p>\n<p>I am ready to submit a harmonization proposal for the Identifier.type solution, but during today's Vocab call, it was recognized that this is going to be a general issue for anyone using OIDs, UUIDs, and URIs as identifiers -- medicines, licenses, organizations, etc. What gets decided will likely set the pattern for the future... So, I'm raising the issue here.</p>\n<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> , <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> , <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> , <span class=\"user-mention\" data-user-id=\"191960\">@Brad Genereaux</span>, <span class=\"user-mention\" data-user-id=\"195336\">@Eric Martin</span>, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 154011246,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1540249499
    },
    {
        "content": "<p>I believe that the patterning  of using identifier.type to distinguish the type of a UUID, etc. is completely consistent with the intent of identifier.type.  Hence, I strongly support the proposed solution for DICOM UID as per in <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=18064\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=18064\">GF#18064</a>.  Other types of OIDs, UUIDs, and URIs would define a value for identifier.type that indicates the meaning of the identifier item.</p>",
        "id": 154011252,
        "sender_full_name": "Eric Martin",
        "timestamp": 1540253149
    },
    {
        "content": "<blockquote>\n<p>relax the requirement on Identifier system to allow systems other than RFC3896 for OIDs (and UUIDs and URIs)</p>\n</blockquote>",
        "id": 154011260,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540259855
    },
    {
        "content": "<p>that is not a requirement. Specifically, we do not say 'anything that meets the OID regex SHALL be treated as a plain OID\". All we say is that \"Plain OIDs are represented this way\".</p>",
        "id": 154011261,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540259907
    },
    {
        "content": "<p>if DICOM wanted to declare that all OIDs issued under the DICOM arrangements for OIDs were in the namespace <a href=\"http://dicom.nema.org/OID\" target=\"_blank\" title=\"http://dicom.nema.org/OID\">http://dicom.nema.org/OID</a> and the value was just the plain OID, then that would not be non-conformant.</p>",
        "id": 154011262,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540259980
    },
    {
        "content": "<p>it might be tricky for people to get right though; I'm not saying I favor this approach over using the type - I'm just pointing out that it's a legal option.</p>",
        "id": 154011263,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540260016
    },
    {
        "content": "<p>When I read \"If the identifier value itself is naturally a globally unique URI (e.g. an OID, a UUID, or a URI with no trailing local part), then the system SHALL be \"urn:ietf:rfc:3986\" ...\" I don't exactly get that interpretation (or at least it's not the first one that I came away with when I read it).  I think it's unclear what the specific boundaries are on what \"is <strong>naturally</strong> a globally unique URI\" (emphasis mine) is referring to, and I'm not sure if that is or isn't the same thing as \"a plain OID\" (which isn't mentioned).  So I agree it will be tricky to get that right.  I think we should <strong>at least</strong> try to make the language clearer.  If the rule is actually about \"plain OIDs\" than we at least need to say that and say what a \"plain OID\" is.  And if we end up using a general 'type' code and specific system URIs in some cases and then in others (for OIDs, etc.) we use a pretty much \"fixed\" value of 'system' and instead rely on the 'type' code for specificity, I think that's at least quite messy and confusing, and I would like to be able to be more consistent and avoid that.  Even though Grahame isn't necessarily in favor, I think if using a specific 'system' URI is a \"legal\" option then it's probably a better way to go.</p>",
        "id": 154011279,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1540265649
    },
    {
        "content": "<p>ok we could clarify that language. For me, a DICOM assigned OID with a particular meaning is not 'naturally a globally unique identifier\" but I agree that this language is quite ambiguous</p>",
        "id": 154011289,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540275910
    },
    {
        "content": "<p>so Grahame, you are seeming to indicate that - where no specific namespace is available, urn:ietf:rfc:3986 shall be used. I think that would make it clear and make way for more specific namespaces to appear as appropriate.</p>",
        "id": 154011389,
        "sender_full_name": "John Moehrke",
        "timestamp": 1540297147
    },
    {
        "content": "<p>Making clarifications in a \"SHALL\" statement in a normative portion of the specification is dangerous territory right now.  I don't think we can change the sentence, but perhaps we can add a clarifying sentence that explains \"naturally\".</p>",
        "id": 154011419,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540306246
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I had the same concern. To me, that sentence is just simply wrong if the intent was consistent with <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> comment. But if you all can craft words around what \"naturally\" and being an OID means, I guess go for it.</p>\n<p>As for which approach is better, I agree it is a close call and the  <a href=\"http://build.fhir.org/v2/0203/index.html\" target=\"_blank\" title=\"http://build.fhir.org/v2/0203/index.html\">v2 Identifier Type</a>  code system Type uses is all over the map regards including specific identifier \"types\" (Amercian Express and Discover, versus also Bank Card Number). Please confirm we want to allow implementers to \"do it either way\" and then continue to allow very specific types <strong>and</strong> the general class so that you'll need to look at both the type and the system URI to figure out what identifier you have.</p>",
        "id": 154011452,
        "sender_full_name": "Robert McClure",
        "timestamp": 1540314854
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , just so we're clear: These aren't DICOM (the SDO) assigned OIDs. We're talking about implementation-generated OIDs used to identify DICOM entities like an image or a study. (DICOM does have DICOM-assigned OIDs to identify certain concepts, but these aren't the ones at issue here.)</p>",
        "id": 154011466,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1540315577
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> you'll note that I didn't use the words 'dicom assigned OIDs'<br>\n<span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> I agree the v2 type is less than ideal - but any take on identifier type has been less than heavenly<br>\n<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I agree about the wording and process</p>",
        "id": 154011585,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540327563
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>:</p>\n<blockquote>\n<p>you'll note that I didn't use the words 'dicom assigned OIDs'</p>\n</blockquote>\n<p>I thought you had:</p>\n<blockquote>\n<p>For me, a DICOM assigned OID with a particular meaning is not 'naturally a globally unique identifier\"</p>\n</blockquote>\n<p>However, as long as we're clear about the identifiers we're discussing, all is good.<br>\nTo make sure I understand, we can't change:</p>\n<blockquote>\n<p>If the identifier value itself is naturally a globally unique URI (e.g. an OID, a UUID, or a URI with no trailing local part), then the system SHALL be \"urn:ietf:rfc:3986\", and the URI is in the value (OIDs and UUIDs using urn:oid: and urn:uuid: - see note on the V3 mapping and the examples).</p>\n</blockquote>\n<p>But, we can add a sentence along the lines of \"Certain uses of OIDs, such as DICOM entity UIDs, are not naturally, globally unique URIs.\"</p>",
        "id": 154011607,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1540328926
    },
    {
        "content": "<p>oops. so I did. But when I was being more careful I said:</p>\n<blockquote>\n<p>OIDs issued under the DICOM arrangements for OIDs</p>\n</blockquote>\n<p>so yes, we could add a clarifying sentence like that</p>",
        "id": 154011621,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540331571
    },
    {
        "content": "<p>I think we need to explain what's meant by \"naturally\" - listing a single exception isn't enough.  We need to explain what the criteria is so we can differentiate future cases too - after all, this is a SHALL statement, so there needs to be determinism around when it applies.</p>",
        "id": 154011632,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540333140
    },
    {
        "content": "<p>II Workgroup approved as a submitted recommended change in <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19602\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19602\">GF#19602</a> --- <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  can we get this into R4?</p>",
        "id": 154014694,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541093258
    },
    {
        "content": "<p>I would love to, but I'm pretty sure that ANSI would consider that a substantive change.  What we could do is add a separate sentence noting that there will be specific Guidance for Dicom and similar identifiers coming in R5.  That wouldn't be a substantive change and would at least give implementers a cue that there's going to be different rules.  We can also apply the approved change as soon as R5 publications are open.</p>",
        "id": 154014699,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541093725
    },
    {
        "content": "<p>I think we can clarify what naturally means</p>",
        "id": 154014771,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541096791
    },
    {
        "content": "<p>Do you have proposed language?</p>",
        "id": 154014793,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541098789
    },
    {
        "content": "<p>\"A natural globally unique URI is one for which a more appropriate identifier system, such as urn:dicom:uid for DICOM entity UIDs, does not exist.\"</p>",
        "id": 154014799,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1541099303
    },
    {
        "content": "<p>That's the weirdest definition of \"natural\" I've ever seen...  It also effectively guts the \"SHALL\" because \"more appropriate\" is totally subjective.</p>",
        "id": 154014806,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541099903
    },
    {
        "content": "<p>If the US president can use an executive order to reverse the meaning of a bill, so can I.</p>",
        "id": 154014809,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1541100259
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> don't you mean \"so SHALL I\"?</p>",
        "id": 154014810,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1541100309
    },
    {
        "content": "<p>add \"Naturally globally unique identifiers are those for which no system has been assigned, and where the value of the identifier is reasonably expected to not be re-used - typically, absolute URIs of some kind\"</p>",
        "id": 154014814,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541100543
    },
    {
        "content": "<p>The use of \"natural\" in the original phrase is pretty weird and, ah, unnatural. What does is it supposed to convey?</p>\n<blockquote>\n<p>If the identifier value itself is naturally a globally unique URI, ... then the system SHALL be \"urn:ietf:rfc:3986\", ...</p>\n</blockquote>\n<p>What is an unnaturally globally unique URI? What is natural about a URI? Can I get organic URIs, free-range URIs raised on mountain slopes and fed only natural spring water?</p>\n<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>, touché.</p>",
        "id": 154014815,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1541100546
    },
    {
        "content": "<p>Although I find the second part of Grahame's statement a little odd (perhaps re-assigned rather than re-used would help), I can go with it. Personally, I'd like a reference somewhere near there to DICOM UIDs, but that isn't a blocker.</p>",
        "id": 154014821,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1541100851
    },
    {
        "content": "<p>Can we make [system has been assigned] a link to the \"systems\" page - that makes things nicely clear.  Then we can define NamingSystems for the DICOM ones.</p>",
        "id": 154014830,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541101144
    },
    {
        "content": "<p>yes</p>",
        "id": 154014834,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541101239
    },
    {
        "content": "<p>dicom is in the naming system now</p>",
        "id": 154014836,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541101633
    },
    {
        "content": "<p>and the CR has proposed wording see <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19602\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19602\">GF#19602</a></p>",
        "id": 154014838,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541101666
    },
    {
        "content": "<p>we are only talking about things that don't have a naming system defined, and look like an OID</p>",
        "id": 154014839,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541101714
    },
    {
        "content": "<p>yes but 19602 can't propose substantive changes to normative content</p>",
        "id": 154014844,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541102218
    },
    {
        "content": "<p>so the wording can't stand as is</p>",
        "id": 154014845,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541102230
    },
    {
        "content": "<p>it seemed in this thread it was understood that this proposed text was the meaning of the current wording. That is the clarificaiton of 'naturally'</p>",
        "id": 154014846,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541102308
    },
    {
        "content": "<p>Lloyd challenged that</p>",
        "id": 154014848,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541102343
    },
    {
        "content": "<p>and DICOM has indicated that the OIDs used in DICOM are 'special'... thus not natural...  :-)</p>",
        "id": 154014849,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541102437
    },
    {
        "content": "<p>Lloyd did not challenge the idea, just the specific wording</p>",
        "id": 154014850,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541102462
    },
    {
        "content": "<p>ah, we tried in <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19602\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19602\">GF#19602</a> to be as clear and generous as possible...</p>",
        "id": 154014851,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541102521
    },
    {
        "content": "<p>but we did recongize it as just a recommendation for FHIR-I to start from</p>",
        "id": 154014852,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541102540
    },
    {
        "content": "<p>You can't change the sentence that contains the word \"SHALL\".  You can add a sentence that clarifies the meaning of \"naturally globally unique identifiers\" in a way that seems at least semi-intuitive.  If we leverage Grahame's wording (possibly changing re-used to re-assigned) and include a link to our definition of  identifier naming systems, that doesn't undercut the SHALL.  If you're sending a GUID or OID or something similar and there isn't a defined namespace on that page for it, you SHALL use the ietf naming system.</p>",
        "id": 154014853,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541102543
    },
    {
        "content": "<p>yes, that is the spirit</p>",
        "id": 154014854,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541102584
    },
    {
        "content": "<p>Im unclear how adding clarity within the sentence (within comma clarification) is objectionable, yet a second sentence giving the same clarification is not.. but what ever gets us the right resting place.</p>",
        "id": 154014855,
        "sender_full_name": "John Moehrke",
        "timestamp": 1541102681
    },
    {
        "content": "<p>If I understand where we landed, I'm good with it.</p>",
        "id": 154014888,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1541105182
    },
    {
        "content": "<p>Where are we on applying <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19602\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19602\">GF#19602</a>? Is this going to get into R4 or not?</p>",
        "id": 154019846,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1542737847
    },
    {
        "content": "<p>I thought it had made it in. but no. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> / <span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span>  ? <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> / <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> FHIR-I call on this?</p>",
        "id": 154019955,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1542776984
    },
    {
        "content": "<p>We can take it up on Monday.  (We didn't have sufficient people for a call this past Monday.)</p>",
        "id": 154020265,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542823002
    }
]