[
    {
        "content": "<p>question from an implemeter: Have you come across any implementations that are using a FHIR architecture to implement coordinated care / care plans?  By this I mean something that:<br>\n路         Defines the condition being treated and the goals of the care plan.<br>\n路         Includes tasks that are intended to meet those goals.<br>\n路         Includes scheduling of those tasks and assignment of participants to those tasks.<br>\n路         Allows observations to be recorded that can be used to test whether the goals in the care plan are being achieved.</p>",
        "id": 153840176,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469077259
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, we, at Health Samurai, are working on FHIR mapping for such a system - Narus Health Solution. This is a custom care management application designed specifically around palliative care, capturing the patient's \"care\" related needs in addition to their \"clinical\" needs.</p>",
        "id": 153842045,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1470134060
    },
    {
        "content": "<p>Narus common model is 'Issue-Goal-Action-Outcome'. Now we are applying FHIR architecture to this model. <br>\nThe decision was made to keep the issue as a <code>CarePlan.description</code> and use separate care plans for each of the issues.<br>\nHere is an example:<br>\n<strong>Issue</strong>: Patient has no primary caregiver<br>\n<strong>Goal</strong>: Identify primary caregiver<br>\n<strong>Actions</strong>:</p>\n<ul>\n<li>Determine if this support deficit puts patient at increased risk for medical complications</li>\n<li>Involve Social Worker on this issue</li>\n<li>Involve Nurse Care Manager on this issue</li>\n<li>Assist patient to identify possible primary caregivers</li>\n</ul>",
        "id": 153842046,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1470134606
    },
    {
        "content": "<p>thx</p>",
        "id": 153842089,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470172317
    }
]