[
    {
        "content": "<p>Looking for some details and input for how to connect documentreference entries using the relatesTo element. <br>\nThe use case we are needing to accommodate is this - User creates a document entry in the system and saves. <br>\nThis is saved into the database and assigned an ID, for example ID 25. <br>\nUser then selects to append to the original document (ID 25) by entering an amendment. <br>\nAmendment is saved into the database and assigned an ID, for example ID 45. <br>\nSo these are saved as unique, separate entries but we have a designation in the db that links the documents together.<br>\nIn our system we would present these together for viewing to show the complete documentation. <br>\nOur understanding of the FHIR spec is that we would use the relatesTo element on the second document, <br>\n the amendment (ID 45) using a code of \"appends\" and target reference to the first original document (ID 25).  <br>\nQUESTIONS: <br>\nIs our interpretation accurate? <br>\nIs the relatesTo element the best way to connect these partial documents?<br>\nHow do we indicate on the first original documentreference entry (ID 25) that there is a second, <br>\namendment documentreference entry (ID 45) that completes the document and needs to be included for a full view?</p>",
        "id": 269305444,
        "sender_full_name": "Amy Allen",
        "timestamp": 1643136934
    },
    {
        "content": "<p>I think the solution is correct. You can use _revinclude: <code>DocumentReference?_id=25&amp;_revinclude=DocumentReference.relatesto</code></p>",
        "id": 269308718,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1643138257
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"413699\">Amy Allen</span> <a href=\"#narrow/stream/179166-implementers/topic/DocumentReference.20relatesTo/near/269305444\">said</a>:</p>\n<blockquote>\n<p>How do we indicate on the first original documentreference entry (ID 25) that there is a second, <br>\namendment documentreference entry (ID 45) that completes the document and needs to be included for a full view?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"413699\">@Amy Allen</span>,  In case <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>'s answer isn't clear enough, there is no need to update the first DocumentReference to indicate it has been amended. You can structure your search (as indicated) to that anything that relatesTo the DocumentReference is returned in the results. However, depending on whether your \"amended\" means \"adds further content,\" or \"replaces previous content\" you may want to mark the orginal DocumentReference as with superseded status.</p>",
        "id": 269311370,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1643139317
    },
    {
        "content": "<p>Thank you for the response! I am taking this back to my team for discussion.</p>",
        "id": 269326877,
        "sender_full_name": "Amy Allen",
        "timestamp": 1643145893
    },
    {
        "content": "<p>Other resources (such as Composition and Citation) had the relatesTo element changed to use RelatedArtifact datatype in R5.  RelatedArtifact.type has more codes available including amends | amended-with | appends | appended-with so you can document the relations in either direction. This was necessary because sometime the related artifact is not a FHIR Resource so you can not always control the preferred direction of relationship.</p>",
        "id": 269389145,
        "sender_full_name": "Brian Alper",
        "timestamp": 1643193170
    },
    {
        "content": "<p>Is there a ticket to apply this to DocumentReference? We should be consistent. ( <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> )</p>",
        "id": 269415237,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1643205720
    },
    {
        "content": "<p>there is not a ticket. I didn't know that Composition did that. Unfortunate that RelatedArtifact includes a .document (Attachment) inside. This is going to make relatesTo rather confusing. Even in Composition this seems problematic. I think this use of the metdatatype should be thought thru a bit more. Might need a more trim version of RelatedArtifact that doesn't have this blob inside.</p>",
        "id": 269416848,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643206304
    },
    {
        "content": "<p>If the related artifact is available as an attachment, how would you handle it otherwise?   Or are you just suggesting RelatedArtifact.attachment would be a better element name than RelatedArtifact.document where the datatype for that element is Attachment?</p>",
        "id": 269436992,
        "sender_full_name": "Brian Alper",
        "timestamp": 1643213527
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 269437029,
        "sender_full_name": "Brian Alper",
        "timestamp": 1643213544
    },
    {
        "content": "<p>We need to be <em>very</em> careful with RelatedArtifact.  It should NOT be widely used as it's actually contrary to FHIR best practices.  There are a few limited places where it makes sense (e.g. Citation), but it should absolutely not be something that sees widespread use.</p>",
        "id": 269446651,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643217100
    },
    {
        "content": "<p>At a quick glance, if it's in composition, it should be in DocumentReference. However, why we need it, and not just use DocumentReference isn't clear.</p>",
        "id": 269447065,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1643217270
    },
    {
        "content": "<p>RelatedArtifact is a Datatype and DocumentReference is a Resource.  If the relation between artifacts does not require its own resource for exchange as a shareable unit, it seems preferable to use a Datatype to a new Resource.  I believe the RelatedArtifact Datatype was developed for relations between artifacts in resources that are often not patient-specific (PlanDefinition, Library, Citation, Evidence, etc.)</p>",
        "id": 269454392,
        "sender_full_name": "Brian Alper",
        "timestamp": 1643220006
    },
    {
        "content": "<p>In general, we want relationships to be called out by explicit elements (one per relationship) that appropriately control cardinality, direction and mustSupport.  We don't want bidirectional relationships.  We don't want relationships that aren't \"core\" showing up as core elements.  And we want it to be easy for profiles to place constraints on relationships.  Using RelatedArtifact makes all of these things harder.  So it should not be used most places.</p>",
        "id": 269459157,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643221876
    },
    {
        "content": "<p>so then Composition should revert</p>",
        "id": 269461229,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643222770
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192085\">Brian Alper</span> <a href=\"#narrow/stream/179166-implementers/topic/DocumentReference.20relatesTo/near/269454392\">said</a>:</p>\n<blockquote>\n<p>RelatedArtifact is a Datatype and DocumentReference is a Resource.  If the relation between artifacts does not require its own resource for exchange as a shareable unit, it seems preferable to use a Datatype to a new Resource.</p>\n</blockquote>\n<p>I don't understand this. We could make the same argument that all of Observation should just be made a datatype that can be included in Compositions.</p>\n<blockquote>\n<p>I believe the RelatedArtifact Datatype was developed for relations between artifacts in resources that are often not patient-specific (PlanDefinition, Library, Citation, Evidence, etc.)</p>\n</blockquote>\n<p>There's nothing about DocumentReference that requires it be patient-centric. IHE even has the NPFS profile of DocumentReference that is specifically tailored for non-patient documents.</p>",
        "id": 269463603,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1643223694
    },
    {
        "content": "<p>The relatesTo element and RelatedArtifact Datatype are primarily about the relationship between artifacts/resources, and the Observation and DocumentReference Resources are primarily for the artifact/resource itself, so one does not replace the other.  There are schemas like Scholix (<a href=\"http://www.scholix.org/\">http://www.scholix.org/</a>) that represent the relationships/links between artifacts/resources as separate entities but I don't think there is an intention in FHIR to create a Resource to represent the links between resources.</p>",
        "id": 269471419,
        "sender_full_name": "Brian Alper",
        "timestamp": 1643226796
    },
    {
        "content": "<p>I am worried about all of the multi-directionality in the valueset that RelatedArtifact supports. It does not support a deterministic method that FHIR RESTful directionality modeling relies on. Pointers should be a deterministic direction, usually from the resource that is created later toward the resource that was created before. These can be navigated both directions.</p>",
        "id": 269602431,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643302676
    }
]