[
    {
        "content": "<p>Hi I have a question regarding DocumentReference resource.</p>\n<ol>\n<li>\n<p>It says \"DocumentReference.content.attachment.url or <a href=\"http://DocumentReference.content.attachment.data\">DocumentReference.content.attachment.data</a> or both SHALL be present\". <br>\ncan the URL be GET [base]/DocumentReference/[id] that will bring back the document's data?</p>\n</li>\n<li>\n<p>what is the difference between:</p>\n</li>\n</ol>\n<ul>\n<li>\n<p>$docref query with patient id, start date+end date, document type as parameters<br>\nand </p>\n</li>\n<li>\n<p>GET [base]/DocumentReference?patient=[patient]&amp;type=[system]|[code]&amp;period=[period]</p>\n</li>\n</ul>\n<ol start=\"3\">\n<li>document reference-category presents one category-\"clinical note\", but can't we have other categories for documents that are not representing clinical notes? </li>\n</ol>\n<p>thanks</p>",
        "id": 255868475,
        "sender_full_name": "Lital Inghel",
        "timestamp": 1633178432
    },
    {
        "content": "<p>Yes the URL given in attachment is a GET based URL, security and privacy may apply.</p>",
        "id": 255869351,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633179324
    },
    {
        "content": "<p>The IHE-MHD specification mandates the URL method as it is more flexible and more manageable.</p>",
        "id": 255869407,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633179364
    },
    {
        "content": "<p>The .data method might be considered more helpful with small objects</p>",
        "id": 255869436,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633179403
    },
    {
        "content": "<p>$docref is not a query, it is an operation. It is also US-Core specific, so not applicable outside the USA.    <br>\nAs far as I know it is exactly the same as you indicate. <br>\nI think the reason it is defined as an operation is so that the DocumentReference and objects can be \"created\" during the operation, where as a GET \"in theory\" can't create anything.</p>",
        "id": 255869679,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633179626
    },
    {
        "content": "<p>You might be interested in the International standard (vs us-core) from IHE - <a href=\"https://profiles.ihe.net/ITI/MHD/\">https://profiles.ihe.net/ITI/MHD/</a></p>",
        "id": 255869725,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633179669
    },
    {
        "content": "<p>Yes they do basically the same thing.</p>",
        "id": 255888703,
        "sender_full_name": "Eric Haas",
        "timestamp": 1633199035
    },
    {
        "content": "<p>No, <code>DocumentReference.content.attachment.url</code> cannot be <code>[base]/DocumentReference/[id]</code> - that's the URL that brings back the DocumentReference itself, not its actual document data</p>",
        "id": 255994649,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1633311096
    },
    {
        "content": "<blockquote>\n<p>document reference-category presents one category-\"clinical note\", but can't we have other categories for documents that are not representing clinical notes?</p>\n</blockquote>\n<p>The US Core DocumentReferences Category Value Set is a 'starter set' of categories supported for fetching and storing clinical notes.which means you can have other categories for your use case.</p>",
        "id": 256075268,
        "sender_full_name": "Eric Haas",
        "timestamp": 1633360413
    },
    {
        "content": "<p>Hi Team, I had a quick question regarding FHIR questionnaireResponse. Our team wanted to implement an FHIR server that can handle submitting a large questionnaire response to a non-adaptive questionnaire. In the response to the questionnaire response can I return the contained  questionnaire of the next section of the questionnaire even if it's not an adaptive flow</p>",
        "id": 256346636,
        "sender_full_name": "Nitin Lal",
        "timestamp": 1633485491
    },
    {
        "content": "<p>for document reference it says: 'DocumentReference.content.attachment.url or <a href=\"http://DocumentReference.content.attachment.data\">DocumentReference.content.attachment.data</a> or both SHALL be present'.<br>\nsince a patient might have many and complex docs, we'll have to use the URL.<br>\nthe issue is that using this URL requires specific security permissions that not any FHIR user can have (since it access our file system). so only a specific type of user will be able to actually resolve this URL but other users will not. is this ok certification wise or we should find a way to resolve it? the user that is sending the FHIR request will not necessarily have the permission to get the URL data.</p>",
        "id": 257063775,
        "sender_full_name": "Lital Inghel",
        "timestamp": 1633958717
    },
    {
        "content": "<p>Security/Privacy always can apply to all accesses.</p>",
        "id": 257070457,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633961794
    },
    {
        "content": "<p>That said, the policies need to be reasonable and proper. A Binary resource can be protected just as well as anything else. Simple method is to apply the same policies that apply to the DocumentReference to the Binary pointed to by the DocumentReference.content.attachment.url. It is a simple search on the request for the Binary to find all DocumentReference that have a content.attachment.url equal to the Binary url. Once you have that, then you just apply the rules you would apply to that DocumentReference.</p>",
        "id": 257070844,
        "sender_full_name": "John Moehrke",
        "timestamp": 1633961988
    },
    {
        "content": "<blockquote>\n<p>is this ok certification wise or we should find a way to resolve it?</p>\n</blockquote>\n<p>Might pass certification, but it is surely NOT ok - the user being able to retried the DocumentReference but then not being able to get the referenced document itself is useless</p>",
        "id": 257105284,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1633979522
    },
    {
        "content": "<p>I asked similar question in the \"SMART\" stream.</p>",
        "id": 257202457,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1634045333
    }
]