[
    {
        "content": "<p>If I want to refer to a paper document by type/kind explicitly - how do i do that with DocumentReference.content.attachment (1..1)?   Example - org X holds Advanced Care Directive (as paper)...  may have an identifier but will not have digital content</p>",
        "id": 156572778,
        "sender_full_name": "Brett Esler",
        "timestamp": 1548122103
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ?</p>",
        "id": 156572799,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548122142
    },
    {
        "content": "<p>Initial thought is fill in masterIdentifier with the paper document serial number (or whatever) and leave out content.attachment. However content and content.attachment are required, so you’ll need to provide them; but since attachment has no required elements, you can leave it empty, I think. (Fill it with as “nothing to see here extension?) I’d need to think further, but content.format could be a code that says “on dead trees.”</p>",
        "id": 156578564,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1548131104
    },
    {
        "content": "<p>It can't be empty, but you could use the data-absent-reason extension</p>",
        "id": 156580605,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548134011
    },
    {
        "content": "<p>We should think about whether relaxing the cardinality makes sense for R5. This seems a reasonable use case.</p>",
        "id": 156582221,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1548136553
    },
    {
        "content": "<p>So a DocumentReference that doesn't reference anything in the electronic world, only the physical world?  Should we have an alternative structure to describe the physical location?</p>",
        "id": 156585432,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548141648
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192174\">@Danielle Tavares</span> <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span></p>",
        "id": 156594186,
        "sender_full_name": "Brett Esler",
        "timestamp": 1548152725
    },
    {
        "content": "<p>This was not ever brought up as a use-case. The intent was to help discovering these non-FHIR information objects. I think Lloyd is right that if one can't contain or point at the object, then we likely need some alternative to 'attachment' that can describe the physical location, box, folder, page... How are these things physically indexed?</p>",
        "id": 156602095,
        "sender_full_name": "John Moehrke",
        "timestamp": 1548162249
    },
    {
        "content": "<p>I agree it wasn’t a use case, but it seems useful to me. My thought was using the same resource, but make it a choice of attachment or Reference(Location).</p>",
        "id": 156617500,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1548174231
    },
    {
        "content": "<p>Location will tell you a facility.  Do we need something more to let you communicate a particular cabinate/box/file?</p>",
        "id": 156617568,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548174300
    },
    {
        "content": "<p>I thought location could do departments, wards, beds and finer levels of specificity.</p>",
        "id": 156618052,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1548174697
    },
    {
        "content": "<p>It can do rooms and beds, but I don't know we've ever said its scope included cabinates, boxes, drawers or folders.</p>",
        "id": 156619061,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1548175453
    },
    {
        "content": "<blockquote>\n<p>Examples of Locations are: ...<br>\n* Building, ward, corridor, room or bed<br>\n* Mobile Clinic<br>\n* Freezer, incubator...</p>\n</blockquote>\n<p>How is a document in a filing cabinet different from a specimen in a freezer? ( Although I'll note that specimen isn't actually using Location.)</p>",
        "id": 156621702,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1548177545
    },
    {
        "content": "<p>Our requirement is to send a statement of who (name, address, phone, etc) is the custodian of an advance care directive for the patient. Metadata about the directive (e.g. date authored) is not currently required.</p>\n<p>That looks like it can use DocumentReference without the attachment, but with a contact person. That could reasonably be generalised to allow organisation or location instead of person.</p>",
        "id": 156650356,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1548200455
    },
    {
        "content": "<p>We want to build this before R5.</p>",
        "id": 156650392,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1548200499
    },
    {
        "content": "<p>Note that DocumenReference already has a custodian element of an organization. I would suggest an extension on that element if you need to identify a specific person.</p>",
        "id": 156661824,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1548215294
    },
    {
        "content": "<p>Advanced Directives is a topic the Consent resource is intended to support, and the Consent resource in degenerate form can be a pointer to the custodian. So you might want to look at that for your use-case.</p>",
        "id": 156692739,
        "sender_full_name": "John Moehrke",
        "timestamp": 1548253814
    },
    {
        "content": "<p>as to using DocumentReference, there is no restrictions on what the attachment url is; so you could put a web page that is possibly just human readable and gives humans directions on what they can do next.</p>",
        "id": 156692831,
        "sender_full_name": "John Moehrke",
        "timestamp": 1548253904
    }
]