[
    {
        "content": "<p>Composition, and DocumentReference, have a relatesTo relationship. But the codes seem to be limited to versions or parts of the same document (replaces, transforms, signs, appends). Is it not meant for a general purpose link? <br>\nWhat is the way to say \"this other document relates to this one\". They may share a subject, but this would be a more precise link than \"all the documents about a patient\".</p>",
        "id": 229709449,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615397965
    },
    {
        "content": "<p>In general, we prefer to avoid 'typed' relationships and instead have specific elements for each type of relationship</p>",
        "id": 229715550,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615400237
    },
    {
        "content": "<p>that makes sense. But in the absence of that, how then can this be achieved? The use case is that documents about products come in sets. It's not all the documents about a product ever, and it's not parts of one document. But documents can be released together such as the version with and without certain sections, or the version for experts and the version for patients. How could they be related to each other? The documents themselves have types, so if there was a general \"other\" relatesTo code, then you could see what other type you were linking to and it wouldn't be a semantic-less relationship overall.</p>",
        "id": 229718573,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615401363
    },
    {
        "content": "<p>Would a List of documents work?</p>",
        "id": 229719111,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1615401555
    },
    {
        "content": "<p>I had considered that. To relate A and B would need A, B, a  List, and maybe 2 DocumentReferences.  A bit much and hard to query. But maybe the DocumentReferences are not needed, now I think of it.</p>",
        "id": 229719496,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615401698
    },
    {
        "content": "<p>but still it seems odd to have an element called Composition.relatesTo, and not be able to use it for a related Composition...</p>",
        "id": 229719740,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615401786
    },
    {
        "content": "<p>How this would be done in an XDS world would be through a Folder. In FHIR we use List resoruce for the purpose of grouping DocumetReferenc resources into a folder</p>",
        "id": 229721380,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615402396
    },
    {
        "content": "<p>Fair enough.  Could also try an extension on Composition to start (e.g., <code>partOfGroup</code>) and go for an addition to R5.</p>",
        "id": 229721428,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1615402417
    },
    {
        "content": "<p>To make that more clear, we group them by way of a List. This way the List can be modified independent of the DocumentReference</p>",
        "id": 229721618,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615402478
    },
    {
        "content": "<p>The other possibility is to use the DocumentReference.context.related.   This is used in XDS as well for grouping, and has the advantage that it is more flexibile to allow for a grouping accross many registries. The disadvantage is that it is harder to understand the reason for the related link</p>",
        "id": 229721960,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615402599
    },
    {
        "content": "<p>DocumentReference.context.related seems to have gone in R5 with no obvious replacement.<br>\nIs it necessary to use a DocumentReference to refer to a directly referenceable Composition (if I don't need the metadata that it offers)? <br>\nDocumentReference is intended as a FHIR enabling wrapper for \"real\" (non-FHIR) documents, at URLs, I assume.<br>\nI am thinking that a List of references to Compositions may do the job.</p>",
        "id": 229731631,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615406047
    },
    {
        "content": "<p>Is there a problem with List not being allowed as a target (e.g., can it be used as 'include all these docs')?  If not, that may be awkward.</p>",
        "id": 229731749,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1615406094
    },
    {
        "content": "<p>I'm not sure what you mean about List not being allowed as a target Gino? <br>\nYou can (I assume) have a List of Compositions, that points to them as targets. <br>\nYou could also have List of Compositions inside the Bundle, so that each document points to itself and all the others. <br>\nUpdating that could be a problem however.</p>",
        "id": 229735981,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615407523
    },
    {
        "content": "<p>I believe DocumentReference.context.related has moved to DocumentReference.relatesTo, which allows specific relationships to other document references be listed, or DocumentReference.related which can point to any resource, but doesn't indicate the relationship.</p>",
        "id": 229742944,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1615409859
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>. But relatesTo only seems to allow links to what is essentially the <em>same</em> document (a version, a translation etc). Can you confirm that is the intention?</p>",
        "id": 229758923,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615415299
    },
    {
        "content": "<p>I believe that is the intention.</p>\n<p>By the way, what relationship are you trying to model that can't be expressed using searches based on basedOn, type, category, encounter, event, practiceSetting, or the standard episode-of-care extension?</p>",
        "id": 229759484,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1615415599
    },
    {
        "content": "<p>relations between the different documents that apply to drug products, such as the full data sheet and the one that the patient sees</p>",
        "id": 229759682,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615415662
    },
    {
        "content": "<p>these documents are not patient related, so those patient fields don't apply</p>",
        "id": 229759826,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615415736
    },
    {
        "content": "<p>I guess that normally clinical documents are linked by being in the same part of the patient record, so there has not been a need to group documents by other criteria</p>",
        "id": 229759978,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615415803
    },
    {
        "content": "<p>That could be modeled as a translation.</p>",
        "id": 229760000,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1615415815
    },
    {
        "content": "<p>well it is not a literal translation. But that is another concept we may also need.</p>",
        "id": 229760076,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615415850
    },
    {
        "content": "<p>but if the sense of translation means \"about the same thing\" then it might work. but that isn't really what I understand by \"translation\"</p>",
        "id": 229760194,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615415909
    },
    {
        "content": "<p>Actually, the code is \"transform\" and I'd be happy to defend that use as a transformation of the document.</p>",
        "id": 229760205,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1615415917
    },
    {
        "content": "<p>but then all documents are transforms of each other even if they are neither subsets or supersets. A bit of a broad definition :-) Certainly no machine could do the transform.</p>",
        "id": 229760292,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615415979
    },
    {
        "content": "<p>Or, look at using an extension for subject to point to the drug product resource, and the type/category of the document would indicate full or patient data sheet.</p>",
        "id": 229760490,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1615416073
    },
    {
        "content": "<p>Composition.subject can already point at the drug, so that is ok. But the idea is not to find all the documents about the drug, but to have certain documents relate to others.</p>",
        "id": 229760882,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615416271
    },
    {
        "content": "<p>DocumentReference.relatesTo is for lifecycle revisions and transforms of a document. That is why the .relatesTo.code valueset is so limited.</p>",
        "id": 229762055,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615416828
    },
    {
        "content": "<p>the element name \"relatesTo\" might be the thing that is confusing. as it is really close to \"baseOn\" found in other resources. In DocumentReference the concept of \"basedOn\" is handled by the .context.related.</p>",
        "id": 229762281,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615416953
    },
    {
        "content": "<p>So it seems. That isn't conveyed well in its name or description however imho.</p>",
        "id": 229762286,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615416955
    },
    {
        "content": "<p>please submit a CR with a recommendation.</p>",
        "id": 229762375,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615416986
    },
    {
        "content": "<p>in R4 I guess \"basedOn\" could be either relatesTo or Context, which is perhaps why only relatesTo is there in R5.</p>",
        "id": 229762706,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615417156
    },
    {
        "content": "<p>hard to think of a good name but maybe \"relatedVersion\" would work</p>",
        "id": 229762853,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1615417211
    }
]