[
    {
        "content": "<p>If I have document bundles stored at /Bundle, what should I expect to see if I issue a query with _summary=text? It seems to me, by the spec, I should only get back id, meta, and type, which isn't very useful. (Bundle doesn't seem to have a text element, since it's not a DomainResource.)</p>",
        "id": 268466024,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1642545365
    },
    {
        "content": "<p>If I issue a query with  _summary=true, what is the expectation for what gets included from the bundled resources? (entry.resource is a summary element.) Do I get the whole resource, or only summary elements of it, or something else?</p>",
        "id": 268466651,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1642545719
    },
    {
        "content": "<p>Since, every element in Bundle is marked Summary, is there a difference between a _summary=true query and a non-summary one?</p>",
        "id": 268466979,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1642545914
    },
    {
        "content": "<p>I would expect  /Bundle/123?_summary=true to return the entire Bundle as-is with no attempt to summarize the entry resources. <br>\nI would expect /Bundle/123?_summary=text to return just the 3 attributes you mentioned. I don't know that there's anything stopping you from adding extra attributes to the summary text, though.</p>\n<p>edit to add: this is just from my reading of the spec. I don't have any particular experience with FHIR document paradigms, so could be other folks have more to add.</p>",
        "id": 268467422,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1642546228
    },
    {
        "content": "<p>That was my reading of the spec too. I'm just not sure it's particularly helpful behaviour.</p>",
        "id": 268468881,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1642546980
    },
    {
        "content": "<p>further... the definition of _summary <a href=\"https://www.hl7.org/fhir/search.html#summary\">https://www.hl7.org/fhir/search.html#summary</a>    includes </p>\n<blockquote>\n<p>Servers are not obliged to return just a summary as requested.<br>\nso, it is always completely at the whim of the server.</p>\n</blockquote>",
        "id": 268472720,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642549374
    },
    {
        "content": "<p>I know, YMMV. But I was wondering what a client should expect.</p>",
        "id": 268472865,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1642549471
    },
    {
        "content": "<p>I think any client using _summary should have very low expectations. The only _summary function that likely has worthwhile expectation is count.</p>",
        "id": 268473162,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642549719
    },
    {
        "content": "<p>Everything in Bundle is in summary except extensions, so I'd expect extensions stripped out but not anything else.  Whether that's useful or not, I think it's too late to change...</p>",
        "id": 268494391,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642570600
    },
    {
        "content": "<p>I believe there was a ticket or two to clarify around this… I <em>think</em> the resolution was that once an element was included, then everything below it was included.  But, I would suggest searching for the ticket.</p>",
        "id": 268495684,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1642572233
    },
    {
        "content": "<p>Is it too late? I know Bundle is normative, but summary behaviour is largely at the discretion of the implementation, so changing the expected behaviour wouldn't cause existing implementations to be non-conformant.</p>",
        "id": 268574946,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1642613393
    },
    {
        "content": "<p>Adding clarifying text is something that can always happen.  Related to <code>_summary</code> behavior,  there were two related tickets resolved (voted on) during FHIR-I sessions today: <a href=\"http://jira.hl7.org/browse/FHIR-33002\">FHIR-33002</a> and <a href=\"http://jira.hl7.org/browse/FHIR-33148\">FHIR-33148</a> .</p>",
        "id": 268575440,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1642613579
    },
    {
        "content": "<p>Summary behavior is <em>not</em> at the discretion of the implementation.  If you have an element and the requester is allowed to see it and they as for _summary=true and you don't provide it, you're non-conformant.</p>",
        "id": 268633035,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642646127
    },
    {
        "content": "<p>Flagging a parent as _summary doesn't automatically mark all children as _summary.  The decision to mark everything in the Bundle as 'isSummary=true' was a deliberate action involving setting the flag on all rows in the resource.  I can't explain why - <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> might be able to when he returns.  But it's not something that could have happened by accident.</p>",
        "id": 268633118,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642646218
    },
    {
        "content": "<p>not sure I remember</p>",
        "id": 269526450,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643259923
    },
    {
        "content": "<p>maybe it was an expedience thing, since bundle has to be exempt from summary when it's the result of a search</p>",
        "id": 269526471,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643259947
    }
]