[
    {
        "content": "<p>I have a use case where I want to get all of the documents for a patient but limited to only certain contentTypes (DocumentReference.Attachment.contentType). This looks to not be possible via a standard search. That would mean I need to use a Named Query correct? I've got that working but I'm now struggling to find an example of what the OperationDefinition for the Conformance should look like in this case. Are there any good examples of named query conformances?</p>",
        "id": 153842334,
        "sender_full_name": "Gavin Millar",
        "timestamp": 1470272906
    },
    {
        "content": "<p>the easiest way would be to add a search parameter for content type</p>",
        "id": 153842335,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470273699
    },
    {
        "content": "<p>does that imply that something like /fhir/1.0/DocumentReference?subject.identifier=ABC|DEF&amp;content.attachment.contentType=application/pdf is valid? I had assumed that if it wasn't listed as an avaliable search parameter (<a href=\"https://www.hl7.org/fhir/documentreference.html#search\" target=\"_blank\" title=\"https://www.hl7.org/fhir/documentreference.html#search\">https://www.hl7.org/fhir/documentreference.html#search</a>) then I needed to do things other ways. Now that I reread I can't see a definite statement to that effect.<br>\nIf that form is allowed then my life gets much easier!</p>",
        "id": 153842336,
        "sender_full_name": "Gavin Millar",
        "timestamp": 1470274148
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192386\">@Gavin Millar</span> You can define your own SearchParameter resource instances and reference them with your Conformance resource</p>",
        "id": 153842337,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1470274302
    },
    {
        "content": "<p>(In fact, you can't rely on the standard search parameter names - you always need to check the Conformance statement of the server you're talking to as it's theoretically possible for it to bind the standard names to a different search parameter definition)</p>",
        "id": 153842338,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1470274366
    },
    {
        "content": "<p>the search parameters are defined for convenience. You can add your own search parameters. I'd counsel against naming the search parameter 'content.attachment.contentType') because that looks like a chained search. It's more consistent style-wise to call it 'contentType' or equivalent</p>",
        "id": 153842339,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470274366
    },
    {
        "content": "<p>but you need get whatever servers you care about to support your search parameters</p>",
        "id": 153842340,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470274391
    },
    {
        "content": "<p>OK, I think that all makes sense. I can define my own names for my own search parameters and use them in my server then it's just a matter of adding it as a search-parameter in my Conformance to state the name etc.<br>\nObviously this makes my server distinct in regards to this parameter which is probably fine for my use case (but certainly something to keep in mind)</p>",
        "id": 153842341,
        "sender_full_name": "Gavin Millar",
        "timestamp": 1470275029
    },
    {
        "content": "<p>yes, you can propose that we add such a search parameter on the grounds that other people might do the same thing</p>",
        "id": 153842342,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470275137
    },
    {
        "content": "<p>I think that filtering by contentType for documents is fairly reasonable and I'd be keen to see it as part of the spec. Can you point me to where to make the suggestion/case ?</p>",
        "id": 153842343,
        "sender_full_name": "Gavin Millar",
        "timestamp": 1470275184
    },
    {
        "content": "<p>'propose a change' link tat the bottom of each page</p>",
        "id": 153842345,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470275395
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192386\">@Gavin Millar</span> do you really mean contentType? Or the more specific format? I ask because I expect that contentType might be less useful. Especially since there is only a few types that are likely (pdf, xml,json, etc). Where the format is an indication of the technology and use-case encoding. So format would differentiate between various types of meaning. </p>",
        "id": 153842391,
        "sender_full_name": "John Moehrke",
        "timestamp": 1470309413
    },
    {
        "content": "<p>Further I expect that once you find a DocumentReference that has the content you want; when you then pull the content, the server holding that content could use your requesting (content type negotiation, or _format) to re-format the content to that format. This manipulation would be purely presentation manipulation. Much like http is intended to be used.</p>",
        "id": 153842392,
        "sender_full_name": "John Moehrke",
        "timestamp": 1470309537
    },
    {
        "content": "<p>I put this into the IHE - MHD profile and have gotten many people commenting positively. The reformatting is not mandatory, but enabled by http and _format. </p>",
        "id": 153842393,
        "sender_full_name": "John Moehrke",
        "timestamp": 1470309645
    },
    {
        "content": "<p>To the extent that \"format\" and \"content type\" are both captured in <code>DocumentReference</code>, it's useful to be able to search by both.  <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>, I'm assuming that once you find a particular <code>DocumentReference.content</code> that you want, then GETting the attachment by <code>url</code> should return content according to the format and contentType specified in the DocumentReference. Is this right? </p>",
        "id": 153842394,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1470316668
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  I am not suggesting that the query parameter should not be added. I am just asking for the use-case where content type is significantly useful.  I provide the comments to help illuminate the intent of the parameters and elements that exist. And to point out that in XDS there has never been a need to query by the mime type.</p>",
        "id": 153842425,
        "sender_full_name": "John Moehrke",
        "timestamp": 1470335791
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> : Yes, I really mean contentType. Our use case is around displaying a list of PDF documents (initially) as that is what we have the technology to accurately render for the client. Our source in this case has documents of other types (images, CCDA etc.) which are handled elsewhere. So it's not about the meaning of the document but rather it's MIMEtype/contentType etc.</p>\n<p>I can understand that a more general case for filtering would be format (or class perhaps) but in our case we would prefer contentType.</p>",
        "id": 153842426,
        "sender_full_name": "Gavin Millar",
        "timestamp": 1470339207
    },
    {
        "content": "<p>okay. Include that use-case in the request for the query parameter. Seems reasonable in FHIR. I will note that it won't be supportable by a system that is using FHIR (MHD profile) infront of an XDS/XCA environment. This is NOT an important fact for FHIR specification. I point it out only as an operational perspective. </p>",
        "id": 153842427,
        "sender_full_name": "John Moehrke",
        "timestamp": 1470339468
    },
    {
        "content": "<p>this blog article explains why format ...  <a href=\"https://healthcaresecprivacy.blogspot.com/2015/10/ihe-formatcodes-are-mandatory.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2015/10/ihe-formatcodes-are-mandatory.html\">https://healthcaresecprivacy.blogspot.com/2015/10/ihe-formatcodes-are-mandatory.html</a></p>",
        "id": 153842429,
        "sender_full_name": "John Moehrke",
        "timestamp": 1470340442
    },
    {
        "content": "<p>This isn't relevant to Gavin's original question, however... </p>\n<blockquote>\n<p>when you then pull the content, the server holding that content could use your requesting (content type negotiation, or _format) to re-format the content to that format. This manipulation would be purely presentation manipulation.</p>\n</blockquote>\n<p>This is essentially what is proposed for MHD-I: Request an XDS-I image manifest as the specified contentType (application/dicom), and you get back a DICOM KOS (Key Object Selection), request it back as application/fhir+xml, and you get back a FHIR ImagingManifest resource.</p>",
        "id": 153843094,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1470698526
    }
]