[
    {
        "content": "<p>For one of our use cases, we are specifying the exchange of FHIR Document (Bundle.type = document and with a Composition ect.). We are currently looking at the Bundle end-points for posting the Document Bundle ( <a href=\"http://hl7.org/fhir/documents.html#bundle\" target=\"_blank\" title=\"http://hl7.org/fhir/documents.html#bundle\">http://hl7.org/fhir/documents.html#bundle</a> ).</p>\n<p>We are wondering if a post of a Document Bundle at the server's base URL should be seen as a transaction. Currently, at the given table in the link above the transaction is only mentioned in a ' e.g. a transaction'. Not very convincing. What's FHIR idea here?</p>",
        "id": 161327758,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1553159131
    },
    {
        "content": "<p>More details are given in <a href=\"http://hl7.org/fhir/http.html#other-bundles\" target=\"_blank\" title=\"http://hl7.org/fhir/http.html#other-bundles\">http://hl7.org/fhir/http.html#other-bundles</a><br>\nSo the idea is that the document bundle is decomposed into its individual resources, and for every resource either a POST or a PUT is executed depending whether or not the server already has a resource in its database with the corresponding id.</p>",
        "id": 161331854,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1553163418
    },
    {
        "content": "<p>For a document it is however not expected that all resources need to be accepted like in a transaction. At least that is my interpretation of it.</p>",
        "id": 161331996,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1553163597
    },
    {
        "content": "<p>I don't think a server gets to pick and choose. IF a server decides to accept bundles being posted to /, the sever gets to determine whether a POST or a PUT is in order as a method. Other than that, all resources have to be processed. Client side orchestration, after all, this being REST.</p>",
        "id": 161332875,
        "sender_full_name": "René Spronk",
        "timestamp": 1553164409
    },
    {
        "content": "<p>„if the identity of the resource refers to a valid location on the server, it should treat it as an update to that location“ sounds to me like it is being decided for each resource in the document bundle</p>",
        "id": 161333191,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1553164728
    },
    {
        "content": "<p>Of course all resources in the document bundle should be processed, yet, I don’t see the part where it is mentioned that for a document bundle all create or update interactions need to succeed.</p>",
        "id": 161333341,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1553164868
    },
    {
        "content": "<p>Though, I understand that such a behavior would be desirable, and needed in <span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span> use case.</p>",
        "id": 161333525,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1553165061
    },
    {
        "content": "<p>Agree - there is no 'transactional integrity'.</p>",
        "id": 161333557,
        "sender_full_name": "René Spronk",
        "timestamp": 1553165112
    },
    {
        "content": "<p>That's rather unsatisfying. Documents in CDA are regarded as 'whole'. Documents in FHIR apparently have a lesser status.</p>",
        "id": 161345828,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1553175801
    },
    {
        "content": "<p>I.e. there's no guarantee that the server accepts the the whole thing this way.</p>",
        "id": 161345914,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1553175843
    },
    {
        "content": "<p>Or maybe the server base URL is just unsuitable for documents and we should rather look into persistence at the Bundle endpoint</p>",
        "id": 161346302,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1553176146
    },
    {
        "content": "<p>If you want to persist the Document as a whole: a) post it to /Bundle (instead of /), and it will be persisted as-is (as a bundle), b) if digital signatures etc. play a role, you need to persist a document as a Binary resource.</p>\n<p>If you post a bundle (message, document, or any other non-transaction type) to / you're telling the sever that \"for convenience reasons I'm grouping these resources, process them as if they were sent to you on a one-by-one basis\", i.e. bundle is a transportation-level-batching mechanism.</p>",
        "id": 161352473,
        "sender_full_name": "René Spronk",
        "timestamp": 1553179860
    },
    {
        "content": "<p>Generally, posting a document to the base endpoint would be treated as an error.  A server <em>could</em> choose to treat it as a transaction, but the server would then have to decide whether to treat each resource as a create or update and figure out how to map the resource ids in the Bundle to its local records.  Doing that isn't expected behavior though.  A client wanting a document to be processed as a transaction should convert the Bundle to a transaction before posting.</p>",
        "id": 161361097,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553184941
    },
    {
        "content": "<p>we say that a server is allowed to do that, and it's at the server's discretion how to handle the problems it creates</p>",
        "id": 161404709,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553210677
    }
]