[
    {
        "content": "<p>The documentation for DocumentReference.custodian describes it as \"Identifies the logical organization to go to find the current version, where to report issues, etc. This is different from the physical location of the document, which is the technical location of the document, which host may be delegated to the management of some other organization.\"</p>\n<p>I understand that to be a hospital or hospital system, as opposed to a piece of software serving as a repository for the document. If I wanted to express the \"technical location\" or ownership of a DocumentReference, does anyone have suggestions in the existing specification?</p>\n<p>Thank you!</p>",
        "id": 153897334,
        "sender_full_name": "Jeffrey Willis",
        "timestamp": 1500483126
    },
    {
        "content": "<p>As distinct from the server that's hosting it?</p>",
        "id": 153897390,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1500515345
    },
    {
        "content": "<p>If I understand your question, yes, different than the hosting server.</p>\n<p>The two scenarios I'm thinking of are:<br>\n1. A different technical organization gives my system a document and wants me to hold onto it but not change it. That other technical organization is the \"owner\" and my system is the repository.<br>\n2. A different technical organization gives my system a document and wants me to hold onto it but also own it; the other technical organization is giving up ownership.</p>\n<p>In those scenarios, the transfer of the document could be happening within the same hospital.</p>",
        "id": 153897453,
        "sender_full_name": "Jeffrey Willis",
        "timestamp": 1500558134
    },
    {
        "content": "<p>Why is it important to know the physical location? Your examples show why it is important to know the custodian, which is why that element exists. The URL tells you where the virtual location is.  I am not understanding the need. Especially in light of 'cloud' where there really is no physical location of the bits.  If you can express why that is important, then you could submit a CR. I would suggest that this need would clearly fall outside the 80%; and at best could be a core extension. I would be happy to support it as an extension, with good explanation. I am just not yet understanding why the physical location of bits is important. Seems virtual location (URL) is all that is needed.</p>",
        "id": 153897473,
        "sender_full_name": "John Moehrke",
        "timestamp": 1500562717
    },
    {
        "content": "<p>Hello John, thank you for your question and comments. I'm not necessarily looking for a change of the specification but looking to understand the use of custodian or if there is another element that's suitable.</p>\n<blockquote>\n<p>Why is it important to know the physical location? </p>\n</blockquote>\n<p>It's not the physical location that I'm interested in knowing. My system is trying to store documents from a sending system via POSTs to DocumentReference. Sometimes the sending system wants to retain ownership of the document, other times it wants to relinquish ownership. </p>\n<p>I'm looking for an analogous element for DocumentReference.custodian but for the owning system or technical owner.</p>",
        "id": 153897706,
        "sender_full_name": "Jeffrey Willis",
        "timestamp": 1500648938
    },
    {
        "content": "<p>Good discussion. So then why is custodian not effective? What part of the definition of custodian concerns you?</p>",
        "id": 153897707,
        "sender_full_name": "John Moehrke",
        "timestamp": 1500649251
    },
    {
        "content": "<p>Does DocumentReference.custodian -&gt; Organization.endpoint solve the problem? Perhaps with some extensions to Endpoint?</p>",
        "id": 153897708,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1500649900
    },
    {
        "content": "<blockquote>\n<p>Good discussion. So then why is custodian not effective? What part of the definition of custodian concerns you?</p>\n</blockquote>\n<p>The comments in the documentation say, \"This is different from the physical location of the document, which is the technical location of the document, which host may be delegated to the management of some other organization.\"</p>\n<p>To me that seems to say the the organization would be the hospital, not my system (which resides within the scope of the hospital). Otherwise I think custodian is a good fit for what I'm looking to do.</p>",
        "id": 153897738,
        "sender_full_name": "Jeffrey Willis",
        "timestamp": 1500666640
    },
    {
        "content": "<blockquote>\n<p>Does DocumentReference.custodian -&gt; Organization.endpoint solve the problem? Perhaps with some extensions to Endpoint?</p>\n</blockquote>\n<p>This seems to describe the metadata needed to connect to the organization, I'm not certain this would suit without some further reading.</p>",
        "id": 153897739,
        "sender_full_name": "Jeffrey Willis",
        "timestamp": 1500666763
    },
    {
        "content": "<p>I would expect the hospital holds some authoship, and doesn't bother with custodian. Thus the ONLY time custodian would be used is a case like you decribe.</p>",
        "id": 153897740,
        "sender_full_name": "John Moehrke",
        "timestamp": 1500667437
    },
    {
        "content": "<p>That sounds like just what I need. Thank you for your time and for the discussion!</p>",
        "id": 153897939,
        "sender_full_name": "Jeffrey Willis",
        "timestamp": 1500905417
    },
    {
        "content": "<p>good to hear... so, given this understanding... Can you suggest a wording change to the custodian element definition, description, and/or notes?  Seems this is a good opportunity for you to suggest an improvement.</p>",
        "id": 153897942,
        "sender_full_name": "John Moehrke",
        "timestamp": 1500906034
    },
    {
        "content": "<p>I think including some definitions or descriptions to better frame the difference between logical and physical ownership would be helpful.</p>\n<p>Here is the current custodian comments. My additions are in bold.</p>\n<p>Identifies the logical organization <strong>(software system, vendor, or department)</strong> to go to find the current version, where to report issues, etc. This is different from the physical location <strong>(URL, disk drive, or server)</strong> of the document, which is the technical location of the document, which host may be delegated to the management of some other organization.</p>",
        "id": 153897963,
        "sender_full_name": "Jeffrey Willis",
        "timestamp": 1500921036
    },
    {
        "content": "<p>I submitted that as <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13686\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13686\">GF#13686</a></p>",
        "id": 153897965,
        "sender_full_name": "John Moehrke",
        "timestamp": 1500921580
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 153898079,
        "sender_full_name": "Jeffrey Willis",
        "timestamp": 1500991136
    }
]