[
    {
        "content": "<p>Apologies if this has been asked before (I did do a search but found nothing to answer my question). In CDA we defined document recipients as either primary recipients (PRCP), or trackers (TRC). We used the interaction identifier (an interaction identifier for primary recipients and one for copy recipients) to indicate the responsibilities for a copy recipient and primary recipient. These responsibilities varied from use case to use case. So in CDA we had the ability to 1) add a (structured) distribution list to a document 2) say who was a primary recipient, and who was a tracker 3) indicate the responsibilities for a primary recipient and for a copy recipient. What/where is the equivalent in FHIR in relation to document exchange?</p>",
        "id": 153869228,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1485441713
    },
    {
        "content": "<p>That would be elements of the container or transport; not the document... right? The document would be statements of facts, the container or transport would be about the communication responsibilities... See DocumentManifest, or Attachment, or Communication; and for transport MessageHeader and Bundle.</p>",
        "id": 153869244,
        "sender_full_name": "John Moehrke",
        "timestamp": 1485445516
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192158\">@Dave Barnet</span> You might also look at OperationDefinition and Task.  And in fact, the whole STU 3 section on \"workflow\".  Documents, in and of themselves, aren't actionable.  No one, upon picking up and reading a document, should get out their scalpel or start counting pills.  If you want to instruct someone to \"do something\", that must be managed through some  context external to the document - and FHIR provides lots of choices.  (Of the options John listed, only Communication and MessageHeader really allow the notion of differentiating recipient and only MessageHeader allows the implication of an action to be taken upon receipt.  Workflow will provide other choices.</p>",
        "id": 153869399,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1485558679
    }
]