[
    {
        "content": "<p>In the Document Reference documentation it refers to an option for generated documents to be persisted at the \"document end-point (/Document)\". I can't find any other mention of this end-point or its intended behaviour. As far as I can see there is no Document resource, only DocumentReference and bundles of type 'document'. Can anyone help?</p>\n<p><a href=\"https://www.hl7.org/fhir/documentreference.html#2.42.4.1\" target=\"_blank\" title=\"https://www.hl7.org/fhir/documentreference.html#2.42.4.1\">https://www.hl7.org/fhir/documentreference.html#2.42.4.1</a></p>",
        "id": 153957701,
        "sender_full_name": "Thomas Gutteridge",
        "timestamp": 1526002922
    },
    {
        "content": "<p>Thinks it's an old reference in the spec: here are the current references: <a href=\"http://hl7.org/fhir/documents.html#bundle\" target=\"_blank\" title=\"http://hl7.org/fhir/documents.html#bundle\">http://hl7.org/fhir/documents.html#bundle</a></p>",
        "id": 153957705,
        "sender_full_name": "David Hay",
        "timestamp": 1526010746
    },
    {
        "content": "<p>I've seen that too but nowhere does it talk about /Document.</p>",
        "id": 153957708,
        "sender_full_name": "Thomas Gutteridge",
        "timestamp": 1526011795
    },
    {
        "content": "<p>yeah - that's why I think it's an old reference in the spec. We'll see what the others say...</p>",
        "id": 153957712,
        "sender_full_name": "David Hay",
        "timestamp": 1526017998
    },
    {
        "content": "<p>That's a bad reference.  Can you submit a change request please?  It should refer to /Bundle</p>",
        "id": 153957776,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526042951
    },
    {
        "content": "<p>Ah, thanks. Yeah, not being familiar with the history of the spec, I couldn't immediately understand how it would have been an 'old' reference. I will try to figure out how to submit a change request...</p>",
        "id": 153960760,
        "sender_full_name": "Thomas Gutteridge",
        "timestamp": 1526346639
    },
    {
        "content": "<p>A couple of other questions about that section (Generating a Document Reference):</p>\n<p>1. If the request returns the document reference in a bundle (a search result) then I can see why if 'persist' was specified then the bundle would subsequently be available at /Bundle. Would the document reference be available individually at /DocumentReference too?</p>\n<p>2. Where it states \"Other parameters may be supplied: \", is it only referring to the parameters listed (i.e. persist)? Or is it suggesting that I might invent other parameters?</p>\n<p>3. (Not just a couple, I lied) In the example usage:</p>\n<div class=\"codehilite\"><pre><span></span> GET [service-url]/DocumentReference/?_query=generate&amp;uri=:url&amp;...\n</pre></div>\n\n\n<p>Why does the uri seem to start with a colon? That would make it an invalid URI; the scheme portion can't be empty. Or have I misunderstood the syntax used?</p>",
        "id": 153960761,
        "sender_full_name": "Thomas Gutteridge",
        "timestamp": 1526347144
    },
    {
        "content": "<p>1. Servers have the option of generating a DocumentReference when they receive a FHIR document, but there's no requirement that they do so.<br>\n2. It's saying that systems can define additional parameters for the operation<br>\n3. That looks like a typo to me.  Can you submit a change request?</p>",
        "id": 153960966,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526384163
    },
    {
        "content": "<p>Thanks for your reply, Lloyd!</p>\n<p>Just clarifying my first question, the generate operation is required to return a search result i.e. a bundle. So assuming the server does honour the 'persist' parameter, the generated document-reference-containing bundle should be available to be read by id at /Bundle. But what I was asking was, if that were the case then would you also expect the document reference itself to be available (without the containing bundle) to be read by its id at /DocumentReference? The answer may inform what I write in my change request for the section.</p>",
        "id": 153961394,
        "sender_full_name": "Thomas Gutteridge",
        "timestamp": 1526420595
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> While I'm waiting for my account to be approved so I can submit a change request, perhaps you have a minute to address this last query? Thank you!</p>",
        "id": 153963355,
        "sender_full_name": "Thomas Gutteridge",
        "timestamp": 1526594481
    },
    {
        "content": "<p>I would read the 'persist' parameter to simply be the creation of the document - not the DR. DR creation would be server specific functionality (though your change request might propose another parameter that did that)</p>",
        "id": 153963379,
        "sender_full_name": "David Hay",
        "timestamp": 1526618805
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195850\">@Thomas Gutteridge</span>, your registration should now be approved.  As David says, the operation is silent on DocumentReference, so you can't expect one to be created.  That said, extending the operation with a $index boolean parameter to ask for the creation of one seems like a reasonable and useful thing to do, so feel free to submit a change request proposing that as well if you wish :)</p>",
        "id": 153963388,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526626436
    },
    {
        "content": "<p>Ugh, I didn't realise my registration would have to be manually approved. That means that my generated password was no longer in my clipboard so I can't complete the registration process. And seemingly I can't use the forgot password option because my account is not fully activated. Not sure how to contact someone that can help me out of this whole of my own digging.</p>",
        "id": 153963936,
        "sender_full_name": "Thomas Gutteridge",
        "timestamp": 1526939917
    },
    {
        "content": "<p>I've manually activated you, so \"forgot password\" should now work for you.</p>",
        "id": 153964007,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526958115
    },
    {
        "content": "<p>Brilliant! Thank you.</p>",
        "id": 153964021,
        "sender_full_name": "Thomas Gutteridge",
        "timestamp": 1526966514
    }
]