[
    {
        "content": "<p>The FHIR DocumentReference resource maps very closely to the XDS metadata in IHE. I have a question regarding a couple of elements.</p>\n<p><a href=\"/user_uploads/10155/gcLT26RGjmNbI5cf_hYrUgdg/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<p>We have a potential use case where we need a document to be identified by two codes (a local code and a national code). In FHIR that's fine as we can place multiple codes in the coding part of the codeableConcept for 'type' and 'class'.</p>\n<p>We are aware that some places may want to replicate the data into an XDS registry and as such the data would find itself within the XDS Metadata construct. Does IHE XDS Metadata support multiple codes or just the one?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/gcLT26RGjmNbI5cf_hYrUgdg/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/gcLT26RGjmNbI5cf_hYrUgdg/pasted_image.png\"></a></div>",
        "id": 153911104,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1506550042
    },
    {
        "content": "<p>XDS supports only a single classCode or typeCode. Traditionally we would expect that the selection of those codes is part of the governance of an affinity domain (for example, only allowing the national codes to be present). You could use eventCodeList for the \"translations\".</p>\n<p>If you have an additional question, I suggest continuing over in the <a href=\"https://chat.fhir.org/#narrow/stream/ihe\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/ihe\">IHE</a> stream.</p>",
        "id": 153911111,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1506551244
    },
    {
        "content": "<p>Thanks for the reply  <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> It's useful input for us. I'll join the IHE stream as I suspect there may be further questions.</p>",
        "id": 153911229,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1506603519
    }
]