[
    {
        "content": "<p>I am trying to store the CCD xml data and the 'Summarization of Episode Note' that is pdf. <br>\nHere are my 2 options I believe, which is recommended?<br>\n1. Create 1 documentReference and add 2 content elements to it, with 1 having attachment of CCD xml, and the other with the pdf? <br>\n2. Create 2 document references, one each for separate documents.</p>\n<p>In the 1st case, where do I say, I have an CCD xml notes / pdf note, that can enable me to search for specific document. I looked at DocumentReference.type, DocumentReference.class - but neither has a place holder for CCD XML.</p>\n<p>The other question is, should I store the data of the attachment as DocumentReference.content.attachment.data or DocumentReference.content.attachment.data as url to a binary resource?</p>",
        "id": 153911558,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1506870911
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"194167\">@Santosh Jami</span> . This is a common situation. The answer is #2. What you need to recognizes is that the two DocumenReference will be related using the relatesTo. I would recommend the DocumentReference that holds the XML will have a relatesTo.code of transforms, with the relatesTo.target of the other DocumentReference that holds the PDF.</p>",
        "id": 153911559,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506872200
    },
    {
        "content": "<p>The other question on format is handled by the content.format element. Take a look at the given vocabulary, where you will find CCD. The difference between XML and PDF is handled by the attachment.contentType</p>",
        "id": 153911560,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506872286
    },
    {
        "content": "<p>Finally, I would recommend you save these as Binary, not as attachment.data. The reason is that a Binary is retrievable in native form. Thus, although when you Create the Binary you must encode; when every one else reads it, they can pull it in the XML or PDF non encoded form.</p>",
        "id": 153911561,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506872358
    },
    {
        "content": "<p>For more on the multiple-formats -- <a href=\"https://healthcaresecprivacy.blogspot.com/2017/03/multiple-formats-of-same-document.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2017/03/multiple-formats-of-same-document.html\">https://healthcaresecprivacy.blogspot.com/2017/03/multiple-formats-of-same-document.html</a></p>",
        "id": 153911562,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506872423
    },
    {
        "content": "<p>For more detail on use of DocumentReference see a Profile of DocumentReference that covers the use-case you have expressed -- IHE-MHD profile -- <a href=\"https://healthcaresecprivacy.blogspot.com/2015/03/what-is-mhd-beyond-xds-on-fhir.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2015/03/what-is-mhd-beyond-xds-on-fhir.html\">https://healthcaresecprivacy.blogspot.com/2015/03/what-is-mhd-beyond-xds-on-fhir.html</a></p>",
        "id": 153911563,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506872486
    },
    {
        "content": "<p>Thanks a lot <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  for your insightful answers and helpful links related to my use case. Yeah - I went with #2. <br>\nIf I need to record any information related to the patient encounter (provider notes, system generated notifications) - I will be continuously editing and updating this item as the new data comes, this is all human readable text - all this needs to go into document reference resource, or any other resource is the recommended way?</p>",
        "id": 153911587,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1506916340
    },
    {
        "content": "<p>I would guess that any 'relevant' change to the encounter would also result in new CDA/PDF documents being created... right? Thus this would also be new DocumentReference resources, with a relaesTo.code of replaces; and the old would then have their .status updated. This may sound like alot of changes, but it is reality. Keeping the old data around is important for medical records keeping and integrity.</p>",
        "id": 153911658,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506948571
    }
]