[
    {
        "content": "<p>Wondering if anyone has used FHIR to document immunity to a disease for a given patient. The immunity might be documented because the patient was diagnosed with a disease (a child had chickenpox so should now be immunity to varicella virus) or it may be inferred from the results of a lab test (serological test for anti-varicella IgG). Would immunity just be inferred from a Condition or Observation (for the two examples respectively) or is there a harmonized way to  indicate immunity (maybe an Observation where .derivedFrom points back to the lab test Observation) regardless of how immunity was determined?</p>",
        "id": 173231127,
        "sender_full_name": "Craig Newman",
        "timestamp": 1565808733
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> this is a PC question?</p>",
        "id": 173260411,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565836265
    },
    {
        "content": "<p>I can certainly raise this question with PC on Thursday (Aug 22).  Speaking as an implementer, though, I've seen all of the following.  In some of our CDS algorithms, we look in multiple places (i.e. don't assume there is always a lab test or condition)<br>\n1) Observation (that represents the lab test, IF one was done)<br>\n2) Immunization (where it is not given with the status not done reason of immunity or already had disease)<br>\n3) Condition when the patient had disease OR Condition of being immune to disease</p>",
        "id": 173544652,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1566222221
    },
    {
        "content": "<p>Patient Care discussed this and generally agreed with the earlier feedback with the addition of a 4th option:<br>\n4) ClinicalImpression.supportingInfo can reference an Observation – if it conveys a clinical assertion / judgment</p>",
        "id": 173927295,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1566513152
    }
]