[
    {
        "content": "<p>Can DocumentReference be used as a pointer to dynamic records/APIs served via a FHIR server?</p>\n<p>Use case: We are building a record locator API. The API currently supports the indexing of document metadata/ locators keyed on patient identifier. We are discussing scaling this up to include an additional pointer (ideally keyed on patient identifier) that could reference a FHIR Server dynamic URL. I see that endpoint has much of what we need however doesn't include the out of the box metadata framework that DocumentReference has and we would like to use. Ideally we want <br>\nto keep the API as simple as possible. Would welcome any thoughts?</p>",
        "id": 153917520,
        "sender_full_name": "Simon Knee",
        "timestamp": 1509702759
    },
    {
        "content": "<p>My recommendation is to define a document format that holds the API endpoint information. Thus what is published with DocumentReference is a static document, where the content of that static document is pointers to your API.  This is not unlike some other content like XDS-I, or XDW, or APPC.</p>",
        "id": 153917561,
        "sender_full_name": "John Moehrke",
        "timestamp": 1509721107
    },
    {
        "content": "<p>Hi John - A document format API definition certainly fits with DocRef semantics. It makes sense that as like XDW (or XDS-I) the doc definition is published solely to be read and acted on by software. I am still trying to get to the bottom of the dynamic API - so don't have an API definition yet.  It is also foggy from a seamless pass-through API perspective - it feels like this approach is more chatty. I need to do some more digging. Thanks S</p>",
        "id": 153917731,
        "sender_full_name": "Simon Knee",
        "timestamp": 1509963675
    },
    {
        "content": "<p>Hi,<br>\nI need understanding about XDS document creation on FHIR using c# coding</p>",
        "id": 153923372,
        "sender_full_name": "shivnath shelake",
        "timestamp": 1512658816
    },
    {
        "content": "<p>Shivnath, see <a href=\"http://wiki.ihe.net/index.php/Mobile_access_to_Health_Documents_(MHD)\" target=\"_blank\" title=\"http://wiki.ihe.net/index.php/Mobile_access_to_Health_Documents_(MHD)\">http://wiki.ihe.net/index.php/Mobile_access_to_Health_Documents_(MHD)</a> for the creation side. But that doesn't address your c# need</p>",
        "id": 153923374,
        "sender_full_name": "John Moehrke",
        "timestamp": 1512659131
    },
    {
        "content": "<p>Thanks John,</p>\n<p>As we have FHIR Care Plan resource  now we have requirement for xds document creation how I can achieve same.</p>",
        "id": 153923377,
        "sender_full_name": "shivnath shelake",
        "timestamp": 1512659624
    },
    {
        "content": "<p>There is a CarePlan profile of CDA found in the C-CDA R2.1 implementation guide. I would expect that the FHIR CarePlan project would have mapping already defined. I am not a careplan expert.  <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> ?</p>",
        "id": 153923378,
        "sender_full_name": "John Moehrke",
        "timestamp": 1512659920
    }
]