[
    {
        "content": "<p>The <a href=\"https://www.hl7.org/fhir/http.html#capabilities\">spec</a> says that servers may choose not to implement the CapabilityStatement interactions, but must return a CapabilityStatement resource from /metadata.  Is the \"id\" required on the resource returned from /metadata?  It isn't clear to me either from the <a href=\"https://www.hl7.org/fhir/http.html#capabilities\">capabilities section of the REST API</a> documentation, or the <a href=\"https://www.hl7.org/fhir/resource.html#id\">Logical ID section of the Resource</a> documentation.  Does /metadata count as \"not associated with a location on a RESTful server\"?</p>",
        "id": 204236963,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1595008226
    },
    {
        "content": "<p>we've actually never talked about this to my memory. And there's not technical requirement that it has an id. I populate it with a fixed value on mine. The applicable language in the spec appears to be:</p>\n<blockquote>\n<p>The resource returned typically has an arbitrary id, and no meta element, though it is not prohibited</p>\n</blockquote>\n<p>So it's not required .</p>",
        "id": 204265271,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1595023676
    },
    {
        "content": "<p>Good Morning/Good Evening. </p>\n<p>I am looking to understand about the implementation of capability statement. I went through the HL7 FHIR documentation but in business use case stand point...when should we use capability statement? and does this solve the problem to restricting the users access to specific resource...</p>\n<p>Trying to understand the workflow here....lets say client wants to access patient resource. Does this user/client request hits the capability statement resource data to validate the level of permissions defined for this user/client and then proceed with allowing access to the actual resource (lets say patient resource)?</p>\n<p>Looking forward to hearing from you. Thanks in Advance.</p>",
        "id": 204641063,
        "sender_full_name": "PKumar",
        "timestamp": 1595406548
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"308105\">@PKumar</span>, thanks for your question. But I noticed that you wrote the same text / question in two different streams (this and HAPI server - Capability Statement and security service). Could you either elaborate the differences of the two streams or tell us which stream we should answer to? Thanks in advance.</p>",
        "id": 204641267,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1595406716
    },
    {
        "content": "<p>Yes <span class=\"user-mention\" data-user-id=\"196115\">@Mareike Przysucha</span>  this stream is right group for the question. Although  I was confused where it fits, so posted in both</p>",
        "id": 204643571,
        "sender_full_name": "PKumar",
        "timestamp": 1595408307
    },
    {
        "content": "<p>Best practice is to only post in one place and post elsewhere only if recommended to do so.  Answer given in the other thread.</p>",
        "id": 204673099,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595428202
    },
    {
        "content": "<p>In addition, start a new topic - this way it helps others who may have similar questions.</p>",
        "id": 204681079,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1595431569
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  and <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> . Sure, I will follow the same. Thank You!</p>",
        "id": 204795716,
        "sender_full_name": "PKumar",
        "timestamp": 1595510422
    }
]