[
    {
        "content": "<p>We are specifying Dosage Timing (FHIR R4). </p>\n<p>We have a use case where we have boundsRange, saying for example 10-15 days. But then we also have to give the start date, saying for example start on 2021-01-15. </p>\n<p>Another use case is similar but with boundsDuration, saying for example 5 days, start on 2021-01-15. </p>\n<p>Timing's bounds[x] is 0..1 so only boundsDuration or boundsRange or boundsPeriod can be used (but not boundsRange or boundsDuration  at the same time with boundsPeriod, which is our need). How those use cases can be presented? In boundsDuration case, the end date can be calculated but boundsRange case needs at the same time both boundsRange and boundsPeriod. And I think that the users want also support for giving at the same time boundsDuration and boundsPeriod (of course this can be done under the hood of implementations).</p>\n<p>Do we have to extend boundsDuration (Duration data type) and boundsRange (Range data type) with startdate?</p>",
        "id": 222684626,
        "sender_full_name": "Mika Tuomainen",
        "timestamp": 1610607089
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span></p>",
        "id": 222790053,
        "sender_full_name": "Melva Peters",
        "timestamp": 1610661278
    },
    {
        "content": "<p>in the case of you having a duration and a start date, why wouldn't use just use the period?  so you know that it starts on 2021-01-15 and lasts for 5 days, so send (2021-01-15,2021-01-19).</p>\n<p>I do agree however that the boundsRange is problematic.  There is really no way to say \"start taking this on 2021-01-15 and take it for 10-15 days\".</p>",
        "id": 222790875,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1610661654
    },
    {
        "content": "<p>can you raise a Jira issue about this?  I think that the committee should look at adding something to Timing to allow for an optional start date to be specified.  We had another issue where someone wanted to say \"do this on these days and do this other thing on these other days\" and we had no real way to specify when one instruction started and when the other one started and a startDate would have been useful.</p>",
        "id": 222791401,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1610661948
    },
    {
        "content": "<p>On the Schedule of Activities track we were just looking at essentially the same problem.  We need to say a study activity should happen on day 10 but it is allowed a range from day 9 to day 13.  The fact that the range is asymmetric around the desired point means you have to have all three values.  In PlanDefinition.action.relatedAction the offset only allows one of duration or range. <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  are we missing something?</p>",
        "id": 222793202,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1610662644
    },
    {
        "content": "<p>That's interesting, it's saying 9 to 13 is good, but 10 is best. You're right there's not a good way to say that right now, perhaps an extension, something like \"optimalOffset\", also a duration or range?</p>",
        "id": 222799955,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1610666547
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-31559\">https://jira.hl7.org/browse/FHIR-31559</a></p>",
        "id": 230681610,
        "sender_full_name": "Mika Tuomainen",
        "timestamp": 1615984320
    }
]