[
    {
        "content": "<p>Hi all, which one of the classification systems shall I pick  to group medications in a MedicationStatement?</p>",
        "id": 153926626,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1513836048
    },
    {
        "content": "<p>That's a business requirement question, not a FHIR requirement question.  Where is your requirement to group them at all coming from?  Ask whoever wants them grouped in the first place :)</p>",
        "id": 153926627,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513836773
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I just want to group the list of medications from a MedicationStatement of a patient, on the basis of a drug classification system. What would you suggest me?</p>",
        "id": 153926628,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1513837007
    },
    {
        "content": "<p>But why do you want to group them?  What's the purpose of the grouping?  What do your clinicians want?  What classifications are mapped to the codes you're using for your medications?  The answers to those questions are going to drive your choice.  It's not one we can answer here without much more context about what you're trying to do and where you are.</p>",
        "id": 153926633,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513839613
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Which one of the following do you suggest?<br>\n1. grouping the medications on the basis of disease <br>\n2. grouping the medications on the basis of type (analgesics, anti-histamines etc)<br>\nThank you</p>",
        "id": 153926788,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1513922903
    },
    {
        "content": "<p>That's a system design question - it depends what your users want.  It's not a given that any grouping is required.  If grouping is required, it might be by indication, drug class, prescriber, time-period started, time-period last taken, chronic vs. accute, or any number of possibilities.  Some systems might let the user sort and organize the medications as they see fit.  You'll need to talk with your users or your client about their expectations/desires/needs and design your system accordingly.</p>",
        "id": 153926832,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513962369
    },
    {
        "content": "<p>I agree completely with Lloyd, this is a question for the users of your system.  There are lots that can be considered but it will depend on the requirements.</p>",
        "id": 153927080,
        "sender_full_name": "Melva Peters",
        "timestamp": 1514402104
    }
]