[
    {
        "content": "<p>What is the preferred resource type and data parameters to send back for drug drug interactions?  If someone where to send me a list of ndcs or rxcuis, what endpoint would I have them hit? How would I structure a response from that end point if I have 2 drugs with rxcuis and message of text that  describes the interaction?</p>",
        "id": 154012721,
        "sender_full_name": "Nathan Hall",
        "timestamp": 1540581353
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span></p>",
        "id": 154012738,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540586707
    },
    {
        "content": "<p>i think that there should be a construct in FHIR for this kind of things. Indicated for, contraindicated with.... I don't know enough to see if there is anything that while specific would cover 80% of the cases.</p>",
        "id": 154012739,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540586791
    },
    {
        "content": "<p>but Pharm and BRR are looking at resources to define  a medicinal product, that discussion does contain the information you look for</p>",
        "id": 154012740,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1540586852
    },
    {
        "content": "<p>Currently this can be use the draft resource MedicinalProductInteraction. See <a href=\"http://build.fhir.org/medicinalproductinteraction.html\" target=\"_blank\" title=\"http://build.fhir.org/medicinalproductinteraction.html\">http://build.fhir.org/medicinalproductinteraction.html</a>. We would definitely be interested to know if this resource covers what you want. It is modelled based on what is needed for the ISO IDMP standard.</p>",
        "id": 154012853,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540648391
    },
    {
        "content": "<p>that's perfect.  thank you.</p>",
        "id": 154013211,
        "sender_full_name": "Nathan Hall",
        "timestamp": 1540819713
    },
    {
        "content": "<p>Hello Rik. An important factor in medication interactions is the 'severity' of the interaction. In the UK this is defined by four levels of severity: 1 - 4 with 4 being the most severe i.e. a contra-indication. Can the interaction severity be easily recorded using the current interaction definition structure? Thanks and regards. Andrew</p>",
        "id": 154013315,
        "sender_full_name": "Andrew Gledhill",
        "timestamp": 1540834384
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"195487\">@Andrew Gledhill</span> , there is MedicinalProductInteraction.effect which can use any set of codes. So that could possibly be \"interaction of severity 1\", \"interaction of severity 2\" etc, or whatever the appropriate text is. But I think it may be reasonable to add a specific \"severity\" attribute. We would need to be careful to distinguish between effect (which could include a severity) and a dedicated severity. Any ideas here of how a range of systems typically record potential effects and or severity would be helpful here. The IDMP concept of Interaction.effect is more specific than severity, such as \"gastric absorption of primary medication impaired\".</p>",
        "id": 154013698,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1540918412
    },
    {
        "content": "<p>And how interoperable a coded severity could be.</p>",
        "id": 154013941,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1540946659
    },
    {
        "content": "<p>And if that is expected to be able to be ordered</p>",
        "id": 154013942,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1540946690
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191487\">@Russell Leftwich</span></p>",
        "id": 154016973,
        "sender_full_name": "Robert McClure",
        "timestamp": 1541722778
    }
]