[
    {
        "content": "<p>Happy Friday! It looks like many on this list are already implementing DSTU3. Is there any concern of implementing something from DSTU3 that may change before the cutoff date? In other words, we are doing mobile application refactoring to utilize a HAPI FHIR API and FHIR-based database structure using DSTU2. Could we actually be using DSTU3 now? We were initially concerned with doing this given things could change. Please redirect me if I am missing something in terms of risk of implementing DSTU2 vs DSTU3 given DSTU3 will be finalized in March 2017 hopefully. Thanks in advance for your comments!</p>",
        "id": 153870993,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1486748457
    },
    {
        "content": "<p>I can't speak for everyone, but one usecase I know of that is driving people to implement an STU3 snapshot is that the resources have changed significantly since DSTU2, and/or have not been as usable in DSTU2, so going with DSTU2 would have been a bit of a waste</p>",
        "id": 153870995,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1486748594
    },
    {
        "content": "<p>I have the same question as <span class=\"user-mention\" data-user-id=\"193326\">@Lauren Wolejsza</span> except our engineers are focusing on the FHIR server requirements for our EHR to meet the ONC 2015 Patient API data category - much appreciated if anyone can address.</p>",
        "id": 153870996,
        "sender_full_name": "May Terry",
        "timestamp": 1486748605
    },
    {
        "content": "<p>Yes, exactly. We are certainly encountering quite a few limitations. We are very early in our development so choosing to move to DSTU3 at this point would be better than more rework later. Hesitation from our client is DSTU3 is not yet \"finalized\" so to speak.</p>",
        "id": 153870997,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1486748744
    },
    {
        "content": "<p>It might be easier for them to know that it's no longer Draft, so it's STU3. There also national-level implementations of STU3 at this point - Australia for example hosts a terminology server for the entire nation that's based on FHIR 1.4.0 (<a href=\"https://www.healthterminologies.gov.au/ncts/#/tools?content=nts\" target=\"_blank\" title=\"https://www.healthterminologies.gov.au/ncts/#/tools?content=nts\">https://www.healthterminologies.gov.au/ncts/#/tools?content=nts</a>). I'm sure there are other examples.</p>",
        "id": 153870998,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1486748953
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196282\">@May Terry</span> We are doing patient-generated health data (PGHD) from mobile applications so lots of open text data to be pointed to a FHIR resource field. Certainly having some challenges in doing this kind of mapping.</p>",
        "id": 153871000,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1486749036
    },
    {
        "content": "<p>Lauren, I agree with Vadim's comment that it would be a waste of time to start new implementation using DSTU2 at this time.  Changes to the STU3 resoruces will be frozen by end of February, and most substative changes have already been applied.  For development and testing prior to end of March, there are numerous servers, including HAPI, that support FHIR 1.8.0 (Jan 2017 freeze).  See the STU3 publication timeline at <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Ballot_Prep\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Ballot_Prep\">http://wiki.hl7.org/index.php?title=FHIR_Ballot_Prep</a> </p>",
        "id": 153871002,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1486749693
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197476\">@Dave Carlson</span> This is a great point. Now to try to see what we can do. At the time of the decision, we did not know the timeline for release of DSTU3. Now, I know differently. Thank you!</p>",
        "id": 153871003,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1486750162
    },
    {
        "content": "<p>Thanks Dave and Lauren!  This is super-helpful!</p>",
        "id": 153871004,
        "sender_full_name": "May Terry",
        "timestamp": 1486750306
    },
    {
        "content": "<p>Lauren and May, for immediate development and prototyping (before end of March), I suggest using FHIR 1.8.0 specifications and HAPI (or other) servers that currently support this version, see <a href=\"http://hl7.org/fhir/2017Jan/index.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2017Jan/index.html\">http://hl7.org/fhir/2017Jan/index.html</a>.  When making longer-term design choices, compare with the Continuous Integration build specs until finalized with STU3 publication, see <a href=\"http://build.fhir.org/index.html\" target=\"_blank\" title=\"http://build.fhir.org/index.html\">http://build.fhir.org/index.html</a> </p>",
        "id": 153871009,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1486750760
    },
    {
        "content": "<p>Thanks! Very good to know. Already talking to our project management about this. Strategic decision to be made for sure. Have a nice weekend!</p>",
        "id": 153871011,
        "sender_full_name": "Lauren Wolejsza",
        "timestamp": 1486751838
    },
    {
        "content": "<p>Thanks as well!  I'll make these recommendations to our engineers accordingly and look into the HAPI library versions for support.  Cheers!</p>",
        "id": 153871015,
        "sender_full_name": "May Terry",
        "timestamp": 1486752244
    },
    {
        "content": "<p>roadmap: <a href=\"https://onfhir.hl7.org/2017/01/20/fhir-product-roadmap/\" target=\"_blank\" title=\"https://onfhir.hl7.org/2017/01/20/fhir-product-roadmap/\">https://onfhir.hl7.org/2017/01/20/fhir-product-roadmap/</a></p>",
        "id": 153871056,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486766690
    }
]