[
    {
        "content": "<p>We need to map a \"task\" in our EHR into both DSTU2 and R4. I see there is a Task resource from STU3/R4 but the closest I found in DSTU2 was Order (under Workflow). As per the description, an Order can be used to carry out an action request, and designed in a generic way. My questions/concerns are:<br>\n1) Is there any other \"closer\" resource in DSTU2 for a task?<br>\n2) Other order resources (DiagnosticOrder, NutritionOrder, MedicationOrder ) are all clinical. Therefore using the Workflow/Order seems more logical for a task. </p>\n<p>Thanks In advance!</p>",
        "id": 223217956,
        "sender_full_name": "Janaka Peiris",
        "timestamp": 1611058609
    },
    {
        "content": "<ol>\n<li>No.  And 'Order' was somewhat broken, so be prepared to use extensions or otherwise be creative to make it work.  (Alternatively, you could use Basic.)</li>\n<li>Not all of the request resources are clinical.  ServiceRequest can cover quite a lot of things (ProcedureRequest in DSTU2).  Keep in mind that 'Request' resources represent an authorization, while Task initiates action (sometimes based on an authorization, sometimes not).</li>\n</ol>",
        "id": 223242966,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611070206
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . Will use Basic resource with some extensions.</p>",
        "id": 223345853,
        "sender_full_name": "Janaka Peiris",
        "timestamp": 1611132833
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> regarding \"'Request' resources represent an authorization\", if a request processor wants to make an update to the ServiceRequest, such as adding a not or a performer - Is that something the request processor is \"allowed\" to do, since it modifies the authorization? Is there a most typical workflow for this kind of process?</p>",
        "id": 229853983,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1615472015
    },
    {
        "content": "<p>I think usually the processor will not have access to modify the ServiceRequest, in fact there might be two different ServiceRequests: one on the requester's server, and one on the request processor's server. This is where Task could have a role similar to an \"interface\" between the requester and processor: The processor can modify the Task resource, and the requester can act on that modification to update the ServiceRequest.</p>",
        "id": 229862712,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1615474932
    },
    {
        "content": "<p>FHIR places no limitations.  FHIR is totally happy if you update a prescription and change the drug, dose, patient and prescriber.  Most colleges of pharmacy would frown on that though...</p>\n<p>Often both the 'placing' and 'filling' system will have a Request instance.  The 'filler' one reflects the details of what they actually intend to do.  The placer one reflects what's 'authorized'.  How much variation between the two varies based on business rules, who's making the decisions, etc.  Task provides the communication vehicle to negotiate fulfillment and keep both parties up-to-date on status.</p>",
        "id": 229884834,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615481849
    }
]