[
    {
        "content": "<p>Hi All</p>\n<p>We are currently still using DSTU2, we have a \"Schedule\" resource where the 'actor' element is a mandatory reference to a location resource. We also have an extension to allow the providers to add a Practitioner to the schedule by reference to a Practitioner Resource. </p>\n<p>We are  trying to work out how to represent an _include parameter in the request to ask for the referenced Practitioner Resource within the custom Schedule Resource extension.</p>\n<p>_include= Schedule:actor:Location - this is the parameter for the inclusion of the mandatory location resource</p>\n<p>What would be the _include parameter format for the extension:</p>\n<p>_include= Schedule:extension:Practitioner - ?</p>\n<p>Thanks<br>\nJames</p>",
        "id": 153912072,
        "sender_full_name": "James Cox",
        "timestamp": 1507040340
    },
    {
        "content": "<p>To search on extensions, you need to define your own custom SearchParameter (which can have whatever name you like)</p>",
        "id": 153912096,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507058650
    },
    {
        "content": "<p>_include can only use searchparameters. So you would need to first define a SearchParameter on Schedule with an xpath that extracts the reference to the Practitioner, let's say it has the name 'practitioner'. Then your server must understand this custom SearchParameter. And then you can use _include=Schedule:practitioner</p>",
        "id": 153912097,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1507058660
    },
    {
        "content": "<p>The server declares what it is in its Conformance/CapabilityStatement</p>",
        "id": 153912098,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507058670
    },
    {
        "content": "<p>Thanks for your quick response, your answers were very helpful.</p>",
        "id": 153912230,
        "sender_full_name": "James Cox",
        "timestamp": 1507101810
    }
]