[
    {
        "content": "<p>Hi, We are implementing FHIR in our development and planning to deploy in production dec-2016 .my question is which version of FHIR should we use DSTU2 or STU3 version</p>",
        "id": 153845277,
        "sender_full_name": "Sanu Singh",
        "timestamp": 1472233827
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192196\">@Sanu Singh</span> if you have no code and no external dependencies and don't mind minor changes the answer is simple: STU3, if you want the version that will look more like the normative standard (when it gets there), STU3</p>\n<p>Having said that, you need to realize that STU3 is in ballot at this moment, there will be a LARGE number of changes to STU3 between now and the end of October (possibly sooner depending on the number of ballot comments and whether Grahame will accept an IV that supplies caffiene to keep him awake 24h/day and prevents him from leaving his desk for distractions like eating). If you are comfortable with the standard changing while you use that is the decision you must make.</p>\n<p>On the other hand DSTU2 will not change because the changes needed are what went into making STU3. Fewer and fewer people will support DSTU2 or wish to support DSTU2 going forward. You will be implementing against something that is effectively replaced. If you are only using it internally and DSTU2 supports everything that you need and stability is your most important consideration then DSTU2 might be a better choice</p>",
        "id": 153845278,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1472235169
    },
    {
        "content": "<p>Thank you Andy for quick response.</p>",
        "id": 153845279,
        "sender_full_name": "Sanu Singh",
        "timestamp": 1472237210
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span> we need to find a way to feed... coffee... to all the committees.. Though you might argue that there would be a more appropriate drug to give committees to improve the rate at which the come to agreement, not just the number of hours that they have to try</p>",
        "id": 153845285,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472242938
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192196\">@Sanu Singh</span> Andy's analysis is correct, of course. Though on this same analysis, I reach a different conclusion.</p>\n<p>If you want to publish something in December 2016, I think you want to target DSTU2, because (to my mind!) it exists as an official draft. If you target STU3 right now, you'll have a moving target. In the Argonaut Implementation Program, for example, our decision has been to target \"the current release of FHIR\", which means DSTU2 until STU3 comes out.</p>",
        "id": 153845432,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1472484550
    },
    {
        "content": "<p>My bottom line: if you want to publish services that you plan to support for 12+ months, it makes sense to stick to official published FHIR releases.</p>",
        "id": 153845433,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1472484638
    }
]