[
    {
        "content": "<p>I just opened a GForge item (<a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20339\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20339\">#20339</a>) to make a suggestion for the upcoming R3 technical corrections, cf. <a href=\"#narrow/stream/179240-Announcements/topic/Technical.20corrections.20for.20FHIR.20R3\" title=\"#narrow/stream/179240-Announcements/topic/Technical.20corrections.20for.20FHIR.20R3\">the associated thread on the Announcements stream</a>. If I understood the discussion there correctly, one should first create a tracker and then change the target specification to \"FHIRSpecificaition:DSTU3Release\". However, once I have created the tracker, I can't seem to change the Target release (although the bread-crumb trail at the top says \"Edit Tracker Item\") - as far as I can tell, I can only add follow-ups. Am I missing something obvious or are there different permission levels?</p>",
        "id": 157358362,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1549033155
    },
    {
        "content": "<p>I've never been able to edit my GForge issues after I submit them either.  The best I've been able to do is add a comment indicated what should be changed in the issue.  It would be nice if we were allowed to edit our own issues.</p>",
        "id": 157358522,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1549033262
    },
    {
        "content": "<p>Only \"managers\" can edit tracker items.  You can however add a comment indicating your intent and someone else can make the change for you.  (In practice, targetRelease is only supposed to be specified once the change is approved, so capturing it in a comment for now is appropriate.)</p>",
        "id": 157362247,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1549036084
    },
    {
        "content": "<p>OK, will do, thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 157362308,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1549036154
    }
]