[
    {
        "content": "<p>Hello,</p>",
        "id": 153852179,
        "sender_full_name": "sp",
        "timestamp": 1475781428
    },
    {
        "content": "<p>I am new here. I was wondering if EHR implemented with NodeJS and FHIR has been done before on open stack?</p>",
        "id": 153852180,
        "sender_full_name": "sp",
        "timestamp": 1475781474
    },
    {
        "content": "<p>An EHR tends to have a minimum of 30 modules/applets, and averages over a hundred applets.  So any Node based EHR is going to require an entire tech stack and SDK.  We've been working on such a stack over in the Meteor community, and have a custom distro called 'Clinical Meteor'.  </p>\n<p><a href=\"https://www.meteor.com/\" target=\"_blank\" title=\"https://www.meteor.com/\">https://www.meteor.com/</a><br>\n<a href=\"http://clinical.meteorapp.com/\" target=\"_blank\" title=\"http://clinical.meteorapp.com/\">http://clinical.meteorapp.com/</a></p>\n<p>There's been about 40 module prototypes completed so far; the demo app catalog has a dozen reference apps to work from, and we currently have about 30/100 FHIR resources implemented.  There are businesses  within the Meteor ecosystem running practice management, laboratory, radiology, pharmacy, and intensive care units using components from Clinical Meteor; but those apps haven't made their way back into the open stack.  However, we're getting close to having a Health Information Exchange (HIE) in the open stack (the Meteor on FHIR app); which we use as a boilerplate and fork from when starting new apps.  </p>\n<p><a href=\"https://github.com/clinical-meteor/meteor-on-fhir\" target=\"_blank\" title=\"https://github.com/clinical-meteor/meteor-on-fhir\">https://github.com/clinical-meteor/meteor-on-fhir</a></p>\n<p>Disclaimer:  This is part of my master's thesis and capstone project for a MSc. Biomedical Informatics.  </p>",
        "id": 153852707,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1476294356
    }
]