[
    {
        "content": "<p>Hello everyone. When we talk about the EHR systems implmented by FHIR server  we should mention the way by which the data should be stored in the FHIR database. For example we can use a FHIR server to store all the medical data events related to a patient, but when we would like to get this data back, sorted by the datetime occurred, we can't use a single query to achieve that. I have read the specification \"How FHIR fits into an EHR\", it not answers my question how I can implement event trail from all the events related to a patient in a form of EHR. Is it possible for example to use a Composition resource to  bind all the resources which are created in a single period of time in a form of event and then we can use a search over the Compose collection? How do you think is it a good idea?</p>",
        "id": 183538417,
        "sender_full_name": "Dimitar Dimitrov",
        "timestamp": 1576493689
    },
    {
        "content": "<p>well, you can use a composition like that-  that's pretty much how EN13606 envisages it being used. And then you could search for compositions, yes... for what that's worth</p>",
        "id": 183538842,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576494025
    },
    {
        "content": "<p>the problem is that there's real subtle but important complexity here. Are you building a time line of time things were added to the record, or the real world time that they matter about? Compsotion will bind you to the first, but you probably mean the second. And then, which events are you interested in? inpatients can generate 1000s of events a day.</p>",
        "id": 183538974,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576494124
    },
    {
        "content": "<p>you need to inject some judgement into the timeline to make it consumable. I think that this is why we haven't got people clamouring to get a single query that can build that.</p>",
        "id": 183539017,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576494182
    },
    {
        "content": "<p>though there's something close... cross resource search with common date parameters</p>",
        "id": 183539042,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576494202
    },
    {
        "content": "<p>1000s of events a day, which could be explicitly captured by having 1000s of Topic resources, each representing 1 event. Keep in mind that FHIR is NOT an EHR standard but an interoperability standard, so you may have to capture things like events in a non-FHIR way. Or as a Basic resource if it really has to be FHIR only.</p>",
        "id": 183539580,
        "sender_full_name": "René Spronk",
        "timestamp": 1576494704
    }
]