[
    {
        "content": "<p>There doesn’t seem to be a consistently applied way of representing an empty list of things (like Allergies, Medications or Conditions). </p>\n<p>The spec itself seems to take a ‘dollar each way’ approach – eg in AllergyIntolerance it recommends using List, but then states to use an instance of AllergyIntolerance.code with the value of code to be ‘no known allergies’ during STU. </p>\n<p>Looking at IG’s like IPS (International Patient Summary) it uses a Composition – but instead of using the section.emptyReason for an empty list, you populate the section with a resource that states that there are no resources, and why. That seems – odd.</p>\n<p>I’d like to propose that for IG’s that use Composition, section.emptyReason should be used for empty lists, and otherwise use List.emptyReason</p>",
        "id": 159749917,
        "sender_full_name": "David Hay",
        "timestamp": 1551475083
    },
    {
        "content": "<p>In Argonaut, they don't use List at all (and they're not using Composition).  List.emptyReason only works well if the system is using List which involves having some sort of a curated list.  So I think we need to allow for the notion of a record that says \"no known allergies\" or \"no known medications\".  Agree that that approach should <em>not</em> be used together with Composition or List though.</p>",
        "id": 159750473,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551475519
    },
    {
        "content": "<p>You could argue that an extraction from an EHR / EMR would generally be a curated list (ie the clinician has populated a List in the EHR/EMR - including 'no known allergies'. Perhaps argonaut should be looking at List also...</p>",
        "id": 159750882,
        "sender_full_name": "David Hay",
        "timestamp": 1551475864
    },
    {
        "content": "<p>List in argonaut was long debated.  They just want to expose meds and allergies by direct query, not by first hitting a list and then grabbing all of the referenced resources.</p>",
        "id": 159750968,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551475937
    },
    {
        "content": "<p>Essentially the \"List\" is everything that's available and thus is redundant, and having to hit the List resource only to find records of \"none known\" was deemed to be confusing/inefficient</p>",
        "id": 159751070,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551476039
    },
    {
        "content": "<p>(Note: I'm not necessarily a fan of the decision, I'm just reflecting what was decided and why :))</p>",
        "id": 159751150,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551476073
    },
    {
        "content": "<p>Yes, that was pretty much the thought process for the Argonaut decision.  In IPS, I think we landed on the current approach primarily because it was consistent with the way that we did it in CDA - using an explicit declaration of absence (and there isn't an equivalent of section.emptyReason in CDA, of course).  It may be time, though, to reconsider adopting a more thoroughly \"FHIR-like\" approach for the FHIR IPS IG.  I guess it would have been nice to have suggestions like this (and others that we've recently gotten related to the Argonaut comparison) in ballot comments, but we all know it doesn't necessarily go that way.</p>",
        "id": 159752112,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1551476861
    },
    {
        "content": "<p>Not directly related but this 'empty list', especially of Allergies reminds me of the notion of 'state' in V2 AL1 vs IAM --- that is, snapshot mode vs update mode.  If I remember right, FHIR only supports 'snapshot' mode.   So, the question then becomes, how would a system 'clear out' a previously documented Allergy (AllergyIntollerance resource) for a patient?</p>",
        "id": 159755732,
        "sender_full_name": "John Silva",
        "timestamp": 1551479914
    },
    {
        "content": "<p>Delete</p>",
        "id": 159773849,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551494639
    },
    {
        "content": "<p>I am not a fan of Argonaut's decision on this at all. I think it will turn out to be problematic. But it's made, and so I think it's best to stick with it. For that reason, we should document best practice for various negation statement variants for medication, allergy, problem and history list, and have them in the relevant resources, and IPS should follow argonaut practice</p>",
        "id": 159778833,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551503754
    },
    {
        "content": "<p>I agre ewith <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> that this is the kind of feedback that should come through ballot, but it hasn't - I'm working on driving alignment here and will hopefully be closer to balloting this stuff in the future. (And thanks to <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> for doing a formal review which has driven dsicussion on the <a class=\"stream\" data-stream-id=\"179175\" href=\"/#narrow/stream/179175-argonaut\">#argonaut</a> channel)</p>",
        "id": 159778927,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551503841
    },
    {
        "content": "<p>Reflects disconnect between perception and reality of hl7 ballot.</p>",
        "id": 159805941,
        "sender_full_name": "Eric Haas",
        "timestamp": 1551546154
    },
    {
        "content": "<p>really? A potentially problematic decision that can't be re-addressed just because people are using it? Why then, have Composition.section.emptyReason at all? ie when would that be used, if the pattern is to populate empty sections with a representative resource with a code set to 'no data' (and any required fields set to some pre-determined value)?</p>",
        "id": 159812858,
        "sender_full_name": "David Hay",
        "timestamp": 1551557640
    },
    {
        "content": "<p>btw - to be clear, I'm talking  about when Composition is present - ie a record summary rather than a direct request for a resource like AllergyIntolerance (where the code approach seems reasonable)...</p>",
        "id": 159813162,
        "sender_full_name": "David Hay",
        "timestamp": 1551558183
    },
    {
        "content": "<p>I may have missed the initial debate, but if we represent NKA-type scenarios using List or Composition, how does that work with AllergyIntolerance.search?  Or are we suggesting that folks not use AllergyIntolerance.search at all, and instead use List/Composition instead?</p>",
        "id": 160016028,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1551802592
    },
    {
        "content": "<p>The notion is that you'd query the List to return the patient's list of allergies - because there are reasons for servers to store AllergyIntolerance records that aren't necessarily part of a currated list - data received from elsewhere that's duplicate/outdated, etc.</p>",
        "id": 160017041,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551803259
    },
    {
        "content": "<p>I feel like if we took that approach, I'd have to constantly explain the how and why to every app developer, even if we have good doco around it.  Since AllergyIntolerance.search is the intuitive way to get patient allergies, it seems better to annotate the resources with their status with respect to a being part of the curated chart vs. being  duplicate/outdated.</p>",
        "id": 160017827,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1551803710
    },
    {
        "content": "<p>The problem is that there are times when you need to take in external data and leave it \"as is\" - no annotation - or at least no annotation other than tags, which most systems wouldn't pay attention to.</p>",
        "id": 160018725,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551804394
    },
    {
        "content": "<p>The EHRs bury all of that stuff elsewhere right now - allergies coming in from CDA documents, etc. don't get exposed in their allergy interfaces.  However if they had a FHIR-based repository, they'd have to be.</p>",
        "id": 160018768,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551804445
    },
    {
        "content": "<p>That's why they went with the easy/intuitive route.  Even though it may eventually cause pain/problems.</p>",
        "id": 160018860,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551804498
    },
    {
        "content": "<p>we defined $list so you could stick to the search interface, but it doesn't deal with NKA.</p>",
        "id": 160023069,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551807571
    },
    {
        "content": "<p>Maybe my worldview is a little EHR-centric, but do we expect many non-EHRs to implement Argonaut?</p>",
        "id": 160025913,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1551809842
    },
    {
        "content": "<p>yes. all consumers. But argonaut decisions have a power of their own. I think it's wrong even for EHRs - eventually Argonaut vendors will find that the decisions they've made will make it impossible to share information across the argonaut interface.</p>",
        "id": 160026103,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551809967
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> regarding the issue of keeping external data \"as is\" - if systems do actually need to do that, doesn't that same problem apply to all resources in the spec, and not just for what is included in Argonaut?  Doesn't that suggest we'd have to abandon the idea of a search interaction completely?</p>",
        "id": 160027717,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1551810987
    },
    {
        "content": "<p>that seems like a big jump</p>",
        "id": 160027758,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551811019
    },
    {
        "content": "<p>Right.  I can't really understand how a system can really expose \"as-is\" resources without massive side effects.  That would push data de-duplication to the client, which is a huge lift.  I guess I'm basically just saying I don't buy (or don't fully understand) the \"as-is\" issue.</p>",
        "id": 160027910,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1551811105
    },
    {
        "content": "<p>why would it create a de-duplication problem? I think you're imagining that the EHR would stop doing list management... but no.</p>",
        "id": 160028015,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551811174
    },
    {
        "content": "<p>Sort of spit-balling here, but another way to solve this is to put the annotation within the Bundle entry on the search response rather than <em>in</em> the resource.   Obviously would need updates/extensions to Bundle, and I'm sure there are all sorts of reasons I'm not considering regarding the impact to Bundle.</p>",
        "id": 160028909,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1551811660
    },
    {
        "content": "<p>I do want to call out that at least for allergies (and yes, this goes back to all the negation talks) that NKA and NKMA can be represented by search. Those are codes that are included in the value set for the Allergy.code</p>",
        "id": 160029749,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1551812206
    },
    {
        "content": "<p>For eg, our documentation for our FHIR allergy search calls these out: <a href=\"https://fhir.cerner.com/millennium/dstu2/general-clinical/allergy-intolerance/#overview\" target=\"_blank\" title=\"https://fhir.cerner.com/millennium/dstu2/general-clinical/allergy-intolerance/#overview\">https://fhir.cerner.com/millennium/dstu2/general-clinical/allergy-intolerance/#overview</a></p>",
        "id": 160029813,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1551812259
    },
    {
        "content": "<p>That's true, but they don't work if the AllergyIntolerance repository is a conglomeration of data from all over - because you might have 5 NKAs from different times plus a bunch of allergies that conflict with the NKA assertion.  NKA only works if you're \"generating\" that from a currated flag in a repository.</p>",
        "id": 160029832,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551812274
    },
    {
        "content": "<p>As to CCDA not showing in the list... for our implementation the goal is to show the same list the clinician can see and make decisions on. If they chose to bring an allergy into the formal clinical record, then I would expect it to show in the allergy list (and ideally have provenance stating where it came from)</p>",
        "id": 160029936,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1551812335
    },
    {
        "content": "<p>Contrast this with how Observations work where we accept that there's a grab-bag of observations from all over the place, some of which will say conflicting things because they're from different sources and different timestamps.  If you do a query and get back two different blood types for the same patient, you're going to ask questions, but it's certainly a possibility.</p>",
        "id": 160029950,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551812343
    },
    {
        "content": "<p>If you don't limit an allergy by status, you're also likely to see older allergies that are no longer active and could be conflicting as well</p>",
        "id": 160029998,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1551812385
    },
    {
        "content": "<p>but yes, I think there are definitely going to be challenges with representing the \"full document store\" type approach vs. a system that is representing the full legal record/known record.</p>",
        "id": 160030108,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1551812430
    },
    {
        "content": "<p>An allergy/intolerance collection/list/group is basically a set of risk assessments made at specific points in time. It's perfectly feasible to have several NKA, NKDA records in that collection, particularly if derived from multiple sources.</p>",
        "id": 160030128,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1551812457
    },
    {
        "content": "<p>I'm not sure that eliminates search as an option, but it does start to ask questions around: how does the server take on de-duping or allow the client to ask the server to take on that effort</p>",
        "id": 160030149,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1551812469
    },
    {
        "content": "<p>and I think that's where you all are saying list is the formal way to do that?</p>",
        "id": 160030158,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1551812481
    },
    {
        "content": "<p>but I'm not sure I'm there yet... I agree it's a challenge, I wonder if it's solvable another way (for the \"active\" list - absolutely agree that other types of controlled and curated lists may need special consideration)</p>",
        "id": 160030247,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1551812532
    },
    {
        "content": "<p>that's what the $list parameter is for.</p>",
        "id": 160030261,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551812544
    },
    {
        "content": "<p>because the client can't and shouldn't take on de-duplication but that's irrelevant. What it needs to take on is understanding the context of the information</p>",
        "id": 160030295,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551812573
    },
    {
        "content": "<p>the argonaut interface simplifies matters because there is no context- it's just the current list. That is great until it's no longer true</p>",
        "id": 160030351,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551812604
    },
    {
        "content": "<p>Static lists v a dynamic, real-time, event-driven health &amp; wellness record.</p>",
        "id": 160030548,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1551812723
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179166-implementers/topic/Empty.20lists/near/160030261\">said</a>:</p>\n<blockquote>\n<p>that's what the $list parameter is for.</p>\n</blockquote>\n<p>The $list parameter ? I see _list, and I see $find. Not connecting the dots.</p>\n<p>Seems like the list could have a useful empty reason if it's curated, with a shelf life.</p>",
        "id": 211197808,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1600986968
    },
    {
        "content": "<p>_list - you're right</p>",
        "id": 211202983,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600990701
    }
]