[
    {
        "content": "<p>In the empty list reason codes the option for not asked describes it as,</p>\n<p>'The investigation to find out whether there are items for this list has not occurred.'</p>\n<p>My interpretation of this is that the clinical investigation for this has not happened. For example if it was a list of allergies that was empty then 'not asked' should be used when the clinician has not asked patient about allergies hence allergy is empty in EMR.</p>\n<p>If the record contains a 'no known allergies' code this would imply the clinician has asked the patient and the 'nil known' reason code should be used.</p>\n<p>Is my understanding of this correct?</p>",
        "id": 153940097,
        "sender_full_name": "Pete Salisbury",
        "timestamp": 1519390686
    },
    {
        "content": "<p>Yes</p>",
        "id": 153940116,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519400781
    },
    {
        "content": "<p>Thanks Lloyd</p>",
        "id": 153940125,
        "sender_full_name": "Pete Salisbury",
        "timestamp": 1519402496
    },
    {
        "content": "<p>Is there a recommendation for when a list is empty because there is no data relevant to a particular list? For example where there is no allergy information on the sending system but there was no specific patient encounter at which the 'not asked' would be valid and therefore 'nil known' could also not be asserted. It would seem that the null flavours 'unknown' or 'no information' would be more appropriate. The use case is where an allergy list is constructed in response to a query and there is no data to return.</p>",
        "id": 153940954,
        "sender_full_name": "Andrew Perry",
        "timestamp": 1519748936
    },
    {
        "content": "<p>certainly not nil known. You could use a data absent reason. In fact, the recommended value set should include some of them</p>",
        "id": 153941003,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519754618
    },
    {
        "content": "<p>Thanks, it feels most like the assert-response-code-types 'noContent' - an empty list response because there is no matching data on the source system. We would like to use the list resource and need to know that an empty list was returned because there was no matching data.</p>",
        "id": 153941048,
        "sender_full_name": "Andrew Perry",
        "timestamp": 1519766644
    },
    {
        "content": "<p>sure that makes sense. Note that the value set there is just an example one... you can use whatever codes you like</p>",
        "id": 153941049,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519766770
    },
    {
        "content": "<p>Thanks Grahame</p>",
        "id": 153941131,
        "sender_full_name": "Andrew Perry",
        "timestamp": 1519815088
    }
]