[
    {
        "content": "<p>Is it ever valid to send an empty (0-byte) file in FHIR?  Is there a way to base-64 encode a zero-byte file that won't result in a zero-length string (which is prohibited according to FHIR's rules)?</p>",
        "id": 228266767,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614618176
    },
    {
        "content": "<p>I assume every resource which has a 0 min cardinality on its properties has at least some finite size in every representation (XML, JSON, Turtle)</p>",
        "id": 228267219,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1614618330
    },
    {
        "content": "<p>Are you talking about some non-Resources?</p>",
        "id": 228267335,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1614618365
    },
    {
        "content": "<p>I was thinking maybe Lloyd means stuff like <code>Attachment.data</code>?</p>",
        "id": 228267520,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614618438
    },
    {
        "content": "<p>makes sense</p>",
        "id": 228267562,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1614618464
    },
    {
        "content": "<p>why is a zero-length string prohibited?</p>",
        "id": 228267682,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1614618497
    },
    {
        "content": "<p>are you just supposed to elide the property rather than provide an empty value (or uses some other null form)?</p>",
        "id": 228267785,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1614618541
    },
    {
        "content": "<p>(sort of a meta model rule)</p>",
        "id": 228267848,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1614618558
    },
    {
        "content": "<p>Spec <a href=\"http://hl7.org/fhir/datatypes.html#primitive\">says</a>:</p>\n<blockquote>\n<p>Leading and Trailing whitespace is allowed, but SHOULD be removed when using the XML format. Note: This means that a string that consists only of whitespace could be trimmed to nothing, which would be treated as an invalid element value. Therefore strings SHOULD always contain non-whitespace content</p>\n</blockquote>",
        "id": 228268093,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614618655
    },
    {
        "content": "<p>And the regex says:</p>\n<blockquote>\n<p>Regex: [ \\r\\n\\t\\S]+</p>\n</blockquote>",
        "id": 228268170,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614618681
    },
    {
        "content": "<p>which makes containing a 0-byte attachment illegal</p>",
        "id": 228268443,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1614618761
    },
    {
        "content": "<p>Well, it makes populating <code>data</code> illegal, but you could omit data and populate <code>Attachment.size</code> as `0 assuming you don't read the <a href=\"http://hl7.org/fhir/datatypes-definitions.html#Attachment.size\">following comment</a> too pedantically:</p>\n<blockquote>\n<p>The number of bytes is redundant if the data is provided as a base64binary, but is useful if the data is provided as a url reference.</p>\n</blockquote>",
        "id": 228268717,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614618857
    },
    {
        "content": "<p>right, undermines the \"is redundant\" assertion</p>",
        "id": 228268801,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1614618898
    },
    {
        "content": "<p>This is a pretty annoying \"special case\", but... may be not a huge problem IRL.</p>",
        "id": 228268903,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614618946
    },
    {
        "content": "<p>i'm trying to imagine a scenario where i'd want to say that something is \"\". haven't come up with it yet, but seems pretty reasonable</p>",
        "id": 228268970,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1614618964
    },
    {
        "content": "<p>We have use-cases in XDS for this... so it frustrates me that someone added that comment to attachment.size. Specifically we have use-cases where the bits have not yet been assembled. The DocumentReference is a promise to make the described document (metadtata found in the DocumentReference)... Deferred Creation... or On-Demand</p>",
        "id": 228272470,
        "sender_full_name": "John Moehrke",
        "timestamp": 1614620219
    },
    {
        "content": "<p>I raise the issue because I was applying a technical correction previously agreed to that allows for a completely empty Parameters instance.  It dawned on me that zero-byte files are a thing and was wondering whether we needed to make a similar exception for them.  Omitting the content and sending a zero-size seems reasonable to me.   Is that worth noting in the usage notes for the Attachment data type?</p>",
        "id": 228274156,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614620767
    },
    {
        "content": "<p>I think so. What comes up next is what to do with the hash element. In the IHE case we leave hash be blank to explain that we are describing something that will eventually have a size and hash. But if you really have a zero length file,  then the hash value would be \"da39a3ee5e6b4b0d3255bfef95601890afd80709\".. not an unreasonable distinction between actually zero size,  and currently zero size.</p>",
        "id": 228276421,
        "sender_full_name": "John Moehrke",
        "timestamp": 1614621512
    },
    {
        "content": "<p>Can you explain more what IHE does <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>?  Do you have Attachment.url and no <a href=\"http://Attachment.data\">Attachment.data</a> or do you have neither?  If you just have a URL, I would omit size and hash if you're going to generate it on-the-fly.  Setting size to zero would <em>not</em> communicate that \"we're going to generate this on the fly\".  (If you want to say that, you'd need an extension.)</p>",
        "id": 228281405,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614623212
    },
    {
        "content": "<p>IHE (MHD) always uses .url. and forbids .data. in the case I described above the .url is populated.    The use of size of zero has been used for decades.</p>",
        "id": 228282799,
        "sender_full_name": "John Moehrke",
        "timestamp": 1614623678
    },
    {
        "content": "<p>I don't disagree that some other signal should be provided. The use-case has really not been fully designed in MHD, as the community has not asked that it be used. However there is known use of zero as the signal.</p>",
        "id": 228283065,
        "sender_full_name": "John Moehrke",
        "timestamp": 1614623789
    },
    {
        "content": "<p>It might be a known use, but I'd object to encoding that use into the spec (or even crafting language to allow for it).  If the size says 0, the appropriate interpretation of that is \"the file is an empty file\", not \"the file is going to be generated\".</p>",
        "id": 228316438,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614636982
    },
    {
        "content": "<p>understand. just pointing out reality.</p>",
        "id": 228316756,
        "sender_full_name": "John Moehrke",
        "timestamp": 1614637153
    },
    {
        "content": "<p>I would agree that if I saw size of zero, I should not try to pull the content.. but if I did pull it, that should not be seen as a error.</p>",
        "id": 228316883,
        "sender_full_name": "John Moehrke",
        "timestamp": 1614637211
    },
    {
        "content": "<p>we do want that the normal expectation is that if you pull content, and that there is a declared size and hash, that if size or hash are different; that should be seen as an integrity failure.. right?</p>",
        "id": 228317123,
        "sender_full_name": "John Moehrke",
        "timestamp": 1614637307
    },
    {
        "content": "<p>thus I would agree that the right interpretation of size of zero is that getting the URL content or undecoding the .data should result in a zero length file.</p>",
        "id": 228317319,
        "sender_full_name": "John Moehrke",
        "timestamp": 1614637394
    },
    {
        "content": "<p>If hash is populated, then the resulting file better hash to that value.</p>",
        "id": 228317390,
        "sender_full_name": "John Moehrke",
        "timestamp": 1614637431
    },
    {
        "content": "<p>thus, i would agree that unpopulated size (and/or hash) is the right way to say indeterminant.</p>",
        "id": 228317499,
        "sender_full_name": "John Moehrke",
        "timestamp": 1614637467
    },
    {
        "content": "<p>consumers choice if they decide to validate size or hash. they are not compelled to validate them (by core spec)</p>",
        "id": 228317615,
        "sender_full_name": "John Moehrke",
        "timestamp": 1614637521
    },
    {
        "content": "<p>Agree.  You're free to pull it.  When the content isn't zero, the default assumption would be that the content has changed since the reference was made.</p>",
        "id": 228319176,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614638185
    }
]