[
    {
        "content": "<p>Noobie here: <br>\nSay I make a search along the lines of 'GET [base]/Observation?subject=,code=whatever' (with an empty subject-parameter), what would the expected response be?<br>\nDo I throw an error,  since searching for nothing does not make sense?<br>\nOr should I return an empty set, since I have no observations with the subject in the empty list?<br>\nOr do I return all observations where subject is missing?</p>\n<p>I know hapi just tosses the empty parameters away before they even hit the server, but I was wondering what the fhir spec has to say on the matter, and I could not find anything about it in <a href=\"https://www.hl7.org/fhir/DSTU2/search.html#errors\" target=\"_blank\" title=\"https://www.hl7.org/fhir/DSTU2/search.html#errors\">https://www.hl7.org/fhir/DSTU2/search.html#errors</a></p>",
        "id": 153924729,
        "sender_full_name": "Mathias Svendsen",
        "timestamp": 1513171064
    },
    {
        "content": "<p>Elements are not allowed to be empty, so searching for it also makes no sense. If subject (in this case) is to be empty, it should not be in the resource altogether. And you can search for that: /Observation?subject:missing=true</p>",
        "id": 153924730,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1513171190
    },
    {
        "content": "<p>BTW: Your example contains another error: the comma should be an ampersand: <br>\nGET [base]/Observation?subject=&amp;code=whatever</p>",
        "id": 153924731,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1513171248
    },
    {
        "content": "<p>Roger, so I just return an OperationOutcome in which I yell at the client for trying to do that?  :-)</p>",
        "id": 153924732,
        "sender_full_name": "Mathias Svendsen",
        "timestamp": 1513171350
    },
    {
        "content": "<p>You could also tell the client politely, but yes, that is the correct answer :-)</p>",
        "id": 153924733,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1513171583
    },
    {
        "content": "<p>There are a lot of UIs that display a list of search criteria for you to search on and then generate the search string by concatenation, so seeing <code>...?subject=&amp;code=foo</code> is pretty common.  I know Grahame's server ignores parameters without a value.  If you wanted to search for elements where the value was missing, you'd do <code>subject:missing=true</code></p>",
        "id": 153924755,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513180480
    },
    {
        "content": "<p>a search with no criteria is a request to list all resources of the specified type. The public servers generally just go ahead and list all the resources... but server are not required to implement this, and should return an error if they do not</p>",
        "id": 153924844,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513192644
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> The question is what to do with a parameter that's listed but provides no value</p>",
        "id": 153924896,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513197941
    },
    {
        "content": "<p>ignore it.</p>",
        "id": 153924900,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513198628
    },
    {
        "content": "<p>Do we state that explicitly in the spec anywhere?</p>",
        "id": 153925059,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513204269
    },
    {
        "content": "<p>apparently not. Surprisingly. but it's very definitely the case, based on how HTML forms work</p>",
        "id": 153925064,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513204364
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194989\">@Mathias Svendsen</span> Would you be willing to submit a change proposal?  Just click on the \"Propose a change\" link at the bottom of any page in the spec.  You'll need to register (which sometimes takes a day or two as HL7 HQ tries to confirm that you're a real human being and not a viagra sales person), but after that you can submit as many change proposals as you like.  And you'll be officially elevated from being a \"Noobie\" :)</p>",
        "id": 153925070,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513204791
    },
    {
        "content": "<p>Ignoring search params seems like a bad thing - that's what prompted me to ask here. If i, say ask for all observations for a patient, and the list of patiens is accidentally empty, the server would take quite a performance hit if it was expected to just return everything.  Personally I like either the error-option or the empty-result-option. <br>\nAny way, i'll propose a change, to officially be un-noobie-fied</p>",
        "id": 153925187,
        "sender_full_name": "Mathias Svendsen",
        "timestamp": 1513257282
    },
    {
        "content": "<p>The server has the right to reject a query without a minimum number of search parameters, to cap the number of rows contained or to throw a \"too costly\" error.  Ignoring search parameters will be pretty common - systems can also ignore search parameters they don't support even if data is specified.  It's the responsibility of the client to look at the \"self\" link to see what search parameters were actually used.</p>",
        "id": 153925205,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513266165
    },
    {
        "content": "<p>Indeed it is not explicitly in the spec. I interpreted this as a special case of 'Unknown and unsupported parameters' (<a href=\"http://build.fhir.org/search.html#errors\" target=\"_blank\" title=\"http://build.fhir.org/search.html#errors\">http://build.fhir.org/search.html#errors</a>), since a parameter without a value is unsupported by Vonk. We ignore it but include a warning in the OO in the response bundle.</p>",
        "id": 153925875,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1513591325
    },
    {
        "content": "<p>pre-applied this note:<br>\nNote: Empty parameters are not in error - they are just ignored by the server</p>",
        "id": 153925884,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513592972
    },
    {
        "content": "<p>\"an error\" would read slightly better than \"in error\"</p>",
        "id": 153925967,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1513611854
    }
]