[
    {
        "content": "<p>Hi I am structuring an Encounter resource for the Paramedicine Care summary  (PCS). I need the structure of the Encounter.diagnosis section for the resource, however it needs to be changed to reflect that EMS providers cannot diagnose, only make clinical impressions which includes the chief complaint. However one of the clinical impressions will be the chief complaint and should be identified similar to the Encounter.diagnosis.use CodeableConcept. there are a few ways that I am thinking of of structuring it but i am not sure which is the best way to do it: Slice the Encounter.diagnosis to include clinicalImpressions, Slice ClinicalImpressions to include a use CodeableConcept so that it can be identified as the chief complaint. Or Slice encounter to create a section similar to Encounter.diagnosis but have it as an impressions rather than diganosis. Which approach should i take?</p>",
        "id": 246722421,
        "sender_full_name": "ANDREA FOURQUET",
        "timestamp": 1626875617
    },
    {
        "content": "<p>I think you're overreading the word 'diagnosis'.  An admitting diagnosis might easily be recorded by a receptionist or a nurse - there's no expectation is necessarily a \"formal\" diagnosis.  In practice, ClinicalImpression is far more likely to be constrained to 'clinicians' than Condition is.  ClinicalImpression also carries a great deal more baggage and isn't widely implemented.</p>\n<p>The only way to convey a ClinicalImpression in that structure is to use an extension on Encounter.diagnosis.condition, and that's something that many consumers would find confusing.  If you actually <em>need</em> the elements on ClinicalImpression, then you can certainly submit a change request to have that added as a capability in R5.  However, if the sole reason for using ClinicalImpression instead of Condition is around \"professional scope\", then just use Condition.  Conditions can be authored by anyone - including devices and patients themselves.</p>",
        "id": 246739085,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626882863
    }
]