[
    {
        "content": "<p>The Patient Admin WG has been working on updating the Encounter resource to restructure the Encounter.diagnosis, Encounter.procedure, Encounter.reason, and (previously removed) Encounter.indication properties.  There are a whole slew of Jira trackers against these properties.  We have a project page with our notes and the tracker list <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=51223352\">here</a>.</p>\n<p>We are hoping to avoid listing the full set of encounter diagnoses on Encounter, as those really should be Conditions that refer to Encounter.  However, the issue of ranking (more on that below) may force that decision.</p>\n<p>Our current proposal is to remove Encounter.diagnosis and Encounter.procedure, and instead have an Encounter.reason 0..* BackboneElement, with a child node that would be a CodeableReference(Condition | Procedure | Observation | ImmunizationRecommendation | HealthcareService).  There will also be a use code with values like Chief Complaint, Admitting Diagnosis, Reason For Visit, etc. The proposed structure is <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=51223352#Encounter,Condition,Procedure,Diagnosis...-SeptWGMDesignNotes\">here</a>.</p>\n<p>We have had much discussion on whether this new Encounter.reason property should have a rank.  We'd like broader community input on whether Encounter reasons need a rank.</p>\n<p>Things to consider:</p>\n<ul>\n<li>Condition has a severity property, so the concept of acuity can be represented there, rather than as a rank relative to other conditions.</li>\n<li>Ranking for reimbursement is out of scope, as that is very realm-specific, and typically coded on other records than the encounter.</li>\n<li>Having a use code of \"Chief Complaint\" does provide an option for an implicit rank without a discrete rank property.</li>\n</ul>\n<p>Feedback on our proposal is welcome on chat.fhir, however there is a lot of background (we've been debating this overall structure for 4+ WGMs), and we'd encourage interested parties to join our PA WG call next Wednesday (2/24) at 3pm ET.  We are hoping to put this to bed so we can take Encounter normative.</p>",
        "id": 226726791,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1613596501
    },
    {
        "content": "<p>+1 on encounter.reason without a rank, IMHO condition.severity should be sufficient. If implementers are desperate, they can use an extension for rank. Not part of the 80% IMHO.</p>",
        "id": 226774677,
        "sender_full_name": "René Spronk",
        "timestamp": 1613634282
    },
    {
        "content": "<p>Rank matters for billing, but Rank exists on Claim.  Only question is where clinicians capture that determination for billing.  (My guess is that rank is often determined by billing coders, in which case only having it on Claim is fine.)</p>",
        "id": 226825113,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613661322
    }
]