[
    {
        "content": "<p>There is a task 10544 on encounter where we are refactoring the diagnosis links which also removed the link to procedure as an indicator (there is a similar task for EpisodeOfCare too)<br>\nI was wondering if this was a reasonable thing to have removed the procedure, as I don't think that's enough information to put in as a reason for the encounter. I would have expected that you would need to provide more detail as to why the procedure required a followup encounter (capturing the details of the complications that arose from the procedure - which is the purpose of the condition, and admitting diagnosis on the encounter)<br>\nComments <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> others?</p>",
        "id": 153872594,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1487465693
    },
    {
        "content": "<p>While I'm asking anyone got a clinically valid example we can include in the spec for a condition that resulted from a procedure (so I can reference in my example)<br>\nThanks all</p>",
        "id": 153872595,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1487465774
    },
    {
        "content": "<p>From your listserv email, <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , you recommended:</p>\n<blockquote>\n<p>1.  Move reason codableconcept into backbone element and make diagnosis.condition 0..1<br>\n2.  Remove the extension for primary diagnosis completely<br>\n3.  Introduce the text above discussing primary diagnosis<br>\n4.  Provide guidance on appt.indication -&gt; encounter.diagnosis[role=admission] and new condition resource as needed<br>\n5.  Rename moved reason property diagnosis.reason to diagnosis.code (and include an alias for reason)</p>\n</blockquote>\n<p>Also, part of <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10544\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10544\">GF#10544</a> resolution was</p>\n<blockquote>\n<p>The description on the reason property will be updated to indicate that its purpose as a more patient<br>\ncentric valueset/concept</p>\n</blockquote>\n<p>I agree with having a reason that can be codified or a reference, but does this mean the reason (to be included in the BackboneElement) could be patient reason or provider determined diagnosis?  </p>\n<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , your PA listserv email also said:</p>\n<blockquote>\n<p>The extension for primary diagnosis I’d like to explain that this concept is represented by the diagnosis with role = “admitting diagnosis” </p>\n</blockquote>\n<p>I don't think that the admitting diagnosis is always the primary diagnosis (for billing purposes).</p>",
        "id": 153872630,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1487514864
    },
    {
        "content": "<p>That last part, sorry also meant to include having a rank of 1 too</p>",
        "id": 153872631,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1487514959
    },
    {
        "content": "<p>The changes from the trackers have all been applied, so you can see how my suggestions would apply overtop.</p>",
        "id": 153872632,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1487514996
    },
    {
        "content": "<p>OK, I'll take a look at the applied changes....one sec</p>",
        "id": 153872633,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1487515245
    },
    {
        "content": "<p>Part of <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10544\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10544\">GF#10544</a> resolution was to remove the extension (The encounter-primaryDiagnosis and encounter-relatedCondition  extensions will be removed, as they are now redundant, and represented in the core resource.), which was consistent with your recommendation #2, but I still see the extension in current build.</p>",
        "id": 153872634,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1487515373
    },
    {
        "content": "<p>That's due to the not being able to use the coded reason as a primary diagnosis, and there were 2 examples doing that, and I wanted to ensure that everyone was good with the admission diagnosis *requiring* a condition resource, and not just a coded reason.</p>",
        "id": 153872635,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1487515844
    },
    {
        "content": "<p>I think I'd rather allow the BackboneElement to support a code or reference, so we can remove the extension as originally planned.  To me, we just need to clarify if the reason can be either a patient expressed reason for a practitioner's admission diagnosis (in coded form)</p>",
        "id": 153872636,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1487516019
    },
    {
        "content": "<p>You may need some invariant that says either condition (reference) or code (reason) are required since Encounter.diagnosis.condition is currently 1..1</p>",
        "id": 153872637,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1487516086
    },
    {
        "content": "<p>That is where I wanted to go.<br>\nAre you happy that the reason is that thing, and moving it in the backbone diagnosis makes sense to you?</p>",
        "id": 153872638,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1487517224
    },
    {
        "content": "<p>As long as the definition of reason implies it could be either patient reason and/or practitioner reason.  When it is a patient reason, there might not be a role or rank as that is typically determined by practitioners</p>",
        "id": 153872639,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1487518031
    },
    {
        "content": "<p>Or there is a role specifically for patients to select...<br>\n(currently example binding - but could include a patient self-diagnosis value in there)</p>",
        "id": 153872641,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1487519120
    }
]