[
    {
        "content": "<p>How to represent <strong> \"expected length of stay\"</strong> in case of inpatient admissions in FHIR Encounter resource? </p>\n<p><strong>Encounter.length</strong> seems best option but definition states- \"Quantity of time the encounter lasted.\"<br>\nIt seems that it meant for admission time lapsed, this is useful at the time of discharge as at that time, one will know what was exact length of stay. But how to represent \"expected\" length at the time of admission. </p>\n<p>I think Encounter.length should work for both use cases- expected v/s actual length. If no discharge date then probably expected length. But not so sure. Any thoughts or help would be much appreciated.</p>",
        "id": 154009185,
        "sender_full_name": "Aditya Joshi",
        "timestamp": 1539626105
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 154009194,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539629501
    },
    {
        "content": "<p>There is also the period which I would have expected to be used.<br>\nWhat is your use case for expected length of stay?</p>",
        "id": 154009247,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1539640448
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>  for your reply.</p>\n<p>My use case is to send \"expected length of stay\" of Patient in hospital from Provider to Insurer. </p>\n<p><strong>Context</strong>: Provider sending Authorization request (pre authorization) for some services. This is done by using Claim resource (claim.use=\"proposed\"). This pre auth request is for patient admitted in hospital. Request should contain expected length of stay, for example, doctor feels that Patient would be admitted for 3 days. So, admission is started but not yet completed, we know start date but there is no end date. </p>\n<p>Using <strong>Encounter.period</strong> = it says that you can omit period.end if not known. Can we use a future date here to notify receiver that it is expected discharge date. </p>\n<p>Using <strong>Encounter.length</strong>= Quantity of time the encounter lasted (less time absent). This means it contains time period which has already lapsed or occurred, so probably can't use for expected length. </p>\n<p>Using <strong>Claim.hospitalization</strong> =   <br>\nThe start and optional end dates of when the patient was confined to a treatment center.<br>\nDefinition states that it is also a period which is already lapsed. </p>\n<p>There could be another interesting requirement when Provider is sending actual Claim and there he wants to send \"expected length of stay\" (what he projected at the beginning of admission) and \"actual length of stay\" (admission date to discharge date). Actual stay can be easily shown using Encounter.period (start and end dates). But not sure about \"expected length of stay\".</p>",
        "id": 154009390,
        "sender_full_name": "Aditya Joshi",
        "timestamp": 1539690000
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>  waiting for your kind response.</p>",
        "id": 154010380,
        "sender_full_name": "Aditya Joshi",
        "timestamp": 1539946915
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , <span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span>  and <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>,  </p>\n<p>Do you have any recommendations on how best to convey the actual admission and discharge date for an inpatient stay via. the R4 Claim resource?  I view admission and discharge dates as Claim level vs. Claim.item level/line level attributes of a Claim.  Since Claim.hospitalization from STU3 is no longer supported in R4, what R4 element supports the ability to indicate 'The start and optional end dates of when the patient was confined to a treatment center' that was supported via. Claim.hospitalization in STU3?   cc <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 162432972,
        "sender_full_name": "David Riddle",
        "timestamp": 1554300804
    },
    {
        "content": "<p>Why wouldn't you use the referenced Encounter?</p>",
        "id": 162433104,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554300892
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ,  As I indicated, admission and discharge dates have traditionally been viewed as Claim level vs. line/item level attributes of a claim.   Since the encounter element is at the line/item level (Claim.item.encounter), I was struggling a bit to understand which line/item's encounter would be populated with the admission and discharge dates.   Based on your suggestion, it sounds like all of the Claim.items on an Inpatient claim would repeat references to the same encounter and thus the same encounter.period.   I was trying to understand if that was the thought behind removing support for Claim.hospitalization which allowed the admission and discharge dates to be established at the Claim level vs. repeating them for each line/item associated with the claim.</p>",
        "id": 162435202,
        "sender_full_name": "David Riddle",
        "timestamp": 1554302125
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span> you can link an Encounter from the Claim.supportingInfo.valueReference which would place the reference to the Encounter at the Claim level. If you have an Encounter this would be the recommended approach. If you only have the admit and discharges dates, you would use the Claim.supportingInfo.timingPeriod</p>",
        "id": 162436072,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1554303376
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span> Agree with Andy's comment above, the supporting Info supports the inclusion of claim-level and line-level information where that information may be simple and complex types (hospitalization or employment Impacted periods, initial onset or other dates, etc.) or FHIR resources or other materials.<br>\nHospitalization would have .supportingInfo.category='hospitalized' and .supportingInfo.timingPeriod to convey the admit and/or discharge dates.</p>\n<p>Also, FM is leaning toward including the Encounter via supportingInfo rather than having it specified directly at the line level.</p>",
        "id": 162437472,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1554304293
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span>  and <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> ,  Thank you both for your guidance on this.  I may have additional questions, but this is very helpful.</p>",
        "id": 162453644,
        "sender_full_name": "David Riddle",
        "timestamp": 1554315288
    },
    {
        "content": "<p>You are welcome,  and asking and answering questions (simple ones anyways) is what this forum is all about</p>",
        "id": 162468765,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1554324931
    }
]