[
    {
        "content": "<p>Looking at the encounter there does not seem to anywhere to hold any additional narrative that relates to the encounter. If we need to hold some narrative (which is more than just a human rendering of the resource elements ie. not Encounter.Text) what is the best way forward? All I can think of is to add an extension or use a Composition instead.</p>\n<p>The Composition is problematic as FHIR says COMPOSITIONS are documents which is not really the case for us,</p>",
        "id": 153913727,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1507842160
    },
    {
        "content": "<p>can set <code>text.status</code> to  \"additional\"  and add it there.  There is not a <code>note</code> element  on Encounter.</p>",
        "id": 153913736,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507846178
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I'd completely overlooked that as we dont tend to use Resource.text at all...</p>",
        "id": 153913739,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1507846661
    },
    {
        "content": "<p>\"The Composition is problematic as FHIR says COMPOSITIONS are documents which is not really the case for us,\" - umm, no? we say that documents are compositions, but we don't say that all compositions are documents.</p>",
        "id": 153913926,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508013501
    },
    {
        "content": "<p>On a slight tangent but could you use DocumentReferenc to link in the narrative? (with the note being rtf). When I worked in primary care, we recorded encounter notes in a Composition like strucutre but more recently in acute it's been RTF (/html) but more oftenPDF/MS-Word.</p>",
        "id": 153913947,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1508046646
    },
    {
        "content": "<p>Is this referring to the clinical/progress notes that the practitioner is taking during the encounter? Or something else?</p>",
        "id": 153913990,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1508121095
    },
    {
        "content": "<p>I was reading this as clinical/progress note (but wondered if I was reading this wrongly)</p>",
        "id": 153914001,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1508130610
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> <br>\n As <code>Narrative.text</code> is 0..1, you will not be able to distinguish your \"additional\" narrative from the \"normal\" narrative. That might not be a problem.</p>",
        "id": 153914340,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1508218060
    }
]