[
    {
        "content": "<p>The Questionnaire resource defines the \"choice\" item type, which allows the user of a questionnaire to choose from a list of predefined answers. What these possible answers may be, can be defined using the Questionnaire.item.answerOption.value[x] element, where can be of type Integer, Date, Time, String, Coding and Reference (at least in STU3).<br>\nHowever, it is unclear how to communicate the answer to these choice questions using the QuestionnaireResponse resource. One would expect the type of the QuestionnaireResponse.item.value[x] to simply match the type of the _selected_ answer in the Questionnaire. Thus if the answer the user selected was an .answerOption.valueString, one would expect to see a QuestionnaireResponse.item.valueString for the matching question.<br>\nHowever, the documentation on the \"choice\" type in the item-type valueset (<a href=\"https://www.hl7.org/fhir/stu3/valueset-item-type.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/stu3/valueset-item-type.html\">https://www.hl7.org/fhir/stu3/valueset-item-type.html</a>), states: \"Question with a Coding drawn from a list of options (specified in either the option property, or via the valueset referenced in the options property) as an answer (valueCoding)\". This suggests that the answer to a \"choice\" item in a Questionnaire should always result in a QuestionnaireResponse.item.valueCoding.<br>\nWhich one of these interpretations is correct, the former or the latter? And if the latter interpretation is correct, how would one capture e.g. a Questionnaire.item.answerOption.valueString or .valueDate in a QuestionnaireResponse.item.valueCoding?</p>",
        "id": 189225518,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1582818599
    },
    {
        "content": "<p>I think the answer is that if the Questionnaire item type is <code>choice</code> then Questionnaire.item.answerOption.value[x] must be Coding</p>",
        "id": 189228645,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1582820436
    },
    {
        "content": "<p>yes, that's it: 'Question with a Coding drawn from a list of options (specified in either the option property, or via the valueset referenced in the options property) as an answer (valueCoding)'  (from <a href=\"http://hl7.org/fhir/STU3/valueset-item-type.html#expansion\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/valueset-item-type.html#expansion\">http://hl7.org/fhir/STU3/valueset-item-type.html#expansion</a>)</p>",
        "id": 189228817,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1582820559
    },
    {
        "content": "<p>Choice type means 'coding'.  You can have a question of type 'date' where there are answer options defined.  However, agree this needs to be made more clear.  Can you submit a change request <span class=\"user-mention\" data-user-id=\"216303\">@Pieter Edelman</span> ?</p>",
        "id": 189231019,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582821901
    },
    {
        "content": "<p>Well, that kind of makes sense. I would be glad to submit a change request if I understand what needs to be done. However, I now have several new questions about the expected behavior:</p>\n<p>First, the documentation on Questionnaire.item.option states:</p>\n<ul>\n<li>definition: \"One of the permitted answers for a \"choice\" or \"open-choice\" question.\"</li>\n<li>comment: \"This element can be used when the value set machinery of options is deemed too cumbersome or when there's a need to capture options that are not codes.\"<br>\nIf I understand correctly, both statements are incorrect. item.option isn't only used for choice or open-choice type items, but also for integer, date, time, etc. And it cannot be used at all to extend value sets with other option types - it's either coding OR one of the other types.</li>\n</ul>\n<p>Second, the behavior in the presence of the an .option.value[x] is unclear for item.type other than choice/open-choice. Does it mean that the answer MUST come from the defined .option's (\"choice\"), or that it MAY come from them (\"open-choice\")?</p>\n<p>And last, shouldn't there be a constraint that in all instances of item.option.value[x], [x] MUST match item.type?</p>\n<p>Thanks for your help.</p>",
        "id": 189296001,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1582883211
    },
    {
        "content": "<p>The documentation for item.option is incorrect.  item.option can now be used for types other than choice and open-choice.</p>\n<p>I'm not sure what you mean by \"extend value sets with other option types\" - the FHIR machinery doesn't allow value sets of dates, integers, etc.</p>\n<p>We have an unapplied change request that will shift the open/closed question into a separate element so you can have open/closed regardless of type.</p>\n<p>And yes, that sounds like a good constraint to introduce</p>",
        "id": 189313790,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582899853
    },
    {
        "content": "<p>Thanks for the clarification <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>. I've applied for a Jira account to submit a change request.</p>",
        "id": 189322068,
        "sender_full_name": "Pieter Edelman",
        "timestamp": 1582905156
    }
]