[
    {
        "content": "<p>Hi! In our source system an encounter also contains some data related to the discharge estimation. In <a href=\"http://community.fhir.org/t/estimated-discharge-date-in-encounter-resource/198\">http://community.fhir.org/t/estimated-discharge-date-in-encounter-resource/198</a> already a question was posted w.r.t. how the estimated discharge date should be represented in FHIR (short answer: <code>Encounter.period.end</code>). In our case however there is some additional data present, such as the type of discharge estimation, a boolean to indicate whether the discharge estimation is still active and some elements related to the confirmation of the discharge estimation. Therefore we aren't able to represent all this information within the Encounter resource itself (at least without using extensions), and currently we're thinking about modelling this information as a separate Observation instead. Does someone already have some experience with such a usecase?</p>\n<p><span class=\"user-mention\" data-user-id=\"194755\">@Chris Royle</span> , <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> Since you were involved in the question I've linked, any insight from your side would be appreciated!</p>",
        "id": 271550565,
        "sender_full_name": "Luud Slagter",
        "timestamp": 1644572106
    },
    {
        "content": "<p>For what it's worth, I noticed that PA (Patient Admin) thinking has evolved over time.  Previously, per <a href=\"http://jira.hl7.org/browse/FHIR-7873\">J#7873</a> and R4, there was a single period element, but now in the emerging R5 build, I see that period has been renamed to actualPeriod and new elements added for plannedStartDate and plannedEndDate.<br>\nIn my past implementation experience, we were focused on estimated dates and used status to guide the interpretation of the period dates being planned or actual.<br>\nI would recommend cross-posting this question to the \"patient administration WG\" stream to get their input as well.</p>",
        "id": 271611191,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1644601200
    },
    {
        "content": "<p>We have also considered pre-adopting the plannedEndDate element within Encounter. However this turned out to be insufficient to support all data elements related to the discharge estimation, hence we've decided to use an Observation instead. Thanks for the help!</p>",
        "id": 272958342,
        "sender_full_name": "Luud Slagter",
        "timestamp": 1645627881
    },
    {
        "content": "<p>Feel free to submit change requests if you think the resource is missing elements that will be used by a wide number of systems...</p>",
        "id": 272966107,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645630987
    }
]