[
    {
        "content": "<p>Is there any guidance around expected/planned discharge date on an Encounter? In V2 this would be PV2-9.</p>\n<p>It seems wrong to use Encounter.period for that</p>\n<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 154026323,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1545227510
    },
    {
        "content": "<p>I am also interested in this. This is a trickier area than people might expect at first glance as there are several concepts that are not exactly the same. </p>\n<p>In our EHR I think this is (or was) handled by what would correspond to Encounter.period end date in combination of the Encounter.state not being Finished. But this is not a good design as you would want to differentiate between planned and actual discharge date, e.g. to investigate why patients are staying in the ward longer than the planned/estimated discharge date. </p>\n<p>But there may also be some different concepts here that need to be distinguished:<br>\n<strong>Estimated discharge date</strong> - Sounds like something that you would \"estimate\" based on the type of patient, condition, procedure etc, likely before hand for planning and bed management<br>\n<strong>My conclusion/guess</strong><br>\nI would actually see this belonging to <strong>Appointment.end</strong> as this is part of the planning phase of the encounter. </p>\n<p><strong>Planned discharge date</strong> - Sounds like something where you have planned the patient to be discharge on a certain date. This would be based on some type of decision, likely during the patient's admission.<br>\n<strong>My conclusion/guess</strong><br>\nSounds like this would have to be an extension, but if so, it sounds like this is such a common use case to be a standard extension. Or, potentially add this to the Encounter resource. </p>\n<p><strong>Ready for discharge</strong> - Patient is clinically fit to leave the ward, but there are tasks of administrative character preventing the patient from being discharged (waiting for transports, no bed at receiving ward/care home etc). Depending on system and use case, could be either date or boolean.<br>\n<strong>My conclusion/guess</strong><br>\nSounds like this would have to be an extension, but if so, it sounds like this is such a common use case to be a standard extension. Or, potentially add this to the Encounter resource.</p>",
        "id": 154026897,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1545387030
    },
    {
        "content": "<p>I have a proposal from a customer to add plannedStart/plannedEnd (boolean) to backbone element Encounter.period<br>\nto handle this.<br>\nThoughts?</p>",
        "id": 168916934,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1561449325
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 168948006,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561475955
    },
    {
        "content": "<p>If there's a tracker for it we'll convert it on a PA call soon. Don't have strong feelings on this one.<br>\nAs it sounds now I would just use the end date in the future. But that doesn't help if you're wanting to track the original planned date.<br>\nAppointment was updated to handle this already from memory</p>",
        "id": 168979549,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1561498434
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22766\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22766\">GF#22766</a></p>",
        "id": 169010287,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1561538588
    },
    {
        "content": "<p>We need to implement Discharge planning and this addition will be a huge help</p>",
        "id": 197450813,
        "sender_full_name": "dsh",
        "timestamp": 1589392247
    },
    {
        "content": "<p>In case you need to reference the decision it is at <a href=\"http://jira.hl7.org/browse/FHIR-22766\">FHIR#22766</a></p>",
        "id": 197451122,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1589392389
    }
]