[
    {
        "content": "<p>Where's the recommended place to put the 'specialty'  in an encounter. eg that the patient was admitted under Cardiology. (I think I asked this before, but if so have forgotten the answer <img alt=\":smile:\" class=\"emoji\" src=\"static/third/gemoji/images/emoji/smile.png\" title=\":smile:\"> </p>",
        "id": 153814299,
        "sender_full_name": "David Hay",
        "timestamp": 1457398646
    },
    {
        "content": "<p>hello all, in our ipad appln we want to display building, wing, ward, roo, bed fields from location resource. and that location is attached to Encounter(admission info).</p>\n<p>as per the Location resource here we can create 5 instances.</p>\n<p>hierarchy is like this</p>\n<p>building(instance) as part of buliding we can keep wing(instance) and as part of wing ward is there ...</p>\n<p>so if we do like this, we need to create so many <a href=\"http://resources.to\" target=\"_blank\" title=\"http://resources.to\">resources.to</a> avoid this what we are thinking is just create the extensions for building, wing, ward, room, bed and then add it to location resource  or can we create an extension(complex) called Location by adding building, wing, ward, room, bed as child elements to it and then add this extension to Encounter?.</p>\n<p>2nd question is: we want to add serviceCategory, serviceType,speciality from appointment as Extensions to Encounter resource. and remove appointment from Encounter. and in HealthcareService also we have these 3, and we can add HealthcareService as reference to PractitionerRole so again here what i'm thinking is we can add these 3 to  PractitionerRole as Extensions?</p>\n<p>3rd: from the Encounter we want to refer a DocumentReference which referes CCDA. and also claim recource. how to inplement this?</p>\n<p>so please any suggestions? whethere it is correct or not? if not, how to do? </p>\n<p>thank you.</p>",
        "id": 153881689,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1491886736
    },
    {
        "content": "<p>@Jayashree Surnar you can create Building instance, Wing instance and so on. Connect all of them using the field Location.partOf. This way you don't need to create extensions or child elements. Encounter Resource can reference the resource location.</p>",
        "id": 153881707,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1491915512
    },
    {
        "content": "<p>Regarding your second question it is easy to reference appointment resource in encounter. Rather than pulling two fields and creating a new extension in encounter resource</p>",
        "id": 153881710,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1491915662
    },
    {
        "content": "<p>@ sunanda Veeraganti, ya we can do. but what we are thinking is if we do like that we have to create lot of instances, so i'm thinking alternative(better way). </p>",
        "id": 153881720,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1491916903
    },
    {
        "content": "<p>The purpose FHIR is interoperability. If too many extensions are created then the purpose will be lost. </p>",
        "id": 153881722,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1491917517
    },
    {
        "content": "<p>Agree with <span class=\"user-mention\" data-user-id=\"193653\">@Sunanda Veeraganti</span>.  There's always more efficient ways of meeting a particular local requirement than strict adherence to the standard - but that comes at the cost of not being able to interoperate.  At the same time, if it feels like the standard is making a legitimate implementation need too onerous to implement, it's quite reasonable to push back on the standard and ask for an easier way.</p>",
        "id": 153881756,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491921865
    },
    {
        "content": "<p>Thanky you @ sunanda Veeraganti and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>",
        "id": 153882022,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1491969901
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193653\">@Sunanda Veeraganti</span> you said, The purpose FHIR is interoperability. If too many extensions are created then the purpose will be lost. i agree with you.   but one more doubt regarding the Location.   without creating the extension can we add building, wing, ward, room, bed as elements and map it to Location.text an then create Location profile? what do you say?  Thank you.</p>",
        "id": 153882023,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1491970230
    },
    {
        "content": "<p>@Jayashree Surnar   You can use  Location Type  and use the value set for Location Physical type. See this page for more information <a href=\"https://www.hl7.org/fhir/valueset-location-physical-type.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-location-physical-type.html\">https://www.hl7.org/fhir/valueset-location-physical-type.html</a></p>",
        "id": 153882034,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1491989601
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193653\">@Sunanda Veeraganti</span> , yah. i saw that. but what our TL asking is, can we just add all the above fields individually  to Location. so that we can maintain only one Location instance.</p>",
        "id": 153882036,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1491992962
    },
    {
        "content": "<p>You can use one location instance and use the Valueset of location physical type</p>",
        "id": 153882038,
        "sender_full_name": "Sunanda Veeraganti",
        "timestamp": 1491993099
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span> I think the guidance right now is that if you want to convey a Location and as part of that convey the full \"hierarchy\" of identifiers, you'd use contained Locations for all of the partOf relationships.  The challenge with that is that 'contained' is supposed to be used when the instances can't stand alone, and the ward/room/building Locations probably can stand alone.  As a result, I think it is reasonable to submit a change request asking for discussion of this point - I don't think it's an uncommon need and we don't want to make it too clunky.</p>",
        "id": 153882075,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492005878
    },
    {
        "content": "<p>ok, Thank you <span class=\"user-mention\" data-user-email=\"lloyd@lmckenzie.com\">@Lloyd McKenzie</span> </p>\n<p>previous as you said, y ou can create Building instance, Wing instance and so on. Connect all of them using the field Location.partOf. Encounter Resource can reference the resource location.</p>\n<p>so we decided to do that, but here my doubt is, for example if we have 2buildings, 200 rooms, 1000 beds. then we suppose to create these many instances right? if this is not a big issue, we can go with this.</p>\n<p>other wise, will submit a change request asking for discussion of this point. what do you say?</p>",
        "id": 153884584,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492058027
    },
    {
        "content": "<p>Well, in principle, hospitals will indeed have instances for all of those things - as every bed, room, etc. will have a status.  Rooms may have phone numbers.  Each bed and room will need to be uniquely identifiable to indicate what equipment is available, etc.  So separate instances is reasonable.</p>",
        "id": 153884587,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492058677
    },
    {
        "content": "<p>Thank you very much. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>",
        "id": 153884588,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492058736
    },
    {
        "content": "<p>I have been wondering: Aren't there beds/rooms that may be shared between wards? If the actual association can alter depending on the type of patient occupying it, we currently have no way of expressing this, right?<br>\nI don't really like the Idea of containing the locations. They are very common search criteria, like \"give me a list of all Patients in ward x\", \"Who is currently occupying Room z\"? In contained resources, these attributes are out of reach to run a search on.</p>",
        "id": 153884592,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1492062657
    },
    {
        "content": "<p>Also: I believe that there are quite a lot of systems that don't care for Locations details down to the bedplace and are satisfied with knowing the ward. The way it is now, they'd have to go up the hierarchy three or more hops to figure that information out.<br>\nThose systems that come from a V2 background and are used to picking their required information from a PV1.#3 subfield may find that approach somewhat complicated.<br>\nI'd be very much in favor of having either a backbone element in Encounter or a set of extensions, that allows the information that resides in PV1.#3 to be referenced directly from the Encounter.</p>",
        "id": 153884593,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1492063016
    },
    {
        "content": "<p>I imagine that if you model Encounter.location as a Bedplace being part of a room being part of a ward, listing all Patients within a particular ward (which is a very common thing to do, I suppose) might be quite costly on the server side, no?</p>",
        "id": 153884603,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1492067088
    },
    {
        "content": "<p>hello all, actually i'm new to fhir so g etting more doubts if these are silly things just don't mind.i'm discussing this topic from few days.but still in dialoma. so please help.</p>\n<p>comming to topic:</p>\n<p>we want to capture location,service,participant info as part of patient's admission screen.</p>\n<p>for this i have gone through the fhir resource like Organization,location,Healthcareservice,practitioner.</p>\n<p>what i understand is we can use organization resource to create the department and</p>\n<p>location resource to create bulding,wing,ward,room,bed.</p>\n<p>for service which resource we can use? and whats themain purpose of HealthcareService?</p>\n<p>here my biggest doubt is, if we create 1000's of instances then what's the speed of the application?(we are implementing the mobile app.)because as we are using these many resource so we need to do lot of API calls for individual screen right?</p>",
        "id": 153884823,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492237401
    },
    {
        "content": "<p>\"service\" can mean all sorts of different things, so best to describe exactly what you're looking to capture with some examples.</p>",
        "id": 153884865,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492299575
    },
    {
        "content": "<p>There will certainly be thousands of instances (hundreds of thousands for even small clinics, well into the 100s of millions for decent sized hospitals once you think of every single blood pressure or other measurement for every single patient.  But your phone doesn't have to hold all of those - that's the work of the server.  Your phone only needs to grab the specific locations, organizations, etc. that are relevant to the specific encounters you care about.  And you should be looking at a much smaller number (in the 10s or so)</p>",
        "id": 153884866,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492299760
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  , regarding service, can you see this valueSet once.<br>\n<a href=\"https://fhir-ru.github.io/valueset-service-type.html\" target=\"_blank\" title=\"https://fhir-ru.github.io/valueset-service-type.html\">https://fhir-ru.github.io/valueset-service-type.html</a><br>\n(we required these services. to provide these, which resource should we use?)<br>\nif we use these many resources,  what about API calls?i mean how to reduse the API calls?</p>",
        "id": 153884885,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492411019
    },
    {
        "content": "<p>Good Morning All,can any one explain what's the relationship(or link) b/w the resource Encounter And Episodeofcare ? i'm not understanding the workflow of Episodeofcare. so please help.<br>\nThank you.</p>",
        "id": 153885062,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492574858
    },
    {
        "content": "<p>An encounter can be part of an EpisodeOfCare.  So, for example, a GP visit can be part of a pregnancy episode, or a radiation visit can be part of an oncology episode.  An EpisodeOfCare groups all care associated with a particular condition/problem occurrence.</p>",
        "id": 153885072,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492578019
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , what i understood is for each condition(diagnosis) we are creating EpisodeOfCare and in Encounter also we have diagnosis. so what is the difference? how EpisodeOfCare is useful? if i ignore EpisodeofCare implementation in our client(ipad app) then what? is there any effect?</p>",
        "id": 153885116,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492607440
    },
    {
        "content": "<p>Not all encounters that you tie to an episode will necessarily point to the same Condition instance.  For example, if you admit a patient for hypertension, that may still be relevant to their pregnancy episode.</p>",
        "id": 153885124,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492613942
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , so we can ignore client side(in ipad app impl)  implementation of EpisodeOfCare. it's not a problem right?</p>",
        "id": 153885422,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492751333
    },
    {
        "content": "<p>You can ignore any resource you wish if your user community doesn't need it/care about it</p>",
        "id": 153885430,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492755978
    },
    {
        "content": "<p>okay. thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> .</p>",
        "id": 153885448,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492761906
    },
    {
        "content": "<p>hi every one, when i send this data to hapi server using Advance Rest Client  in Encounter subject(patient) is not storing. and  i send immunization also in that case patient is storing. whats the problem?</p>",
        "id": 153887256,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1493968302
    },
    {
        "content": "<p>I'm not sure what an \"Advance Rest Client\" is.  What server are you sending to?  What exactly are you POSTing?  What response are you getting back?</p>",
        "id": 153887282,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1493998847
    },
    {
        "content": "<p>Hi all,<br>\nCurrently we are using Encounter types valuesets CPT Codes (<a href=\"http://www.ama-assn.org/go/cpt\" target=\"_blank\" title=\"http://www.ama-assn.org/go/cpt\">http://www.ama-assn.org/go/cpt</a>).<br>\nBut while we create main Admission encounter which value sets we need to use.<br>\nCan you please suggest.</p>\n<p>Thank you in Advance</p>",
        "id": 153981802,
        "sender_full_name": "Mounika",
        "timestamp": 1533303748
    },
    {
        "content": "<p>is 'AMB' can be used for Encounter.class for outpatient encounters?</p>",
        "id": 199471112,
        "sender_full_name": "Keerthivasan Ramanathan",
        "timestamp": 1591092502
    },
    {
        "content": "<p>Yes.  As per the definition, Ambulatory and Outpatient are considered synonyms.</p>",
        "id": 199492236,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591105342
    },
    {
        "content": "<p>Hi all,<br>\nI am new to FHIR and I am creating a new Encounter resource but I am having error while creating it. the error is :</p>\n<p>\"severity\": \"error\",<br>\n      \"code\": \"processing\",<br>\n      \"diagnostics\": \"Profile <a href=\"http://hl7.org/fhir/StructureDefinition/Encounter\">http://hl7.org/fhir/StructureDefinition/Encounter</a>, Element 'Encounter.class': minimum required = 1, but only found 0\",<br>\n      \"location\": [<br>\n        \"Encounter\",<br>\n        \"Line 1, Col 2\"<br>\n      ]<br>\nthe JSON Encounter resource look like this :-</p>\n<p>{\"resourceType\":\"Encounter\",\"identifier\":[{\"use\":\"secondary\",\"type\":{\"text\":\"Episode Visit No.\"},\"value\":\"1\"}],\"status\":\"in-progress\",\"serviceType\":{\"id\":\"102\",\"text\":\"Dermatology\"},\"subject\":{\"reference\":\"http://10.226.24.189:8080/hapi-fhir-jpaserver/fhir/Patient?_id=2\"}}</p>\n<p>Can anyone please help me with this?</p>\n<p>Thank You in Advance.</p>",
        "id": 199588429,
        "sender_full_name": "Shweta Rajput",
        "timestamp": 1591170330
    },
    {
        "content": "<p>A quick first answer, as I don't have time: An Encounter needs the attribute <code>class</code>. Your resource doesn't have one, so you need to add a coding for this attribute. (see <a href=\"https://www.hl7.org/fhir/encounter.html\">https://www.hl7.org/fhir/encounter.html</a>)</p>",
        "id": 199589499,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1591171184
    },
    {
        "content": "<p>Hi Mareike,<br>\nThank you so much for prompt reply...<br>\nthat hint really helped me. The problem is solved now.</p>",
        "id": 199597285,
        "sender_full_name": "Shweta Rajput",
        "timestamp": 1591176419
    },
    {
        "content": "<p>Perfect, I'm im glad I was able to help you. Sorry for the quick reply, my students were waiting. Greetings.</p>",
        "id": 199600629,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1591178609
    },
    {
        "content": "<p>@Shweta Rajput From the error message, your JSON data missing \"diagnostics\" property, at least one diagnostic is required.</p>",
        "id": 199672097,
        "sender_full_name": "Domina Tang",
        "timestamp": 1591215884
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 199672782,
        "sender_full_name": "Domina Tang",
        "timestamp": 1591216258
    },
    {
        "content": "<p>What is the correct way to implement a query that returns all the encounters ordered by the last  encounter.statusHistory.period.end</p>",
        "id": 201006503,
        "sender_full_name": "eyal wolanowski",
        "timestamp": 1592310349
    },
    {
        "content": "<p>You'd have to define a custom SearchParameter for Encounter.statusHistory.period.end</p>",
        "id": 201006683,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1592310454
    },
    {
        "content": "<p>All, When we create Resource Types (Encounter) here is a expected feild reference for a Subject </p>\n<p>\"subject\": {<br>\n      \"reference\": \"urn:uuid:9e43a3bf-fb4f-4007-8a1f-d8e00e57d4e5\",<br>\n      \"display\": \"Test\"<br>\n    },</p>\n<p>I read from Hl7 and it says the reference comes from other server. Did not really understand that. Any thoughts on what this reference is ?</p>",
        "id": 247320519,
        "sender_full_name": "sandeep diddi",
        "timestamp": 1627385103
    },
    {
        "content": "<p>The Reference needs to point to the Patient instance the Encounter is associated with - where is the Patient for your encounter stored?</p>",
        "id": 247329777,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1627391018
    },
    {
        "content": "<p>I want to get list of encounters (filtered by dates) with name of practitioners associated. <br>\nCurrently,  calling GET practitioner by Id from after calling GET encounters.</p>\n<p>This is working fine but not great in a sense that if I have 100 encounter in encounters list,  I have to do 101 (1 get encounters and 100 practitioner names) api calls. Is there any alternative sol'n for this or I just need to swallow this and use caching layout.</p>\n<p>Maybe I am thinking too much form the perspective of sql as I just need to do join call to reduce number of api calls</p>",
        "id": 259983757,
        "sender_full_name": "Akira Kakkar",
        "timestamp": 1635853458
    },
    {
        "content": "<p>Use an include: <code>[base]/Encounter?date=....&amp;_include=Encounter:practitioner</code></p>",
        "id": 259985091,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1635854260
    },
    {
        "content": "<p>I think it's supposed to be /Encounter?_include=Encounter:participant but maybe both work?</p>",
        "id": 259985203,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1635854321
    },
    {
        "content": "<p>Thanks. I didn't know about _include feature. This is very handy. Let me try it out.</p>",
        "id": 259985465,
        "sender_full_name": "Akira Kakkar",
        "timestamp": 1635854453
    },
    {
        "content": "<p>You could also do a single call for practitioners /Practitioner?_id=id1,id2,id3,id4,id5.......</p>",
        "id": 259986343,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1635854984
    },
    {
        "content": "<p>Is there an API for patient’s arrival to OR to wheeled into OR essentially?</p>",
        "id": 260012874,
        "sender_full_name": "Robert P",
        "timestamp": 1635867318
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 260012885,
        "sender_full_name": "Robert P",
        "timestamp": 1635867326
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"335936\">Daniel Venton</span> <a href=\"#narrow/stream/179166-implementers/topic/Encounter/near/259986343\">said</a>:</p>\n<blockquote>\n<p>You could also do a single call for practitioners /Practitioner?_id=id1,id2,id3,id4,id5.......</p>\n</blockquote>\n<p>Is there a limit on the number of id's one can join in a single API call?</p>",
        "id": 260018716,
        "sender_full_name": "Francesca Ricci-Tam",
        "timestamp": 1635869437
    },
    {
        "content": "<p>No limit (at least: not a limit specified by FHIR itself, a FHIR server may have its own limit). Although you may wish to use a List (FHIR resource \"List\") based search string if you'll be repeatedly using the same set of ids.</p>",
        "id": 260098067,
        "sender_full_name": "René Spronk",
        "timestamp": 1635925267
    },
    {
        "content": "<p>Some servers may have a maximum URL length, in which case you might have to submit your search via POST instead of GET.  And even using POST, some servers may enforce safety limits of some sort.</p>",
        "id": 260137213,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1635947815
    }
]