[
    {
        "content": "<p>Can I get some clarification on  why  Encounter.hospitalization.reAdmission is a CodeableConcept and not a boolean indicator? What conditions would warrant this and are there any other example concepts that one would use?</p>",
        "id": 154016641,
        "sender_full_name": "Joel Francis",
        "timestamp": 1541684083
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 154016648,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541685490
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>\n</blockquote>\n<p>Any thoughts on this?????</p>",
        "id": 154019828,
        "sender_full_name": "Joel Francis",
        "timestamp": 1542731541
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 154019849,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542738296
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> do you guys have an example set to use there?</p>",
        "id": 154020577,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1542944727
    },
    {
        "content": "<p>I'm investigating.  Some spots we have readmission as a boolean.  But I'm not sure about international realms.    I'll circle back when I have more info.    Probably next week due to some outages.</p>",
        "id": 154021877,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1543527947
    },
    {
        "content": "<blockquote>\n<p>I'm investigating.  Some spots we have readmission as a boolean.  But I'm not sure about international realms.    I'll circle back when I have more info.    Probably next week due to some outages.</p>\n</blockquote>\n<p>Thanks <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span></p>",
        "id": 154022502,
        "sender_full_name": "Joel Francis",
        "timestamp": 1543848120
    },
    {
        "content": "<p>Ok, so I learned more about readmissions than I really ever wanted to.  Some points to consider:</p>\n<ul>\n<li>Generally, in the US, \"readmission\" means \"unplanned\" readmission.  Just because it is the second admission in a given period does not mean it is a \"readmission\".   E.g. if you have a plastic surgery planned months in advance as your second admission in a given time period, it would not be considered a \"readmission\".</li>\n<li>Determining whether an encounter is considered a readmission generally involves running some sort of model.  In the US, CMS has a good set of models that are widely accepted (but there are some dissenting opinions). </li>\n<li>Knowing if an encounter is a readmission is tricky when the admissions span different healthcare systems.  In the US, readmission information is often calculated well after the fact based on claims data that CMS receives from potentially multiple healthcare systems.  At the time of an encounter, it may not be possible to know if it is a \"readmission\", if the patient was recently admitted for the same condition at a different hospital.</li>\n<li>A patient's conditions and other risk factors are key data points for calculating if something is a readmission.</li>\n</ul>\n<p>In the end, we do represent readmission as a boolean.  However it can be possible for different authorities to disagree on what is considered a readmission.  So we might consider including the authority that is categorizing the admission as a readmission, and potentially an indicator of what model was used in the determination.  Those may also be good candidates for extensions.  But we might need to consider making the property 0..* to account for different authorities classifying an admission differently.</p>",
        "id": 154023239,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1544037254
    },
    {
        "content": "<p>It sounds like an Observation to me.  It's a point-in-time assertion made based on a set of facts following a particular set of rules.  Different assertions about the same two encounters might be made by different authors because they're using different rules or using different sets of inputs.  Observation would let you tie those things together.  So you could say \"this is a re-admission from payer 1's perspective, but not from payer 2's perspective\"</p>",
        "id": 154024325,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544492577
    }
]