[
    {
        "content": "<p>Hello, <br>\nI am looking to capture how care was delivered during an encounter. The values that I have are in person, virtual, or phone. I was thinking we could capture this under encounter.class as some of the values in the value set bound to this element align with the 3 values stated. However, some feel that Encounter.Class is meant to capture the care delivery setting rather than the care delivery mechanism. Could encounter.class be used to capture how care was delivered or is it meant more so for capturing the care delivery setting?</p>",
        "id": 261853582,
        "sender_full_name": "Inderpal Singh",
        "timestamp": 1637185312
    },
    {
        "content": "<p>I think the top line of the Encounter definition sums it up, \"An interaction between a patient and healthcare provider(s) for the purpose of providing healthcare service(s) or assessing the health status of a patient.\"<br>\nIt doesn't say \"in-person\" or \"care-delivery\", it's an interaction between patient and provider. If what you are doing is recording an interaction, then it's an Encounter. (My opinion)</p>",
        "id": 261854960,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1637185791
    },
    {
        "content": "<p>I agree, it's definitely an encounter. However, what I'm trying to determine is - can we capture the care delivery mechanism (in-person, virtual, telephone) in the Encounter.Class element? Or is encounter.class only mean to capture the care delivery setting?</p>",
        "id": 261856535,
        "sender_full_name": "Inderpal Singh",
        "timestamp": 1637186486
    },
    {
        "content": "<p><code>virtual</code> is a valid value for Encounter.class: <a href=\"https://terminology.hl7.org/1.0.0//ValueSet-v3-ActEncounterCode.html\">https://terminology.hl7.org/1.0.0//ValueSet-v3-ActEncounterCode.html</a></p>",
        "id": 261858239,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1637187198
    },
    {
        "content": "<p>I'd say that phone is still <code>virtual</code></p>",
        "id": 261858302,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1637187235
    },
    {
        "content": "<p>From the definition, absolutely.  If you need something more fine-grained, you can send an additional coding that provides a more detailed class and distinguishes between the various types of 'virtual'.</p>",
        "id": 261949906,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637252172
    }
]