[
    {
        "content": "<p>We are trying to tie a patient to a FHIR HealthcareService.  For example, a patient being treated for a substance use disorder receives the services of \"Detox\" then \"Inpatient Rehab\" and finally \"Outpatient Therapy.\"  In the eyes of our providers all three of these services would be performed as part of a single EpisodeOfCare, treating the specific problem of substance abuse.  However, what is the appropriate way to link the patient to these HealthcareServices while also recording hospitalization details or the period which services were rendered, in addition to who the careTeam was, and what location(s) the service took place at?  We have some assumptions, but would appreciate some input.</p>",
        "id": 177763946,
        "sender_full_name": "Jayte Boehler",
        "timestamp": 1570662241
    },
    {
        "content": "<p>HealthcareService is a particular organizational capability.  An actual delivered service would be a Procedure and a requested service would be a ServiceRequest.</p>",
        "id": 177765605,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570663995
    },
    {
        "content": "<p>Thanks for the reply Lloyd.  This is helpful, but leads to another question.  When the patient gets admitted into 'Inpatient Rehab' there are a number of additional services (or sub-procedures) that will also need to be recorded, such as a 'Comprehensive Eval', 'Individual Session' and 'Urinary Analysis'.  In this case should we use a [parent] Procedure to record that the patient is admitted to 'Inpatient Rehab' and then child procedures for these more granular services (Comprehensive Eval etc.) which are \"partOf\" the parent procedure?  I was originally thinking that an encounter resource would be utilized to record admission into 'Inpatient Rehab' program.</p>",
        "id": 177854762,
        "sender_full_name": "Jayte Boehler",
        "timestamp": 1570742423
    },
    {
        "content": "<p>Admission would typically be handled as Encounter.  The procedures would then be linked to the Encounter</p>",
        "id": 177861017,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570747568
    }
]