[
    {
        "content": "<p>How are you handling relationships between Patients/Person/User/Organization/Practitioner? We like the idea of the RelatedPerson resource but not the required patient property, we'd rather have this property be used for any resource. Links seem to have some potential if we extend the link property to Organization and Practitioner but we still need to add properties for  relationship type and other things.</p>",
        "id": 182493083,
        "sender_full_name": "Ryan Christensen",
        "timestamp": 1575405836
    },
    {
        "content": "<p>Person only exists as a linkage resource - you can't actually point to Person from any other resource.  You always have to point to Practitioner, Patient or RelatedPerson.</p>\n<p>RelatedPerson is 'owned' by it's associated Patient.  The resource represents someone who's acting based on their personal relationship with a specific patient (mother, child, friend, neighbor).  If you want to capture the fact that Dr. Smith is mother of Dr. Jones and neighbor of Dr. Johnson (for 'smarter' auditing of data access violations?), that would need to be handled by extensions at the moment</p>",
        "id": 182496100,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575407479
    },
    {
        "content": "<p>The problem of extending RelatedPerson is we generally don't have a use-case for \"this procedure was performed by Dr. Jones acting in their capacity as a neighbor of Dr. Johnson\".  We <em>do</em> have a use-case for \"this procedure was performed by Mrs. Jones acting in their capacity as neighbor of Mr. Johnson\".</p>",
        "id": 182496456,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575407674
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> and colleagues,  I am looking for a generic Relationship type that can define arbitrary relationships  between any two entities as follows:</p>\n<ul>\n<li>A relationship SHALL be defined by an instance of a new Relationship class with properties source, target, type and extensions</li>\n<li>The source property of Relationship instance SHALL reference the source entity by its id property value</li>\n<li>The target property of Relationship instance SHALL reference the target entity by its id property value</li>\n<li>The type property of Relationship instance may optionally be specified to define the type of relationship. This is useful when there are multiple relationships between the same two entities.</li>\n<li>An extensions property of Relationship instance may be used to define additional properties of the relationship</li>\n</ul>\n<p>The basic idea is that changes to relationship between two entities do not require changing either entity but only changing a Relationship entity.</p>\n<p>Has a generic relationship feature like above been considered for FHIR? Has anyone implemented something like this as an extension to FHIR and has any experience to share? TIA.</p>",
        "id": 244166172,
        "sender_full_name": "Farrukh Najmi",
        "timestamp": 1624895773
    },
    {
        "content": "<p>Managing relationships separately from the resources adds significant additional complexities, including queries, creating instances, indexing, etc.  It would also mean a complete revamp of FHIR - so I don't think it's realistically an option at this point.</p>",
        "id": 244168434,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624896666
    },
    {
        "content": "<p>I think part of the argument is that there is usually only a limited number of likely relationships between two resources, and so making those relationships explicit in the resource is clearer. (And extensions can be used to add the unlikely relationships, if needed for specific use cases. )</p>",
        "id": 244169635,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1624897236
    },
    {
        "content": "<p>True.  That's also a fairly key thing from conformance management.</p>",
        "id": 244176772,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624900595
    },
    {
        "content": "<p>Thanks guys for sharing your insights.</p>\n<blockquote>\n<p>Managing relationships separately from the resources adds significant additional complexities, including queries, creating instances, indexing, etc. It would also mean a complete revamp of FHIR - so I don't think it's realistically an option at this point.</p>\n</blockquote>\n<p>I agree with above. However, FHIR is already a very complex model in order to handle a broad range of use cases. As such, I think the generic relationships support is a reasonable requirement to consider.</p>\n<blockquote>\n<p>think part of the argument is that there is usually only a limited number of likely relationships between two resources, and so making those relationships explicit in the resource is clearer. (And extensions can be used to add the unlikely relationships, if needed for specific use cases. )</p>\n</blockquote>\n<p>I do not think there are a limited number of relationships between two resources. Many entities have fairly open-ended relationships. For example, a relationship between a Person and an Organization may have many unique relationships.</p>",
        "id": 244185952,
        "sender_full_name": "Farrukh Najmi",
        "timestamp": 1624904660
    },
    {
        "content": "<p>Most existing systems only support specific relationships and conformance is managed on the basis of specific relationships.  We could have created a model that supported generic typed elements as well.  The decision to be concrete was a conscious one.  In fact we've specifically said that typed relationships are an anti-pattern and should only be used with caution.</p>",
        "id": 244194235,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624908948
    }
]