[
    {
        "content": "<p><a href=\"/user_uploads/10155/q3uig1-ZpRYY28cbYP45gWjQ/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/q3uig1-ZpRYY28cbYP45gWjQ/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/q3uig1-ZpRYY28cbYP45gWjQ/image.png\"></a></div>",
        "id": 262012387,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1637281824
    },
    {
        "content": "<p>I'm a little confused by the documentation on EOB.created. If I receive a claims file and convert it to FHIR, is EOB.created the date I created the resource, the date of the claim was paid, or something else?</p>",
        "id": 262012436,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1637281870
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 262025420,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637295636
    },
    {
        "content": "<p>I feel like when you receive a claims file you aren't creating EoB resources. You are creating Claim resources, at some point in the future you create a ClaimResponse. After all the processing is done (typically the claim is adjudicated) at that time the EoB is created. The EoB doesn't exist until all processing is done.</p>",
        "id": 262064129,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1637327540
    },
    {
        "content": "<p>In this case, this is a bunch of EOB summary data. We are not getting a response to a claims we've sent. Sorta seems to fit this:</p>\n<p><code> This resource combines the information from the Claim and the ClaimResponse, stripping out any provider or payor proprietary information, into a unified information model suitable for use for: patient reporting; transferring information to a Patient Health Record system; and, supporting complete claim and adjudication information exchange with regulatory and analytics organizations and other parts of the provider's organization.</code></p>",
        "id": 262123853,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1637352952
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"200498\">@Brendan Keeler</span><br>\nThe FMWG reviewed your question today. Are you looking at the R4 Resource or another specific profile?<br>\nFor the CARIN4BB this is the date the claim was adjudicated as an example.</p>\n<p>Please feel free to join our calls if you have additional questions.<br>\n(Tuesday's 11-1pmET.)</p>",
        "id": 263178758,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1638293108
    }
]