[
    {
        "content": "<p>We are in the process of developing base profiles for Encounter and EpisodeOfCare. In that process we would prefer to the extent possible to have a harmonized understanding between vendors of the two resources. In the Example usage paragraph in Encounter the following explanation is for use of Encounter.partOf: <br>\n\"During the encounter, the patient moves from the admitting department to the Intensive Care unit and back - Three more detailed additional Encounters can be created, one for each location in which the patient stayed. Each of these Encounters has a single location (twice the admitting department and once the Intensive Care unit) and one or more participants at that location. These Encounters may use the partOf relationship to indicate these movements occurred during the longer overarching Encounter.\" </p>\n<p>EpisodeOfCare on the other hand is explained as \"The primary difference between the EpisodeOfCare and the Encounter is that the Encounter records the details of an activity directly relating to the patient, while the EpisodeOfCare is the container that can link a series of Encounters together for problems/issues.” </p>\n<p>What would be a good principle to decide when to use Encounter.partOf vs EpisodeOfCare for aggregating a set of Encounters? </p>\n<p>Cheers</p>",
        "id": 250095790,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1629451233
    },
    {
        "content": "<p>In an Encounter.partOf, the parent Encounter is continuous.  I.e. there's relatively continuous engagement between the patient and healthcare provider throughout at a single location (though the location might be a campus).  If you're dealing with component encounters, you're almost always dealing with a hospital or long-term stay, though as virtual encounters become more sophisticated, you could theoretically have a single 'virtual' visit where you're switched off between a nurse, physician and specialist as part of a single session.</p>\n<p>Episodes, on the other hand, represent discontinuous care.  You may have many encounters over the course of the episode, possibly at different sites.  You might also capture data that isn't tied to an encounter at all (e.g. patient reported data, home monitoring).  Episodes are collection mechanisms for all data associated with a particular health issue - a pregnancy, a bout with cancer, the patient's diabetes.  The episode ends when the problem resolves and you're not tracking it anymore.  (So a pregnancy episode might not 'end' until the post-partum care is finished.)</p>",
        "id": 250116295,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629465629
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, that was a good clarification. Ill take it back to the community here.</p>",
        "id": 250209702,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1629540894
    },
    {
        "content": "<p>If there exists an identifier to identify the patients care pathway across different health care providers, can we use EoC also to track the patients care pathway across these organizations for a particular health issue – a pregnancy, a bout with cancer, the patient’s diabetes e.g.?</p>",
        "id": 250326479,
        "sender_full_name": "Tore Bjerke",
        "timestamp": 1629709312
    },
    {
        "content": "<p>Yes, though be aware the EpisodeOfCare isn't yet well-supported</p>",
        "id": 250367944,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629732509
    },
    {
        "content": "<p>You mean by the vendor community - and support for common identifier?</p>",
        "id": 250446338,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1629786000
    },
    {
        "content": "<p>I'm referring specifically to support for EpisodeOfCare by the vendor community.  If they were going to support a common identifier, EpisodeOfCare would be the logical way to expose it.</p>",
        "id": 250485911,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629812368
    }
]