[
    {
        "content": "<p>Are you interested in Error Handling? <span aria-label=\"boom\" class=\"emoji emoji-1f4a5\" role=\"img\" title=\"boom\">:boom:</span></p>\n<p>I've offered to speak to the topic of \"Error Handling and Error Mitigation\" at the upcoming DevDays in Cleveland OH. (For me personally this is a new subject, as a challenge to look at an issue in more detail then I'd normally do). Focus will be on HTTP status codes and OperationOutcome, plus mitigation (how could one have prevented these issues from occuring? any workarounds/solutions?). The talk won't be about server/client/software specific glitches, but tries to describe the common ground. I've seen a few FHIR implementation guides that also speak to this. </p>\n<p>Question: what in your personal opinion, should be the URLs, concepts, issues covered by such a talk?</p>",
        "id": 188375980,
        "sender_full_name": "René Spronk",
        "timestamp": 1581944353
    },
    {
        "content": "<p>Isnt preventaion part of validation... I can understand they are very much inter related and perhaps finding such relationship and a way to systematically define that would the key</p>",
        "id": 188377592,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1581945924
    },
    {
        "content": "<p>You might already be planning it, but maybe you could cover the use of the Prefer header (for client-specified return and handling preferences) and the tradeoffs between being lenient or strict on the server.<br>\nFor example, when a query comes in with unknown search parameters and/or unknown JSON fields.<br>\nFor example, the spec recommends servers to drop unknown or unsupported parameters by default, but we've found that (in development at least) this leads to confusing results for newer clients who don't know to check the <code>self</code> link or look for warning in the search results.</p>",
        "id": 188393390,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1581958809
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"203885\">@Medi Harsini</span> Sure, prevention is part of it as well. Any mature error message should inform one as to how the error could have been prevented, or how the error can be mitigated once it has happened. Validation errors can be avoided by validating the resource itself before submitting it. But that's just one category of errors.</p>",
        "id": 188429609,
        "sender_full_name": "René Spronk",
        "timestamp": 1582011900
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span> Hadn't thought of it, but I'll definitely add it to the slide deck</p>",
        "id": 188429741,
        "sender_full_name": "René Spronk",
        "timestamp": 1582012054
    },
    {
        "content": "<p>Possible topics in no particular order: Trade-off of validation strategies (XML schema vs. schematron vs. JSON schema vs. full validator; role of terminology services in error detection; trade-off of runtime validation vs. conformance testing; language translation of errors; error vs. warning vs. best practice invariants; validating profile declarations (or not); strategies for detecting instances to validate against profiles; relaying errors from legacy (including converting locations); returning operation outcomes on success (i.e. with warnings);</p>",
        "id": 188455637,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582036841
    },
    {
        "content": "<p>just read your post at <a href=\"#narrow/stream/179166-implementers/topic/Vonk.20-.20API.20Function.20Validations/near/188429501\" title=\"#narrow/stream/179166-implementers/topic/Vonk.20-.20API.20Function.20Validations/near/188429501\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Vonk.20-.20API.20Function.20Validations/near/188429501</a> and thought it worth mentioning in this thread too...whether to check the references or not seems to be an area of difference for servers.<br>\nMultiple parts</p>\n<ol>\n<li>whether it exists or not</li>\n<li>whether it is of the right resource type or not</li>\n<li>whether it conforms to the profile (for profiles that further constraint reference targets)</li>\n</ol>",
        "id": 188555507,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1582126912
    },
    {
        "content": "<p>from a clients perspective, there's client side validation (as an error prevention measure) prior to calling the server (which does server side validation) which in case of errors leads to error mitigation on the side of the client. As Lloyd points out there's a ton of different approaches a client and/or server could take when validation FHIR content. <br>\nThe validation of references is one of such things, and not an uncontroversial one at that, a reference that doesn't work at some point in time may be valid at some later point in time, or may have been valid at some point in the past. It's a server-side design choice..</p>",
        "id": 188927377,
        "sender_full_name": "René Spronk",
        "timestamp": 1582552304
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>\n<ul>\n<li>XML schema vs. schematron vs. JSON schema vs. full validator: I'm aware of the considerations when it comes to v3/CDA, this is probably no different in the case of FHIR. From what I'm reading on this chat JSON schema is not  a terribly reliable/stable method for validation.</li>\n<li>role of terminology servers: IMHO should be part of 'full validation' testing. Fallback is to at least validate the system (but not the code)</li>\n<li>language translation of errors: would be no different than any other translation issues in FHIR, although it'd be both text as well  as the display name associated with an error code</li>\n<li>strategies for detecting instances to validate against profiles: with that you probably mean scanning the persistence layer to get hold of potential resources which would match a given  profile? What would the most likely strategy be? Each and every change to a resource could cause it to become conformant to a profile, or cause it to be no longer conformant to a profile. But it'd be a lot of overhead to keep validating all resources after any changes that were made, so probably one would try to assess the situation if and when the situation arises that one needs to collect/return resources that conform to a certain profile. Interesting question, but not that closely related to error handling IMHO.</li>\n</ul>",
        "id": 188928775,
        "sender_full_name": "René Spronk",
        "timestamp": 1582553383
    },
    {
        "content": "<p>JSON schema is more thorough than XML schema, but the tooling isn't terribly stable yet.<br>\nTerminology servers - key thing is that checking the validity of terminology can be very complex, so outsourcing to a terminology service is often necessary/appropriate<br>\nTranslation - key thing is that errors may propagate from a variety of locations, so translation is trickier<br>\nstrategies to validate - also about receiving an instance that doesn't declare a profile but you want to know if it's valid against a profile.  Kicking off full validation against all profiles is kind of nuts.  Filtering just by resource type isn't much better.  You probably want some sort of discriminator approach to decide what profiles are worth trying to validate against.  (Dealing with stuff already persisted would also be relevant.)</p>",
        "id": 188934209,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582556946
    },
    {
        "content": "<p>I'm going to post something about the last soon.</p>",
        "id": 188960120,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582574274
    },
    {
        "content": "<p>A draft description of my DevDays tutorial, please feel free to comment, or suggest additional stuff:</p>\n<p>\"Error Handling\"</p>\n<p>To err is human, errors are part of life. In the context of FHIR the main indicators that an error has occured are HTTP result codes, and the OperationOutcome resource. The main reason for errors include Validation issues and the use of API features by a client that are not actually supported by a FHIR server.</p>\n<p>This talk will explore the various ways an error can be identified, discuss whether validation should take place on a client and/or a server,  discuss the relative validation strength of schema versus object model based validation, cover the use of terminology servers for validation, show how best to relay errors from legacy applications, cover error mitigation strategies once errors have happened, and provide examples as to how FHIR implementation guides provide guidance around error handling.</p>",
        "id": 189600975,
        "sender_full_name": "René Spronk",
        "timestamp": 1583247982
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> \"One man's warning might be another man's error.\" (not trying to be gender specific, just figure of speech) Or vice versa.</p>",
        "id": 189638846,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1583272488
    }
]