[
    {
        "content": "<p>A while back, I had gleaned from <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> via <a href=\"#narrow/stream/179166-implementers/topic/Mother.2FChild.20record\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Mother.2FChild.20record</a>, that the preferred way to represent Estimated Due Date (EDD) was via an Observation, such that the one \"final\" EDD would reference the pregnancy instance EpisodeOfCare (where the episode's period represents the pregnancy dates).  Final isn't a status, but more of the designated /preferred EDD (e.g. EDD based on ultrasound might trump the EDD based on LMP)  </p>\n<p>By contrast, more recently, I saw a profile, <a href=\"http://build.fhir.org/ig/HL7/case-reporting/StructureDefinition-pregnancy-status-observation.html\">http://build.fhir.org/ig/HL7/case-reporting/StructureDefinition-pregnancy-status-observation.html</a>, which looks like EDD is a <strong>component</strong> of a broader pregnancy status Observation, such that a single Observation tells you both the pregnancy dates and EDD without a need for EpisodeOfCare in the mix.  </p>\n<p>Where does that leave us today?</p>\n<ul>\n<li>Is EDD no longer a stand alone Observation, but rather an Observation.component?  Use Observation (instead of EpisodeOfCare) as the preferred resource for conveying pregnancy dates?  </li>\n<li>Alternatively, are both acceptable and we're going to see both in the wild?  </li>\n<li>Or, does the profile need adjustment (since I'm not sure whether EDD fits the definition of components since it seems like EDD could reasonably be interpreted and used outside the scope of the containing Observation)?</li>\n</ul>",
        "id": 241602145,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1622847713
    },
    {
        "content": "<p>I don't think those two components meet the requirements for 'component':</p>\n<ul>\n<li>neither is qualifying the other</li>\n<li>neither are being measured at the same time by the same method.</li>\n</ul>\n<p>You've got two observations, one which is derived based on the other.  They may well be made at different times.  For example, an estimate of gestational age might be made by an ultrasound technician.  However, such technicians don't typically assert an estimated delivery date (though they can probably do the math as well as anyone else...)</p>\n<p>In some cases, an estimated delivery date might be based on multiple estimates of gestation dates determined by different sources.</p>",
        "id": 241611094,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622859980
    }
]