[
    {
        "content": "<p>Hello all. We are just starting with FHIR implementation for Estonian EHR data exchange. We started with profiling of Patient and reached to some questions.</p>",
        "id": 200084331,
        "sender_full_name": "Kerli Linna",
        "timestamp": 1591615496
    },
    {
        "content": "<p>Q1: What is the correct solution to constrain the required value set (<a href=\"http://hl7.org/fhir/contact-point-use\">http://hl7.org/fhir/contact-point-use</a>)? For example if we would like to point out that only options can be: home and work or just one of them for different use case? How should we describe the constraint? The same kind of question about ContactPointSystem (Required), where we need to describe that for contact anly email or/and phone could be documented under telecom.</p>",
        "id": 200084351,
        "sender_full_name": "Kerli Linna",
        "timestamp": 1591615512
    },
    {
        "content": "<p>Q2: If FHIR uses it`s own value set for gender: AdministrativeGender (Required) and it is required value set, but we use national value set with different codes and some consepts are also different. It is mandatory to use only these codes that are in national value set in data exchange. How should we describe the rule in our FHIR patient profile?</p>",
        "id": 200084362,
        "sender_full_name": "Kerli Linna",
        "timestamp": 1591615524
    },
    {
        "content": "<p>Q3: In our EHR data exchange we have 3 options for patient identifiers: national ID, foreigner ID, unknown person ID (generated). For each one of them we use different OID to separate them and keep them unique. This is how we tried to profile this rule (on the picture) - we sliced the identifier to describe these three possibilies and added the OID to fixed value. Is this the correct way to do this?</p>",
        "id": 200085135,
        "sender_full_name": "Kerli Linna",
        "timestamp": 1591616096
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/5Y2WECugFxMR-1hxOIMpuBjR/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/5Y2WECugFxMR-1hxOIMpuBjR/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/5Y2WECugFxMR-1hxOIMpuBjR/image.png\"></a></div>",
        "id": 200085272,
        "sender_full_name": "Kerli Linna",
        "timestamp": 1591616185
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/iorSLFOtRFExJ8hbwwhrctBR/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/iorSLFOtRFExJ8hbwwhrctBR/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/iorSLFOtRFExJ8hbwwhrctBR/image.png\"></a></div>",
        "id": 200085380,
        "sender_full_name": "Kerli Linna",
        "timestamp": 1591616272
    },
    {
        "content": "<p>Now if we validate this with Simplifier and remove the ID value it is still valid. But the value element is mandatory.</p>",
        "id": 200085620,
        "sender_full_name": "Kerli Linna",
        "timestamp": 1591616422
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/OYvVVeWkOy9UYfbysivlqvir/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/OYvVVeWkOy9UYfbysivlqvir/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/OYvVVeWkOy9UYfbysivlqvir/image.png\"></a></div>",
        "id": 200085627,
        "sender_full_name": "Kerli Linna",
        "timestamp": 1591616434
    },
    {
        "content": "<p>Q4: In Estonian system we separate addresses as registred and actual living addresses, but in FHIR the address use element has it`s own required value set: AddressUse (Required). Could we extend the value set? And how should it be described?</p>",
        "id": 200086085,
        "sender_full_name": "Kerli Linna",
        "timestamp": 1591616751
    },
    {
        "content": "<p>Hello Kerli. I have some answers for you.<br>\nQ1: You can create a ValueSet which contains those code from <a href=\"http://www.hl7.org/fhir/codesystem-contact-point-use.html\">http://www.hl7.org/fhir/codesystem-contact-point-use.html</a> which you need. Then you create a profile where you constrain the field to this ValueSet. As your ValueSet is a subset of the codes in the required binding, this should be okay.</p>",
        "id": 200087202,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1591617561
    },
    {
        "content": "<p>Q2: We had a similar situation in Germany and created an extension, as you can't change a required binding. We wanted to divide \"Other\", so we have now this extension: <a href=\"https://simplifier.net/basisprofil-de-r4/genderamtlichde\">https://simplifier.net/basisprofil-de-r4/genderamtlichde</a>. Probably this gives you ideas.</p>",
        "id": 200087704,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1591617855
    },
    {
        "content": "<p>Q2, Q4: you'll need an extension to convey your own codes, if and when FHIR has defined its own. That way, you can use your own codes, and/or introduce new concepts that are 'refinements' of the FHIR concepts. The Netherlands (and some other countries) use an extension like <a href=\"https://simplifier.net/NictizSTU3-Zib2017/nl-core-address-official\">https://simplifier.net/NictizSTU3-Zib2017/nl-core-address-official</a> to identify the official/registered address, so that's a different way of solving the address issue.</p>",
        "id": 200087747,
        "sender_full_name": "René Spronk",
        "timestamp": 1591617897
    },
    {
        "content": "<p>Q4: As this is also a required binding, if I'm correct, you can't extend the ValueSet. As  <span class=\"user-mention silent\" data-user-id=\"191372\">René Spronk</span> already said: You need an extension for this.</p>",
        "id": 200087872,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1591617982
    },
    {
        "content": "<p>Hi, Kerli.  For Q2, as has already been mentioned you will need an extension to send your national codes.  But  I'm wondering about the \"only\" in your statement that \"it is mandatory to use only these codes that are in national value set in data exchange\".  Unless I'm misunderstanding, it sounds like that could be an issue, as to be conformant with FHIR you do need to send the required FHIR codes in addition to the national codes that you would send in the extension.  Maybe you can clarify further what your requirements are.</p>",
        "id": 200088613,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1591618486
    },
    {
        "content": "<p>Regarding Q2, take a look at <a href=\"https://hl7.org/fhir/R4/patient.html#gender\">https://hl7.org/fhir/R4/patient.html#gender</a>.  If you have a region specific valueset, I imagine it is for either legal sex or gender identity?  If so, then using an extension is appropriate.  There is a standard extension for gender identity, but for legal sex, you'll want a country (or document) specific extension.  I say document level because, for example, if folks can have a different sex on their drivers license vs. passport (if they want to travel to other countries that have sensitivity around gender), they may want to have different sex/gender values on different legal documents.</p>",
        "id": 200099530,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1591624222
    },
    {
        "content": "<p>For Q3, how are you declaring your slice discriminator?  Also, did you consider using URIs rather than OIDs?  URIs are much more implementer-friendly than OIDs.</p>",
        "id": 200106409,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591627125
    },
    {
        "content": "<p>They already have v3 (mostly: CDA) up and running at the national level, so they're quite used to OIDs.</p>",
        "id": 200129145,
        "sender_full_name": "René Spronk",
        "timestamp": 1591636744
    },
    {
        "content": "<p>So's Canada.  I'm still pushing us to map our OIDs to URLs.  OIDs have an ongoing learning curve and cost.  The cost to build in a transformation layer is mandatory anyhow (because FHIR requires URIs for many terminologies and some identifier schemes), so why incur a long-term cost when you've got to have the conversion engine regardless?</p>",
        "id": 200163507,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591655264
    }
]