[
    {
        "content": "<p>Hi there, I'm looking to gather some information regarding a Patient's Ethnicity and/or minority community in an encounter (if available). Researching the documentation for extensions and for the Patient resource, I can not find nothing regarding this information. Do you guys know about a extension or something related with the information needed ? Thanks in advance <img alt=\":+1:\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/unicode/1f44d.png\" title=\":+1:\"></p>",
        "id": 153917331,
        "sender_full_name": "Camilo Giraldo",
        "timestamp": 1509639151
    },
    {
        "content": "<p>check out <a href=\"http://hl7.org/fhir/us/core/\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/\">US Core Implementation Guide</a> it has these extensions and profiles for the US implementers</p>",
        "id": 153917332,
        "sender_full_name": "Eric Haas",
        "timestamp": 1509640284
    },
    {
        "content": "<p>Whether racial/ethnicity information is captured for demographic purposes and what sort of information is relevant tends to be highly country-specific.  In most countries it's not done (or is even illegal).  Where it is done, it's driven by the historical background and sensitivities for the specific country, thus its use as an extension.  If you're interested in ancestry information for clinical reasons (e.g. Ashkenazi Jewish heritage), that information is best captured as an Observation.</p>",
        "id": 153917334,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1509640981
    },
    {
        "content": "<p>Thanks. Lloyd, I think we're talking about the first scenario you addressed. Do we have any non-US especific extension for this ?</p>",
        "id": 153917339,
        "sender_full_name": "Camilo Giraldo",
        "timestamp": 1509641469
    },
    {
        "content": "<p>No - each jurisdiction that has this need should define extensions that reflect the definitions and value sets that are relevant in their particular context.</p>",
        "id": 153917445,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1509653877
    },
    {
        "content": "<p>the Australian core IG has an australian specific extension for this as defined by applicable Australian government regulation</p>",
        "id": 153917463,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1509656075
    }
]