[
    {
        "content": "<p>Are you located in the EU, or does your application use/process data from EU citizens? Then the GDPR (General data protection Regulation) legislation is likely to impact your application, see <a href=\"http://www.ringholm.com/column/GDPR_impact_on%20healthcare_data_interoperability.htm\" target=\"_blank\" title=\"http://www.ringholm.com/column/GDPR_impact_on%20healthcare_data_interoperability.htm\">http://www.ringholm.com/column/GDPR_impact_on%20healthcare_data_interoperability.htm</a> for (initial) analysis.<br>\nIf you are like me (dismissive of such laws: who cares about such legislation, it's mostly procedural/organisational) - this will have an impact at the coalface and on the use of interoperability standards such as FHIR.</p>",
        "id": 153895210,
        "sender_full_name": "René Spronk",
        "timestamp": 1498473836
    },
    {
        "content": "<p>I'm not yet aware of any direct impact on FHIR itself. It does mean that you mean to by more careful around provenance, auditing, and your policy (and adherence)</p>",
        "id": 153895211,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498474261
    },
    {
        "content": "<p>We also designed Consent with these rules in mind. Hence why we included a place to record the actual text the patient saw and agreed to, so that it can be shown that it was crafted such that it would be understood by that patient.   Yes, Provenance and Auditing are always important . </p>",
        "id": 153895212,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498479435
    },
    {
        "content": "<p>The unique view Rene has captured is the requirement to provide to the subject any data about the subject ... in a standardized form... that is useful... hence \"Interoperability Standards\" (PDF likely not good enough).    As with the human-language-comprehension requirement, this Interoperability Standards requirement is the right thing for the goal of Privacy (which is more than confidentiality  <a href=\"http://healthcaresecprivacy.blogspot.com/2015/04/privacy-principles.html\" target=\"_blank\" title=\"http://healthcaresecprivacy.blogspot.com/2015/04/privacy-principles.html\">http://healthcaresecprivacy.blogspot.com/2015/04/privacy-principles.html</a> ). But these requirements are hard to achieve, especially for small organizations. Ewout pointed this out at the Madrid meeting.</p>",
        "id": 153895213,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498479817
    },
    {
        "content": "<p>The post is more of a wake up call: if your application is involved in any data processing scenario which requires a patient consent, then under the GDPR you SHALL have an API by May 2018 which allows the patient to pull all of the data out of the application in a structured fashion.<br>\nThat's a challenge above and beyond the more general requirement of taking better care of general privacy and security issues.</p>",
        "id": 153895276,
        "sender_full_name": "René Spronk",
        "timestamp": 1498546126
    },
    {
        "content": "<p>Does this legislation mention anything about you receiving private patient information accidentally? For example if you're neither a processor nor a controller, but someone emails it to you by accident</p>",
        "id": 153895277,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1498546568
    },
    {
        "content": "<p>I think it would make EU adoption of an argonaut like process and API somewhat urgent, but I'm not hearing very much noise about that </p>",
        "id": 153895279,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498546713
    },
    {
        "content": "<p>Alpha version of UK API - <a href=\"https://nhsconnect.github.io/CareConnectAPI/explore.html\" target=\"_blank\" title=\"https://nhsconnect.github.io/CareConnectAPI/explore.html\">https://nhsconnect.github.io/CareConnectAPI/explore.html</a></p>",
        "id": 153895290,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1498549655
    },
    {
        "content": "<p>The section on security labels and provenance. I'm seeing this as applying more to messaging rather than API's - a big spanner for traditional (HL7v2) messaging?</p>",
        "id": 153895291,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1498551411
    },
    {
        "content": "<p>You're wrong - this requirement spans all paradigms. In REST, labels need to be present as part of the matadata of all resources, and Provenance (&amp;Consent) resources much be both created on the server and they must by queryable. Same for AuditEvents. <br>\nIn a bundle (e.g. of type message) one would include the Provenance &amp; Consent resources. If the bundle were in to be in response to a $gimme-GDPR-everything operation, it would also include all AuditEvent resources.<br>\nThe impact of GDPR may be wider than that, that section is just an initial analysis.</p>",
        "id": 153895292,
        "sender_full_name": "René Spronk",
        "timestamp": 1498555769
    },
    {
        "content": "<p>perhaps we could work towards a connectathon about this at DevDays?</p>",
        "id": 153895293,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498558051
    },
    {
        "content": "<p>I would be very happy to find a set of people interested in testing security-labels, Provenance, AuditEvent, and Consent. Mike Davis has sent Duane to the last 5-6 connectathons only to find no one ready to address this level of Access Control or Audit Logging...  He has great materials on how he has implemented it. </p>",
        "id": 153895309,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498574269
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> I was commenting with an engineering hat on. It will take far longer for messaging systems to adapt, if it is built into EU FHIR it's a big plus for adoption. Is it worth having an EU stream for these topics? Zulip can be difficult to follow at times.</p>",
        "id": 153895313,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1498576263
    },
    {
        "content": "<p>I'm aware some of the US HIPAA consultants have been working on extending HL7v2 and HL7 v3 (CDA) to include Consent and other bits that would also be needed for the GDPR. We may wish to look into that. <br>\nWe could try and arrange a stream, but we'll have to see how we can raise awareness about this issue first - if we don't get sufficient interest in the issue any initiatives will be dead in the water. Usually there's not that much which binds the various EU Affiliates, not the various EU Vendors, so an EU Argonaut type initiative will be very hard to organise. We should probably go for generic guidance around the use of certain resources, and test that at a FHIR connectathon.</p>",
        "id": 153895367,
        "sender_full_name": "René Spronk",
        "timestamp": 1498632604
    },
    {
        "content": "<p>yes. I just read what you wrote. Some of the legislation is astonishing, actually. Outright fantasy. I'm guessing that the EU or national governments haven't actually allocated money to cover their own costs in meeting the law, let alone any one else's costs - only to mandate that you can't recover them. As for investing in the infrastructure that they assume exists... </p>",
        "id": 153895375,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498637402
    },
    {
        "content": "<p>anyway, we definitely need a stream on consent at DevDays. </p>",
        "id": 153895376,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498637423
    },
    {
        "content": "<p>I'll look into that </p>",
        "id": 153895377,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498637429
    },
    {
        "content": "<p>on the subject of EU Argonaut... I expect that will be problematic, yes</p>",
        "id": 153895378,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498637462
    },
    {
        "content": "<p>The May2018 deadline will never be met in healthcare - we all know that. I don't know about the specifics of all EU governments, but certainly the Dutch governoment doesn't seem to be aware of the consequences of this requirement. <br>\nHaving a CAT stream on consent/security labels/AuditEvent would seem desirable.</p>",
        "id": 153895407,
        "sender_full_name": "René Spronk",
        "timestamp": 1498653288
    },
    {
        "content": "<p>I am not convinced that this changes the Privacy Consent landscape, yes it makes it more prominent.  I need to point out that just because Consent is necessary, does not mean it must be gathered and/or communicated in an standard form. Consent is authorization for you to disclose the data you have to specific others. The result of you capturing consent rules is that YOU enforce those rules. Everyone else simply asks for the data they want and either get it or are denied.  There are very few use-cases where one party captures the Consent (rules) and another party is asked to enforce those rules...   This is why there is little interest in standardized consent, it is unnecessary to be standardized. So it might feel like we must do something about Consent, but reality is that consent is a local problem. This is even true of solutions like HEART (using UMA OAuth), the capturing of consent and enforcing of that consent are proprietary within the AuthZ actor. The only other consent standard is the 'Consent Receipt', which captures what was signed in non-coded form so-that the subject has a copy.   Even when a HIE choose to have a central consent management, it is responsible for capturing and enforcing (not using HEART, but very HEART like).  </p>",
        "id": 153895408,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498653306
    },
    {
        "content": "<p>that's not my understanding of heart. It's certainly true about smart on FHIR, where the contract between the auth server and the resource server is private, and the app requests are just indicative. </p>",
        "id": 153895411,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498653878
    },
    {
        "content": "<p>OTOH, in UMA/Heart, there's a standard contract between the AS and RS, and so they must agree about the impact consent. That's not quite the same as exchanging consent, but it's more than what you said</p>",
        "id": 153895412,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498653954
    },
    {
        "content": "<p>In the case of HEART, one needs to describe how one asks for an authorization token in such granularity that it can get approved or denied. So very much like generic OAuth. It is all about defining how to use 'scope' to express a boundary of what you want, what access you have been granted. This is no less hard than defining a Consent, in some cases it is much harder. But it is real-time authorization decisions, not one-time consent capture.</p>",
        "id": 153895419,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498655824
    },
    {
        "content": "<p>The man difference with HEART is that one separates the authorization decision responsibility. Otherwise spoken of as 'cascaded oAuth', where one cascades decisions. Two (for example) decisions that both must result in a PERMIT decision. The HEART authority is responsible for Privacy decisions, there is another that is responsible for Security (organizational) decisions.</p>",
        "id": 153895421,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498655993
    },
    {
        "content": "<p>In GDPR the right to 'data protability' applies to all data controllers and data processors involved.  It that sense it's 'contageous'. If as a healthcare provider A I have captured consent 1 to share data within an XDS affinity domain in the form of a PDF, and that PDF is consumed by provider B, I as the patient could go to either the XDS affinity domain, A, or B, to get hold of my data. Being in the know I'd go to  A, because they could probably give me the data in a better format than a PDF. <br>\nThat's why my blog talks about \"downstream consequences\". Note that there are (according to the GDPR) also legal grounds for sharing data within an XDS affinity domain. So at the very least there must be a set of privacy labels  to distinguish  between the reasons for sharing (consent based, or legal ground). If consents are purely local they act a bot like Provenance to back up the security label. If consents are wider in scope (in a national consent registry, Austria has this, some other countries are planning for it) it actually has a wider value (although receivers could just go to the national registry and see what consents have been given by a patient). Value for including Consent (to me): it is the consent the author of the information \"thought to be applicable\" - whether they applied the consent correctly or wrongly, we need to know what ground they thought they had for sharing the data (but that info could also be part of the AuditTrail). </p>",
        "id": 153895433,
        "sender_full_name": "René Spronk",
        "timestamp": 1498659383
    },
    {
        "content": "<p>Rene, Yes an audit is a technical backing of that kind of a report. One would not give direct (Raw) access to the audit, but one would create access reports given the data in the log. The AuditEvent can capture what was exported, to whom, when, where, and why... An audit reporting tool would search and filter these into a report. This report might be on-demand, monthly, daily, or in-real-time. This report might be delivered by many different means. This report is itself, PII... And PII about not just the subject, but also all those mentioned in the report (the subject's data recipients).... which causes a whole new set of AuditEvents to be logged.</p>",
        "id": 153895436,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498660508
    },
    {
        "content": "<p>--- Another solution is the Kantara 'consent receipt', like a cash-register-receipt this is a blob that is dispensed when data is disclosed. this consent-receipt is, in theory, sent to the subject and expresses what data was released and under what authorization it was released.  -- This  combined with my prior message is simply a container for that access report.</p>",
        "id": 153895437,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498660551
    },
    {
        "content": "<p>Note the access report can also leverage the FHIR AuitEvent resource schema to hold the details in computable form... wrapped in a Composition so that there is a nice viewable narrative followed by the computable form.  I have mocked this up in my head and in PPT; but failed to get it more detailed than that.... Would love to have someone actually put that together... Would make a nice Implementation Guide...Oh to have infinite time</p>",
        "id": 153895438,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498660705
    },
    {
        "content": "<p>FYI: for easy reading: <a href=\"https://gdpr-info.eu/\" target=\"_blank\" title=\"https://gdpr-info.eu/\">https://gdpr-info.eu/</a></p>",
        "id": 153895440,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498661185
    },
    {
        "content": "<p>Regarding export of data in a standardized form ... take that with a grain of salt. It might as well be a CSV file ... that is a broadly accepted standard - and so is PDF. While FHIR may seem as a good alternative, GDPR has no intention of bruteforcing FHIR into the field 'just' to be able to export data to the individual.</p>",
        "id": 153895441,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498661426
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> Where do you see it stated that there SHALL be and API access to the data? <a href=\"https://gdpr-info.eu/art-20-gdpr/\" target=\"_blank\" title=\"https://gdpr-info.eu/art-20-gdpr/\">https://gdpr-info.eu/art-20-gdpr/</a> ? It does not mention anything about an API</p>",
        "id": 153895442,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498661706
    },
    {
        "content": "<p>See <a href=\"http://ec.europa.eu/information_society/newsroom/image/document/2016-51/wp242_en_40852.pdf\" target=\"_blank\" title=\"http://ec.europa.eu/information_society/newsroom/image/document/2016-51/wp242_en_40852.pdf\">http://ec.europa.eu/information_society/newsroom/image/document/2016-51/wp242_en_40852.pdf</a> - official guidance , this also states: The EU Guidance strongly encourages cooperation between industry stakeholders and trade associations to work together on a common set of interoperable standards and formats to deliver the requirements of the right to data portability. It also suggests that vendors offer an appropriately secured and documented API.</p>",
        "id": 153895443,
        "sender_full_name": "René Spronk",
        "timestamp": 1498661854
    },
    {
        "content": "<p>Seems like an interpretation to me</p>",
        "id": 153895444,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498661905
    },
    {
        "content": "<p>\"On a technical level, data controllers should offer different implementations of the right to<br>\ndata portability. For instance, they should offer a direct download opportunity for the data<br>\nsubject but should also allow data subjects to directly transmit the data to another data<br>\ncontroller. This could be implemented by making an API5<br>\navailable. Data subjects may also<br>\nwish to use of a personal data store or a trusted third party, to hold and store the personal data<br>\nand grant permission to data controllers to access and process ...\" - they should ... they SHALL not</p>",
        "id": 153895445,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498661958
    },
    {
        "content": "<p>\"encourages\" is not a SHALL, but i didn't state that either in my blog (I hope). This is bu EU Workgroup 29, and as such is official guidance by the group that authored the GDPR, something not just to guide the implementation, but also to guide the legal interpretation.</p>",
        "id": 153895446,
        "sender_full_name": "René Spronk",
        "timestamp": 1498661987
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/SCKdiPTGraJuhh_4_Dc2O-2g/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a>  - I recited you <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> , not GDPR</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/SCKdiPTGraJuhh_4_Dc2O-2g/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/SCKdiPTGraJuhh_4_Dc2O-2g/pasted_image.png\"></a></div>",
        "id": 153895447,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498662060
    },
    {
        "content": "<p>I'm just playing the devil's advocate here. I agree the GDPR could be aided by the features of FHIR</p>",
        "id": 153895448,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498662154
    },
    {
        "content": "<p>But it is not a hard requirement</p>",
        "id": 153895449,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498662172
    },
    {
        "content": "<p>But I guess it could make sense to spec a FHIR operation that is to return a bundle of all kinds of stuff</p>",
        "id": 153895451,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498662213
    },
    {
        "content": "<p>And maybe also an operation that deletes all kinds of stuff (the right to be forgotten)</p>",
        "id": 153895452,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498662234
    },
    {
        "content": "<p>When one summarizes, one simplifies :-)</p>",
        "id": 153895453,
        "sender_full_name": "René Spronk",
        "timestamp": 1498662244
    },
    {
        "content": "<p>When one operates as an engineer, one take things very literally :D</p>",
        "id": 153895454,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498662309
    },
    {
        "content": "<p>Even if all vendors had some sort of API that exported CSV, that would already be a radical change. But given the WG 29 guidance it's likely they wouldn't be able to get away with that for very long, given that industry standards already exist</p>",
        "id": 153895455,
        "sender_full_name": "René Spronk",
        "timestamp": 1498662339
    },
    {
        "content": "<p>v2, CDA, XDS, or (in denmark) Edifact ;-)</p>",
        "id": 153895457,
        "sender_full_name": "René Spronk",
        "timestamp": 1498662456
    },
    {
        "content": "<p>Roger that. 2 things - 1) CSV is broader accepted that any healthcare standard, so which standard is the most 'standard' 2) It won't be long before all danish healthcare actors are required to support  and report according to the CDA spec found on <a href=\"http://art-decor.org/art-decor/decor-project--lpr-\" target=\"_blank\" title=\"http://art-decor.org/art-decor/decor-project--lpr-\">http://art-decor.org/art-decor/decor-project--lpr-</a></p>",
        "id": 153895459,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498662658
    },
    {
        "content": "<p>And don't forget <a href=\"https://gdpr-info.eu/recitals/no-73/\" target=\"_blank\" title=\"https://gdpr-info.eu/recitals/no-73/\">https://gdpr-info.eu/recitals/no-73/</a> - which is considered as an emergency exit by some public organizations</p>",
        "id": 153895460,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498663047
    },
    {
        "content": "<p>I would caution EU to be careful what you wish for.. You might end up with something like the USA Direct Project...</p>",
        "id": 153895467,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498665160
    },
    {
        "content": "<p>What is the (national) scope of the portability requirement? Does it extend nationally (or home countries as in Wales, England, Scotland and NI).</p>",
        "id": 153895468,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1498665641
    },
    {
        "content": "<p>As I understand it, it's to ensure citizens have access to their data primarily aimed at social networks. As a citizen I would expect that to also extend to my health data and would enable me to give an EU medical practitioner access to my health record. (Expect that to be a PDF across the EU and England, maybe moving to FHIR Composition)</p>",
        "id": 153895470,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1498667392
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194909\">@Kevin Mayfield</span> Don't get your hopes up high: \"... in a structured, commonly used and machine-readable format and have the right to transmit those data to another controller without hindrance from the controller to which the personal data have been provided ... \" (<a href=\"https://gdpr-info.eu/art-20-gdpr/\" target=\"_blank\" title=\"https://gdpr-info.eu/art-20-gdpr/\">https://gdpr-info.eu/art-20-gdpr/</a>) . I wouldn't call PDF a machine-readable format (as a software engineer) given that it can be a scanned note written on a piece of papyrus using morse code filled with blood stains and being on fire and the scan resolution is 4 DPI. While this crispy PDF document may be crap for engineers, it does however conform to the GDPR as PDF is machine-readable from a lawyers point of view.</p>",
        "id": 153895478,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498670570
    },
    {
        "content": "<p>To qoute the official EU guidance on data portability: \"Data controllers should provide as many metadata with the data as possible at the best<br>\npossible level of granularity, which preserves the precise meaning of exchanged<br>\ninformation. As an example, providing an individual with .pdf versions of an email inbox<br>\nwould not be sufficiently structured. E-mail data must be provided in a format which<br>\npreserves all the meta-data, to allow the effective re-use of the data. As such, when selecting a<br>\ndata format in which to provide the personal data, the data controller should consider how this<br>\nformat would impact or hinder the individual’s right to re-use the data. In cases where a data<br>\ncontroller is able to provide choices to the data subject regarding the preferred format of the<br>\npersonal data a clear explanation of the impact of the choice should be provided. However,<br>\nprocessing additional meta-data on the only assumption that they might be needed or wanted<br>\nto answer a data portability request poses no legitimate ground for such processing.\" (<a href=\"http://ec.europa.eu/information_society/newsroom/image/document/2016-51/wp242_en_40852.pdf\" target=\"_blank\" title=\"http://ec.europa.eu/information_society/newsroom/image/document/2016-51/wp242_en_40852.pdf\">http://ec.europa.eu/information_society/newsroom/image/document/2016-51/wp242_en_40852.pdf</a>)</p>",
        "id": 153895604,
        "sender_full_name": "René Spronk",
        "timestamp": 1498719237
    },
    {
        "content": "<p>So yes, one could use a CSV format to dump ones database records, but you'd have to enrich them with metadata in such a way that it would be fairly easy for a patient to re-use the data and upload it somewhere else. The legislation is meant to support \"portability\", not simply \"access\" .</p>",
        "id": 153895605,
        "sender_full_name": "René Spronk",
        "timestamp": 1498719363
    },
    {
        "content": "<p>PDF also doesn't cut for data portability, unless one happens to use PDF-with-XML-attachments.</p>",
        "id": 153895607,
        "sender_full_name": "René Spronk",
        "timestamp": 1498719487
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194909\">@Kevin Mayfield</span> This applies accross all of the EU, but each and every healthcare provider currently can choose to do this in their own way, as long as there is no agreed upon format. One can only hope for a certain level of standardisation at the national (or UK home country) level.</p>",
        "id": 153895608,
        "sender_full_name": "René Spronk",
        "timestamp": 1498719599
    },
    {
        "content": "<p>I would love to see that in action</p>",
        "id": 153895609,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498719630
    },
    {
        "content": "<p>What metadata would you provide for eg. a Patient resource? The FHIR documentation along with vendor specific extensions?</p>",
        "id": 153895610,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498719792
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> Recital 73 will (IMHO) only be an escape if there's additional danish legislation which adds additional scenarios for data processing that don't require patient consent (remember: any scenario which needs consent, then the data will be subject to data portability rights). <br>\nRecital 73 limits the scope of how the EU, or its member states, could define additional \"legal reasons\" for processing data without explicit patient consent. In and of itself Recital 73 doesn't offer a \"way out\" of the GDPR requirements, unless one can point to more specific legislation by the EU or members states.</p>",
        "id": 153895611,
        "sender_full_name": "René Spronk",
        "timestamp": 1498719854
    },
    {
        "content": "<p>When using FHIR, a link to a profile would be sufficient I think.</p>",
        "id": 153895613,
        "sender_full_name": "René Spronk",
        "timestamp": 1498719907
    },
    {
        "content": "<p>ie. the tax authorities does not require consent</p>",
        "id": 153895615,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498719966
    },
    {
        "content": "<p>and ... keeping of public registers kept for reasons of general public interest ...</p>",
        "id": 153895616,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498720034
    },
    {
        "content": "<p>thats a pretty broad definition</p>",
        "id": 153895617,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498720043
    },
    {
        "content": "<p>but sure, that limits the amount of scenarios</p>",
        "id": 153895618,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498720135
    },
    {
        "content": "<p>for the registers: probably things like quality registries, cancer registries <a href=\"http://et.al\" target=\"_blank\" title=\"http://et.al\">et.al</a>. Anonimized/pseudonimized. </p>",
        "id": 153895619,
        "sender_full_name": "René Spronk",
        "timestamp": 1498720166
    },
    {
        "content": "<p>I agree the definition is wide ranging - but definitely not all -encompassing.</p>",
        "id": 153895620,
        "sender_full_name": "René Spronk",
        "timestamp": 1498720202
    },
    {
        "content": "<p>right - now,if using FHIR, it would then pretty much require all vendors to put their documentation out there in the open (which sounds great to me), but that is probably not the intention with GDPR</p>",
        "id": 153895621,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498720293
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/jGaUm1LkXc1Uce4R_pC4e55f/Screen-Shot-2017-06-29-at-08.19.47.png\" target=\"_blank\" title=\"Screen-Shot-2017-06-29-at-08.19.47.png\">Screen-Shot-2017-06-29-at-08.19.47.png</a> Ok, I jumped to PDF without showing any working out. Attached documents health systems within an organisation and what types of systems they are likely to have. The terms Wacther A, B and C indicate digital maturity with around 80% of hospitals being B and C. </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/jGaUm1LkXc1Uce4R_pC4e55f/Screen-Shot-2017-06-29-at-08.19.47.png\" target=\"_blank\" title=\"Screen-Shot-2017-06-29-at-08.19.47.png\"><img src=\"/user_uploads/10155/jGaUm1LkXc1Uce4R_pC4e55f/Screen-Shot-2017-06-29-at-08.19.47.png\"></a></div>",
        "id": 153895622,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1498720969
    },
    {
        "content": "<p>The systems are broken down into what resources they could provide (easy wins), so resources like Patient, DocumentReference, Binary, EpisodeOfCare, Encounter, Observations feature quite highly. Yes it's focusing on low hanging fruit but also shows FHIR is possible rather than 1990's csv format with all the interop problems that will create.</p>",
        "id": 153895623,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1498721144
    },
    {
        "content": "<p>I'd also be concerned that adding security labels and complex consent can effectively place the interop into a concrete bunker and make it unusable to most. That would also be against the spirit of GPDR and prevent the patient from being able to transfer their records from A to B. </p>",
        "id": 153895625,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1498721608
    },
    {
        "content": "<p>If we have ways of avoiding these complexities, such as Patient can use OAuth2 to generate an extract records from an EPR to populate their PHR and then populate another EPR (with implied consent). </p>",
        "id": 153895626,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1498721964
    },
    {
        "content": "<p>If in terms of scope that EPR extract covers at least that which is covered by the Data Portability right then you're all set. Be aware that the Data Portability right may extend to quite detailed things such as all diagnostic images, all videos, ECGs etc. - these normally aren't included in an EPR extract.</p>",
        "id": 153895627,
        "sender_full_name": "René Spronk",
        "timestamp": 1498722559
    },
    {
        "content": "<p>I've added a \"questions\" section to the blog at <a href=\"http://www.ringholm.com/column/GDPR_impact_on%20healthcare_data_interoperability.htm\" target=\"_blank\" title=\"http://www.ringholm.com/column/GDPR_impact_on%20healthcare_data_interoperability.htm\">http://www.ringholm.com/column/GDPR_impact_on%20healthcare_data_interoperability.htm</a> - to address the following questions:<br>\nAs a vendor, can I get away with creating a CSV-formatted database dump to satisfy the Data Portability Right ?<br>\nAs a healthcare provider, can one avoid ever being subject to a patient exercising their Data Portability right?</p>",
        "id": 153895630,
        "sender_full_name": "René Spronk",
        "timestamp": 1498724663
    },
    {
        "content": "<p>They are still DocumentReference + Binary plus you can be fairly certain the project staff advocating CSV won't be supported by the engineering staff who are quite likely (90%) to say yes to JSON(/XML), RESTful and OAuth.</p>",
        "id": 153895632,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1498725447
    },
    {
        "content": "<p>Note that a CSV file can be published as a Binary with a DocumentReference (metadata)...  :-)    I don't think this is the right thing to do, but it is possible. </p>",
        "id": 153895650,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498740907
    },
    {
        "content": "<p>The usual measurement is level of effort. If one is communicating CDA documents with others, then it will be expected that one communicates CDA with the patient. Right? If all your EHR can communicate is CVS, then wouldn't that be considered in GDPR as the best you can do? What level of effort is expected of organizations to 'modernize'? I presume there is an expectation that one keeps up with their peers, so the market analysis showing that most peers are using CDA and XDS, would be hard evidence. right?</p>",
        "id": 153895651,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498741127
    },
    {
        "content": "<p>Wouldn't CSV start failing on Integrity and so fail existing legislation?</p>",
        "id": 153895658,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1498744137
    },
    {
        "content": "<p>transport tends to add integrity, confidentiality, and authenticity (aka TLS)</p>",
        "id": 153895659,
        "sender_full_name": "John Moehrke",
        "timestamp": 1498744727
    },
    {
        "content": "<p>Interesting discussion. I wonder if you could take the position that for most patients, a PDF is far more usable than a dump of FHIR resources.</p>",
        "id": 153895764,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1498777342
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> The whole point is \"portability\", not \"access\". I should be able to download my data from provider #1 and upload them to provider #2, regardless of whether we're talking about my social-media-posts,  my audio-playlist, or my healthcare-data. GDPR applies to all those use cases in the same fashion. <br>\nGDPR isn't healthcare specific, its scope is all encompassing. It does contain a few healthcare specific requirements, but other than that one of the difficulties is interpreting a piece of general legislation and how that would impact healthcare IT.<br>\nFor simple \"access\" PDF would probably be more useful, and the GDPR does allow it.</p>",
        "id": 153895803,
        "sender_full_name": "René Spronk",
        "timestamp": 1498806259
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> I agree that given the way it's specified in the GDPR it would be rather difficult to defend ones decision to provide a CSV to the patient if at the same tome one already supports one or more common interoperability standard (e.g. CDA, FHIR, v2, DICOM) for other purposes. <br>\nFines for non-compliance with the GDPR range up to 4% of the organisational revenue, also for healthcare provider organisations. However, quite a few contracts between healthcare providers and software development companies state that the software development company should add support for newly legislated requirements at no or low cost -  if they don't, they may end up paying the fine. I'd say there's plenty of motivation for software development companies to get cracking on this thing.</p>",
        "id": 153895804,
        "sender_full_name": "René Spronk",
        "timestamp": 1498806718
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> I think whatever is done, what the patient wants to do with portability should come first. So yes a patient would want a PDF copy, a patient would want to import their health record into their PHR, the Patient would want to export observations from their PHR to the clinicians EPR. A patient (on holiday) would want want the clinician to have enough accurate information to provide care.   </p>",
        "id": 153895807,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1498810651
    },
    {
        "content": "<p>Also patient devices such as heart rate monitors, scales, etc. These already have consent and transportability built in (not CSV or PDF)</p>",
        "id": 153895808,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1498811416
    },
    {
        "content": "<p>Found this article with a more pessimistic (realistic) perspective on GDPR ability to cause person centric data portability.  <a href=\"https://medium.com/mydata/gdpr-data-portability-is-a-false-promise-af460d35a629\" target=\"_blank\" title=\"https://medium.com/mydata/gdpr-data-portability-is-a-false-promise-af460d35a629\">https://medium.com/mydata/gdpr-data-portability-is-a-false-promise-af460d35a629</a></p>",
        "id": 153896429,
        "sender_full_name": "John Moehrke",
        "timestamp": 1499607678
    },
    {
        "content": "<p>It's a good analysis, although its second part (parties will try and hide behind any of the legal reasons for data usage/exchange, to avoid having to deal with consents and the portability right) is hardly a new issue. The authors assume data controllers will be able to get away with this, I'm personally less worried because that would circumvent one of the core aspects of the GDPR. <br>\nThe first part of the article is absed on <a href=\"https://iapp.org/news/a/european-commission-experts-uneasy-over-wp29-data-portability-interpretation/\" target=\"_blank\" title=\"https://iapp.org/news/a/european-commission-experts-uneasy-over-wp29-data-portability-interpretation/\">https://iapp.org/news/a/european-commission-experts-uneasy-over-wp29-data-portability-interpretation/</a> - the interpretation of \"data provided by the patient\". Is that the same as \"data observed on the patient\" or not? If I have an X-Ray taken, will that be considered as \"data knowingly provided by me (as a patient) to a healthcare provider\"? <br>\nIf I listen frequently to a particular piece of music, is that observation by the app (which maintains a list of my favorites) part of the data portability right, or will it just be the play list itself (which was certainly provided by me) ? <br>\nAnyway, good to see that there is discussion around this, and as the article notes we may have to wait until a case is brought in court to get some further guidance as to how it should be interpreted in the healthcare context.</p>",
        "id": 153896462,
        "sender_full_name": "René Spronk",
        "timestamp": 1499669697
    },
    {
        "content": "<p>My opinion is we should start pushing towards this <a href=\"http://wiki.hl7.org/index.php?title=201709_Consumer_Centered_Data_Exchange\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201709_Consumer_Centered_Data_Exchange\">http://wiki.hl7.org/index.php?title=201709_Consumer_Centered_Data_Exchange</a> Simple use of FHIR plus Patient consent.</p>",
        "id": 153896472,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1499677378
    },
    {
        "content": "<p>Nice that this is being discussed. Note that \"Lawfulness of processing\" != \"consent\"</p>",
        "id": 153897988,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1500932143
    },
    {
        "content": "<p>Consent is one thing that may allow processing but there are others</p>",
        "id": 153897989,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1500932184
    },
    {
        "content": "<p>(i understand from the discussion that we were taking Consent as the equivalent to \"justification for a lawful processing\", which i don't relate to)</p>",
        "id": 153897990,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1500932255
    },
    {
        "content": "<p>Jose, yes there are other ways to have the authority to collect, process, or disclose... However what I am interested in is improving the FHIR Consent resource to support those cases where a Consent is needed or useful. Sometimes a consent is gathered because it is the right-thing-to-do; and not just because it is compelled by law/regulation.</p>",
        "id": 153898081,
        "sender_full_name": "John Moehrke",
        "timestamp": 1500992357
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> From a FHIr perspective we'll need to capture two things: if the lawful ground for processing/exchange (under the GDPR) is Consent, then we'll need to capture that consent and associate it with the appropriate resources; if the processing/exchange is being done on another lawful ground then we'll need to identify which specific legal ground (<a href=\"https://www.privacy-regulation.eu/en/6.htm\" target=\"_blank\" title=\"https://www.privacy-regulation.eu/en/6.htm\">https://www.privacy-regulation.eu/en/6.htm</a> see 6.1) we have for using the data, and associate that with the FHIR resources in question.<br>\nThe first part clearly maps to the FHIR Consent resource. <br>\nThe second part (capturing the legal ground) is a bit more tricky, it has more aspects related to auditing than it has to provenance. Security tagging probably doesn't play a large role in this, given that a FHIR resource could be used by different parties who all have their own/different lawful reason for the processing. <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  ?</p>",
        "id": 153898263,
        "sender_full_name": "René Spronk",
        "timestamp": 1501051694
    },
    {
        "content": "<p>Glad to see the difference between consent and other possible justifications for lawful ground for processing.</p>",
        "id": 153898276,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1501053676
    },
    {
        "content": "<p>I don't know our full picture, so i am picking on a few things that draw my attention, possibly echoing recent discussions on the subject. For example, the association between consent(/others) and the FHIR resources. I believe that is an indirect relation:<br>\nThe Consent (or others) is not associated with the resources, but with the processing of the resources. The resources usually represent the data, not the processing of the data.</p>",
        "id": 153898278,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1501053852
    },
    {
        "content": "<p>in other words, GDPR does not care if for you need consent for a surgery. GDPR cares that if during that surgery you need to check the patient's name or age, then you have registered somewhere in a registry something like \"when our patients undergo surgery, we need to take their name and age, and they explicitly give us consent to use their name and age. the evidence of such permission is in the consent document/resource\".</p>",
        "id": 153898280,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1501054011
    },
    {
        "content": "<p>so the chain IMO is not Consent - Data, but Consent -- Processing - Data</p>",
        "id": 153898281,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1501054052
    },
    {
        "content": "<p>and i believe that our FHIR resources represent Data in the chain above, not the processing</p>",
        "id": 153898284,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1501054124
    },
    {
        "content": "<p>The FHIR Consent has many abilities to identify the 'set' of data that the consent is about. If one only identifies the Patient, with no other constraints on the 'set' then it means all current and future data associated with this Patient. However i can also list Resource by Resource; or it can give a timeframe; or it can give a tag; or by an episode ...... Thus it can identify the set of data in many ways. Mostly ways that have already been found to be useful.</p>",
        "id": 153898313,
        "sender_full_name": "John Moehrke",
        "timestamp": 1501071609
    },
    {
        "content": "<p>The AuditEvent is more inclusive of being able to record 'use' and 'disclosure' events; where Provenance is more concerned about Create and Update (aka 'collection'). AuditEvent is also able to cover attempts of access that were blocked from happening. So, yes AuditEvent is more intended to support an Access Log, Accounting of Disclosures, or simply evidence that the policies given have been followed.</p>",
        "id": 153898316,
        "sender_full_name": "John Moehrke",
        "timestamp": 1501071737
    },
    {
        "content": "<p>To your last point about Consent -- Processing -- Data... I think I agree and understand, but I am not 100% clear...    We do have a few elements in Consent intended to make it clear what activities and/or purposeOfUse are authorized (denied).  But these are processing of data, not activities as in a 'consent to treat'. Consent to treat is a work item the committee is now looking at understanding.</p>",
        "id": 153898317,
        "sender_full_name": "John Moehrke",
        "timestamp": 1501071903
    },
    {
        "content": "<p>We are going to try to model this at the September connectathon. Not specifically GDPR, but close -- <a href=\"http://wiki.hl7.org/index.php?title=201709_Consumer_Centered_Data_Exchange\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201709_Consumer_Centered_Data_Exchange\">http://wiki.hl7.org/index.php?title=201709_Consumer_Centered_Data_Exchange</a></p>",
        "id": 153898335,
        "sender_full_name": "John Moehrke",
        "timestamp": 1501072982
    },
    {
        "content": "<p>On the consent - processing - data:<br>\nGDPR says: If you are going to be using anyone's data, you must have a documented data processing.</p>",
        "id": 153898389,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1501083563
    },
    {
        "content": "<p>for example: to use my clinical history, the hospital shall have a documented <em>processing</em> called \"gather clinically relevant information\", and link that processing to a justification, or a lawfulness of processing, which can be \"consent\" or other - to ensure the vital interest of the patient, or to ensure the business of the hospital...</p>",
        "id": 153898391,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1501083852
    },
    {
        "content": "<p>I think the AuditEvent is at a different level - in healthcare we are usually interested in capturing every instance of the processing (e.g. if someone gets my history yesterday and today, that is 2 events).<br>\nFor GDPR it seems the predominant understanding is that the processing is not captured as an event, but as a type.</p>",
        "id": 153898392,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1501084001
    },
    {
        "content": "<p>The hospital has to describe their processes and where their processes dictate they use the data: \"in my hospital, we use this kind of data at admission and in consultations\". <br>\nGDPR does not impose to capture each instance of the data processing. And I think that AuditEvent is for this latter challenge.</p>",
        "id": 153898393,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1501084209
    },
    {
        "content": "<p>With that in mind, i would not want to invent a FHIR solution for GDPR. Only for the parts that matter: consent, as you are doing.</p>",
        "id": 153898394,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1501084254
    },
    {
        "content": "<p>Not inventing a new process just for GDPR... but rather mock it up to assure that GDPR 'can' be satisfied in reasonable way using FHIR consent.</p>",
        "id": 153898446,
        "sender_full_name": "John Moehrke",
        "timestamp": 1501096138
    },
    {
        "content": "<p>As to the 'documented data processing'. Agree that this documentation should exist before a consent is captured, else that consent is not valid, as it is not informed. The documented data processing 'document' would be published as their processing document. This document would have a unique identifier. That unique identifier would be referenced in each consent gathered, as the Consent.policy.uri.</p>",
        "id": 153898449,
        "sender_full_name": "John Moehrke",
        "timestamp": 1501096311
    },
    {
        "content": "<p>To be sure: when I say Documented data processing, it is kind of in the realm of Enterprise Architecture. <br>\nI think I understand and agree with your statement - basically when you get a consent, you point to one of those pre-documented uses of the data, so that patient knows what they are consenting to, in terms of data.</p>",
        "id": 153899275,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1501258806
    },
    {
        "content": "<blockquote>\n<p>perhaps we could work towards a connectathon about this at DevDays?</p>\n</blockquote>\n<p>Maybe that's still a good idea worth persuing!</p>",
        "id": 153937816,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1518709312
    },
    {
        "content": "<p>need a very tight story board that everyone agrees to...</p>",
        "id": 153937911,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518726500
    },
    {
        "content": "<p>I believe the work accomplished at the CCDE track in the last 2 connectathons has relevance to GDPR (at least that is what I have been told). I am happy to discus this with anyone with interest.</p>",
        "id": 153937914,
        "sender_full_name": "Bo Dagnall",
        "timestamp": 1518726578
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span> ?</p>",
        "id": 153938208,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1518787758
    },
    {
        "content": "<p>To me it seems a bit early to have a testing event - I don't know anything about CCDE, but IMHO there'd need to be at least some GDPR+FHIR analysis/whitepaper to have as a starting point.</p>",
        "id": 153938410,
        "sender_full_name": "René Spronk",
        "timestamp": 1518970307
    },
    {
        "content": "<p>Agree some analysis is needed. And some work in this matter is a good idea. I am looking at gdpr requirements and would like to contribute to the discussion.</p>",
        "id": 153938413,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1518983930
    },
    {
        "content": "<p>fundamentally, GPDR says that you must keep consent records from patients to approve sharing their data, ye?</p>",
        "id": 153938421,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518992356
    },
    {
        "content": "<p>Note that GDPR has been in the analysis for the Consent resource and the various security contributions (Provenance, AuditEvent, tags, etc).</p>",
        "id": 153938562,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519049147
    },
    {
        "content": "<p>GDPR says a few things besides that: <br>\nif you use (even if not sharing) data, there must be a valid reason</p>",
        "id": 153938563,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519049199
    },
    {
        "content": "<p>the existing CCDE track, as Bo points out, is applicable to GDPR use as well.</p>",
        "id": 153938564,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519049215
    },
    {
        "content": "<p>one of those reasons may be \"we got consent\", if consent is in the right conditions (...)</p>",
        "id": 153938565,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519049242
    },
    {
        "content": "<p>Yes, PurposeOfUse is more critical in GDPR.  Which is included in Consent</p>",
        "id": 153938566,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519049254
    },
    {
        "content": "<p>GDPR also says that you may not need consent if there is another valid reason (among those listed)</p>",
        "id": 153938567,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519049286
    },
    {
        "content": "<p>Yes, we have workflows where the access is under a more specific project under a broader PurposeOfUse like Treatment.</p>",
        "id": 153938568,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519049290
    },
    {
        "content": "<p>and GDPR says that any use of data (incl transfers) must be declared</p>",
        "id": 153938569,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519049323
    },
    {
        "content": "<p>so, consent and authentication are some transactional components of GDPR compliance.<br>\nBut GDPR compliance will also require a hospital / lab  system to explain why they have this or that interface, independently of transactional aspects.</p>",
        "id": 153938570,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519049483
    },
    {
        "content": "<p>Jose, as I indicated GDPR has been in the analysis of Consent and the security resources since it was just a proposal. We have global participation in these workgroups.  --- However if you have a specific point of improvement,  please submit a CR with details of the problem and your proposed solution if you have one.</p>",
        "id": 153938571,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519049710
    },
    {
        "content": "<p>I am just replying to <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> 's question </p>\n<blockquote>\n<p>fundamentally, GPDR says that you must keep consent records from patients to approve sharing their data, ye?</p>\n</blockquote>\n<p>and provide info that GDPR is a bit more than consent.</p>",
        "id": 153938572,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519049932
    },
    {
        "content": "<p>i trust consent is GDPR-compatible (haven't done that analysis) but just state that GDPR includes requirements that are not covered in FHIR yet imo.</p>",
        "id": 153938573,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519050017
    },
    {
        "content": "<p>Please be specific about what is not covered in FHIR yet... The privacy and security teams would be happy to help get that covered.</p>",
        "id": 153938575,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519050142
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , i said</p>\n<blockquote>\n<p>Agree some analysis is needed. And some work in this matter is a good idea. I am looking at gdpr requirements and would like to contribute to the discussion.</p>\n</blockquote>\n<p>During that analysis we may see whether there are gaps. Not sure if there are gaps in the standard, or in guidance...</p>",
        "id": 153938580,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519050552
    },
    {
        "content": "<p>I suspect what Jose is getting at is  that a consent artifact alone is not sufficient to be able to adequately satisfy the requirements of GDRP.  You know how there are people that declare their offering is HIPAA compliant and that doesn't make any sense (since it requires organizational conformance  to policy and involves Humans at the customer site doing what they need to do) and I sense that is what he is alluding to maybe?</p>",
        "id": 153939056,
        "sender_full_name": "Aaron Seib",
        "timestamp": 1519155969
    },
    {
        "content": "<p>In any case - I am in agreement with Bo that there is some aspects of what we've done that overlap with  what is required to support GDRP requirements...</p>",
        "id": 153939058,
        "sender_full_name": "Aaron Seib",
        "timestamp": 1519156026
    },
    {
        "content": "<p>Yes, <span class=\"user-mention\" data-user-id=\"194138\">@Aaron Seib</span> that is what I mean: consent is just a part of GDPR compliance. Other things are included in GDPR - list of interfaces, list of data that is used, retention.... <br>\nI will gladly join an effort to do that analysis (which i think we need, as <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> suggests ).</p>",
        "id": 153939077,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519156999
    },
    {
        "content": "<p>On this site we've discussed a lot about the 'problem space', but not a lot about the 'solution space'. My analysis last year (but I'm not a security pundit - <a href=\"http://www.ringholm.com/column/GDPR_impact_on%20healthcare_data_interoperability.htm\" target=\"_blank\" title=\"http://www.ringholm.com/column/GDPR_impact_on%20healthcare_data_interoperability.htm\">http://www.ringholm.com/column/GDPR_impact_on%20healthcare_data_interoperability.htm</a>) was to use at least a combination of consent, provenance, and security labels. </p>\n<p>There has been discussion (without a real outcome) on this and other GDPR threads as to how to model 'legal ground for processing' (of which consent is just 1, we need to capture the other 5 as well).  It's simple if a database contains data all having the same legal ground for processing, because one would document that legal ground on paper. But if one collects data of different kinds from all sorts of sources, one needs to know what the 'legal ground' was for capturing the data, for that means one is not allowed to use the data for purposes that are a different 'legal ground'. If one transmits data, it should be accompanied by the original 'legal ground'.</p>\n<p>We need to capture retention policies and have the ability to send those along with the data (if resource X has a retention policy for 4 years, and I sent it to another database after 3 years, it will still have '1 year to go' in the other database). Patients have the right to ask for the deletion of their data, and all copies thereof that may exist because data has been sent elsewhere - how would we facilitate that, or would this be solely based on audit logs?</p>\n<p>That's just me sketching the likely impact of GDPR on FHIR, someone more in the know about security and similar legislation elsewhere (US?) may have to tackle a more detailed whitepaper as to how we should solve this. Part of the puzzle is the fact that there may be things currently not covered by the FHIR standard, so this may involve the definition of new resources as well.</p>",
        "id": 153939318,
        "sender_full_name": "René Spronk",
        "timestamp": 1519193009
    },
    {
        "content": "<p>Also use of AuditEvent to track actual use and support apps that would provide the consumer with an account of use/disclosure as appropriate.</p>",
        "id": 153939345,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519222765
    },
    {
        "content": "<p>Yes, I am very interested in providing this kind of guidance.</p>",
        "id": 153939346,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519222798
    },
    {
        "content": "<p>A good way to indicate policy with data is through Provenance.policy. Where the Provenance.recorded date can be used for the starting time.</p>",
        "id": 153939347,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519223016
    },
    {
        "content": "<p>lighter weight is to use a security-tag in the resources meta element. Where the tag value is likely regional to indicate the specific policy (local vocabulary management). The advantage of this is that it is more likely to be carried in all uses of the Resource, so less likely to get disassociated (without specific intent to remove the tag).</p>",
        "id": 153939349,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519223604
    },
    {
        "content": "<p>hence... why it is important for us to create some document that cross-references a set of principles that fall out of GDPR with mechanisms in FHIR. This would not be a mandate to use that mechanism, but rather informative to those looking for solutions.  Is there a generally accepted 'good' set of principles that fall from GDPR? We should not invent this. It surely is already available somewhere...</p>",
        "id": 153939350,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519223873
    },
    {
        "content": "<p>For me, the core of GDPR is Art 30.<br>\nAnd Art. 30 is not transactional data, it is design aspects.</p>",
        "id": 153939359,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519227845
    },
    {
        "content": "<p>In other words, Art. 30 requires that a company has a list of all their processing activities (etc etc)</p>",
        "id": 153939362,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519227953
    },
    {
        "content": "<p>and that is not transactional, so it is not covered by the current mechanisms.</p>",
        "id": 153939363,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519227962
    },
    {
        "content": "<p>A white paper would be a good starting point. We can bring some GDPR requirements.</p>",
        "id": 153939368,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519228055
    },
    {
        "content": "<p>so it seems to me that we should have a GPDR track at the connectathon, and clearly marked as a conceptual track, where thought experiments will be used to see what a conformant system would have as an API</p>",
        "id": 153939597,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519280060
    },
    {
        "content": "<p>I have proposed this on the connectathon stream, and would be happy to help coordinate it. I need EU experts involved. Alex Mense (Security co-chair) will likely be one of those experts.</p>",
        "id": 153939681,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519308585
    },
    {
        "content": "<p>Will this be trying to address problems of consent, security, or addressing the GDPR in its scope? I am working in Data Governance for GDPR, handling reference data, design and transactional issues, and I would love to see some proper interoperability mechanisms there, but it seems that these discussions are mostly only around security and consent.</p>",
        "id": 153940114,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519400549
    },
    {
        "content": "<p>Given the background of the FHIR community it would be about the question: how does one, minimalistically if possible, satisfy the requirements of the GDPR when using FHIR and its associated (commonly used) security stack ?  But perhaps others see a wider scope than that.</p>",
        "id": 153940312,
        "sender_full_name": "René Spronk",
        "timestamp": 1519461571
    },
    {
        "content": "<p>The answer is more simple... it will address whatever those involved in the activity choose to address... So, if it consists of just Privacy and Security people, then that will be the focus.  I am interested though in what other aspects people see within GDPR? <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> can you explain?</p>",
        "id": 153940405,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519579000
    },
    {
        "content": "<p>I am good if the focus is security and privacy. So, <br>\n<strong>How do we handle Security in FHIR transactions in a GDPR-Compliant way</strong> seems a great topic.<br>\nThere are other parts of GDPR which may be out of scope - my quest is only that we should not try to think \"we're GDPR ready because we have security and access control...\"</p>",
        "id": 153940406,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519580256
    },
    {
        "content": "<p>some other aspects of GDPR:<br>\n<strong>How can a patient say \"please forget me\"?</strong> and How that gets propagated?<br>\n<strong>How can an institution say \"Here is the list of my interfaces, and the data we expose / require in each of them, and with whom\"?</strong></p>",
        "id": 153940407,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519580411
    },
    {
        "content": "<p>I don't say these are needed in this effort, just that GDPR is more than our transactional stuff - consent, access control etc.</p>",
        "id": 153940408,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519580562
    },
    {
        "content": "<p>To be clear, we can't claim GDPR at all... all we will be able to say is that we divine that GDPR seems to be asking for X, and the Y functionality in FHIR is a good way to achieve X.  This is all that standards can say. We can't make legal advice. We can't declare that someone has implemented it properly.</p>",
        "id": 153940409,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519582825
    },
    {
        "content": "<p>BTW: There are aspects of \"Please forget me\" that can be addressed by mechanisms in FHIR. Including use of Consent, Security-tags, Provenance, and version specific access controls. That statement alone is not helpful, so we need to get more specific about how one could use these mechanisms in at-least one reasonable way...</p>",
        "id": 153940410,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519582939
    },
    {
        "content": "<p>\"Please forget [this specific data]\" probably requires an operation. If A sends stuff to B, one can request A to delete some data, but if that data was sent to B, then A (based on its Audit Logs) is aware that it has sent data to B, and should send a request to B to delete. Either one states this is not an automated process, or if it is, it probably calls for an operation because this won't be a client orchestrated activity; the server will have to determine how/what to purge from its records.</p>",
        "id": 153940561,
        "sender_full_name": "René Spronk",
        "timestamp": 1519634169
    },
    {
        "content": "<p>To me this needs to be in scope for the discussion.</p>",
        "id": 153940562,
        "sender_full_name": "René Spronk",
        "timestamp": 1519634190
    },
    {
        "content": "<p>I like the idea of an operation that propagates to impacted parties</p>",
        "id": 153940563,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519634290
    },
    {
        "content": "<p>I can't get my head around the idea that you instruct information systems to forget about data. Sounds like pretending you can rewrite history</p>",
        "id": 153940564,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519634398
    },
    {
        "content": "<p>It's the same as Google's right to be forgotten.</p>",
        "id": 153940573,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519647681
    },
    {
        "content": "<p>Right to be Forgotten allows people to say<br>\n\"I no longer allow you to store or use any of my data (if it is identifiable) for any purpose\".</p>",
        "id": 153940574,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519647883
    },
    {
        "content": "<p>of course, this right is not absolute - it cannot be used to go to the tax authorities and say \"please forget all my data\" :)</p>",
        "id": 153940575,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519647932
    },
    {
        "content": "<p>I can get my head around 'no longer use' but you can't magically erase the past. That's like the patient advocates who demanded that we be able to <br>\n(a) suppress their clinical records<br>\n(b) suppress the fact that they've suppressed their clinical records</p>",
        "id": 153940576,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519647954
    },
    {
        "content": "<p>forgotten may mean removal but may also mean anonymization (or pseudonymization, but the EU authorities don't seem to agree on the validity of pseudonymization).</p>",
        "id": 153940577,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519648088
    },
    {
        "content": "<p>I had the question \"If a customer identifies himself and requests to remove data, isn't that  request also PI?\" and the answer was Yes., <br>\nSo theoretically the authorities are expecting it to be deleted/anonymized as well, if the information is no longer needed for any purpose.</p>",
        "id": 153940578,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519648289
    },
    {
        "content": "<p>I can't believe that they require you to redact your audit trail... it should be signed...</p>",
        "id": 153940579,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519648341
    },
    {
        "content": "<p>so, if I call my hospital and ask them to forget my data, they may simply anonymize my records, and they may be required by law/public interest to keep track that I deleted it.</p>",
        "id": 153940580,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519648397
    },
    {
        "content": "<p>you mean whether this would require deleting Patient X from the audit trail?</p>",
        "id": 153940581,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519648453
    },
    {
        "content": "<p>IMO audit trails are not in control of the patient, and are needed for other purposes, so the patient cannot ask those to be deleted.</p>",
        "id": 153940582,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519648521
    },
    {
        "content": "<p>oh. well, that was my point. so what can they ask for then?</p>",
        "id": 153940583,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519648561
    },
    {
        "content": "<p>in my view, if a patient Jack Bauer wants to be deleted, their personal identifiable data can no longer be used for any purposes except those required by law. So, in the reports, mailings, letters, etc. there is no longer a Mr. J Bauer, but a Mr X. And Mr. X still counts for statistics.</p>",
        "id": 153940584,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519648760
    },
    {
        "content": "<p>The other big worry with this chain is: It might be reasonable for me to forget, but to then expect me to tell all those that I have communicated the data to and get confirmation that they too forgot.. this is NOT what google is expected to do, in fact it is explicitly not in their scope.  To forget locally is either a normal Delete operation, or a tagging of data such that it will not be returned. These are 'reasonable' solutions that FHIR has mechanisms for. As I stated before, we can't claim GDPR compliance. We can only look at the needs that are accepted as falling from GDPR, and map them to reasonable mechanisms that the FHIR standard includes. Going beyond the standard will be the creativity of products/services...</p>",
        "id": 153940586,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519649754
    },
    {
        "content": "<p>And in medicine we must also protect the patient safety... so there must be recognition that rejecting a 'forget' action is in the best interests of the patient. I thought I understood GDPR did include healthcare exceptions for safety... (but I am not a lawyer, nor a GDPR expert)</p>",
        "id": 153940588,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519649856
    },
    {
        "content": "<p>if you have communicated the data, it was with an identified party, and for a documented reason, so you can actually follow the data. I don't think we need to get confirmation that they too forgot. <br>\nAnd theoretically, the customer is entitled / required to know that you have communicated the data.</p>",
        "id": 153940589,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519650557
    },
    {
        "content": "<p><a href=\"#narrow/stream/social/subject/Apple.20Health.20Authentication.20Flow\" title=\"#narrow/stream/social/subject/Apple.20Health.20Authentication.20Flow\">https://chat.fhir.org/#narrow/stream/social/subject/Apple.20Health.20Authentication.20Flow</a></p>\n<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> Most EU countries have a layer of additional legislation 'on top of' the GDPR, or acts that modify the GDPR (where such modifications are allowed, article 9.2(h) being an example). Actually those acts are related to the prior EU privacy directive, but those will work as well in the context of the GDPR, for the most part it doen't differ that much from the earlier directive.</p>",
        "id": 153948675,
        "sender_full_name": "René Spronk",
        "timestamp": 1522231101
    }
]