[
    {
        "content": "<p>I have been looking at the European Health Record exchange format and trying to understand how it overlaps (or not) with FHIR. Specifically, I was looking at the Annex to the Recommendation available <a href=\"https://ec.europa.eu/digital-single-market/en/news/recommendation-european-electronic-health-record-exchange-format\" target=\"_blank\" title=\"https://ec.europa.eu/digital-single-market/en/news/recommendation-european-electronic-health-record-exchange-format\">on this page</a>. In this Annex, CDA is listed as the main exchange format for most data types; with regard to FHIR, one only finds the following vague formulation:</p>\n<blockquote>\n<p>The refinement of the exchange format should consider the possibility offered by resource driven information models (such as Health Level Seven Fast Healthcare Interoperability Resources (HL7 FHIR©)).</p>\n</blockquote>\n<p>Is anyone aware of any concrete work in this direction, specifically of work to set up corresponding FHIR IGs for all or parts of this?</p>",
        "id": 177516865,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1570453594
    },
    {
        "content": "<p>Have you looked at IPS?</p>",
        "id": 177517505,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570454124
    },
    {
        "content": "<p>The EC recommendation dates back to 2017 and is mainly based on prior epSOS/eHSDI work, which focuses on IHE XDS based CDA/DICOM exchanges. Hence the recommendation on a combination of CDA, DICOM and IHE. FHIR is seen as a future/up and coming format which should be considered. With the IPS (international patient summary) guide we have a solid 'replacement' for the CDA based european patient summary. As such the IPS IG is indeed your best starting point.</p>",
        "id": 177518744,
        "sender_full_name": "René Spronk",
        "timestamp": 1570454953
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  Thanks for the crisp overview! - I looked at IPS but was unsure about the relation between that and the European standard. Do you happen to know if  there is some sort of formal agreement that  the FHIRized form of the European standard will be IPS (or at least based on it), or is it just the most likely scenario? It would absolutely make sense, but I'm just trying to understand whether the European format might give rise to a  separate FHIR IG that is not compatible with IPS.</p>",
        "id": 177521201,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1570456510
    },
    {
        "content": "<p>You may also wish to ask the IPS stream on this chat forum. <br>\nAFAIK the european format served as one of the inputs into the creation of the IPS. Those involved in the creation of the CDA european summary were also involved in the creation of the IPS. As such it seems unlikely to me there'd ever be a FHIIR version of the current european summary. But others more involved in the IPS process than I may wish to comment..</p>",
        "id": 177521595,
        "sender_full_name": "René Spronk",
        "timestamp": 1570456771
    },
    {
        "content": "<p>And as always: EC recommendations can only be about cross-border scenarios, not about scenarios within members states. As such their list of standards is heavily influenced by their focused on the cross-border use case (which, for most EU members states, is not terribly interesting at all). The list or recommended standards therefor may not be applicable within a country, region, of healthcare provider.</p>",
        "id": 177521890,
        "sender_full_name": "René Spronk",
        "timestamp": 1570456933
    },
    {
        "content": "<p>Thanks again! - I will take it the IPS Stream.</p>",
        "id": 177524604,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1570458734
    },
    {
        "content": "<p>Follow-up discussion and posts: <a href=\"#narrow/stream/207835-IPS/topic/IPS.20and.20the.20European.20Health.20Record\" title=\"#narrow/stream/207835-IPS/topic/IPS.20and.20the.20European.20Health.20Record\">https://chat.fhir.org/#narrow/stream/207835-IPS/topic/IPS.20and.20the.20European.20Health.20Record</a></p>",
        "id": 177557565,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1570480286
    }
]