[
    {
        "content": "<p>just curious if there has been much work on laying out event patterns and the internal updates they trigger?</p>",
        "id": 153828119,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463475594
    },
    {
        "content": "<p>sort of thing I'm thinking is \"referral request\" leads to both and \"episode of care\" and an \"appointment\"</p>",
        "id": 153828120,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463475632
    },
    {
        "content": "<p>having the appointment creates an encounter, with observations, and clinical impression, and care plan</p>",
        "id": 153828121,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463475688
    },
    {
        "content": "<p>a bit more interestingly \"discharge from care\" closes off the already created episode</p>",
        "id": 153828122,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463475727
    },
    {
        "content": "<p>i'm sure this has been thought about very much ... i just haven't stumbled upon a synopsis (yet)</p>",
        "id": 153828123,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463475761
    },
    {
        "content": "<p>I guess much of this is implied and i see examples of the expected exchanges scattered around</p>",
        "id": 153828124,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463478116
    },
    {
        "content": "<p>we typically do not specify things like this; these internal business rules might be done in implementation guides</p>",
        "id": 153828126,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463479164
    },
    {
        "content": "<p>cool - I'm coming into all this from a standing start - just trying to get my head wrapped around 100+ entities</p>",
        "id": 153828127,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463479562
    },
    {
        "content": "<p>everything is much more coherent than last time I looked (which was almost 20 years ago!)</p>",
        "id": 153828128,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463479623
    },
    {
        "content": "<p>(ontology was my thing back before I wondered off to \"get a real job\")</p>",
        "id": 153828129,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1463479673
    },
    {
        "content": "<p>Isn't the Task resource motiviated, at least in part, to solve this problem? It's only half a solution, because the focus with Task is on the state transitions of the Task itself. An IG would be useful if it describes the state transitions of a particular resource - like EoC, Appointment, etc.  - within a given workflow.</p>",
        "id": 153828158,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1463498882
    },
    {
        "content": "<p>yes, task is the instantiation of a point of control in a workflow. it's not the orchestration itself though</p>",
        "id": 153828203,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463514013
    }
]