[
    {
        "content": "<p>For an IG we are building we are planning to use to use the event-reasonReference extension to point from an observation to a related disease (i.e. from a tumor observation to the cancer diagnosis). I saw there was some discussion about this in several gForge threads but I was curious if there was a final decision about the proper way to capture this reference?<br>\nAlso, I will have to restrict the reference to a specific profile of  Condition, I was wondering if there was a way to do this with the current extension or whether it would make sense to make my own extension to do the same thing?</p>",
        "id": 153875045,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1488817519
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193151\">@Sadiq Saleh</span> You could reference the existing extension in your profile and inline-constrain it to be limited to a specific type of target resource.  <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> might be able to give more guidance on \"current thinking\" around reasons for observations</p>",
        "id": 153875077,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488828637
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , that is in line with what I thought as well and now I just need to make sure I am doing it correctly using the spreadsheet tooling.<br>\nI will wait to hear back from <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  for more insight</p>",
        "id": 153875079,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1488828777
    },
    {
        "content": "<p>I am just following up on this thread.<br>\n1) Is there any more insight on the use of the event-reasonReference extension?<br>\n2) What is the proper way to inline-constrain an extension in the spreadsheet. Currently I have done the following (diagnosis-bc is a profile on Condition):<br>\n<a href=\"/user_uploads/10155/cvAidZOKAMlLNYHVthsoyPK1/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<p>However the result from the IG tool does not look correct:<br>\n<a href=\"/user_uploads/10155/E6NoCFXBlk96F5u_koTiJS15/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<p>I was wondering what I should be doing differently?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/E6NoCFXBlk96F5u_koTiJS15/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\"><img src=\"/user_uploads/10155/E6NoCFXBlk96F5u_koTiJS15/pasted_image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/10155/cvAidZOKAMlLNYHVthsoyPK1/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\"><img src=\"/user_uploads/10155/cvAidZOKAMlLNYHVthsoyPK1/pasted_image.png\"></a></div>",
        "id": 153875278,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1488917455
    },
    {
        "content": "<p>This core extension was added as a results of alignment with the event patterns.  No implementers had brought up a use case until now.   In all the uses I am aware the reasons lived in the request resource a.k.a Procedurerequest often for billing purposes.  Observations can be linked to the request directly or via diagnosticreport so the information searchable, although not part of the Observation itself.    I don't understand your use case very well but  ClinicalImpression sounds like a better choice t  me than a  swiss army knife approach to Observation.  </p>",
        "id": 153875308,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488920915
    },
    {
        "content": "<p>re \"I was wondering if there was a way to do this with the current extension or whether it would make sense to make my own extension to do the same thing?\"  In FHIR the core extensions are published so implementers don't have to create their own and for greater interoperability, so if it is a choice I would recommend using the core extension.</p>",
        "id": 153875309,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488921050
    },
    {
        "content": "<p>Thanks for the response <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <br>\nWe have spent some time trying to figure out what the best resource to utilize is. We decided to go with Observation rather than ClinicalImpression as the latter seemed to be tied to a specific encounter between the doctor and patient. Rather these seemed to us to be more Observations of the tumor (such as the tumor size). We aimed to use the reasonReference as a way to link this Observation to the parent tumor diagnosis from which it was derived.<br>\nDoes that clarify the use case?<br>\nI am also trying to understand how to constain the profiles that an extension references, from within a profile using the spreadsheet authoring tool.</p>",
        "id": 153875311,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1488921408
    },
    {
        "content": "<p>I need to back up and retract my earlier statement to use the core extension.  You would need to profile the event-reasonReference extension to constrain the type to profile reference.  I don't know if and how to do that using the spreadsheet, but is simpler to create your own extension using the attached as a template. <a href=\"/user_uploads/10155/Pr_w5QK5IrtZVDDXrpIUNK_K/event-extensions-spreadsheet.xml\" target=\"_blank\" title=\"event-extensions-spreadsheet.xml\">event-extensions-spreadsheet.xml</a> </p>",
        "id": 153875314,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488921898
    },
    {
        "content": "<p>Also I would consider using the partOf extension intstead since you make it sound like a parent child like relationship.</p>",
        "id": 153875315,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488922106
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <br>\nThat is a good point w.r.t using the partOf extension. I will try to figure out if we can do the inline thing that Lloyd mentioned using the spreadsheets, else I will just copy the extension as you defined them.</p>",
        "id": 153875317,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1488922400
    },
    {
        "content": "<p>The IGTool generated content does look mostly correct - valueReference is reflecting what it should.  The issue is that the publication process isn't looking at your override when it generates the type display for the extension, so that bit is wrong.  You can submit a tooling change request there.</p>",
        "id": 153875321,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488923290
    },
    {
        "content": "<p>Perfect, thanks Lloyd.</p>",
        "id": 153875334,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1488924020
    },
    {
        "content": "<p>OK  thanks Lloyd my  mistake I forgot that the profile can be \"unrolled\" inline.   So the content is rendering correctly except that the type in the extension  is coming through. </p>",
        "id": 153875340,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488924442
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> for the clarification</p>",
        "id": 153875341,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1488924489
    },
    {
        "content": "<p>Tracker submitted: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12981\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12981\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12981</a></p>",
        "id": 153875345,
        "sender_full_name": "Sadiq Saleh",
        "timestamp": 1488924705
    }
]