[
    {
        "content": "<p>How would one indicate which EvidenceVariable is associated with an Observation?</p>",
        "id": 244472455,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1625079775
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192085\">@Brian Alper</span></p>",
        "id": 244511982,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625106495
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> What is your question?</p>",
        "id": 244535910,
        "sender_full_name": "Brian Alper",
        "timestamp": 1625129629
    },
    {
        "content": "<p>I see the question now with a Zulip view showing the chain. For the question \"How would one indicate which EvidenceVariable is associated with an Observation?\" <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> can you please share the context of the association you are trying to indicate?</p>",
        "id": 244536222,
        "sender_full_name": "Brian Alper",
        "timestamp": 1625129801
    },
    {
        "content": "<p>The context is a research database, with various research studies, each of which has a set of variables that are measured about subjects.  The measurements are stored as Observations, and the group implementing the system was advised to use EvidenceVariable to store the information about the variable itself.  (Example:  <a href=\"https://dbgap-api.ncbi.nlm.nih.gov/fhir/x1/EvidenceVariable/phv00396358\">https://dbgap-api.ncbi.nlm.nih.gov/fhir/x1/EvidenceVariable/phv00396358</a>).  For a set of selected Observations, we would like to retrieve the relevant EvidenceVariables the Observations are measuring.  The current thought is to store a reference to the EvidenceVariable in a custom extension on the Observations, but I am thinking there should be some more standard mechanism for representing that connection.</p>",
        "id": 244569203,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1625147561
    },
    {
        "content": "<p>In the example the EvidenceVariable.characteristic.definitionCodeableConcept has a single coding for a single characteristic -- LOINC 882.1<br>\nWhy not just use Observation.code with LOINC 882.1 ?<br>\nIs there other data in the EvidenceVariable instance that you need associated with the Observation instance?</p>",
        "id": 244575739,
        "sender_full_name": "Brian Alper",
        "timestamp": 1625149972
    },
    {
        "content": "<p>Observation.focus has 0..* cardinality and can Reference Any Resource.   An approach without requiring extensions could be to use the focus element to reference the EvidenceVariable Resource when there is a need to identify the focus/context of the observation being modified by/related to the EvidenceVariable definition.</p>",
        "id": 244578979,
        "sender_full_name": "Brian Alper",
        "timestamp": 1625151148
    }
]