[
    {
        "content": "<p>Hi all, we are using observation resource to capture the information of various types of examination. In general examination, there are many subtypes for instance examination of lung,abdomen and many more.  So, shall I create profiles for each and every  subtype or is there any other alternate method to capture?  Thanks in advance</p>",
        "id": 153891758,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1496211448
    },
    {
        "content": "<p>If you want to enforce different rules for each subtype and it's not a simple set of rules that you could do using invariants or something like that on a single profile, then you'd need a profile for each subtype.</p>",
        "id": 153891797,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496242890
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Thank you.  We want to create fhir profile similar to that of the examination archetypes in openEHR.  For example, in the archetype examination of a burn, there are some clusters namely structured body site, examination findings,multimedia representation and examination not done and some groups are included in each cluster. How can I add the clusters and their respective sub groups to a fhir profile?  Is it possible to add extensions for observation.component? Please suggest me. Thank you</p>",
        "id": 153892039,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1496381256
    },
    {
        "content": "<p>Well, your starting point would likely be Observation.  You'd then figure out what structures to use to represent the different pieces (e.g. the BodySite data type, various component or related Observations, etc.  Where you're not sure, certainly raise questions here to get guidance.  It's possible to add extensions to pretty much anything, but I suspect most of what you need done won't involve using extension at all.</p>",
        "id": 153892112,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496415131
    },
    {
        "content": "<p>Okay thank you. My only concern is about adding  clusters to fhir profile. I don't know how to add a group or a cluster of observations to my profile. Could you please help me?</p>",
        "id": 153892629,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1496812625
    },
    {
        "content": "<p>What's your objective in grouping them?  Establishing a panel or something like that?</p>",
        "id": 153892631,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496812669
    },
    {
        "content": "<p>For example, there is a cluster called \"Examination not Done\" which in turn has a boolean item which specifies whether the examination is done or not and reason which is a string type. How can I add such groups and subgroups to my profile?</p>",
        "id": 153892633,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1496813129
    },
    {
        "content": "<p>That one's actually a little tricky.  If you were talking about a surgery or some other intervention, you could use Procedure.notDone and Procedure.notDoneReason.  However, examinations are really Observations.  Observation has dataAbsentReason, but that's not quite the same thing.  <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> - thoughts on how best to handle this?</p>",
        "id": 153892638,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496814696
    },
    {
        "content": "<p>Ok. The cluster named examination not done is there in \"Examination of a burn\" archetype on openEHR and it also has other clusters. </p>",
        "id": 153892640,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1496814985
    },
    {
        "content": "<p>I've seen some examples in our system where a \"Not Done\" manifests as the Observation.valueCodeableConcept.</p>",
        "id": 153892668,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1496845510
    },
    {
        "content": "<p>An observation not done ( e.g.,  I didn't look at the dog's teeth for fear of getting bit) is either:</p>\n<ul>\n<li>a coded value as part of the code-value pair.  ( code = oral exam , value = not performed) </li>\n<li>a dalueAbsentReason ( code = oral exam,  value empty,  DAR = not-performed</li>\n</ul>\n<p>the reason (\" muzzled \") would go in the comment element.</p>",
        "id": 153892671,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496846570
    },
    {
        "content": "<p>How can I create a fhir profile (using the resource observation)equivalent to an examination archetype on openEHR?  Below is the link for openEHR <br>\n<a href=\"http://openehr.org/ckm/\" target=\"_blank\" title=\"http://openehr.org/ckm/\">http://openehr.org/ckm/#</a>. When the cluster option(which is on the left hand side of the screen) is expanded, different types of examination archetypes will be displayed. Please go through anyone of the examination archetypes (for example examination of a burn or examination of lesion) and let me know how to create fhir profiles. Thanks in advance.</p>",
        "id": 153892880,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1496911893
    },
    {
        "content": "<p>You'll have to start by mapping all of the data elements and figuring out where they live in FHIR.  Odds are you may need multiple resources to represent the full examination - and most of those will be Observations.  You may also need to determine what Observation codes (generally from LOINC) you'll need to use to describe the different observations being performed.  Once you've figured out where your data lives, you can use a tool like Forge to create the various resource profiles needed to represent your model.</p>",
        "id": 153892977,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496933422
    },
    {
        "content": "<p>How technically:</p>\n<ul>\n<li>Use <a href=\"https://fhir.furore.com/forge/\" target=\"_blank\" title=\"https://fhir.furore.com/forge/\">Forge</a></li>\n<li>Spreadsheets + Ig builder tool - <a href=\"http://build.fhir.org/ig/Healthedata1/IG-Template/\" target=\"_blank\" title=\"http://build.fhir.org/ig/Healthedata1/IG-Template/\">My IG template</a> is kind of a sampler </li>\n<li>I think ClinFHIR does this too</li>\n<li>I think other tools out there as well</li>\n</ul>\n<p>There are several examples of observations on profiles for example in the <a href=\"http://build.fhir.org/observation-vitalsigns.html\" target=\"_blank\" title=\"http://build.fhir.org/observation-vitalsigns.html\">vitals profiles</a> in the build</p>\n<p>And last but not least read the section on <a href=\"http://build.fhir.org/profiling.html\" target=\"_blank\" title=\"http://build.fhir.org/profiling.html\">Profiling</a> in the Specification.  </p>",
        "id": 153892979,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496933944
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  Thanks for your response. That is fine I can create a profile on forge,but the archetypes have clusters. How can I create a cluster in fhir profile similar to that of openEHR?  </p>",
        "id": 153893063,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1496984651
    },
    {
        "content": "<p>I'm not super-familiar with openEHR, but, from what I understand, you don't use the cluster concept in the same way with FHIR.  For example, if openEHR allows you to use a cluster on a record of a surgery and have the same type of cluster appear on a blood pressure, there's no way you could get a re-usable structure that would appear on both the FHIR Procedure resource and the FHIR Observation resource unless it was an esoteric requirement handled using an extension.  You'll have to map each cluster to each resource you want to use it on.  (<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, please yell if I've misspoken)</p>",
        "id": 153893065,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496985435
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193568\">@Pranitha Sruthi</span> some of the clusters used by the <code>Examination of a burn</code> archetype (<a href=\"http://www.openehr.org/ckm/#showArchetype_1013.1.2111\" target=\"_blank\" title=\"http://www.openehr.org/ckm/#showArchetype_1013.1.2111\">http://www.openehr.org/ckm/#showArchetype_1013.1.2111</a>) are equivalent to FHIR resources, e.g. <code>BodyStructure</code> (<a href=\"http://build.fhir.org/bodystructure.html\" target=\"_blank\" title=\"http://build.fhir.org/bodystructure.html\">http://build.fhir.org/bodystructure.html</a>). Also <code>Multimedia</code> and <code>Media</code>. <code>Examination not done</code> uses a different technique in FHIR, see <code>Observation.dataAbsentReason</code>.</p>",
        "id": 153893066,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1496986224
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span>  but there are no references to media and bodystructure resources in the observation resource structure.</p>",
        "id": 153893068,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1496987365
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193568\">@Pranitha Sruthi</span> , i think, bodystructure is nothing but body site in Observation resource.</p>\n<p>about media in the Observation resource they given like this</p>\n<p>The Media resource captures a specific type of observation whose value is audio, video or image data. This resource is the preferred representation of such forms of information as it exposes the metadata relevant for interpreting the information. However, in some implementations, media information may appear in Observation susing the valueAttachment element and systems should be aware of this possibility.</p>",
        "id": 153893069,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1496987611
    },
    {
        "content": "<p>.</p>",
        "id": 153893070,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1496987723
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span>  can I attach a media element in observation.valueAttachment?</p>",
        "id": 153893071,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1496987748
    },
    {
        "content": "<p>There's an <a href=\"http://hl7.org/fhir/extension-body-site-instance.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-body-site-instance.html\">extension</a> that allows you to point an Observation to a BodySite.  An Attachment could refer to a Media instance</p>",
        "id": 153893073,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496989959
    },
    {
        "content": "<p>FYI, the relationship between Observation and Media is a current topic of discussion in the O&amp;O workgroup.</p>",
        "id": 153893138,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1497029364
    },
    {
        "content": "<p>Looking at the Burn example items I am not able to casually map between openEHRCluster &lt;==&gt; FHIR Resource.  I don't know what 'Examination Findings' are  Looks like a Clinical Impression to me.  ( Although as Elliot mentioned we are looking at Media's use cases, right now can use either Media or Obsevation +valueAttachment - so pick your poison based on the details you want to represent )   </p>",
        "id": 153893175,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497058111
    },
    {
        "content": "<p>PS not familiar with openEHR so not familiar with the term \"cluster\" outside of a vineyard.</p>",
        "id": 153893176,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497058179
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  Ok thank you</p>",
        "id": 153893224,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1497245931
    },
    {
        "content": "<p>Hi all, how can I create a profile for the examination of different organ systems which in turn have many findings? For example, the examination of eyes have findings namely pupil, cornea, conjunctiva etc which in turn have 'normal except', 'no acute finding', 'constricted' etc. Thank you</p>",
        "id": 153913594,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1507806240
    },
    {
        "content": "<p>Sounds like Observation.code to say what you were looking at + Observation.value to say what you found.  You have the option of breaking the body part out to Observation.bodySite.</p>",
        "id": 153913600,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507809369
    },
    {
        "content": "<p>In the above mentioned example, the Observation.code would be examination of eyes and Observation.value will contain the findings. Is that correct?</p>",
        "id": 153913602,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1507809579
    },
    {
        "content": "<p>Also, how can I create an examination profile which includes all the organ systems (constitutional, head and face, eyes, respiratory effort,abdomen,chest/axilla,skin,musculo-skeletal etc)?</p>",
        "id": 153913603,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1507809810
    },
    {
        "content": "<p>If you want one profile, you could just define a value set that identifies the allowed Observation codes and/or body sites</p>",
        "id": 153913741,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507850980
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  In our use case, we have Multi Organ System examination which is further divided into Eyes, ENT, Respiration, Chest/Axilla, Cardiovascular etc. Moreover, the organs in turn have different findings. For example, examination of ear comprises of organs namely external ears, tympanic membrane and ear canal, which have their respective findings. <br>\nSo, how can I implement this hierarchy in the profile? <br>\nAlso,how can I capture \"No Abnormality Detected \" and \"Normal Except\"(which contains different findings)? The Observation.value can take only one value set, how can I bind multiple value sets (findings)?<br>\nIf I am creating profile for the \"Examination of Tympanic Membrane\", where can I attach the code of the tympanic membrane (Observation.code or Observation.bodySite)?</p>",
        "id": 153914411,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1508242383
    },
    {
        "content": "<p>If you want different value sets for each body part examined, then you'll need a different profile for each.  If you want the results back with a hierarchical organization, then you'll need to define profiles for Observations at the \"panel\" level which have a bunch of \"related\" member observations as well as profiles for the leaf-level parts.  Normal except would be an observation with related member observations that identify the exceptions.</p>",
        "id": 153914436,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1508250989
    },
    {
        "content": "<p>How can I capture \"No Abnormaility Detected\" in the profile?  Can I create value sets for the findings of  \"Normal Except\"?</p>",
        "id": 153914602,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1508327738
    },
    {
        "content": "<p>Yes</p>",
        "id": 153914847,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1508419745
    },
    {
        "content": "<p>Can I use the element Observation.dataAbsentReason to capture \"No Abnormality Detected\"?</p>",
        "id": 153915396,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1508765958
    },
    {
        "content": "<p>That is a typically a result value and not an exceptional value.</p>",
        "id": 153915419,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508770930
    },
    {
        "content": "<p>Can I use the element Observation.valueCodeableConcept to store \"No Abnormality Detected\"?</p>",
        "id": 153915631,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1508845235
    },
    {
        "content": "<p>Yes</p>",
        "id": 153915712,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1508853743
    },
    {
        "content": "<p>Hi all,  I need to create a profile for GU system male. Can I consider CVA Tenderness, Rectal Examination,Bladder, Urine and Catheter as components for Observation profile? ,Also, can I capture 'Male Genitalia' (Observation.related )as another Observation which comes  under the main Observation GU male, appearance and palpation as components? Moreover,  the Observation.component 'Bladder' has a valueset tenderness and distension, the valueset in turn has both absent and present respectively.Can I capture the pair \"Absent\" and \"Present\" in an extension? Thank you</p>",
        "id": 153934104,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1517380981
    },
    {
        "content": "<p>Tenderness, Rectal examination, etc. sound like they could/should be stand-alone Observations.  I.e. someone could look at them by themselves and understand them and possibly make decisions based on them.  They're sort of like a \"white blood cell count\" in a blood panel.  They might be commonly reported as a group, but they're useful by themselves.  Component is used for things that aren't useful by themselves.  For example, if you were capturing a sensitivity test, the notion of \"sensitive/insensitive\" and \"what drug was the specimen tested against\" aren't useful on their own.  You always need them both together to understand what's going on.  Looking at either on its own is useless.</p>\n<p>The pattern to follow for your data is to have a parent observation that has a \"has member\" relationship to a bunch of other observations - one each for CVA Tenderness, Bladder, etc.  You'll need some clinical guidance as to whether bladder tenderness and bladder distension should be captured as components or as further \"has member\" observations.  I don't know the area well enough to understand whether bladder tenderness and bladder distension can function stand alone or not.  (My guess is that they can, but I'm a non-clinician, so my guesses don't count :))</p>",
        "id": 153934131,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517407200
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> The images show the tree structure of the Observation(GU male). Is there any other alternative to lessen the number of resources used? <a href=\"/user_uploads/10155/Xv2E-_-dx1RzZ5QlhMToa2Yf/gumale.PNG\" target=\"_blank\" title=\"gumale.PNG\">gumale.PNG</a> <a href=\"/user_uploads/10155/YfGyxJRLkZa6aL6fpSWg26ck/gumale2.PNG\" target=\"_blank\" title=\"gumale2.PNG\">gumale2.PNG</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Xv2E-_-dx1RzZ5QlhMToa2Yf/gumale.PNG\" target=\"_blank\" title=\"gumale.PNG\"><img src=\"/user_uploads/10155/Xv2E-_-dx1RzZ5QlhMToa2Yf/gumale.PNG\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/10155/YfGyxJRLkZa6aL6fpSWg26ck/gumale2.PNG\" target=\"_blank\" title=\"gumale2.PNG\"><img src=\"/user_uploads/10155/YfGyxJRLkZa6aL6fpSWg26ck/gumale2.PNG\"></a></div>",
        "id": 153934497,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1517493206
    },
    {
        "content": "<p>The reason for the number of observations is to support and independent distribution - the notion is that any one of these might need to be queried on its own - possibly with historical observations of the same type for comparison.  It might also be necessary to pass some subset of the information as part of a document, message or decision support operation invocation.  So yes, there will potentially be a large number of observations, but each can stand alone.  You might choose to send a whole package of Observations as a transaction or batch (in REST) or otherwise packaged in a document or message.</p>",
        "id": 153934587,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517499670
    }
]