[
    {
        "content": "<p>Is there a repository where I can contribute JSON examples of cases that are not listed in a resource documentation? Use cases with extensions for example. Or where can these be suggested?</p>",
        "id": 266440993,
        "sender_full_name": "Fran del Río",
        "timestamp": 1640882359
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"372568\">@Fran del Río</span> I'm not completely sure if I understand your question, but if you'd like to make example instances, use cases, etc. available to the world you could consider using a free project on <a href=\"http://Simplifier.net\">Simplifier.net</a> for that (like <a href=\"https://simplifier.net/hl7fhirukcorer4/~resources?category=Example&amp;exampletype=Patient&amp;sortBy=RankScore_desc\">how UK Core is making example FHIR Patient instances available</a>). Or are you talking about suggestions for example instances to add to the core FHIR specification (like <a href=\"https://www.hl7.org/fhir/patient-examples.html\">these</a>)?</p>",
        "id": 266442449,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1640883722
    },
    {
        "content": "<p>If you think there are examples that would be helpful to include in the core specification (because they help highlight useful aspects of the resource or usages implementers might not necessarily understand from the current examples, you can also use the 'propose a change' link and submit a change request, including your proposed example as an attachment.  (Be sure to explain in the change request why you feel the additional example would be helpful/useful - and of course make sure that the example data is data that can be freely published without violating privacy or IP.)</p>",
        "id": 266652005,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641186155
    },
    {
        "content": "<p>For example: I need to view Questionnaire cases where questions are shown based on patient data (gender, age, etc). These data already exist in the patient, I do not wish to add \"fill in your gender\" questions if such information already exists. I would like to see case examples and I cannot find them easily in The SDC specification or Questionnaire examples. <br>\n<a href=\"http://Simplifier.net\">Simplifier.net</a>: nice! I did not find the type of examples I was looking for but I see several that can be very useful.</p>",
        "id": 266821274,
        "sender_full_name": "Fran del Río",
        "timestamp": 1641310132
    }
]