[
    {
        "content": "<p>Hi. Is there an instance of an imaging study with images? anyone know an example instance resource out there?</p>",
        "id": 153909784,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506024549
    },
    {
        "content": "<p>Jose, The only way to do that is to have a PACS system available on the Internet. As the images are accessed by using DICOM web access methods.  <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> <span class=\"user-mention\" data-user-id=\"191960\">@Brad Genereaux</span> right?</p>",
        "id": 153909797,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506027997
    },
    {
        "content": "<p>Can't a study have contained media?</p>",
        "id": 153909806,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506028590
    },
    {
        "content": "<blockquote>\n<p>Can't a study have contained media?</p>\n</blockquote>\n<p>Looking at the resource, <a href=\"http://hl7.org/fhir/imagingstudy.html\" target=\"_blank\" title=\"http://hl7.org/fhir/imagingstudy.html\">http://hl7.org/fhir/imagingstudy.html</a>, there is no attachment for an embedded binary.</p>",
        "id": 153909817,
        "sender_full_name": "Brad Genereaux",
        "timestamp": 1506033323
    },
    {
        "content": "<p>Is this not outlined by this?</p>\n<p>ImagingStudy is used for DICOM imaging and associated information. Use Media to track non-DICOM images, video, or audio. Binary can be used to store arbitrary content. DocumentReference allow indexing and retrieval of clinical “documents” with relevant metadata.</p>",
        "id": 153909819,
        "sender_full_name": "Nate Walker",
        "timestamp": 1506033562
    },
    {
        "content": "<p>Ok, perhaps stepping back: If i have a procedure and no PACS, perhaps I don't use DICOM, what resource should I use? I want to capture the date, patient, evt any relevant observations, and a bunch of key images or videos.</p>",
        "id": 153909866,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506057927
    },
    {
        "content": "<p>For photos and video you can use the Media resource, the photo/video itself would be contained as binary data or reference in the content of the Media resource.</p>",
        "id": 153909879,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1506069447
    },
    {
        "content": "<p>Thanks. My question is what is the resource for the study which allows me to include media</p>",
        "id": 153909882,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506075200
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> Use DocumentReference. DocumentReference is available for ANY kind of content, as long as you have a MIME-TYPE. It is, as XDS is, very liberal in the definition of 'document'. DocumentReference is NOT limited to CDA documents, nor clinical documents. It is there to provide metadata to ANY document.</p>",
        "id": 153909931,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506091460
    },
    {
        "content": "<p>Thanks John. OK, and what is the umbrella that bundles it all? like \"while performing this procedure, we got the following outcome, the following text notes, and the following images\". Perhaps a question to OO?</p>",
        "id": 153909933,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506091699
    },
    {
        "content": "<p>Isn't that an Observation? I am not the expert there...  I think you are asking a question that <span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> is working to resolve in OO...   Umbrella in XDS equivalent is the DocumentManifest.. but I don;t think that is your question.</p>",
        "id": 153909934,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506092187
    },
    {
        "content": "<p>Yes OO along with II is trying to sort out the Observation vs Media vs Binary vs DocRef and I think should add ImagingStudy.  On another note  I think that \"document\" needs to be defined in this use case I think we should be more liberal in Media like in DocRef too and not limit to audio, video and images  those boundaries always  seemed arbitrary to me</p>",
        "id": 153909949,
        "sender_full_name": "Eric Haas",
        "timestamp": 1506100418
    },
    {
        "content": "<p>ok, but regardless of the media type, I need to have the token for the procedure and all the things hanging from it.<br>\nAFAIK, procedure only contains outcome, which seems kind of a final report.<br>\nso:</p>",
        "id": 153909950,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506100921
    },
    {
        "content": "<p>I don't know what you mean</p>",
        "id": 153909952,
        "sender_full_name": "Eric Haas",
        "timestamp": 1506100997
    },
    {
        "content": "<p>1. Shouldn't procedure allow to document things that happen during the procedure? Catheter labs, those images when people are putting pacemakers, surgeries... Limiting that to procedure.outcome seems limiting to the final result, judging from the definition.<br>\n2. Outcome (DiagnosticReport) (or whatever attribute would be) should support images, but also other stuff like media, no?</p>",
        "id": 153909953,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506101124
    },
    {
        "content": "<p>It is currently framed in Procedure to use DiagnosticReport to tie all those things together.  (OO has  a bit of work to to closely review DiagnosticReport in the context of  being a sxreport or dentalrep)  <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> will need to rustle up some use cases and examples for this...</p>",
        "id": 153909958,
        "sender_full_name": "Eric Haas",
        "timestamp": 1506102917
    },
    {
        "content": "<p>Ok, then how can i submit my examples? simple case: capturing images during surgery</p>",
        "id": 153909959,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506103059
    },
    {
        "content": "<p>DR --&gt; Dr.image.link  type= reference(Media)</p>",
        "id": 153909969,
        "sender_full_name": "Eric Haas",
        "timestamp": 1506107699
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>, another option currently is to use Observation.valueAttachment and either include the content directly or by URL reference. </p>\n<p>Your use case hits close to the heart of the OO/II discussion about the future of Media, Observation, ImagingStudy. I hope there is a better answer in the next few months.</p>",
        "id": 153910012,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1506119734
    },
    {
        "content": "<p>I think Diagnostic Report seems closer to reality than Observation.</p>",
        "id": 153910015,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506120804
    },
    {
        "content": "<p>I will bring this up to OO</p>",
        "id": 153910016,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506120814
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> is already a hot topic did you get the doodle poll from Hans?</p>",
        "id": 153910020,
        "sender_full_name": "Eric Haas",
        "timestamp": 1506123081
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> no, i did not receive. can you please fwd?</p>",
        "id": 153910029,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506143377
    },
    {
        "content": "<p>Just to wrap up: Seems that the best approach for now would not be imagingStudy, but ProcedureRequest.Report. <br>\nReport is a DiagnosticReport to which I can easily add images.</p>",
        "id": 153910536,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506367123
    },
    {
        "content": "<p>this left me with some open questions: <br>\n1. diagnosticReport.image called Image but it can also point to videos. Wondering if that is misleading.<br>\n2. ImagingStudy seems to be the RIS part of a study, and it seems that the link to the images would be via procedureReference, which then has a report which points to a diagnosticReport which contains images??<br>\n3. Is imagingStudy aligned with the workflow patterns and separate Request from Event? And considering the different request statuses that are basedOn each other? It seems to be a bit compressed, e.g. when I see reason = reason why it was requested. Should it not be Reason it was performed?</p>",
        "id": 153910537,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506367412
    },
    {
        "content": "<p>1. Yes, this should probably be renamed to media or similar, but that element might go away in light of the Media/Observation merge discussion. So I wouldn't do anything now, but please file a tracker item so it doesn't get lost.<br>\n2. ImagingStudy is the RIS part of a <strong>DICOM</strong> study. The link to the <strong>DICOM</strong> images is via the information (endpoints) in the ImagingStudy resource. For non-DICOM imaging, the images would be described by Media, or Observation, which would both link to the ProcedureRequest. (Hmm, neither Observation nor Media link to the Procedure, just the PR, that is a gap--either in my understanding or the resources--but a separate issue.) No DiagnosticReport is needed to associate the images with a procedure, for either DICOM or non-DICOM imaging.<br>\n3. ImagingStudy <strong>should</strong> be aligned with the Event pattern. If you notice discrepancies, please file a tracker item. I see we didn't align the definition of reason. But wouldn't the reason performed (in most cases) be that it was requested? I suspect that reason requested might be more useful. However, if you submit an issue, we'll look at aligning.</p>",
        "id": 153910540,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1506368426
    },
    {
        "content": "<p>thanks!</p>",
        "id": 153910541,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506368489
    },
    {
        "content": "<p>FWIW, in the ongoing discussion working through OO/II/etc. I think that we need to ensure that the Observation's <em>value</em> is not a media (attachment, etc.) and that the Observation.value is always a demonstrative statement about the patient (etc.).  If that statement is made based on assessment of an image that should be in the .related.    But yes, all of these points about the lack of clear boundary conditions and gaps for certain cases are things we need to deal with.  </p>\n<p>One other key point I want to keep is that I think we do need to keep Media, to ensure that we can accurately represent a DMS and/or BLOB server's content as that's a potentially relevant use case I don't want to lose.</p>",
        "id": 153910633,
        "sender_full_name": "Daniel Rutz",
        "timestamp": 1506426362
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194329\">@Daniel Rutz</span> , if i interpret this as \"an image is not an observation. observation is a statement about something the patient has/is..., and not a general container for something that is known about something\" then i agree.</p>",
        "id": 153910803,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506458500
    },
    {
        "content": "<p>I think the images during surgery is a good case:  Images are not the end goal of the surgery. If during a procedure, we need to capture images , and for liability and QC, we need to store those images, these images _could_ be called \"report\" but report seems more \"final outcome\".  Images during the procedure are closer to \"intermediary results\" but there should be another term for that. I'd ask the native English speakers if further precision in terms is convenient.</p>",
        "id": 153910804,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506458630
    },
    {
        "content": "<p>i think that procedure should have some sort of \"annotations\" directly...</p>",
        "id": 153910805,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506458726
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194329\">@Daniel Rutz</span> I think we have different views. </p>\n<p>Why is a blood pressure cuff reading an observation, but an image isn't? Neither are directly observed, neither involve an interpretation, and both are measurements provided by a device. I could see separating \"readings\" from basic interpretations, but the current design uses Observation for both, and that wouldn't resolve the issue, since I'd classify both the BP and image as \"readings\".</p>\n<p>For the attachment question, I think it is a difference of viewing an \"attachment\" as the thing that is attached, rather than the thing that does the attaching. For things kept in a DMS or BLOB server, that's been the domain of DocumentReference. You might feel that the use of the word \"Document\" is misleading, as not everything referenced is equivalent to a paper document, but it is no more misleading than DMS.</p>",
        "id": 153910828,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1506461793
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> The way i read your text, would this mean that observation could have an image, besides of a bunch of values?</p>",
        "id": 153910833,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1506464648
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I'm talking about future direction, not current state. I'm saying is that one approach is that an image could <em>be</em> an observation (currently via Observation.valueAttachment; potentially in the future, via Observation.valueMedia or some other mechanism). Separately, you could have an observation (potentially with \"a bunch of values\") related to an image (recorded in another Observation, or potentially in the future in Media or ImagingStudy).</p>",
        "id": 153911050,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1506540930
    },
    {
        "content": "<blockquote>\n<p>Hi. Is there an instance of an imaging study with images? anyone know an example instance resource out there?</p>\n</blockquote>\n<p>Last year, the Society for Imaging Informatics in Medicine had a hackathon where they implemented a number of Radiology specific resources in FHIR, including the ImagingStudy resources, and cross referencing with PACS and DICOM fields.  A fork of the FHIR resources is below in the Clinical Meteor GitHub org:</p>\n<p><a href=\"https://github.com/clinical-meteor/siim-dataset\" target=\"_blank\" title=\"https://github.com/clinical-meteor/siim-dataset\">https://github.com/clinical-meteor/siim-dataset</a></p>\n<p>You could take any XR, CT, PT, or MA modality images, and cross reference with the resources listed to create some mocked up data.  </p>\n<p>Also, if anybody would be willing to toss me $1000 or $2000 (i.e. funds to go to FHIR Dev Days), I'd be more than happy to clean the SIIM data up, cross reference with images from The Cancer Imaging Archive (TCIA), and make an authoritative resource for the FHIR community.</p>",
        "id": 153913390,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1507673139
    }
]