[
    {
        "content": "<p>Hey all, I'm trying to make sense of the Parameters \"Part\" field. I'm not clear on what that's supposed to hold. I have a custom operation that I want to build that will return a set of tuples for my consumer. I think I need the part field, but the documentation is thin on that field and there are no examples that I could find. Here's what I think I can do, can someone confirm that this is correct or not?</p>\n<p>&lt;Parameters&gt;<br>\n   &lt;parameter&gt;<br>\n      &lt;name value=\"tuple\"/&gt;<br>\n      &lt;part&gt;<br>\n         &lt;name value=\"room\"/&gt;<br>\n         &lt;valueString value=\"21\"/&gt;<br>\n      &lt;/part&gt;<br>\n      &lt;part&gt;<br>\n         &lt;name value=\"nurse\"/&gt;<br>\n         &lt;valueString value\"Jones\"/&gt;<br>\n     &lt;/part&gt;<br>\n   &lt;/parameter&gt;<br>\n   &lt;parameter&gt;<br>\n       &lt;name value=\"tuple\"/&gt;<br>\n       &lt;part&gt;<br>\n          &lt;valueString  value=\"88\"/&gt;<br>\n          &lt;name value=\"room\"/&gt;<br>\n      &lt;/part&gt;<br>\n....</p>\n<p>You get the idea: each parameter is a \"tuple\" with one part for each field in the tuple. Am I on the right track?</p>",
        "id": 153964612,
        "sender_full_name": "Tim Dunnington",
        "timestamp": 1527178076
    },
    {
        "content": "<p>you don't need part for a response (or request) that is a tuple - just list the fields as parameters. but if you parameters have entries that are tuples, then you need parts</p>",
        "id": 153964634,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527184400
    },
    {
        "content": "<p>Well, yeah if I were returning one tuple. But I am wanting to return multiple tuples...a table, in essence.</p>",
        "id": 153964649,
        "sender_full_name": "Tim Dunnington",
        "timestamp": 1527186623
    },
    {
        "content": "<p>that's why it nests - you can have tuples of tuples. The parameter list is itself a tuple</p>",
        "id": 153964655,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527187017
    },
    {
        "content": "<p>Okay, so, let me try and restate my question. I want to express a table. Each row will consist of 4 columns, let's say for argument's sake the fields are \"lastname\", \"firstname\" and  \"room number\". Really doesn't matter what the fields are. I want to format that as a Parameters object. How do I do that?</p>",
        "id": 153964667,
        "sender_full_name": "Tim Dunnington",
        "timestamp": 1527187655
    },
    {
        "content": "<p>well, let's assume it's organised by row.  So you'll ave a Parameters resource where each parameter has the name 'row' and it has 4 parts, with names \"lastname\", \"firstname\" and \"room number\"</p>",
        "id": 153964677,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527189994
    }
]