[
    {
        "content": "<p>We have the ability to setup exclusions such that certain data (e.g. lab results) do not appear in the portal.  Currently with STU3 we use a _list filter to hide these entries from the portal.  We will be migrating our portal solution to R4 and need another method to handle these exclusions because our R4 FHIR server will include all data by default.  </p>\n<p>One initial thought has been to use custom extensions and custom search parameters but we don't want to go that route if there is already something defined in the FHIR spec that handles exclusions.  I know that for DocumentReference we would likely use the securityLabel  element but for resources like Observation we've been unable to find anything equivalent.</p>",
        "id": 268426523,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1642526657
    },
    {
        "content": "<p>You can use Security Labels on any data through the .meta.security elements.</p>",
        "id": 268430640,
        "sender_full_name": "David Pyke",
        "timestamp": 1642528417
    },
    {
        "content": "<p><a href=\"http://www.hl7.org/fhir/security-labels.html\">http://www.hl7.org/fhir/security-labels.html</a></p>",
        "id": 268431038,
        "sender_full_name": "David Pyke",
        "timestamp": 1642528579
    },
    {
        "content": "<p>What you have found in DocumentReference as the securityLabel element is to the binary content, what the .meta.security is to EVERY kind of resource. Even DocumentReference has a .meta.security element that are the tags on the content of the DocumentReference.... The DocumentReference.securityLabel is there specifically for the case where there is lesser sensitivity to the DocumentReference than is needed on the binary  pointed at by the .content.attachment.url.</p>",
        "id": 268431542,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642528787
    },
    {
        "content": "<p>So, as David points out... use the .meta.security that is present in all resources</p>",
        "id": 268431633,
        "sender_full_name": "John Moehrke",
        "timestamp": 1642528808
    }
]