[
    {
        "content": "<p>Hello!<br>\nI'm creating an extension on Patient to hold the enrollment status for a Patient in a portal. Values like \"Invited\", \"Active\", \"Revoked\" \"Inactive\" etc. Are there any existing valuesets that can be harnessed to hold this information?<br>\nThanks<br>\nPriya</p>",
        "id": 169147307,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1561650859
    },
    {
        "content": "<p>Have you looked at Contract to capture this (instead of using an extension) ? <a href=\"http://build.fhir.org/contract.html\" target=\"_blank\" title=\"http://build.fhir.org/contract.html\">http://build.fhir.org/contract.html</a></p>",
        "id": 169235519,
        "sender_full_name": "René Spronk",
        "timestamp": 1561736410
    },
    {
        "content": "<p>Or could this be Encounter because enrollment is an interaction between a patient and a health provider for the purpose of providing healthcare related service.</p>",
        "id": 169356801,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1561934086
    },
    {
        "content": "<p>Given the number and variety of patient 'portal' products on offer - some tethered to GP system, some not - I don't think that a single status extension on the Patient Resource would suffice. Therefore, I agree with <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>     that the Contract Resource may be a better option. In NZ we do classify patient enrollments into general practices as encounters, but if the use of that resource is constrained to interactions between healthcare providers and patients it might not cover portal products that aren't directly provided by healthcare facilities.</p>",
        "id": 169357406,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1561935600
    },
    {
        "content": "<p>Thank you for the responses! I hadn't thought of contract at all.  Perhaps I should elaborate our use case -We are a HIS working with a portal - the use case here is to send a patient resource to enroll in the portal. The portal API will then respond with a status as to whether the patient was sucessfully enrolled. What kind of resource can the portal API return to indicate the state of enrollement of the patient? Are there examples of such a use case we can harness? Thanks!</p>",
        "id": 169364934,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1561950588
    },
    {
        "content": "<p>If the enrollment is for coverage, then you can look at EnrollmentRequest and EnrollmentResponse.  (We're actually evaluating whether those can be generified to other types of program enrollment.)</p>",
        "id": 169366738,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561954423
    },
    {
        "content": "<p>Note that if you're submitting a request and expecting to get a response resource back, you'll need to use an operation</p>",
        "id": 169366794,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561954505
    },
    {
        "content": "<p>Thanks Lloyd! The enrollmentRequest and Response is most closely aligned to our use case although we're not enrolling for coverage. Yes, please do consider making it generic for other types of program enrollment.<br>\n We are an oncology information system working with a number of patient portals. The patient, who is already registered in our HIS, is invited to join the portal- we send an enrollment request(POST patient resource) to the portal with all pertinent demographics including email. Portal invites the patient through the email provided. Patient enrolls in the portal through the portal invite email. We then  asynchronously query the portal for all enrollment updates using a timestamp. This is the invite/register usecase. Once registered in the portal, other clinical info is exchanged using standard FHIR resources.<br>\n I think the enrollmentrequest and response resource would very nicely fit our usecase, but looks like this is still in a draft state. When will this be in a more mature state to start implementing?</p>",
        "id": 169402260,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1561992924
    },
    {
        "content": "<p>Maturity is driven by implementer action as well as committee work (which is significantly influenced by implementers declaring what they want :&gt;)  <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span> ?</p>",
        "id": 169405403,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561995201
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> you might want to consider EpisodeOfCare instead of encounter where it's not recording an interaction, but a registration/association style thing.</p>",
        "id": 169440752,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1562023913
    },
    {
        "content": "<p>Thank you Brian, looking into EpisodeOf Care. Lots of ideas to run by my team- thanks!</p>",
        "id": 169498788,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1562087242
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  after going through the enrollment request/response resources, we feel this best matches our needs. What can we do as early adopters/implementers to push this to be more generic and ready to implement. Where can I raise this? We're looking to start implementing this fall-  Thanks for the pointer Lloyd!</p>",
        "id": 169601762,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1562187561
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> infact I see this resource was indeed more generic in dstu2!  <a href=\"https://www.hl7.org/fhir/dstu2/enrollmentrequest.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/dstu2/enrollmentrequest.html\">https://www.hl7.org/fhir/dstu2/enrollmentrequest.html</a>.<br>\n\"Insurer\" vs \"target\"</p>",
        "id": 169603345,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1562189047
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196228\">@Priya Mathew</span> Enrollment with a web site, enrollment for the military, enrollment in a clinical trial, enrollment in an insurance program are similar, to a degree, and also quite different in obligations, information requirements and perhaps workflow. The Financial Management Work Group is interested and knowledgeable on the insurance side, and may have thought on the others, and Patient Administration would have interests and thoughts as well. Suggest you attend the FM conference call when you can and we can open up this topic for advancement. I expect we will need to get into the weeds on a few use cases to determine whether the one or more enrollment resources are required.</p>",
        "id": 170740885,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1562953073
    },
    {
        "content": "<p>Thanks Paul. <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> , where can I find details of the FM conference call?</p>",
        "id": 170742137,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1562954155
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196228\">@Priya Mathew</span> All HL7 Conference calls are in the <a href=\"http://HL7.org\" target=\"_blank\" title=\"http://HL7.org\">HL7.org</a> Events Conference calls calendar.<br>\nFM calls are Tuesday at 11 AM Eastern, goto <a href=\"https://join.freeconferencecall.com/fm4\" target=\"_blank\" title=\"https://join.freeconferencecall.com/fm4\">https://join.freeconferencecall.com/fm4</a> for the conference screen share and audio.</p>",
        "id": 170807838,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1563057188
    },
    {
        "content": "<p>After talking with Priya during the FM and FHIR Security calls, a couple of other considerations seemed to be on the table. Priya clarified that her use case isn't about an agreement to be enrolled in a patient portal, and by implication, other enrollment use cases such as to the military or a clinical trial would not be in scope. Seems that in her use case, the enrollment agreement bit happens between the portal and the patient, e.g., terms of service and privacy practices, which should be done with FHIR Consent/Contract depending on level of legal binding. My observations are that (1) FHIR doesn't seem to support adding Patients/Providers etc to Directories/Master Files so suggest this is a gap that should be addressed. But that's not entirely Priya's use case (as I understand it) although in the ball park. (2) Another thought and another gap, is that FHIR doesn't have a Provisioning Resource, i.e., a way to convey what an End User may do with information (collect/access/use/disclose and other LCEs) given their structural roles (competencies) and their functional roles (permitted workflow functions).  This might be a useful way to collect and verify the claims made in an OAuth request or declared in a Push.  In Priya's use case, the HIS tells the portal that the patient with demographics for authentication has the right to collect/access/use/disclose their HIS patient records via the patient portal. Seems like provisioning to me.  I'll put in a CR for FHIR Security consideration and include responses to this.  I added CR for Provisioning Resource <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23776\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23776\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23776</a> and one for a Directory Enrollment Resource <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23777\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23777\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=23777</a> . There may be better solutions but wanted to get something actionable going.</p>",
        "id": 174415955,
        "sender_full_name": "k connor",
        "timestamp": 1567041883
    },
    {
        "content": "<p>The 'request to add this actor to your directory' seems to be a use of a defined operation where the new actor resource is submitted to the directory/portal. As an operation it is expected that the service may need to do many things, such as a human workflow to provision the user. Thus I think this is simply an operation.  This operation can also check that the request is authorized and legitimate, etc...<br>\nIt is surprising this is not part of vhDIR  <a href=\"http://hl7.org/fhir/uv/vhdir/2018Jan/index.html\" target=\"_blank\" title=\"http://hl7.org/fhir/uv/vhdir/2018Jan/index.html\">http://hl7.org/fhir/uv/vhdir/2018Jan/index.html</a><br>\nseems if we treat the Portal as a Directory (it is a directory for the users within the portal mapped to backend identifiers)... then this operation works there too?</p>",
        "id": 174451428,
        "sender_full_name": "John Moehrke",
        "timestamp": 1567083808
    }
]