[
    {
        "content": "<p>Hi,</p>\n<p>I wanted to confirm that a missing profile tag, for a Bundle of resources including the Bundle itself means that the instance(s) is/are  created against the base fhir resource(s).</p>\n<p>For our specific scenario, we have a Bundle resource that was profiled and within it a dozen or so resources also profiled. In this case we have a “profile” tag within the Meta element pointing to the StructureDefinitions of each resource profiled. Otherwise there would be no way to tell what profile the instance conforms to without it.</p>\n<p>Thanks,</p>\n<p>Joel, <span class=\"user-mention\" data-user-id=\"193959\">@Tim Berezny</span></p>",
        "id": 153947525,
        "sender_full_name": "Joel Francis",
        "timestamp": 1521819597
    },
    {
        "content": "<p>The absense of a profile tag doesn't imply anything.  If present, a resource is expected to be valid against the profiles declared.  But it's not mandatory to populate - and even if the sending system did populate it, they wouldn't necessarily fill it with profiles that the receiver knows or cares about.  If your implementation depends on profiles being declared, you'll have to negotiate with client systems to get them to send the profiles you care about.  If that's not feasible, you'll have to figure out what profile(s) the instance complies with by looking at data within the instance.  (It must <em>always</em> be possible to determine relevant profiles by looking at the instance - profiles aren't ever allowed to add information.)</p>",
        "id": 153947530,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521822396
    },
    {
        "content": "<p>Nope you may be using a profile but choose not to declare in the resource.</p>",
        "id": 153947531,
        "sender_full_name": "Eric Haas",
        "timestamp": 1521822410
    },
    {
        "content": "<p>And you don't list all the profiles under Bundle.meta  - Each entry would get it own meta since the meta is about the resource.    If I'm wrong then I would like to know where its documented.</p>",
        "id": 153947534,
        "sender_full_name": "Eric Haas",
        "timestamp": 1521822599
    },
    {
        "content": "<p>Profiles declared in .meta <em>must</em> apply to the resource declaring the profile.</p>",
        "id": 153947535,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521822656
    },
    {
        "content": "<blockquote>\n<p>Profiles declared in .meta <em>must</em> apply to the resource declaring the profile.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"193959\">@Tim Berezny</span></p>",
        "id": 153948148,
        "sender_full_name": "Joel Francis",
        "timestamp": 1522088988
    }
]