[
    {
        "content": "<p>The ExplanationOfBenefit resource has a couple of fields that look appropriate for representing the various financial amount fields that Medicare claims include (e.g. 'Payment Amount to Beneficiary', 'Indirect Medical Education Amount', 'Submitted Charge Amount', etc.). Those fields are EOB.benefitBalance and EOB.item.adjudication. What's not super clear to us right now is when it's appropriate to use one vs. the other vs. extensions. Anyone have guidance/better documentation on that? (Might be more obvious to someone better versed in the insurance world than I, but alas.)</p>\n<p>cc <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <span class=\"user-mention\" data-user-id=\"195298\">@Dave Holdgrafer</span></p>",
        "id": 153943897,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1520879879
    },
    {
        "content": "<p>A particular complication we are running into with Medicare claims is that Eob.item.adjudication looks like a better fit for our needs in a structural sense and a domain sense, but it's only available at the item/line level. A lot of our financial amounts appear at <strong>both</strong> the claim header and line/revenue center levels -- and we need to include both, as the line-level values don't always add up cleanly to the header amounts (just a reality we have to deal with).</p>",
        "id": 153943900,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1520880043
    },
    {
        "content": "<p>I'm leaning towards sticking all of our claim header financial data into extensions, because benefitBalance seems targeted at a completely different use case (e.g. lifetime limits, deductible balances, etc.) that we don't have data for, anyways.</p>",
        "id": 153943902,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1520880182
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192789\">@Karl M. Davis</span>  The FM work group has been looking at these \"totals\" fields and you can expect some changes in STU4 that should make these values easier to represent.</p>",
        "id": 153943905,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1520880319
    },
    {
        "content": "<p>(Per my email history, Paul+Mark, we may have discussed this on an FM call at the end of 2016, but I can't find any notes on the discussion's outcome.)</p>",
        "id": 153943906,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1520880356
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192789\">@Karl M. Davis</span>  <a href=\"http://build.fhir.org/explanationofbenefit.html\" target=\"_blank\" title=\"http://build.fhir.org/explanationofbenefit.html\">http://build.fhir.org/explanationofbenefit.html</a> in the latest build has a total (backbone element 0..*) with category and amount fields (1..1)</p>",
        "id": 153943907,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1520880536
    },
    {
        "content": "<p>(<span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> Weird -- I can @ you now, but couldn't earlier. Glad you found this thread.)<br>\nGreat news! Do you have any details on those changes? I'm not seeing anything obviously appropriate on the trunk version: <a href=\"http://build.fhir.org/explanationofbenefit.html\" target=\"_blank\" title=\"http://build.fhir.org/explanationofbenefit.html\">http://build.fhir.org/explanationofbenefit.html</a></p>",
        "id": 153943908,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1520880547
    },
    {
        "content": "<p>go to <a href=\"http://hl7.org/fhir/directory.html\" target=\"_blank\" title=\"http://hl7.org/fhir/directory.html\">http://hl7.org/fhir/directory.html</a> and choose the latest build</p>",
        "id": 153943910,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1520880583
    },
    {
        "content": "<p>Ahh, I see that now.</p>",
        "id": 153943911,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1520880585
    },
    {
        "content": "<p>v3.2 I beleive</p>",
        "id": 153943912,
        "sender_full_name": "Mark Scrimshire",
        "timestamp": 1520880603
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192789\">@Karl M. Davis</span> The financial fields you mention would be in EOB.item.adjudication, and totals would be in the EOB.total. The .benefitBalance would hold the consumed quantities under the plan, for example number of Physio visits or amount of Dental benefits used to date.<br>\nThis allows you to express at the item. or detail. or subDetail. level what can be expressed there and at the root what can only be expressed there or totals of item, detail or subDetail amounts, for example amount charged or benefit payable.</p>",
        "id": 153943915,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1520880865
    },
    {
        "content": "<p>Overall, I think our mapping of Medicare data to EOBs needs some rework (in a future release; no time for this first release). It's hard to say exactly what our issues are, though, given the sparse documentation for the resource and lack of examples.</p>\n<p>Some for-instances:</p>\n<ul>\n<li>We're not making any use of EOB.payment.</li>\n<li>We're also not using EOB.totalCost, EOB.unallocDeductable, or EOB.totalBenefit.</li>\n<li>Related to above: We're probably shoving more things into adjudications than we really should.</li>\n<li>Our Part D (prescription drug) mapping is probably abusing the resource by always having a single EOB.item.</li>\n<li>We've got a lot of extensions. Some of them are probably better mapped to standard fields.</li>\n</ul>\n<p>Again, the folks who've built out this mapping (myself included) aren't insurance domain experts. This makes the missing documentation and examples particularly painful for us.</p>\n<p>All that aside, we've found the STU3 EOB resource to be a good fit for our usecase. Kudos to <span class=\"user-mention\" data-user-id=\"192609\">@Mark Scrimshire</span> and the FM WG for it!</p>",
        "id": 153943919,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1520882148
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192789\">@Karl M. Davis</span> Hi Karl, that's a lot of items, I'll try to address below:<br>\nEOB.payment - that's up to you how much of the payment details you convey to the patient (the typical audience for an EOB). If you paid the provider on the patient's behalf then you probably won't want to put any payment specifics beyond the amount and date into the EOB.<br>\n.adjudication - can you provide me with a list of what you are stuffing in and I/FM can review to see if these are normal and appropriate adjudication results.<br>\nPrescriptions: nope not abuse, pharmacy has typically allowed only a single line item in a claim - in the US you will receive most pharmacy claims via the NCPDP (SDO) teleplan standard - it only supports a single line item.<br>\nExtensions - when we last reviewed your use of the EOB you were down to 2 extensions (assuming the recommendations where implemented) those being Race and Ethnicity. Please send me a list of the others and we can advise on what elements should be used or where new elements or formal extensions are required.</p>\n<p>Regarding the lack of documentation, yes with limited resources we have focussed on the content models themselves but expect to have additional resources soon to provide the documentation to support/explain the resources and the business.</p>",
        "id": 153944165,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1520918982
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> We have lots of payment fields, but they're currently mapped as adjudications. One of the reasons we're not using EOB.payment right now is that it's not clear who/what it's supposed to capture payments _for_: payments from the primary insurer to the provider?, payments from secondary insurers to the provider?, payments from the patient to the provider?, reimbursements from the insurer(s) to the patient/beneficiary?, etc.</p>",
        "id": 153944643,
        "sender_full_name": "Karl M. Davis",
        "timestamp": 1521000526
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192789\">@Karl M. Davis</span> You would only capture in payment what you, the payor, are paying in respect of this claim. Others speak for themselves, and any Patient payment amount would be reflected in the EOB.total structure in R4 (and actually payor comments on patient contribution is editorial as the patient may have insured against them - ie. they are picked up by a downstream payor).</p>",
        "id": 153944704,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1521022371
    }
]