[
    {
        "content": "<p>Hi, in relation with implementing an autentication lookup service in a regional EHR from a national service, we need to expose an attribute in the regional EHR that describes the reason/ authorization a clinician has to access the patient in this specific instance. The attribute is logged in the EHR for every time a clinician accesses a new patient has a around 15 values – for example «patient visiting own unit», «delivering anastetics» etc.</p>\n<p>As this is information related to the EHRs audit log, we have been thinking AuditEvent sounds like a good candidate resource. But we struggle with how to best express that this is a relation between the patient and the practitioner.  A couple of alternatives we have been discussing is to include the 15 codes in the extensible value set AuditEvent.agent.purposeOfUse for example in the TREAT-hiearcy, or to add a coded element with the 15 codes as an extension. Any thoughts?</p>",
        "id": 242885326,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1623852346
    },
    {
        "content": "<p>excellent.   so these codes are an indication of why the clinician was authorized? if so then I think that would go into AuditEvent.agent.policy. This element is a URI, but you can easily make a URI encoding out of a code (system#code).</p>",
        "id": 243072062,
        "sender_full_name": "John Moehrke",
        "timestamp": 1623958483
    },
    {
        "content": "<p>the purpose of use would not be right, as that is the activities that are authorized, not the reason they were authorized.</p>",
        "id": 243072130,
        "sender_full_name": "John Moehrke",
        "timestamp": 1623958515
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> that seesm to fit very well. I'll take it back to the project and come back to you if there are any follow-up questions. Cheers</p>",
        "id": 243164116,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1624024703
    },
    {
        "content": "<p>Hi, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> . I am working in the same project together with <span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span>  and have a couple of follow up questions. </p>\n<p>1) As far I can see, the Auditevent.agent.policy is a rather generic structure that can hold a list of URL-encoded attributes from an OAuth2 JSON Web token (JWT) which describes an authorization context for the event. Do you agree on that?  </p>\n<p>2) I am not sure I understand the last sentence \"<em>the purpose of use would not be right, as that is the activities that are authorized, not the reason they were authorized</em>.\"  When I check out the terminology binding for <a href=\"https://www.hl7.org/fhir/auditevent-definitions.html#AuditEvent.agent.purposeOfUse\">https://www.hl7.org/fhir/auditevent-definitions.html#AuditEvent.agent.purposeOfUse</a>, then I see codes that we are looking for e.g. TREAT and Break the glass (BTG).  The definition / comment fits to: \"The reason (purpose of use), specific to this agent, that was used during the event being recorded\" / \"Use AuditEvent.agent.purposeOfUse when you know that is specific to the agent,...\".    Maybe you can elaborate on that?</p>",
        "id": 244808921,
        "sender_full_name": "Trond Elde",
        "timestamp": 1625323123
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 244827603,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625351845
    },
    {
        "content": "<p>Sorry for the delay, vacation. Realistically you can put anything into any element. I can't stop you. I am just trying to express the intention of the design.</p>",
        "id": 245024220,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625570354
    },
    {
        "content": "<p>Are you looking to create an AuditEvent when a token is issued? If so, then why not record the JWT content in the AuditEvent as an AuditEvent.entity? This is to say that the AuditEvent is created because the token was issued, and records the issuance of that token.  You could either just encode the JWT (json) into the AuditEvent.entity.description; or you could split out the elements into AuditEvent.entry.detail value pairs.  There is a jira ticket asking for this to be shown in a example, so I would very much like to work with you to get this jira ticket resolved with an example.</p>",
        "id": 245024662,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625570639
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  I am back after a long summer holiday, so no problem with a couple of days of delay.  </p>\n<p>No, we are not looking for audit event for issuing of JWT tokens, but the underlying reason for access  that this specific agent accessed the patient EHR, e.g. CRUD on EHR documents.  The JWT is just a carrier of information, and not interesting in itself.</p>\n<p>And yes, we want to comply with intention of the design. The challenge is that the description is rather sparse and no relevant examples to study as far I can see. If you have time, you can take at  look at  <a href=\"https://www.ehelse.no/normen/documents-in-english/_/attachment/download/df5cf316-0288-44e8-b451-178a8d15324a:d3a673d07633aa840321353047b142ccc1d09996/Fact%20sheet%2015%20-incident-registration-and-follow-up.pdf\">Incident registration and follow up document (code of conduct document)</a> from Norwegian authorities and especially </p>\n<div class=\"codehilite\"><pre><span></span><code>4 The incident register must, at minimum, contain\na) For authorized use:\n....\nThe reason for access (e.g. medical care, principle of necessity access, administrative\nuse)\n</code></pre></div>\n<p>\"Principle of necessity access\" = break the glass (BTG)</p>",
        "id": 250261245,
        "sender_full_name": "Trond Elde",
        "timestamp": 1629618438
    },
    {
        "content": "<p>The reason for access -- this is what we call PurposeOfUse. The AuditEvent has a .purposeOfEvent to record the purposeOfUse at the event level, and also has .agent.purposeOfUse when an event has multiple agents with different purposeOfUse.</p>",
        "id": 250341201,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629720023
    }
]