[
    {
        "content": "<p>We are a bit of a ways off of trying to formally register our extensions but we have a lot of data in our system that we want to be able to exchange in FHIR-compliant APIs but that don't fit within the core specification. Obviously, extensions are our best bet for handling these conditions. My question is that in the pages about extensibility, it discusses two options for registering extensions: submitting them as extensions to be officially ballotted and added (or not) as FHIR-approved extensions and then also having non-ballotted extensions that could be defined by any implementer and that are basically there as a repository to facilitate inter-operability but not in any way sanctioned for HL7. On the latter type, which my organization would want to use a lot, it seems like the ability to register the extensions is not yet built out? when I follow the link provided: <a href=\"http://hl7.org/fhir/registry\" target=\"_blank\" title=\"http://hl7.org/fhir/registry\">http://hl7.org/fhir/registry</a> it's essentially a dead link. is there something I'm missing about how to apply to add things to this registry?</p>",
        "id": 153917190,
        "sender_full_name": "Joanna Gaskill",
        "timestamp": 1509559814
    },
    {
        "content": "<p>It's taken us forever to get a registry up and running.  The official registry is now up in \"play around\" mode here: <a href=\"https://registry.fhir.org/\" target=\"_blank\" title=\"https://registry.fhir.org/\">https://registry.fhir.org/</a>.  We'll be wiping the content in a few weeks and then hopefully starting to use it for real.</p>",
        "id": 153917196,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1509561865
    },
    {
        "content": "<p>We'll be correcting the spec to point to that page in the next release (and might even entertain updating prior versions to point there)</p>",
        "id": 153917197,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1509561895
    },
    {
        "content": "<p>When will this reset happen? The registry still has too many experiments (many of my own failed experiments).</p>",
        "id": 153922603,
        "sender_full_name": "John Moehrke",
        "timestamp": 1512143685
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 153922604,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512143804
    },
    {
        "content": "<p>we'll be talking about this in New Orleans</p>",
        "id": 153922637,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512157519
    }
]