[
    {
        "content": "<p>Can client declare a profile which contains extension? If so, what server should act when receive a resource when unknown extension?</p>",
        "id": 165864373,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1558056417
    },
    {
        "content": "<p>our advice is that the server should ignore unknown extensions and either keep or drop them as it's able to do. Not everyone can get agreement to do that</p>",
        "id": 165864563,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558056692
    },
    {
        "content": "<p>ModifierExtensions are different.  You need to be quite cautious about doing any processing of an instance that contains an unrecognized modifierExtension.</p>",
        "id": 165864833,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558057079
    },
    {
        "content": "<p>Ha, that is exactly what I am going to ask. How about modifier and mustSupport extension.</p>",
        "id": 165864920,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1558057187
    },
    {
        "content": "<p>yes, in my code that processes resources, I have a .noModifiers() that throws an exception. e.g. </p>\n<p>var import = valueset.compose.include.noModifiers()</p>",
        "id": 165864975,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558057209
    },
    {
        "content": "<p>If an element you don't care about or process contains a modifier, you could theoretically persist and ignore it (e.g. something on Patient.contact when you do no processing on contacts).  In a document, you might just render the narrative.</p>",
        "id": 165865082,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558057344
    },
    {
        "content": "<p>For things marked as mustSupport in a profile, the answer depends on whether your system claims to comply with the profile.  (Just putting a profile declaration in your instance doesn't mean that all recipients will magically support your stuff - though that would be pretty cool :&gt;)</p>",
        "id": 165865170,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558057471
    }
]