[
    {
        "content": "<p>Is there such thing as a \"modifierExtension\" for a datatype?</p>",
        "id": 153849948,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1474394542
    },
    {
        "content": "<p>no. deliberate decisions. No modifier extensions in data types</p>",
        "id": 153849977,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474396015
    },
    {
        "content": "<p>ahh ok. Back to the drawing board then...</p>",
        "id": 153849979,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1474396128
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> Care to share the use-case?</p>",
        "id": 153850061,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474420674
    },
    {
        "content": "<p>We are looking at how we migrate from HL7v3 CDA to FHIR based CDA. In doing so we need to recognise how we deal with the \"use\"  attribute (for name, address, telecom etc). We have particular issues as we \"locally\" extended the valueset  in England to meet local needs. The valueset in FHIR for \"use\" is a \"required\" list which means we can not extend it. </p>",
        "id": 153850152,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1474462782
    },
    {
        "content": "<p>what values are we talking about? </p>",
        "id": 153850154,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474462861
    },
    {
        "content": "<p>The only option we have is to use an extension with our own valueset but this extension would change the current \"use\" attribute so probably should be a \"modifier\".</p>",
        "id": 153850155,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1474462915
    },
    {
        "content": "<p>well, what are the vsalues?</p>",
        "id": 153850156,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474462951
    },
    {
        "content": "<p>I don't have the info with me here in Baltimore - will post when I get back to the UK. </p>",
        "id": 153850157,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1474463135
    },
    {
        "content": "<p>ok, thanks. We'd like to help you get to the bottom of this </p>",
        "id": 153850160,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474463657
    },
    {
        "content": "<p>Excluding use and sending an extension that conveys alternate uses isn't necessarily going to be a modifier.  HumanName.use is a modifier because it allows you to say things like \"old\" and \"maiden\" - which do change the meaning of the name.  But other values (usual, temp, official) would not be modifiers.</p>",
        "id": 153850168,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474466020
    },
    {
        "content": "<p>recommended 'use' values to be used for address/telecom elements. <br>\nWP - Work place - An office address. First choice for business related contacts during business hours.  <br>\nTMP- Temporary address - A temporary address; may be good for visit or mailing.<br>\nPHYS - Physical visit address - Used primarily to visit an address. <br>\nPST - Postal address - Used to send mail. <br>\nH -Home address - The person's home address; attempted contacts for business purposes might intrude privacy and chances are one will contact family or other household members instead of the person one wishes to call. Typically used with urgent cases, or if no other contacts are available.  <br>\nHP - The primary home address - An address to reach a person after business hours.  <br>\nHV - A vacation home - An address to reach a person while on vacation.  </p>\n<p>recommended 'use' values to be used for name elements. </p>\n<p>Code Definition <br>\nL - Legal<br>\nA - Artist / stage<br>\nI - Indigenous/Tribal<br>\nR - Religious <br>\nPREVIOUS-BIRTH * Birth name<br>\nPREVIOUS-MAIDEN * Maiden name<br>\nPREVIOUS-BACHELOR * Bachelor name<br>\nPREVIOUS * Other previous name <br>\nPREFERRED * Preferred name</p>",
        "id": 153850172,
        "sender_full_name": "Simon Knee",
        "timestamp": 1474466818
    },
    {
        "content": "<p>recommended 'use' values to be used for telecom elements:</p>\n<p>AS - Answering service - an automated answering machine used for less urgent cases and if the main purpose of contact is to leave a message or access an automated announcement.  <br>\nEC - Emergency contact - A contact specifically designated to be used for emergencies. This is the first choice in emergencies, independent of any other use codes.  <br>\nH - Home - A communication address at a home, attempted contacts for business purposes might intrude privacy and chances are one will contact family or other household members instead of the person one wishes to call. Typically used with urgent cases, or if no other contacts are available.  <br>\nHP - Home primary - the primary contact to reach a person after business hours. <br>\nHV - Home vacation - A vacation home, to reach a person while on vacation.  <br>\nWP - Work place - An office address. First choice for business related contacts during business hours <br>\nPG - Pager - A paging device suitable to solicit a callback or to leave a very short message.  <br>\nMC - Mobile contact - A telecommunication device that moves and stays with its owner. May have characteristics of all other use codes, suitable for urgent matters,</p>",
        "id": 153850173,
        "sender_full_name": "Simon Knee",
        "timestamp": 1474467071
    }
]