[
    {
        "content": "<p>Hi all I have the following problem : The values of FHIR Encounter are not sufficient to our use .<br>\nEncounter.Status is a primitive type and marked as required . </p>\n<ol>\n<li>is it possible for FHIR Encounter.Status to contain an extension ? </li>\n<li>is it possible to replace FHIR status codes ?</li>\n</ol>",
        "id": 201520742,
        "sender_full_name": "eyal wolanowski",
        "timestamp": 1592722145
    },
    {
        "content": "<p>can you give details or an example of what  you need to extend?</p>",
        "id": 201522757,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1592726054
    },
    {
        "content": "<p>Yes of course , we are implementing an x-ray clinic and we need statuses like waiting for doctor, waiting for release and so on ... <br>\nI thought maybe add extension of secondary statuses and then I saw this <br>\n<a href=\"https://fhirblog.com/2017/01/10/extending-a-required-valueset-binding/\">https://fhirblog.com/2017/01/10/extending-a-required-valueset-binding/</a><br>\nso I can add to encounter \"_status\" put my own statuses and put \"unknown\" in Encounter.Status but this feels a bit like a hack</p>\n<p>the main problem is that \"in progress\" status is too general and does not really reflects the encounter status</p>",
        "id": 201523408,
        "sender_full_name": "eyal wolanowski",
        "timestamp": 1592727143
    },
    {
        "content": "<p>Nice. I've done that in a BI system :)</p>",
        "id": 201523975,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1592728108
    },
    {
        "content": "<p>these are not encounter statuses, these are workflow statuses.</p>",
        "id": 201523977,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1592728119
    },
    {
        "content": "<p>for that, you would use Task resource.</p>",
        "id": 201523980,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1592728140
    },
    {
        "content": "<p>the easiest, I guess, would be to have a contained Task inside your Encounter, and Task can contain the business statuses and sub-statuses that you need</p>",
        "id": 201524036,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1592728244
    },
    {
        "content": "<p>Nice !! this is a great idea . Thank you it helped a lot .</p>",
        "id": 201525869,
        "sender_full_name": "eyal wolanowski",
        "timestamp": 1592731040
    },
    {
        "content": "<p>An easier alternative would be to add an extension to identify your own business-sub-status of 'in-progress'.  Encounter.status would be 'in-progress', and the extension will identify 9for those that support the extension) what the more detailed status is.</p>",
        "id": 201576922,
        "sender_full_name": "René Spronk",
        "timestamp": 1592812872
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> \"these are not encounter statuses, these are workflow statuses\"<br>\nThose seem to be different dimensions of one thing. I like Rene's suggestion, but don't know how to evaluate against yours. You suggest a contained Task: what would be the logical relationship between the Encounter and the Task?</p>",
        "id": 206317218,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1596840090
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191985\">@Jay Lyle</span> good point, and that is something which will also apply to other task'y resources - careplan, etc.</p>",
        "id": 206340013,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596878419
    },
    {
        "content": "<p>so, If there is a workflow around this, I'd say these statuses would be captured in tasks.</p>",
        "id": 206340029,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596878500
    },
    {
        "content": "<p>but if the only FHIR resource you expose is an encounter, you can probably do with an extension</p>",
        "id": 206340071,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596878533
    },
    {
        "content": "<p>My experience (with a different system, many years ago) was that the variable \"encounter status\" is not persisted because it has to be calculated in different perspectives, so we needed the individual status.</p>",
        "id": 206340086,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596878633
    },
    {
        "content": "<p>questions we encountered: encounter is scheduled to start at 8, patient arrives at 7h45, and doctor arrives at 8h05. How long is the status \"waiting for doctor\" ? 5 minutes? 20 minutes? The room is clear at 8h10 - what is the status between 8h05 and 8h10?</p>",
        "id": 206340139,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596878742
    },
    {
        "content": "<p>Some more specific thoughts:</p>\n<p>I don't know what 'waiting for doctor' means, but if it means \"appointment time reached, patient present in exam room, doctor not yet arrived,\" then it sounds like \"Encounter.status = arrived.\"</p>\n<p>I don't know what 'waiting for release' means either, but it sounds like a status on an image, not the encounter.</p>\n<p>To Jose's examples,<br>\nWhether the encounter can be \"arrived\" before the appointment start time seems like a question that either needs to be nailed down in the spec or left to organizational policy. Are there clinical or legal implications to recognizing (or failing to recognize) the presence of the patient?</p>\n<p>If the encounter is over at 8:10, I'd assume the Encounter.status would become finished, irrespective of the appointment period. Are there reasons to think otherwise?</p>",
        "id": 206397864,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1596984271
    },
    {
        "content": "<p>I mean - the room is only available for the patient at 8:10, so both patient and doctor are there.</p>",
        "id": 206402068,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596991048
    },
    {
        "content": "<p>If the patient is there and the doctor is there and the room is free, then perhaps the exam starts. Also we wanted to monitor the waiting times of the patient to see if we should change policies (e.g \"please don't show up more than 30 mins in advance).<br>\nAnother implication I recall well it made me appreciate the health system. One hospital wanted to make sure that if the patients were in the waiting room for more than 45 minutes, they wanted to know because that is what mattered to them - patient comfort - and they suggested if people were waiting for more than x minutes, someone should bring tea or coffee.</p>",
        "id": 206402262,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596991406
    },
    {
        "content": "<p>One of the key decisions made by the PA committee (for Hl7 v3, presumably this still holds in FHIR) was that encounters (and their details, statuses) should always be viewed from the perspective of the patient, not from the perspective of the healthcare provider. As such an encounter starts when the patient perceives that it starts, which could be the moment they step into the hospital, or the moment they step into the clinician's office.</p>",
        "id": 206430753,
        "sender_full_name": "René Spronk",
        "timestamp": 1597039459
    }
]