[
    {
        "content": "<p>Complex extensions use sub-extensions to define their parts.  In the examples I've found, those sub-extensions are always fully defined inline with their parent complex extension.  I, however, would like to define a complex extension with sub-extensions that are fully defined externally (rather than inline).  Is this possible?</p>\n<p>For example, I want to define complex extension <a href=\"http://example.org/foo\" target=\"_blank\" title=\"http://example.org/foo\">http://example.org/foo</a> with two sub-extensions: <a href=\"http://example.org/bar\" target=\"_blank\" title=\"http://example.org/bar\">http://example.org/bar</a> (which is a code) and <a href=\"http://example.org/baz\" target=\"_blank\" title=\"http://example.org/baz\">http://example.org/baz</a> (which is a boolean).  If I were to define the sub-extensions inline, then my complex extension would specify the <a href=\"http://example.org/bar\" target=\"_blank\" title=\"http://example.org/bar\">http://example.org/bar</a> extension with a valueCode element and the <a href=\"http://example.org/baz\" target=\"_blank\" title=\"http://example.org/baz\">http://example.org/baz</a> extension with a valueBoolean element.  But suppose that the two sub-extensions are already defined externally for re-use.  Then I just want to reference them by their uri without re-specifying their value[x] elements -- but I think this would fail validation...  Am I right?</p>",
        "id": 153869300,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1485470692
    },
    {
        "content": "<p>In principle, you can define an extension that prohibits value and allows child extensions but doesn't define what those can be.  And it's perfectly possible to define an extension that has as its context another extension.  The child extensions would have to list their full URL though - they couldn't use a \"relative\" URL like complex extensions would typically use.  Also, whether the validator will support extensions that have, as their context, another extension, I don't know.  I don't know anyone's done it so it's unlikely it's been well tested and may not have been built in yet.</p>",
        "id": 153869395,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1485558068
    },
    {
        "content": "<p>Yes, I think I was getting confused about where and when the invariant applies.  Since invariants apply to the *data*, I see now that I can just reference other extensions (as sub-extensions) in my StructureDefinition -- although I'll take note that it may not be well-tested.  Thanks again!</p>",
        "id": 153869471,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1485781708
    }
]