[
    {
        "content": "<p>I have heard informally that extensions are not version-specific. It looks like they are: the extensions I see in Simplifier populate \"fhirVersion\", &amp; the HL7 registries are different across the published releases (though I can't figure out how to view extension SDs there). But fhirVersion isn't a required element in SD. Must extensions have versions? Could they be re-used across FHIR versions?</p>",
        "id": 161145438,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1552998765
    },
    {
        "content": "<p>The StructureDefinitions identify what version of FHIR they're expressed in, but not what version of FHIR they apply to.  We haven't discussed scoping extensions by FHIRVersion.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 161159743,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553008689
    },
    {
        "content": "<p>I believe that we said that StructureDefinition.fhirVersion is the version they are describing. That's certainly how I use it</p>",
        "id": 161182756,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553023946
    },
    {
        "content": "<p>I hear Lloyd drawing a distinction between a) the version of the extension definition and b) the version to which it applies, and Grahame saying it's b.</p>\n<p>So, to make an extension usable on two different FHIR versions, you'd need to create two extensions. Or extend StructureDefinition.fhirVersion cardinality. Right?</p>\n<p>Would leaving it blank make it available to resources of all versions, or none?</p>",
        "id": 161768585,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1553611658
    },
    {
        "content": "<p>At some point, we definitely want to be able to say \"This extension applies to version X and on.\"  How would we do that?</p>",
        "id": 161770414,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553612775
    },
    {
        "content": "<p>we could extend StructureDefinition.fhirVersion so it is an NPM type version definition e.g. 3.0+</p>",
        "id": 161801774,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553633657
    },
    {
        "content": "<p>though i don't think that's quite the same</p>",
        "id": 161801787,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553633669
    }
]