[
    {
        "content": "<p>Hi, just starting out on the use of the Adverse Event HL7 message and we have already identified we will need extensions. Can anyone tell us how long it takes to get an extension registered please?</p>",
        "id": 202279648,
        "sender_full_name": "Patrick Shirley",
        "timestamp": 1593416316
    },
    {
        "content": "<p>For your project, you don't need to register extensions</p>",
        "id": 202280735,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593417399
    },
    {
        "content": "<p>(well, you may want to register it locally in your IG)</p>",
        "id": 202280753,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593417420
    },
    {
        "content": "<p>unless you want a standard extension, in which case the process would be to start this very discussion and describe what you need (others may need it to, or may help refine what is needed)</p>",
        "id": 202280790,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1593417463
    },
    {
        "content": "<p>If you think you need an extension, the first step is to check for existing extensions.  The second is to raise your specific use-case here.  It's possible there's already a 'standard' way or existing extension you can use.  If not, you may get advised to submit a change request for us to define a standard extension in the next release.  (The next release won't be out for another 1.5 years or so though.)  If you define your own extension, you need to ensure that the URL of the extension resolves to the extension, that the extension is registered in an appropriate public registry and/or that all downstream systems who might receive instances containing the extension have some other access to the definition of the extension.</p>",
        "id": 202314376,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593439989
    },
    {
        "content": "<p>Thanks for the replies. We are in the process of identifying where we need extensions and checking if any currently exist. It would be useful to run this past yourselves. We understand that to use the extended standard with our external community, we will need to register the extensions before we can use with our instance. How long does it take to register a new extension for public usage? Is it quicker to register for private usage first? Is that possible?</p>",
        "id": 202322108,
        "sender_full_name": "Patrick Shirley",
        "timestamp": 1593442675
    },
    {
        "content": "<p>You do not need to register an extension to use it</p>",
        "id": 202322264,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1593442727
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> is right. But if you additionally describe your use case to the community, others might </p>\n<ul>\n<li>tell you that they have an extension which you might use, or</li>\n<li>later know, that you already have an extension they might use.</li>\n</ul>\n<p>If the demand for some extensions becomes greater, they might be included in the set of standard extensions, like \"condition-dueTo\". But  there is no need to register an extension.</p>",
        "id": 202323073,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1593443044
    },
    {
        "content": "<p>Thanks, that is really interesting. Thanks for your help. We are finalising our use cases in the next day and should be able to share then. They will be on a spreadsheet. We will be interested to see if the number of extensions can be reduced.</p>",
        "id": 202327714,
        "sender_full_name": "Patrick Shirley",
        "timestamp": 1593445050
    },
    {
        "content": "<p>The requirement around extensions is that if you send an instance that contains an extension, the recipient must have access to the extension.  Options are:</p>\n<ol>\n<li>have the canonical URL resolve to the extension definition</li>\n<li>put the extension in a common public registry (e.g. <a href=\"http://registry.fhir.org\">registry.fhir.org</a>)</li>\n<li>communicate the extension definition to the receiving system in advance in some other way</li>\n</ol>\n<p>#2 is the fastest and easiest, however #1 is desirable if you can manage it.  #3 should only be used as a last resort - because it means extra work for both sender and receivers as well as all subsequent downstream receivers</p>",
        "id": 202373894,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1593468408
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>  Is there any plan to create a US extension registry? Case 1: DEA drug scheduling  &amp; other fairly official bits; Case 2: other process-specific things that US stakeholders agree to among themselves. Would that be ONC, NLM, CMS, HHS CIO, Argonauts, Logica?</p>",
        "id": 203962101,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1594823199
    }
]