[
    {
        "content": "<p>Are there any guidelines about/for/against adding an extension to a contained resource?<br>\nOur primary resource is Coverage and we have contained Patient/Beneficiary.  I would like to add an extension to the Patient Address for Address Use to denote that the address is confidential.  Is the extension part of the contained patient resource or the primary coverage resource?</p>",
        "id": 163511330,
        "sender_full_name": "Kate Dech",
        "timestamp": 1555452372
    },
    {
        "content": "<p>should be on the address, where ever it appears</p>",
        "id": 163511847,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555452867
    },
    {
        "content": "<p>There's  a standard extension for address for this purpose.</p>",
        "id": 163514022,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555454734
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/extension-iso21090-ad-use.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-iso21090-ad-use.html\">http://hl7.org/fhir/extension-iso21090-ad-use.html</a></p>",
        "id": 163514073,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555454765
    },
    {
        "content": "<p>Thank you.  We also have a need to denote that a phone number is considered confidential. Any standard extensions for contact point?</p>",
        "id": 163766437,
        "sender_full_name": "Kate Dech",
        "timestamp": 1555708688
    },
    {
        "content": "<p>no but a standard extension for this would be quite appropriate. <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> this is one case where it would appear that an element can have a confidentiality the exceeds the high water mark for the overall resource, and so that makes me wonder whether this isn't a general confidential code, but rather more specific security label like <a href=\"http://hl7.org/fhir/v3/ActCode/cs.html#v3-ActCode-DEMO\" target=\"_blank\" title=\"http://hl7.org/fhir/v3/ActCode/cs.html#v3-ActCode-DEMO\">http://hl7.org/fhir/v3/ActCode/cs.html#v3-ActCode-DEMO</a></p>",
        "id": 163766782,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555708989
    },
    {
        "content": "<p>This specific case seems more appropriate to think about putting that more sensitive data into another resource that points back at the Patient. That 'other' resource could then be easily protected at more confidential, while allowing Patient to be manipulated and viewed more normally. This method of segregating more sensitive information into their own Resource is a common REST model. It allows each resource to be then treated as one level of sensitivity. So rather than an extension, I would recommend a standalone resource. So, use Basic, and 'extend' basic to have a pointer to Patient, and an address.</p>",
        "id": 163898477,
        "sender_full_name": "John Moehrke",
        "timestamp": 1555933105
    },
    {
        "content": "<p>I'm not a huge fan of sticking sticking data like this into Basic - or even an extension.  Systems should already have an ability to strip data out of a resource if recipients aren't allowed to have it.  Sending \"standard\" data somewhere else is going to be useless except to systems that have specifically been designed to handle it.</p>",
        "id": 163906121,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555942094
    },
    {
        "content": "<p>The entities receiving it have a right to view the confidential address and phone per HIPAA.  The issue is that as the organization supply the information, we must denote that it is confidential (think safety sensitive situations) and even more safeguards must be put in place.</p>",
        "id": 163911414,
        "sender_full_name": "Kate Dech",
        "timestamp": 1555946726
    }
]