[
    {
        "content": "<p>For a simple extension (one with a single data point) should the cardinality of the value[x] property be 1:1 ? If not how does it work if the extension is used in a resource with a cardinality of 1:1 and the extension data point has a cardinality of 0:1?</p>",
        "id": 153846658,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1473242087
    },
    {
        "content": "<p>I agree you should set the cardinality of value[x] to 1..1, or it would make no sense. Couldn't find this in the text in the specs though.</p>",
        "id": 153846661,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1473244072
    },
    {
        "content": "<p>extensions that contain extensions do not have a value. That's why value is 0..1. If you have a simple extension, then you set value to 1..1</p>",
        "id": 153846667,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473251233
    },
    {
        "content": "<p>Regarding Extension cardinality, the new snapshot generator in the FHIR .NET API deals with extensions in resource profiles in the same way as other element type constraints. Starting with the extension element as inherited from the base resource, first the external extension (element type) profile is merged, and then any differential constraints on the extension element in the resource profile. So the cardinality in the referenced extension definition profile overrides the extension element cardinality specified by the base profile, and the referencing profile can override both by specifying inline differential constraints on the extension element. And as always, overrides can only constrain, not relax. This way, we have a consistent mental model and implementation logic for both ordinary type constraints and extensions. I hope this makes sense.</p>",
        "id": 153846680,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1473257160
    },
    {
        "content": "<p>what is the meaning of the cardinality column in the extension registry or in the Extension resource itself?<br>\ne.g. <a href=\"http://build.fhir.org/extension-iso21090-adxp-streetname.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-iso21090-adxp-streetname.html\">http://build.fhir.org/extension-iso21090-adxp-streetname.html</a> has 0..* Whats the meaning of this, what's the difference to the cardinality of the profile using the extension?<br>\nI couldn't find an explanation in the FHIR Doku.</p>",
        "id": 153859612,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1480600066
    },
    {
        "content": "<p>if you say that the extension cardinality is 1..1, then when you use the extension, you have to have a cardinality of 1..1 for it. If you say it's 0..*, then when you use the extension, it can have any cardinality you want</p>",
        "id": 153859645,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480617599
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> this is what we expected. Maybe this can be mentioned somewhere in the documentation?</p>",
        "id": 153859852,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1480666509
    },
    {
        "content": "<p>it is, surely. but, no, apparently not. Can you create a gForge task?</p>",
        "id": 153859870,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480675487
    },
    {
        "content": "<p>created <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12413\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12413\">G#12413</a></p>",
        "id": 153859886,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1480677927
    }
]