[
    {
        "content": "<p>We have two different classifications for drugs - a \"national\" and a \"VA\" classification. <br>\nWe are considering two designs to support populating FHIR.</p>\n<ol>\n<li>Two extensions, one for each legacy property</li>\n<li>One extension, specified twice in profile with different terminology bindings</li>\n</ol>\n<p>What are the pros and cons others have encountered between these patterns?</p>",
        "id": 180147109,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1573143002
    },
    {
        "content": "<p>Why are you using extension at all?  Why aren't they just additional codings?</p>",
        "id": 180148192,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573143642
    },
    {
        "content": "<p>OK, that makes sense. Thanks.<br>\nBut there are other cases of the question: we have, e.g., classifications of med \"type\" (similar to doseForm, e.g., SYRINGE, ADMIXTURE, CHEMOTHERAPY, PIGGYBACK, TPN, UNIT DOSE, but on the order not the med) that share some values: the pending inpatient has 10 values; finished IV has a subset; a third case has a different subset.  What design issues would help choose between more extensions or deferred bindings?<br>\nThis, too, could use core properties: med.product.form, assuming we can instantiate another resource. I'll look for another example, because there are some where a pattern would help.</p>",
        "id": 180551218,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1573586547
    },
    {
        "content": "<p>I have a concern about using a product code for a classification. That creates confusion. A product cannot be designated or identified by its classification(s).</p>",
        "id": 180564018,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1573594087
    },
    {
        "content": "<p>Medication code is there to identify a product. A classification does not identify a product</p>",
        "id": 180564167,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1573594188
    },
    {
        "content": "<p>Well, the product code will be there. The classifications will be additional, broader encodings, with different systems that should scope their use. Is there a problem with that?</p>",
        "id": 183008761,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1575931892
    }
]