[
    {
        "content": "<p>Basically in a DiagnosticOrder we need the subject's (Patient) coverage details. I guess the cleanest way to do it would be to add an Extension with valueReference pointing to that Coverage instance. The problem is that the business does not keep track of coverages in that way,  we don't need to build that resource. Is it acceptable to make a Coverage extension on Order, and if so what's the cleanest way to do so?</p>",
        "id": 153859373,
        "sender_full_name": "Jose Montoya",
        "timestamp": 1480548427
    },
    {
        "content": "<p>I might be misunderstanding you, but what about embedding a contained Coverage in a DiagnosticOrder?</p>",
        "id": 153859424,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1480553601
    },
    {
        "content": "<p>Yes, that's what we have planned now. Is that an acceptable practice?</p>",
        "id": 153859426,
        "sender_full_name": "Jose Montoya",
        "timestamp": 1480553671
    },
    {
        "content": "<p>That's the usecase contained resources are for. I think you'll be fine</p>",
        "id": 153859427,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1480553697
    },
    {
        "content": "<p>Great, we'll go ahead and do that then. Is contained resources a concept somewhere in the docs?</p>",
        "id": 153859429,
        "sender_full_name": "Jose Montoya",
        "timestamp": 1480553747
    },
    {
        "content": "<p>Yup, <a href=\"http://build.fhir.org/references.html#contained\" target=\"_blank\" title=\"http://build.fhir.org/references.html#contained\">here</a>. The first sentence there maps to your usecase from what I understand</p>",
        "id": 153859430,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1480553830
    },
    {
        "content": "<p>Pretty much exactly what I was looking for, many thanks.</p>",
        "id": 153859435,
        "sender_full_name": "Jose Montoya",
        "timestamp": 1480554347
    },
    {
        "content": "<p>That's awesome, happy to help</p>",
        "id": 153859486,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1480556600
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193086\">@Jose Montoya</span> You'll have to define an extension to point to the Coverage.  You can't have a contained resource that isn't referenced somehow by the containing resource.  Also, if you want to submit a change request, we should probably have a \"standard\" extension to allow referencing Coverage information from any request-type resource.</p>",
        "id": 153860996,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1480973283
    },
    {
        "content": "<p>Yes I did use an extension with a valueReference. I'd be happy to submit a request if you point me in the right direction.</p>",
        "id": 153861010,
        "sender_full_name": "Jose Montoya",
        "timestamp": 1480973860
    },
    {
        "content": "<p>At the bottom of each page in the spec there's a \"propose a change\" link.  You'll need to register for a user id (which is a manual process where we check that you seem like a real human), but once that's done, you can submit any requests for change that you like.</p>",
        "id": 153861025,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1480974296
    },
    {
        "content": "<p>I would like to see that invariant changed to support for the contained resource to reference the resource, as well as the resource referencing the contained.</p>",
        "id": 153861314,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1481063229
    },
    {
        "content": "<p>there's an outstanding task for that. It sounds nice, but it has nasty ramifications. perhaps this can be an agenda item in San Antonio</p>",
        "id": 153861320,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481064207
    }
]