[
    {
        "content": "<p>I am trying to understand the rules for path names of the Extension.value[x] in profiles (using DSTU2). The documentation for Open Type data states \"The element name ends with \"[x]\", and this is replaced with the Title cased name of the data type\". The Forge tool has output path=\"Extension.value[x]\" in the snapshot section, and path=\"Extension.valueReference\" in the differential. Is this correct? </p>\n<p>If so, more generally, should the differential hold the TitleCased name as referenced in the docs (<a href=\"https://www.hl7.org/fhir/dstu2/extensibility.html#extension\" target=\"_blank\" title=\"https://www.hl7.org/fhir/dstu2/extensibility.html#extension\">https://www.hl7.org/fhir/dstu2/extensibility.html#extension</a>) and the snapshot use the original name?</p>\n<p>Many thanks</p>",
        "id": 153890750,
        "sender_full_name": "Jonathan Mew",
        "timestamp": 1495460901
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193478\">@Jonathan Mew</span> this is obsolete behavior of an older Forge release. In the current Forge release (both DSTU2 and STU3), choice type elements are also renamed in the snapshot representation.</p>",
        "id": 153890754,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1495461898
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>, thank you very much for the clarification.</p>",
        "id": 153890755,
        "sender_full_name": "Jonathan Mew",
        "timestamp": 1495461975
    },
    {
        "content": "<p>The profile was generated on 15.4.1 (I am enquiring on behalf of NHS Digital). It seems that 15.4.0.0 is on the downloads page. Perhaps it will be updated for NHS Digital's version at a later point?</p>",
        "id": 153890756,
        "sender_full_name": "Jonathan Mew",
        "timestamp": 1495462186
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193478\">@Jonathan Mew</span>, we're not planning to publish any more community updates for the DSTU2 release of Forge, as we're now focusing our development efforts towards STU3. However we could create another DSTU2 hotfix for our commercial customers (such as NHS), if there is a need. Please feel free to contact me privately if you'd like to discuss the options.</p>",
        "id": 153890780,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1495468715
    },
    {
        "content": "<p>Thanks again - I'll see what they'd like to do and be in touch.</p>",
        "id": 153890781,
        "sender_full_name": "Jonathan Mew",
        "timestamp": 1495468961
    },
    {
        "content": "<p>you should be able to use Forge for STU3 to do DSTU3 profies</p>",
        "id": 153890782,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495469009
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> - that would mean using the R3 StructureDefinitions for R2 - what's the position regarding supporting these in Forge?</p>",
        "id": 153890783,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495469060
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, since Forge loads the core defs from XML, you can replace the official definitions with a custom XML (e.g. for DSTU2-on-STU3) and Forge will pick up the changes. However most users would need some assistance in order to get this to work and we don't have the time and resources to help out and/or improve the UX. Therefore, although theoretically possible, we do not officially support this. Of course, this could change if there is sufficient commercial demand.<br>\nNote that you can keep using the current Forge for DSTU2 release for as long as you need. But we won't release anymore (public) updates for the DSTU2 version.</p>",
        "id": 153890929,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1495539437
    },
    {
        "content": "<p>Hmmm. Let's drum up some commercial demand then...</p>",
        "id": 153890942,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1495543199
    }
]