[
    {
        "content": "<p>I'm modeling a mechanism for storing the raw data captured by a device into an observation. The use case is that all the essential information is to be described in the Observation itself according to suitable profiles, but in addition to the widely relevant data we'd like also to store the raw data, as it contains data that only very specialized software may be interested in. There may be many details in the raw data describing how the data was captured, details of the device or the environment it was used in, etc.,  and we just don't feel describing all of that in well described FHIR profiles is worth the effort at this time. So we'd like to just store the raw data and allow software that's able to parse it to work with it, and think of perhaps extending the profiles to cover more of that data in the future. But for now, just storing the raw data with the Observation seems sensible.</p>\n<p>Currently an extension to the Observation seems the most logical solution for this.</p>\n<p>I then thought that surely this is not the first case where something like this has come up, and tried to search the internet (Zulip, Simplifier, Google, ...) for extensions for raw data, or original data. I wasn't able to find any.  Am I just missing the correct term that's being used for \"raw data\"?</p>",
        "id": 159406506,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1551168405
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191693\">@Jacob Andersen</span> - aint that your turf?</p>",
        "id": 159406532,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1551168451
    },
    {
        "content": "<p>Not really. My approach (more or less successful so far) has been to try to model even the specialized details as either related Observations or Observation components in a meaningful way. In the cases I have been involved in, this included a data model based on the IEEE 11073-20601 Domain Information Model (possibly with user-defined MDC codes when no relevant MDC code already existed) and a Personal Health Device FHIR IG-based mapping (<a href=\"http://hl7.org/fhir/uv/phd/\" target=\"_blank\" title=\"http://hl7.org/fhir/uv/phd/\">http://hl7.org/fhir/uv/phd/</a> ) to FHIR.</p>\n<p>But if the raw data is only intended for a single recipient (specialized software), it may not make sense to do all this work. In that case and extension would probably be a better match.</p>",
        "id": 159423880,
        "sender_full_name": "Jacob Andersen",
        "timestamp": 1551188179
    },
    {
        "content": "<p>How big is the raw data likely to be?</p>",
        "id": 159430878,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551193682
    },
    {
        "content": "<p>this sounds like a DocumentReference and pointed to from the derivedFrom element.</p>",
        "id": 159431236,
        "sender_full_name": "Eric Haas",
        "timestamp": 1551193961
    },
    {
        "content": "<p>docref as a container for binary data.  I am assuming this raw data is not the observation itself.   If it is then I’ll like to know more about the use case since we are mulling over bringing back a valueAttachment element to capture binary as the observation value</p>",
        "id": 159431416,
        "sender_full_name": "Eric Haas",
        "timestamp": 1551194097
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> typically a simple JSON object with 2-10 fields.</p>",
        "id": 159434981,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1551197086
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> the data is the Observation itself. For instance a measurement from a Continuous Glucose Monitor:</p>\n<div class=\"codehilite\"><pre><span></span>{\n  &quot;_id&quot;: &quot;5c690e9755418687ac3bbd2a&quot;,\n  &quot;device&quot;: &quot;xDrip-LimiTTer&quot;,\n  &quot;date&quot;: 1550388885861,\n  &quot;dateString&quot;: &quot;2019-02-17T09:34:45.861+0200&quot;,\n  &quot;sgv&quot;: 97,\n  &quot;delta&quot;: -3.347,\n  &quot;direction&quot;: &quot;Flat&quot;,\n  &quot;type&quot;: &quot;sgv&quot;,\n  &quot;filtered&quot;: 119999.991,\n  &quot;unfiltered&quot;: 119999.991,\n  &quot;rssi&quot;: 100,\n  &quot;noise&quot;: 1,\n  &quot;sysTime&quot;: &quot;2019-02-17T09:34:45.861+0200&quot;\n}\n</pre></div>\n\n\n<p>or even a MedicationAdministration entry from a bolus calculator or an automated insulin delivery system:</p>\n<div class=\"codehilite\"><pre><span></span>{\n  &quot;_id&quot;: &quot;5c53461681556a386830f067&quot;,\n  &quot;eventType&quot;: &quot;Temp Basal&quot;,\n  &quot;duration&quot;: 15,\n  &quot;percent&quot;: 10,\n  &quot;rate&quot;: 0.715,\n  &quot;created_at&quot;: &quot;2019-01-31T19:01:42Z&quot;,\n  &quot;enteredBy&quot;: &quot;openaps://AndroidAPS&quot;,\n  &quot;NSCLIENT_ID&quot;: 1548961302122,\n  &quot;carbs&quot;: null,\n  &quot;insulin&quot;: null\n}\n</pre></div>\n\n\n<p>But the point is that we want to capture the relevant data as FHIR, for instance in the valueQuantity for the observation. But in addition to that, store the original raw data to parties that are interested in it. So I wouldn't be storing that CGM data as the valueAttachment. I could consider storing it as a DocumentReference.</p>",
        "id": 159435887,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1551197807
    },
    {
        "content": "<p>It sounds to me that what you are describing is the observation is derivedFrom the raw data so capturing as binary using DocRef and link to Observation using the derivedFrom element is what I recommend</p>",
        "id": 159441068,
        "sender_full_name": "Eric Haas",
        "timestamp": 1551201943
    }
]