[
    {
        "content": "<p>Hi, just doing some FHIR data models for genomic tests.<br>\nI can see in a ProcedureRequest that I might have a code saying \"do a whole exome germline test\".. but it seems like there are other 'extra' details to a test that would be orthogonal to the code. Some that spring to mind, \"what sort of computation level do you want to use for the analysis pipeline i.e. big server, small server\", \"a ranked list of genes to investigate for curation\", \"use curation tool X not Y\". I'm not sure where exactly this kind of data goes. I would have thought this was a reasonably common pattern across all sorts of (non genomic) test requests (that the 1..1 code needs to be augmented with some extra details about preferred lab equipment or technique etc). <br>\nWhere do people put that info? Is there a common pattern to its modelling?<br>\nDoes it all just go into supportingInfo (which I was reserving for clinical supporting info). Or do I do an extension? Or have I missed a really obvious field?<br>\nThanks</p>",
        "id": 153918414,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1510206633
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> ?</p>",
        "id": 153918464,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510230670
    },
    {
        "content": "<p>Being able to provide further qualification on equipment to use, technique to use, etc. will be pretty common, not just for genetics</p>",
        "id": 153918465,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510230749
    },
    {
        "content": "<p>Have trackers to address this.   ( instructions ) Have not had chance to work on it though  Suggestions for elements welcome. <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12966\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12966\">GF#12966</a></p>",
        "id": 153918521,
        "sender_full_name": "Eric Haas",
        "timestamp": 1510247120
    },
    {
        "content": "<p>I wouldn't necessarily have mixed those together, but very well :)  I think most of the requirement could be handled with a name-value pair set of qualifiers (with support for coded and quantitative values).  The piece that wouldn't work as well is the ranked list of genes.  For that, the value would need to repeat in addition to being polymorphic - which would mean an additional layer of nesting.</p>",
        "id": 153918530,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510248268
    },
    {
        "content": "<p>Thanks  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>   could you clarify with an example?  I'm not understanding what you mean and if the same could not be handled by text.  And I'd lump details in with instructions since I think they overlap quite a bit.</p>",
        "id": 153918540,
        "sender_full_name": "Eric Haas",
        "timestamp": 1510249240
    },
    {
        "content": "<p>It may well be that the 80% is handled with text instructions.  I think there will be situations where people want their qualifiers to be computable, but perhaps we relegate that to extensions.</p>",
        "id": 153918541,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510249443
    },
    {
        "content": "<p>This sounds like what I requested in <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14000\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14000\">GF#14000</a> (Request pattern) and <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14002\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14002\">GF#14002</a> (specific to ServiceRequest resource).</p>",
        "id": 153918645,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1510263714
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I'm not a genomics expert but to give you an example as I understand it.. <br>\nThe clinician is wanting a exome test (there's a loinc code for that), and then based on what they observe about the patient - perhaps in conjunction with a genetics expert at the lab that is doing the test - they'll agree upon a list of genes that are to be particularly looked - and this is something that needs to be specified in the ServiceRequest.<br>\nSo if they suspect Alagille Syndrome they might indicate the test should look at JAG1, NOTCH2.. but potentially there might be a variety of suspected conditions so they could combine gene lists from multiple conditions and end up with ADSL, SYT1, JAG1, NOTCH2. So this is essentially a list of HGNC coded values. And the system that is processing the request will use the gene list to perform filtering on the potentially 10s of thousands of variants found (so free text instructions aren't really appropriate)<br>\nIt's possible that this is specialised enough that it just needs to be done as an extension.</p>",
        "id": 153918754,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1510287225
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . I think those trackers are pretty much aligned with what I want to do for some other stuff (instructions for what machine to use for analysis etc). I'll keep an eye on the trackers, but probably will just do an extension in the short term.</p>",
        "id": 153918755,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1510287308
    },
    {
        "content": "<p>I referenced michelle's tracker with instructions/details tracker as well.    I'm thinking the gene list is an extension too.</p>",
        "id": 153918758,
        "sender_full_name": "Eric Haas",
        "timestamp": 1510289554
    }
]