[
    {
        "content": "<p>Hello,</p>\n<p>In CCDA/FamilyHistory Template we get an id for the subject  which typically represents an identifier for the FamilyMember. Is there an equivalent element in FamilyMemberHistory resource in FHIR?</p>",
        "id": 206996450,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1597451557
    },
    {
        "content": "<p>FamilyMemberHistory.identifier?</p>",
        "id": 207796164,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598224883
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194285\">@Tushar Nair</span>  From what i can see the answer is no - for the \"FamilyMember\" there is the provision to carry a relationship and a name - but no identifier.</p>",
        "id": 207945049,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1598351017
    },
    {
        "content": "<p>How is this not FamilyMemberHistory.identifier?</p>",
        "id": 207963221,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598362558
    },
    {
        "content": "<p>Isn't the identifier for the history record? That's what it says in Requirements: Allows identification of the family member history. It seems that a link to Person might be a better way to have an obvious identifier for the family member, and not the history record.</p>",
        "id": 207965607,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1598363777
    },
    {
        "content": "<p>Person is a linkage resource for Patient, RelatedPerson and Practitioner.  Nothing is allowed to point to it directly.</p>",
        "id": 207976819,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598368769
    },
    {
        "content": "<p>Generally, a given family member would only have one FamilyMemberHistory instance</p>",
        "id": 207976860,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598368788
    },
    {
        "content": "<p>So the identifier <em>should</em> correspond to a single individual.  (If you had multiple CDA documents, the identifier there could be different too.)</p>",
        "id": 207976982,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598368824
    },
    {
        "content": "<blockquote>\n<p>So the identifier should correspond to a single individual. (If you had multiple CDA documents, the identifier there could be different too.)</p>\n</blockquote>\n<p>In the C-CDA case you have subject/relatedSubject@class=\"PRS\"/subject/id. The identifier is on the Person level, not on the history level. If the source of the multiple C-CDA is the same, the identifier should be the same. If the source of the CCDA is different, there is a chance that there is a common identifier, e.g. a driver's license, on the person level.</p>\n<p>I think that without a special guidance, FamilyMemberHistory.identifier is unlikely to match what is in the CCDA. A link from FamilyMemberHistory to RelatedPerson is probably a better match.</p>",
        "id": 207982300,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1598371397
    },
    {
        "content": "<p>It seems that all of the demographics fields and the relationship field in FamilyMemberHistory would be better represented by a required reference to RelatedPerson. Or a choice between RelatedPerson and a BackboneElement of FamilyMemberDemographics (with an added identifier field).</p>",
        "id": 207983244,
        "sender_full_name": "Benjamin Flessner",
        "timestamp": 1598371849
    },
    {
        "content": "<p>A RelatedPerson is someone who's expected to take action on a Patient's behalf - which is unlikely to be Great Aunt Sue who died 30 years ago.  If you're wanting to tie a FamilyMemberHistory to the Patient record associated with that relative, there's an extension for that.</p>",
        "id": 207995550,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598377284
    }
]