[
    {
        "content": "<p>We are working through some initial discussions around how we can properly leverage the FamilyMemberHistory resource. A few questions:</p>\n<ol>\n<li>We have a workflow where a clinician can check a box at the overall Family History component for \"Unknown\" or \"Negative\" (i.e. no critical family history - everyone is healthy!) or \"Unable to Obtain\". When one of these boxes is selected, the user cannot add a family member so there will be no relationship. Since FamilyMemberHistory.relationship is 1..1, is it appropriate to expose the FAMMEMB (family member) code in these scenarios? Or do you have other suggestions on how we can meet the spec requirements for this workflow</li>\n<li>Status is essentially at the relationship level. I would expect there may be a scenario where the mother's history has a condition wrongly added and therefore removed. We wouldn't want the entire relationship to be 'entered-in-error' but we may want to reflect that the status of the condition has changed. Any thoughts?</li>\n<li>We have a workflow where a condition can be added to a family member as NEGATIVE. For instance, my grandpa had colon cancer (positive condition) but my father did not (negative condition). If I'm understanding the resource, we would not be able to represent these negative conditions - let me know if I'm missing anything.</li>\n</ol>",
        "id": 230530782,
        "sender_full_name": "Brittany Brown",
        "timestamp": 1615907801
    },
    {
        "content": "<ol>\n<li>If you're not making an assertion about a specific family member, you'd just capture an Observation.  FamilyMemberHistory is only intended to represent information about specific individuals</li>\n<li>That's a general issue in FHIR.  Any component of a resource could be wrong.  You have a choice: Flag the whole record as \"in error\" or update the record to correct it.  We don't typically support saying \"this phone number was in error\" or \"this observation component was in error\".  Family member condition is no different.  That doesn't mean we <em>couldn't</em> do this on a per element basis for certain elements if we determine that's a broadly supported capability</li>\n<li>Yes, that's missing.  Sounds like a good thing to add as a change request.  In the interim, you'd need a modifierExtension.</li>\n</ol>",
        "id": 230535872,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615909483
    },
    {
        "content": "<p>Thanks for the quick response! We will talk it over and post any additional questions that come up.</p>",
        "id": 230536659,
        "sender_full_name": "Brittany Brown",
        "timestamp": 1615909737
    }
]