[
    {
        "content": "<p>Orders and Observations Workgroup is seeking input from implementers on whether you using the DiagnosticReport for the following in production or in active development for the following domains:</p>\n<ul>\n<li>Anatomic Pathology/ Histopathology / related disciplines</li>\n<li>Imaging Investigations (x-ray, CT, MRI etc.)</li>\n<li>Other diagnostics - Cardiology, Gastroenterology etc</li>\n</ul>\n<p>Please let me know also to the country or region would be helpful.</p>",
        "id": 153868421,
        "sender_full_name": "Eric Haas",
        "timestamp": 1484848662
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> This isn't an answer to your question,  but Imaging Integration WG expects that diagnostic imaging will use DiagnosticReport. (cc <span class=\"user-mention\" data-user-id=\"191960\">@Brad Genereaux</span>)</p>",
        "id": 153868447,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1484859559
    },
    {
        "content": "<p>Can you look at <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9671\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9671\">GF#9671</a> which has AP input and would that work for imaging?</p>",
        "id": 153868450,
        "sender_full_name": "Eric Haas",
        "timestamp": 1484860766
    },
    {
        "content": "<p>Most of those relationships are from the newer report to the older one. But how does \"extends\" work? all siblings point to all others?<br>\nIt also seems possible that you could use these relationships to create a real rat's nest of related reports. I don't suppose we can do anything around that in the standard though.</p>",
        "id": 153868456,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1484862556
    },
    {
        "content": "<p>Imaging doesn't deal with this kind of complexity between reports?</p>",
        "id": 153868457,
        "sender_full_name": "Eric Haas",
        "timestamp": 1484862775
    },
    {
        "content": "<p>I don't have experience with sibling reports. But that doesn't mean they don't exist in imaging.<br>\nAs for the rat's nest, it was the cardinality of the links that caught my eye. \"A\" replacing \"B\" seems simple. \"A\" replacing \"B\" and \"C; or \"A\" and \"B\" replacing \"C\" is the level of complexity that I was wondering about.</p>",
        "id": 153868475,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1484866124
    },
    {
        "content": "<p>Asking around the room, I think Radiology practice is different from the pathology practice documented in the tracker item. We don't see need for anything beyond replace and addendum. However, our clinical reporting specialist is on his way home, so I can't offer a definitive response.</p>",
        "id": 153868476,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1484866916
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Apologies for the delay in response.<br>\nFYI - the Royal College of Pathologists of Australasia (RCPA) have been working with <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and the Australian Digital Health Agency to develop some structured cancer reporting FHIR artefacts - <a href=\"http://fhir.hl7.org.au/fhir/rcpa/index.html\" target=\"_blank\" title=\"http://fhir.hl7.org.au/fhir/rcpa/index.html\">http://fhir.hl7.org.au/fhir/rcpa/index.html</a><br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> has been developing tools to enable the work to progress and at this stage there are some public and private pathology providers trialing the work to send some reports to a cancer registry.  <br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> may have had discussions with the RCPA on the next likely developments, but he knows all about the project and has been a key developer.<br>\nWe haven't looked at Imaging investigations or other diagnostics, though <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> may have ideas.  :)</p>",
        "id": 153869309,
        "sender_full_name": "David McKillop",
        "timestamp": 1485476052
    }
]