[
    {
        "content": "<p>Hi, what the reason to do all this linking in Claim Resource  (careTeamLink, diagnosisLink etc). This makes Claim resource \"hard to work with\" - we have to deal with graph structure. Why not just embed this information into <code>item</code> element: <code>Claim.item.diagnoses</code> or  <code>Claim.item.careTeam</code></p>",
        "id": 153927065,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1514369556
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>?  (I'm not clear on this myself - it seems these should be able to be references as those are the standard way of linking to resources everywhere else.  The minor savings of integer vs. URL doesn't justify the added overhead of a completely new way of referencing.)</p>",
        "id": 153927074,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1514394521
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191318\">@nicola (RIO/SS)</span> I'm not clear as to why this would be hard. its a pattern used elsewhere. We could repeat the complete subclasses (careTeam, diagnosis, etc) the for each item but that would make things like searching for claims for a given diagnosis or involving a given practitioner more difficult - its always a trade off. Please come to an FM conference call or the Wednesday meeting at the WGM to discuss.</p>",
        "id": 153927362,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1514700124
    },
    {
        "content": "<p>Why would it be hard if it's a Reference - that's just a URL?</p>",
        "id": 153927363,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1514702069
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> \"its a pattern used elsewhere\"   outside of  a FM resource where?</p>",
        "id": 153927368,
        "sender_full_name": "Eric Haas",
        "timestamp": 1514724499
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> But it isn't an url its a subclass.  If the suggestion is to create separate careTeam or other subclasses on each item element then a search for provider would require examining the careTeam subclass on each item rather than searching within a single careTeam subclass.<br>\n<span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> questionaire/questionaireResponse use linkids.</p>",
        "id": 153927408,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1514883524
    },
    {
        "content": "<p>I don't understand what you mean by \"subclass\".  For diagnosis, you're pointing to either a Condition or CodeableConcept.  For CareTeam you're pointing to Practitioner (which means the element is misnamed - CareTeam in FHIR refers to a group and element names are expressed in the singular); procedure you're pointing to Procedure or CodeableConcept; I have no clue what you're pointing to for \"information\" because the spec doesn't make that clear.  Yes, you've defined extra information about the condition, pracitioner or procedure, but each should only be listed once at the root, so you can still handle it with a resource reference or just by stating the code again - you don't need to link with integers.</p>",
        "id": 153927428,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1514905679
    },
    {
        "content": "<p>With QuestionnaireResponse.linkId, we're linking across resource instances to something that isn't itself a resource instance.</p>",
        "id": 153927429,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1514905710
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I think you are suggesting several things:<br>\n1) That it would be better to name the 'careTeam' subclass to 'provider' as it is a list of providers. <br>\n2) Where a reference or a code could be used to scan through the subclass, such as diagnosis or provider or procedure, to locate the subclass instance rather than using a link to a sequence number or other content in the subclass. I agree this can work as long as the contents of the linking element is unique, ie. for diagnosis as long as there aren't multiple claim.diagnosis instances which contain the same claim.diagnosis.diagnosis.</p>\n<p>so instead of the current element: </p>\n<p>definition<br>\nitem.diagnosis 0..* positiveInt</p>\n<p>example<br>\n&lt;item&gt;<br>\n  &lt;diagnosisSequence value=\"3\"/&gt;<br>\n  ...<br>\n&lt;/item&gt;</p>\n<p>we would have:<br>\ndefinition</p>\n<p>item.diagnosis 0..* CodeableConcept | Reference(Condition)</p>\n<p>example<br>\n&lt;item&gt;<br>\n  &lt;diagnosisCodeableConcept&gt;<br>\n      &lt;coding&gt;<br>\n         &lt;system value=\"http://hl7.org/fhir/sid/icd-10\"/&gt;<br>\n         &lt;code value=\"123456\"<br>\n      &lt;/coding&gt;<br>\n  &lt;/diagnosisCodeableConcept&gt;</p>\n<p>or<br>\n  &lt;diagnosisReference&gt;<br>\n      &lt;reference value=\"Condition/AB12345\"/&gt;<br>\n  &lt;/diagnosisReference&gt;<br>\n  ...<br>\n&lt;/item&gt;</p>",
        "id": 153927505,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1514963846
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191318\">@nicola (RIO/SS)</span> <br>\nWe've had the same issues with Claim. <br>\nWe understand the Claim as a kind of Document, where all information is somehow \"embedded\" rather than referenced. Invoice is aiming to be knit more tightliy into the whole preceding (FHIR-based) workflow.<br>\nMaybe the draft for the Invoice Resource which collects ChargeItems might be a better fit for your use case? <br>\n<a href=\"http://build.fhir.org/invoice.html\" target=\"_blank\" title=\"http://build.fhir.org/invoice.html\">http://build.fhir.org/invoice.html</a><br>\n<a href=\"http://build.fhir.org/chargeitem.html\" target=\"_blank\" title=\"http://build.fhir.org/chargeitem.html\">http://build.fhir.org/chargeitem.html</a></p>",
        "id": 153927519,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1514987347
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> Are there situations where having the same diagnosis or practitioner multiple times could make sense?</p>",
        "id": 153927529,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1514996422
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Perhaps on diagnosis (eg. admitting and discharge), certainly on practitioner (eg. primary and assisting).</p>",
        "id": 153927598,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1515065333
    },
    {
        "content": "<p>And the applicability of the diagnosis or practitioner for the item would be dependent on the use of the diagnosis or function of the practitioner and the relevant diagnosis use or practitioner function wouldn't be inferrable from the item?</p>",
        "id": 153927607,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515079641
    },
    {
        "content": "<p>Hi all,<br>\nAs you are most painfully aware, I'm not technical so much of this thread I don't understand.  </p>\n<p>The US does make the delivery and payment of health care exceedingly complex and includes that level of complexity into the claims that are sent from a provider to a payer.  I've never had a developer tell me they made a lot of good sense or were straightforward. in addition, a claim sent stands as a legal document - providers can go to jail or pay some steep fines/penalties, lose contracts depending on what they put in them.  So, from a payer perspective, I never 'infer'. </p>\n<p>So in response to the 'inferable from the item' note above, I believe the response is no.<br>\nHere's one example:  In the case of a 200 or 300 line claim, I can have a provider who is credentialed as an OB or a GYN or as an OB/GYN. There are services/procedures that can or cannot be performed by that provider depending on that credentialing. If the provider in the previous sentence is overseeing a student (the provider is acting as a Supervising Physician to the student), the student can only perform the services/procedures the Supervising Physician can. BUT that same student can perform services under a different Supervising Physician - for the same patient, within the same Dates on the same claim. So each claim line must be associated with a DX, procedure, the student physician AND the Supervising Physician and each must be identified as to the role they are performing for that claim line/expense/procedure/service...</p>\n<p>In addition, those relationships can change the outcome of the claim adjudication process - i.e., the patient can end up paying more (or less).</p>\n<p>MaryKay</p>",
        "id": 153927671,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1515098366
    },
    {
        "content": "<p>I am trying to synthesize some records for a demonstration I am working on.  I have two sides of my demo.  On the one side I am getting an EOB resource from a Payer system.  From the other side I am getting Clinical Resources from a Provider System.  I have synthetic data from the Payer System for N# of Personas.  Similarly I have K# of personas from the Provider system.  </p>\n<p>What I am trying to do is map resources from the Provider system into EOBs and go from EOBs backward to clinical resources.</p>\n<p>I suspect that the Claim resource is the pivot artifact for me to make this happen but I can't find a mapping that tells me which data elements originate from where.  My assumption (which may be sophomoric) is that Clinical Resources map to Claims Resources which Map to EOB resources.  </p>\n<p>Does anyone have these mappings documented that I can use?  Is it published somewhere else already?  TY</p>",
        "id": 153940126,
        "sender_full_name": "Aaron Seib",
        "timestamp": 1519403567
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 153940128,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519404194
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194138\">@Aaron Seib</span> I don't understand what you are trying to achieve so it is hard for me to comment on how you are trying to achieve it. I'm also not sure that what you are doing represents a use case which normally occurs or which we sought to support.</p>\n<p>In general clinical information is recorded, goods and services are provided and claims to insurers for a subset of services occur, as do bills to patients. And clinical information may or may not be provided to insurers as data elements or as resources referred to in the Claim, or as a Communication which may or may not refer to the Claim or through out of band communication - for example the insurer may have access to the patients clinical data so that it can fulfill its own clinical data needs. The EOB refers to the Claim, so you can tie some of this together, but won't general contain or refer to clinical resources.  </p>\n<p>You will only be able to relate clinical resources to claims where the clinical information is provided expressly by the provider for that Claim - not when the exchange is out of bounds or the insurer has independent access to clinical information. You will also not be able to link clinical data which the insurer already has to other claims for which that data was not additionally supplied or requested. </p>\n<p>You also can't assume that clinical data supplied but NOT requested by the insurer is relevant in the eyes of the insurer - providers often over-supply data to minimize the likelihood of downstream questions which helps to minimize delays in settlement.</p>\n<p>In summary you will know some of the relations from clinical to financial but not all and have no measure of the proportion, AND have no sense if any of the relations are relevant - you will have a partial model of 'I thought you wanted this'.</p>",
        "id": 153940168,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1519415187
    },
    {
        "content": "<p>I'd welcome a chance to talk about the concept - sounds like that might be easier to do on the phone?</p>",
        "id": 153940169,
        "sender_full_name": "Aaron Seib",
        "timestamp": 1519415363
    },
    {
        "content": "<p>Sure, which time zone are you in?</p>",
        "id": 153940171,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1519415415
    },
    {
        "content": "<p>Eastern - how about you?</p>",
        "id": 153940172,
        "sender_full_name": "Aaron Seib",
        "timestamp": 1519415436
    },
    {
        "content": "<p>Middle East 8-9 hours later, how is Monday at 12 or 1PM?</p>",
        "id": 153940173,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1519415568
    },
    {
        "content": "<p>That would be great - I sent you an email with my dial in info.</p>",
        "id": 153940174,
        "sender_full_name": "Aaron Seib",
        "timestamp": 1519415632
    },
    {
        "content": "<p>Talk with you then.</p>",
        "id": 153940175,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1519415654
    },
    {
        "content": "<p>TY</p>",
        "id": 153940176,
        "sender_full_name": "Aaron Seib",
        "timestamp": 1519415793
    }
]