[
    {
        "content": "<p>I wasn't sure where to post this. The UK are looking into the idea of running a UKCore for FHIR profiles and guidance documents, along the lines of the US FHIR Core (<a href=\"https://www.hl7.org/fhir/us/core/\" target=\"_blank\" title=\"https://www.hl7.org/fhir/us/core/\">https://www.hl7.org/fhir/us/core/</a>), and(or) the Australian Base (<a href=\"http://build.fhir.org/ig/hl7au/au-fhir-base/\" target=\"_blank\" title=\"http://build.fhir.org/ig/hl7au/au-fhir-base/\">http://build.fhir.org/ig/hl7au/au-fhir-base/</a>). I wondered whether those that set up these sites have any lessons learnt that may be useful, and whether the users of these sites have any comments on the upsides and downsides of having a national FHIR Core?</p>",
        "id": 177728091,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1570636548
    },
    {
        "content": "<p>My advice: Don't put must supports in your National Core, just code sets, required national identifiers, etc.  Must supports presume a particular pattern of use.</p>",
        "id": 177728272,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1570636652
    },
    {
        "content": "<p>There's value in having mustSupports when you start looking at the 'core' as a base for EHRs exposing data for SMART on FHIR, CDS Hooks and similar solutions.  But if you're looking for data sharing that isn't EHRs exposing patient-identifiable data, then having a looser set is reasonable</p>",
        "id": 177747927,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570649638
    },
    {
        "content": "<p>Canada's working on the same thing and Grahame has some draft work he proposed to present in February that suggests a foundational \"international core\" that would set patterns for the various national core specs and would encourage consistency that would make the lives of app developers who want to work across borders a bit easier.</p>",
        "id": 177748020,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570649695
    },
    {
        "content": "<p>I believe that there has been some work around versioning &amp; versioning strategies in relation to the FHIR Community initiative. If so, could someone point me in the direction of further information - thanks</p>",
        "id": 177814716,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1570717477
    },
    {
        "content": "<p>I'm not sure what you're referring to when you link those things?</p>",
        "id": 177872028,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570760417
    },
    {
        "content": "<p>General information on the FHIR Community Process is found here: <a href=\"https://wiki.hl7.org/index.php?title=FHIR_Community_Process\" target=\"_blank\" title=\"https://wiki.hl7.org/index.php?title=FHIR_Community_Process\">https://wiki.hl7.org/index.php?title=FHIR_Community_Process</a>. It has general information (not specifically for your country-wide examples) on how to come to and publish an Implementation Guide (like those sites you refer to). The site is still in development, so comments are welcome.<br>\nFurther information on what Implementation Guides should adhere to is found here: <a href=\"https://wiki.hl7.org/FHIR_Implementation_Guide_Publishing_Requirements\" target=\"_blank\" title=\"https://wiki.hl7.org/FHIR_Implementation_Guide_Publishing_Requirements\">https://wiki.hl7.org/FHIR_Implementation_Guide_Publishing_Requirements</a>. The relevant sections depend on whether you want the IG to be published and balloted on <a href=\"http://hl7.org/fhir.org\" target=\"_blank\" title=\"http://hl7.org/fhir.org\">hl7.org/fhir.org</a> like the examples you gave.</p>",
        "id": 177885605,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1570780396
    }
]