[
    {
        "content": "<p>Does anyone have experience of representing the transcript of an encounter as a FHIR resource? E.g. what was said by each party in the encounter. I'm looking at a few options:</p>\n<ul>\n<li>Questionnaire, with single responses to each question. This is difficult to link back to Encounter</li>\n<li>QuestionnaireResponse, perhaps using an extension for the question.</li>\n<li>A pair of QuestionnaireResponse and Questionnaire, making a somewhat arbitrary choice as to who is the questioner and who is the respondent (probably patient as respondent). This feels a bit heavyweight</li>\n<li>Something else, like ClinicalImpression or ??<br>\nI'm also wary that down the track I might need to track transcripts involving more than one participant (more than one care provider, or perhaps relatedpersons)</li>\n</ul>",
        "id": 204162359,
        "sender_full_name": "Jim Steel",
        "timestamp": 1594948583
    },
    {
        "content": "<p>QuestionnaireResponse lets you capture both Question and answer.</p>",
        "id": 204169665,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594960083
    },
    {
        "content": "<p>Ah, so it does. That probably makes it the best candidate, with practitioner statements as questions and patient statements as response. I guess if I need multiparty (&gt;2) conversations, I'll have to use extensions to differentiate which actor is either asking the question or providing the response.</p>",
        "id": 204174551,
        "sender_full_name": "Jim Steel",
        "timestamp": 1594967616
    },
    {
        "content": "<p>The other possibility is to use DocumentReference and just capture it as a 'note'</p>",
        "id": 204224888,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595001796
    },
    {
        "content": "<p>Yeah, that's a fallback. I'd have to put my own structured representation in there to do analysis on it afterwards (which we do need to do), and doing that completely outside of FHIR makes me feel unclean ;)</p>",
        "id": 204290331,
        "sender_full_name": "Jim Steel",
        "timestamp": 1595059294
    }
]