[
    {
        "content": "<p>Hello All,<br>\nI am really curious about the integration of both BPM Engine and FHIR. I have seen the relative slide on this topic but I didn't understand much out of it. I just know that there is PlanDefinition that somehow work with BPM engine. Can anyone please guide me or help me to figure out. for example, I have a use case that I want to place an appointment with the doctor using BPM Engine and having FHIR integrated with the BPM Engine. </p>",
        "id": 153870427,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1486448064
    },
    {
        "content": "<p>I'm not sure I understand the question. Can you provide some more detail on how you have a BPMN engine that places an appointment with the doctor? Do you already have an implementation in place that does this, and you want to know how to represent that in FHIR?</p>",
        "id": 153870645,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1486505591
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> for example my scenario is if I am using an open source BPM engine that is also rest based and can be consumed from any app and there is a FHIR server that is also rest based and can be consumed from any app. Now if I have to make an EHR based on FHIR and I want all the processes in the EHR to be done using BPM processes. Now the three things in the picture FHIR Server, BPM Engine Server both rest based and my APP interacting with both. Now what comes in my mind is that If I have to make an appointment in my system I'll request an appointment in my app that will initiate the process of appointment in the BPM and a script in the step of BPM process will call the FHIR server for appointment this is how I think the integration will be but I am not sure about that. There is plan definition in FHIR and some stuff about workflow that is I am not understanding I just saw a slide about that no tutorials no examples.</p>",
        "id": 153870697,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1486529143
    },
    {
        "content": "<p>I've done a little work with this with Activiti. I kept it all as FHIR, so if the BPM engine wanted to send out a document I did the mapping to FHIR in the BPM engine and called a FHIR endpoint. If an external system wanted to start a process (say ReferralRequest), a facade on the BPM would convert that resource to a (activiti) task.</p>",
        "id": 153870869,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1486648122
    },
    {
        "content": "<p>What is the meaning of converting fhir resource to BPM task?<br>\nWhat is PlanDefinition is what is the purpose of it? in the fhir? </p>",
        "id": 153871203,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1486984121
    },
    {
        "content": "<p>PlanDefinition supports the description of various types of knowledge artifacts, including protocols, order sets, and event-condition-action rules. Such definitions could be automated by transforming them to BPMN definitions. See the examples in the spec for illustrations of each of these types of artifacts.</p>",
        "id": 153871229,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1487000636
    },
    {
        "content": "<p>So, PlanDefinition is a definition or a plan to perform a task in FHIR and it contains a collection of Actions and each action defines activity in terms of ActivityDefinition.<br>\nAnd we can execute a process within FHIR using operations like $process-start, $finish-task etc.</p>\n<p>I HAVE NOT SEEN THE TRANSFORMATION FROM PlanDefinition to BPMN definitions? kindly refer me to any examples </p>\n<p>And there is also Task resource how it relates with PlanDefinition?</p>",
        "id": 153871577,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1487156284
    },
    {
        "content": "<p>And kindly tell me in (<a href=\"http://hl7.org/fhir/2017Jan/workflow.html#optionh\" target=\"_blank\" title=\"http://hl7.org/fhir/2017Jan/workflow.html#optionh\">http://hl7.org/fhir/2017Jan/workflow.html#optionh</a>) example workflow broker term is referring to an external BPM Engine?</p>",
        "id": 153871578,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1487156574
    },
    {
        "content": "<p>It could be a BPM engine but certainly wouldn't have to be.  We don't have any examples of conversion to BPMN yet  Also, the Task operations will be pulled for this release as we haven't had enough thought about when they should be used in place of a standard RESTful update. </p>",
        "id": 153871629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487184226
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194909\">@Kevin Mayfield</span> According to your answer I understood somehow and I want to know that I am correct or not.</p>\n<p>1. \"so if the BPM engine wanted to send out a document\" <br>\nfor example. proposing an appointment and sending appointment resource to FHIR server from BPM task. Am I right?</p>\n<p>2. \"I did the mapping to FHIR in the BPM engine\"<br>\nfor example. putting the value of BPM variable in the FHIR resource in BPM engine. Am I right?</p>\n<p>3. \"called a FHIR endpoint\"<br>\nfor example. HTTP post request to appointment endpoint from the script in BPM Engine task with the appointment resource in the request body for proposing an appointment. Am I right? </p>\n<p>4. \"If an external system wanted to start a process (say ReferralRequest)\"<br>\nyou are talking about BPMN process? or a FHIR process?</p>\n<p>5. \"a facade on the BPM would convert that resource to a (activiti) task.\"<br>\nhow a FHIR resource can be converted to a BPM task?</p>",
        "id": 153871844,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1487238429
    },
    {
        "content": "<p>I used Apache Camel (+HAPI libs) to map between FHIR and BPMN. Basic ideas are documented in Camel In action and Activiti in Action books. Also <a href=\"https://www.activiti.org/userguide/index.html#bpmnCamelTask\" target=\"_blank\" title=\"https://www.activiti.org/userguide/index.html#bpmnCamelTask\">https://www.activiti.org/userguide/index.html#bpmnCamelTask</a></p>\n<p>1,2  It was a camel activiti component that intercepted the task which was converted to FHIR<br>\n4 bpmn process<br>\n3.5 Used a camel REST adapter to present a FHIR endpoint, within the camel processing I'd access activiti (either with camel lib or activiti libs)</p>",
        "id": 153871955,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1487254675
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194909\">@Kevin Mayfield</span> So what I have done using Camunda <br>\n--&gt; I have updated the status of appointment<br>\n1. I have used the Camunda Service task with http rest connector<br>\n2. I have put the updated appointment resource in the request payload<br>\n3. Performed a PUT request to a FHIR server<br>\n4. Appointment resource updated, Done.</p>\n<p>now I want to know is this is the correct way of combining BPM engine and FHIR?<br>\nor I am missing something?</p>\n<p>Because in my these steps I have not faced PlanDefinition, FHIR and BPMN mapping and conversion between BPMN to PlanDefinition : | even I don't know where why when and for what purpose I will face these things.</p>\n<p>Kindly correct me if I am wrong </p>",
        "id": 153872312,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1487317983
    },
    {
        "content": "<p>It seems the correct way to me but I'm still looking myself.</p>",
        "id": 153872317,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1487320203
    },
    {
        "content": "<p>That sounds reasonable for your use case. The point of PlanDefinition is if you want to exchange the descriptions of your workflow, as in protocols, order sets, or event-condition-action rules.</p>",
        "id": 153872415,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1487345428
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"193100\">@Muhammad Abubakar</span>,</p>\n<p>sorry for the late reply. I was away last week. Having read your approach in this thread, I think it is a good one. Using Camunda to drive the process and update FHIR ressources as you go along is a good way to drive it client-side / externally. </p>\n<p>We do the exact opposite and use FHIR and BPMN to handle process executions. For that we have a BPMN Workflow Engine (Camunda) integrated in a FHIR server. So internally the WFE is processing BPMN but externally everything is FHIR. </p>\n<p>How do we get FHIR and BPMN together? Basically we see a PlanDefinition as a BPMN. Inside an ActionDefinition is equivalent to a task. Sequence flow is releatedAction, and data flow is the input/output Data Requirements. We use the Atlas Transformation Language  (<a href=\"https://en.wikipedia.org/wiki/ATLAS_Transformation_Language\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/ATLAS_Transformation_Language\">https://en.wikipedia.org/wiki/ATLAS_Transformation_Language</a>) to map between the two. Note that ATL will probably be outdated in a few months/years because FHIR has StructureMap with its own transformation language. See <a href=\"https://vimeopro.com/user12740828/hl7-fhir-developer-days-2016-amsterdam/video/192198789\" target=\"_blank\" title=\"https://vimeopro.com/user12740828/hl7-fhir-developer-days-2016-amsterdam/video/192198789\">this</a> talk by <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>. But for now it is the way to go being the only Model to Model Transformation language available. We are currently working on a publication with details, which I will be happy to link here as soon as it is published and if anyone is interested.</p>\n<p>We do define FHIR operations to drive the Workflow Engine. However this is only one option, as we want all participants to only have to talk FHIR, and we do not require the WFE to be Camunda, it is one choice of many. The operations basically do nothing more than call the WFE in the Server, and the WFE is responsible for creating appropriate FHIR Ressources along the way. So for example $process-start calls the appropriate Java-code to start up a new process in the WFE. You may as well use the REST-Interface that Camunda provides out of the box.</p>\n<p>Lastly, when you execute a PlanDefinition/BPMN, every currently running BPMN-UserTask equates to a FHIR-Task. The reason being that you can update the task according to the workflow-state, store the actual input and output produced that were defined in the corresponding ActionDefinition and of course store information about the process in FHIR.</p>",
        "id": 153872814,
        "sender_full_name": "Oliver Krauss",
        "timestamp": 1487590551
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191686\">@Oliver Krauss</span> Thank you so much for such a detailed answer.<br>\n1. So, can you please compare the FHIR's approach with mine in some pros and cons manner?<br>\n2. Can you please hint what kind of goals (processes) is being achieved having a BPM engine inside FHIR? example one or two?<br>\n3. The goals (processes) which are being achieved having a BPM engine inside FHIR, can they be achieved while not using BPM engine in FHIR and using just FHIR CRUD operations?</p>",
        "id": 153872830,
        "sender_full_name": "Muhammad Abubakar Ikram",
        "timestamp": 1487599663
    },
    {
        "content": "<p>1) Your approach is independent of any FHIR server, so you can communicate with any of the implementations out there. Ours demands modificaton of a specific one, or writing your own. The disadvantage of your solution is that anyone involved in guiding the process needs to implement not only FHIR but also the Camunda interfaces, while applications using our solution stay in FHIR only.  The biggest advantage, and main reason of our aproach is interoperability between different healthcare and health-IT providers. When you have a FHIR specification of your process anyone that can read and implement the spec can also participate in the process, whereas a proprietary BPMN implementation demands (more) up front negotiation.</p>\n<p>2) Not sure I undestand the question. If you mean what we use it for, then Multi Disciplinary Team Meetings (MDTM - Tumor Boards in particular) for details on the process there is a <a href=\"http://link.springer.com/chapter/10.1007/978-3-319-43949-5_8\" target=\"_blank\" title=\"http://link.springer.com/chapter/10.1007/978-3-319-43949-5_8\">paper</a> and a <a href=\"https://ehealth.fh-hagenberg.at/index.php/en/2016/09/07/presentation-for-itbam16-in-porto\" target=\"_blank\" title=\"https://ehealth.fh-hagenberg.at/index.php/en/2016/09/07/presentation-for-itbam16-in-porto\">presentation</a> detailing them. So as an example, we get several medical-professionals that work in different organizations / are in different physical places together at the same time, and they conduct a Meeting about several patients healthcare-status. The WFE drives the process, provides data when the participants need it, and documents both the process and the decisions made by the team.</p>\n<p>3) Everything we do can also be achieved by just using the existing FHIR operations (Crud and search primarily). You can even still do shared-processes using the <a href=\"http://build.fhir.org/workflow.html\" target=\"_blank\" title=\"http://build.fhir.org/workflow.html\">workflow communication patterns</a>. In fact some of our project partners participate in the workflows witout using a WFE. Using the WFE is just one possibility with the advantage over writing everything by hand mainly being reusability, and adhering to a simple understandable pattern.</p>",
        "id": 153872926,
        "sender_full_name": "Oliver Krauss",
        "timestamp": 1487666074
    }
]