[
    {
        "content": "<p>After <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> 's presentation at the DevDays, <br>\nI just wanted to start playing around with the FHIR Mapping Language using java code<br>\nbut I don't manage to find a good starting point (examples or doc) how to dive into it</p>",
        "id": 153858471,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1480071612
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191546\">@Peter Scholz</span> , I also just started to dive in this week with FHIR Mapping Language/java code. I started with the StructureMapTests Junit tests in package org.hl7.fhir.dstu3.test. I checked out the  projects fhir/build/implementations/java/org.hl7.fhir.dstu3 and fhir/build/implementations/java/org.hl7.fhir.utilities that the tests can be run (some path adjustments was necessary since i'm osx based). I'm currently working my way through the tutorial, and started defining the structuredefinitions/maps for it and can run step 1 to step3 but needed to adjust the code a little bit. I'm in the process of setting it up on github.</p>",
        "id": 153858482,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1480078688
    },
    {
        "content": "<p>So you are working using the SVN repository on gforge ?<br>\nAs I started to use hapi, i fear I'm missing those UnitTests</p>",
        "id": 153858490,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1480080566
    },
    {
        "content": "<p>yes, I'm using the svn repository from gforge. I don't know if and how hapi supports the mapping language already, would be interested to know to :-)</p>",
        "id": 153858493,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1480080976
    },
    {
        "content": "<p>I don't think James has done that yet</p>",
        "id": 153858498,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480081825
    },
    {
        "content": "<p>At DevDays, I was asked about whether we could publish the mappings between R2 and R3. I've been thinking about that. I could, maybe, do that. But to do that, I have to publish R2 definitions in R3 as logical mappings, in some other namespace, I think. But that sounds like a total headspin for everyone....</p>",
        "id": 153858500,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480082054
    },
    {
        "content": "<p>yes, another namespace adventure ... but would be nice to convert profiles from R2 to R3 ... (eat your own dog food :-))</p>",
        "id": 153858503,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1480082744
    },
    {
        "content": "<p>oh we already have that - the R2 profiles are published in R3 format and vice versa</p>",
        "id": 153858504,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480082773
    },
    {
        "content": "<p>with the help of the mapping lanugage? i was thinking to convert own defined profiles from R2 to R3 with a map.</p>",
        "id": 153858506,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1480083014
    },
    {
        "content": "<p>well, right now, I have java code to do the conversion. I am thinking of translating it to the mapping language</p>",
        "id": 153858507,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480083782
    },
    {
        "content": "<p>at least StructureMappingUtilities is included in the current sources so I guess that might work with hapi as well,<br>\nright now I have checked out the gforge version too, to have the samples from the unit tests</p>\n<p>I think I can give the tutorial a try during next week</p>",
        "id": 153858508,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1480084019
    },
    {
        "content": "<p>i published my first beginner steps (currently stuck in step 4) in the tutorial: <a href=\"https://github.com/ahdis/fhir-mapping-tutorial\" target=\"_blank\" title=\"https://github.com/ahdis/fhir-mapping-tutorial\">https://github.com/ahdis/fhir-mapping-tutorial</a> feedback welcome!</p>",
        "id": 153858513,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1480086529
    }
]