[
    {
        "content": "<p>As a relative newcomer to FHIR I have been working my way through the online documentation, particularly on the ServiceRequest resource and related materials, including the Request pattern.</p>\n<p>At the bottom of the documentation page for the Request pattern is a table entitled <strong>Mappings </strong>[https://www.hl7.org/fhir/request.html#mappings]. This appears to contain some potentially important information. Unfortunately as far as i can see there is no key or guidance provided as to what the content actually mean?</p>\n<p>Given the labels on the row and column headers, my guess is that a non-blank entry in the table shows where a property/element described in the pattern is present and used in a particular resource, so this is a \"Resource conformance to the Pattern\" table. However the values used  to populate the table cells are not obvious.</p>\n<p>Is there a key somewhere that identifies what codes like \"1 N\", \"E\", \"1 C\", \"1 T\" mean, or are these meanings imported / re-used from somewhere else, and I just haven't run into the relevant page in the documentation yet?</p>\n<p>Any hints would be helpful.</p>",
        "id": 190188526,
        "sender_full_name": "Colin E.",
        "timestamp": 1583855305
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 190188781,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583855415
    },
    {
        "content": "<p>number = number of matching elements in the resource. mouse-over will show you what the actually are.</p>\n<p>N = name is different in the resource<br>\nT = there's a type mismatch<br>\nC = there's a cardinality mismatch<br>\nE = it's marked to be an extension in the resource</p>\n<p>colors:<br>\ngrey - no match<br>\nsalmon - there's an error<br>\naqua - the name is different<br>\nyellow - it's an extension<br>\nwhite - matched ok</p>",
        "id": 190214243,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583868336
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>. I have submitted an issue report on the page in question as I don't think I could have guessed these (esp. the colour codes). Presumably there may be other tables of the same type elsewhere in the documentation, at least on the other Pattern types?</p>",
        "id": 190226196,
        "sender_full_name": "Colin E.",
        "timestamp": 1583875120
    },
    {
        "content": "<p>I should have made a legend, yes.</p>",
        "id": 190234535,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583880390
    },
    {
        "content": "<p>each pattern will have the same table generated by the same code</p>",
        "id": 190234548,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583880405
    }
]