[
    {
        "content": "<p>I’m not sure when to use the <strong>focus</strong> and when to use the <strong>input</strong> element for several task use cases:</p>\n<p>1) Task to fill-out/complete a questionnaire </p>\n<ul>\n<li>Should the reference to the QuestionnaireResponse be included into the <strong>focus</strong> element (= <em>the resource being manipulated by this task</em>)?</li>\n<li>Or should the reference to the QuestionnaireResponse be included as <em>input</em> element (= <em>information that may or must be present in order for a task to complete</em>)</li>\n</ul>\n<p>2) Task to read a certain document</p>\n<ul>\n<li>For whatever is the correct answer for UC 1 (QuestionnaireResponse): If the task is about reading a referenced document should it be treated the same way? </li>\n<li>Or will the fact that the QuestionnaireResponse is in fact <em>manipulated</em> while the Document is just <em>displayed and read</em> by the user require a different task modelling?</li>\n</ul>",
        "id": 154019764,
        "sender_full_name": "Astrid Corinna Wolff",
        "timestamp": 1542703326
    },
    {
        "content": "<p>1. Typically you wouldn't <em>have</em> a QuestionnaireResponse yet.  If the task was to update/revise an existing response, then it would be appropriate to have it as the focus.  If you're wanting someone to create a new QuestionnaireResponse based on a specified Questionnaire, then no input or focus.  Specify the Questionnaire as the \"instantiates\".<br>\n2. If you want to say \"please read X\", the X would be the focus.</p>",
        "id": 154019820,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542729156
    },
    {
        "content": "<p>How about \"create a report based on X\"? Is X the input for this task?</p>",
        "id": 154019823,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1542729657
    },
    {
        "content": "<p>Ad 1. <br>\nIf I want someone to create a new QuestionnaireResponse based on a specific Questionnaire and I want to allow them to save it as draft (and continue completing it later) would then the original Task have a reference to the Questionnaire and later (after the QuestionnaireResponse has been created) the Task would be updated with the QuestionnaireResponse as the focus?</p>\n<p>And which element (in R3 and R4) holds the \"instantiates\" in this case? I only found <em>basedOn</em> with a reference to any resource but this does not seem to be the right place, does it?</p>",
        "id": 154019825,
        "sender_full_name": "Astrid Corinna Wolff",
        "timestamp": 1542730494
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> Yes, that would be a use for input.  And if you were asking someone to fill out a QuestionnaireResponse based on certain other information, that \"other information\" would be an input.</p>\n<p><span class=\"user-mention\" data-user-id=\"196149\">@Astrid Corinna Wolff</span> Probably not.  The QuestionnaireResponse would be listed as a Task.output and the Task status would indicate \"in progress\".  The instantiates would be instantiatesCanonical in R4.  It would be definitionReference in R3.</p>",
        "id": 154019847,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542738141
    },
    {
        "content": "<p>I saw <em>definitionReference</em> and <em>instantiatesCanonical</em> but both have only <em>ActivityDefinition</em> listed as type. Is it allowed to also reference a <em>Questionnaire</em> within these two elements? Or do I need to create an <em>ActivityDefinition</em> that contains a reference to the <em>Questionnaire</em> (and if yes, where)?</p>\n<p>In the use case I imagine there is no implemented workflow or protocol. A professional just wants to assign a patient the task to fill out a selected <em>Questionnaire</em> within a defined timeframe.</p>",
        "id": 154020004,
        "sender_full_name": "Astrid Corinna Wolff",
        "timestamp": 1542784791
    },
    {
        "content": "<p>Good point.  That's a problem actually.  And I'm concerned we may be too late to fix it in R4.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - is adding additional permitted types in a canonical reference going to break things at this stage?</p>",
        "id": 154020266,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542823117
    },
    {
        "content": "<p>I think that would be procedurally ok</p>",
        "id": 154020370,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1542860331
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> - is this something OO could approve next week?</p>",
        "id": 154020382,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542863854
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19690\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19690\">GF#19690</a></p>",
        "id": 154020383,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542864056
    },
    {
        "content": "<p>That would be great!</p>\n<p>So, in <strong>R4</strong>: </p>\n<ul>\n<li>if the Task includes a <em>Questionnaire</em> to be answered, then I would put it into <em>instantiatesCanonical</em></li>\n<li>if the Task includes an existing <em>QuestionnaireResponse</em> (created by someone else) that needs to be included, then I would put it into <em>focus</em></li>\n<li>if the Task has been completed, then the resulting <em>QuestionnaireResponse</em> (with status = completed) should be put into <em>output</em> of the Task</li>\n<li>\n<p>if the Task includes something I need to answer the <em>Questionnaire</em>, e.g. a <em>Document</em>, an <em>Observation</em> or some other resource, then I would put these into <em>input</em></p>\n</li>\n<li>\n<p>if the Task includes a <em>Document</em> that should be read, then I would put it into <em>focus</em></p>\n</li>\n</ul>\n<p>Are my assumptions above correct?</p>\n<p>In <strong>R3</strong>: Where should I put the <em>Questionnaire</em> to be answered since <em>definitionReference</em> only allows <em>ActivityDefinition</em>? We considered creating an empty <em>QuestionnaireResponse</em> when the Task is created and put it into <em>focus</em>. Would this be a suitable workaround or do you have any better idea?</p>",
        "id": 154020398,
        "sender_full_name": "Astrid Corinna Wolff",
        "timestamp": 1542871997
    },
    {
        "content": "<p>It matters what kind of task it is.  A QuestionnaireResponse that's to be updated would be a \"focus\" of a Task asking for a QuestionnaireResponse to be updated.  However, it could be an \"input\" for a Task saying \"please generate a CarePlan based on the responses to one or more Questionnaires\".  The Task.focus  is what the Task.code is asking to be manipulated or fulfilled.  The inputs provide information needed to perform the task and the Task.output provide what resulted from the task.</p>",
        "id": 154020498,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542901096
    },
    {
        "content": "<p>I think I got it. Thank you very much for your explanations!</p>\n<p>I just imagine one more (a bit more complicated) use case: </p>\n<p>How would I create a Task for a physician to notice a report and a  some other documents that are needed to correctly understand a certain DICOM image?<br>\nSince <em>focus</em> could include only the reference to one of the Documents that should be read would I need to create several sub-tasks (one for each Document)? And would the DICOM image be the <em>input</em> (-&gt; please read the documents that are relevant for understanding this DICOM image)?</p>",
        "id": 154020509,
        "sender_full_name": "Astrid Corinna Wolff",
        "timestamp": 1542901862
    },
    {
        "content": "<p>It depends how you want to phrase it.  One possibility would be \"Review this DICOM image\" with a focus of the image and the reports as input to support the review.  Another could be \"Review reports\" with subtasks for each report to review and the association to the DICOM image would be through the reports.</p>",
        "id": 154020512,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542902555
    },
    {
        "content": "<p>I think for my use case I like \"Review this DICOM image\" best. We were looking for something to make sure that the reports are not overseen when reviewing the image and such a kind of Task could be used to display the image to the user with additional reports (to support the review, as you said) by the side.</p>",
        "id": 154020513,
        "sender_full_name": "Astrid Corinna Wolff",
        "timestamp": 1542902852
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Reviewing this discussion, I'm still unsure on what to do.</p>\n<p>Task: \"Questionnaire should be retrieved by performer [patient]\" Task is completed when Questionnaire has been retrieved. No assumption of Questionnaire completion is to be inferred from this Task.</p>\n<p>Where we've landed:</p>\n<p>Task.status \"ready\"<br>\nTask.intent \"order\"<br>\nTask.code \"Please retrieve Questionnaire\"<br>\nTask.focus \"The Questionnaire\"<br>\nTask.performerType \"performer\"<br>\nTask.owner \"The patient\"<br>\nTask.restriction.period.end \"Before next week\"</p>\n<p>Although you are welcome to shoot at anything, the main question is \"Given the Task definition, where does the Questionnaire go\". I feel uncomfortable with Task.definition (this is STU3) as the Questionnaire is not the definition of the task, it is the object to retrieve.</p>",
        "id": 158973517,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550668926
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196149\">@Astrid Corinna Wolff</span> <br>\ngreat question. Was about to ask the same, and found this thread. We (MOLIT Institut) will also put the Questionnaire in  instantiatesCanonical as soon this will be possible.</p>",
        "id": 158983118,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1550675323
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> - are you wanting the Questionnaire to be retrieved or a QuestionnaireResponse?  If the former, then Task.focus is fine.</p>",
        "id": 158988588,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550678815
    },
    {
        "content": "<p>Just retrieval of the Questionnaire. Workflow around QuestionnaireResponse has been declared out-of-scope. Presumably when that comes into scope, then the current task about Questionnaire retrieval could be a subtask.</p>\n<p>Thanks for the confirmation ( <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span> )</p>",
        "id": 158989308,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550679238
    },
    {
        "content": "<p>One more followup: where would you convey the Patient who's supposed to retrieve this Questionnaire? Both Task.for and Task.owner seem reasonable. Or could it be both for different reasons? The patient could be the (ultimate) beneficiary while he's the currently responsible owner of the Task at the same time?</p>",
        "id": 158989943,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550679713
    },
    {
        "content": "<p>Task.owner is who is to do the action.  Task.for is the beneficiary.  Could be the same or different</p>",
        "id": 158990687,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550680386
    },
    {
        "content": "<p>So at minimum patient is owner, since he's supposed to retrieve the Q. Whether or not he benefits, may not even be relevant in this case.</p>",
        "id": 158990797,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1550680458
    },
    {
        "content": "<p>Task.for is importent for security/access control.  It determines what patient record the request is tied to, so it should generally always be declared.</p>",
        "id": 158991314,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550680850
    }
]