[
    {
        "content": "<p>Hi, We are trying to build an EHR repository based on FHIR standards. While we are struggling to map pregnancy episode from antenatal visits to delivery as well as postnatal visits to a single FHIR resource. Since we are having the similar concept implemented in our in-house developed HIS, it would be definitely value added feature to form a clinical repository with visits from different institutes..<br>\nPlease advise..</p>",
        "id": 153855714,
        "sender_full_name": "Binu DGIT",
        "timestamp": 1478507818
    },
    {
        "content": "<p>I think you need to provide more information. what information do you have, and what existing resources are you using?</p>",
        "id": 153855718,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478515441
    },
    {
        "content": "<p>We have ANC-NO uniquely registered across the institutes for each pregnancy. This is being generated initially when the patient is identified with a new pregnancy. Normal way it is getting recorded from primary care centers. Our in-house developed HIS (Alshifa) is having  facility to register pregnancy locally and can record information like gravida, parity etc, antenatal examination details, CPOE details etc. Further after a couple of antenatal visits, patient is being referred to polyclinic, where the care continued under the same ANC-NO and more details are recorded including ultrasound, anamoly scan etc. Patient is being referred to Tertiary care hospital for delivery, again the ANC-NO is being followed up. When we build a FHIR based repository in the central, we need refer the respective ANC-NO for a single episode and all encounters are to be grouped under the same. Moreover, I could not find a proper FHIR resource to record, pregnancy related details including gravida, parity, gestational age, risk factors and other complications etc.</p>",
        "id": 153855720,
        "sender_full_name": "Binu DGIT",
        "timestamp": 1478516207
    },
    {
        "content": "<p>I would think that you would have multiiple encounters all linked by a single general encounter (see Encounter.partOf). Though you could also treat the overall ANC-NO as an EpisodeOfCare</p>",
        "id": 153855726,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478518386
    },
    {
        "content": "<p>you should read the definitions of both</p>",
        "id": 153855727,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478518393
    },
    {
        "content": "<p>you can treat most of the rest of the information as a conbination of Condition and Observation. Dealing properly with pregnancy care is on the future roadmap</p>",
        "id": 153855728,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478518433
    },
    {
        "content": "<p>Yes, and EpisodeOfCare would make sense as the overall wrapper for the session.</p>",
        "id": 153855820,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1478558962
    },
    {
        "content": "<p>We have the similar idea in mind.. keeping ANC-NO as the episode of care with multiple encounters from different institutes grouped under that. My worry was about the other related information.. Even though I tried to form it as part of observation, some of the details never fit into the same..<br>\nThank you very much for the feedback..</p>",
        "id": 153855871,
        "sender_full_name": "Binu DGIT",
        "timestamp": 1478577996
    },
    {
        "content": "<p>Similarly, I found difficulty in managing sick leave, attendance certificate etc. like clinical certificates issued to patient.. If you want to move them to the central repository, which resource type would be most suitable..?</p>",
        "id": 153855877,
        "sender_full_name": "Binu DGIT",
        "timestamp": 1478578492
    },
    {
        "content": "<p>Possibly the Communication resource</p>",
        "id": 153855882,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1478578818
    },
    {
        "content": "<p>Communication is more about sharing what someone has been told.  The \"attendance certificate\" sounds more like a certification/credentialling process.  I'd probably capture that just as encounter - Patient went to meeting XYZ.  If we wanted to capture training, that would be Procedure.  But if we want to capture \"patient passed test XYZ showing a certain level of knowledge\", that would be new.  We handle that right now for practitioners, but not for patients.</p>",
        "id": 153855885,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478579011
    },
    {
        "content": "<p>We have a lot of clinical documents including medical reports from different specialties. Which would be the best resource type to map with? <br>\nWe have the report made as HTML document.. </p>",
        "id": 153855894,
        "sender_full_name": "Binu DGIT",
        "timestamp": 1478579459
    },
    {
        "content": "<p>DocumentReference then</p>",
        "id": 153855896,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478579520
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Our doctors create sick leave while they are in OPD (encounter type Outpatient) or at the time of inpatient discharge. (Inpatient encounter type). So is this to be considered as another encounter or would be better to consider it as document reference?</p>",
        "id": 153855902,
        "sender_full_name": "Binu DGIT",
        "timestamp": 1478579757
    },
    {
        "content": "<p>Can you explain what you mean by \"create sick leave\"?  Do you mean \"authorize sick leave\"?  I'm not sure we have an appropriate resource for that.  It could be treated as a sort of consent, but it's far outside the scope of what the work group is currently considering for that resource.</p>",
        "id": 153855906,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478579874
    },
    {
        "content": "<p>I mean the sick leave document itself.. We have in Oman, the sick leave generated from hospitals are being reported to Ministry of Manpower to record under the employee.. For that purpose we have implemented a web service communication. While we want modify this process flow by making this available centrally at Ministry of Health Head quarters and other stake holders like ministry of manpower or other ministries can query at any point in time..</p>",
        "id": 153855912,
        "sender_full_name": "Binu DGIT",
        "timestamp": 1478580110
    },
    {
        "content": "<p>At the risk of revisiting past debates, I still believe that there should be a dedicated FHIR Resource for Pregnancy (Gravidity or Gestation are alternative names). To my mind shoe-horning such a large and significant concept into any of the existing clinical, diagnostic or care provision resources just doesn't feel right. Pregnancy not really a condition or a problem and has a number of dedicated and unique properties (Gravida, Parity, Date of Conception, LMP, Expected Delivery Dates, etc, etc. - not to mention all the events around labour and delivery). Put another way, over 80% of the EHR/EMR systems I've seen implement it as a separate entity and I've worked on 3 major maternity modules in my career. Look forward to all the (friendly?) fire that might be returned! :)</p>",
        "id": 153855930,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1478583408
    },
    {
        "content": "<p>This is the same opinion I have.. :)</p>",
        "id": 153855931,
        "sender_full_name": "Binu DGIT",
        "timestamp": 1478584036
    },
    {
        "content": "<p>Considering Document Reference, data is considered as attachment and it can be send as base64Binary where the HTML tags are not allowed. How can I send HTML reports (basically it is document with HTML tag) using DOCUMENT REFERENCE resource?</p>",
        "id": 153855937,
        "sender_full_name": "Binu DGIT",
        "timestamp": 1478599363
    },
    {
        "content": "<p>yes base64 the html</p>",
        "id": 153855938,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478599663
    },
    {
        "content": "<p>What do you mean ? I can send text containing HTML tags can be send as base64Binary?</p>",
        "id": 153855939,
        "sender_full_name": "Binu DGIT",
        "timestamp": 1478599783
    },
    {
        "content": "<p>well, you base64 encode the html</p>",
        "id": 153855940,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478599830
    },
    {
        "content": "<p>Thats fine.. we have done the same found some issues in decoding it back ..<br>\nIs there any resource specific to map culture reports from lab? At present we have tried observation for the same while histology report is being accumulated to conclusion in DIAGNOSTIC REPORT resource type. </p>",
        "id": 153855941,
        "sender_full_name": "Binu DGIT",
        "timestamp": 1478600159
    },
    {
        "content": "<p>there's a profile somewhere that shows how to culture reports from a lab - <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> can direct you to that</p>",
        "id": 153855944,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478600465
    },
    {
        "content": "<p>should be no issues decoding base64 - base64 is a rather well understood encoding</p>",
        "id": 153855945,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478600479
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> values such as Date of Conception, Expected Delivery Date and even LMP are all observations - they are calculations/assertions that are made by a particular person at a particular time using a particular method.  And a different value might be asserted a few weeks later by a different person using a different method.  (E.g. initial calculation based on reported LMP, later updated based on ultrasound).  LMP is captured for all sorts of reasons, not just pregnancy and needs to be captured in the same way for consistency.  Procedures captured related to pregnancy are going to be recorded and tracked for billing and other purposes in the same manner as any other procedure.  There's no question that systems will have a dedicated <em>interface</em> to manage a pregnancy episode (just as they'll have interfaces for managing oncology and other types of specialized care).  But from a data consistency/query/exchange perspective, they're still dealing with encounters, observations and procedures that are linked to a particular episode.</p>",
        "id": 153855958,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478606121
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thanks for the explanation. Because NZ has a centralised system for both ante-natal and post-natal care, with a designated Lead Maternity Carer and single sources of truth for ED dates, etc. it lends itself more to a dedicated resource. My feeling remains that without this, the current FHIR model is too complex for those attempting to exchange maternity details and I am one of those involved in building interfaces between community midwife systems and a national system. I would love to use FHIR to do this but, believe it or not, the current incumbent CDA standard is actually simpler (given that we've gone through the pain of constraining via Templates with model meaning bindings to SCT). However, if anyone can point me to a FHIR Profile that handles even an average maternity 'episode' - including labour, delivery and post-natal care up to 6 weeks - I'd be absolutely delighted to be converted.</p>",
        "id": 153856107,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1478644168
    },
    {
        "content": "<p>This is actually one of those situations where a logical model interface (which presents a large set of resource data as a single record) would be a really good fit.  However, that's still an evolving space and probably won't be ready for prime time as part of STU 3.  This would be a great test case for it (in addition to the pathology use-case Grahame has been using).</p>",
        "id": 153856109,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478644467
    },
    {
        "content": "<p>That's an excellent, constructive, suggestion <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> and has already been picked up by Lord Hay of ClinFHIR.</p>",
        "id": 153856175,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1478680916
    },
    {
        "content": "<p><a href=\"https://fhirblog.com/2016/11/11/basic-pregnancy-logical-model/\" target=\"_blank\" title=\"https://fhirblog.com/2016/11/11/basic-pregnancy-logical-model/\">https://fhirblog.com/2016/11/11/basic-pregnancy-logical-model/</a></p>",
        "id": 153856379,
        "sender_full_name": "David Hay",
        "timestamp": 1478807862
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192834\">@Binu DGIT</span>  A little late on the follow up but here is the <a href=\"http://healthedatainc.com/go-ftp/micro/index.html\" target=\"_blank\" title=\"http://healthedatainc.com/go-ftp/micro/index.html\">profile for Culture and sensitivity</a> which we discussed on a couple of OO on FHIR calls..  I'm proposing that we update the example in the spec to this pattern.  {#12240} adn add <a href=\"http://healthedatainc.com/go-ftp/publish/diagnosticreport-lri-example.html\" target=\"_blank\" title=\"http://healthedatainc.com/go-ftp/publish/diagnosticreport-lri-example.html\">this example</a> too</p>",
        "id": 153857115,
        "sender_full_name": "Eric Haas",
        "timestamp": 1479275681
    }
]