[
    {
        "content": "<p>how do i setup fhir java client on windows 10 pro</p>",
        "id": 153999795,
        "sender_full_name": "edward smith",
        "timestamp": 1537898631
    },
    {
        "content": "<p>What do you mean by \"FHIR Java Client\"?</p>",
        "id": 153999797,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537902321
    },
    {
        "content": "<p>Using Java client to talk to a C# implementation of Audit Server. But it exposes the AuditEvent endpoint on '&lt;base-path&gt;/FHIRAuditEvent/' and I cannot find out how to configure the java client to use a custom endpoint. The urlPath seems to be parsed from the type annotation...</p>",
        "id": 180606777,
        "sender_full_name": "Jan Høydahl",
        "timestamp": 1573637684
    },
    {
        "content": "<p>I first tried to subclass <code>AuditEvent</code> and change the annotation 'name'. Then the client would generate the correct URL path but the server got confused because it tried to parse into <code>FHIRAuditEvent</code> which of course is unknown to the server. I want to post a plain AuditEvent JSON but to a different endpoint URL.</p>",
        "id": 180607078,
        "sender_full_name": "Jan Høydahl",
        "timestamp": 1573638000
    },
    {
        "content": "<p>The client I'm using is HAPI FHIR 3.7.0, DSTU2 v1.0.2</p>",
        "id": 180607297,
        "sender_full_name": "Jan Høydahl",
        "timestamp": 1573638162
    },
    {
        "content": "<p>You might be able to treat is as an operation.</p>\n<p>Bundle result = client.operation().onServer()<br>\n                .named(\"FHIRAuditEvent\")<br>\n                .withParameters(parameters)<br>\n                .returnResourceType(Bundle.class)<br>\n                .execute();</p>",
        "id": 180607472,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573638274
    },
    {
        "content": "<p>Ok, I can try that next time. Will have to rewrite my simple client adapter class, but hopefully it is easy.<br>\nQuestion: Does the FHIR spec say somewhere that the resource should be served on the /AuditEvent endpoint?<br>\nLooks like you use Content-Type HTTP header to distinguish between various types such as <code>application/json+fhir</code> while my client uses a new endpoint instead to do the same (I think)</p>",
        "id": 180610177,
        "sender_full_name": "Jan Høydahl",
        "timestamp": 1573640171
    },
    {
        "content": "<p>the server is not conformant, so it's not surprising that you can't make it work easily</p>",
        "id": 180610512,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573640408
    },
    {
        "content": "<p>Probably via the conformanceStatement. Is the FHIRAuditEvent listed in the servers &lt;base-path&gt;/metadata</p>",
        "id": 180610541,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573640447
    },
    {
        "content": "<p>This is a minimal server implemented by a client of mine. They have not even implemented any conformanceStatement :) so I had to disable that in the client.<br>\nI'm green to FHIR, just wrote an app that needs to log to that server. And I don't have the history for why they have two different endpoints, one called /AuditEvent and another /FHIRAuditEvent. I'm just guessing when I say that the json+fhir content-type could/should be used to select parser rather than a different endpoint name. I'll try your workaround Kevin.</p>",
        "id": 180651487,
        "sender_full_name": "Jan Høydahl",
        "timestamp": 1573666593
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191687\">@Kevin Mayfield</span> So I tried your code client.operation().onServer, and it almost succeeded, except it tried to hit &lt;base-path&gt;/$FHIRAuditEvent which gives 404 since there is no '$' in the path on the server. Also I don't get how to go from Bundle to MethodOutcome that I used to have with my current client.</p>",
        "id": 180813916,
        "sender_full_name": "Jan Høydahl",
        "timestamp": 1573808838
    },
    {
        "content": "<p>Ok, I worked around it by search/replace of URI in my <code>interceptRequest()</code> hook. Dirty since I had to cast IHttpRequest to ApacheHttpRequest and then pull out the inner HttpRequestBase from there, convert the getURI() to string, replace the path, wrap it in a URI again and modify the request. Wish there was a simple way on the client to provide a custom path for any event that you wish to post to server..</p>",
        "id": 180816069,
        "sender_full_name": "Jan Høydahl",
        "timestamp": 1573810920
    },
    {
        "content": "<blockquote>\n<p>Wish there was a simple way on the client to provide a custom path for any event that you wish to post to server..</p>\n</blockquote>\n<p>There is no way to alter the resource path as these paths are defined as part of the FHIR spec: <a href=\"https://www.hl7.org/fhir/http.html#styleguide\" target=\"_blank\" title=\"https://www.hl7.org/fhir/http.html#styleguide\">https://www.hl7.org/fhir/http.html#styleguide</a><br>\nThe easiest would be to get your server FHIR compliant.</p>",
        "id": 180816980,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1573811784
    },
    {
        "content": "<p>Thanks for your help on this. I now have a workaround until the server gets more compliant.</p>",
        "id": 180832829,
        "sender_full_name": "Jan Høydahl",
        "timestamp": 1573825619
    }
]