[
    {
        "content": "<p>Hello,</p>\n<p>Could someone please provide link to FHIR architecture diagram?</p>\n<p>Thanks,<br>\nSuchi</p>",
        "id": 154017429,
        "sender_full_name": "sucharitha manyala",
        "timestamp": 1541899826
    },
    {
        "content": "<p>What sort of diagram are you looking for?  FHIR supports a wide variety of archiectural approaches, so there wouldn't be just one possible diagram...</p>",
        "id": 154017432,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541904772
    },
    {
        "content": "<p>I am looking for a diagram that shows where FHIR stands in the picture of interoperability between various healthcare systems and how the components of FHIR interact. I understand this can be achieved in various ways so any diagram showing interfacing between two clinical systems (or a patient requesting for his reports through an app)  using FHIR and mainly showing how components within FHIR interact to exchange data between these two systems will be good. Please let me know if there is any such architectural diagram. </p>\n<p>Thanks,<br>\nSuchi</p>",
        "id": 154017455,
        "sender_full_name": "sucharitha manyala",
        "timestamp": 1541943390
    },
    {
        "content": "<p>FHIR can be used with REST (with intermediaries or not), with messaging, with document repositories and a number of other ways.  SMART and CDS Hooks provide additional mechanisms for using FHIR interfaces.  <a href=\"https://github.com/FHIR/documents/blob/master/presentations/2018-09%20Tutorials/Designing%20FHIR%20Solutions.pptx\" target=\"_blank\" title=\"https://github.com/FHIR/documents/blob/master/presentations/2018-09%20Tutorials/Designing%20FHIR%20Solutions.pptx\">This deck</a> has a few slides describing some of the different architectural approaches at a high level which might be helpful.</p>",
        "id": 154017456,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541946474
    },
    {
        "content": "<p>Thank you! This is exactly what I needed.</p>",
        "id": 154017460,
        "sender_full_name": "sucharitha manyala",
        "timestamp": 1541952365
    },
    {
        "content": "<p>we don't have a FHIR respository in our system. we have clinical data at rest that we transform to FHIR resources on the fly.</p>",
        "id": 198030017,
        "sender_full_name": "Keerthivasan Ramanathan",
        "timestamp": 1589873293
    },
    {
        "content": "<p>how do we approach it generally?</p>",
        "id": 198030025,
        "sender_full_name": "Keerthivasan Ramanathan",
        "timestamp": 1589873304
    },
    {
        "content": "<p>You;ll have to write mapping code between your internal data and FHIR, for the REST interface you can use one of the available servers (HAPI, Vonk) usually have a definable backing store - or write your own (the mapping is the most difficult part in my experience)</p>",
        "id": 198062588,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1589893727
    }
]