[
    {
        "content": "<p>Hi FHIR experts,</p>\n<p>In my organisation, we are exploring different ways to store Clinical data for reporting, analytics and predictive analysis purposes. We have source data residing in multiple products such as Cerner EMR, iPM PAS, eMaternity etc. <br>\nThere are various options with regards to data model such as, storing data in a traditional star schema type model however these tend to get overly complicated over time, and they are custom built so need to be well documented so other parties can leverage it to build any products. There are other data model methodologies such as data vault, however these are also custom models.<br>\nI would like to understand your views on converting data into FHIR resources and persisting these in a SQL database, for analytics purposes. Given that FHIR data model is open source and well documented, there are merits in storing data in this manner, however given the primary purposes of FHIR is interoperability, is this an efficient data model for analytics purposes?</p>\n<p>Has anyone done this in the past, and what were the challenges? What was the performance like and did you come across a better alternative? Apologies for the long post.</p>\n<p>Kind Regards,<br>\nHarmeet</p>",
        "id": 154006552,
        "sender_full_name": "Harmeet Chhabra",
        "timestamp": 1538894192
    },
    {
        "content": "<p>Hi Harmeet - All great questions. We discussed many of these topics at the Connectathon last week. There is a separate Zulip stream, <a class=\"stream\" data-stream-id=\"73\" href=\"/#narrow/stream/73-analytics-on-FHIR\">#analytics on FHIR</a>, where folks are continuing this conversation - definitely check it out!</p>",
        "id": 154006567,
        "sender_full_name": "Kenny Blanchette",
        "timestamp": 1538918640
    },
    {
        "content": "<p>Thank you Kenny, appreciate your quick response. I will keep an eye on the other stream.<br>\nMany thanks.</p>",
        "id": 154006614,
        "sender_full_name": "Harmeet Chhabra",
        "timestamp": 1538973169
    }
]