[
    {
        "content": "<p>Our project is already having a built in HL7 Message parsers which is being used for many clients, Now a new client is trying to use our product and they were able to send only FHIR JSon message, I am in need of parser(.NET c#) that transforms the incoming FHIR Json message to HL7.<br>\nDoes the .NET HL7.FHIR can tranform FHIR to HL7, if so are there any sample codes, that can get me started?</p>",
        "id": 154024198,
        "sender_full_name": "Gachu A",
        "timestamp": 1544469389
    },
    {
        "content": "<p>There is no easy \"standard\" functionality to translate HL7 v2 messages to HL7 FHIR (or vice versa). This has to do with the fact that translations between these two different standards requires understanding of localizations and specific usecases the message exchanges are made for. Also, there is an impendance mismatch between a messaging standard like v2 (where messages carry the meaning of events) and the RESTful interface of FHIR (assuming you are using that).</p>\n<p>This does not mean that content of the one standard cannot be prudentially and partially be translated into the other, but you have to understand why you are doing it, and for which kind of exchange. Hence, there is no out-of-the-box functionality to translate one in the other.</p>",
        "id": 154024203,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1544469692
    },
    {
        "content": "<p>There is however a library for parsing and serializing HL7 v2 messages: <a href=\"https://www.nuget.org/packages/nHapi/\" target=\"_blank\" title=\"https://www.nuget.org/packages/nHapi/\">https://www.nuget.org/packages/nHapi/</a>.  You can then map them to the HL7 FHIR model and use the FHIR .NET API (<a href=\"https://www.nuget.org/packages/Hl7.Fhir.STU3\" target=\"_blank\" title=\"https://www.nuget.org/packages/Hl7.Fhir.STU3\">https://www.nuget.org/packages/Hl7.Fhir.STU3</a>) parse and serialize FHIR.  Also, the specification has suggested mappings between HL7 FHIR and HL7 v2 (and v3) on each \"Mapping\" tab in the FHIR Specification, e.g. here: <a href=\"http://hl7.org/fhir/observation-mappings.html\" target=\"_blank\" title=\"http://hl7.org/fhir/observation-mappings.html\">http://hl7.org/fhir/observation-mappings.html</a></p>",
        "id": 154024205,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1544470124
    },
    {
        "content": "<p>There is a STREAM for <a class=\"stream\" data-stream-id=\"32\" href=\"/#narrow/stream/32-v2-to-FHIR\">#v2 to FHIR</a></p>",
        "id": 154024266,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544482165
    },
    {
        "content": "<p>There are also mapping tabs on all resources and most have mappings to v2 elements (that represent 'typical' v2 - specific implementations may vary).  You might also find this page in the spec helpful: <a href=\"http://build.fhir.org/comparison-v2.html\" target=\"_blank\" title=\"http://build.fhir.org/comparison-v2.html\">http://build.fhir.org/comparison-v2.html</a></p>",
        "id": 154024338,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544494195
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197661\">@Gachu A</span></p>\n<p>\"Our project is already having a built in HL7 Message parsers which is being used for many clients, Now a new client is trying to use our product and they were able to send only FHIR JSon message, I am in need of parser(.NET c#) that transforms the incoming FHIR Json message to HL7.\"</p>\n<p>HL7 v2 and HL7 FHIR cover very broad domains. You may have a simpler mapping exercise if you limit your mapping of v2 to just the messages and message elements required by your application. Consider creating a content profile of your v2 message(s) and going from there. You will find a lot of what is in PID in Patient, OBX in Observation, etc. Trying to map all of v2 to FHIR would be like boiling the ocean. But mapping your specific implementation of v2 to FHIR would be relatively straightforward. I have a similar need and chose to reverse engineer my v2 message profile into a conceptual data model and then forward translate the CDM into FHIR. It's a repeatable process the requires detailed knowledge of v2 conformance profiling, UML modeling, and FHIR profiling. Implementing the results of the mapping requires additional FHIR implementation skills. You may want to seek experienced assistance. There are devils in the details.</p>",
        "id": 154024365,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1544507693
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span>  - we do exactly this using both the toolkits you mention.   <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  - yes, V2 mappings exist on each resource but they are very frequently missing from FHIR DataTypes.   Many times when trying to map V2 messages you need to drill down to the FHIR DataTypes (e.g. Dosage, Timing, etc.) and there tends to be gaps.     We've made our \"best guesses\" but it would be nice if there was more guidance here.  (I also believe that the interface engine vendors tend to use these mappings as a guide for their 'standard' mappings.)</p>",
        "id": 154024384,
        "sender_full_name": "John Silva",
        "timestamp": 1544525297
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> If there are places you think there should be mappings but aren't, feel free to submit a change request.  (Or even better, submit a change request with the proposed mappings to add :))</p>",
        "id": 154024443,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544543950
    },
    {
        "content": "<p>OK, I'll have to start entering change requests as I come upon them.   (Of course what I suggest for mappings might not be what others think is appropriate or meets 'general use cases' but I suppose it could get the discussion started.   E.g. the discussion about the Priority, e.g. as used in TQ1.9 field or the subcomponent of the TQ V2 data type.)</p>",
        "id": 154024447,
        "sender_full_name": "John Silva",
        "timestamp": 1544544388
    },
    {
        "content": "<p>There is a project in progress to map V2 to FHIR (project statement can be found here: <a href=\"https://confluence.hl7.org/display/OO/2-To-FHIR\" target=\"_blank\" title=\"https://confluence.hl7.org/display/OO/2-To-FHIR\">https://confluence.hl7.org/display/OO/2-To-FHIR</a>).  This is intended to yield a \"definitive\" mapping from an HL7 perspective on what V2 elements should be mapped to what FHIR elements, and as appropriate, create FHIR extensions to accommodate elements in V2 that are not in FHIR Core, but are known to be used in V2 messages.  The initial focus is on V2 to FHIR.  Anybody interested to join that effort, for notifications on meetings/etc., you can sign up to <a href=\"mailto:v2-to-fhir@lists.hl7.org\" title=\"mailto:v2-to-fhir@lists.hl7.org\">v2-to-fhir@lists.hl7.org</a>.  Additional discussions should occur the V2 to FHIR zulip stream (<a href=\"#narrow/stream/32-v2-to.20FHIR\" title=\"#narrow/stream/32-v2-to.20FHIR\">https://chat.fhir.org/#narrow/stream/32-v2-to.20FHIR</a>).</p>",
        "id": 154024907,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1544637542
    },
    {
        "content": "<p>Hi, I have got a FHIR server which requires to send HL V2 messages. Does anyone used anything similar to FHIR Mapper for the reverse pathway aka FHIR/Appointment to HL7/scheduling</p>",
        "id": 212296584,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1601903530
    },
    {
        "content": "<p>You might ask on <a class=\"stream\" data-stream-id=\"179188\" href=\"/#narrow/stream/179188-v2-to-FHIR\">#v2 to FHIR</a></p>",
        "id": 212302650,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601906437
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Thought it my be related to this stream but will do as advised.</p>",
        "id": 212328482,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1601917569
    }
]