[
    {
        "content": "<p>Hello,</p>\n<p>We are a startup that works on a cloud-based benchmarking solution for healthcare. However, we are new to HL7, and recently we have received a request for integration with an external system based on HL7 (FHIR) by subscribing to Patient Administration events broadcasted by this external system.</p>\n<p>So we need your advice and recommendations regarding the following enquiries:</p>\n<p>•       What is the recommended approach to follow to build an integrated FHIR interface (software component) that handles these messages and processes them (for logging, updating patient demographic information in SQL server database, add diagnosis…etc.).<br>\n•       Are there any recommended open-source projects that we can start from to build this component using DOTNET technology?<br>\n•       What are the best resources that will facilitate the understanding of the technical requirements to build this component?<br>\n•       Assuming we have 2 software developers, how much time is it estimated to have this component ready with the minimum acceptable specifications?</p>\n<p>Thanks in advance</p>",
        "id": 188212768,
        "sender_full_name": "Osama",
        "timestamp": 1581692110
    },
    {
        "content": "<p>FHIR doesn't standardize patient administration 'events', so you may need to drill into exactly what the external system is producing to know how to work with it.  Ideally they should have an implementation guide.  At minimum they should have a CapabilityStatement.  The .NET reference implementation (which includes open source parsers, serializers and a bunch of other stuff can be found on the <a href=\"http://hl7.org/fhir/downloads.html\" target=\"_blank\" title=\"http://hl7.org/fhir/downloads.html\">http://hl7.org/fhir/downloads.html</a> page.  In terms of estimating, that depends on the developers, what you're integrating with from the external system and the architecture of your own system.  FHIR is 'relatively' easy to work with, but estimates are always contextual.</p>",
        "id": 188216645,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581694660
    },
    {
        "content": "<p>IHE has an implementation guide for Patient Identity Management Service (PIMR) that likely fits your use-case. It is based on FHIR Patient resource, and includes a feed message that can be subscribed to. <a href=\"https://wiki.ihe.net/index.php/Patient_Master_Identity_Registry_(PMIR)\" target=\"_blank\" title=\"https://wiki.ihe.net/index.php/Patient_Master_Identity_Registry_(PMIR)\">https://wiki.ihe.net/index.php/Patient_Master_Identity_Registry_(PMIR)</a></p>",
        "id": 188217440,
        "sender_full_name": "John Moehrke",
        "timestamp": 1581695058
    }
]