[
    {
        "content": "<p>Hi,<br>\nwe are going to start with Profiling for our Solution in the near future and looking for the best tool to do that.<br>\nIf you search the internet the most found tool is  Forge (by firly). But I'm interested, which other tools are out there? Or is Forge the tool to go with?<br>\nCan you give us a feedback of the tools, you are using? Pros and Cons? I'm sure this will also help future implementers to get an overview.<br>\nThank you in advance for your feedback!<br>\nRegards,<br>\nJakob</p>",
        "id": 154023500,
        "sender_full_name": "Jakob Hartl",
        "timestamp": 1544108151
    },
    {
        "content": "<p>forge</p>",
        "id": 154023540,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544118896
    },
    {
        "content": "<p>We use a toolset we built at MITRE that we call CIMPL (Clinical Information Modeling and Profiling Language).  Instead of being a GUI tool (like Forge), it's a command-line tool to process files written in a text format (called CIMPL).  These files describe clinical models and their mappings to FHIR.  CIMPL tooling can generate profiles in DSTU2 and STU3 formats.  See: <a href=\"https://github.com/standardhealth/shr-cli/wiki\" target=\"_blank\" title=\"https://github.com/standardhealth/shr-cli/wiki\">https://github.com/standardhealth/shr-cli/wiki</a></p>",
        "id": 154023550,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1544121400
    },
    {
        "content": "<p>We design what we want using a table that looks like the difference tab that the IG publisher produces.<br>\nWe create the StructureDefinition with Forge.<br>\nSometimes we adjust StructureDefinition files with a text editor.</p>",
        "id": 154023604,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1544138408
    },
    {
        "content": "<p>there's also Trifolia - that offers a middle path:</p>\n<ul>\n<li>Forge : an editor for making profiles</li>\n<li>Trifolia: a design environment for writing profiles</li>\n<li>CIMPL - a DSL for designing clinical models and describing them as profiles</li>\n</ul>\n<p>Each of these has pros and cons and the righgt choice depends on what you are doing.</p>",
        "id": 154023632,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544143887
    },
    {
        "content": "<p>In addition, there is the MDHT profiling tool based on UML:<br>\n<a href=\"https://projects.eclipse.org/proposals/model-driven-health-tools\" target=\"_blank\" title=\"https://projects.eclipse.org/proposals/model-driven-health-tools\">https://projects.eclipse.org/proposals/model-driven-health-tools</a></p>\n<p>Forge specifically targets HL7 FHIR and started out as a reference implementation that aims to support all the available FHIR profiling features (not fully there yet, but quite close). Trifolia and MDHT have been around for a while and also provide support for older HL7 standards, so they're a bit more generic.</p>\n<p>BTW I am the lead developer of Forge, please don't hesitate to contact me if you have any questions.</p>",
        "id": 154024044,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1544440553
    },
    {
        "content": "<p>Hello,<br>\nWe are new to FHIR and  learning 'how to define the profiles'. during this exercise i came across a situation (mentioned below) and would like to know your views or recommended practices for such case,<br>\n\"For field of a data type 'Code' (<em>e.g. Condition.clinicalstatus</em>) if  target EHR system do not support all the values mentioned in standard spec  then how do we define such constraint also how to take care of case where EHR do also supports the values which are very specific &amp;  its not part of standard.\" </p>\n<p>Thanks in advance! Regards.</p>",
        "id": 163806012,
        "sender_full_name": "Kapil",
        "timestamp": 1555771383
    },
    {
        "content": "<p>You can use a valueset to limit allowed values.  For the second case, you should map your values to the hl7 valueset if at all possible.  If not possible, omit the element.  If need be you can also send your custom value in an extension.</p>",
        "id": 163806220,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555771726
    },
    {
        "content": "<p>Thanks Lloyd for  the response!<br>\nin case we can't omit values ( not part of standard spec) then is it acceptable  if instead of  using  field value (of code type) defined in base resource  we populate additional extension that supports both standard + specific value sets  ?  Regards</p>",
        "id": 163806507,
        "sender_full_name": "Kapil",
        "timestamp": 1555772180
    },
    {
        "content": "<p>If an element has a required binding, you can <em>only</em> include that element if it has a code from the specified value set.  If you can't map to one of the defined codes, you can't send that element at all.  So long as you can send one of the specified values, you're free to also send an extension (ideally as a child of that element) that conveys an alternate code, set of codes, free text, etc.</p>",
        "id": 163807909,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555774517
    }
]