[
    {
        "content": "<p>HI Team,</p>\n<p>I am Kavya, we are looking to create FHIR documents for time series of Fetal heart rate data. I saw in Observation resource we have an option to store EKG data. Therefore even we have thought to store our fetal heart rate in the ekg data tag under Observations resource.</p>\n<p>My Questions are:<br>\n1) We are just planning to create a FHIR document. Is it compulsory to create FHIR server or FHIR client to create a FHIR document?? Can i just use the Hapi library and insert values directly ??</p>\n<p>2) As i told earlier in this mail we are planning to store Fetal rate which is like 4 samples per second, and these samples have to be stored in FHIR document so we choose Observation resource under component. So the question is, are we thinking in right direction to store time series data in Observations resource??</p>\n<p>3) Can we modify the narrative to display ekg data in waveform format rather than simple text of data. This is because we need to display fetal heart rate in waveform format?</p>\n<p>Thanks in advance for the support.fhir/documentfhir/document</p>",
        "id": 153964261,
        "sender_full_name": "Kavya R",
        "timestamp": 1527051184
    },
    {
        "content": "<p>not sure what you mean by \"ekg data tag\" but there is a SampledData datatype that can represent ekg data within the Observation resource.</p>\n<p>By a \"FHIR Document\" I am assuming you mean everything bundled in a Composition including the Observation.</p>\n<p>regarding 2) Yes,  can use the SampledData datatype and handle multiple channels using components.  There is an example here:  <a href=\"http://hl7.org/fhir/observation-example-sample-data.html\" target=\"_blank\" title=\"http://hl7.org/fhir/observation-example-sample-data.html\">http://hl7.org/fhir/observation-example-sample-data.html</a></p>\n<p>3)  Yes,  you can put an image in there.</p>",
        "id": 153964268,
        "sender_full_name": "Eric Haas",
        "timestamp": 1527055691
    },
    {
        "content": "<p>Thanks Eric for reply. I have a quick question while creating FHIR observation do i compulsory need server and client or can i directly create FHIR observation with sample data using HAPI Library?</p>",
        "id": 153964319,
        "sender_full_name": "Kavya R",
        "timestamp": 1527072444
    },
    {
        "content": "<p>I don't understand the question.</p>",
        "id": 153964328,
        "sender_full_name": "Eric Haas",
        "timestamp": 1527081595
    }
]