[
    {
        "content": "<p>Hi FHIR chat - </p>\n<p>What is the preferred way to represent race for a resource (ex: Patient or RelatedPerson) if the coding does not fit into OMB Race Categories or Detailed Race, and thus, cannot be stored in the USCore race structure definition (<a href=\"https://www.hl7.org/fhir/us/core/StructureDefinition-us-core-race.html\" title=\"https://www.hl7.org/fhir/us/core/StructureDefinition-us-core-race.html\">https://www.hl7.org/fhir/us/core/StructureDefinition-us-core-race.html</a>)? </p>\n<p><strong>Some options are:</strong></p>\n<ol>\n<li>Store the data in a custom extension on the USCore race extension.</li>\n<li>Store the data in a custom extension separate to the USCore race extension.</li>\n<li>Store the data in the extension:detailed Extension and ignore the binding (is this valid?).  </li>\n</ol>\n<p>I have the same question for ethnicity and the USCore ethnicity extension (<a href=\"https://www.hl7.org/fhir/us/core/StructureDefinition-us-core-ethnicity.html\" title=\"https://www.hl7.org/fhir/us/core/StructureDefinition-us-core-ethnicity.html\">https://www.hl7.org/fhir/us/core/StructureDefinition-us-core-ethnicity.html</a>). </p>\n<p>Thanks!</p>",
        "id": 196197509,
        "sender_full_name": "Hannah Riggs",
        "timestamp": 1588606327
    },
    {
        "content": "<p>What is your intention with capturing the custom value?  Are you based in the U.S. or elsewhere?  Can you give an example of a value you'd want to capture that doesn't fit?</p>",
        "id": 196200808,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588607713
    },
    {
        "content": "<p>Thank you for the follow-up! </p>\n<ol>\n<li>The intention is that there is another value set that the application is using.</li>\n<li>Based in the U.S. </li>\n<li>An example would be wanting to use the code \"HAI\" for \"HAITIAN\" in ethnicity, but the USCore ethnicity value sets do not have this code as an option.</li>\n</ol>",
        "id": 196204002,
        "sender_full_name": "Hannah Riggs",
        "timestamp": 1588609076
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Thoughts?</p>",
        "id": 196205560,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588609678
    },
    {
        "content": "<p>Hmm, the US regulations requires race/ethnicity using the specified value sets -- <a href=\"https://www.healthit.gov/isa/sites/isa/files/2020-03/USCDI-Version1-2020-Final-Standard.pdf\" title=\"https://www.healthit.gov/isa/sites/isa/files/2020-03/USCDI-Version1-2020-Final-Standard.pdf\">https://www.healthit.gov/isa/sites/isa/files/2020-03/USCDI-Version1-2020-Final-Standard.pdf</a></p>",
        "id": 196206653,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1588610119
    },
    {
        "content": "<p>I don't think an extension is appropriate.</p>",
        "id": 196206842,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1588610184
    },
    {
        "content": "<p>An extension would be appropriate to convey <em>additional</em> information</p>",
        "id": 196206956,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588610229
    },
    {
        "content": "<p>Haitian is available in the race value set. If you believe this should be an ethnicity it would be wise to talk with CDC before using an extension</p>",
        "id": 196207894,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1588610682
    },
    {
        "content": "<p>Thank you for information. </p>\n<p>To clarify: the extension would be to convey additional information and the appropriate value sets would be used in the USCore structure definitions.</p>\n<p>Would it be preferable to have the extension with the additional information on the USCore structure definition or have it completely separate to the USCore extensions?</p>",
        "id": 196213788,
        "sender_full_name": "Hannah Riggs",
        "timestamp": 1588613553
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"298703\">@Hannah Riggs</span>  what Brett said is  this is  not a FHIR issue  Haitian is defined as a race by the US federal government rather than creating your own extension follow the code system definitions of race and put Haitian in the race extension.</p>",
        "id": 196225482,
        "sender_full_name": "Eric Haas",
        "timestamp": 1588618944
    },
    {
        "content": "<p>So Hannah didn't mention a critical component of the use case here. We are mapping what we can into the official USCore race and ethnicity value sets -- as best as we can. The problem is that we have a requirement to round-trip the race and ethnicity values back to the institution's (non-FHIR) based system. Since there's no one-to-one mapping of race and ethnicity between the institution's value set and the USCore value set, we've decided we'll need to store both. Hannah is simply asking for advice on the best way to store the source system's race and ethnicity values. We've already determined this will have to be in some sort of extension -- to convey this  <em>additional information</em> (as Lloyd Mckenzie put it), but we could use some extensions about where to put the extension and guidlines on how to name it.</p>",
        "id": 196228876,
        "sender_full_name": "Charles Frankston",
        "timestamp": 1588620644
    },
    {
        "content": "<p>I would create an extension on Patient not on the extension.</p>",
        "id": 196229616,
        "sender_full_name": "Eric Haas",
        "timestamp": 1588621017
    },
    {
        "content": "<p>Just arriving at this thread and I'm worried there are some misalignments happening. As Brett noted, in the US, Haitian is considered a Race and not an ethnicity. <span class=\"user-mention\" data-user-id=\"298703\">@Hannah Riggs</span> and <span class=\"user-mention\" data-user-id=\"196432\">@Charles Frankston</span>  Are you saying your implementation needs to represent Haitian as an ethnicity?</p>",
        "id": 196667671,
        "sender_full_name": "Robert McClure",
        "timestamp": 1588785635
    },
    {
        "content": "<blockquote>\n<p>Are you saying your implementation needs to represent Haitian as an ethnicity?</p>\n</blockquote>\n<p>More or less, yes. The institution is sending us both race and ethnicity. And they're sending us Haitian as an ethnicity (Haitian is just one example). So, we're doing the best we can to map to the US Core valuesets, but also preserving the original value and label (as an ethnicity). I don't think we're at the point where we want to take something that we got labelled as an ethnicity and change it to race (for USCore purposes), but that could be something worth considering. However, we'd still preserve the original coding using an extension, as it was originally marked (as an ethnicity), so we could round-trip it back to the legacy system.</p>",
        "id": 196684914,
        "sender_full_name": "Charles Frankston",
        "timestamp": 1588793469
    },
    {
        "content": "<p>Round-tripping would require an extension, but you'll still have to map to the standard value sets in order to comply with U.S. Core.  (You 'have' race and ethnicity so you need to map it somehow to be compliant.)</p>",
        "id": 196699180,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588800032
    }
]