[
    {
        "content": "<p>Can you help me design FHIR service interface between our EHR and client ? FHIR Server API isn’t helpful in realtime scanerio e-g how can I receive referral at EHR and send response back to client using FHIR? </p>",
        "id": 153870163,
        "sender_full_name": "kler",
        "timestamp": 1486354759
    },
    {
        "content": "<p>@<strong>Muhammad khalid</strong> You might look at the <a href=\"http://build.fhir.org/workflow-ad-hoc.html\" target=\"_blank\" title=\"http://build.fhir.org/workflow-ad-hoc.html\">http://build.fhir.org/workflow-ad-hoc.html</a> and <a href=\"http://build.fhir.org/workflow-management.html\" target=\"_blank\" title=\"http://build.fhir.org/workflow-management.html\">http://build.fhir.org/workflow-management.html</a> patterns in the draft STU 3 spec.  Those two pages describe a number of patterns for \"requesting action\" in FHIR and discuss some of the trade-offs around what you can accomplish with each approach.</p>",
        "id": 153870173,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486356118
    },
    {
        "content": "<p>thanks for your guidance. One more thing you if can help me.</p>\n<p>if someone sending Appointment Request to OUR EHR in FHIR format, does he has to send reference resources used in appointment along with appointment ??</p>\n<p>thanks</p>",
        "id": 153870687,
        "sender_full_name": "kler",
        "timestamp": 1486528051
    },
    {
        "content": "<p>In general, no.  It's perfectly legitimate to POST a resource where all the references point to things living on other servers.  Alternatively, they could exist on your server already from prior submissions.  If you want a way to receive a bunch of things at once, you'll need to look at transaction, operations, documents or messaging (different trade-offs and behaviors with different approaches)</p>",
        "id": 153870690,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486528630
    },
    {
        "content": "<p>thanks </p>",
        "id": 153870691,
        "sender_full_name": "kler",
        "timestamp": 1486528707
    }
]