[
    {
        "content": "<p>I have my FHIR server setup to use FHIR Version 3.0.1 but I see its now deprecated. Is there any problem with upgrading to  Version 3.0.2? And would it be better to go to v4.0.1?</p>",
        "id": 215603972,
        "sender_full_name": "Jefferson",
        "timestamp": 1604506570
    },
    {
        "content": "<p>Moving to 3.0.2 will have minimal impact.  Moving to 4.0.1 would be a complete change as there are many large changes between STU3 and R4.</p>",
        "id": 215604737,
        "sender_full_name": "David Pyke",
        "timestamp": 1604506923
    },
    {
        "content": "<p>Thanks why would one need to upgrade to R4?</p>",
        "id": 215605306,
        "sender_full_name": "Jefferson",
        "timestamp": 1604507141
    },
    {
        "content": "<p>It would be better to move to R4.. yes.   R4 has some of the core resources as Normative, meaning they will not be changed in a breaking way anymore.</p>",
        "id": 215605422,
        "sender_full_name": "John Moehrke",
        "timestamp": 1604507173
    },
    {
        "content": "<p>what would happen if we never upgrade to R4</p>",
        "id": 215605862,
        "sender_full_name": "Jefferson",
        "timestamp": 1604507353
    },
    {
        "content": "<p>If you are in the US, ONC has mandated R4 for providers, CMS for payers .</p>",
        "id": 215606052,
        "sender_full_name": "David Pyke",
        "timestamp": 1604507416
    },
    {
        "content": "<p>If never updated, all users and designers will slowly lose interoperability</p>",
        "id": 215606163,
        "sender_full_name": "David Pyke",
        "timestamp": 1604507456
    },
    {
        "content": "<p>Thanks for the information.</p>",
        "id": 215606355,
        "sender_full_name": "Jefferson",
        "timestamp": 1604507522
    },
    {
        "content": "<p>Does it make sense to make the interim update to 3.0.2 to avoid using a deprecated version?  Or do we hold on that and invest our time to go straight to R4?</p>",
        "id": 215607452,
        "sender_full_name": "Jefferson",
        "timestamp": 1604507955
    },
    {
        "content": "<p>THat would depend heavily on your resources but updating to 3.0.2 is a trivial changeset.</p>",
        "id": 215607764,
        "sender_full_name": "David Pyke",
        "timestamp": 1604508119
    },
    {
        "content": "<p>3.0.2 is just some technical corrections to fix some tooling stuff.  The spec itself is unchanged.  4.0 makes breaking changes.  In most cases, upgrading from 3.0.1 to 3.0.2 is just changing the value in your CapabilityStatement - no other impact.  I.e. minutes or hours to go 3.0.1 to 3.0.2 while you're looking at months or more to go from 3.x to 4.x.</p>",
        "id": 215608328,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1604508337
    },
    {
        "content": "<p>Thanks</p>",
        "id": 215609454,
        "sender_full_name": "Jefferson",
        "timestamp": 1604508779
    },
    {
        "content": "<p>Updating to R4 also depends on what resources you're using, you'd have to check the changes in each of the resources that you're working with for the diffs.</p>",
        "id": 215649861,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1604529318
    }
]