[
    {
        "content": "<p>Hello everyone <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> </p>\n<p>I feel like I do not fully understand FHIR. From my understanding it’s both a standard and an API?</p>\n<p>How does one gain access to the API? Does HL7 grant access or do you need access from organizations that use FHIR?</p>\n<p>Do the APIs grant access to anonymous bulk data or can I get a specific patient’s medical history? I believe it’s both… What patient information would I need in order to grab a patients medical records?</p>\n<p>I’m a developer and trying to fully understand the extent of functionality and limitations here.</p>\n<p>I apologize if these are super basic questions I should already know the answer to… I just came across FHIR recently and doing my due diligence.</p>\n<p>Any guidance would be much appreciated <span aria-label=\"pray\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"pray\">:pray:</span></p>",
        "id": 253770551,
        "sender_full_name": "Paul Jurczyk",
        "timestamp": 1631896903
    },
    {
        "content": "<p>Welcome to the community.</p>\n<p>FHIR is a standard that defines the function and behavior of APIs.  Each product will expose their own API that exposes some particular subset of the full capability that FHIR allows, and which reflects the capabilities of that particular system.  For example, each hospital, clinic, payer, lab, etc. would have their own server endpoint (or set of endpoints).  Some of these APIs will be based not only on the base FHIR standard, but also on specific FHIR implementation guides that more strictly specify what the capabilities of a system should be and how they should be exposed.  Different systems will expose wildly different sets of data and functions.</p>\n<p>For example, some FHIR systems will <em>only</em> expose terminology operations, allowing you to create and search for value sets and code systems, to validate codes, to expand value sets, etc.  They won't support any clinical data at all.  Other systems might expose an endpoint that allows you to generate and retrieve an International Patient Summary document, but otherwise give you no access to data.  US Core systems will let you query for patients, allergies, conditions, medication information, etc.  Access to each server is managed by the owner of the server.  Some are open public servers (we have a bunch of test servers linked to at the bottom of the FHIR home page that are like this).  Most will require OAuth, TLS or some other authentication to access.</p>\n<p>My recommendation for you is to Google \"FHIR Devdays Videos\" and watch one or two of the \"introduction to FHIR\" videos to get a better handle on the specification.  Also read the content linked to in the \"First time here?\" section on the home page of the FHIR specification.</p>",
        "id": 253772940,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631897975
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ! much appreciated. Okay that makes much more sense.</p>\n<p>i’ll definitely check those videos out. And thanks for the welcome!</p>",
        "id": 253793347,
        "sender_full_name": "Paul Jurczyk",
        "timestamp": 1631905997
    }
]