[
    {
        "content": "<p>In Dialysis Treatment, Vascular access is one of the vital procedures.</p>\n<p>Overview on vascular access: <br>\nBefore beginning hemodialysis treatment, a person needs an access to their bloodstream, called a vascular access. The access allows the patient’s blood to travel to and from the dialysis machine at a large volume and high speed so that toxins, waste and extra fluid can be removed from the body.</p>\n<p>In reality, creating an access to a patient involves multiple procedures (like access cannulation, fistulagram, infiltration etc) performed during different time periods, therefore we cannot map an Access to a single Procedure FHIR resource. Typically more than one Procedures performed can be related to single Vascular Access.</p>\n<p>In our existing non-fhir model, we have maintained VascularAccess as a separate domain entity (or Resource) which essentially contains but is not limited to,<br>\n1. Access type - AV Fistula (Arteriovenous Fistula) / AV Graft / Catheter<br>\n2. Access sub type - Bovine / Standard / Double Cuff / Tunneled<br>\n2. Body site (whereWasAccessPlaced) - Above Elbow / below Elbow / Right Lower Quadrant<br>\n3. Access status -- Active / Maturing / Removed / Permanently unusable</p>\n<p>We are trying to find an appropriate FHIR resource for mapping Access,</p>\n<p>Here is our open question?</p>\n<p>1. Can we consider a Vascular Access as a Device or DeviceComponent?<br>\n    below are the various access types,</p>\n<div class=\"codehilite\"><pre>AV Fistula - its a method of connection between an artery and a vein which doesn&#39;t involve any DeviceComponent but blood vessels.\nAV Graft - A graft is tube (Device) that is inserted to connect an artery to a vein.\nCathether - it could be a Device component.\n</pre></div>\n\n\n<p>We would ideally need a Resource which would map the access type with a BodySite(location) and with an operational status.</p>\n<p>Thanks,<br>\nVijay</p>",
        "id": 153851464,
        "sender_full_name": "Vijay Thangavelu",
        "timestamp": 1475263527
    }
]