[
    {
        "content": "<p>Hi, our use case requires use of FHIR without WEB/Internet. So multiple health organisations/clinics would be using our system to store data/resources locally. Their would also be transfer of resources between organisations. We are not quite sure how to implement this.</p>",
        "id": 153844555,
        "sender_full_name": "Mithilesh Gupta",
        "timestamp": 1471793336
    },
    {
        "content": "<p>How would you expect them to communicate?  Private network?  Physical media?</p>",
        "id": 153844561,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1471804356
    },
    {
        "content": "<p>Common to use loopback. Your server can bind to 127.0.0.1 to make sure that it only receives requests from local applications. This is not security, but is technical approach to limiting visibility. You still need to have security methods because you need to address risks, such as malicious app that i also local.</p>",
        "id": 153844562,
        "sender_full_name": "John Moehrke",
        "timestamp": 1471807014
    },
    {
        "content": "<p>I have been thinking that a message type bundle is be something you could use for file based communication (if needed) because it has all the required context (sender, receiver, purpose) in the MessageHeader Resource. Though FHIR does not define Endpoints for file exchange...</p>",
        "id": 153844631,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471876393
    },
    {
        "content": "<p>FHIR schema is a data model. You can use any communication protocol to transfer FHIR data.</p>",
        "id": 153844668,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1471892110
    },
    {
        "content": "<p>Including writing it to a DVD and sticking it in a FedEx envelope . . . :)</p>",
        "id": 153844684,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1471902167
    },
    {
        "content": "<p>In STU3 there is the Endpoint resource that could be used for that. (still in draft)<br>\n<a href=\"http://hl7-fhir.github.io/endpoint.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/endpoint.html\">http://hl7-fhir.github.io/endpoint.html</a></p>",
        "id": 153844691,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1471908598
    }
]