[
    {
        "content": "<p>I am currently working on the tool that is able to compare two versions of fhir and show the differences in structure definitions/search params, etc. I ve encountered the following problem: in general there is no way to determine renaming of elements. Now I just compare names and if one is the substring of the other elements are labelled the same. So I wonder if fhir community can provide (preferrably machine readable) changelog from which I can easily identify that type of change. Or maybe there is the other solution which I do not see?</p>",
        "id": 153871188,
        "sender_full_name": "Tim Zallin",
        "timestamp": 1486979551
    },
    {
        "content": "<p>there's a file in the build called fhir.ini. In that file, there's an incomplete list, in the section [r2-renames]</p>",
        "id": 153871194,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486981539
    },
    {
        "content": "<p>you're welcome to contribute to this list. </p>",
        "id": 153871195,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486981546
    },
    {
        "content": "<p>but generally, the equivalency is quite difficult to establish in 5% of the cases.</p>",
        "id": 153871196,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486981564
    },
    {
        "content": "<p>have you looked at the comparison in the specification itself?</p>",
        "id": 153871197,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486981576
    },
    {
        "content": "<p>found it, thanks. It shows renames in stu3 (december 2016) compared to dstu2, right? As for the official diff I ve seen it and actually it seemed not very comfortable to use. Besides, it only supports versions I mentioned earlier.  I think it will be better if there is a special place where one can view diff of two arbitrary versions of fhir.</p>",
        "id": 153871235,
        "sender_full_name": "Tim Zallin",
        "timestamp": 1487003691
    },
    {
        "content": "<p>In principle, there's a new version of FHIR every 20 minutes some days, so that's a challenging thing to maintain.  It's enough work to maintain for the official releases.  If someone wants a map for an interim release, they can use the full release mappings as a guide.</p>",
        "id": 153871236,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487003788
    },
    {
        "content": "<p>thank you, I ll try to do it this way</p>",
        "id": 153871239,
        "sender_full_name": "Tim Zallin",
        "timestamp": 1487005260
    },
    {
        "content": "<p>both the fhir.ini and the official diff are R2 vs Current. I do not maintain maps for anything but released STU versions and current</p>",
        "id": 153871249,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487013848
    }
]