[
    {
        "content": "<p>I did a search both on this board and the FHIR doc site.  I really like the format and content of the FHIR resource documentation (thank you all for the great work on it).  I'd like to use the same format for documenting our own services.  Can anyone guide me to the toolset / templates used to maintain the resource pages or let me know if they are in anyway proprietary?  Thanks in advance...</p>",
        "id": 153901320,
        "sender_full_name": "Jim Kreth",
        "timestamp": 1502297261
    },
    {
        "content": "<p>Hi Jim,</p>",
        "id": 153901348,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502301418
    },
    {
        "content": "<p>The source for the FHIR specification is freely available from HL7's SVN site (if you don't have a gForge account yet, you can log on as \"anonymous\" with no password).  There's documentation about how to use the build environment here: <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Build_Process\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Build_Process\">http://wiki.hl7.org/index.php?title=FHIR_Build_Process</a>.  That said, if you're creating specifications based on FHIR, you probably want to use the FHIR IGPublisher.  There are a number of implementation guides that provide a look and feel similar to the FHIR spec and can directly consume profiles and other IG materials.  We're working on putting together a standard framework for that, but in the meantime, you can look at specifications like the SDC specification <a href=\"https://github.com/HL7/sdc\" target=\"_blank\" title=\"https://github.com/HL7/sdc\">https://github.com/HL7/sdc</a></p>",
        "id": 153901350,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502301676
    },
    {
        "content": "<p>Thanks Lloyd, I'll dig into these links.</p>",
        "id": 153901359,
        "sender_full_name": "Jim Kreth",
        "timestamp": 1502303691
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  how many days will take to get gForge account after registration?</p>",
        "id": 153901413,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1502339411
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span> In theory one business day, but over the summer it can take longer.  I've gone in and granted you approval.  Look for a confirmation email in your inbox or spam box.</p>",
        "id": 153901422,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502342027
    },
    {
        "content": "<p>thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 153901423,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1502342143
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153901429,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1502346840
    },
    {
        "content": "<p>Okay, that seems rather intense. At the moment I am looking at the Forge use of the ImplementationGuide structure definition. Populating most of these elements seems reasonably straight forward until one gets to the pages. I assume that is the place where a great deal of human readable content goes. It is also very 'free-form'. As far as I can tell I can put whatever I want in these pages... oh clearly with the intent to help the reader of the pages to understand how to implement the profiles</p>\n<p>The tricky part to this is the links between the pages and structure definition itself. I come up against the same problem as with the links to profiles. Sure I can create a profile, but where am I supposed to put them? At the moment I make up a URL that will do nothing but give a 404 error should one try and navigate to the link since I do not know what to do with that. But I need a legal URL to stop errors.</p>\n<p>The same is true of these Implementation Guide pages. Do they end up going in the same place as the profiles?</p>",
        "id": 153902509,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1502809035
    },
    {
        "content": "<p>THe IG resource represents the artifacts that will populate the IG. (think of it as a glorified table of contents.)   It doesn't create an IG without tooling.  Lloyd makes it work through his magic and I think David has done something in clinFHIR too.  I don't know if Furore does something  similar as well.</p>",
        "id": 153902533,
        "sender_full_name": "Eric Haas",
        "timestamp": 1502812287
    },
    {
        "content": "<blockquote>\n<p>THe IG resource represents the artifacts that will populate the IG. (think of it as a glorified table of contents.)   It doesn't create an IG without tooling.  Lloyd makes it work through his magic and I think David has done something in clinFHIR too.  I don't know if Furore does something  similar as well.</p>\n</blockquote>\n<p>Well Forge has an ImplementationGuide option but at the moment I am just creating *.md files for the 'page' element. I don't think is generates a document or a set of linked html files from it but I do have a set of xml profiles and am starting on a set of 'pages'.</p>",
        "id": 153902534,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1502812463
    },
    {
        "content": "<p>the IG resource doesn't have to list all or even any of the pages. The intent is that it can list key entry point pages (toc, version history etc) and tools can jump a user straight to them</p>",
        "id": 153902568,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502850013
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> this comes as a bit of a surprise...? I always assumed the IG.pages element was intended to represent the full content structure with links to all pages. This is what we're currently planning to generate from the IG editor in our Simplifier platform.</p>",
        "id": 153902582,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1502883235
    },
    {
        "content": "<p>The IG publisher uses IG.pages to generate a table of contents fragment.  Any pages that aren't listed there won't show up.</p>",
        "id": 153902613,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502890505
    },
    {
        "content": "<p>OK, that makes sense. So the IG.pages component should not be considered to represent a complete manifest of all the content in the IG. I'll keep that in mind.</p>",
        "id": 153902615,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1502890959
    },
    {
        "content": "<p>it <em>can</em> list everything. But it doesn't have to</p>",
        "id": 153902616,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502891263
    },
    {
        "content": "<p>it sort of depends how you lay the content out.</p>",
        "id": 153902617,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502891288
    },
    {
        "content": "<p>Understood, thanks for the insight.</p>",
        "id": 153902620,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1502892226
    },
    {
        "content": "<p>I think in Simplifier we will have to require that the pages tree has the complete manifest. Otherwise, we have no way to specify what to put in an export (zip).</p>",
        "id": 153902621,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1502892576
    },
    {
        "content": "<p>Since ImplementationGuide.binary and  ImplementationGuide.package also need to be exhaustive for that.</p>",
        "id": 153902624,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1502893171
    },
    {
        "content": "<p>I have been looking at the pages  in IG resource and how is it different from a site map?   Can I generate the site map from it or vice versa?</p>",
        "id": 153902635,
        "sender_full_name": "Eric Haas",
        "timestamp": 1502901553
    },
    {
        "content": "<p>The IGPublisher does generate a table of contents wish is essentially a site map (with section numbers)</p>",
        "id": 153902648,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502912404
    },
    {
        "content": "<p>So, the IG resource is a manifest for all the 'regular' FHIR resources, it's a manifest for all the css, images and other binary content, but it's not a manifest for the pages? Or do you also store those in the binary content?</p>",
        "id": 153902752,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1503044475
    },
    {
        "content": "<p>It doesn't need to be a manifest for the binary content either.  The only thing it must point to are the resources.  If you point to all the pages, you'll get a table of contents.  I haven't found a good reason to point to the binary content yet.</p>",
        "id": 153902778,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1503075372
    },
    {
        "content": "<p>So <span class=\"user-mention\" data-user-id=\"191335\">@Martijn Harthoorn</span>  and  <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> ,  what do you want in the IG resource to make all the magic on your end happen?   all the conformances resources, examples, pages, images?</p>",
        "id": 153902802,
        "sender_full_name": "Eric Haas",
        "timestamp": 1503091052
    },
    {
        "content": "<p>Well, to be honest I really haven't put a lot of thought into the next steps. The main goal I had was to be able to represent graphically all the resources in the IG, and for that I needed the resources. Links to pages &amp; examples are a logical next step if the tooling was to extend to a more complete display...   Is there a good example that we could experiment with?</p>",
        "id": 153902803,
        "sender_full_name": "David Hay",
        "timestamp": 1503092180
    },
    {
        "content": "<p>Mine are minimal.  Lloyds are probably complete since that what drives all his preprocessing.</p>",
        "id": 153902804,
        "sender_full_name": "Eric Haas",
        "timestamp": 1503093793
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ?</p>",
        "id": 153902808,
        "sender_full_name": "Eric Haas",
        "timestamp": 1503094265
    },
    {
        "content": "<p>I need all of the pages and resources to be listed.  I have no need for binaries and other artifacts<br>\n.</p>",
        "id": 153902825,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1503101959
    },
    {
        "content": "<p>Does is reflect the page heirarchy (like a visual sitemapping) or is it a flat list of pages?</p>",
        "id": 153902872,
        "sender_full_name": "Eric Haas",
        "timestamp": 1503169087
    },
    {
        "content": "<p>It reflects the hierarchy in which the pages are nested in the ImplementationGuide.</p>",
        "id": 153902886,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1503196954
    },
    {
        "content": "<p>is sdc a good example?</p>",
        "id": 153902889,
        "sender_full_name": "Eric Haas",
        "timestamp": 1503267895
    },
    {
        "content": "<p>That should do. I'll have a play :)</p>",
        "id": 153902899,
        "sender_full_name": "David Hay",
        "timestamp": 1503282728
    },
    {
        "content": "<p>btw - I assume that the zip download  is the standard output from the IG tool? (in terms of folder structure in particular)...</p>",
        "id": 153902900,
        "sender_full_name": "David Hay",
        "timestamp": 1503284006
    },
    {
        "content": "<p>Our current status is that a Simplifier project can contain FHIR resources, images, page contents (.md, etc) and one or more IG resources. And in order to do a sensible export of an IG (zip) we need a manifest. Because otherwise we can only export the project as a whole. Thinking of a use case where we have an IG in more than one language or more than one target audience, not all content in the project is relevant for each IG.</p>",
        "id": 153902989,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1503323089
    },
    {
        "content": "<p>I'm not sure what you are saying...</p>",
        "id": 153902990,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1503323157
    },
    {
        "content": "<p>What is needed for an exporting an implementation guide (zip) is a subset of the files that are in a project. So for that we need some form of manifest (a complete description of all needed files to render the IG and/or to build a FHIR server). And until now I assumed that the IG-resource would serve that purpose.</p>",
        "id": 153902991,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1503323443
    },
    {
        "content": "<p>no one here has said that it can't, only that it doesn't have to</p>",
        "id": 153902992,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1503323482
    },
    {
        "content": "<p>That's good to hear :)</p>",
        "id": 153902993,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1503323496
    },
    {
        "content": "<p>however my experience is that there are 2 distinct purposes at play here - presenting a published IG, and publishing one.</p>",
        "id": 153902994,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1503323519
    },
    {
        "content": "<p>I think we are talking here about 'presenting  a published IG' specifically using the IG resource.   For 'publishing one' because you need more than the IG resource to do it as is evidence by the need for a configuration file and the ensuing discussion on this stream.</p>",
        "id": 153902997,
        "sender_full_name": "Eric Haas",
        "timestamp": 1503324813
    },
    {
        "content": "<p>can't those \"other things that are needed\" also be stored as resources? (media)?<br>\n(sorry if it does not make sense)</p>",
        "id": 153903015,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1503334172
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153903016,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1503334192
    },
    {
        "content": "<p>the could be. the question is whether they should be</p>",
        "id": 153903054,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1503343858
    }
]