[
    {
        "content": "<p>I have two hopefully simple questions about FHIR Server Addresses/Endpoints and obtaining Client IDs:</p>\n<p>1) How does one go about determining the address for a given health system's FHIR server? I had identified a list provided by EPIC here: <a href=\"https://open.epic.com/MyApps/Endpoints\" target=\"_blank\" title=\"https://open.epic.com/MyApps/Endpoints\">https://open.epic.com/MyApps/Endpoints</a>. However, these do not seem to work for us for whatever reason. Also, if a system is not EPIC, where is their FHIR server address published?</p>\n<p>2) Is it necessary to obtain a unique Client ID from each individual EHR/FHIR server being addressed or is this registered in a single location for use on many health systems? Using the Apple Health App as an example - would there be a separate Client ID for the app for each individual \"account\" a user sets up?</p>\n<p>Apologies ahead of time if these questions belong elsewhere!</p>",
        "id": 162856124,
        "sender_full_name": "Aaron Pearson",
        "timestamp": 1554758369
    },
    {
        "content": "<p>1) there is no published address. This is the best available list: <a href=\"#narrow/stream/179190-united-states/topic/Publishing.20FHIR.20end.20points\" title=\"#narrow/stream/179190-united-states/topic/Publishing.20FHIR.20end.20points\">https://chat.fhir.org/#narrow/stream/179190-united-states/topic/Publishing.20FHIR.20end.20points</a>. And yes, that's a problem</p>\n<p>2) yes it is necessary until there is some delegated registration authority. but there is not one, and no discussion about having one.</p>",
        "id": 162858361,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554760254
    },
    {
        "content": "<p>Regarding question 2, how about these guys: <a href=\"https://1up.health/health-systems\" target=\"_blank\" title=\"https://1up.health/health-systems\">https://1up.health/health-systems</a><br>\nAm I reading right that they are acting as a single entry point for many health systems?</p>",
        "id": 162864045,
        "sender_full_name": "Aaron Pearson",
        "timestamp": 1554765768
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197054\">@Ricky Sahu</span></p>",
        "id": 162875203,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554778214
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"210578\">@Aaron Pearson</span> There are two paths forward on that list from epic if you want to DIY. First you need to get epic to approve you for production access which take a bit of time. In addition to that there are many health systems that are unlisted  or from other EHR vendors that require explicit whitelisting from that health system. That's not necessarily a new client id / secret per org but effectively so, through the whitelist</p>\n<p>And if you want to go through 1up, yes we are a single entry point to many health systems. In addition to the basic approval that we have, we also canonicalize the fhir-ish implementation of the health systems to THE spec, so as a dev you dont have to deal with inconsistencies in access and structure.</p>",
        "id": 162876159,
        "sender_full_name": "Ricky Sahu",
        "timestamp": 1554779390
    },
    {
        "content": "<blockquote>\n<p>Is it necessary to obtain a unique Client ID from each individual EHR/FHIR server being addressed</p>\n</blockquote>\n<p>Cerner, Epic, Allscripts and I think eClinicalWorks have a central registration system: you register the app with the vendor and the client id is good for all end points using their system. For others the registration is per-endpoint (eg Meditech, CareEvolution)</p>",
        "id": 162889712,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1554797225
    },
    {
        "content": "<p>Are you referring to \"open.epic\"? Has anyone completed their registration process?  Open.epic requires ONC Health IT Certification, which seems complicated, especially if your app is still under development or has limited resources. My communications with Epic have been... slow, didn't seem like they were interested in third-party developers.</p>",
        "id": 162930570,
        "sender_full_name": "Beltran Figueroa",
        "timestamp": 1554830582
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217596\">@Beltran Figueroa</span> We are Epic AppOrchard member and our communication with Epic is pretty smooth.</p>",
        "id": 163333757,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1555274533
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"210578\">@Aaron Pearson</span> I think you were trying to connect to hospital's FHIR server. In order to do that, your app need to be approved by Epic AppOrchard then you can communicate with hospital about installing app on hospital's server.</p>",
        "id": 163333862,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1555274702
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>. Do you remember how long it took you to receive access to AppOrchard since you first submitted the request to Epic? How easy was the signup process, did Epic ask for any type of certification? Does AppOrchard automatically give you access to read EHR data (not to install the app on the hospital's server or to edit EHR data) or do you need to submit a separate request to Epic to grant you permission?</p>",
        "id": 163334767,
        "sender_full_name": "Beltran Figueroa",
        "timestamp": 1555275911
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217596\">@Beltran Figueroa</span>  I don't remember how long it will take. We have been AppOrchard member for a long time. You can go to <a href=\"https://apporchard.epic.com/\" target=\"_blank\" title=\"https://apporchard.epic.com/\">https://apporchard.epic.com/</a> and contact them for details.</p>",
        "id": 163335204,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1555276525
    }
]