[
    {
        "content": "<p>heads up all - by the end of this year the FHIR revision will have rolled over past 10000. If you assume string order, of 4 digits, you'll be caught out...</p>",
        "id": 153839340,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468842601
    },
    {
        "content": "<p>Hi Grahame, I have a query related to CCDA - CCD file. In case we want to store multiple CCD files of same patient then how should we compare the data in that case? In CCD file there are two levels of id available - one at section level and other at entry level. Should we consider both id for identifying existing data or entry level id is sufficient for that?</p>",
        "id": 153839975,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1469004063
    },
    {
        "content": "<p>I think you'll haev to give me more context. is this in regard to FHIR? </p>",
        "id": 153840081,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469051395
    },
    {
        "content": "<p>Hi Grahame, I am working on CCDA to FHIR mapping. First time patient will upload CCDA file on portal in which data will be converted into fhir and will get stored in DB. Again he uploads one more CCDA file with existing  and new entries in the file. Now at the time of storing the data in DB, how will I identify whether the entry is already existing or new one?</p>",
        "id": 153840212,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1469080157
    },
    {
        "content": "<p>Let me know.. if you need anything else..</p>",
        "id": 153840522,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1469164846
    },
    {
        "content": "<p>my opinion is that you cannot know whether it's already existing or not. <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> might offer an opinion</p>",
        "id": 153840523,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469165203
    },
    {
        "content": "<p>Hi Grahame.. so another query related to this only.. if a patient gets CCDA - CCD file from hospital with some observations containing unique id. After some days, if he gets another CCDA - CCD file from the same hospital so in this case previous observations will contain same id (as existing in previous doc) or different one?</p>",
        "id": 153840528,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1469165476
    },
    {
        "content": "<p>my experience is that the answer is mostly no, and that you can't tell from looking at the document</p>",
        "id": 153840529,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469165769
    },
    {
        "content": "<p>Thanks.. that means it will complicate the scenario in case we want to handle ccda file merge in fhir</p>",
        "id": 153840530,
        "sender_full_name": "Ankita Srivastava",
        "timestamp": 1469165882
    },
    {
        "content": "<p>yep. that's going to be extremely hard because of that specific issue. </p>",
        "id": 153840531,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469165950
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> - a blog post subject for you....</p>",
        "id": 153840532,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469165970
    }
]