[
    {
        "content": "<p>Hello, I was hoping I could received some feedback from those experienced in machine learning and the FHIR standard. <br>\nWe're a young health startup that has received many clinical datasets that we use for training our models but will never share. We're currently working on translating all of these datasets into a standardized database, but are wondering if in the process we should also make this FHIR compliant, with an understanding that this take up more overhead, something that we're wary of as we're quite lean. Does anyone have any experience with this? Would it be worthwhile for our own sake and if in the future we start receiving more datasets in the FHIR standard?</p>",
        "id": 174384807,
        "sender_full_name": "Caitrin Armstrong",
        "timestamp": 1567013854
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194833\">@Patrik Sundberg</span> <span class=\"user-mention\" data-user-id=\"194832\">@Eyal Oren</span></p>",
        "id": 174387053,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567015417
    },
    {
        "content": "<p>in principle, my answer is that using a standard front-loads the process of encountering requirements. You'll encounter many requirements you do not currently have, and that's a tax which people often rebel against. But your own lean data model will be based on inadequate requirements gathering (it must be; you are lean and simply can't gather requirements the way an open community does).  so you are loading your data model with a future technical debt. </p>\n<p>OTOH If you use a standard, you will encounter both the requirements in your future, and also ones that are not in your future. Picking those apart... you can't do that for the same reason</p>\n<p>So it's a case of pick your poison, really. It's a business decision based on when you want costs to be due. But I always counsel that in your crown jewels, you do not want technical debt.</p>",
        "id": 174394240,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567020775
    },
    {
        "content": "<p>In addition I'll point to a blog post of the two fine gentlemen Lloyd mentioned: <a href=\"https://ai.googleblog.com/2018/03/making-healthcare-data-work-better-with.html\" target=\"_blank\" title=\"https://ai.googleblog.com/2018/03/making-healthcare-data-work-better-with.html\">https://ai.googleblog.com/2018/03/making-healthcare-data-work-better-with.html</a></p>",
        "id": 174865361,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1567589497
    },
    {
        "content": "<p>That is an extremely elegant framing of the issues <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> !</p>",
        "id": 174961461,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1567679733
    },
    {
        "content": "<p>thx</p>",
        "id": 174961608,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567679906
    }
]