[
    {
        "content": "<p>Hi<br>\nIn the real world a user likes to be able to delete objects; the scenario typically being \"Ups, I did create this in error\" (E.g. registering an observation on a wrong patient).<br>\nIn general I have experienced the following two very different approaches to support this:<br>\n1) deleted is treated as a status of a object. A deleted object will stilled by retrived by a \"getById\"-service. However the deleted object cannot be updated. Such a deletion can be communicated as a update-message (\"just a change of status\").<br>\nThis is basically the approach taking by HL7 version 3 (all Acts can become nullified). <br>\n2) deleted is treated as a special state of the object (like putting it in the dustbin). A deleted object will normally not be retrived by a verison-unaware \"getById\"-service and as a web service such a service would return a 404-status code. The object-model itself may not know it is deleted. Deletion is communicated as special delete message.<br>\nIn FHIR it seems that we do not have a generic \"nullified\" status, which leads towards appproach 2 (or some other aproach)?<br>\nDo we have some agreed approah to handling deleted objects in FHIR - or should the approach be dependent on the business case?</p>",
        "id": 153867813,
        "sender_full_name": "Allan Bro Hansen",
        "timestamp": 1484657710
    },
    {
        "content": "<p>see here: </p>",
        "id": 153867815,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484657826
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/lifecycle.html#error\" target=\"_blank\" title=\"http://build.fhir.org/lifecycle.html#error\">http://build.fhir.org/lifecycle.html#error</a></p>",
        "id": 153867816,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484657938
    },
    {
        "content": "<p>there's a reason why it's not all the same, but typically, there is high coherence within general areas (infrastructure, administration, clinical). We are driving for more consistency in this area, but there is much contention about the principles </p>",
        "id": 153867818,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484658016
    },
    {
        "content": "<p>thx, that's quite new, isn't it? I haven't seen \"entered-in-error\" as an appointment status before.</p>",
        "id": 153867819,
        "sender_full_name": "Allan Bro Hansen",
        "timestamp": 1484658119
    },
    {
        "content": "<p>yes, that's something that we've been driving the committees to deal with</p>",
        "id": 153867820,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484658263
    },
    {
        "content": "<p>very nice :-)</p>",
        "id": 153867821,
        "sender_full_name": "Allan Bro Hansen",
        "timestamp": 1484658602
    },
    {
        "content": "<p>Also look at the various policy driven ways to say that something doesn't exist. Often the policy is security, but it can also be data retention policy...  <a href=\"http://build.fhir.org/security.html#AccessDenied\" target=\"_blank\" title=\"http://build.fhir.org/security.html#AccessDenied\">http://build.fhir.org/security.html#AccessDenied</a></p>",
        "id": 153867828,
        "sender_full_name": "John Moehrke",
        "timestamp": 1484664235
    },
    {
        "content": "<p>yes, the appointment was updated to include the entered-in-error status. (or could just DELETE it if the internal server's business rules permitted it)</p>",
        "id": 153868701,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1484951570
    },
    {
        "content": "<p>Or both... First Update the status, then Delete... and record an AuditEntry</p>",
        "id": 153868736,
        "sender_full_name": "John Moehrke",
        "timestamp": 1485029306
    },
    {
        "content": "<p>(yes to the please record an AuditEntry!)</p>",
        "id": 153868768,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1485140637
    }
]