[
    {
        "content": "<p>Hi,</p>\n<p>Could you please help me with the query below, We have the following use-cases to be modelled in FHIR STU3.</p>\n<ol>\n<li>we are modelling the substance values and referring the WHO ATC codes (example : <a href=\"https://www.whocc.no/atc_ddd_index/?code=A05BA09\">https://www.whocc.no/atc_ddd_index/?code=A05BA09</a>) which has a parent-child relationship like below:</li>\n</ol>\n<p>ATC code - Name  <br>\nA -  ALIMENTARY TRACT AND METABOLISM<br>\nA05 -  BILE AND LIVER THERAPY<br>\nA05B -  LIVER THERAPY, LIPOTROPICS<br>\nA05BA -  Liver therapy<br>\nA05BA09 - metadoxine    </p>\n<p>for direct modelling of a substance like metadoxine, we can use substance resource to do FHIR modelling. <br>\nnow we have a use case if the metadoxine is the substance, then all the related ATC codes like A, A05, A05B, A05BA, A05BA09 should be added as a  parent-child relationship.</p>\n<p>we see there is a resource called 'Group' which can have substance as grouped, but we don't have parent-child hierarchy relationship here.  Do you suggest any other way of handling this? </p>\n<ol start=\"2\">\n<li>also we want to model the substance family, in the substance resource there is way to link to other substances but those are ingredients, no families. is introducing an extension the only way ?</li>\n</ol>",
        "id": 243766104,
        "sender_full_name": "Chandru",
        "timestamp": 1624530526
    },
    {
        "content": "<p>hi Chandru, in FHIR R4 and R5 build there is SubstanceDefinition (called SubstanceSpecification in R4) which covers some of this and has relationships between substances, and an Ingredient resource also. </p>\n<p>Obviously if you are on STU3 then that doesn't help you, but it may be of interest. For STU3 I would consider an extension on Substance to act like the relationship that exists in R5 SubstanceDefinition (<a href=\"http://build.fhir.org/substancedefinition-definitions.html#SubstanceDefinition.relationship\">http://build.fhir.org/substancedefinition-definitions.html#SubstanceDefinition.relationship</a>). I don't think Group will really help you, for the reasons that you mention. At any rate, even if you cannot use it, we would be interested to know if what is in R5 (and in R4B) would be usable.</p>\n<p>One question I had is if, in your view, a substance has an ATC or if that is really a property of a medication (medicinal product). Usually I have seen ATC applied to the medication, and not to the ingredient or the substance. So you may also want to consider a hierarchy of R5/R4B MedicinalProductDefinitions, rather than substances. We usually use a medication/product if it is something that a patient will take, even when it is really only a substance (even water is a medication).</p>",
        "id": 243776166,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1624537107
    },
    {
        "content": "<p>Hi Rik, Thank you for your suggestions. Yes, considering STU 3 we are also thinking extensions are the best options and unfortunately we couldn't use SubstanceDefinition as we are not using R4 / R5 and also still it is in maturity 0 for trial usage. </p>\n<p>regarding your consideration on Medication for ATC codes, we are using substances considering we have use case of having composed substances. so currently we have one Medication resource for each substance resource.</p>",
        "id": 243897650,
        "sender_full_name": "Chandru",
        "timestamp": 1624616513
    },
    {
        "content": "<p>If you just need the codes and the hierarchical relationship, you can use CodeSystem.  Otherwise, in STU3 I'd probably use Medication with extensions.</p>",
        "id": 243917574,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624628861
    },
    {
        "content": "<p>Hi Lloyd, Thank you for the response, yes codes are good option. do you have any samples for codes with hierarchy relationship that we can refer.</p>",
        "id": 244138986,
        "sender_full_name": "Chandru",
        "timestamp": 1624884539
    },
    {
        "content": "<p>A relatively simple code system with hierarchy is here: <a href=\"https://build.fhir.org/codesystem-issue-type.html\">https://build.fhir.org/codesystem-issue-type.html</a></p>",
        "id": 244166531,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624895931
    },
    {
        "content": "<p>Thanks Lloyd</p>",
        "id": 244404883,
        "sender_full_name": "Chandru",
        "timestamp": 1625049987
    }
]