[
    {
        "content": "<p>If I constrain something in my profile from 0..* to 0..1, in my JSON payload should i still include the array square brackets [] or leave them out?</p>",
        "id": 153943596,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1520691352
    },
    {
        "content": "<p>The schema (and thus whether something is an array or not) is determined by the resource, not the profile.  So it should definitely have the brackets.  That said, be cautious about constraining the upper cardinality.  Never constrain the upper cardinality when you can instead slice and set an expectation for a lower number of elements that meet your criteria.  For example, don't limit <a href=\"http://Patient.name\" target=\"_blank\" title=\"http://Patient.name\">Patient.name</a> to 0..1, instead set an expectation that there is no more than one legal name with no end date.  That way systems with multiple names can continue to send what they have - to you and everyone else - while you can find the data you need.  That means that client systems won't need to create a custom interface to talk to you whose only purpose is to strip out elements you might ignore.  (If there's no 'core' way to filter to the element you need, then define an extension.  For example, add an \"address for use in secondary billing to hospital XYZ\" flag and require that extension to appear on exactly one address.  There's a bit of extra work for your client systems to populate the flag, but they can then still send the same set of addresses to everyone - and other servers will just ignore your special extension.)</p>",
        "id": 153943611,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1520697813
    },
    {
        "content": "<p>Ok great, thanks Lloyd. <br>\nNote: <span class=\"user-mention\" data-user-id=\"195376\">@Shamhad Abdi</span> , <span class=\"user-mention\" data-user-id=\"193795\">@Joel Francis</span> , <span class=\"user-mention\" data-user-id=\"192256\">@Smita Kachroo</span> <span class=\"user-mention\" data-user-id=\"194615\">@Tue</span> <span class=\"user-mention\" data-user-id=\"192708\">@John Wills</span></p>",
        "id": 153943619,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1520702455
    },
    {
        "content": "<p>Interesting topic! Here at Firely, we always strive to create open models to make them as generic and reusable as possible. We avoid the upper cardinality, but we didn't yet take it as far as using slices.  I personally believe this is a very interesting approach that can be very useful in many use cases, especially at a higher (e.g. national) level. Please note that we added a section on open versus closed modeling in the <a href=\"https://simplifier.net/guide/ProfilingAcademy/Best-practices\" target=\"_blank\" title=\"https://simplifier.net/guide/ProfilingAcademy/Best-practices\">Best-Practices module</a> of our Profiling Academy as well.</p>",
        "id": 153946198,
        "sender_full_name": "Lilian Minne",
        "timestamp": 1521473229
    }
]