[
    {
        "content": "<p>shall I use Provenance Resource to capture a signature of a person(practitioner)who create and updates a document?</p>",
        "id": 153910653,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1506430244
    },
    {
        "content": "<p>Yes, that is a use-case intention for Provenance.</p>",
        "id": 153910656,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506431574
    },
    {
        "content": "<p>okay <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> .</p>",
        "id": 153910863,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1506485944
    },
    {
        "content": "<p>what is the use of Bundle.Signature?</p>",
        "id": 153910875,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1506488512
    },
    {
        "content": "<p>In the case of a FHIR Document, there is indeed some question of use of Provenance.signature and/or Bundle.signature. The Bundle.signature is there for protection of the Bundle, while it is a Bundle. But I think the issue is that a FHIR Document will be decomposed into the composed Resources, and thus the Bundle.signature will not be usable. Where the Provenance.signature would survive... This is not fully true either, but we have much to work on with digital signatures.  <a href=\"http://build.fhir.org/security.html#signatures\" target=\"_blank\" title=\"http://build.fhir.org/security.html#signatures\">http://build.fhir.org/security.html#signatures</a>       I welcome the experimentation, and the recommendations for improvement (Change Requests).</p>",
        "id": 153910985,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506521359
    },
    {
        "content": "<blockquote>\n<p>But I think the issue is that a FHIR Document will be decomposed into the composed Resources, and thus the Bundle.signature will not be usable. Where the Provenance.signature would survive...</p>\n</blockquote>\n<p>Really? - I don't think that will happen in all cases. We have scenarios where documents are persisted as Bundles and never decomposed into individual resources. Not all FHIR document will end up on a FHIR server/</p>\n<div class=\"codehilite\"><pre><span></span>\n</pre></div>",
        "id": 153911090,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1506549046
    },
    {
        "content": "<p>If you post to Bundle, the document should be stored as-is.  Decomposing will likely break the Provenance signature too as there's no canonical ordering to the entries - and the Bundle signature would care.  If you care about signature validity for documents, you need to store them as a binary.</p>",
        "id": 153911137,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506572729
    },
    {
        "content": "<p>As further consideration. FHIR Documents may be delivered my multiple means. Sometimes by \"POSTing\" to a FHIR server and sometimes delivered by other means. There will be numerous patterns of deployment.</p>",
        "id": 153911193,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1506588018
    },
    {
        "content": "<p>A Signature data type has a digital signature a blob using a signature standard, such as XML-Signature. The XML-Signature standard has mechanisms for defining the manifest of objects, ordering of the various objects (Resources), their encoding, their canonicalization, and xpath exclusions of elements that should be allowed to change. Using these 'standards' one can have a signature that covers the important parts, while not relying on the Bundle representation.  The difference with Bundle signature vs Provenance signature is the reliance on Bundle to be the manifest of everything it contains, where Provenance itemizes them. Thus Provenance is intended to be persisted even when decomposed. This however has not been tested. Not because i isn't possible, but because far more important things need to be tested and improved before we worry about a nice stable standard written by another SDO...   Defining the exclusion, and the ramifications of exclusions,  will be an important exercise. An exercise that needs more than academic interest, it needs a driving use-case that a majority of systems need...</p>",
        "id": 153911216,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506602455
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> is the Bundle.signature intended to be a signature on the whole composed and serialized Bundle as canonicalized? Meaning it is intended to cover only that one instant? It is not intended to address Resource-by-Resource?</p>",
        "id": 153911219,
        "sender_full_name": "John Moehrke",
        "timestamp": 1506602568
    },
    {
        "content": "<p>The Bundle signature signs the whole Bundle - including the Bundle.identifier, type, total, etc. as well as the entries.  You run the same canonicalization algorithm on Bundle as you would on any other resource.</p>",
        "id": 153911245,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1506609552
    },
    {
        "content": "<p>right. Bundles can be signed, and documents are bundles, and are stored as such. But Documents can also be be decomposed - you might want a signature that can persist after this. Though, in fact, it's not really the document case that is the deal here; once a document is constructed and signed, most use cases around signature validation are inherently based on the complete document. The tracking signatures thing across the RESTful API (which as <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> says is experimental yet) that Provenance supports is more applicable to general workflow than to documents. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> note that order is generally sorted by the fact that provenance lists resources in a particular order. What we don't really know is whether signatures are any use in that context given the fact that data is very often manipulated...</p>",
        "id": 153911956,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1506996279
    },
    {
        "content": "<p>hello all,<br>\ni'm little bit confusing with the Document identifiers i.e Bundle and Composition identifiers.<br>\n given <strong>A document must have an identifier with a system and a value (expression : type = 'document' implies (identifier.system.exists() and identifier.value.exists()))</strong><br>\nhere my doubt is from where to get  the Identifier's value and system? ,to which end point we need to send the document i.e bundle or composition? and what is the method we should use ? POST or PUT?<br>\nThank you.</p>",
        "id": 153912063,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1507036549
    },
    {
        "content": "<p>The value and system are in Bundle.identifier</p>",
        "id": 153912089,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1507057686
    },
    {
        "content": "<p>yes, it's Bundle.identifier. but at the time of submitting the document  as a bundle via advance rest client  it's asking for System and value for Bundle.identifier.</p>",
        "id": 153912219,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1507093250
    },
    {
        "content": "<p>after reading the content of the  fhir documentation, what I understood was <br>\n1. we need to create a Composition(ex: History-and-physical doc) which consists all the required entries like AI,Patient,medications etc.<br>\n2.create the Bundle whith type= document which has the Composition as 1st  entry and follwed by the other entries which we have specified in the Composition. is this correct? or i'm I missing anything?<br>\nand here we must specify Bundle.identifier.system and value.but... from where to get these values? any suggesion please.<br>\nThank you.</p>",
        "id": 153912245,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1507118117
    },
    {
        "content": "<p>The values are assigned by the system that creates/assembles the document. After all, that system creates the document so it has to assign a unique id to it.<br>\nAs for (2) above: as well as ..... followed by any Resources referenced by \"the resources referenced by Composition\", although it's up to the creator of the document to decide whether or not (and what Resource types) to include.  Minimalistically it should include the Resources referenced in the sections of the Composition.</p>",
        "id": 153912254,
        "sender_full_name": "René Spronk",
        "timestamp": 1507122139
    },
    {
        "content": "<p>here system means is it client side or server side? in our case we have both server and app. so to which side we need to implement?</p>",
        "id": 153912539,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1507178759
    },
    {
        "content": "<p>dose bundle available after processing of documents? or dead</p>",
        "id": 153912540,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1507178849
    },
    {
        "content": "<p>can we store a document within  one step?</p>",
        "id": 153912574,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1507191772
    },
    {
        "content": "<p>is it necessary to provide the fullUrl and resource content in the bundle entries while posting the document to the server? or  else just full url itself is enough? any suggession ?<br>\nthank you.</p>",
        "id": 153912575,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1507191897
    },
    {
        "content": "<p>It depends on server implementation. Bundle is the container/carrier for a document. It can be saved as a whole in server's storage. Or it can be constructed at run time.</p>",
        "id": 153912693,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1507234558
    },
    {
        "content": "<p>Though a client/app can generate a document, but I think it is more common for the server to generate a document and passes to client/app for user review. In such case, the system/id are created by server. If you do have a situation for client generated document, then the system/url are created by client. Butserver may or may not honor client generated system/id based on server's implementation.</p>",
        "id": 153912704,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1507234727
    },
    {
        "content": "<p>thank you <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span></p>",
        "id": 153912810,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1507267311
    },
    {
        "content": "<p>hello,<br>\nif I change the patient details while sending the Bundle as document then it's getting updated in the Bundle only. but the original resource is not updating. and if access an instance ex: patient/id then getting the old details.any suggesions how to solve this issue.<br>\nThank you.</p>",
        "id": 153913779,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1507869439
    },
    {
        "content": "<p>You're getting expected behavior.  Sending a document is not expected to trigger updates to records.  Receiving systems can choose to update records if they wish, but there's no guarantee that the information in the document is \"newer\" or \"better\" than what the receiving system already has.  If you want to update a resource, you need to send a direct update or submit a batch or a transaction.</p>",
        "id": 153913807,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507909755
    },
    {
        "content": "<p>tnq <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 153914331,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1508213725
    },
    {
        "content": "<p>We are interested to generate a pdf or a text file by clubing all the Composition.sections's narritive and  the indivisual entry's(allergy resource,medication etc) narrative any help how to do this.</p>",
        "id": 153914334,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1508214166
    },
    {
        "content": "<p>here (http://build.fhir.org/documents.html)given <br>\nWhen the document is presented for human consumption, applications SHOULD present the collated narrative portions in order:<br>\nThe subject resource Narrative<br>\nThe Composition resource Narrative<br>\nThe section.text Narratives<br>\nhere subject means is it patient?</p>",
        "id": 153914336,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1508214501
    },
    {
        "content": "<p>and little bit confusing what should be includend in the respective narrative part.</p>",
        "id": 153914337,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1508214541
    },
    {
        "content": "<p>Subject would be Composition.subject.  That'll be Patient for patient-centric documents (but remember that FHIR documents don't have to be about patients).  What appears in the narrative for a given resource is up to the author of the resource - it's the \"essential\" information a human would want to see, but that's subjective and dependent on context.</p>",
        "id": 153914431,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1508250547
    },
    {
        "content": "<p>So you'll have to figure it out on a case-by-case basis in consultation with your users.</p>",
        "id": 153914432,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1508250568
    },
    {
        "content": "<p>thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nany suggesion how to get all the narrative(subject narrative, composition narrative, composition.sections narrative and individual  entries narrative in the composition)and then generate a text file or pdf etc.</p>",
        "id": 153914564,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1508300313
    },
    {
        "content": "<p>All the resources are inside the Bundle, so getting the narratives isn't hard.  The content is XHTML, so turning it into an XHTML document isn't hard either.  There are lots of tools that can turn an XHTML document into a PDF.</p>",
        "id": 153914846,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1508419707
    },
    {
        "content": "<p>The text for <a href=\"http://hl7.org/fhir/STU3/composition-definitions.html#Composition.identifier\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/composition-definitions.html#Composition.identifier\">Composition.identifier</a> is confusing. It has<br>\n<strong>Definition</strong>  Logical identifier for the composition, assigned when created. This identifier stays constant as the composition is changed over time.<br>\nand<br>\n<strong>Note</strong>    This is a business identifer, not a resource identifier (see <a href=\"http://hl7.org/fhir/STU3/resource.html#identifiers\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/resource.html#identifiers\">discussion</a>)<br>\nWhich is it? Business or logical?</p>",
        "id": 153936169,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1518071271
    },
    {
        "content": "<p>Business I'd say, since <code>Composition.id</code> claims the other one.</p>",
        "id": 153936191,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1518085065
    },
    {
        "content": "<p>The docco on <a href=\"http://build.fhir.org/documents.html\" target=\"_blank\" title=\"http://build.fhir.org/documents.html\">FHIR documents</a> says that the document date is mandatory and is stored in _Bundle.meta.lastUpdated_ (See <a href=\"http://build.fhir.org/documents.html#content\" target=\"_blank\" title=\"http://build.fhir.org/documents.html#content\">Document Content</a>)<br>\nIs this enforced by anything?</p>",
        "id": 153941104,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1519782019
    },
    {
        "content": "<p>The docco also says \"a Bundle of resources of type \"document\" that has a Composition resource as the first resource in the bundle\".<br>\nIs this enforced by anything?</p>",
        "id": 153941105,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1519782158
    },
    {
        "content": "<p>They both could be invariants on Bundle.</p>",
        "id": 153941106,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1519782198
    },
    {
        "content": "<p>Feel free to submit a change proposal.  The first resource rule is currently enforced by the Java validator I know.</p>",
        "id": 153941118,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519788464
    },
    {
        "content": "<p>Ta.<br>\n<a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15676\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15676\">#15676</a></p>",
        "id": 153941121,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1519792987
    },
    {
        "content": "<p>Is anyone aware of a parser that ingest a CCDA and outputs FHIR resources?</p>",
        "id": 153941270,
        "sender_full_name": "Aaron Seib",
        "timestamp": 1519850221
    },
    {
        "content": "<p>You might want to ask on the <a class=\"stream\" data-stream-id=\"21\" href=\"/#narrow/stream/cda%20to%20fhir\">#cda to fhir</a> stream</p>",
        "id": 153941271,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519850997
    }
]