[
    {
        "content": "<p>Hi - Is the FHIR model available as an UML model for download. I could see that there are images of UML class diagrams under Individual resources. But is there a complete model available that could be downloaded and imported into a UML modeling tool like Sparxsystems Enterprise architect. This could be a XMI format or some such thing.</p>\n<p>Thanks</p>",
        "id": 176496762,
        "sender_full_name": "Kumar Venkatachalam",
        "timestamp": 1569352960
    },
    {
        "content": "<p>No.  The UML diagrams are generated programatically from the source definitions.  They have been a few people interested in creating an entire UML model but it does not currently exist.</p>",
        "id": 176496831,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1569353016
    },
    {
        "content": "<p>Thanks Jean. That is helpful to know, Are there at least UML files for the individual resources? When I contacted Sparxsystems to find out if they know anything about it, I got a reply that they thought that their product Enterprise architect was used in generating the UML Class diagrams shown in resource definitions but that is all they knew. Thanks again.</p>",
        "id": 176499915,
        "sender_full_name": "Kumar Venkatachalam",
        "timestamp": 1569355102
    },
    {
        "content": "<p>No, the FHIR build tooling creates UML diagrams in SVG (scalable vector graphics) format.  It uses a third-party library to do this and does not use EA or any other UML tool.</p>",
        "id": 176500725,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1569355604
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"241521\">@Kumar Venkatachalam</span> What are you looking to do with the UML files?</p>",
        "id": 176501460,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569356142
    },
    {
        "content": "<p>I have created a UML diagram with EA for the FHIR basics for my book, but not for the individual resources. Can provide it if of interest.</p>",
        "id": 176536240,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1569391398
    },
    {
        "content": "<p>I'm sure it's of interest. I could generate an XMI version if there was enough interest, but it has to &gt;1 person per year</p>",
        "id": 176539822,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1569396131
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192418\">@Sean Muir</span> has updated the MDHT import of FHIR R4 structure definitions into UML, he can provide details on where to access this XMI file from the MDHT project on <a href=\"http://eclipse.org\" target=\"_blank\" title=\"http://eclipse.org\">eclipse.org</a>.  We do not create diagrams, but use the UML model of FHIR for other transformations including MDMI mapping.</p>",
        "id": 176577696,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1569426157
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  - Sorry for the late reply, had issues with login and account. Thanks, I want to bring that into a modeling tool and use it for deriving a more logical model to show the relationships etc, between the referenced resources from a given resource.</p>",
        "id": 177052752,
        "sender_full_name": "Kumar Venkatachalam",
        "timestamp": 1569935185
    },
    {
        "content": "<p>Ok.  Be aware that we've done the exercise of creating diagrams showing relationships in the past and the result was an ungodly mess.  With extensions, everything can point to everything.  Even without extensions, you'll find the diagram pretty overwhelming  given that there are so many places where references occur.</p>",
        "id": 177057862,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569938635
    },
    {
        "content": "<p>In general, if you're going to do a diagram, it's best to pick a single focal resource and just show its outbound relationships.</p>",
        "id": 177057966,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569938699
    }
]