[
    {
        "content": "<p>how much is fhirpath used in profiles as a matter to express business requirements? Is it considered exotic or best practice to do so. Lets say that I need to do a profile on eg appointment, and I need two extensions: one for having a responsible careteam and another extension to hold a list of participating careteams. If it is a business requirement that the responsible careteam must always be present in the as part of the participating careteams, it would be possible to add this constraint as a fhirpath constraint. I'm just wondering here if that is considered exotic practice or if most others would place such logic in the actual code</p>",
        "id": 179525576,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1572524511
    },
    {
        "content": "<p>I'd consider fhirpath as a fundamental and critical aspect of FHIR, certainly not exotic. Simplifier contains many profiles with user-defined fhirpath constraints. The FHIRPath engine implementations in both the Java &amp; .NET FHIR API stacks are relatively stable and largely feature complete.<br>\nJust keep in mind that Fhirpath constraints are less explicit and readable in comparison to a slicing constraints. Generally, I'd recommend slicing constraints if the use case allows it, because slices can be clearly visualized in a tree rendering. However fhirpath constraints are much more powerful.</p>",
        "id": 179529169,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1572527309
    },
    {
        "content": "<p>I can't see how my mentioned example case can be expressed using slicing. Could you send me a link to some examples on simplifier where it is used.</p>\n<p>PS - I've used fhirpath pretty much when expressing custom defined searchparameters - we just haven't used them as constraints on profiles before (besides the one's that are defined by the spec)</p>",
        "id": 179529530,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1572527608
    },
    {
        "content": "<p>For example <a href=\"https://simplifier.net/NictizSTU3-Zib2017/nl-core-address\" target=\"_blank\" title=\"https://simplifier.net/NictizSTU3-Zib2017/nl-core-address\">https://simplifier.net/NictizSTU3-Zib2017/nl-core-address</a> (element <code>postalCode</code>)</p>",
        "id": 179531674,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1572529183
    },
    {
        "content": "<p>thx - I ended up using </p>\n<div class=\"codehilite\"><pre><span></span>extension.where(&#39;http://ehealth.sundhed.dk/fhir/StructureDefinition/ehealth-responsible&#39;).valueReference in participant.extension.where(&#39;http://example.org/fhir/StructureDefinition/ehealth-ext-careteam&#39;).valueReference or extension.where(&#39;http://hl7.org/fhir/responsible&#39;).valueReference in participant.actor.reference\n</pre></div>\n\n\n<p>for my case</p>",
        "id": 179531983,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1572529400
    }
]