[
    {
        "content": "<p>Happy Friday All!</p>\n<p>I've got a question about a FHIR authorization server's implementation to support clients providing the fhirUser scope defined in the SMART Application Launch Framework Implementation Guide Release 1.0.0.</p>\n<p>For some deployments, we may have a FHIR authorization server that uses a single identity provider for all users. This is regardless of whether the user is a patients, practitioner, or authorized representative. Our system currently allows a single user identity to be mapped to a patient AND a practitioner AND an authorized representative. Though this is rare, I'm trying to understand how the authorization server would decide which fhirUser reference is appropriate. </p>\n<p>My initial thought is that a client meant for practitioners should prioritize the practitioner FHIR reference if it exists for the user over any other references that may exist for the user. This would appear to require some way of the authorization server understanding the target audience for the application which as far as I know isn't something that is standardized when using dynamic client registration. This approach also doesn't handle applications which target various audiences; of which I know none, but given that there is no explicit prohibition in FHIR, may need to be considered.<br>\nThere are other approaches that suffer from usability concerns, such as prompting the user during the authorization flow.<br>\nAny input would be greatly appreciated.</p>\n<p>Thanks,<br>\nMarco</p>",
        "id": 223687952,
        "sender_full_name": "Marco Ramos",
        "timestamp": 1611344053
    },
    {
        "content": "<p>Thanks! W(ould recommend bringing this to <a class=\"stream\" data-stream-id=\"179170\" href=\"/#narrow/stream/179170-smart\">#smart</a></p>",
        "id": 223690274,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611345092
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179166-implementers/topic/fhirUser/near/223690274\">said</a>:</p>\n<blockquote>\n<p>Thanks! W(ould recommend bringing this to <a class=\"stream\" data-stream-id=\"179170\" href=\"/#narrow/stream/179170-smart\">#smart</a></p>\n</blockquote>\n<p>Thanks, how would I do that?</p>",
        "id": 223690420,
        "sender_full_name": "Marco Ramos",
        "timestamp": 1611345140
    },
    {
        "content": "<p>You should be able to click the \"#smart\" link in my message to take you to the right stream. If not, click the \"settings gear\" next to \"Streams\" in the left side bar and subscribe to <a class=\"stream\" data-stream-id=\"179170\" href=\"/#narrow/stream/179170-smart\">#smart</a> .</p>\n<p><a href=\"/user_uploads/10155/-XZbl0ypFOP0Ix6rW7zvkL65/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/-XZbl0ypFOP0Ix6rW7zvkL65/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/-XZbl0ypFOP0Ix6rW7zvkL65/image.png\"></a></div><p>Edit: I see you already figured this out ;)</p>",
        "id": 223692313,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611346005
    }
]