[
    {
        "content": "<p>Hello, I'm wondering what is the current status of the FHIR Namespace registry <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Registry_Requirements#Namespace_registry\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Registry_Requirements#Namespace_registry\">http://wiki.hl7.org/index.php?title=FHIR_Registry_Requirements#Namespace_registry</a>. The project I'm working on would eventually need to identify patients by their health card numbers, driver licenses and other identifiers issued by various jurisdiction in Canada &amp; US and to identify licensed practitioners by their license numbers issued by various regulating bodies in various jurisdictions. Many of these namespaces have OIDs assigned, but our direction is to avoid using OIDs. If we define URLs or URNs for these napespaces internally, we would be able to ensure uniquenss, but not interoperability with other applications, who might define the same namespaces differently in absence of a registry. There is some limited registry at <a href=\"http://hl7-fhir.github.io/identifier-registry.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/identifier-registry.html\">http://hl7-fhir.github.io/identifier-registry.html</a>, but I’m not sure if it’s intended to be used by various parties or it's there just for illustration/use of FHIR core team.</p>",
        "id": 153816098,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1458223622
    },
    {
        "content": "<p>Ah, I hear a volunteer who's willing to populate such a registry...</p>",
        "id": 153816100,
        "sender_full_name": "René Spronk",
        "timestamp": 1458224202
    },
    {
        "content": "<p>Kidding aside, maintaining such a registry will be  a horrendous task. I guess it won't be high on the list of any volunteer. So at best any such registries will be 'examples'. </p>",
        "id": 153816101,
        "sender_full_name": "René Spronk",
        "timestamp": 1458224290
    },
    {
        "content": "<p>I do relize this. I asusme this is the reason HL7 had started charging $100 for each OID they assign. But maybe we can have some common space for projects willing to share their namespaces using wiki, github, google sheets or any other free tool, kind of crowdsourcing the registry. This wouldn't be perfect, might have duplicates (even if we get volunteer-moderators) and omissions, but probably still better than nothing.</p>",
        "id": 153816103,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1458225820
    },
    {
        "content": "<p>I’m also wondering if there is a recommended approach to define namespaces for FHIR projects. We are considering leveraging the way NHS defines their URIs (urn:fhir.nhs.uk:id/NHSNumber), for example for physician and nurse licenses from Ontario and Quebec, we might define urn:fir.ontario.ca:id/PhysicianLicenseOntario, urn:fir.ontario.ca:id/PharmacistLicenseOntario, urn:fhir.ontario.ca:id/PhysicianLicenseQuebec, urn:fhir.ontario.ca:id/PharmacistLicenseQuebec. An alternative, more generic, approach would be to use website URLs of the regulating bodies (whenever possible) , e.g. <a href=\"http://www.cpso.on.ca/fhir/PhysicianLicenseOntario\" target=\"_blank\" title=\"http://www.cpso.on.ca/fhir/PhysicianLicenseOntario\">http://www.cpso.on.ca/fhir/PhysicianLicenseOntario</a>, <a href=\"http://ocpinfo.com/fhir/PharmacistLicenseOntario\" target=\"_blank\" title=\"http://ocpinfo.com/fhir/PharmacistLicenseOntario\">http://ocpinfo.com/fhir/PharmacistLicenseOntario</a>, <a href=\"http://www.cmq.org/fhir/PhysicianLicenseQuebec\" target=\"_blank\" title=\"http://www.cmq.org/fhir/PhysicianLicenseQuebec\">http://www.cmq.org/fhir/PhysicianLicenseQuebec</a> and <a href=\"http://www.opq.org/fhir/PharmacistLicenseQuebec\" target=\"_blank\" title=\"http://www.opq.org/fhir/PharmacistLicenseQuebec\">http://www.opq.org/fhir/PharmacistLicenseQuebec</a>. The second approach might better serve interoperability (it’s not intuitive to search for Quebec’s license under <a href=\"http://ontario.ca\" target=\"_blank\" title=\"http://ontario.ca\">ontario.ca</a>), but is much harder to implement. Also, website URLs of organizations are not under our control and might change over time. This is why our preferred approach is the first (NHS) one.</p>",
        "id": 153816170,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1458237845
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191393\">@Igor Sirkovich</span> Just to let you know that we (the NHS) moved away from using urn style URIs and instead went towards using canonical URLs</p>",
        "id": 153816181,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1458238689
    },
    {
        "content": "<p>we are hoping to make the registry available in the next few weeks (will be based on DSTU2)</p>",
        "id": 153816183,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458238776
    },
    {
        "content": "<p>Thank you for sharing this info Richard! I'm wondering how are you dealing with namespaces that are not in your area: do you define all canonical URLs under your root URL?</p>",
        "id": 153816184,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1458238830
    },
    {
        "content": "<p>Thank you Grahame, this would be very helpful.</p>",
        "id": 153816185,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1458238857
    },
    {
        "content": "<p>Our initial thoughts using urn:<a href=\"http://fhir.nhs.uk\" target=\"_blank\" title=\"http://fhir.nhs.uk\">fhir.nhs.uk</a> was actually an invalid urn construct</p>",
        "id": 153816186,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1458238871
    },
    {
        "content": "<p>Did you change from, for example, \"urn:fhir.nhs.uk:id/NHSNumber\" to \"<a href=\"http://fhir.nhs.uk/id/NHSNumber\" target=\"_blank\" title=\"http://fhir.nhs.uk/id/NHSNumber\">http://fhir.nhs.uk/id/NHSNumber</a>\"?</p>",
        "id": 153816188,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1458238936
    },
    {
        "content": "<p>Close - we went to : <a href=\"http://fhir.nhs.net/Id/nhs-number\" target=\"_blank\" title=\"http://fhir.nhs.net/Id/nhs-number\">http://fhir.nhs.net/Id/nhs-number</a></p>",
        "id": 153816189,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1458238956
    },
    {
        "content": "<p>Do you have any identifiers that are under responsibility of external organizations rather than nhs, e.g. regulating body for phsyicians or nurses?</p>",
        "id": 153816190,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1458239031
    },
    {
        "content": "<p>Not yet we dont - though I suspect the time will come</p>",
        "id": 153816191,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1458239070
    },
    {
        "content": "<p>Do you know what would be your strategy for these? Would you still define them under  <a href=\"http://fhir.nhs.net/Id\" target=\"_blank\" title=\"http://fhir.nhs.net/Id\">http://fhir.nhs.net/Id</a> or you woud prefer to define these indentifiers under URL roots of each responsible organization?</p>",
        "id": 153816192,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1458239171
    },
    {
        "content": "<p>Another possibility would be <a href=\"http://hl7.org/fhir/NamingSystem/ca-ab-whatever\" target=\"_blank\" title=\"http://hl7.org/fhir/NamingSystem/ca-ab-whatever\">http://hl7.org/fhir/NamingSystem/ca-ab-whatever</a>.  That would actually resolve to the naming system having the alternate ids and could also point to any relevant website - and updated when/if the website moved</p>",
        "id": 153816201,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458240474
    },
    {
        "content": "<p>Yes Lloyd, this would be great and this is why I stated with a question about the registry. If we take this route, we should be able to register and publish all shared naming systems with HL7 to avoid duplicates/collisions.</p>",
        "id": 153816216,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1458241126
    },
    {
        "content": "<p>This would be similar to the OIDs registry, but this brings back the questions of maintanence: will everyone be allowed to register naming systems, who will moderate, etc.</p>",
        "id": 153816219,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1458241242
    },
    {
        "content": "<p>Interesting how this problem is derived from the need for human readable characters in the identifiers that I suspect will become problematic for even more reasons including lack of \"readability\". How about using......OIDs!  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  we could use th same approach you are describing to provide alternative naming (human readable) and this would result in all the urls would not collide. I admit I _do_ like urls that I can read (hey, I'm human after all!) but can we somehow take some of the benefits of OIDs to the solution?</p>",
        "id": 153816248,
        "sender_full_name": "Robert McClure",
        "timestamp": 1458244498
    },
    {
        "content": "<p>What benefits do OIDs provide that URLs don't?  The need here is for a registry to discover the \"official\" namespace label for a particular identifier type.  That exists whether we're talking OIDs or URIs.  The benefit of the URI is that if you see it in an instance, you know what it means - you don't have to go back to the registry to find out.</p>",
        "id": 153816391,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458270344
    },
    {
        "content": "<p>URIs also can point you to information about the namespace..</p>",
        "id": 153816518,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1458296798
    },
    {
        "content": "<p>But Te rarely </p>",
        "id": 153816522,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458297544
    },
    {
        "content": "<p>but the really cool thing about Oids is that you can look them up. And then you get information about who registered them. That's much more useful than actual information ;-) and if you get any actual information, it's a reference to the namespace!</p>",
        "id": 153816525,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458297627
    },
    {
        "content": "<blockquote>\n<p>Yes Lloyd, this would be great and this is why I stated with a question about the registry. If we take this route, we should be able to register and publish all shared naming systems with HL7 to avoid duplicates/collisions.</p>\n</blockquote>\n<p>We will make sure that all NamingSystem resources that are part of materials put on <a href=\"http://simplifier.net\" target=\"_blank\" title=\"http://simplifier.net\">http://simplifier.net</a> will be searcheable, and also you'll be able to browse lists of these systems across all projects and realms.</p>",
        "id": 153816535,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1458306309
    },
    {
        "content": "<p>Thank you Ewout! This woud be great.</p>",
        "id": 153816549,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1458312572
    },
    {
        "content": "<p>The advantage of OIDs is they don't collide. The original issue was concerns about creating lovely URIs that contain the same \"meaningful name\" that actually don't mean the same thing. I'm not pushing that OIDs are the answer, I like words... But they have disadvantages. And yes, if you create a registry that everyone uses, you can solve the technical problem.</p>",
        "id": 153816550,
        "sender_full_name": "Robert McClure",
        "timestamp": 1458312744
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153816710,
        "sender_full_name": "Eric Haas",
        "timestamp": 1458347720
    },
    {
        "content": "<p>URIs are no more likely to collide than OIDs.  Both rely on the organization who's responsible for some particular \"node\" making sure they don't assign child levels to something else.  They also rely on organizations not using \"base\" identifiers they don't control. </p>",
        "id": 153816746,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458422259
    },
    {
        "content": "<p>The difference is that in URI there are 'indirections'. That is domain-name-system (DNS), and web-server-root. All that can redefine a URI very dynamically. OIDS have no indirection mechanisms. You can see this as a positive or negative. The hard part is that all I need to do to figure out if two OIDs are the same is string compare; not as clear if URI.</p>",
        "id": 153816994,
        "sender_full_name": "John Moehrke",
        "timestamp": 1458575487
    },
    {
        "content": "<p>That's not true. String compare also for URIs. </p>",
        "id": 153817036,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458591140
    },
    {
        "content": "<p>if you want to talk about URLs and resolution, yes, that's complex. but URIs for namespaces (technically, I suppose we should use the acronym IRI in a few places) are not like that</p>",
        "id": 153817037,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458591187
    }
]