[
    {
        "content": "<p>Thank you for the warm welcome <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . This is helpful information! One the scenarios that pops up in my head is a patient needing to go to an emergency room out of town, maybe even out of state. It sounds like an emergency room far from the patient's primary care doctor will not be able to access the patient's information since it is unlikely that there is a site to site agreement between the two facilities. Are there regional or national umbrella organizations that health care facilities can join so that information can be accessed within these parterned facilities without prior bilateral agreements? Or will FHIR not work for this scenario? Thanks again!</p>",
        "id": 195791849,
        "sender_full_name": "Jose Guerrero",
        "timestamp": 1588212258
    },
    {
        "content": "<p>It depends on the country :)  In the U.S. there are regional health organizations as well as recent regulatory effort to ensure that they can operate under a common agreement that will legally allow data to flow as needed.  (Though things aren't quite at that point.)  There are other countries with national systems or interconnected regional systems that can achieve the same end.  There are also patient portal solutions that allow a patient to download their data from various providers and then grant access to other providers of their choice.  And then there's the iPhone (and developing Android solution) that allow downloading information into your phone and then making that available to other providers - or just showing them your phone.  In short, multiple architectures and a wide range of capabilities.</p>",
        "id": 195792001,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588212515
    },
    {
        "content": "<p>Thank you for this explanation! I had heard about patients being able to download their medical records to their iPhones and I think that is wonderful and convenient for millions of people. In medical school, electronic health records systems and patient information exchange is not part of the curriculum, let alone FHIR. I am glad I joined this group so that I can better assist patients with their health care needs.</p>",
        "id": 195792368,
        "sender_full_name": "Jose Guerrero",
        "timestamp": 1588213117
    },
    {
        "content": "<p>We're always happy to have clinical input and use-cases :)</p>",
        "id": 195792537,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1588213403
    }
]