[
    {
        "content": "<p>Hi,<br>\nCan someone help me find a response to a question which may rarely be asked in the FHIR community yet questionable <br>\nWhat is the benefit of using Rest FHIR vs Open API when it comes to exposing your systems features ? Please bear in mind, I’m designing a system in a well established staffing (workforce management) system where no one uses or familiar with FHIR yet servicing to health sector purely on staff management.</p>",
        "id": 184925668,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578330904
    },
    {
        "content": "<p>Hi Medi,</p>\n<p>The key difference is that FHIR is a standard.</p>\n<p>Publishing your own work via OpenAPI means that other people <em>can</em> use your API, if they implement it.  This limits interoperability to systems developing against your particular software.  Every connection to your system requires someone else to spend development time and money, specific to your system.</p>\n<p>With a standard, the theory* is that any two implementing systems can exchange information.  So, you gain the benefit of an entire ecosystem of implementations to work with out of the box.</p>\n<p>*Practically speaking, the standard isn't perfect and there are variations between implementations.  That said, those variations are minor in comparison to the difference in implementing a variety of custom protocols.</p>\n<p>Does that help?</p>",
        "id": 184926661,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1578331594
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  thanks for your prompt reply<br>\nWell, that doesn’t answer my concerns fully. Let me explain more. Imagine you and 100 other more software providers wanted to work interoperable. I’m saying FHIR and design a model so complex to deliver a concept with extensions and references and code systems and so on so force. While another architect gives us a nice structured open api definition in swagger. Why would anyone want to proceed with my model over something else which is not bound to FHIR limitations ? And please don’t tell me standard because people wanted to spend less and gain more respectfully. <br>\nI can understand that you get so much benefit in clinical transaction world but not sure on staffing management world and even related financial transactions</p>",
        "id": 184927938,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578332507
    },
    {
        "content": "<blockquote>\n<p>I’m saying FHIR and design a model so complex to deliver a concept with extensions and references and code systems and so on so force. While another architect gives us a nice structured open api definition in swagger.</p>\n</blockquote>\n<p>Not sure why it is FHIR vs OpenAPI. You can get FHIR specs into Swagger.</p>",
        "id": 184934644,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578336807
    },
    {
        "content": "<p>I do not know the context so I cannot see where FHIR is a model so complex that requires extensions for your use case but that is conceivable.<br>\nBut for code systems, I guess the other architect must also use reference data, right?</p>",
        "id": 184934820,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578336900
    },
    {
        "content": "<p>Perhaps your scope is such that you are better off with a custom message, but what about </p>\n<ul>\n<li>data consistency/reuse (does your data mean the same across systems, so that you can do e.g. reporting)?</li>\n<li>system evolution (will you change your custom interface every time you have a new system)?</li>\n<li>scope expansion (are you sure you will not add anything to the scope, e.g. privacy matters, changing workflows, more coded data...)?</li>\n</ul>",
        "id": 184935421,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578337289
    },
    {
        "content": "<p>I define my interfaces as if I am the one that has to maintain them for the foreseeable future.</p>",
        "id": 184935632,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578337422
    },
    {
        "content": "<p>But for your concern - if you ask about \"standards vs custom\" to a group of people working on a standard, the answer may be biased.</p>",
        "id": 184935829,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578337566
    },
    {
        "content": "<p>If you expose more about your scope, perhaps the community can say whether this is a goof fit for FHIR or not, and you may get some arguments and experience about the possible benefits of FHIR</p>",
        "id": 184935941,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578337677
    },
    {
        "content": "<p>I think you will also get lots of experienced advice about consequences of doing custom solutions. We've all been there..</p>",
        "id": 184936072,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578337747
    },
    {
        "content": "<blockquote>\n<p>You can get FHIR specs into Swagger.</p>\n</blockquote>\n<p>Mhh..really? Are there Open API compliant JSON schemas for FHIR?</p>",
        "id": 184957629,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1578345533
    },
    {
        "content": "<p>I'm currently working on a generator... there are some tricky parts as to what you want included (e.g., extensions on every field, supported resources, profiles, etc.).</p>\n<p>Working from the Structure Definitions makes it doable, but perhaps not trivial.</p>",
        "id": 184958716,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1578346233
    },
    {
        "content": "<p>Well, only capability statement apparently and there won’t be a tool to support the structure definition nor profiles</p>",
        "id": 184974532,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578360380
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> what tool do you use for structure definition to openapi schema ?</p>",
        "id": 184974555,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578360459
    },
    {
        "content": "<p>Hi Medi, I am currently writing one. It is not quite ready for other users yet, but I can post here when it is</p>",
        "id": 184974730,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1578360675
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> thanks for the details response. I’d very much like to compare FHIR vs open api on each of the items you raised above.<br>\nAs per the concept, I’ve raised another issue under a different topic which has got one aspect of what it working on <br>\n<a href=\"#narrow/stream/179166-implementers/topic/Pre-booking.20and.20pro-booking\" title=\"#narrow/stream/179166-implementers/topic/Pre-booking.20and.20pro-booking\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Pre-booking.20and.20pro-booking</a><br>\nAlso, I’m very standard savy but putting my architect hat on, I’d like to ensure what I’m putting in front of 200 odd suppliers will get accepted and more importantly adopted.</p>",
        "id": 184974898,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578360927
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> thanks. I know <span class=\"user-mention\" data-user-id=\"195775\">@Michael Hansen</span> has got a tool but it only works from capability statement. Thanks anyway</p>",
        "id": 184974978,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578361011
    },
    {
        "content": "<p>My understanding is that the comparison you're hinting at is not FHIR Vs OpenAPI but rather (FHIR+ OpenAPI) vs (custom + openAPI)</p>",
        "id": 184991735,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578386832
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> If you mean by custom, a FHIR custom resource , yes you’re right. What do you think in that case ?</p>",
        "id": 184997062,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578391920
    },
    {
        "content": "<p>No, what I mean is since FHIR Rest API can be exposed (with some manual work, I guess) as OpenAPI, the situation does not seem that you have \"only\" FHIR, and the other architect has openAPI. You can have openApi as well.<br>\nThe debate between those architects is <br>\n#1 has a FHIR content definition, that is universal, has some infrastructure for deploying, testing, etc etc.. and can be exposed with OpenAPI.<br>\n#2 has a custom structure and can be exposed in openApi perhaps faster, because you don't have to think of standard data, versioned interfaces, test support, community, maintainability... (do I make a point yet?). </p>\n<p>That is what I believe is the comparison. not FHIR vs OpenAPI.</p>",
        "id": 184997532,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578392379
    },
    {
        "content": "<p>Oh yes, yes. <br>\nBear in mind that my concept is workforce management in health sector... and I’ve got one shot to convince people to follow a model. Very tricky to propose the concept on FHIR using a resource which is not originally designed to handle that scenario. For example I’m<br>\nUsing appointment for booking a staff member into a shift ex. A nurse to do a 9-5 shift in a particular section of the hospital</p>",
        "id": 184998005,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578392768
    },
    {
        "content": "<blockquote>\n<p>Very tricky to propose the concept on FHIR using a resource which is not originally designed to handle that scenario.</p>\n</blockquote>\n<p>You don't have to bend the FHIR resources. If they do not mean what you want, you can make custom resources. Not ideal, but could work.</p>",
        "id": 184998321,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578393071
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span>For example I’m Using appointment for booking a staff member into a shift ex. A nurse to do a 9-5 shift in a particular section of the hospital\n</pre></div>\n\n\n<p>but in this case it seems really close (from a first reading). The nurse is planned to do the shift, so the nurse does have an \"appointment\" with the hospital, right?</p>",
        "id": 184998563,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578393282
    },
    {
        "content": "<p>If the semantics of the resource exclude this, we should welcome feedback.</p>",
        "id": 184998573,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578393300
    },
    {
        "content": "<p>Healthcare operations is really not a well developed area in HL7.<br>\nScheduling, Supply...</p>",
        "id": 184998603,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578393323
    },
    {
        "content": "<p>And I think these areas deserve some love. If we look at efficiency of care from a institution perspective, this is an area with lots of opportunities. <br>\nSo I would be glad to see your feedback to make the standard more complete.</p>",
        "id": 184998719,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578393426
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I’ve spent a good one year and half on Workforce Management for NHS and so far I’ve only found so much challenge fitting the concept. Now I’ve created a simple model, but very concerned the complexity of the model scares the audiences From using it. I can certainly give so many expert as I consider myself an expert in this area as I’ve closely worked with so many workgroups. Can you please kindly have a look at the other thread I’ve created. I put three simple concept there to discuss</p>",
        "id": 184999087,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578393812
    },
    {
        "content": "<p><a href=\"#narrow/stream/179166-implementers/topic/Pre-booking.20and.20pro-booking\" title=\"#narrow/stream/179166-implementers/topic/Pre-booking.20and.20pro-booking\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Pre-booking.20and.20pro-booking</a></p>",
        "id": 184999097,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578393827
    },
    {
        "content": "<p>I’d love to have more feedback</p>",
        "id": 184999106,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578393838
    },
    {
        "content": "<p>but the story doesn’t end there, there are invoices and employee contracts and benefits etc. That still needs to be defined</p>",
        "id": 184999171,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578393878
    },
    {
        "content": "<p>The short answer is that FHIR is targeted to healthcare- specific usecases, not generic cross-industry use cases.  FHIR isn't designed to support Human Resources, Facility Management, Inventory Management, etc.  Those areas are not our target scope.  In some cases there can be overlap and if you're already doing FHIR for everything else, with creative use of the resources and possibly supplementing with Basic (or custom resources, depending on how much of the shared infrastructure you want to use), you can make it work.</p>",
        "id": 185008248,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578402577
    },
    {
        "content": "<p>It's sounding to me that your system is targeting more generic HR functions than healthcare -specific functions. If so, you might not find FHIR a great fit.  Whether FHIR is an \"acceptable\" fit will depend in part on whether the systems involved will also need FHIR for other purposes.</p>",
        "id": 185008475,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578402778
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thanks.<br>\nThe good thing about FHIR is the governance around it. Would custom resource + openapi would be an option ? If we use custom resource we’d able to use the FHIR governance around it. Forge and Simplifier supports this but not sure about Vonk if we wanted to benefit the tooling. Having read the other threads I still don’t know if there is a tool which can convert structure definition or a profile to swagger.</p>",
        "id": 185010754,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578404383
    },
    {
        "content": "<p>Most tools support 'custom resources' - as does Vonk. There are two ways of supporting custom resources: the official FHIR way, which is using a Basic resource with extensions. Or the non-FHIR way which is to define your own resources. The latter allows you to do things in a FHIR-like manner, whilst officially it won't be FHIR compliant.</p>",
        "id": 185013154,
        "sender_full_name": "René Spronk",
        "timestamp": 1578406179
    },
    {
        "content": "<p>A custom resource won't have much governance from HL7 unless the intention is to define a profile on Basic and bring that through the HL7 balloting process.  If you create a truly custom resource (one not part of HL7's official list), then that option isn't really available to you.  (While you may be able to get it to work with certain tooling stacks, you won't be able to make it work with all, and you'll lose out on certain infrastructure like the public test servers.)</p>\n<p>The other option is to make a case that your use-case should become an official part of the FHIR scope because the healthcare-specific requirements mean that industry-independent solutions can't work.</p>",
        "id": 185013498,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578406396
    },
    {
        "content": "<p>Thanks you both <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . I believe if I wanted to go down to the root of Custom resource my only option would be the latter solution suggested by Rene, as maintaining a big bundle with extension is outrageous. <br>\nOn a different but related note, do you have experiences of a hybrid solution like defining the concept which can be implemented using the current resources and the one doesn’t using a custom resource. <br>\nAlso can you suggest how to make a case against creating a custom resource for workforce management. I’d be happy to share my insights</p>",
        "id": 185029866,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578416191
    },
    {
        "content": "<p>There's nothing that stops you from defining additional RESTful capabilities that aren't FHIR.  And code can certainly mix and match what data it's passing around.  The challenge is that much of the off-the-shelf FHIR software won't work with the custom/non-FHIR resources without tweaking.</p>\n<p>In terms of making the case, it's really a matter of explaining how/why resource management is different in the healthcare space than it is say in the financial industry or manufacturing industry.</p>",
        "id": 185030989,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578416791
    },
    {
        "content": "<p>I think you missed the point that I’m designing all these for healthcare. Managing doctors, nurses etc ...</p>",
        "id": 185033220,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578418101
    },
    {
        "content": "<p>Right.  But in healthcare, there are all sorts of business functions (payroll, purchasing, etc.) that aren't healthcare-specific.  We don't try to make FHIR do those things.  Is there something intrinsically different about managing doctors and nurses that wouldn't apply to managing salespeople or lawyers?  HL7 doesn't have the expertise (or bandwidth) to try to cover requirements that aren't healthcare-specific.</p>",
        "id": 185033646,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578418393
    },
    {
        "content": "<p>Hard to say on the fly but I’d say it is more healthcare specific than other industries. Ex. Managing specialist or nurses in a hospital is so different than managing staff in a car industry. Also qualification and specialities are healthcare related. So I’d say it is very specific and even more specific in the uk distinctively</p>",
        "id": 185034718,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578419070
    },
    {
        "content": "<p>The work group to talk to is probably Patient Administration.  They're responsible for Practitioner and PractitionerRole and, based on current responsibilities, would be the most likely group to take on standardization in that space.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 185035127,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578419335
    },
    {
        "content": "<p>Yup, what Lloyd said.<br>\nWhat are the areas in there you're trying to cover?<br>\nWe already cover people, places, qualifications, locations, services and organizations (and the relationships between them)<br>\nAnd also appointments and schedules, but not recurrences (without describing each one)<br>\nA shift could be modelled using a slot, but is a small adjustment, and not really designed for shuffling things about.<br>\nThe slot was more intended to cover availability, which a shift kind of is. Alternately a schedule could narrow down to a shift too. (and have lots of those)</p>",
        "id": 185053524,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1578430348
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> thanks. <br>\nTo avoid putting too much info here, would you kindly comment on <a href=\"#narrow/stream/179166-implementers/topic/Pre-booking.20and.20pro-booking\" title=\"#narrow/stream/179166-implementers/topic/Pre-booking.20and.20pro-booking\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Pre-booking.20and.20pro-booking</a></p>",
        "id": 185057981,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578433343
    },
    {
        "content": "<p>Please bear in mind I’ve already done what it’s been posted there using ServiceRequsat=&gt; Booking =&gt; Encounter but the model looks complex for none FHIR users. It doesn’t read well, you know</p>",
        "id": 185058056,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578433440
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> A shift status once its vacant, its sent to a system called bank system to be fulfilled by someone. That request is called vacancyrequest which I used service request for. Then the bank system would find a suitable person and book it to that shift, I’ll use appointment for that. And once the shift is completed there is a timesheet elements which I’ll use encounter.</p>",
        "id": 185062865,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578436950
    },
    {
        "content": "<p>More info and discussion is in that thread. But then once the timesheet (encounter) is submitted, the bank system should invoice the hospital or issue a payroll which I haven’t done and not sure what resource to use</p>",
        "id": 185062939,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578437026
    },
    {
        "content": "<p>Payroll would be outside I'd expect.</p>",
        "id": 185067860,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1578441343
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> Any comments on the rest is appreciated</p>",
        "id": 185069086,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1578442533
    },
    {
        "content": "<p>Well, some years ago, before FHIR, we applied the HL7 Standard v2.x to the hotel domain - Hotel Level 7 <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span>.<br>\nIf you translate guest to patient, Check-in to admission, Check-out to discharge, service requests to order entry, minibar consumption to DFT, etc. it works fine.<br>\nIt is about mapping the business domain model to a technical representation. FHIR is fine for that purpose.</p>",
        "id": 185087101,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1578469266
    },
    {
        "content": "<p>In some cases this may or not be possible, but <span class=\"user-mention\" data-user-id=\"203885\">@Medi Harsini</span> this is one thing that I see as a huge advantage in FHIR (and standard-based approaches): <br>\nin FHIR we have information models, such that we can check whether a concept can be reused or not, or can be adapted/translated to another model or industry. And if we do adapt/translate, the whole platform supports it because the standard relies on other standards.<br>\nIf you do a single-purpose solution, every expansion may prove to be a challenge. But your other architect must know that and have experience with scope creeps.</p>",
        "id": 185088191,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578470814
    },
    {
        "content": "<p>This is an interesting thread. My understanding is that putting something into a FHIR format does not guarantee interoperability. To truly be interoperable you need to create resources and interactions that are consistent with an Implementation Guide. The IG will inform meaningful interactions in a way that unconstrained resource definitions will be unable to do. Using <span class=\"user-mention\" data-user-id=\"191549\">@Frank Oemig</span>'s  example, no other hotel system would be able to know that a Patient is actually a guest and admission is actually a hotel check-in without some agreed upon system for interactions/data quality.</p>",
        "id": 185128485,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1578500067
    },
    {
        "content": "<p>Implementation guides are indeed key to interoperability.  One of FHIR's strengths is the set of mechanisms for doing that profiling, validating against those profiles and publishing and sharing that documentation.</p>",
        "id": 185129211,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578500507
    },
    {
        "content": "<p>Well, the  hotel example is a little bit extreme, but ok and works. Ok, both sides have to implement the same spec and agree  on it of course. <br>\nFHIR is a framework that helps to achieve interoperability. But as Lloyd states, without implementation guides it will not work. But even with IGs you may end up without interoperability if remaining freedom leeds to different - and then imcompatible - interpretations. <br>\nSo, if you create instances according to one IG and everything is fine, it may end up with missing interoperability according to another IG. If you have to create resource instances obeying to different IGs, those must be compatible, otherwise ...<br>\nThis is the reason why I argue in favor of profile hierarchies.</p>\n<p>Concerning information models, they are coming from a business domain and should reflect the needs and requirements. You can translate those into different technical representations, and also have different representations in FHIR.</p>",
        "id": 185130107,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1578501045
    },
    {
        "content": "<blockquote>\n<p>Are there Open API compliant JSON schemas for FHIR?</p>\n</blockquote>\n<p>yes. it's a switch on the json schema generator. but there are many problems in JSON schema...</p>",
        "id": 185265918,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1578610775
    },
    {
        "content": "<p>Does anyone know if there's any influences of the OData Spec on FHIR?  going through some of the documentation, there's references of OData in the spec.  OData support would really enable BI tool enablement of FHIR API's...</p>",
        "id": 188243874,
        "sender_full_name": "Edward",
        "timestamp": 1581712467
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"264427\">Edward</span> <a href=\"#narrow/stream/179166-implementers/topic/FHIR.20Benefits/near/188243874\" title=\"#narrow/stream/179166-implementers/topic/FHIR.20Benefits/near/188243874\">said</a>:</p>\n<blockquote>\n<p>Does anyone know if there's any influences of the OData Spec on FHIR?  going through some of the documentation, there's references of OData in the spec.  OData support would really enable BI tool enablement of FHIR API's...</p>\n</blockquote>\n<p>Hi Edward, sorry for not replying sooner but the new version (2.78.5740.721) of Power BI Desktop includes a FHIR server connector for native access to FHIR servers.  Documentation can be found <a href=\"https://docs.microsoft.com/en-us/power-query/connectors/fhir/fhir\" target=\"_blank\" title=\"https://docs.microsoft.com/en-us/power-query/connectors/fhir/fhir\">here</a>.</p>",
        "id": 188658746,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1582219836
    }
]