[
    {
        "content": "<p>how to get message count of each resources in fhir server?</p>\n<p>Do we have any query to get each resources count from FHIR server?</p>",
        "id": 188080804,
        "sender_full_name": "Sarankumar",
        "timestamp": 1581573745
    },
    {
        "content": "<p>A search will always return a count of the matches in the first page.  If <em>all</em> you want is the count for the search, use _summary=count</p>",
        "id": 188081727,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581575239
    },
    {
        "content": "<p>can you elaborate the above point please ....?</p>",
        "id": 188081805,
        "sender_full_name": "sandeep nani",
        "timestamp": 1581575349
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"263756\">@sandeep nani</span> you asked this on a thread that wasn't a question you asked - I'm not sure if you're asking for elaboration on the FHIR resource count question or something else.  Make sure you have selected the thread you want to respond to before responding.  Also \"please elaborate\" isn't a very helpful question.  Please explain in more detail what parts of the answer are confusing to you so that the answerer can focus on what you need, rather than just writing volumes of text that might not cover what you're looking for.</p>",
        "id": 188082274,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581576014
    },
    {
        "content": "<p>(Also, when given an answer, before asking further questions, it's always best to dig into the documentation that covers the area mentioned in the answer before asking further questions - asking questions should never be a way to skip reading the documentation.)</p>",
        "id": 188082299,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581576083
    },
    {
        "content": "<blockquote>\n<p>A search will always return a count of the matches in the first page.  If <em>all</em> you want is the count for the search, use _summary=count</p>\n</blockquote>\n<p>thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 188082734,
        "sender_full_name": "Sarankumar",
        "timestamp": 1581576750
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>A search will always return a count of the matches in the first page.  If <em>all</em> you want is the count for the search, use _summary=count</p>\n</blockquote>\n<p>thanks <span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span></p>\n</blockquote>\n<p>Sure Lyod, I got that. However, is there a way we can get the total count of all the resources stored in any FHIR server. Example: If I want to know how many patient, Encounter,  Care Plan, Allergy resources etc. are available in a FHIR server using one search query.</p>\n<p>Regards,<br>\nAritra</p>",
        "id": 188082959,
        "sender_full_name": "Aritra Kundu",
        "timestamp": 1581577103
    },
    {
        "content": "<p>You can perform a search against the base endpoint with no filters.  (That said, few servers will give most clients permission to perform that operation - even if all they're asking for is a count.)</p>",
        "id": 188113311,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581605825
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"247235\">@Aritra Kundu</span> If you want the resource counts by resource, you can create a batch bundle containing individual count queries for each resource of interest and send it to the batch/transaction endpoint. This way you get the counts with a single HTTP interaction. I implemented this in my <a href=\"https://github.com/samply/blazectl\" target=\"_blank\" title=\"https://github.com/samply/blazectl\">blazectl</a> command line tool. Please look under \"Count Resources\".</p>",
        "id": 188114951,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1581606765
    }
]