[
    {
        "content": "<p>If I was to build a FHIR repository, in which all incoming data would go to a no-sql JSON database, what would be the ideal resource type to use for storing the data in FHIR format, would it be bundles? if so what type? Would it be better to have individual resources? Ideas?</p>",
        "id": 153880611,
        "sender_full_name": "Ricardo Pineda",
        "timestamp": 1490977098
    },
    {
        "content": "<p>How are you planning to search/access/manipulate/expose the data once it's stored?  Generally with FHIR the intention is to expose each kind of data as its appropriate resource so that other systems can search and otherise manipulate it.  I.e. vital signs and lab results as Observations, allergies as AllergyIntolerance, etc.  Bundle is used to package up other resources, so Bundle only makes sense for storing if your inbound data is a document or message.</p>",
        "id": 153880616,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490980632
    },
    {
        "content": "<p>We define database schemas and have collections (i.e. tables) for each resource type.  It works splendidly.  Productivity is off the charts.  Data goes from the wire directly to the database with only a tiny bit of hydration/dehydration (i.e. date/timestamps), and vice-versa.   One needs a good infrastructure for event hooks and collection hooks though, because the NoSQL architecture will require cascading data pipelines, and housecleaning workers to keep the duplicated data in sync.  </p>",
        "id": 153880623,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1490983911
    },
    {
        "content": "<p>Hello Lloyd, we would be receiving CDAs, HL7 v2 and other type of documents and then transforming them to a fire bundle and storing them together, later a worker would take these documents and merge them into a single bundle for the patient based on its unique identifier, access would be provided to this bundle. My idea is that instead of creating a whole database schema to use the FHIR schema, does that make sense?</p>",
        "id": 153880625,
        "sender_full_name": "Ricardo Pineda",
        "timestamp": 1490985244
    },
    {
        "content": "<p>Abigail, you are right about the workers and the cascade, so you are putting the FHIR resource directly into a No-SQL database in its own collection and adding some additional data to them? MongoDB or Azure DocumentDB?</p>",
        "id": 153880627,
        "sender_full_name": "Ricardo Pineda",
        "timestamp": 1490985383
    },
    {
        "content": "<p>If you're planning to convert the content, then v2 messages and CDA documents would potentially become bundles.  Other types of documents could become FHIR documents (bundles) or might just be DocumentReferences (e.g. if all you have is a PDF).</p>",
        "id": 153880629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490986871
    }
]