[
    {
        "content": "<p>Some tooling ideas/requirements. </p>\n<p>Does a tool exist that acts as a form based interface to a server. e.g. load a resource, edit, save, browse maybe, follow references etc. Like MySQL workbench (and lots of similar tools), but for FHIR. \"FHIRbench\"?</p>\n<p>Kind of like Postman but with a FHIR aware GUI. ClinFHIR does some of this, but is more of a viewer than a workbench.</p>\n<p>Also, is there a \"table viewer\" for FHIR that shows a query result in GUI tabular form. Or does anything support a mime type of excel, so you can get an excel sheet for a query result (obv with some limitations due to rectangular nature of excel).</p>\n<p>Tools would be aimed somewhere between non-technical clinical users (who always need a full application), and FHIR gurus, who are happy with bundles/xml/json. </p>\n<p>I am thinking of students learning FHIR, researchers doing data building/mining , maybe even DBAs (if there is such a thing in FHIR), and experts who want to debug or just go faster ;-)</p>",
        "id": 166348953,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1558607667
    },
    {
        "content": "<p>Great idea!<br>\nWould you be willing to fund development, maintenance and support of such a tool?</p>",
        "id": 166357810,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1558616327
    },
    {
        "content": "<p>fhir toolkit does some of these things. But mostly I just use POSTman</p>",
        "id": 166357871,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558616400
    },
    {
        "content": "<p>UI need to be dynamic for  resource in different profiles.</p>",
        "id": 166365028,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1558621331
    },
    {
        "content": "<p>that bit I don't have - sounds like a real challenge (based on efforts to generate questionnaires for resources)</p>",
        "id": 166392119,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558639955
    },
    {
        "content": "<p>It would be nice to see a grad or undergrad student take this up as a school project.   Does anyone here have contacts at any of the s/w engineering schools?</p>",
        "id": 166397226,
        "sender_full_name": "John Silva",
        "timestamp": 1558643586
    },
    {
        "content": "<p>I've had something like that running before. This <a href=\"https://data.developer.nhs.uk/ccri\" target=\"_blank\" title=\"https://data.developer.nhs.uk/ccri\">https://data.developer.nhs.uk/ccri</a> used to have an option that displayed resources in a 'clinician friendly' table (it currently has json, pretty json and xml).</p>",
        "id": 166430478,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1558683906
    },
    {
        "content": "<p>We moved it to a separate application epr/portal mock up because the angular app was getting large . The mock EPR/portal seemed to serve the aim of explaining FHIR to clinicians and non techie techs. The link to this is here <a href=\"https://data.developer.nhs.uk/ccri/camel/cc-portal\" target=\"_blank\" title=\"https://data.developer.nhs.uk/ccri/camel/cc-portal\">https://data.developer.nhs.uk/ccri/camel/cc-portal</a><br>\nSo to a uber non techie we can just show the portal and clicking on the FHIR links we can show resources or switching on developer tools show the queries being performed.</p>\n<p><a href=\"/user_uploads/10155/qm0lmDsyyUfeo3ZqVXjPzO3Y/Screenshot-2019-05-24-at-08.48.12.png\" target=\"_blank\" title=\"Screenshot-2019-05-24-at-08.48.12.png\">Screenshot-2019-05-24-at-08.48.12.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/qm0lmDsyyUfeo3ZqVXjPzO3Y/Screenshot-2019-05-24-at-08.48.12.png\" target=\"_blank\" title=\"Screenshot-2019-05-24-at-08.48.12.png\"><img src=\"/user_uploads/10155/qm0lmDsyyUfeo3ZqVXjPzO3Y/Screenshot-2019-05-24-at-08.48.12.png\"></a></div>",
        "id": 166430767,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1558684259
    },
    {
        "content": "<p>p.s. the portal is running on a temp proxy which is causing a few errors - a page refresh or restarting the app should resolve.</p>",
        "id": 166430878,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1558684378
    }
]