[
    {
        "content": "<p>IN a remote patient monitoring scenario a doctor is monitoring several pregnant women. The women are at home but are at risk for certain complications. The women are instructed to take certain measurements which are uploaded to a FHIR server. The doctor subscribes to these measurements using a remote patient monitoring application. What would be the most appropriate FHIR-way for the doctor to respond to examination of these measurements or measurement history? A response may be to indicate everything looks okay, or there is something questionable and one should come in, or it could be an 'alarm' which basically says get in contact ASAP.  The patient's uploader subscribes to these FHIR resources (whatever they are) and it will display the response. That may involve an alarm. If the uploader is on a cell phone the alarm may 'call' the patient but that is out of scope for the FHIR part.</p>\n<p>Would a Flags resource be appropriate? It does not seem so from the description about that scenario. Would a Communication resource be appropriate?  Is there a way to indicate all okay?</p>",
        "id": 169676572,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1562285005
    },
    {
        "content": "<p>I'd update the record with a tag that says the equivalent of \"Dr. Smith has reviewed this\".  If it's not all ok, then presumably the clinician will take action and will create a resource appropriate to whatever action they're taking (Communicate to send it to someone else, Appointment to book a visit, ServiceRequest to order additional tests, etc.)</p>",
        "id": 169678871,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562289687
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I was thinking (in this case) more for the patient to get the responses. The <em>patient</em> would get a notification on the uploader (it would need to subscribe to the appropriate resources or search for it if it were not continuously running), especially the all okay if that were indeed true.</p>",
        "id": 169806045,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1562495442
    },
    {
        "content": "<p>The equivalent of an email read receipt?  That would be a completed Communication resource instance</p>",
        "id": 169819723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562521117
    }
]