[
    {
        "content": "<p>We are mapping from HL7 V2 to FHIR. How do we describe an ActiveNull within FHIR. (The order to delete a field from the database)? <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span></p>",
        "id": 153951645,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1523369232
    },
    {
        "content": "<p>Being far from a v2 geek: wouldn't that be a patch in FHIR?</p>",
        "id": 153951649,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1523369501
    },
    {
        "content": "<p>From <a href=\"https://www.hl7.org/fhir/comparison-v2.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/comparison-v2.html\">https://www.hl7.org/fhir/comparison-v2.html</a> </p>\n<blockquote>\n<p>Nulls and update modes: In HL7 v2, \"action\" codes can determine whether particular segments represent information to be added, updated or deleted. Fields can be populated with \"null\" (two consecutive double-quotes with no other characters) to note a field is to be deleted. An omitted element or repetition is generally interpreted as \"retain existing data unchanged\". This contrasts with the FHIR approach of requiring all data to be present as a snapshot. Systems will either need to build in logic to generate a full snapshot of each resource or consider using the <a href=\"https://www.hl7.org/fhir/http.html#patch\" target=\"_blank\" title=\"https://www.hl7.org/fhir/http.html#patch\">Patch Operation</a> instead.</p>\n</blockquote>\n<p>Bigger picture: the v2 null is not REST-ful. I'd lean more towards the \"all data present as a snapshot\" solution vs the <code>PATCH</code> solution. <code>PATCH</code> could get really messy - do you <code>PUT</code> all the normal fields, then <code>PATCH</code> the nulled field?</p>",
        "id": 153951653,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1523371155
    },
    {
        "content": "<p>If any resource equals a snapshot situation for that resource (which is not an unreasonable assumption since resources used to be the smallest atom for change, until PATCH came along), then I guess anything not populated in the resources is effectively nullified?</p>",
        "id": 153951658,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1523373486
    },
    {
        "content": "<p>Anything not populated is \"requested\" to be nullified.  However, the server has the right to ignore the request - as they do in v2.</p>",
        "id": 153951668,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1523379905
    },
    {
        "content": "<p>Sounds fair. I think that covers my question although there's always room for detailed thoughts</p>",
        "id": 153951672,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1523380307
    }
]