[
    {
        "content": "<p>Hi ,</p>",
        "id": 154013144,
        "sender_full_name": "nisha ks",
        "timestamp": 1540804368
    },
    {
        "content": "<p>I am planning to migrate my DSTU2 fhirbase to DSTU3 fhirbase. So for that I have installed fhirbase3.0 from \"<a href=\"https://www.health-samurai.io/fhirbase\" target=\"_blank\" title=\"https://www.health-samurai.io/fhirbase\">https://www.health-samurai.io/fhirbase</a>\" and I got 277 tables (main tables and history tables) and only one public schema. But in my DSTU2 I had mapping tables as well and also many schema's as well. I coudnt find any of such kind in DSTU3.0 . Can some one help me with this. Am I missing something ?</p>",
        "id": 154013145,
        "sender_full_name": "nisha ks",
        "timestamp": 1540804548
    },
    {
        "content": "<p>Hi, I followed \"<a href=\"https://fhirbase.aidbox.app/getting-started\" target=\"_blank\" title=\"https://fhirbase.aidbox.app/getting-started\">https://fhirbase.aidbox.app/getting-started</a>\" for my Fhirbase 2.0 to Fhirbase 3.0 migration. I got all the tables created for fhirbase. But Fhirbase 2.0 had many schema's and mapping tables. But I couldn't see any of those schema's or mapping tables with Fhirbase 3.0 fhirbase init command. Am I missing some steps.</p>\n<p>I basically wanted to upgrade my current Fhirbase 2.0 DB to Fhirbase 3.0. That is why I am confused. All schema's and mapping tables are missing in 3.0. And also I could see only basic CRUD operation functions in my fhirbase. What about  Search and other functionalities?<br>\nI have my own REST End points which is connected to fhirbase and calls those procedures. How can I implement the same in fhirbase 3.0 ?</p>",
        "id": 154013147,
        "sender_full_name": "nisha ks",
        "timestamp": 1540807912
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191318\">@nicola (RIO/SS)</span></p>",
        "id": 154013155,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540811828
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192687\">@nisha ks</span> Hi Nisha. Unfortunatelly Fhirbase 3.0 is not compatible with Fhirbase 2.0, so you can't easily migrate between them. The best thing you can do is to export all the resources from Fhirbase 2.0 database into NDJSON file(s) and then load them with <code>fhirbase load</code> command into the new Fhirbase 3.0 database. And because you want to migrate from DSTU2 to DSTU3 you'll need to write code to migrate resources from DSTU2 to DSTU3, because Fhirbase won't preform such migration automatically.</p>\n<p>I'm not sure which mapping tables you mention in your question, could you provide exact table names? And regarding to FHIR Search, its not going to be implemented in the new Fhirbase. New Fhirbase only supports basic CURD functionality.</p>",
        "id": 154013178,
        "sender_full_name": "Mikhail Lapshin",
        "timestamp": 1540817341
    }
]