[
    {
        "content": "<p>Hello,</p>\n<p>Where should I ask about the types of managed FHIR Servers that are available? Is here okay?</p>",
        "id": 221774227,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1609944167
    },
    {
        "content": "<p>Hi Josh - in general we try and stay away from discussing commercial offerings on this forum, the focus is on discussions around FHIR, and to have such discussions in a vendor agnostic manner. Knowledgeable readers are encouraged to respond by DM directly to Josh.</p>",
        "id": 221775777,
        "sender_full_name": "René Spronk",
        "timestamp": 1609944918
    },
    {
        "content": "<p>indeed it is against governance to speak of these things as it leads to concerns with anti-competitive behavior ... a forbidden thing for a standards organization.</p>",
        "id": 221776045,
        "sender_full_name": "John Moehrke",
        "timestamp": 1609945039
    },
    {
        "content": "<p>There is a listing of Open Source <a href=\"https://confluence.hl7.org/display/FHIR/Open+Source+Implementations\">https://confluence.hl7.org/display/FHIR/Open+Source+Implementations</a></p>",
        "id": 221777445,
        "sender_full_name": "John Moehrke",
        "timestamp": 1609945680
    },
    {
        "content": "<p>Publicly available Test Servers (sandboxes)  <a href=\"https://confluence.hl7.org/display/FHIR/Public+Test+Servers\">https://confluence.hl7.org/display/FHIR/Public+Test+Servers</a></p>",
        "id": 221777559,
        "sender_full_name": "John Moehrke",
        "timestamp": 1609945726
    },
    {
        "content": "<p>from those you can get a feel for the potential products... but there will be products that are neither open-source (or didn't register here) nor offer a test server.   Those that want to hide, can hide.</p>",
        "id": 221778139,
        "sender_full_name": "John Moehrke",
        "timestamp": 1609945965
    },
    {
        "content": "<p>Thanks, I have found several options but was hoping for a list.</p>",
        "id": 221780684,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1609947130
    },
    {
        "content": "<blockquote>\n<p>indeed it is against governance to speak of these things</p>\n</blockquote>\n<p>This is a broad statement! It doesn't appear to be part of our <a href=\"https://confluence.hl7.org/display/FHIR/Chat.fhir.org+Community+Expectations\">community expectations</a>, and it also seems inconsistent with the actual chat that happens here, were questions often arise about specific products and capabilities.</p>",
        "id": 221824927,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1609967890
    },
    {
        "content": "<p>It can be a slippery slope. Someone PMed me a list of the offerings they were aware of. A neutral list does not seem harmful, though.</p>",
        "id": 221825922,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1609968417
    },
    {
        "content": "<p>Josh, I agree it is not well defined in current community expectations. There certainly is no problem with someone mentioning their product. The confluence pages that allow someone to add their products might be okay. The problem that standards organizations have gotten trouble in the past is when the SDO organizes a publication that lists products. This is an endorsement by the SDO of a product.   This is a lesson so strongly learned by DICOM, that they verbally start every meeting with a warning to not speak of products (pricing or customers).</p>",
        "id": 221827074,
        "sender_full_name": "John Moehrke",
        "timestamp": 1609969063
    }
]