[
    {
        "content": "<p>I have asked this question during the last F2F but I did not get a clear answer. Specifically I would like to understand how (or if) the FHIR maturity of IGs is affected by the FHIR maturity of the underlying FHIR resources that are used to build the IG. In reading the FMM (<a href=\"http://wiki.hl7.org/index.php?title=FHIR_Maturity_Model\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Maturity_Model\">http://wiki.hl7.org/index.php?title=FHIR_Maturity_Model</a>) I find the following:</p>\n<p>\"In most cases, if an artifact is derived from or otherwise depends on another artifact, the derived artifact cannot be more mature than the artifact referenced. However, FMG may make general or specific exceptions to this rule. \"</p>\n<p>Is it correct for me to understand that the maturity of (for example) the Personal Health Devices IG can only be as high as the maturity of the Device resource regardless of how many times the PHD IG is tested across its scope?</p>",
        "id": 159415185,
        "sender_full_name": "Martin Rosner",
        "timestamp": 1551178658
    },
    {
        "content": "<p>That's the general answer, yes.  A profile on a resource can't  be more mature than the underlying resource and an IG can't be more mature than it's most mature content.  All of these rules are \"guidelines\" - so it's possible the FMG could overrule them in some situations, but there'd have to be a strong case to do that.</p>",
        "id": 159431049,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551193809
    },
    {
        "content": "<p>You could imagine a situation where a particular IG uses a resource in a narrow way, where that narrow aspect reasonably has a higher maturity than the general resource.</p>",
        "id": 159488343,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1551252010
    },
    {
        "content": "<p>Right.  But things get tricky around going normative.  If you have a strong need, come chat with the FMG and we'll figure out what's possible/reasonable.</p>",
        "id": 159531262,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551286073
    }
]