[
    {
        "content": "<p>I'm wondering if anyone knows about any initiative that uses FHIR Batch/Transaction as JSON files submitted over FTP/SFTP rather than over HTTP.<br>\nWe might need to add a SFTP channel for some legacy client applications that are unable to use our HTTP API and I just wanted to see if anyone else has already done this.</p>",
        "id": 153954593,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1524771263
    },
    {
        "content": "<p>We use this approach but with kafka topics</p>",
        "id": 153954603,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1524772833
    },
    {
        "content": "<p>I'm not familiar with Kafka yet, though we plan to test it soon. I'm wondering if you've created a specification for your clients describing structure and naming convention for the files, folders where they should submit their files to, etc. Is there any industry standard around this?</p>\n<p>I'm also wondering if you treat this as a batch/transaction or as a message (using MessageHeader as the first resource in the bundle). My feeling is that messaging paradigm might be a better fit for this use case.</p>",
        "id": 153954606,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1524773625
    },
    {
        "content": "<p>I think it would depend on whether or not it's a Message - there is some additional baggage that comes along with them. MessageDefinition, EventDefinition etc. would be part of the messaging flow.</p>",
        "id": 153954666,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1524778003
    },
    {
        "content": "<p>We also use kafka to stream data and think it would be a great approach for bulk fhir.  There are a lot of interesting options that fhir could benefit from -i.e. avro/protobuf.</p>",
        "id": 153955321,
        "sender_full_name": "Jeff Graham",
        "timestamp": 1525224678
    },
    {
        "content": "<p>I suppose it needs some additional care due to Kafka nature. One and only one mode brings certains overhead which can't be ignored and if Kafka is forced to work in such mode its performance (supposingly) is no different from other messaging platforms.</p>",
        "id": 153955533,
        "sender_full_name": "Łukasz Dywicki",
        "timestamp": 1525298571
    }
]