[
    {
        "content": "<p>Hi all,<br>\nCan anyone please link me to the right forum where I can put questions to understand FHIR hospital measures. We already have a link for a set of examples <a href=\"http://hl7.org/fhir/us/cqfmeasures/2020Feb/examples.html\">http://hl7.org/fhir/us/cqfmeasures/2020Feb/examples.html</a>. But there are few queries will we get ELM specification directly ref from measure or need to decode the content from the library? Do the measure have a concrete structure or will there be again some changes? These doubts are basically to start consuming and parsing the FHIR measures.</p>",
        "id": 200085107,
        "sender_full_name": "Avijeet",
        "timestamp": 1591616061
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 200102975,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591625722
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"303201\">@Avijeet</span> , the examples in the link you posted are from the balloted specification. We have been applying changes and are preparing to publish the reconciled version of that specification. A more up to date set of examples can be seen in the examples we used in the most recent connectathon, specifically the <a href=\"https://github.com/DBCG/connectathon/tree/master/fhir401/bundles\">FHIR401</a> folder has the content that conforms to the implementation guide that will be published.</p>",
        "id": 200118151,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591631568
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>. I still see the FHIR eCQM measures are referring to the libraries for measure population calculation. And in the library, text/cql and application/elm+xml  are base-64-encoded encoded. Do we see this to change? I mean any specification like what we have in HQMF eCQM where the measure has a direct reference to ELM (XML and JSON).</p>",
        "id": 200512077,
        "sender_full_name": "Avijeet",
        "timestamp": 1591859857
    },
    {
        "content": "<p>Hi Avijeet, the Attachment data type allows references to content by url, rather than embedded as data, and we have played with that, but we always ended up needing to access the content directly anyway, so inlining as data was the easiest solution. If not there, where? The goal of the Measure/Library usage is that it's a package that can be distributed via FHIR resources, just like any other FHIR resources.</p>",
        "id": 200615131,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591914384
    }
]