[
    {
        "content": "<p>Firstly, I'm new to FHIR and it's community so feel free to point me to any resource that I should've read before asking this question :)</p>\n<p>I'm trying to understand how to save a conference between practioneers. </p>\n<p>The scenario is as follows.<br>\nA group of practioneers have a meeting about how to treat a patient. The patient is not a participant in the meeting. <br>\nShould I save this meeting as an encounter with the patient as a subject even if the patient wasn’t an attendee of the meeting?<br>\nAccording to the practioneers here in Sweden that I’ve talked to this is a very common scenario but I do not know how common it is outside our borders.</p>\n<p>The encounter specification clearly states that the subject is present and Jean Duteau gave the suggestion to extend upon Encounter and add a sort of Patient state to indicate that the Patient was not in fact present at the meeting. He also pointed out to me that (and here I might have misunderstood him) I might contact the Patient Administration Work Group to get their input on this problem since it might be of interest to them in their ongoing work to complete the Encounter specification.</p>\n<p>Now to my question. I did find out that Brian Postlethwaite is the project facilitator of the project \"1102 - Develop FHIR resources for Patient Administration\". Should I reach out to him in this chat? Is there a less intrusive communications channel for these kinds of questions?</p>\n<p>Any help or pointers are appreciated.</p>",
        "id": 159051613,
        "sender_full_name": "Johan Sandblom",
        "timestamp": 1550740245
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> -- get his attention with @</p>",
        "id": 159069390,
        "sender_full_name": "John Moehrke",
        "timestamp": 1550757714
    },
    {
        "content": "<p>The use-case could be done as with any clinical note. Which are unstructured and we all don't know how best to record them... but the recommendation today is simply a DocumentReference with the note content.<br>\nYou might have the starts of a new Resource... What does one of these look like in your system today? Do you have an example you can share? Examples help us greatly</p>",
        "id": 159069577,
        "sender_full_name": "John Moehrke",
        "timestamp": 1550757848
    },
    {
        "content": "<p>This is an appropriate forum for asking the question - and welcome :)</p>\n<p>What's the purpose for representing the \"meeting\"?  Do you just care about who was involved in the recommendations that come out?  Capture billing information associated with the meeting?  Or is there a need to be able to search on and retrieve the meetings themselves?</p>",
        "id": 159077005,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550763295
    },
    {
        "content": "<p>I think that the Encounter resource is the correct one, and does follow on from an appointment that would be the planning stage which covers this also.<br>\nCan you please log a tracker to request for clarification in the specification on how this should work.</p>",
        "id": 159130977,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1550811574
    },
    {
        "content": "<p>Woo hoo! I gave him the right answer! :)  Thanks for joining Johan and bringing your question here.</p>",
        "id": 159131438,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1550812228
    },
    {
        "content": "<p>Thanks for the answers :)</p>\n<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> How do I log a tracker? </p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Well, we're not really interested in what was said or decided during the meeting. From our perspective the important thing is to register that a care giver meeting did take place and who attended the meeting. The meeting, once again from our perspective, is always about a patient and the patient <em>might</em> be a participant in the meeting but often will not. The purpose is for us to be able to present the patient, and care givers, the information that the meeting did occur.</p>",
        "id": 159137058,
        "sender_full_name": "Johan Sandblom",
        "timestamp": 1550820374
    },
    {
        "content": "<p>To lodge a tracker, click on the \"propose a change\" link at the bottom of any page in the spec.  There's a one-time registration process where we try to confirm you're a real human being, after which you can submit change requests to your heart's content :)</p>",
        "id": 159137229,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1550820649
    },
    {
        "content": "<p>After some discussion at the WGM in Patient Administration there was some suggestion that the new Encounter.SubjectStatus property <em>could</em> be used for this (with the addition of a value covering \"not-directly-involved\"), but some are very tentative on the idea and think that a new property would better serve, and are struggling to come up with a suitable property name - \"DirectlyInvolved\"?.<br>\nThis new property will need to cover that the patient isn't directly involved in the encounter, it's about them, rather than with them.<br>\nIf we add it this way, then most encounters will need this property set, and the exceptional cases will have it set to false (a bi-product of the no-defaults change in R4)<br>\nThoughts?</p>",
        "id": 165007214,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1557167998
    },
    {
        "content": "<p>In the envisioned use cases, is it fair to say the patient is at least present via proxy? If so, perhaps documenting that as such would avoid changing the definition of Encounter and allow a way to express more accurately.</p>",
        "id": 166851295,
        "sender_full_name": "Julie Maas",
        "timestamp": 1559160150
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194075\">@Halina Labikova</span> this is where the issue is being discussed, and there is already a tracker <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20479\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20479\">GF#20479</a> logged.</p>",
        "id": 166853537,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559161445
    },
    {
        "content": "<p>In the PA conference call today we discussed this and these are some of the notes:<br>\nExisting Resource intro sentence:</p>\n<div class=\"codehilite\"><pre><span></span>An interaction between a patient and healthcare provider(s) for the purpose of providing healthcare service(s)\nor assessing the health status of a patient.\n</pre></div>\n\n\n<p>This sentence implies that the meeting included the patient. The desire is that this should be modified to permit the encounter to also be ABOUT a patient.<br>\nSo a revised version of this text was drafted for consideration</p>\n<div class=\"codehilite\"><pre><span></span>An interaction between healthcare provider(s), and/or patient(s) for the purpose of providing healthcare service(s)\nor assessing the health status of patient(s).\n</pre></div>\n\n\n<p>It was noted that the ISO definition stated that encounters must have a patient directly involved.</p>",
        "id": 166853916,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559161726
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191416\">@Iryna Roy</span> also points out this link too <a href=\"https://ushik.ahrq.gov/ViewItemDetails?system=mdr&amp;itemKey=74379000\" target=\"_blank\" title=\"https://ushik.ahrq.gov/ViewItemDetails?system=mdr&amp;itemKey=74379000\">https://ushik.ahrq.gov/ViewItemDetails?system=mdr&amp;itemKey=74379000</a></p>",
        "id": 166854145,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559161865
    },
    {
        "content": "<p>Yes, and if you follow the link, specifically it says \"The clinical encounter definition also excludes practitioner actions in the absence of a patient such as practitioner-to-practitioner interaction and practitioner-to-records interaction. This includes the sub-domains of admission information, transfer (patient movement) information, discharge information, provider information, accident information, and death and autopsy information.\"</p>",
        "id": 166854296,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1559161974
    },
    {
        "content": "<p>I spoke with clinical people here at the Cancer Agency. There are consultations, conferences are happening between large groups of providers. They are blocked on the dr schedule as \"blocked time for non-patient attend appointments\" and those do not result in an encounter.</p>",
        "id": 166854431,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1559162082
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> this then re-opens the question on what the review meeting about (and not with) a patient is recorded as.<br>\nIn our system these are recorded as indirect time</p>",
        "id": 166854450,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559162104
    },
    {
        "content": "<p>Providers would note outcomes for themselves and then schedule the appointments or requests labs for A Patient and those are encounters.</p>",
        "id": 166854484,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1559162145
    },
    {
        "content": "<p>What do those meetings result in?<br>\nAnd is that recorded against the patient, and is it charged to the patient, or is it a hospital overhead?</p>",
        "id": 166854538,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559162165
    },
    {
        "content": "<p>I haven't seen an EHR system that would record such meetings. Rounds, conferences are happening but there is no message exchange. Encounters are not for those purposes</p>",
        "id": 166854614,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1559162251
    },
    {
        "content": "<p>There's two questions here:<br>\n- in real systems, how do they track \"meetings\" that consume resources (rooms, practitioners, maybe certain equipment) that do not involve patients<br>\n- is the data sufficiently different for this to justify a distinct resource from Encounter and do systems have a clear ability to always differentiate between meetings that are Encounters vs. those that are not?</p>",
        "id": 166854631,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559162269
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> those outcomes are not recorded in HIS, EHRs or EMRs</p>",
        "id": 166854708,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1559162300
    },
    {
        "content": "<p>Scheduling systems will absolutely need to track these things.  EHRs (which are generally patient-focused) probably wouldn't care.</p>",
        "id": 166854712,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559162303
    },
    {
        "content": "<p>FHIR is also not just an EHR spec.</p>",
        "id": 166854763,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559162343
    },
    {
        "content": "<p>Billing systems might also need to care - if some of the outcomes can potentially be attributed to be a patient benefit.</p>",
        "id": 166854776,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559162346
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - as  I previously said - Scheduling wise those are recorded as Blocked Time for non-patient attend appointments</p>",
        "id": 166854791,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1559162364
    },
    {
        "content": "<blockquote>\n<p>Billing systems might also need to care - if some of the outcomes can potentially be attributed to be a patient benefit.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Billing systems will track it if an advice from another provider is actually taken and implemented - like an appointment with the patient scheduled, encounter happened and a service performed. WHile it is only a discussion, there is nothing to charge.</p>",
        "id": 166854980,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1559162508
    },
    {
        "content": "<blockquote>\n<p>FHIR is also not just an EHR spec.</p>\n</blockquote>\n<p>FHIR is a standard for healthcare information exchange.</p>",
        "id": 166855089,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1559162575
    },
    {
        "content": "<p>Blocked time isn't sufficient - you'll actually want to create appointments, book rooms, track planned attendance of practitioners, etc.  If you're having a case review meeting, you're going to have a bunch of clinicians in a room looking at a bunch of cases - and could potentially end up billing the records of every patient whose record was reviewed.</p>",
        "id": 166855131,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559162605
    },
    {
        "content": "<blockquote>\n<p>Blocked time isn't sufficient - you'll actually want to create appointments, book rooms, track planned attendance of practitioners, etc.  If you're having a case review meeting, you're going to have a bunch of clinicians in a room looking at a bunch of cases - and could potentially end up billing the records of every patient whose record was reviewed.</p>\n</blockquote>\n<p>No. If it is for a patient visit in a hospital, it is already charged, per day. Rooms are booked when you block the time. (or Outlook is used). Yes you will have meetings and patients reviewed daily. Those are not encounters.</p>",
        "id": 166855300,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1559162734
    },
    {
        "content": "<p>\"those are not encounters\" is a statement based on a presumed definition.  The question is how systems need to track such meetings and then we'll determine whether the encounter resource is the most appropriate fit.</p>",
        "id": 166855408,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559162802
    },
    {
        "content": "<p>Scheduling systems will need to create appointments for non-patient-centric meetings.  And case review sessions will often happen when the patients involved aren't inpatients anywhere.</p>",
        "id": 166855462,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559162851
    },
    {
        "content": "<p>That doesn't necessarily mean that the case review isn't billable.</p>",
        "id": 166855471,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559162865
    },
    {
        "content": "<p>I just explained how the systems track it. In the province of British Columbia. Based on various hospital systems implemented and now moving to the Cerner EHR. Do we have any other person directly working right now and sitting in a room of clinicians that can say those are recorded as encounters?</p>",
        "id": 166855581,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1559162935
    },
    {
        "content": "<p>When the patient enters the door of the hospital it is already billable and chargable by default 700 dollars :) I paid :)</p>",
        "id": 166855696,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1559163005
    },
    {
        "content": "<p>Those are scheduled blocks but not encounters</p>",
        "id": 166855754,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1559163053
    },
    {
        "content": "<p>I don't care what end-users call them.  I care whether:<br>\na) systems track appointments that are not patient-centric and;<br>\nb) whether they track the resulting \"events\" for those appointments, whether for billing or other purposes</p>\n<p>If they do, we need to figure out what resource is going to be used to represent such meetings.  The choices will likely be either \"generify the definition of Encounter\" or \"define a new resource\".  We'll need to figure out which of those two options makes the most sense based on how systems that currently deal with those concepts handle them now.</p>",
        "id": 166859393,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559165956
    },
    {
        "content": "<p>at the last WGM this was a discussion started because there is a need to capture tumor board  meetings with FHIR between <span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> <span class=\"user-mention\" data-user-id=\"192302\">@May Terry</span> myself and members of PA. The resulting FHIR resources of a conference between physicians about a patient need an envelope to connect them together. Encounter suites very well for this purpose, only the scope definition kept us away from using it. Encounter isn't a billing only scoped resource so i would be in favor to extend the scope. <br>\nJust using clinical notes or bundles doesn't seems right. Appointment is great for scheduling the meeting, but we also need a way to capture the conference as well.</p>",
        "id": 166863498,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1559169135
    },
    {
        "content": "<blockquote>\n<p>I don't care what end-users call them.  I care whether:<br>\nb) whether they track the resulting \"events\" for those appointments, whether for billing or other purposes</p>\n<p>If they do, we need to figure out what resource is going to be used to represent such meetings.  </p>\n</blockquote>\n<p>Our FHIR based virtual tumor conference software has the need to,  and others involved in the oncological space as well.</p>",
        "id": 166863524,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1559169210
    },
    {
        "content": "<p>Does your tumor conference software represent regular encounters as well?</p>",
        "id": 166869230,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559175767
    },
    {
        "content": "<p>And appointments don't capture the actuals, only the planned, so something needs to capture that.</p>",
        "id": 166872981,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1559180527
    },
    {
        "content": "<p>Can we create a different resource for it? There will be different requirements for those events and it will be hard to validate the data integrity if we mix two concepts. Encounter is a different clinical event.</p>",
        "id": 166938696,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1559244671
    },
    {
        "content": "<p>We certainly can.  The question is whether we should.  And that'll be driven by how similar requirements are and how often systems display or persist integrated views of both patient-specific and non-patient-specific meetings.  Certainly we'll need a computable means of distinguishing the patient-centric from non-patient-centric events if we do decide to use a single resource for both concepts.</p>",
        "id": 166939288,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559245104
    },
    {
        "content": "<p>Regarding \"regular\" encounter in tumor conference software: from my experience with a couple of specialized oncological documentation system in Germany, which all include tumor conference data and management, usually the regular encounter is of no importance, since encounters are of no relevance to the process of cancer diagnostics and treatment.<br>\nHowever, these systems need to deal with encounters, since they usually are an endpoint in the hospital's v2 message stream.<br>\nAlso, some of these systems are modules of some hospital information system and as such are more oriented towards the encounter perspective.</p>",
        "id": 166947524,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1559251458
    },
    {
        "content": "<p>In short:<br>\nDo they communicate encounters? Yes, but only inbound and always via v2 (for now)<br>\nDo they store encounters? Most do, some do not.<br>\nDo they rely on encounters? Basically only to understand what the encounter oriented world of hospital systems wants to tell</p>",
        "id": 166948410,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1559252204
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> this has not moved forward and wondering if you have any further suggestions here.<br>\nWould like some feedback from EHR vedor too...<br>\n<span class=\"user-mention\" data-user-id=\"191357\">@Andrew Torres</span> <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span></p>",
        "id": 176102075,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1568901605
    },
    {
        "content": "<p>So the issue is that no tracker was submitted?</p>",
        "id": 176138254,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568924573
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20479\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20479\">GF#20479</a></p>",
        "id": 176138472,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1568924700
    },
    {
        "content": "<p>It was hotly debated in a quarter in May 2019 WGM.</p>",
        "id": 176138508,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1568924728
    },
    {
        "content": "<p>I'm trying to understand what the barrier to moving things forward is.</p>",
        "id": 176149259,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568933354
    },
    {
        "content": "<p>In NL we have multidisciplinary team meetings with midwifes and gynecologists where complex birth care cases are discussed. Several systems do record them as \"contactmoment\" - which basically is Encounter, but w/o Patient. <br>\nI also believe Encounter stating it is an \"interaction between a patient and healthcare provider\" with patient present as being to strict in numerous other cases - premature babies, advanced stage Alzheimer, comatose patients. The current definition does not seem to allow an Encounter with guardians or parents, which is a common case.</p>",
        "id": 186513923,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1579887064
    },
    {
        "content": "<p>Hello</p>",
        "id": 187989499,
        "sender_full_name": "sandeep nani",
        "timestamp": 1581495597
    },
    {
        "content": "<p>you mean this <a href=\"http://community.fhir.org/\" target=\"_blank\" title=\"http://community.fhir.org/\">http://community.fhir.org/</a> ?</p>",
        "id": 187989965,
        "sender_full_name": "Jeff Chen",
        "timestamp": 1581496161
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"263756\">@sandeep nani</span>.  This is an appropriate place to ask questions.  It's an asynchronous environment, so you should just post your question and wait a while for answers</p>",
        "id": 188017548,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581519759
    },
    {
        "content": "<p>Hello Zulip,</p>\n<p>Hope you are doing well....!</p>\n<p>I have some questions regarding FHIR, I hope you will help me.</p>\n<p>1) How to make FHIR standards EHR application to  HIPAA<br>\nCompliance/Comptable..?<br>\n2) Is there any provision for auditing EHR application for FHIR Standard<br>\nand Certification? If so What are provision for applying FHIR Standards..?<br>\n3) FHIR and DICOM Resources List..?</p>\n<p>Please try to help me as soon as possible.</p>\n<p>Thanks and Regards,<br>\nSandeep.</p>",
        "id": 188080437,
        "sender_full_name": "sandeep nani",
        "timestamp": 1581573193
    },
    {
        "content": "<p>As per the rules for asking questions:</p>\n<ul>\n<li>don't ask the same question on multiple streams unless asked to do so.  (You've posted your question #3 somewhere else - I responded to it there.)</li>\n<li>indicate what research you've already done and what you're having trouble understanding/finding.  Your first question suggests that you don't really have good understanding of HIPAA or FHIR.  HIPAA mandates the use of certain standards for data sharing in certain circumstances.  FHIR isn't one of them.  HIPAA also sets out rules for what data can be shared freely and what can't.  FHIR is agnostic to that - if you're bound by HIPAA, then you need to follow HIPAA's rules about what data can be shared with whom and in what circumstances regardless of whether you're using FHIR</li>\n<li>HL7 does not audit FHIR implementers.  ONC or other regulators may choose to audit for compliance to regulations.  As yet, there are no U.S. regulations that mandate FHIR.  It's possible that may change soon, but we have no inside information as to what the rules will be or what processes the regulators will make use of.</li>\n</ul>",
        "id": 188080705,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581573603
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 188080902,
        "sender_full_name": "sandeep nani",
        "timestamp": 1581573939
    },
    {
        "content": "<p>On the subject of multidisciplinary team meetings where the patient can be present (or not): in the Netherlands we are trying to map the new zib MultidisciplinaryTeamMeeting - <a href=\"https://zibs.nl/wiki/MultidisciplinaryTeamMeeting-v1.0(2020EN)\">https://zibs.nl/wiki/MultidisciplinaryTeamMeeting-v1.0(2020EN)</a> to R4. The Encounter resource seems a good fit - except for the strict definition. <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> is there still discussion ongoing or has this gone completely silent (looking at <a href=\"https://jira.hl7.org/browse/FHIR-20479\">https://jira.hl7.org/browse/FHIR-20479</a>)?</p>",
        "id": 234303929,
        "sender_full_name": "Jorn Duwel",
        "timestamp": 1618311000
    }
]