[
    {
        "content": "<p>Hi Team, can you guys help us with the fhir mapping with the custom applications?</p>",
        "id": 214540513,
        "sender_full_name": "Lokesh G S",
        "timestamp": 1603696896
    },
    {
        "content": "<p>Could your provide more details? Please also see <a href=\"https://wiki.hl7.org/FHIR_Rules_for_asking_questions\">https://wiki.hl7.org/FHIR_Rules_for_asking_questions</a></p>",
        "id": 214541555,
        "sender_full_name": "René Spronk",
        "timestamp": 1603697934
    },
    {
        "content": "<p>I shall upload the file with our fields which are used for the practitioner &amp; organization .. can you please help us with mapping</p>",
        "id": 214542396,
        "sender_full_name": "Lokesh G S",
        "timestamp": 1603698682
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/xvm35fQhKvvu5QlDBIPWIokQ/prac_org.xlsx\">prac_org.xlsx</a></p>",
        "id": 214542402,
        "sender_full_name": "Lokesh G S",
        "timestamp": 1603698692
    },
    {
        "content": "<p>As pointed out in the above 'rules for asking questions' - we (all of us are volunteers) are not going to do your work for you - we'll answer your questions should you run into problems mapping specific fields.<br>\n I would suggest you start by reading the documentation of the Practitioner and the Organization resource, and then to document the mapping in your spreadsheet.</p>",
        "id": 214567756,
        "sender_full_name": "René Spronk",
        "timestamp": 1603716225
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"356954\">@Lokesh G S</span> Most of your fields can be found in the Practitioner and Organization resources.  I suggest you look at those two resources in FHIR specification and do your mapping to those.</p>\n<p>Clinicial/Practitioner<br>\nBiodata - name, identifier, gender, photo - all found in Practitioner<br>\nCredentials - could be Qualifications<br>\nRelationship to Organization is done via PractitionerRole<br>\nMany of the other Practitioner stuff would be Observations or Extensions</p>\n<p>Organization<br>\nName, Addresses, Phone, Type, Identifier, Contact - all found in Organization<br>\nDepartments - partOf reference to Organization<br>\nRest would be Observations or Extensions again</p>",
        "id": 214798725,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1603864852
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>  thanks i will check it . can you please tell us </p>\n<ol start=\"2\">\n<li>\n<p>Video Introduction details?</p>\n</li>\n<li>\n<p>Patient reviews on practitioner?</p>\n</li>\n<li>\n<p>Star Rating given to the practitioner by patient?</p>\n</li>\n<li>\n<p>Digital certificates?</p>\n</li>\n<li>\n<p>Practitioner tagging  like (Signposting, Charity, Crisis, Referring Clinician, Cross-referral, etc. )</p>\n</li>\n</ol>",
        "id": 214799940,
        "sender_full_name": "Lokesh G S",
        "timestamp": 1603866639
    },
    {
        "content": "<p>I'll let you see if you can figure out if those are available on the Practitioner or not. :) (see Lloyd's answers in your other thread you started)</p>",
        "id": 214799964,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1603866701
    },
    {
        "content": "<p>hello, is there anyone familiar with FHIR Mapping language ? I have several platform would be mapped to FHIR, the problem is that each platform has its own naming field, i.e.: Platform A has FirstName and platform B has first_name. I'm thinking if we could automatically detect that and convert it to FHIR standard that'll be better than creating 2 converters to specifically convert those</p>",
        "id": 236619073,
        "sender_full_name": "claudia",
        "timestamp": 1619672074
    },
    {
        "content": "<p>Building an external interface that is consistent will certainly make it easier for external partners to interoperate with your systems.  You'd still be looking at maintaining a distinct StructureMap for each platform to deal with the distinctions, though you may be able to share some pieces of it if there are consistencies across the platforms.</p>",
        "id": 236620982,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619673819
    },
    {
        "content": "<p>Most of the mapping folks hang out on <a class=\"stream\" data-stream-id=\"181579\" href=\"/#narrow/stream/181579-mapping-framework\">#mapping-framework</a></p>",
        "id": 236620994,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619673839
    },
    {
        "content": "<p>\"automatically detect that and convert it\" implies (to my ears) using some heuristics like flattening cases and removing '_'s to compile a set of maps. Is that what you had in mind? (and maybe i should have asked you in #mapping-framework)</p>",
        "id": 236621330,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1619674192
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191452\">@Eric Prud'hommeaux</span> , yep that's what I am referring to</p>",
        "id": 236767128,
        "sender_full_name": "claudia",
        "timestamp": 1619741857
    }
]