[
    {
        "content": "<p>Hi,  what would be a preferred way to represent a dermoscopic examination consisting of multiple images using FHIR R4?</p>\n<p>We already use Observation to capture laboratory and vitals data. And I have noted that Observation.category has a code for <em>imaging</em>, however I can't seem to find a satisfying solution for our dermoscopic examinations.</p>\n<p>One solution I'm looking at is to use Observation.derivedFrom with references to images using either DocumentReference or Media.<br>\nAnother solution would be to use a valueAttachment extension and place all images in Observation.component.</p>\n<p>Or am I looking at this the wrong way and should use Procedure or ImageStudy instead? Or something else?</p>\n<p>Also, I have very limited experience using DICOM and would prefer to avoid it.</p>\n<p>Any suggestions are very much appreciated!</p>",
        "id": 274811929,
        "sender_full_name": "Joakim Antus",
        "timestamp": 1646905876
    },
    {
        "content": "<p>In R4, images are typically captured as Media as it has the descriptive elements around the image.  In R5, that moves to DocumentReference.</p>",
        "id": 274853162,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646927179
    },
    {
        "content": "<p>OK, would <em>Observation.derivedFrom</em> be appropriate for representing the collection of all Media resources created during the examination? Or is there a better solution for representing this collection of Media resources?</p>",
        "id": 274856898,
        "sender_full_name": "Joakim Antus",
        "timestamp": 1646928634
    },
    {
        "content": "<p>What format are the original images in? If they are not in DICOM, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>'s suggestion is good, if they are in DICOM, it's a little more complicated.</p>",
        "id": 274857090,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1646928706
    },
    {
        "content": "<p>derivedFrom documents which content the observation is derived from, not content that is derived from the observation.</p>",
        "id": 274857246,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1646928752
    },
    {
        "content": "<p>Generally, you'd find all images from a procedure by looking for all Media.basedOn or DocumentReference.basedOn the ServiceRequest that Procedure is also basedOn.</p>",
        "id": 274857946,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1646928991
    },
    {
        "content": "<p>To represent the \"dermoscopic\" aspect there is a concept \"427690002 |Diagnostic dermatoscopy of skin (procedure)|\" in SNOMED ( <a href=\"https://snomed.info/id/427690002\">https://snomed.info/id/427690002</a> ). Not sure if that can be used or a good idea, just commenting.</p>",
        "id": 274890339,
        "sender_full_name": "Kai Kewley (Snowstorm)",
        "timestamp": 1646943841
    },
    {
        "content": "<p>The images will be in a non-DICOM format, most likely JPEG.<br>\nUsing Media.basedOn might work in most situations, however, we are targeting primary care and there might be situations where an dermoscopic examination has to be performed without an underlying ServiceRequest to base it on. So, how would one represent a collection of Media resources in that situation.<br>\nOnly referencing the Encounter won't be viable either, since some patients have multiple skin moles that needs examining and we must be able to identify what images belongs to what mole.</p>",
        "id": 274900152,
        "sender_full_name": "Joakim Antus",
        "timestamp": 1646949063
    },
    {
        "content": "<p>You can tie the Media or the Observation to the mole with the standard extension body-site, which lets you specify a BodyStructure associated with the  image/finding.</p>",
        "id": 274900570,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1646949315
    },
    {
        "content": "<p>Thank you for all the help and different suggestions. <br>\nAfter evaluating the different options, we've decided to go by creating a new ServiceRequest <em>on the fly</em>, set the ServiceRequest.intent to proposal and ServiceRequest.requester to the Practitioner and then reference that ServiceRequest in all Media resources using Media.basedOn.</p>",
        "id": 274957115,
        "sender_full_name": "Joakim Antus",
        "timestamp": 1646994704
    },
    {
        "content": "<p>note if you are just getting started with Media... you might want to use DocumentReference to start with... this because DocumentReference supports the Media usecases, and in R5 Media goes away.</p>",
        "id": 274970202,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647003185
    },
    {
        "content": "<p>Great point! Yes, we are just getting started so will  use DocumentReference instead of Media <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span></p>",
        "id": 274971134,
        "sender_full_name": "Joakim Antus",
        "timestamp": 1647003643
    }
]