[
    {
        "content": "<p>As part of working with an implementation of Care Gaps on the DaVinci Quality Measure specification, I am looking through the Bulk Data Access pattern. In going through the generalized Bulk Data Access pattern, I believe I have another pattern that can be additive to the existing Bulk Data Access pattern. In general a lot of the work I’ve done to date with creating FHIR APIs in other situations looks at handling things with either event driven or reactive architectures. One particular specification around “Server Sent Events” or EventSource (<a href=\"http://www.w3.org/TR/eventsource/\">http://www.w3.org/TR/eventsource/</a>) might be something to possibly add on to the existing bulk data exchange pattern.</p>\n<p>I put together some initial thoughts on what this pattern could look like. <a href=\"/user_uploads/10155/nF-hrSxQARux7RqHQ20uKks_/bulk_data_sse.pdf\">bulk_data_sse.pdf</a> Any and all feedback/thoughts are welcome!</p>",
        "id": 218350378,
        "sender_full_name": "Matt Ping",
        "timestamp": 1606772632
    },
    {
        "content": "<p>I think SSE is an interesting pattern -- maybe less relevant for bulk data, but a clear fit for things like subscription notifications. I could imaging this being a useful alternative to WebSockets for subscription notifications (something we've considered before, but frankly we haven't see much development for websockets <em>or</em> SSE, and our initial development has been focused on webhooks).</p>",
        "id": 218460478,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606846481
    },
    {
        "content": "<p>Yeah, I'd agree bulk data isn't a perfect fit. I think more where I was trying to go than anything is more the pattern that you're describing there. At least from my perspective it'd be interesting to try to add on to a FHIR (or in my case DaVinci) endpoint for live use. I'm just trying to see about how best to align with and help update the standards</p>",
        "id": 218471099,
        "sender_full_name": "Matt Ping",
        "timestamp": 1606851658
    }
]