[
    {
        "content": "<p>To be “FHIR Conformant”, a system MUST publish Capability Statement. What you will answer : True or False</p>",
        "id": 234778044,
        "sender_full_name": "Bapi Behera",
        "timestamp": 1618534255
    },
    {
        "content": "<p><em>Applications SHALL return a resource that describes the functionality of the server end-point.</em></p>",
        "id": 234778855,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1618534955
    },
    {
        "content": "<p>servers, yes... clients, maybe.</p>",
        "id": 234846822,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618577381
    },
    {
        "content": "<p>Servers must publish one and make it available at the metadata endpoint.  Clients and non-RESTful systems don't <em>have</em> to have one, but asserting that your system is FHIR conformant without having a CapabilityStatement that supports that declaration isn't terribly meaningful.</p>",
        "id": 234882969,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618590231
    },
    {
        "content": "<p>I would say NO based on the reference below. If I am reading it correctly it says \"May be used\" meaning you do not necessarily need to have a capability statement. Would you agree?</p>\n<p>\"A Capability Statement documents a set of capabilities (behaviors) of a FHIR Server for a particular version of FHIR that may be used as a statement of actual server functionality or a statement of required or desired server implementation.\" </p>\n<p><a href=\"https://www.hl7.org/fhir/capabilitystatement.html#5.2\">https://www.hl7.org/fhir/capabilitystatement.html#5.2</a></p>",
        "id": 234909051,
        "sender_full_name": "Amit Cudykier",
        "timestamp": 1618601733
    },
    {
        "content": "<p>that \"may\" is a statement that the client may use the servers capabiltiy statement for purpose</p>",
        "id": 234909216,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618601820
    },
    {
        "content": "<p>a server that is supporting REST clearly must support the metadata endpoint (using GET or OPTIONS) and return a conformance resource.  This is stated on the http page, not the capabilityStatement page</p>\n<blockquote>\n<p><a href=\"https://hl7.org/fhir/DSTU2/http.html#conformance\">https://hl7.org/fhir/DSTU2/http.html#conformance</a></p>\n</blockquote>",
        "id": 234909603,
        "sender_full_name": "John Moehrke",
        "timestamp": 1618602016
    },
    {
        "content": "<p>Thank you! that makes sense from the client's perspective. From the server (system) perspective the Conformance reference does imply you need CapabilityStatement: \"Systems can only claim FHIR Conformance for functionality described in the applicable CapabilityStatement.\"</p>\n<p><a href=\"http://hl7.org/fhir/conformance-rules.html#2.1.0\">http://hl7.org/fhir/conformance-rules.html#2.1.0</a></p>",
        "id": 234914898,
        "sender_full_name": "Amit Cudykier",
        "timestamp": 1618604519
    }
]