[
    {
        "content": "<p>Just asking/exploring, sorry if redundant, off topic or lacking consistency:<br>\nOnce we make our StructureDefinitions and our CapabilityStatements , we want our FHIR server or façade to adopt it. <br>\nCan we / should we deploy these artefacts to the servers, so that the servers would get the package and automagically adopt the constraints in that package? Does the idea make sense?<br>\nIs there any discussion or recommendation on that?</p>",
        "id": 172095201,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1564541876
    },
    {
        "content": "<p>The servers would still need to define their own StructureDefinitions and CapabilityStatements that define what they actually do (as it'll rarely be an exact match and anywhere there's a SHOULD or MAY they'll have to distinguish what they do vs. not).  It's certainly possible for a client to download a profile and auto-enforce that, but that's a <em>really</em> sophisticated capability that I wouldn't expect most systems to support.</p>",
        "id": 172095353,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564542097
    },
    {
        "content": "<p>depends on how the server supports the structure definitions. There are implementers who want to do that on top of the generic servers. That's one use of the NPM packages</p>",
        "id": 172095711,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564542642
    },
    {
        "content": "<p>I'd love to discuss with any of these other implementers who would use the structure definitions on top of the generic servers. I will check with some developers around here to see how they want to do it.</p>",
        "id": 172096510,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1564544023
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> is one</p>",
        "id": 172096790,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564544412
    },
    {
        "content": "<p>I have a server called <a href=\"https://github.com/life-research/blaze\" target=\"_blank\" title=\"https://github.com/life-research/blaze\">Blaze</a> which is in early stages with a primary focus on CQL. But it is also generic in a sense that you can initialize it with a set of structure definitions and it then supports that resources defined in the structure definitions. It will even work with custom structure definitions as long as the basic primitive types are the same. I could even allow the upload of new structure definitions during runtime. What I currently don't support are search parameters. The capability statement is generated from known structure definitions.</p>",
        "id": 172102861,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1564555026
    },
    {
        "content": "<p>Thanks both.</p>",
        "id": 172104408,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1564557369
    }
]