[
    {
        "content": "<p>Hi everyone!</p>\n<p>I'm a clinician and long-time standards nerd from the pharmacy space.  I fully transitioned to tech 2 years ago working on an (not quite certified) EHR for pharmacists with community practices.  We're really excited about the C-CDA IAT and Da Vinci Project tracks at the upcoming Connectathon in San Antonio.  This would be our first Connectathon--it would help a ton if we understood how the event is set up and what type of learning comes out of the experience. Could you help us understand:</p>\n<p>How are these events facilitated?<br>\nWho would we be interacting with?<br>\nWhich team members/how many should be present (CTO, product manager, engineers, etc)?<br>\nWhat type of learning/benefits would we take home?</p>\n<p>Sorry for the dumb questions--we're an early stage start up running lean, but want to engage with HL7 in the best way possible.</p>\n<p>Thank you!</p>\n<p>Samm Anderegg, Pharm.D., MS, BCPS<br>\nCEO, DocStation</p>",
        "id": 154026100,
        "sender_full_name": "Samm Anderegg",
        "timestamp": 1545145218
    },
    {
        "content": "<p>There are a multitude of tracks running (list for January is here: <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_20\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_20\">http://wiki.hl7.org/index.php?title=FHIR_Connectathon_20</a>).  Each one has a coordinator that will reach out to participants who have self-identified in a survey sent out prior to the event.  Degree of pre-work expected varies by track from \"none\" to \"fully working system that's been tested with peers in advance\".  Participants in a given track gather at the same table or set of tables and work through some of the scenarios, testing with each other.  They may also have break-outs to discuss issues (either in one of the bookable breakout rooms or just in the hall).  People arrive between 8-9 on Saturday and leave between 6 and 9 that evening.  On Sunday we start at the same time with a stop at 4:30, then a summary of highlights and a hard stop at 5.  Attendees include those who build the spec, those who maintain the reference implementations, a range of EHR and other vendors, large companies like Google and Microsoft and small startups.  Some folks will have attended 15+ connectathons previously, others will be there for the first time.</p>\n<p>There's often a range of attendee types, but the event is focused on those who write code.  Learnings include building relationships with others in the same space (and with the organizations you'll need to interoperate with), increased understanding of using FHIR to solve real-world problems, better familiarity with reference implementations, a chance to take the theory of FHIR and apply it in practice, help getting over the humps those sitting beside you have already hit their heads on and learned how to solve, understanding of how to use FHIR in a consistent way to solve track-specific use-cases, ability to influence the FHIR spec to better meet your requirements, sense of who the people are in the community who might be best able to help answer particular questions.</p>",
        "id": 154026105,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1545146533
    },
    {
        "content": "<p>Extremely helpful, thank you so much <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>!</p>",
        "id": 154026117,
        "sender_full_name": "Samm Anderegg",
        "timestamp": 1545149442
    },
    {
        "content": "<p>BTW - note the specific stream for connectathon: <a href=\"#narrow/stream/58-connectathon-mgmt\" title=\"#narrow/stream/58-connectathon-mgmt\">https://chat.fhir.org/#narrow/stream/58-connectathon-mgmt</a></p>",
        "id": 154027031,
        "sender_full_name": "David Hay",
        "timestamp": 1545617358
    }
]