[
    {
        "content": "<p>Hi Implementers, <br>\nI'm relatively new to FHIR and have a more broad question about what architecture pattern (Event-driven or Request-driven) the FHIR Community recommends as best-practice for our FHIR server. Generally our team has been moving towards an event-driven architecture, but considering the FHIR spec supports both patterns we wanted to reach out to clarify if there is a recommended one.<br>\nThank you for your time in advance!</p>",
        "id": 271486667,
        "sender_full_name": "Ross Powell",
        "timestamp": 1644523444
    },
    {
        "content": "<p>we generally recommend that you adopt the patterns that work for you</p>",
        "id": 271488164,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644524147
    },
    {
        "content": "<p>in general, FHIR has nothing to say about that choice, but the community desire has very much been that there's no need to come to consensus about the choices you make in your event drive architecture, because these aren't usually the basis for interoperability - except for messaging. So the specification is strongly dominated by the request pattern, though there is a little about messaging</p>",
        "id": 271488329,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644524241
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"476536\">Ross Powell</span> has marked this topic as resolved.</p>",
        "id": 271495304,
        "sender_full_name": "Notification Bot",
        "timestamp": 1644527680
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> has marked this topic as unresolved.</p>",
        "id": 271495319,
        "sender_full_name": "Notification Bot",
        "timestamp": 1644527686
    },
    {
        "content": "<p>There's actually an extensive set of documentation about the different mechanisms of sharing information in FHIR and the trade-offs between them <a href=\"https://build.fhir.org/ig/HL7/davinci-ehrx/exchanging.html\">here</a></p>",
        "id": 271495433,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644527745
    },
    {
        "content": "<p>Thank you both! I'll take these responses/document back to our team to help decide the high level pattern we'll use for our use cases.</p>",
        "id": 271599765,
        "sender_full_name": "Ross Powell",
        "timestamp": 1644596433
    }
]