[
    {
        "content": "<p>I'm reviewing some existing and proposed interfaces for patient referrals/handovers. <br>\nRoughly the existing (urgent care) is HL7v3 message and CDA document <br>\nThe proposed (emergency care) is FHIR Message and FHIR Document.</p>\n<p>The common model (as FHIR) is ServiceRequest, Patient, Encounter, Practitioner, Organisation and a Letter (Composition). Both the message and clinical documents interactions are supporting workflow and would want to suggest standardisation on one style. <br>\nOne thought would be to use FHIR Messaging focused on ServiceRequest with the supportingInformation being a FHIR Document. This puts the focus on the Referral/Service Request, some of the interactions won't contain supportingInformation (no clinical document) plus it decouples the core message from the letter. </p>\n<p>Q. Would the common resources (Patient, Encounter, etc) be duplicated. Once in the FHIR Message bundle and again in the FHIR Document Bundle OR can I do this inline (so no separate FHIR Document Bundle). </p>\n<p>I tempted to go with inline (no FHIR Document). It would be desirable to support FHIR Documents, I like the linking to structured resources but I'm not seeing this done in practice.</p>",
        "id": 189379969,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1582960165
    },
    {
        "content": "<p>The simplest would be a message pointing to your document where the semantics of the message communicates that you're seeking fulfillment of the ServiceRequest in a known section within the document.  The document Bundle <em>must</em> contain everything the sections point to - so anything you extract from the document for inclusion in the message bundle will have to be duplicated.  (And anything duplicated has a potential for being inconsistent.)</p>",
        "id": 189393405,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582988724
    },
    {
        "content": "<p>I'm seeing the base interaction as having ServiceRequest with the document optional (and document could be pdf or other resource such as questionnaireResponse). <br>\nI need to check if we are actually using FHIR document or cda 'section points to', I suspect it's being used for html only. In that case could I ignore fhir document and just use composition?</p>",
        "id": 189396690,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1582994892
    },
    {
        "content": "<p>Note: we've asked for structured FHIR or cda documents but in practice this isnt being utilised.</p>",
        "id": 189396766,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1582995090
    },
    {
        "content": "<p>You could ignore Composition and just use DocumentReference...</p>",
        "id": 189397318,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582996188
    },
    {
        "content": "<p>I'd prefer composition, I want to support a path to FHIR document (and supporting doc repositories) and if done right it's a minor manipulation of the bundle to get that.</p>\n<p>However if I accept duplication, this may become nicely decoupled. The core referral messages are decoupled from the document.<br>\nSo the core of the emergency to urgent referral MESSAGES are the same as the emergency to ED. It's the document that changes plus this allows using rest in place of messaging.</p>",
        "id": 189424198,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1583049148
    },
    {
        "content": "<p>If you send a Composition outside a Bundle, you wouldn't be able to count on receiving systems enacting FHIR document behaviour, though I suppose the message event code could tell them to...</p>",
        "id": 189437854,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583078287
    },
    {
        "content": "<p>Need to research if that is needed. I think the critical issue is getting the two separate views points: message (mostly devs) and document (mostly clinical) to follow the same hymn sheet rather than quite decoupled.</p>",
        "id": 189438756,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1583080034
    },
    {
        "content": "<p>Most things in FHIR that clinicians think of as being documents shouldn't actually be FHIR documents.  Documents are really for things that are expected to be frozen snapshots and that need to tell a story.  Referral letters is one place where this might be needed.  But the referral management process after the initial letter won't typically involve documents at all.</p>",
        "id": 189440043,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583082590
    },
    {
        "content": "<p>If you send a Composition outside a Bundle, you wouldn't be able to count on receiving systems enacting FHIR document behaviour, though I suppose the message event code could tell them to...</p>",
        "id": 189544265,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583187820
    },
    {
        "content": "<p>Looking a bit further having the two with duplication, seems a small price to pay for flexibility. The core message works on its own, as does the document.<br>\nPlus it’s only a small change to support different handover/referral scenarios with different document contents.</p>",
        "id": 189617577,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1583258432
    }
]