[
    {
        "content": "<p>Hello everyone.<br>\nI am new with FHIR and we have started an implementation with HAPI-FHIR server. </p>\n<p>During the DevDays in the Netherlands there were information about FHIR Packages och versioning. The message was to version the Fhir packages.<br>\nMy question is: Is there any recommended way to use the \"Fhir package version\" in rest-communicaton in a similar way as the fhirVersion? <br>\nEx.<br>\nAccept: fhirVersion=4.0, <strong>packageVersion=1.0.0</strong>, application/json+fhir</p>",
        "id": 166242950,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558509131
    },
    {
        "content": "<p>When would this REST traffic occur?  Is this a Fhir client requesting the download of a package?  Or is this a client requesting a conformance resource (say a StructureDefinition) for a certain version of FHIR for a certain version of a package from a server?</p>",
        "id": 166248585,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1558515164
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"221915\">@Theoharis Nalmpantidis</span> support for NPM packages in FHIR follows the (external) NPM specification. The FHIR spec itself does not specify how to search for and/or fetch an NPM package from an NPM server. Simplifier supports such functionality by means of a custom API endpoint that implements the NPM spec. The NPM spec defines how to deal with package versions.</p>",
        "id": 166252320,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1558518442
    },
    {
        "content": "<p>Hi I dont mean the rest-communication to the NPM package, it is when consuming a FHIR resource that conforms to a specific profile.</p>\n<p>Here is one example:<br>\nFhirContext ctx = FhirContext.forR4();<br>\nctx.setDefaultTypeForProfile(\"<a href=\"http://natmedlist.se/fhir/StructureDefinition/nll-patient|1.0\" target=\"_blank\" title=\"http://natmedlist.se/fhir/StructureDefinition/nll-patient|1.0\">http://natmedlist.se/fhir/StructureDefinition/nll-patient|1.0</a>\", EHMPatient.class);<br>\nIGenericClient client = ctx.newRestfulGenericClient(\"<a href=\"http://nll-fhir-server.192.168.234.5.nip.io/fhir-server/fhir\" target=\"_blank\" title=\"http://nll-fhir-server.192.168.234.5.nip.io/fhir-server/fhir\">http://nll-fhir-server.192.168.234.5.nip.io/fhir-server/fhir</a>\");<br>\nclient.registerInterceptor(new LoggingInterceptor(true));<br>\nPatient patient = client.read().resource(Patient.class).withId(\"82b3570c-8a51-464d-a53e-7fb55255063c\").execute();</p>\n<p>The logs.<br>\nmain] INFO ca.uhn.fhir.rest.client.interceptor.LoggingInterceptor - Client request: GET <a href=\"http://nll-fhir-server.192.168.234.5.nip.io/fhir-server/fhir/metadata\" target=\"_blank\" title=\"http://nll-fhir-server.192.168.234.5.nip.io/fhir-server/fhir/metadata\">http://nll-fhir-server.192.168.234.5.nip.io/fhir-server/fhir/metadata</a> HTTP/1.1<br>\n[main] INFO ca.uhn.fhir.rest.client.interceptor.LoggingInterceptor - Client request headers:<br>\nAccept-Charset: utf-8<br>\nAccept: application/fhir+xml;q=1.0, application/fhir+json;q=1.0, application/xml+fhir;q=0.9, application/json+fhir;q=0.9<br>\nUser-Agent: HAPI-FHIR/3.7.0 (FHIR Client; FHIR 4.0.0/R4; apache)</p>\n<p>When I sniff the traffic is does not include which profile the client conforms to, is there any way to tell the FHIR-server to create a Resource according a specific profile based on FHIR package?</p>",
        "id": 166262694,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558528425
    },
    {
        "content": "<p>I forgot to add this is necessary when supporting multiple versions of a specific profile under the same endpoint. <br>\nEx. http://[base]/fhir-server/fhir/Patient</p>",
        "id": 166263686,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558529342
    },
    {
        "content": "<blockquote>\n<p>When would this REST traffic occur?  Is this a Fhir client requesting the download of a package?  Or is this a client requesting a conformance resource (say a StructureDefinition) for a certain version of FHIR for a certain version of a package from a server?</p>\n</blockquote>\n<p>It is the last conformance resource for a certain version of FHIR for a certain version of a package.</p>",
        "id": 166265713,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558530808
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"221915\">@Theoharis Nalmpantidis</span>, although I am not familiar with HAPI, in general an instance of FHIR data (like a Patient) could state such claims in its meta data, specifically Patient.meta.profile.  This is not necessary, however, and you can use FHIR validation (using the $validate operation) to validate any instance against any chosen profile.  However, we have not yet defined how you'd tell the server where to look for such a profile. It is assumed a server has one \"current\" profile with a given canonical - especially if you use a canonical with a version | in it. Normally, servers would have loaded the content of a given package into their databases, and so be able to find that profile.   If (in the case you are suggesting) a server could have the contents of multiple packages with multiple versions of the given profile, then presumably the version becomes the discriminator.  If not, there's currently no way of telling the server which package you want to take the profile from.  It would probably be a parameter to $validate but its too early to say anything definite.</p>",
        "id": 166266032,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1558531031
    },
    {
        "content": "<p>Ok Thanks <span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span> <br>\nThat was the kind of answer i was looking for. <br>\nWould it be a bad idea to implement a packageVersion Accept http-header as the fhirVersion according to standard to support which profile to use?<br>\nI was thinking about GET calls when using _include and _revinclude when both resources conform to specific profiles (with version).<br>\nEx. GET http://[base]/MedicationRequest?_include=Patient</p>",
        "id": 166267032,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558531787
    },
    {
        "content": "<p>It's not a crazy idea to pilot - but that wouldn't mean it's part of FHIR yet, so you'd have to watch out to tell your clients that it is a private extension to the standard....</p>",
        "id": 166272027,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1558534910
    },
    {
        "content": "<p>Thanks for the answer :)</p>",
        "id": 166276270,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558537288
    },
    {
        "content": "<p>FYI R4 introduces the notion of version-specific canonical url references of the form \"http://...|1.0\" (separated by a vertical bar). This is the preferred way of referencing a specific version of a profile.<br>\nA resource instance could include a version-specific profile reference in the meta.profile element. This would allow a server to validate against that specific profile version, without having to introduce an additional HTTP header.</p>",
        "id": 166280854,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1558539959
    },
    {
        "content": "<p>Yes but it does not solve the fact that for instance Patient profile v.1.0 is included in the same package as MedicationRequest profile v.1.0. I looked at version-specific canonical url and yes it only solves versioning for a single Profile based on a conformance resource.</p>",
        "id": 166284841,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558542565
    },
    {
        "content": "<p>I</p>",
        "id": 166303704,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558554967
    },
    {
        "content": "<p>I'm not actually following the issue here. Why does the client need to know about packaging on the server?</p>",
        "id": 166303727,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558554994
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <br>\nWe are at this stage designing profiles (version=1) that conform to specific FHIR Resources like Patient, MedicationRequest and MedicationDispense. <br>\nAll the profiles are going to be packaged according to standard NPM Packages.<br>\nWe are mapping FHIR resources to an internal datamodel before storing in DB which means that resource data could conform to a specific profiles different versions. The data stored in DB is version agnostic.<br>\nLets say that in 1-2 years from now that we have to profile the next major version of a resource (cause of legislation), during that time we will support 2 versions at the same time, our clients will have 6 months -1 year to adapt to the latest version. That means that we need some kind of mechanism to know which version our clients support or is it a better approach to launch a separate FHIR-Server instance for the new package version?</p>",
        "id": 166316987,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558566083
    },
    {
        "content": "<p>You can simply declare the profile versions within your instances using the 'meta' element and avoid the need to require your clients to do anything 'custom'</p>",
        "id": 166318803,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558568009
    },
    {
        "content": "<p>Could u please explain more? How would the server know which Profile version the client supports in a GET operation?</p>",
        "id": 166333363,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558588633
    },
    {
        "content": "<p>The CapabilityStatement allows a server to declare what profiles (and versions) it supports (as well as what resources and operations it supports)</p>",
        "id": 166333838,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558589476
    },
    {
        "content": "<p>OK I understand</p>",
        "id": 166337934,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558595206
    },
    {
        "content": "<blockquote>\n<p>How would the server know which Profile version the client supports in a GET operation?</p>\n</blockquote>\n<p>The server's CapabilityStatement would not answer that</p>",
        "id": 166435351,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1558689037
    },
    {
        "content": "<p>It would be instead the client asking the server which profiles it supports</p>",
        "id": 166435366,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1558689060
    },
    {
        "content": "<p>The Server's CapabilityStatement allows the server to declare which profiles (including which versions of which profiles) it supports using the supportedProfile element</p>",
        "id": 166459891,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558709568
    },
    {
        "content": "<p>Yes but it does not answer solve which _profile to use when using a GET operation with _include and _revinclude. For instance request a MedicationRequest and including the Patient. How would that operation look like? [base]/MedicationRequest?identifier=id&amp;_include=MedicationRequest:subject&amp;_profile=http://fhir.example.com/mymedication|1.0,<strong>http://fhir.example.com/mypatient|1.0</strong>. <br>\nAny suggestions?</p>",
        "id": 166464584,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558712814
    },
    {
        "content": "<p>The data pointed to by the MedicationRequest will comply with whatever profiles it complies with.  If you're looking for data filtering based on profile, that's not something that FHIR supports.</p>",
        "id": 166469729,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558716588
    },
    {
        "content": "<p>It is not data filtrering we are looking for, the solution for us would be to temporary launch an unique instance of a FHIR server per FHIR package major-version. I plan to attend the FHIR dev days in Amsterdam in November and to further explain the need.</p>",
        "id": 166477854,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558722434
    },
    {
        "content": "<blockquote>\n<p>How would that operation look like?</p>\n</blockquote>\n<p>I don't understand the operation - are you saying to only return medication requests where the patient conforms to that profile?</p>",
        "id": 166486297,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558728761
    },
    {
        "content": "<p>I want a bundle response for a search operation where the medicationrequest is matched and the patient resource is included. How can the client define that the medicationrequest to conforms to profile A and patient to conforms to profile B?</p>",
        "id": 166490521,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558732203
    },
    {
        "content": "<p>I don't know. How can the client define that something that already exists conforms to a set of rules when it requests to access it?</p>",
        "id": 166490622,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558732292
    },
    {
        "content": "<p>The set of rules are designed and implemented based on FHIR package version. The set of rules can vary. We were hoping on approving clients based on FHIR package version. We are planning to have 2 simultaneous versions active in production so that clients will have time to adapt to the latest version according the clients release plan.</p>",
        "id": 166492172,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558733422
    },
    {
        "content": "<p>The FHIR package version (semver ) is used as a contract</p>",
        "id": 166492288,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558733522
    },
    {
        "content": "<p>ok so I went back and re-read the thread. From what you've said, I don't know why you aren't using the fhirVersion parameter on the mime type as documented at <a href=\"http://hl7.org/fhir/versioning.html\" target=\"_blank\" title=\"http://hl7.org/fhir/versioning.html\">http://hl7.org/fhir/versioning.html</a></p>",
        "id": 166492477,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558733655
    },
    {
        "content": "<p>Ok we are using that but if the profiles version could have mandatory extensions</p>",
        "id": 166492593,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558733762
    },
    {
        "content": "<blockquote>\n<p>the profiles version could have mandatory </p>\n</blockquote>\n<p>I don't know what that means?</p>",
        "id": 166492672,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558733822
    },
    {
        "content": "<p>If I take a conformance resource and add a extension with a manadatory parameters</p>",
        "id": 166492768,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558733889
    },
    {
        "content": "<p>And I the next major version of the package version add another mandatory parameter</p>",
        "id": 166492823,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558733952
    },
    {
        "content": "<p>so different versions of the client have different business rules applied to their interactions based on different client declared package versions?</p>",
        "id": 166492913,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558734059
    },
    {
        "content": "<p>Actually the business rules are located in the server not the client, for instance v1 medicationRequest profile has  extension parameter A mandatory, but v2 medicationRequest profile has extension parameters A and B mandatory</p>",
        "id": 166493143,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558734321
    },
    {
        "content": "<p>And the FHIR data is transformed to a local db-model that can handle both profile version</p>",
        "id": 166493208,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558734372
    },
    {
        "content": "<p>but in fact, B is not mandatory. Unless B is prohibited from reading content from v1</p>",
        "id": 166493234,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558734415
    },
    {
        "content": "<p>Sorry B is mandatory but prohibited from reading</p>",
        "id": 166493258,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558734462
    },
    {
        "content": "<p>forgot to write that.</p>",
        "id": 166493264,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558734476
    },
    {
        "content": "<p>Lets say B is mandatory because the new profile version is a major version</p>",
        "id": 166493321,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558734532
    },
    {
        "content": "<p>woah. we're really in the advanced place now. if...</p>\n<blockquote>\n<p>the new profile version is a major version</p>\n</blockquote>\n<p>Then fhirVersion will suffice.</p>",
        "id": 166493338,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558734559
    },
    {
        "content": "<p>Yes I know the requirement could be the legislation in Sweden</p>",
        "id": 166493419,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558734638
    },
    {
        "content": "<p>but really, that doesn't make any difference to your underlying use case. you still have different clients facing different rules. I think your choices are:</p>\n<ul>\n<li>track the client's business rules in the client registration (I assume that you have some registration framework)</li>\n<li>define your own business rules parameter to the mime type (not really conformant with the stated intent of mime type parameters)</li>\n<li>use Resource.implicitRules (my least favourite of these options)</li>\n</ul>\n<p>btw I am in Stockholm the week after next if you want to face-to-face about this</p>",
        "id": 166493519,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558734771
    },
    {
        "content": "<p>Do you have the exact date maybe?<br>\nI was thinking about 2 scenarios either letting clients add a packageVersion similar to the fhirVersion or to it make easy and launch a FHIR-Server per FHIR-package major version.</p>",
        "id": 166493688,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558734956
    },
    {
        "content": "<p>in terms of micro-service.... yes, that's the obvious thing to do (your second option) but that ties the resource identity to the version of the representation (see discussion on the link above). So people don't always like micro-services for something like this</p>",
        "id": 166494111,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558735331
    },
    {
        "content": "<p>I was meaning to launch a FHIR Server for the package not just a single conformance resource</p>",
        "id": 166494275,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558735518
    },
    {
        "content": "<p>that's what I thought you meant</p>",
        "id": 166494289,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558735541
    },
    {
        "content": "<p>ok</p>",
        "id": 166494357,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558735604
    },
    {
        "content": "<p>Just one last question Grahame the link did you mean your previous post (with the options) or is it an actual link that I don't see in the chat log?</p>",
        "id": 166494986,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558736340
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/versioning.html\" target=\"_blank\" title=\"http://hl7.org/fhir/versioning.html\">http://hl7.org/fhir/versioning.html</a></p>",
        "id": 166497904,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558739534
    },
    {
        "content": "<p>Ok thanks</p>",
        "id": 166520298,
        "sender_full_name": "Theoharis Nalmpantidis",
        "timestamp": 1558778173
    }
]