[
    {
        "content": "<p>In our system we have specimen resources that correspond with blood samples that have traditional lab identifiers etc. </p>\n<p>Once they go through a DNA sequencer they end up represented as large gene files, on both the local sequencer computer and eventually remotely (i.e. in a S3 bucket). We need to store this filename information (the raw files themselves will never be FHIR resources - they are 10gb+). Because the filenames are particular to the internal working of our system - I was just going to add an extension to Specimen.</p>\n<p>But it occurred to me last night that we already have a potential slot - as additional Specimen identifiers with a custom identifier systems. So system=http://mylab.com/localgenefile, value=abfgsd.fastq</p>\n<p>Is this a horrifying thought - a blatant misuse of the identifier data type - the ramblings of a mad man? Or considered fair game for identifiers?</p>",
        "id": 153903995,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1504054336
    },
    {
        "content": "<p>file names share some characteristics with identifiers - they identify the file in a context. Whether they are suitable for use as identifiers depends on their managment. Note, in particular, the no re-use rule</p>",
        "id": 153903997,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1504055029
    },
    {
        "content": "<p>Is the sequence resource relevant to what you are proposing? <a href=\"http://build.fhir.org/sequence.html\" target=\"_blank\" title=\"http://build.fhir.org/sequence.html\">http://build.fhir.org/sequence.html</a></p>",
        "id": 153904000,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1504067140
    },
    {
        "content": "<p>Yes - but the Sequence is more likely a post process artifact.. the main input  files we are talking about here are raw 10gb+ text files representing raw genome data.. and they aren't going to go through our network/system at all. They will go direct from the lab to the cloud. So not important that they are represented in FHIR - we are just kind of using the Specimen as the proxy for each one. And need to know their filenames on all systems they go through.</p>",
        "id": 153904003,
        "sender_full_name": "Andrew Patterson",
        "timestamp": 1504072206
    },
    {
        "content": "<p>I did puzzle about putting the filename in <code>identifier</code> for <code>Specimen</code>, and in <code>repository</code> for <code>Sequence</code>. But that is probably correct.</p>",
        "id": 153904004,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1504074084
    }
]