[
    {
        "content": "<p>Is there a way to find ResearchStudies with a given number of ResearchSubjects?  I could send one query per ResearchStudy to get the count of each, but in a database where there are thousands of studies, that would be really slow.   I think maybe \"size\" search parameter is needed for ResearchStudy.</p>",
        "id": 230106660,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1615586887
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194426\">@Smita Hastak</span> <span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span></p>",
        "id": 230106870,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615586952
    },
    {
        "content": "<p>We were talking about \"number of subjects\" on the calls last week.  There was debate about desired number vs actual number, and also whether it was per site as well as per study.  You seem to be asking a slightly different question \"find all sites with 550 subjects\" is how I read \"given number of subjects\".  DO you really want that or do you just want the number of subjects?  Either way happy to think about adding it as a search parameter.</p>",
        "id": 230313369,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1615799262
    },
    {
        "content": "<p>I was actually thinking of finding ResearchStudies with at least X subjects, and was asking because Clem McDonald wanted to be able to do that in a tool we're developing.  You raise good questions though about \"desired\" vs \"actual\" and site counts vs total.  I will check with Clem to be sure of what he wanted.</p>",
        "id": 230437410,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1615850951
    },
    {
        "content": "<p>There'll be separate ResearchStudy instances for the overall study and for each location - and each would have their own Group defining membership criteria.  We don't have \"target number\" though - that would have to be an extension or new element, but we could define a standard search criteria on it.</p>",
        "id": 230461566,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615872433
    },
    {
        "content": "<p>\"We don't have a target number\" ... Well actually we are discussing a change at the moment that would allow us to distinguish target from actual</p>",
        "id": 230751647,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1616008972
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-25239\">https://jira.hl7.org/browse/FHIR-25239</a> is on the same topic.  We are implementing a simple numeric search, but there is a question on what more might be needed.  Any use cases appreciated.</p>",
        "id": 232235935,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1617007790
    },
    {
        "content": "<p>Clem clarified he is interested in querying on the actual number of subjects (not the desired number), and the total number rather than per study site.</p>",
        "id": 232313689,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1617042536
    },
    {
        "content": "<p>That should be covered - it was just the simple search we were thinking of.</p>",
        "id": 232319252,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1617044850
    }
]