[
    {
        "content": "<p>Hello,</p>\n<p>We are trying to implement the terminology part from FHIR, namely CodeSystems and ValueSets and we have a question related to the filters part.<br>\nIn a CodeSystem we can define some filters (which have a code used for identification, at least one operator, a value and an optional description). When defining a ValueSet we may include/exclude concepts from a CodeSystem using filters, but in this case the filters are related to the properties of the concept from the CodeSystem (a filter from a valueset has a property code, an operator and a value). Where is the link between the filters defined in a CodeSystem and the filters used when defining a ValueSet? Is there a link/relation between them? </p>\n<p>Thank you!</p>",
        "id": 153977507,
        "sender_full_name": "Grigoreta Cojocar",
        "timestamp": 1532422798
    },
    {
        "content": "<p>yes. You can use the general filters that are defined for all code systems (only a very few) or you can use the filters defined by the code system itself</p>",
        "id": 153977552,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532434957
    },
    {
        "content": "<p>How do you specify that you want to use in a value set the filters defined by the code system?</p>",
        "id": 153977848,
        "sender_full_name": "Grigoreta Cojocar",
        "timestamp": 1532509747
    },
    {
        "content": "<p>the value set uses the filters by code... I feel as though I haven't understood the question</p>",
        "id": 153977878,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532522773
    },
    {
        "content": "<p>Maybe...</p>\n<p>In the ValueSet resource specification, when we use a filter, we have to give a property code, not a filter code. Or maybe I am the one who did not understand the specification.</p>",
        "id": 153977890,
        "sender_full_name": "Grigoreta Cojocar",
        "timestamp": 1532523914
    }
]