[
    {
        "content": "<p>We need to filter the records within a FHIR resource based on whether an EHR application is active or inactive.  Is it more appropriate to use a custom operation or a _list to accomplish this need?</p>",
        "id": 257083410,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1633967586
    },
    {
        "content": "<p>Can you explain what you mean by \"records within a FHIR resource\"?  Typically each resource is a single record.  What's the relationship of the records to the EHR application?  How are you representing the application?</p>",
        "id": 257097367,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633974874
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> we use the Organization endpoint to list facilities within an HIS.  Each facility represents a single record/resource.  Each facility has applications that can be activated or inactivated.  We want to exclude all Organization resources that do not have a specific application activated.</p>",
        "id": 257115769,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1633985863
    },
    {
        "content": "<p>Ok, and are you representing applications as Device instances?  When you say \"specific application\" are you referring to a particular instance (i.e. multiple organizations running the same instance) or do you mean application 'type'?</p>",
        "id": 257116622,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633986321
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> the applications are not represented in the FHIR bundle.  The filtering would be done at a database layer without needing to use any data within the FHIR bundle.  Each organization can toggle on and off the same list of applications (so multiple organizations would not run the same instance).</p>",
        "id": 257118313,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1633987325
    },
    {
        "content": "<p>How do you handle @Search returns Organization/X, but then organization x turns off the application. Does the @Read operation return a 404, the record exists but not active? 200 Return the row anyway? etc.</p>",
        "id": 257118980,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1633987796
    },
    {
        "content": "<p>If it's outside FHIR, then you can do whatever you like - so I think I'm missing part of the problem...</p>",
        "id": 257119889,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633988426
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span> toggling off and on the application would work the same as any other Boolean search parameter.  </p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> if we need to include a custom extension in the FHIR to notate active applications we can.</p>\n<p>We are only using FHIR requests to generate the list of Organization resources.</p>\n<p>We are trying to avoid needing to create a custom API to generate a list of Organization id's to then search by.  </p>\n<p>I hope this clears things up.</p>",
        "id": 257203579,
        "sender_full_name": "James Dinsmore",
        "timestamp": 1634045781
    },
    {
        "content": "<p>I think we're getting closer to the problem definition. \"You want to Search for Organization Resources where a linked Application property (active) is true\"?<br>\nWhat type of resource is Application? How are these application resources linked to the organization resource?</p>",
        "id": 257205609,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1634046528
    },
    {
        "content": "<p>If you want to throw a custom extension on Organization and define a custom SearchParameter on that extension to allow you to filter on it.  (Though you need to get the server to support that custom SearchParameter.)</p>",
        "id": 257215391,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634050151
    }
]