[
    {
        "content": "<p>During the Connectathon a server implementation had 2 iterations of <a href=\"http://CapabilityStatement.rest\">CapabilityStatement.rest</a>. These seemed to be used for 2 different sort of services at the same endpoint each with different security details, resources and profiles. My little client was not expecting this and the iteration it wanted was not the first, so it gave up. <br>\nOK, So I can make my client more robust, but it begs the question, how do I find the rest definition that I need? The rest element only has a mode (server|client) and a markdown description. Besides searching down into the details of each rest.resource, of which some of the differences may only be nuanced between rest element iterations, how can I find the rest definition I need?</p>",
        "id": 253782822,
        "sender_full_name": "Corey Spears",
        "timestamp": 1631901778
    },
    {
        "content": "<blockquote>\n<p>These seemed to be used for 2 different sort of services at the same endpoint each with different security details, resources and profiles.</p>\n</blockquote>\n<p>These makes little sense to me, servers should not do that (eg an end point has only one Patient resource, it cannot be described in two different ways)</p>",
        "id": 253785141,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1631902758
    },
    {
        "content": "<p>In this instance they were providing patient access API in one rest iteration and in the iteration what appears to be a group resource export operation with no security defined.<br>\n<a href=\"http://CapabilityStatement.rest\">CapabilityStatement.rest</a> has a cardinality of 0..*. My question is: When would there be more than one rest iteration and how would a client find the right one?</p>",
        "id": 253786018,
        "sender_full_name": "Corey Spears",
        "timestamp": 1631903079
    },
    {
        "content": "<blockquote>\n<p>When would there be more than one rest iteration</p>\n</blockquote>\n<p>Never in a CapabilityStatement returned by a server end point - does not make sense to have more than one in that case</p>",
        "id": 253788176,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1631903949
    },
    {
        "content": "<p>There should only be one repetition for client and one for server.  We didn't have an ability to set cardinality to 0..2</p>",
        "id": 253788503,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631904112
    },
    {
        "content": "<p>You could submit a change request for us to add an invariant...</p>",
        "id": 253788566,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631904125
    },
    {
        "content": "<p>Submitted: <a href=\"https://jira.hl7.org/browse/FHIR-33955\">https://jira.hl7.org/browse/FHIR-33955</a></p>",
        "id": 253795520,
        "sender_full_name": "Corey Spears",
        "timestamp": 1631906999
    },
    {
        "content": "<p>there is an invariant</p>",
        "id": 254090081,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632160232
    },
    {
        "content": "<p>I don't see one - there's cpb-9, but that limits by resource, it doesn't restricts the overall number of rest repetitions.</p>",
        "id": 254093904,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632161721
    },
    {
        "content": "<p>(<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> )</p>",
        "id": 254093921,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632161728
    },
    {
        "content": "<p>odd I saw it somewhere. Maybe it was in an IG</p>",
        "id": 254094367,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632161896
    }
]