[
    {
        "content": "<p>Hi all. <br>\nI am trying to use a search query to find all active Encounters for particular patient. I tried to search with the following query <em>/Encounter?status:below=finished</em>, but the FHIR server does not returns anything. My question is what is the right query that will returns all the Encounters with statuses in the range from 'planned' to 'onleave'?Find all active Encounters for particular patient</p>",
        "id": 178551412,
        "sender_full_name": "Dimitar Dimitrov",
        "timestamp": 1571499954
    },
    {
        "content": "<p>You may find it works better to enumerate the statuses.  Not a lot of servers support the terminology subsumption operations</p>",
        "id": 178552992,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571502305
    },
    {
        "content": "<p>E.g. status=finished,planned,onleave,...</p>",
        "id": 178553040,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571502364
    },
    {
        "content": "<blockquote>\n<p>Not a lot of servers support the terminology subsumption operations</p>\n</blockquote>\n<p>Which is a real shame - it shouldn't be that hard</p>",
        "id": 178566924,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1571525670
    },
    {
        "content": "<blockquote>\n<p>Which is a real shame - it shouldn't be that hard</p>\n</blockquote>\n<p>to my knowledge, if the terminology store has been well designed,  hierearchycal query results  for RDBS as a recursive query or a graph traversal in other tehcnologies.  that's not trivial question indeed.</p>",
        "id": 178594724,
        "sender_full_name": "natus",
        "timestamp": 1571580235
    },
    {
        "content": "<p>i'd rather prefer to :</p>\n<ol>\n<li>ask to terminology server for code below or above, mapped and so on</li>\n<li>pass the list to the resource to filter</li>\n</ol>\n<p>Or maybe the server should do that step itself under the hood</p>",
        "id": 178594834,
        "sender_full_name": "natus",
        "timestamp": 1571580414
    },
    {
        "content": "<p>For simple code:below, just ask an external terminology server (&amp; cache the result) as you say (ignoring issues wrt infinite code systems).<br>\nFor code:in it can get more complex, but you can still offload to a terminology server (who wants to implement all that SNOMED, LOINC, etc) logic.</p>\n<p>But to your first point, if the Tx store is well-designed you should (almost) <em>never</em> be doing recursive / graph traversal queries.</p>",
        "id": 178610549,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1571606364
    }
]