[
    {
        "content": "<p>Our source system has two types of \"Alerts\", administrative (verify birthdate) and safety (patient is potentially dangerous). We would like to put the safety alerts into the Flag resource, but where should we put the administrative alerts?</p>",
        "id": 197736817,
        "sender_full_name": "David Reeves",
        "timestamp": 1589569015
    },
    {
        "content": "<p>\"verify birthdate\" sounds like a \"to do\", in which case I'd look at Task.  That said, it's possible to put administrative type stuff in Flag too - it has categories so different types of users can see only certain things</p>",
        "id": 197741474,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589570601
    },
    {
        "content": "<p>I am now looking at the Flag Category ValueSet and it is quite different from our list of categories, which is:</p>\n<p>- Advance Directive<br>\n   - Administrative<br>\n   - Allergy<br>\n   - Check File<br>\n   - Client Safety<br>\n   - Duplicate Record<br>\n   - Immunization<br>\n   - Impairment<br>\n   - Known Aliases<br>\n   - Language<br>\n   - Lives with Alternate Caregiver<br>\n   - Mental Health<br>\n   - MRSA+<br>\n   - Phone<br>\n   - Practitioner Safety<br>\n   - Suicide Risk<br>\n   - Temporary Address<br>\n   - VRE+<br>\nCan we use all of these as Flag Categories, or should we be thinking differently here?...</p>",
        "id": 218635996,
        "sender_full_name": "David Reeves",
        "timestamp": 1606952392
    },
    {
        "content": "<p>Some of those look more like specific Flag values rather than categories.  \"Lives with Alternate Caregiver\" seems pretty specific.  Category is more about who needs to see them - e.g. are these relevant to pharmacists, nurses, admin staff, etc.  The Flag.code would convey the details of exactly what is being conveyed.  That said, you can categorize multiple ways, so also having a category that says that this is \"Allergy-related\" or \"Communication-related\" or \"Patient-safety\" related is also reasonable.</p>",
        "id": 218638211,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606953738
    }
]