[
    {
        "content": "<p>After discussing in the linked <a href=\"#narrow/stream/179166-implementers/topic/Patient.20Contraindications\">topic</a>,  we are mapping our possible patient contraindications to Flag.</p>\n<p>We need two extensions for our functional model to map to Flag. one for 'Comment' and one for 'Reason of closure' of the Flag.</p>\n<p>Are there more use cases of these kinds of extensions to Flag? If so, perhaps it can be discussed to create core extensions for these functionalities or perhaps to even add them to core.</p>",
        "id": 207816179,
        "sender_full_name": "Ashwin Djorai",
        "timestamp": 1598256068
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span></p>",
        "id": 207843928,
        "sender_full_name": "Ashwin Djorai",
        "timestamp": 1598276454
    },
    {
        "content": "<p>Possible patient contraindications would typically be handled using DetectedIssue.  Flag is more for general warnings about the patient.  E.g. \"pregnant\", \"latex allergy\", \"Covid positive\", \"requires easy-open packaging\" - the things you need to see/know before you visit/engage with the patient.</p>",
        "id": 207850674,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598279788
    },
    {
        "content": "<p>The DetectedIssue scope states: \"Similarly this resource is not to be used to capture clinical facts that may imply contraindications such as pregnancy, breast feeding, patient preferences, past procedures, etc. These would be represented using Condition, Procedure or other resources.\"</p>\n<p>We are using a ValueSet that includes a wide range of potential contraindications like diabetes, but also pregnancy, the desire to have children, practising top sports, wearing contacts, etc. We would like to capture this wide range in one resource type.</p>\n<p>Furthermore, we are under the impression that DetectedIssue would be used from the point that an interaction is detected by decision support - while we are capturing the possible contraindications before that point.</p>",
        "id": 207931579,
        "sender_full_name": "Jorn Duwel",
        "timestamp": 1598340186
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"280644\">@Jorn Duwel</span>  - we intend to use Flag in exactly the same way</p>",
        "id": 207944190,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1598350421
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - With the line that <span class=\"user-mention\" data-user-id=\"280644\">@Jorn Duwel</span>  quoted from DetectedIssue:</p>\n<blockquote>\n<p>Similarly this resource is not to be used to capture clinical facts that may imply contraindications such as pregnancy, breast feeding, patient preferences, past procedures, etc. These would be represented using Condition, Procedure or other resources.</p>\n</blockquote>\n<p>I can see that historically there was a Contraindication resource <a href=\"https://www.hl7.org/FHIR/2015May/contraindication.html\">proposed</a> as part of DSTU2. But when <a href=\"http://hl7.org/fhir/STU3/detectedissue-definitions.html\">STU3 came around</a>, it appears to be merged into DetectedIssue.</p>\n<p>Wondering what you would suggest? Would using the method that <span class=\"user-mention\" data-user-id=\"280644\">@Jorn Duwel</span> and <span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> be the best?</p>\n<p>Thank you.</p>",
        "id": 208722618,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1598982446
    },
    {
        "content": "<p>Contraindications (assertions that an action may be problematic based on some other fact in the record) are captured using DetectedIssue.  (The resource is broader because it can also identify issues with an action by itself independent of any other resource - e.g. dosage issue.)  The individual facts that might result in a contraindication being triggered (age, gender, recent and planned procedures, current conditions, recent lab results, current medications, etc.) are expected to be captured using Observation, MedicationStatement, Patient, Condition and other appropriate resources.  Flag is used to 'highlight' certain aspects of a patient's record (allergies, conditions, behavioral issues, etc.) that providers need to be aware of before engaging with a patient.  The information represented in a Flag is typically <em>also</em> represented as another resource that provides more detail.  The Flag just acts as a highlighted note on the outside of the patient folder to increase the likelihood of clinician awareness.</p>",
        "id": 208732498,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598986956
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Flag.20extension/near/208732498\">said</a>:</p>\n<blockquote>\n<p>Contraindications (assertions that an action may be problematic based on some other fact in the record) are captured using DetectedIssue.  (The resource is broader because it can also identify issues with an action by itself independent of any other resource - e.g. dosage issue.)  The individual facts that might result in a contraindication being triggered (age, gender, recent and planned procedures, current conditions, recent lab results, current medications, etc.) are expected to be captured using Observation, MedicationStatement, Patient, Condition and other appropriate resources.  Flag is used to 'highlight' certain aspects of a patient's record (allergies, conditions, behavioral issues, etc.) that providers need to be aware of before engaging with a patient.  The information represented in a Flag is typically <em>also</em> represented as another resource that provides more detail.  The Flag just acts as a highlighted note on the outside of the patient folder to increase the likelihood of clinician awareness.</p>\n</blockquote>\n<p>Thank you Llyod for clearing this one up for me.</p>",
        "id": 208753731,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1598997129
    },
    {
        "content": "<p>Thank you for your summary <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>. <br>\nDetectedIssue states:</p>\n<blockquote>\n<p>This resource only applies to documenting a risk associated with a specific planned or ongoing action, not a general propensity to risk. The latter would be handled using AllergyIntolerance for substance-specific issues or Flag for other types of issues.</p>\n</blockquote>\n<p>However, our functional model does indeed cover potential contraindications as a general propensity to risk before any medication is actually prescribed (e.g. before a 'specific [...] action'). The clinical fact that is the base of this notion is indeed captured elsewhere and referenced. We are wondering if there is some mismatch between our use of the phrase 'possible contraindication' in English to explain this difference in insight.</p>",
        "id": 208801721,
        "sender_full_name": "Jorn Duwel",
        "timestamp": 1599040777
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> Aside from the interesting discussion on the use of Flag, do you also recognize the need for the extensions mentioned in the original question?</p>",
        "id": 208801830,
        "sender_full_name": "Jorn Duwel",
        "timestamp": 1599040831
    },
    {
        "content": "<p>The fact a patient is diabetic is a Condition - and could be a Flag.  The fact it's a bad idea to prescribe a particular medication <em>because</em> they're diabetic would be a DetectedIssue.  You'd only get a DetectedIssue if there was some suggestion that the patient might end up starting or was already taking the drug in question.  If you wanted to know that, irrespective of patient or timeframe, that a particular medication (or class of medications) was contraindicated for patients who are diabetic, that would be ClinicalUseIssue.  Does that help?</p>",
        "id": 208820854,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599052333
    },
    {
        "content": "<p>I.e. Simply picking the medication and the patient would be sufficient to spawn a DetectedIssue long before you get to the point of a completed signed prescription.  However, you wouldn't automatically get DetectedIssues for all possible drugs that might ever be prescribed or voluntarily taken regardless of whether the patient was at risk of taking them just because you mark a patient as diabetic.</p>",
        "id": 208821312,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599052532
    },
    {
        "content": "<p>Thanks for your insights Lloyd. I think I better understand the use of DetectedIssue (and ClinicalUseIssue for our future R5 needs). Our functional model starts with a situation where no medication has been picked yet. We want to pick a patient and retreive all 'patient states' (conditions, observations, etc) that could potentially interfere with any medication.</p>",
        "id": 208930937,
        "sender_full_name": "Jorn Duwel",
        "timestamp": 1599119102
    },
    {
        "content": "<p>That could be a very long list of information that wouldn't be relevant - especially if you're also identifying what they might interfere with.  If the desire is just to pass all of the potentially relevant information to a decision support system (while avoiding non-relevant information), you could look at a custom operation.  However, the general pattern is for the decision support system to pull the data via query rather than being pushed the information - because the set of potentially relevant factors is likely to continue to grow and evolve and also because once a candidate drug is selected, the decision support system can grab only the records relevant to that particular med.</p>",
        "id": 208962754,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599138165
    }
]