[
    {
        "content": "<p>I can't see this in the set of supported functions - how do you:<br>\n  1. test for ValueSet membership in fluentpath? (similarly to $validate-code)?<br>\n  2. test for subsumption (similar to $subsumes)?<br>\n  3. perform other terminology operations (e.g., $lookup and $translate)<br>\nThe use cases I have in mind all relate to FHIR Mapping Language rules</p>",
        "id": 153836704,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1467841669
    },
    {
        "content": "<p>1. memberOf(valueset : string) : boolean but I think this has been renamed in the ballot<br>\n2. hasn't been put into fluent path because it was only just pulled out of value set membership testing. <span class=\"user-mention\" data-user-email=\"bryn@databaseconsultinggroup.com\">@Bryn Rhodes</span> we need to add this now<br>\n3. not sure what the use case for lookup is. The mapping langauge handles translate explicitly</p>",
        "id": 153836706,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467841871
    },
    {
        "content": "<p>1. thanks - don't know how I missed that<br>\n2. excellent<br>\n3. lookup may be desired when all you have is a code but you want to populate the target structure with display text.<br>\n[I’ve now found the translate operation in the mapping language - I suspect this may be also useful in fluentpath but don’t have my own usecase for it]</p>",
        "id": 153836711,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1467842317
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"grahame@healthintersections.com.au\">@Grahame Grieve</span>, got it.</p>",
        "id": 153836715,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1467846450
    },
    {
        "content": "<p>+1 to the lookup function, doing the data extractions it is something that I'd want to do.</p>",
        "id": 153836725,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1467853481
    },
    {
        "content": "<p>In fact, an IHTSDO working group that's looking at example maps from Condition to a SNOMED post coordinated expression is after exactly the $lookup functionality (with some post-processing to pull out a language-specific designation).</p>",
        "id": 153836849,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1467930949
    },
    {
        "content": "<p>can you show an example for that? That sounds like something that should be done with the mapping language not just with fluent path </p>",
        "id": 153836858,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467931652
    },
    {
        "content": "<p>Agreed, but they seem to want to define the maps in their own language/framework rather than using the FHIR mapping language (possibly because FHIR is just an example of a data source, and they want to be able to apply to others - OpenEHR, CIMI, etc)</p>",
        "id": 153849771,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1474329142
    }
]