[
    {
        "content": "<p>Currently the Patient.generalPracitioner is a reference to Practitioner, however sometimes there is a need to know which practice the practitioner is at (where has multiple), this would require a reference to point to a PractitionerRole.<br>\nMaking the property<br>\n<code>generalPractitioner 0..* Reference(Organization|Practitioner|PractitionerRole)</code><br>\nThe Patient Administration workgroup is requesting opinion from the community if they would be against this change before it is applied.</p>",
        "id": 153924005,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1512888557
    },
    {
        "content": "<p>+1 for change; think related Practitioner/PractitionerRoles need review over the whole spec - i am thinking Encounter.participant....</p>",
        "id": 153924114,
        "sender_full_name": "Brett Esler",
        "timestamp": 1512934336
    },
    {
        "content": "<p>and why can't we type Practitioner?   Pracitioner here - I usually go for Practitoner</p>",
        "id": 153924117,
        "sender_full_name": "Brett Esler",
        "timestamp": 1512934531
    },
    {
        "content": "<p>Not a terribly relevant use case where I live. Note that the GP Organization can already be identified (inclusive of location).  So in case of doubt as to where a practitioner works one could supply both Practitioner as well as Organization.</p>",
        "id": 153925526,
        "sender_full_name": "René Spronk",
        "timestamp": 1513353378
    },
    {
        "content": "<p>Many real life systems seem to join practitioners and their organizations into a single record, which is reflected by PractitionerRole. They also refer to these records from the patient. So especially for FHIR facades of such backends, this would make things much easier.</p>\n<p>It would also simplify some issues we had when doing a combined FHIR/CDA implementation guide.</p>",
        "id": 153926638,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1513843315
    },
    {
        "content": "<p>I believe this is a vote in favour</p>",
        "id": 153926639,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513844345
    },
    {
        "content": "<p>We have a similar tracker (<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14334\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14334\">GF#14334</a>) logged for CareTeam.participant.member, which generated a lot of discussion in Patient Care yesterday.  Currently, CareTeam.participant.member can reference a Practitioner and CareTeam.participant.onBehalfOf can reference an Organization, but the tracker asked for CareTeam.participant.member to also support referencing a PractitionerRole (to get telecom, available times etc.).  The debate within Patient Care is what impact the addition of PractitionerRole should (or shouldn't) have on the onBehalfOf element.  The tracker outlines the specific pros and cons voiced.  Patient Care is looking for implementer feedback on this topic.  For example, is it confusing to reference the PractitionerRole resource when the actual role (PractitionerRole.code) is unknown?</p>",
        "id": 153927751,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1515163499
    },
    {
        "content": "<p>The updated workflow patterns call for the elimination of \"onBehalfOf\" and to just use PractitionerRole in those situations.</p>",
        "id": 153927762,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515166301
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> yep, that was noted and discussed, but it wasn't convincing enough for PC to proceed with the removal of onBehalfOf.  I might have suggested they raise the topic with workflow :)</p>",
        "id": 153928023,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1515441228
    },
    {
        "content": "<p>I intend to request a breakout session during the New Orleans connectathon focused on CareTeam participants and PractionerRole, emphasizing implementer feedback and requirements. Positioned as a breakout for the Care Plan track.  I thought about also including PratitionerRole as it relates to provider directories.  Thoughts?</p>",
        "id": 153928032,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1515444433
    }
]