[
    {
        "content": "<p>We use the ImmunizationRecommendation resource, which includes the forecastStatus element. I have a few questions about this:</p>\n<ol>\n<li>What is the purpose of this concept and why is it mandatory?</li>\n<li>How do people use this concept in the solutions of the implementer? </li>\n<li>When is this concept filled? When requesting the resource or registering?</li>\n</ol>",
        "id": 231447756,
        "sender_full_name": "Ashwin Djorai",
        "timestamp": 1616494994
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span></p>",
        "id": 231468433,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616505635
    },
    {
        "content": "<p>In general, the ImmunizationRecommendation is generated by a system offering clinical decision support for immunizations. Each iteration of the .recommendation backbone element is for a particular target disease or vaccine type (eg, a single ImmunizationRecommendation resource may contain recommendations for both influenza and COVID in separate iterations of .recommendation). For each recommendation, recommenation.forecastStatus indicates the patient's status for that disease (eg. the patient may be currently due for a dose of vaccine or they may have completed the recommended series of doses for that disease). That determination is made by the clinical decision support systems after comparing the patient's vaccination history against a specific set of recommendations.</p>",
        "id": 231473172,
        "sender_full_name": "Craig Newman",
        "timestamp": 1616507449
    },
    {
        "content": "<p>For example, if a patient received a dose of influenza vaccine in October 2020 and a set of recommendations is created for them today, then there may be a .recommendation iteration for influenza with a status of \"complete\" because they have received their one and only dose earlier in the flu season. But there may be a second .recommendation iteration for COVID with a status of \"due\" because they haven't received any COVID doses yet.</p>",
        "id": 231473476,
        "sender_full_name": "Craig Newman",
        "timestamp": 1616507567
    }
]