[
    {
        "content": "<p>Hi All,<br>\nWonder if there is any place that can ask questions specific related forge?<br>\nFor example, I am working on a QuestionnaireRespond profile through Forge. Based on our requirements, I want to add third nested item. like:</p>\n<p>\"item\": [<br>\n    {<br>\n      \"linkId\": \" 1.0\",<br>\n      \"item\": [<br>\n        {<br>\n          \"linkId\": \"1.1\",<br>\n          \"item\": [<br>\n                     {<br>\n                           \"linkId\": \"1.1.1\",<br>\n                            \"item\": [<br>\n                                          ......<br>\n                               ]<br>\n                         }<br>\n                 ]<br>\n          }<br>\n      ]<br>\n}<br>\n]</p>\n<p>However, there is no detail element(linkid, answer, etc...) under third nested \"item\" in forge for me to add fix value. I wonder how we should do for this situation.</p>\n<p>Hope this make sense.</p>",
        "id": 154022591,
        "sender_full_name": "Lentic Li",
        "timestamp": 1543869682
    },
    {
        "content": "<p>why do you need to do this? shouldn't you be editing a questionnaire instead?</p>",
        "id": 154022597,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543871615
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> we are gathering all the results of a questionnaire,  shouldn't this being record in a QuestionnaireResponds? Sorry I am still learning FHIR. please correct me if I said anything wrong. <br>\nThanks!</p>",
        "id": 154022612,
        "sender_full_name": "Lentic Li",
        "timestamp": 1543873957
    },
    {
        "content": "<p>yes you do. but it's not usual to profile QuestionnaireReponse - the Questionnaire lays out the content rules, and the FHIR validator will validate the content of a QuestionnaireReponse against the Questionnaire just like it will against a profile</p>",
        "id": 154022618,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543874769
    },
    {
        "content": "<p>Thank you for your advice and explanation, Grahama! I will take a deeply look at the Questionnaire resources.</p>",
        "id": 154022640,
        "sender_full_name": "Lentic Li",
        "timestamp": 1543878848
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196930\">@Lentic Li</span>, Zulip chat is a great place to ask questions about FHIR tooling such as Forge. We monitor the streams and try to respond ASAP - unless <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> beats us to the punch. ;p<br>\nBTW There is also a \"tooling\" stream and a \"conformance\" stream, for specific discussions.</p>",
        "id": 154022704,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1543911602
    }
]