[
    {
        "content": "<p>I don't know how this happened but when I try to reopen my profile in Forge I get the message 'Differential has multiple roots at codeableConcept'. First of all, I do not create the xml file, Forge does, so I need to know what one does such that Forge generates an xml file it can't re-open. Now I have looked at the xml file at all occurrences of 'CodeableConcept' and as far as I can tell they are fine. I see entries for each of my slices and their existence makes sense. Has anyone ever come across this error and know how to fix it? I have days of work invested in that file and don't want to start over again. I should note that the error occurred after I put these files into a git repository but I cannot believe that is the cause.</p>",
        "id": 153884766,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1492161465
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> this is caused by an issue concerning constraints on complex extensions. I've already fixed the issue in the internal development branch. The bugfix will be included in the upcoming Forge STU3 release - stay tuned!</p>",
        "id": 153884768,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1492164020
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  Is there a way I can recover my work? Is there some piece of the file I can edit/remove to salvage as much as possible?</p>",
        "id": 153884769,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1492164793
    },
    {
        "content": "<p>Hi Brian, in the current development build I could open your profile without errors. So it looks like nothing is wrong with the profile, the error is caused by a bug in the API snapshot generator.<br>\nNote that if you want to edit your current profile in the upcoming STU3 release, then you first have to convert it from DSTU2 to STU3 format.</p>",
        "id": 153884775,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1492167864
    },
    {
        "content": "<p>I'll take it. In the end we will need to move to STU3 anyways because the Device-related resources in DSTU2 are not capable of representing PHDs without numerous extensions. We are working with DoF and HCD to formulate versions of the DeviceComponent to handle both the PHD and PoCD needs. As far as the Observation is concerned, the changes from DSTU2 to STU3 3.0.0 do not affect any of the PHD needs (at least I have not caught any yet!)</p>",
        "id": 153884776,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1492168069
    }
]