[
    {
        "content": "<p>Helloo!<br>\nsince this morning i cant log in to <a href=\"http://simplifier.net\" target=\"_blank\" title=\"http://simplifier.net\">simplifier.net</a> in forge anymore. It was working fine last week.<br>\nI was working so far with Forge 19.7 for STU3 but downloaded and installed Forge 22.0 for R4 this morning.</p>\n<p>Now Forge STU3 says: \"Server Error: Operation was unsuccessful, and returned status Internal Server Error. Body has no content. (Status InternalServerError\"</p>\n<p>And Forge R4: \"Server error: Operation was unsuccessful because of a client error (NotFound). OperationOutcome: Overall Result: Failure... Endpoint returned a body with contentType 'text/html', while a valid FHIR xml/json bosy type was expected. ....\"</p>\n<p>Log-In at Browsers like Firefox works, but not in Forge in the \"Publish to <a href=\"http://Simplifier.net\" target=\"_blank\" title=\"http://Simplifier.net\">Simplifier.net</a>\" Window.</p>\n<p>Is it a problem to have two Forge versions at the same time at one computer? Or are this server errors for everyone atm?<br>\nAnybody know this issue?</p>\n<p>Please help :) !</p>",
        "id": 173012416,
        "sender_full_name": "Julia Schönmann",
        "timestamp": 1565605351
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"222223\">@Julia Schönmann</span>, thank you for reporting this. We will investigate the issue.</p>",
        "id": 173013931,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1565607350
    },
    {
        "content": "<p>Ok thank you! Today STU3 is working again, R4 has still the same issue.</p>",
        "id": 173185930,
        "sender_full_name": "Julia Schönmann",
        "timestamp": 1565773070
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"222223\">@Julia Schönmann</span>, Forge R4 has been prepared to connect to Simplifier, however the Simplifier API currently only supports STU3. However, our team is planning to publish an update shortly, which will be announced on Zulip. Once Simplifier has been updated, the current Forge R4 release should be able to connect.</p>",
        "id": 173186322,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1565773478
    }
]