[
    {
        "content": "<p>I want to be able to specify that the Observation.code is required to have a coding element that is populated using a certain coding system, however, additional coding elements are also encouraged expressing the same concept in other coding systems. In CDA implementation guides there is a specified language to express that condition. But in Forge any requirement I make on the selection of a coding system suggests that all elements must use that coding system (which makes no sense).</p>",
        "id": 153881732,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1491919830
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> you can slice the .code element to define several coding options.</p>",
        "id": 153881745,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1491920961
    },
    {
        "content": "<p>okay ... I was afraid of that. I do remember something about 'slicing' in last November's seminar but I didn't recall enough to remember the reason. The most recent use I saw of slicing was to take an element with a max FHIR cardinality of 1 and make it effectively have a higher cardinality. Illegal in FHIR unless one provided a special URI showing the use case.</p>",
        "id": 153881753,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1491921487
    },
    {
        "content": "<p>Slicing allows you to define specific constraints on \"slots\" in a list of items. In you case, you could slice Observation.code to define several options for the code. The first slice could e.g. define a mandatory coding from a specific code system. Following slices could e.g. define optional additional codings from alternative systems. Check the fhir spec for examples on slicing.</p>",
        "id": 153881764,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1491922683
    },
    {
        "content": "<p>I</p>",
        "id": 153884847,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1492290829
    },
    {
        "content": "<p>I'm not sure I follow the underlying desire - what does 'encouraged' mean? Why not just say this in narrative?</p>",
        "id": 153884848,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1492290860
    }
]