[
    {
        "content": "<p>A new Forge release is available: <strong>Forge version 14.4 for DSTU2 – FHIR DevDays 2016 Edition</strong>.<br>\nYou can download the new release for free from <a href=\"http://www.simplifier.net\" target=\"_blank\" title=\"http://www.simplifier.net\">http://www.simplifier.net</a>.</p>\n<p>The new Forge release includes some relatively large changes to critical functionality.<br>\nYou can read about the changes and new features here:<br>\n<a href=\"https://simplifier.net/ui/OrganizationNews/Show?id=22\" target=\"_blank\" title=\"https://simplifier.net/ui/OrganizationNews/Show?id=22\">https://simplifier.net/ui/OrganizationNews/Show?id=22</a><br>\nThe application includes a ReadMe.txt (displayed by the installer) that describes the recent changes in more detail – please read this carefully.</p>\n<p>Highlight: this release introduces support for creating and editing <strong>profiles on profiles</strong> A.K.A. derived profiles!<br>\nNot all advanced scenario's are supported yet (e.g. reslicing), this will be covered by future releases.</p>\n<p>The new Forge version is published as an auto-update. Existing users of the official Forge install package will automatically be notified. For SLA customers, we also provide stand-alone binaries (w/o installer) and access to older releases.</p>\n<p>The new release has a large number of high-impact changes, so it is not entirely unlikely that you will discover some regressions or new issues. In that case, please submit a bug report immediately. Be assured that we are committed to providing a stable application and will do our best to fix any submitted bugs as soon as possible.</p>\n<p>If you have any questions, suggestions or bug reports, then we encourage you to contact us at <a href=\"mailto:forge@furore.com\" title=\"mailto:forge@furore.com\">forge@furore.com</a>.</p>\n<p>Happy profiling!</p>",
        "id": 153858520,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1480095493
    }
]