[
    {
        "content": "<p>Hi,<br>\nI wonder if forge works out of the box with virtualbox. I get a connexion problem \"unable to resolve reference...\" and BTW I am not able to push on simplifier.<br>\nAny thought about that ?</p>",
        "id": 153891703,
        "sender_full_name": "natus",
        "timestamp": 1496174209
    },
    {
        "content": "<p>I used to have Forge running on a Windows 7 VM in Virtualbox without problems some time ago, so this basically should work. This sounds more like an issue with Virtualbox network configuration to me. Basically, if you are able to browse the web within your VM, Forge's network parts should also work.<br>\nIf your host is a Mac or Linux box, you may also try running Forge on Wine. This works, as long as you install the Dotnet-runtime (e.g. using winetricks) and configure Wine to run Forge on an emulated desktop (if you don't, dropdowns may appear empty in the UI).</p>",
        "id": 153891760,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1496216244
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193729\">@natus</span> , Forge should be able to run just fine within a Virtual Machine, but we don't actively test this. You mention a \"connexion problem\", but this appears to be a validation warning from the snapshot generator; this indicates that the target profile references another external profile which is unavailable or cannot be found. And you mention that you cannot publish to Simplifier; are you unable to connect or do you get an error while saving? Can you sucesfully sign on to the Simplifier website from your webbrowser (in VM) using the same credentials?</p>",
        "id": 153891768,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1496223695
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> thank you for the helpful information!</p>",
        "id": 153891769,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1496223744
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  you are right about the the \"validation warning problem\". The problem looks like, I don't know how to reference simplifier's profiles or extension. At least, they are not reacheable from any tools. I reference them as <a href=\"https://simplifier.net/XXX/MyProfile\" target=\"_blank\" title=\"https://simplifier.net/XXX/MyProfile\">https://simplifier.net/XXX/MyProfile</a> by eg.<br>\n&gt;</p>\n<p>ABout publishing to simplifier,  I am able to connect to my accout with forge, and retrieve my folder. However, the problem is when I try to save somethinig. I get this error:  \"An unexpected error occured; this operation is not supported for a relative URI.\"<br>\n&gt;</p>\n<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> thanks for the wine tips. I tried wine without success. I may give it a try. At least, this would be lovely to write the method on simplier. I should not be the only guy working on linux, and this took me 2 weeks to get a operating window computer to try forge. Sad forge is windows centric.</p>",
        "id": 153891816,
        "sender_full_name": "natus",
        "timestamp": 1496257147
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193729\">@natus</span> Note that Forge currently resolves external profiles from the folder on disk that contains the referencing profile and it's subfolders, recursively. However Forge does not (yet) automatically resolve external profiles online, e.g. from Simplifier. So for now, you have to manually find/download all referenced external profiles and put them in the same folder as the main profile. We are looking at redesigning and improving this workflow in a future release.</p>\n<p>As for the runtime error about relative URI's, this is a known issue and will be fixed in the next release. The error is triggered by a default FHIR server address without a http:// prefix. To fix the issue yourself:<br>\n1) Open the application configuration settings file in a text editor (via command in the Options menu)<br>\n2) Close Forge (otherwise your manual changes will be overwritten)<br>\n3) Search for \"<a href=\"http://test.fhir.org/r3\" target=\"_blank\" title=\"http://test.fhir.org/r3\">test.fhir.org/r3</a>\"<br>\n4) Add the missing http:// prefix<br>\n5) Save updated settings<br>\n6) Restart Forge</p>",
        "id": 153892056,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1496391403
    },
    {
        "content": "<p>I understand your pain running Forge in non-Windows OS. Unfortunately this is not something we can easily change, as the code base has grown quite large and complex and it would be very expensive to completely re-implement Forge on a different platform. We've investigated this before, but it is simply not feasible for our company. Please keep in mind that we give away Forge for free...<br>\nMicrosoft has made some great progress with the new .NET Core platform which now runs natively on Linux and MacOS. As we've migrated the .NET FHIR API library and also our Vonk FHIR Server to the .NET Core platform, we can now e.g. dockerize the server and run it on Linux. However the Forge UI is implemented using WPF technology which is tightly integrated with Windows OS and not available within the new .NET Core platform. Therefore Forge is currently tied to the Windows platform. It might be possible to migrate to UWP, however this would also be challenging as Forge uses relatively complex WPF features that are not easy/impossible to migrate to UWP.<br>\nOf course, with proper funding, everything is negotiable... ;p</p>",
        "id": 153892058,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1496392212
    },
    {
        "content": "<p>I noticed the very same external profile problem as <span class=\"user-mention\" data-user-email=\"niparisco@gmail.com\" data-user-id=\"2424\">@natus</span> on using Forge on VM-on-a-Mac. I can access web via VM. I get the snapshot generator warning for ANY baseDefinition URL ('The resolved external profile...has no snapshot.') I have the base definition profile on the same VM folder as the new profile I try to open with Forge. When I open the base definition profile at Simplifier or on my local xml editor, it HAS the snapshot, so this feels quite odd. Related to opening up profiles, for the very basic STU3 base profile (Finnish PHR VitalSigns Profile) to open in Forge I would need its base observation file that is referenced with '<a href=\"http://hl7.org/fhir/StructureDefinition/vitalsigns\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/vitalsigns\">http://hl7.org/fhir/StructureDefinition/vitalsigns</a>'. Is that somewhere to be copied for my own working folder? I cannot find the actual file from the URL :(</p>",
        "id": 153892447,
        "sender_full_name": "Harri Honko",
        "timestamp": 1496753874
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  thanks for all that details. (Is there any better place all that information could go instead of being spread in those threads?) </p>\n<blockquote>\n<p>Note that Forge currently resolves external profiles from the folder on disk that contains the referencing profile and it's subfolders, recursively. However Forge does not (yet) automatically resolve external profiles online, e.g. from Simplifier. So for now, you have to manually find/download all referenced external profiles and put them in the same folder as the main profile. We are looking at redesigning and improving this workflow in a future release.</p>\n</blockquote>\n<p>Using forge 16.1. Indeed this method works. But using \"extension/MyExtension\" as URL leads to at least two problems:<br>\n1. a warning in your tool saying this should be a canonical URL<br>\n2. the fhir validation tool is not able to process those profiles</p>\n<p>Maybe this would be great if your tool would be at least able to scan recursively all local subfolder and search within each to resolve. Thanks</p>",
        "id": 153895754,
        "sender_full_name": "natus",
        "timestamp": 1498771481
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193729\">@natus</span>, FHIR states that conformance resources MUST define a fully qualified absolute canonical url value, e.g. \"<a href=\"http://example.org/fhir/StructureDefinition/MyPatient\" target=\"_blank\" title=\"http://example.org/fhir/StructureDefinition/MyPatient\">http://example.org/fhir/StructureDefinition/MyPatient</a>\". When you create a new profile in Forge, the tool will generate a (temporary) default relative url. It is up to the author to specify a correct absolute url. Therefore Forge displays a warning to inform you about this. Note that Forge and the FHIR .NET API are able to resolve conformance resources with relative canonical url's. However according to FHIR, they are invalid and should not be published. Simplifier validates these rules when you change the publication status to \"active\".</p>",
        "id": 153896593,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1499787973
    }
]