[
    {
        "content": "<p>A new Forge release (12.2) is now available for download.</p>\n<p>This release introduces a new application versioning scheme.</p>\n<ul>\n<li>The major release version represents the sequence number of the next HL7 FHIR Connectathon.</li>\n<li>The minor release version represents the current sprint.</li>\n<li>An optional third version component indicates an intermediate hotfix release.</li>\n</ul>\n<p>Highlights in this release:</p>\n<ul>\n<li>\n<p>Support for complex extensions<br>\n  Now you can create and edit complex extensions with nested child elements<br>\n  Also Forge now supports extensions on extensions.</p>\n</li>\n<li>\n<p>Automatically rename choice type elements constrained to a single type<br>\n  e.g. value[x] constrained to Boolean =&gt; valueBoolean</p>\n</li>\n<li>\n<p>Optionally display common inherited resource elements derived from the abstract Resource and DomainResource base types:<br>\n<a href=\"http://Resource.id\" target=\"_blank\" title=\"http://Resource.id\">Resource.id</a><br>\n  Resource.meta<br>\n  Resource.implicitRules<br>\n  Resource.language<br>\n  DomainResource.text</p>\n</li>\n<li>\n<p>Improved support for the ImplementationGuide resource<br>\n  Reorder package entries<br>\n  Edit the ImplementationGuide.dependency component<br>\n  Edit the ImplementationGuide.contact component<br>\n  Edit the ImplementationGuide.page component</p>\n</li>\n<li>\n<p>Improved validation, especially for element type constraints</p>\n</li>\n<li>\n<p>Miscellaneous UI improvements<br>\n  Element cardinality hints<br>\n  Validation warning color expresses the severity<br>\n    Blue = Info, Orange = Warning, Red = Error<br>\n  When creating or opening a new resource, activate the Element Tree tab by default<br>\n  Generate unique names &amp; urls for newly created resources using an autonumbering scheme<br>\n  Compact redesign for the file properties panel<br>\n  A command button next to the file location opens the containing folder in the Windows File Explorer.</p>\n</li>\n<li>\n<p>Improved performance, especially when opening new resources.</p>\n</li>\n</ul>\n<p>You can download the new relase from <a href=\"http://fhir.furore.com/forge\" target=\"_blank\" title=\"http://fhir.furore.com/forge\">http://fhir.furore.com/forge</a></p>\n<p>If you have any questions or comments, you can contact us at <a href=\"mailto:forge@furore.com\" title=\"mailto:forge@furore.com\">forge@furore.com</a>.</p>\n<p>Happy profiling!</p>",
        "id": 153814751,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1457615033
    },
    {
        "content": "<p>hi michel - when I try to directly upload a profile to a fhir server I get an 'object reference not set to instance' error....</p>",
        "id": 153820095,
        "sender_full_name": "David Hay",
        "timestamp": 1459986823
    },
    {
        "content": "<p>also - is there a simple way of updating forge, or is it best to always download a new version</p>",
        "id": 153820096,
        "sender_full_name": "David Hay",
        "timestamp": 1459986858
    },
    {
        "content": "<p>oh - and after getting the error, attempting a save will result in the save error...</p>",
        "id": 153820111,
        "sender_full_name": "David Hay",
        "timestamp": 1460000340
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> thank you for reporting this issue. We've recently received a similar bug report. It turned out that the connection error was caused by a mismatch on the resource wire format (JSON instead of XML). This will be fixed in the next release.<br>\nIf you have downloaded the official ClickOnce package, than the installer automatically checks for updates at application launch. However if you are running stand-alone binaries, then you need to update manually.<br>\nI'll send you a link via e-mail to the latest internal development build, so you can test if the connection issue has been fixed.</p>",
        "id": 153820139,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1460017968
    },
    {
        "content": "<p>Is it possible to put constraints around contained resources and modifierExtensions when creating a profile in Forge?</p>",
        "id": 153820595,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1460337013
    },
    {
        "content": "<p>ask this in the conformance stream</p>",
        "id": 153820605,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1460348730
    },
    {
        "content": "<p>will do</p>",
        "id": 153820606,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1460348755
    },
    {
        "content": "<p>When creating a profile in forge, is it possible to remove elements with a multiplicity of 0..0 from the snapshot?</p>",
        "id": 153820943,
        "sender_full_name": "David Hay",
        "timestamp": 1460418002
    },
    {
        "content": "<p>Why would you want to?</p>",
        "id": 153820958,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460430832
    },
    {
        "content": "<p>What is the value in their being present? </p>",
        "id": 153820959,
        "sender_full_name": "David Hay",
        "timestamp": 1460431220
    },
    {
        "content": "<p>It's explicit.  When we get into versionless, it'll differentiate between known prohibited elements and unknown new elements.</p>",
        "id": 153820960,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460431285
    },
    {
        "content": "<p>Different questions: Forge adds the following snippet when adding an extension:</p>\n<div class=\"codehilite\"><pre>  &lt;element&gt;\n      &lt;path value=&quot;CarePlan.extension&quot; /&gt;\n      &lt;slicing&gt;\n        &lt;discriminator value=&quot;url&quot; /&gt;\n        &lt;rules value=&quot;openAtEnd&quot; /&gt;\n      &lt;/slicing&gt;\n    &lt;/element&gt;\n</pre></div>\n\n\n<p>Which causes Grahames server to reject it on the basis of invariant SDF-3:  On StructureDefinition.snapshot: Each element definition in a snapshot must have a formal definition and cardinalities </p>",
        "id": 153820961,
        "sender_full_name": "David Hay",
        "timestamp": 1460431349
    },
    {
        "content": "<p>Forge should probably be carrying the definition and cardinality of the base extension element</p>",
        "id": 153820963,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1460431589
    },
    {
        "content": "<p>and place it in that element?</p>",
        "id": 153820964,
        "sender_full_name": "David Hay",
        "timestamp": 1460431627
    },
    {
        "content": "<p>yes that's what a snapshot means</p>",
        "id": 153820965,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1460431664
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> thank you for pointing this out. I will fix the snapshot serialization of the slicing intro element.</p>",
        "id": 153821004,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1460448801
    },
    {
        "content": "<p>Created Jira issue FRG-308</p>",
        "id": 153821006,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1460448939
    },
    {
        "content": "<p>thanks michel - btw - will you be continuing to support the STU-2 version of forge?</p>",
        "id": 153821007,
        "sender_full_name": "David Hay",
        "timestamp": 1460449090
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> correct, Forge will stay at DSTU2 until after the Montreal HL7 WGM. After STU3 balloting, we will upgrade all our tooling to STU3, including a new major Forge release for STU3. You can run different major Forge releases run side-by-side. Older Forge releases are no longer actively maintained, but will remain available for download. We do provide support on older versions to customers with a service level agreement.</p>",
        "id": 153821009,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1460449693
    },
    {
        "content": "<p>Forge Release 12.4 for DSTU2 1.02 is now available for download.</p>\n<p>Highlights:<br>\n- Upgrade FHIR .NET API library to v0.95-alpha1 for DSTU2 1.02 (Official version)<br>\n  The new FHIR API version provides several bugfixes and optimizations.<br>\n- New online F1 help: <a href=\"http://docs.simplifier.net/projects/forge-docs/\" target=\"_blank\" title=\"http://docs.simplifier.net/projects/forge-docs/\">http://docs.simplifier.net/projects/forge-docs/</a><br>\n- Display resource maturity level, as defined by the FHIR specification<br>\n- Support editing of the Narrative component (DomainResource.text)<br>\n  Note: the Narrative component contains formatted text and can be quite large.<br>\n  Forge provides two global configuration options in order to conserve memory:</p>\n<ul>\n<li>\n<p>Discard DomainResource.text values<br>\n    Delete the Narrative component when loading a (core or user) profile</p>\n</li>\n<li>\n<p>Discard DomainResource.text profile element<br>\n    Delete ElementDefinitions for the Narrative component in all (core or user) profiles</p>\n</li>\n<li>Optimized Differential generation<br>\n  The serialized XML output is now more compact and contains less noise.<br>\n  All omitted values are implied to be derived from the base resource.</li>\n<li>New configuration option \"Show common elements\"<br>\n  This option toggles the visibility of common profile elements derived from Resource &amp; DomainResource</li>\n<li>Support for hyperlinks in error dialogs</li>\n<li>Various optimizations and bugfixes</li>\n</ul>\n<p>If you have installed Forge from the ClickOnce installer package, then the application will automatically offer an upgrade to the new release on the next launch. Alternatively, you can download the new release from <a href=\"https://simplifier.net/ui/info/forge\" target=\"_blank\" title=\"https://simplifier.net/ui/info/forge\">https://simplifier.net/ui/info/forge</a>.</p>\n<p>In case you find a bug in this new release, please report it to us ASAP at <a href=\"mailto:forge@furore.com\" title=\"mailto:forge@furore.com\">forge@furore.com</a> and we will try and fix it before the upcoming HL7 Montreal WGM. Also, if you have any questions or comments, feel free to contact us at <a href=\"mailto:forge@furore.com\" title=\"mailto:forge@furore.com\">forge@furore.com</a>.</p>\n<p>Happy profiling!</p>",
        "id": 153823110,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1461679257
    },
    {
        "content": "<p>Thank you Michel! I'm wondering if there is a plan to release a new version of Forge to support STU3 Candidate / 2016May version of FHIR.</p>",
        "id": 153823121,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1461680164
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191393\">@Igor Sirkovich</span> You're welcome! We are definitely planning to upgrade all our tools (including Forge) to STU3, but not until _after_ the HL7 WGM ballot.</p>",
        "id": 153823124,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1461680286
    },
    {
        "content": "<p>Thank you, will have to wait :)</p>",
        "id": 153823127,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1461680357
    },
    {
        "content": "<p>Michel, if someone were to produce a DSTU 2 version of the DSTU 3 resource StructureDefinitions, Forge would be able to work with those, right?  The main updates for you in moving to DSTU 3 would be accommodating the changes in StructureDefinition and ValueSet, but my understanding is that you now take the resource definitions from a library, so it's easy to swap those out with a different set?</p>",
        "id": 153823164,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461685947
    },
    {
        "content": "<p>ContentReference is a big change</p>",
        "id": 153823169,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461687893
    },
    {
        "content": "<p>Yes, the breaking change in StructureDefinition is what keeping us from simply upgrading to STU3...</p>",
        "id": 153823202,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1461694730
    },
    {
        "content": "<p>But if the DSTU3 structured definitions were converted to DSTU2 syntax, could Forge handle that?</p>",
        "id": 153823257,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461700702
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Unfortunately it's not that easy. Forge depends on StructureDefinition POCO in FHIR .NET API. In STU3, StructureDefinition resource introduces breaking changes, so this requires a new major release. We want to make sure that DSTU2 users are still able to edit their existing resources. Therefore the STU3 upgrade will be published as a new major version that you can install next to the current DSTU2 release. We will upgrade all our tooling to DSTU3 after the Montreal WGM ballots. In theory, it's possible to hack validation.zip for STU3 support, enabling the profiling of STU3 clinical resources using the DSTU2 StructureDefinition. But I wouldn't recommend that to regular users...</p>",
        "id": 153823265,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1461705906
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> if there is a pressing need, we might be able to hack a STU3 validation.zip. But I'm a bit reluctant, worried that profiles for STU3 resources expressed by DSTU2 StructureDefinitions will cause confusion to the community...? However if you think this would be valuable nonetheless, then I'm willing to cooperate and try to get this working for Montreal. Note that Forge uses the validation.xml.zip from the application directory. If you replace the StructureDefinitions in this ZIP file (esp. inside profile-resources.xml) then Forge should pick this up on the next run.</p>",
        "id": 153823266,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1461706624
    },
    {
        "content": "<p>BTW Tomorrow I'm celebrating King's Day so I'll be offline. Leve de koning! Hoera! Hoera! Hoera!</p>",
        "id": 153823267,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1461706823
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> I don't think it should be terribly confusing to the community to have a \"2016May validation.zip\" or a \"2016 ballot validation.zip\" file for use with Forge.  If you really think there might be confusion, throw a _readme.txt file in the zip that explains that the resources are documented using DSTU 2 artifacts because that's what Forge currently supports.  If we're going to push HL7 to start using Forge for development, it's going to be a pretty standard process to need to edit profiles based on the \"next\" release of FHIR using tools built against the \"current\" release of FHIR.</p>",
        "id": 153823286,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461716911
    },
    {
        "content": "<p>can you give an example of the use of contentreference?</p>",
        "id": 153823292,
        "sender_full_name": "David Hay",
        "timestamp": 1461720978
    },
    {
        "content": "<p>Yes, I think if we'd had the new STU3 resources in DSTU2 SD format, we could proceed, but since there are also changes with regards to NamingSystem/ValueSet, I suspect there are some subtle issues that would make this harder than it sounds....</p>",
        "id": 153823358,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1461762927
    },
    {
        "content": "<p>you know I have a converter that will convert from DSTU 2 to STU 3 format and vice versa?</p>",
        "id": 153823359,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461762976
    },
    {
        "content": "<p>VIce versa? I know about 2-&gt;3, but not vice versa no. </p>",
        "id": 153823360,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1461763019
    },
    {
        "content": "<p>yep. my converter will go both ways </p>",
        "id": 153823362,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461763031
    },
    {
        "content": "<p>If you made it work, I guess \"all\" we'd need was the stu3 definitions in DSTU2 SD format....</p>",
        "id": 153823363,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1461763049
    },
    {
        "content": "<p>Is there a validation.zip (or actually just profiles-resources.xml / profiles-types.xml) available that contains updated STU3 resource definitions expressed in DSTU2 StructureDefinitions? I could try and examine if I can make Forge use the updated definitions. Unfortunately I have little time left to implement user friendly integration and iron out any bugs, so I'm not sure we can get this to work in time for Montreal.</p>",
        "id": 153823736,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1461920742
    },
    {
        "content": "<p>Forge Release 12.5 for DSTU2 1.02 is now available for download.</p>\n<p>Forge is a Windows application for FHIR Profiling &amp; Conformance based on the Microsoft .NET platform. The application is freely available for download and free to use.</p>\n<p>Note: this release still supports FHIR DSTU2 1.02 (Official version) from Oct. 24th, 2015.<br>\nAfter the HL7 WGM ballots in Montreal, we will upgrade all our FHIR tooling to support the new STU3 specification. Because STU3 introduces breaking changes, we will publish the future Forge STU3 release as a new major version. This will allow side-by-side deployment of both the DSTU2 and STU3 releases on the same machine.</p>\n<p>Highlights:</p>\n<ul>\n<li>\n<p>NEW! Logical modelling<br>\nForge now supports the authoring of logical models, based on the FHIR StructureDefinition resource.</p>\n</li>\n<li>\n<p>New start page<br>\nThe application start page now displays a news feed from <a href=\"https://simplifier.net/feed/organizationnews/furore\" target=\"_blank\" title=\"https://simplifier.net/feed/organizationnews/furore\">https://simplifier.net/feed/organizationnews/furore</a><br>\nThe news feed will inform you about product updates, new major releases and upcoming events such as HL7 WGM.<br>\nThe new start page also provides shortcuts to frequently used commands and recent documents.</p>\n</li>\n<li>\n<p>Various optimizations &amp; bugfixes</p>\n</li>\n</ul>\n<p>You can download Forge from our Simplifier website: <a href=\"https://simplifier.net/ui/info/forge\" target=\"_blank\" title=\"https://simplifier.net/ui/info/forge\">https://simplifier.net/ui/info/forge</a></p>\n<p>Happy Profiling!</p>",
        "id": 153825270,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1462645257
    },
    {
        "content": "<p>The link <a href=\"https://simplifier.net/ui/info/forge\" target=\"_blank\" title=\"https://simplifier.net/ui/info/forge\">https://simplifier.net/ui/info/forge</a> appears to be broken at the moment</p>",
        "id": 153826232,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1462835405
    },
    {
        "content": "<p>Thanks. We're fixing it.</p>",
        "id": 153826267,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1462865855
    },
    {
        "content": "<p>Richard: We fixed it. It should be working again.</p>",
        "id": 153826269,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1462867951
    },
    {
        "content": "<p>A new Forge version (13.2) is now available for download from <a href=\"https://simplifier.net/\" target=\"_blank\" title=\"https://simplifier.net/\">https://simplifier.net/</a>.<br>\nThis update represents a minor release with lots of bugfixes and small functional improvements.</p>\n<p>New commands:</p>\n<p>- New command in File menu: Open in External Application<br>\n  (also available in session explorer context menu)<br>\n  Open the selected resource via windows, using the default application registered for the (.xml) filetype<br>\n  This allows you to edit package entries that are not (fully) supported by Forge itself, e.g. ValueSets, example resources etc.</p>\n<p>- New command in Options menu: Open application folder<br>\n  The ClickOnce installer puts the application files in a deeply nested folder that is hard to find.<br>\n  This command opens the application installation folder in Windows Explorer.</p>\n<p>- New command: show official documentation for the selected element<br>\n  The profile elements tree now provides a new toolbar command (with question mark \"?\" icon)<br>\n  to visit the official online FHIR documentation page for the selected profile element.</p>\n<p>Optimizations:</p>\n<p>- Optimized differential component for size<br>\n  Serialization logic has been further improved in order to suppress the serialization<br>\n  of nodes with empty/default Integer or Boolean values (e.g. Min, MustSupport).</p>\n<p>- Optimized profile (re-)binding<br>\n  Forge tries to bind element types to the associated profiles, if they are available (loaded) within the current context, for validation purposes.<br>\n  Type binding requires Forge to match compatible profiles, this is quite computationally intensive.<br>\n  The underlying logic has been optimized to prevent unnecessary rebinding.<br>\n  Specifically, Forge now ignores changes in element type options that aren't selected/checked.<br>\n  This optimization improves the performance of change tracking, e.g. when loading a package<br>\n  or editing the canonical url of a profile that is referenced by other loaded profiles.</p>\n<p>Plus a plethora of bugfixes...</p>\n<p>If you have any questions or comments, please contact us at <a href=\"mailto:forge@furore.com\" title=\"mailto:forge@furore.com\">forge@furore.com</a>.</p>\n<p>Happy Profiling!</p>",
        "id": 153832389,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1465570904
    },
    {
        "content": "<p>I am trying to create a Profile for Bundle using Forge. Cardinality on entry is set to 0-*. I want to set constraint on the type of resource in an entry like a bundle should have atleast one Allergy Intolerance resource, a patient resource etc. How can I edit the entry in Element Tree ? </p>",
        "id": 153833329,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1466090245
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192131\">@Shweta Katdare</span> sounds like you need to slice the Bundle.entry element. Slicing allows you to define multiple constraints on a single element. Forge provides a toolbar button to slice an element, and another button to add so called \"slices\". You can add a slice for each separate  resource type, e.g. first slice has type set to Reference(AllergyIntolerance) and cardinality set to 1...1.</p>",
        "id": 153833330,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1466091537
    },
    {
        "content": "<p>e.g. see this Bundle profile on simplifier: <a href=\"https://simplifier.net/RippleOSIUK/Bundle-ProvideDocumentBundle\" target=\"_blank\" title=\"https://simplifier.net/RippleOSIUK/Bundle-ProvideDocumentBundle\">https://simplifier.net/RippleOSIUK/Bundle-ProvideDocumentBundle</a></p>",
        "id": 153833331,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1466091649
    },
    {
        "content": "<p>Here you can find an explanation of slicing: <a href=\"https://www.hl7.org/fhir/profiling.html#slicing\" target=\"_blank\" title=\"https://www.hl7.org/fhir/profiling.html#slicing\">https://www.hl7.org/fhir/profiling.html#slicing</a></p>",
        "id": 153833332,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1466091699
    },
    {
        "content": "<p>Got it ! Thanks <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> </p>",
        "id": 153833346,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1466095366
    },
    {
        "content": "<p>Hi all, a quick question. I create a profile in Forge with very minimum changes, say changing cardinality of an element. I can publish that profile to <a href=\"http://spark-dstu2.furore.com/\" target=\"_blank\" title=\"http://spark-dstu2.furore.com/\">http://spark-dstu2.furore.com/</a> without any issues. When I try to publish it to <a href=\"http://fhir2.healthintersections.com.au/open\" target=\"_blank\" title=\"http://fhir2.healthintersections.com.au/open\">http://fhir2.healthintersections.com.au/open</a>, I encounter following error 'Constraints must be unique by key () constraint.distinct(key)'. So the question is why do the 2 servers behave differently ?  Do i really need to add 'Constraints' when it has differential statements ?</p>",
        "id": 153836764,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1467895809
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192131\">@Shweta Katdare</span> No you don't need to explicitly add constraints to a profile. I suspect that this is a bug in <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>'s server.<br>\nWhat base resource did you choose?</p>",
        "id": 153836766,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1467896012
    },
    {
        "content": "<p>I am using MedicationOrder as base resource.</p>",
        "id": 153836767,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1467896433
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192131\">@Shweta Katdare</span>, I checked the (DSTU2) core resource definition of the MedicationOrder resource. I found out that the MedicationOrder.text element has a condition reference \"dom-1\". This refers to a constraint that is defined on the DomainResource base type profile. Possibly Grahame's server does not yet have the capability to resolve the inherited constraint.</p>",
        "id": 153836769,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1467896810
    },
    {
        "content": "<p>Thanks for checking <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> </p>",
        "id": 153836770,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1467897028
    },
    {
        "content": "<p>You're welcome!</p>",
        "id": 153836771,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1467897052
    },
    {
        "content": "<p>so can you point me to a public server where I can publish the profile and validate it ? I tried <a href=\"http://spark-dstu2.furore.com/\" target=\"_blank\" title=\"http://spark-dstu2.furore.com/\">http://spark-dstu2.furore.com/</a> but Validate operation is not implemented on it</p>",
        "id": 153836775,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1467901614
    },
    {
        "content": "<p>Is Forge going to support the latest ballot STU3 resource definitions? I would like to create a profile for a newly created resource.</p>",
        "id": 153836783,
        "sender_full_name": "Ioana Singureanu",
        "timestamp": 1467904089
    },
    {
        "content": "<p>I created an extension in Forge with 3 extensions nested in it, and published it to a public test server.  I've a screenshot attached. Is this correct way to create complex extensions ? i do need 3 distinct boolean values.<br>\n<a href=\"/user_uploads/10155/nRaw3WvR0-miW3L5HGS4hc9h/extensions.png\" target=\"_blank\" title=\"/user_uploads/10155/nRaw3WvR0-miW3L5HGS4hc9h/extensions.png\">extensions.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/nRaw3WvR0-miW3L5HGS4hc9h/extensions.png\" target=\"_blank\" title=\"/user_uploads/10155/nRaw3WvR0-miW3L5HGS4hc9h/extensions.png\"><img src=\"/user_uploads/10155/nRaw3WvR0-miW3L5HGS4hc9h/extensions.png\"></a></div>",
        "id": 153836818,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1467923381
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>, this is my server applying standard FHIR validation is specified in the spec, where as Spark doesn't. This is unlikely to be a bug in my server, more likely a bug in Forge. But I haven't had a chance to look at the actual profile yet </p>",
        "id": 153836820,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467924329
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191968\">@Ioana Singureanu</span> the current ballot publishes a set of DSTU2 profiles that you can configure Forge to use - that way you can use Forge against newly created resources. </p>",
        "id": 153836831,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467925600
    },
    {
        "content": "<p>and the new IG publisher is able to use DSTU 2 profiles created in that way </p>",
        "id": 153836833,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467925615
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  I have already created DSTU2 profiles but they are based on Contract and I would to do the same for Consent. The good news is that I will only require a profile for Consent without the List and Basic profiles needed with Contract.  If Forge allows me to use STU3 FHIR Consent. that would be great.</p>",
        "id": 153836879,
        "sender_full_name": "Ioana Singureanu",
        "timestamp": 1467937494
    },
    {
        "content": "<p>yes. the downloads page from the current build has a link to the forge version of the resources. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> can tell you how to hack Forge to use those definitions instead. In a future release, that's supposed to become easier</p>",
        "id": 153836881,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1467937582
    },
    {
        "content": "<p>You can't hack Forge to use new resources, only new definitions of old resources.  Yet.  The ability to handle \"new\" resources is supposed to be coming soon.</p>",
        "id": 153836885,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1467941952
    },
    {
        "content": "<p>can we validate extensions using $validate operation ?</p>",
        "id": 153836963,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1468001879
    },
    {
        "content": "<p>Everytime I add an extension to a resource (in Forge), I get this warning. How do I edit it ?<br>\n<a href=\"/user_uploads/10155/OlCrRqWMGbXnxhlrT-4yll92/pasted_image.png\" target=\"_blank\" title=\"/user_uploads/10155/OlCrRqWMGbXnxhlrT-4yll92/pasted_image.png\">pasted image</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/OlCrRqWMGbXnxhlrT-4yll92/pasted_image.png\" target=\"_blank\" title=\"/user_uploads/10155/OlCrRqWMGbXnxhlrT-4yll92/pasted_image.png\"><img src=\"/user_uploads/10155/OlCrRqWMGbXnxhlrT-4yll92/pasted_image.png\"></a></div>",
        "id": 153836970,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1468008751
    },
    {
        "content": "<p>yes validate includes validating exntensions</p>",
        "id": 153836994,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468012348
    },
    {
        "content": "<p>what's the recommended version of forge to be used with fhir 1.4.0?</p>",
        "id": 153837201,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1468210543
    },
    {
        "content": "<p>there isn't really one</p>",
        "id": 153837202,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468211134
    },
    {
        "content": "<p>Forge itself only supports 1.0.2. The trunk - 1.5.0 - supports Forge by converting to and from 1.0.2, but this isn't a solution for 1.4.0</p>",
        "id": 153837203,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468211175
    },
    {
        "content": "<p>alright</p>",
        "id": 153837205,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1468211251
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192131\">@Shweta Katdare</span> Maybe you can share your MedicationOrder profile? I'd like to take a closer peek in order to explain the validation error about constraint keys.</p>",
        "id": 153837287,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1468229754
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192131\">@Shweta Katdare</span> concerning the validation error on the element Base definition property, this shouldn't happen as the user cannot edit these fields. Are you using the current Forge release? I've checked but cannot reproduce this in the current (unpublished) development branch. Does the warning occur on the added extension element? Or can you outline steps to reproduce?</p>",
        "id": 153837289,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1468230131
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  I've attached the MedicationOrder profile. The only change is cardinality of medicationCodeableConcept and it's type.</p>",
        "id": 153837304,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1468239473
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/pGeCzHdQnhFg8YVmd_tciIeb/mymedorderstructuredefinition.xml\" target=\"_blank\" title=\"/user_uploads/10155/pGeCzHdQnhFg8YVmd_tciIeb/mymedorderstructuredefinition.xml\">mymedorderstructuredefinition.xml</a> </p>",
        "id": 153837305,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1468239609
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  I am using Forge 13.2. The warning occurs when I add the extension on a resource. I've attached both the profiles <a href=\"/user_uploads/10155/VH5T7f8C7opoGM-FPktox6-5/testextensionstructuredefinition.xml\" target=\"_blank\" title=\"testextensionstructuredefinition.xml\">testextensionstructuredefinition.xml</a> <a href=\"/user_uploads/10155/82s3ZtPPZYd28DZsvImPAsU3/basicwithtestextensionstructuredefinition.xml\" target=\"_blank\" title=\"basicwithtestextensionstructuredefinition.xml\">basicwithtestextensionstructuredefinition.xml</a> </p>",
        "id": 153837306,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1468239836
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192131\">@Shweta Katdare</span> thank's for the info. I've taken a quick look at your MedicationOrder profile. I noticed that the profile contains an expanded snapshot component. This seems to cause the validation errors on Grahame's server. Snapshot expansion in Forge is somewhat crude and not fully compliant to the FHIR spec. I'm planning to remove this custom logic and instead leverage the snapshot expansion logic that is now provided by the FHIR .NET API. This should improve the quality of the snapshot expansion and better conform to the FHIR spec. This improvement will probably be part of the next release. For now, you can try and save your profile without a snapshot (by unchecking the relevant setting in the Forge options menu) and then republish to Grahame's server. This should fix the validation error, as the server will then expand/resolve the snapshot component itself. If not, please let me know.</p>",
        "id": 153837334,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1468253822
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192131\">@Shweta Katdare</span> as for the validation warning on the extension element, I cannot reproduce this in the current internal development branch, so I assume that I've already fixed this lately. The bugfix will be part of the next Forge release (no pub date yet).</p>",
        "id": 153837336,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1468254960
    },
    {
        "content": "<p>thank you <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> . I tried publishing the profile without snapshot component. It gives me 'constraints must be unique by key...' validation on the root element. </p>",
        "id": 153837652,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1468334688
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192131\">@Shweta Katdare</span> strange, I'd have to investigate further. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> maybe you can explain the reason of the validation error? The MedicationOrder profile should be on your server. If I understand what's wrong, I can try and fix it.</p>",
        "id": 153837657,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1468335575
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> Here is the profile without snapshot <a href=\"/user_uploads/10155/psnEywWCXvCWvjizRcStwSBx/mymedorderstructuredefinition.xml\" target=\"_blank\" title=\"mymedorderstructuredefinition.xml\">mymedorderstructuredefinition.xml</a>. Thanks for your help</p>",
        "id": 153837661,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1468336999
    },
    {
        "content": "<p>hmm, this it turns out, is a bug in my server</p>",
        "id": 153837692,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468351892
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  I was able to get rid of the warnings by explicitly adding &lt;base&gt; element in the generated structured definition and re-opening it in Forge. Thanks for your help.</p>",
        "id": 153837955,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1468415314
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192131\">@Shweta Katdare</span> Did you create the original profile (without base element) in Forge? Because Forge should always initialize and emit the ElementDefinition.base component. If not, then you probably found a bug. Anyway, thank you for reporting this! When you open an external profile in Forge, the application already tries to find and fix some common issues. Maybe we should improve that logic to also detect and fix missing ElementDefinition.base components.</p>",
        "id": 153837960,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1468415804
    },
    {
        "content": "<p>I do have the 'Save ElementDefinition.Base' option turned on. </p>",
        "id": 153837969,
        "sender_full_name": "Shweta Katdare",
        "timestamp": 1468416860
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192131\">@Shweta Katdare</span> I can't reproduce the warning in the current (internal) development branch, so I guess I already fixed it. When you add an extension element, the ElementDefinition.base component is initially empty. However this does not trigger any validation warnings. In any case, I think you can safely ignore the warning and assume that this will no longer occur in the next update (no publish date yet).</p>",
        "id": 153837979,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1468420623
    },
    {
        "content": "<p>hello all, some where i read that , forge tool for stu3 support will release 17th april. but i didn't find it anywhere. so please can any one help. from where i can download that. Thank you.</p>",
        "id": 153884948,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492495549
    },
    {
        "content": "<p>Would you have a link for that date?</p>",
        "id": 153884950,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1492499262
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span> Although we did not commit to a specific date, we are planning to publish a sneak preview Forge STU3 release shortly, probably later this week. Once the release is available, we will publish an announcement on Zulip and to the Simplifier/Forge news feed. Stay tuned!</p>",
        "id": 153884956,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1492505792
    },
    {
        "content": "<p>okay. Thank you <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> </p>",
        "id": 153884963,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1492509748
    },
    {
        "content": "<p>+1 thanks <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> </p>",
        "id": 153885031,
        "sender_full_name": "Brett Esler",
        "timestamp": 1492553110
    },
    {
        "content": "<p>Any news on the release of Forge? I can't work on my profile because of a bug in the 15.4.0 version of Forge that prevents loading the saved profile. For my case the STU3 support is not nearly as critical as just being able to continue working! Perhaps the bug can be fixed for the DSTU2 version?</p>",
        "id": 153885081,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1492590928
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> we will publish a sneak preview release of Forge for STU3 to the community this week. We will continue to provide support and updates for Forge for DSTU2 to our commercial customers.</p>",
        "id": 153885087,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1492596499
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  do we have a slot on the IHE face-to-face next week where <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> can present Forge as a tool for profiling FHIR? </p>",
        "id": 153885092,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492601576
    },
    {
        "content": "<p>Not yet. Let me see if I can make room for it. We might have to organize a separate session for this.</p>",
        "id": 153885162,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1492620002
    },
    {
        "content": "<p>Can PCC join when you schedule it please?</p>",
        "id": 153885174,
        "sender_full_name": "Emma Jones",
        "timestamp": 1492628280
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191990\">@Emma Jones</span>, certainly, I'll let you know when I've got more.</p>",
        "id": 153885176,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1492628908
    },
    {
        "content": "<p>Thanks Elliot</p>",
        "id": 153885179,
        "sender_full_name": "Emma Jones",
        "timestamp": 1492630076
    },
    {
        "content": "<p>Actually, I think a number of folk would be interested in a session on Forge! </p>",
        "id": 153885301,
        "sender_full_name": "David Hay",
        "timestamp": 1492711138
    },
    {
        "content": "<p>Any news on this? I attempted a download from Simplifier and got a 'cannot process request' response</p>",
        "id": 153887161,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1493923129
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> we've just updated our Simplifier platform to support STU3. The public endpoints have also been updated to STU3. Although Simplifier remains to support DSTU2 resources, Simplifier does no longer provide public DSTU2 endpoints. If you want to use Forge/Simplifier integration features (open from, publish to), then you must upgrade to Forge STU3.</p>",
        "id": 153887308,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1494001908
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> - do you still have this issue? If so, can you give me some details?</p>",
        "id": 153888558,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1494286915
    },
    {
        "content": "<p>hello all, whenever i trying to save my profile as snapshort then it's getting struck. don't know why? if i'm saving as differencial then it's working fine. any reason?</p>",
        "id": 153888582,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1494311736
    },
    {
        "content": "<p>Forge questions should ideally be raised on the <a href=\"https://chat.fhir.org/#narrow/stream/conformance\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/conformance\">conformance</a> stream</p>",
        "id": 153888593,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1494316318
    },
    {
        "content": "<p>Thank you for the bug reports. I'm now attending the HL7 WGM and then I'll have a couple of days off. I'll look into this next week or the week thereafter. Then we'll try to fix all the reported bugs and publish a minor update. Cheers!</p>",
        "id": 153888632,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1494325104
    },
    {
        "content": "<p>okay.</p>",
        "id": 153888844,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1494388669
    },
    {
        "content": "<p>\"This MAY not be not the Service Delivery Location's Organization.\" <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> - in forge in Encounter.serviceProvider</p>",
        "id": 153890727,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1495440891
    },
    {
        "content": "<p>hello <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> , i want to create ccda on fhir(stu3)for history and physical  using forge. how to add multiple sections to composition profile any suggesions plz.(for example in Observation for BP we have 2 componets. i don't undesrtand how to add to the profile) Thank you.</p>",
        "id": 153892288,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1496656430
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span>, FHIR profiles support a technique called slicing (also supported by Forge). Slicing allows you to define multiple constraints for the Composition.section array element. This is quite typical for ccda composition profiles, so you can probably find some existing (example) profiles online. Otherwise <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> may be able to help you out.</p>",
        "id": 153892302,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1496672711
    },
    {
        "content": "<p>okay. Tnq  <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span></p>",
        "id": 153892358,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1496722954
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  I have created a profile using Forge. But when I am saving that profile it's getting stuck and not working. How can I fix it?<br>\nThank you.</p>",
        "id": 153924476,
        "sender_full_name": "Mounika",
        "timestamp": 1513077636
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193569\">@Mounika</span>, can you provide more detailed information? What do you mean with \"stuck\", does the application hang while saving? Try to disable \"save snapshot\" in the options menu, see if that works.<br>\nNote: to generate the snapshot, Forge tries to resolve all external (profile) references from the containing directory. Forge will report issues from snapshot generation, such as unresolved references.</p>",
        "id": 153924477,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1513077860
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  I have already disabled that option still the application is not responding.</p>",
        "id": 153924479,
        "sender_full_name": "Mounika",
        "timestamp": 1513079253
    },
    {
        "content": "<p>Can you share the profile?</p>",
        "id": 153924480,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1513079340
    },
    {
        "content": "<p>I got the problem fixed. Thank you.</p>",
        "id": 153924485,
        "sender_full_name": "Mounika",
        "timestamp": 1513080571
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 219018331,
        "sender_full_name": "Werner De Mulder",
        "timestamp": 1607288816
    },
    {
        "content": "<p>what FHIR version are you working with?</p>",
        "id": 219028378,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1607295394
    },
    {
        "content": "<p>Hi All, <br>\nI am trying to understanding FHIR OrganizationAffiliation profile extensions to prepare a mapping document. I see that FHIR provided profile excel file downloads without extensions in the file. Where do i find the file with extensions? </p>\n<ul>\n<li>If there is no file with all the extensions , do i need to add extensions that FHIR provided (taking OrganizationAffiliation as example <a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/StructureDefinition-plannet-OrganizationAffiliation.html\">https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/StructureDefinition-plannet-OrganizationAffiliation.html</a>) add them manually or by usnig FORGE? or is there any other way to get the extensions with the profile?</li>\n</ul>",
        "id": 220292309,
        "sender_full_name": "Sree Ram",
        "timestamp": 1608234339
    }
]