[
    {
        "content": "<p>Hi, i have been looking around for an answer to this for a couple of days now with no success so i guess ill give it a shot here.</p>\n<p>Just as an example lets say i made a Profile in Forge based on 'Device' and modify a couple of elements. I am using the Fhir .NET API to build a questionnair from this profile. I use methods from the API such as \"IsPrimitive()\" and \"IsDataType()\" to be able to handle primitive and complex elements from my profile.  What im looking for is if there is a way using the api where i can determine if an complex element is modified or not? For example i loop through my elements and get to 'Identifier', can i with help of the api determine if this is a modified element? </p>\n<p>/Jakob</p>",
        "id": 153985702,
        "sender_full_name": "Jakob Lindblad",
        "timestamp": 1534147450
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196371\">@Jakob Lindblad</span>, I assume that with \"modified\" you mean that you want to determine programmatically if an element is constrained by a profile? Then you need to inspect the associated StructureDefinition.<br>\n<span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span> has been working on the implementation of a new intelligent element navigator in the .NET API library that \"knows\" about the associated StructureDefinition. The new navigator will allow you to easily navigate resource elements with all the associated rich type information. I think the new logic is in a separate feature branch:<br>\n<a href=\"https://github.com/ewoutkramer/fhir-net-api/tree/feature/nav-based-serialization-stu3/\" target=\"_blank\" title=\"https://github.com/ewoutkramer/fhir-net-api/tree/feature/nav-based-serialization-stu3/\">https://github.com/ewoutkramer/fhir-net-api/tree/feature/nav-based-serialization-stu3/</a></p>",
        "id": 153985717,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1534155245
    },
    {
        "content": "<p>That is correct, reason i used \"modified\" is that in Forge constrained elements is marked with the yellow \"modified\" marker. Thank you it appears to be exactly what im looking for.</p>",
        "id": 153985730,
        "sender_full_name": "Jakob Lindblad",
        "timestamp": 1534158365
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196371\">@Jakob Lindblad</span>, FYI Ewout has almost finished the implementation of the new navigator. He is planning to merge the feature branch into develop and publish a new NuGet package of the .NET FHIR API by the end of this week.</p>",
        "id": 153985732,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1534158555
    },
    {
        "content": "<p>Pretty cool stuff! Will also be quite useful in Forge.</p>",
        "id": 153985733,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1534158605
    },
    {
        "content": "<p>Great news!</p>",
        "id": 153985734,
        "sender_full_name": "Jakob Lindblad",
        "timestamp": 1534158621
    },
    {
        "content": "<p>The navigators are completely independent of the source type, i.e. you can uniformly navigate PoCo/Xml/Json resources without worrying about the input format.</p>",
        "id": 153985737,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1534158708
    },
    {
        "content": "<p>Seems im very lucky with the timing of this new features.</p>",
        "id": 153985739,
        "sender_full_name": "Jakob Lindblad",
        "timestamp": 1534159086
    },
    {
        "content": "<p>Whats the link to Questionnaire here?</p>",
        "id": 153985993,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1534201179
    },
    {
        "content": "<p>If you're using the POCOs the metadata for all the properties is available already.<br>\n(I have a routine that converts a StructureDefinition into a draft Questionnaire format)</p>",
        "id": 153985994,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1534201245
    },
    {
        "content": "<p>Not sure what you are asking for but basically what i want to do is to convert profiles i made in Forge into questionnairs  in C#. <br>\nIf there is any quides or examples for doing this out on the web i would really appreciate a link. I find reading the documentation on <a href=\"http://Hl7.org\" target=\"_blank\" title=\"http://Hl7.org\">Hl7.org</a> a bit confusing sometimes, might be because im quite fresh to fhir.</p>",
        "id": 153986288,
        "sender_full_name": "Jakob Lindblad",
        "timestamp": 1534249114
    }
]