[
    {
        "content": "<p>Question for Furore team - any plans to release an update to Forge that is STU3 compliant?</p>",
        "id": 153841988,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1470080302
    },
    {
        "content": "<p>Peter - not till STU3 is finalised. But you can use Forge against STU3 content right now - see the downloads page where you can download a forge version of the definitions. </p>",
        "id": 153842037,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470125445
    },
    {
        "content": "<p>The IG publisher will accept Forge Profiles as inputs for publishing</p>",
        "id": 153842038,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470125461
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191619\">@Peter Bernhardt</span> we are planning to upgrade all our FHIR tools (incl. Forge) to STU3 after the publication of the final spec (start of 2017). Recently, I've been working on some rudimentary support to allow editing custom resources with unknown resource types, so you can use Forge to e.g. design a new STU3 resource. However this has not been publicly released yet.</p>",
        "id": 153842047,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1470135759
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> to what degree do you expect we will be able to use Forge to profile STU3 material in the fall of 2016? Can we load it from some output of the current build?<br>\nI think Grahame actually answered that question above - we use the Forge definitions from the Downloads section and Profile aginst that - right?</p>",
        "id": 153842048,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1470136983
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> support for profiles based on custom resource types will be included in the next release, to be published before September for the HL7 WGM in Baltimore. The upcoming release will still emit DSTU2 profiles, but they are can be transformed to STU3 profiles fairly easy (I think Lloyd has already created an XSLT). So with a little bit of work, this will allow you to design new resource types.</p>",
        "id": 153842049,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1470137393
    },
    {
        "content": "<p>OK but will that allow us to generate Profiles for material in the current build (STU3) or do we have to wait for a formal STU3 version of Forge?</p>",
        "id": 153842050,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1470137520
    },
    {
        "content": "<p>The current public Forge release (v13.2) is still somewhat limited because of limitations in the FHIR .NET API - the old version refuses to (de-)serialize any invalid enum values, including unknown resource types. As a consequence, you cannot use Forge v13.2 to edit profiles on custom/future (STU3) resource types. We have updated the API to be more flexible and forgiving, so it can handle e.g. unknown resource types. However this has not been released yet.</p>",
        "id": 153842051,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1470137607
    },
    {
        "content": "<p>I'm currently working on improved snapshot generation. Once that is stable, I'm planning to publish a new Forge release that includes basic support for handling profiles with custom resource types.</p>",
        "id": 153842052,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1470137691
    },
    {
        "content": "<p>Guesses when that functionality may be available?</p>",
        "id": 153842053,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1470137694
    },
    {
        "content": "<p>Time permitting, I'm planning to publish a minor update this month (august).</p>",
        "id": 153842054,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1470137740
    },
    {
        "content": "<p>Currently I'm not concerned about custom resources but rather about being able to Profile the resources which are in a STU3 build. Am I correct that these changes would support that?</p>",
        "id": 153842055,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1470137758
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> the point is that the new STU3 resource types are unknown to the DSTU2 API. Therefore we need special handling. The current v13.2 Forge release will fail to open such profiles. However the new version will allow you to open and edit them.</p>",
        "id": 153842056,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1470138124
    },
    {
        "content": "<p>Ok thanks</p>",
        "id": 153842057,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1470138183
    },
    {
        "content": "<p>No problem.</p>",
        "id": 153842058,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1470138196
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153842087,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470172148
    },
    {
        "content": "<p>and note, <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>, that the IG publisher supports profiles created by Forge, with no conversion needed. (that is, profiles against STU3 resources created by STU2 based Forge). But as Michel says, right now, you can only right STU3 resources if the resource itself actually exists in STU2</p>",
        "id": 153842088,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470172240
    },
    {
        "content": "<p>OK thnks - so as long as the resource existed in STU2, at any status with any content, the current content definition can be obtained from 'Downloads' and this will allow profiling of current content. </p>",
        "id": 153842142,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1470201035
    },
    {
        "content": "<p>Is it possible to disable real-time validation in Forge?</p>",
        "id": 153852942,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1476662586
    },
    {
        "content": "<p>Hi Vadim, validation is currently always enabled. Great suggestion though, I'll make a note. Thanks!</p>",
        "id": 153852972,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1476694171
    },
    {
        "content": "<p>I'd welcome that, I think it slows things down. I'd be happy to validate on save instead.</p>",
        "id": 153853027,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1476743026
    },
    {
        "content": "<p>Dynamic change tracking takes a lot of CPU cycles - working on improving that ;p</p>",
        "id": 153853028,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1476745363
    }
]