[
    {
        "content": "<p>What fields in conformance are required for forge to connect to a server? <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span></p>",
        "id": 153897439,
        "sender_full_name": "Gaute Brakstad",
        "timestamp": 1500555593
    },
    {
        "content": "<p>Forget it i figured it out. Apperently an error in my conformance as it works perfect as soon as you turn off validation of the conformance option.</p>",
        "id": 153897440,
        "sender_full_name": "Gaute Brakstad",
        "timestamp": 1500555870
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191394\">@Gaute Brakstad</span>, when Forge connects to a FHIR server, it  tries to fetch and verify the server's CapabilityStatement. First, the FHIR .NET API verifies that the library version is compatible to the server FHIR version. Forge  then inspects the CapabilityStatement.rest property and scans for a list item with .mode = \"Server\". Then, if found, Forge inspects the .resource property of the found rest component and scans for the value StructureDefinition. In other words, the target system should identify itself as a FHIR server that supports StructureDefinition resources.<br>\nIf both checks succeed, Forge will continue connecting.</p>",
        "id": 153897441,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1500556398
    },
    {
        "content": "<p>Basicly now it works if i turn off option \"Verify Server Conformance\". Ill run validation on my conformance and see whats the issue.</p>",
        "id": 153897445,
        "sender_full_name": "Gaute Brakstad",
        "timestamp": 1500556964
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191394\">@Gaute Brakstad</span>, please note that an empty CapabilityStatement is valid according to FHIR spec - but Forge will not accept this (unless you disable the application option).<br>\nWe've made server the conformance checks configurable to allow you connect to a (development) FHIR server with an improper capability statement.</p>",
        "id": 153897450,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1500557115
    }
]