[
    {
        "content": "<p>Forge 16.4 for STU3 is now available for download from <a href=\"https://simplifier.net/forge\" target=\"_blank\" title=\"https://simplifier.net/forge\">https://simplifier.net/forge</a>.<br>\nThis new release represents a minor update with a number of FHIR compatibility fixes and some UI improvements.<br>\nUsers of earlier STU3 releases are advised to upgrade to the new version.</p>\n<p>Highlights:</p>\n<ul>\n<li>\n<p>Update the FHIR .NET API library (<a href=\"https://github.com/ewoutkramer/fhir-net-api\" target=\"_blank\" title=\"https://github.com/ewoutkramer/fhir-net-api\">https://github.com/ewoutkramer/fhir-net-api</a>) to 0.93.5-beta2.<br>\n  Includes bug fixes for the snapshot generator and element id generator.</p>\n</li>\n<li>\n<p>Support the ElementDefinition.type.versioning property.<br>\n  This property was introduced by STU3 and is now supported by Forge.</p>\n</li>\n<li>\n<p>Improved support for (complex) element type profiles.<br>\n  Fix invalid validation warnings concerning element type (target) profiles.<br>\n  Forge now re-expands child elements when the type.profile property has changed.<br>\n  Changes in the type.targetProfile property no longer trigger re-expansion.</p>\n</li>\n<li>\n<p>Improved support for choice type elements.<br>\n  Properly rename type choice elements that are a child of a named slice.</p>\n</li>\n<li>\n<p>Support constraints on inherited slice entry.<br>\n  Forge no longer generates (unjustified) validation warnings when a derived profile further constrains the slice entry inherited from a base profile.</p>\n</li>\n<li>\n<p>Named slices do NOT inherit minimum cardinality from base profile.<br>\n  Instead, named slices always have a default minimum cardinality of 0.<br>\n  This ensures that a profile can always introduce one or more optional slicing constraints.</p>\n</li>\n<li>\n<p>Fix invalid change tracking in derived profiles.<br>\n  In some circumstances (specifically when deriving from a sliced profile), the previous release could determine some<br>\n  invalid relationships to elements in the base profile. This would break change tracking; some existing profiling constraints<br>\n  would not be marked with a yellow pen and would be excluded from the serialized output. This has been fixed.</p>\n</li>\n<li>\n<p>Restore editing of ElementDefinition.comment properties.<br>\n  Fix broken edit controls for the .comment property.</p>\n</li>\n<li>\n<p>Serialized output now always includes the StructureDefinition.derivation property.</p>\n</li>\n<li>Structure elements now also provide a context menu, as an alternative for the toolbar.</li>\n<li>Header bar now also displays an image link to <a href=\"http://simplifier.net\" target=\"_blank\" title=\"http://simplifier.net\">http://simplifier.net</a></li>\n<li>Improved memory cache invalidation.<br>\n  When (re-)loading a profile, Forge should now tries to open the most recently saved version.</li>\n</ul>\n<p>Happy profiling!</p>\n<p>Michel Rutten</p>",
        "id": 153899890,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501602812
    },
    {
        "content": "<p>When I open my projects from (Forge 16.1) It gives errors on ALL of the FHIR STU3 things... Did I not do some initialization that I should have?</p>",
        "id": 153899891,
        "sender_full_name": "John Moehrke",
        "timestamp": 1501603315
    },
    {
        "content": "<p>Hi Michel. Just downloaded the new Forge. Definitely fixed some bugs, but still unable to get derived profiles running in the IG publisher without hand tweaks to the XML. For example telecom.system is removed from the first contact, and the first item in the differential is removed.   For example, Forge will remove the following and the IG publisher won't run until I add it back in. :<br>\n &lt;element id=\"Composition\"&gt;<br>\n      &lt;path value=\"Composition\" /&gt;<br>\n    &lt;/element&gt;<br>\nGlad to point you to examples or get on a gotomeeting at some point to show the issues.</p>",
        "id": 153899949,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1501605420
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span>, thank you for the feedback! I'd definitely like to iron out these bugs. It would be very helpful if you can send me some example profiles and steps to reproduce issues, so I can investigate.</p>",
        "id": 153899961,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501605815
    },
    {
        "content": "<p>BTW There's always more bugs to be found, but I didn't want to postpone the release any longer.</p>",
        "id": 153899962,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501605866
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> Emailed you the bug report and example files.</p>",
        "id": 153899973,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1501612799
    },
    {
        "content": "<p>Downloaded and installed '16.4' but upon opening Forge, it still states 16.1. Do I need to uninstall 16.1?</p>",
        "id": 153900106,
        "sender_full_name": "Sufyan Patel",
        "timestamp": 1501663971
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191789\">@Sufyan Patel</span>, the new release displays \"16.4\" in the title bar. If you see anything else, then you're still running an older version.<br>\nAlternatively, you could manually uninstall the current version, then re-install the new release.</p>",
        "id": 153900108,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501664235
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> thank you for the feedback, I received your e-mail. I'll investigate the issue right away.</p>",
        "id": 153900116,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501665774
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> interesting example!</p>\n<p>Forge omits the root element definition from the diff, as it is unconstrained and therefore redundant. The IG validation warning seem to be the result of an incorrect FHIR path expression, as in STU3, the root element definition may be omitted from the diff if it is unconstrained.</p>\n<p>However the disappearing global telecom data points to an issue in the .NET snapshot generator. Currently, the snapshot generator re-uses the same logic used to merge diff &amp; snapshot for merging global metadata. However I think we need to implement different semantics for aggregating global metadata. E.g. some metadata such as contact information probably only applies to the defining profile and should not be inherited by derived profiles.</p>",
        "id": 153900122,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501668562
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> I've managed to fix the issue in Forge. You should recieve an invitation e-mail for a DropBox folder with updated Forge binaries, for testing and evaluation purposes.</p>",
        "id": 153900147,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1501688062
    },
    {
        "content": "<blockquote>\n<p>Forge omits the root element definition from the diff, as it is unconstrained and therefore redundant. The IG validation warning seem to be the result of an incorrect FHIR path expression, as in STU3, the root element definition may be omitted from the diff if it is unconstrained.</p>\n</blockquote>\n<p>Hello <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> - in case it is not already known, I'd just mention another consequence of the missing root element, as mentioned above. A profile without the root element in the differential, when run through the IG Publisher, causes the rendered html to only show the first constraint added and no others. <br>\nI'd be happy to extrapolate should that be needed/helpful.<br>\nFYI- running 16.4.1 Forge and a quite recent IG Publisher from current build (v3.1.0-12288). Thanks</p>",
        "id": 153901827,
        "sender_full_name": "Rob Eastwood",
        "timestamp": 1502404340
    },
    {
        "content": "<p>this is a bug in the IG publisher that has recently reappeared and I will get to as soon as I can</p>",
        "id": 153901835,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502405200
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 153901919,
        "sender_full_name": "Rob Eastwood",
        "timestamp": 1502411384
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192270\">@Rob Eastwood</span>, in STU3 the root element is no longer required in the differential. In practice, I can image that some tools can't handle this (yet). I'm expecting all FHIR tools to eventually support this. So for now, I'll maintain the current behavior in Forge. However if it turns out that this remains an issue for the community, I could implement a configuration option in Forge to always include the root element in the diff output.</p>",
        "id": 153902052,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1502440997
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> - sounds good to leave it as is, given that Grahame will address this in the IG Publisher.</p>",
        "id": 153902279,
        "sender_full_name": "Rob Eastwood",
        "timestamp": 1502674571
    }
]