[
    {
        "content": "<p>I know people will say this is a \"nice to have\" but I think each resource on FHIR should have a complete Example XML posted alongside detailing each element and how it is implemented. Is there any plans for this or does anyone have any complete Examples. It has become a tedious job for me as I am needing it for my current work.</p>",
        "id": 153858879,
        "sender_full_name": "Naminder Soorma",
        "timestamp": 1480411417
    },
    {
        "content": "<p>have you looked at the examples? </p>",
        "id": 153858882,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480411542
    },
    {
        "content": "<p>Yes I have, they only give partial examples of a resource. It may not be a real world example but I am wanting something in a file to demonstrate ALL elements existing.</p>",
        "id": 153858884,
        "sender_full_name": "Naminder Soorma",
        "timestamp": 1480411672
    },
    {
        "content": "<p>sometimes, it's not possible or sensible to demonstrate all elements. The current design rule is that the examples between them should covered every element</p>",
        "id": 153858885,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480411754
    },
    {
        "content": "<p>Ok, well hopefully somebody might already have done it outside the FHIR website as I am finding some resources with only basic examples.</p>",
        "id": 153858886,
        "sender_full_name": "Naminder Soorma",
        "timestamp": 1480411950
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191905\">@Naminder Soorma</span> Examples are part of the quality criteria.  So for a resource to hit FMM level 3, it must have examples such that at least one example exercises every data element in the resource, examples are all clinically appropriate and show the full intended scope of the resource.  So all resources should get to that point.  But for low maturity resources, we don't expect as much - because the resources are still subject to significant change and because writing good examples is hard.</p>",
        "id": 153860743,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1480956616
    }
]