[
    {
        "content": "<p>In the REST API documentation, in the section about transactions and FullUrls it says that:<br>\n\"For updates, the server performs a mapping between the fullUrl specified and the local URL the server knows that instance as, if possible. If the server does not have a mapping for the fullUrl, the server ignores the base URL and attempts an update assuming the base is the same as the server base. \"<br>\nI can't understand what it means. <br>\nCould someone please explain it?<br>\nsource: <a href=\"https://www.hl7.org/fhir/http.html#2.21.0.17.2\" target=\"_blank\" title=\"https://www.hl7.org/fhir/http.html#2.21.0.17.2\">https://www.hl7.org/fhir/http.html#2.21.0.17.2</a></p>",
        "id": 153933759,
        "sender_full_name": "emilio",
        "timestamp": 1517336682
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span></p>",
        "id": 153933819,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517345533
    },
    {
        "content": "<p>Let's say you send a Transaction bundle to server <a href=\"http://fhirserver.com\" target=\"_blank\" title=\"http://fhirserver.com\">http://fhirserver.com</a>, containing an entry for an update on Patient/123. You may expect that the fullUrl of it has to be <a href=\"http://fhirserver.com/Patient/123\" target=\"_blank\" title=\"http://fhirserver.com/Patient/123\">http://fhirserver.com/Patient/123</a>. The first line says that the server will try to map this fullUrl to it's own location of Patient/123, and in this case they match perfectly.<br>\nBut if you want to send this same Transaction to another server - <a href=\"http://differentfhirserver.com\" target=\"_blank\" title=\"http://differentfhirserver.com\">http://differentfhirserver.com</a> - you'd have to adjust the Transaction bundle first: change the fullUrl of the update to <a href=\"http://differentfhirserver.com/Patient/123\" target=\"_blank\" title=\"http://differentfhirserver.com/Patient/123\">http://differentfhirserver.com/Patient/123</a>, so with the base of the other server.<br>\nThis is inconvenient. Therefore the second line says that the other server is allowed to ignore the base altogether and thus interpret the original '<a href=\"http://fhirserver.com/Patient/123\" target=\"_blank\" title=\"http://fhirserver.com/Patient/123\">http://fhirserver.com/Patient/123</a> as a relative link to it's own Patient/123 endpoint.</p>\n<p>Hopefully now the last line of that paragraph makes sense to you: \"This allows the same transaction bundle to be sent to multiple systems without changing the fullUrls for each target.\"</p>\n<p>Note that the fullUrl is not used to determine which resource to update. The resource.entry.url is used for that, and that is supposed to be relative, so it does not have this problem.</p>\n<p>The fullUrl can be understood as the location of the resource after performing the request in the entry. As such you can use it in other entries to reference to the result of the request. Because the server may assign a new id, it will keep a map internally from the fullUrl you specified to the actual location of the resource after processing the request. And use that map for resolving subsequent references in other entries in the bundle.</p>\n<p>But altogether I think this paragraph can be simpler: Since the server is allowed to ignore the base of the fullUrl, it may as well always do so (in the context of a PUT request  entry).</p>",
        "id": 153934116,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1517403392
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span>  thank you!</p>",
        "id": 153934241,
        "sender_full_name": "emilio",
        "timestamp": 1517419437
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span>  Antoher question about this. You wrote that: <br>\n\"Because the server may assign a new id, it will keep a map internally from the fullUrl you specified to the actual location of the resource after processing the request. And use that map for resolving subsequent references in other entries in the bundle.\"<br>\nSo, do I have to check all the <code>references</code> in all the entries and, if it has a corresponding value on my internal map, replace it before saving it?<br>\nAnd, can these replacing values in the map be relative? Or do they have to have the fullUrl format?<br>\ncc <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 153934258,
        "sender_full_name": "emilio",
        "timestamp": 1517419963
    },
    {
        "content": "<p>Yes, you have to replace the references, otherwise you won't be able to resolve them afterwards. We return the references as absolute urls, so you can follow them as they are. But that does not neccessarily mean you have to store them that way.</p>",
        "id": 153934375,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1517433164
    }
]