[
    {
        "content": "<p>Hi there,</p>\n<p>Apologies if this topic has already been discussed but I couldn't find any information regarding this issue.</p>\n<p>The Art. 17 of GDPR requires the service to allow user to delete their data. The current delete operation in FHIR Rest API is a soft delete so it seems like we will need to support hard delete of the resource and its history in order to be GDPR compliant. I didn't see any special rule only applicable to healthcare data so I am assuming hard delete will be a requirement just like for any other personal data.</p>\n<p>Is there any discussion about this already and what is the guidance on supporting GDPR requirements?</p>\n<p>Thanks</p>",
        "id": 153957448,
        "sender_full_name": "Jack Liu",
        "timestamp": 1525915293
    },
    {
        "content": "<p>See the security/privacy stream: <a href=\"#narrow/stream/111-Security-and.20Privacy/topic/GPDR\" title=\"#narrow/stream/111-Security-and.20Privacy/topic/GPDR\">https://chat.fhir.org/#narrow/stream/111-Security-and.20Privacy/topic/GPDR</a></p>",
        "id": 153957493,
        "sender_full_name": "René Spronk",
        "timestamp": 1525937782
    },
    {
        "content": "<p>The RESTful delete is <em>allowed</em> to be a soft delete, but servers are allowed to execute a hard delete if they choose.</p>",
        "id": 153957497,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525945787
    },
    {
        "content": "<p>As Lloyd points out, FHIR has defined a DELETE operation; it is up to systems to look to policy on what DELETE means.  Thus in a GDPR environment, DELETE could be a hard delete, in a different environment DELETE could just set a security tag that prevents most from seeing it.</p>",
        "id": 153957514,
        "sender_full_name": "John Moehrke",
        "timestamp": 1525953220
    },
    {
        "content": "<p>There is an identified gap that it would be nice to have a deleteMe operation that would not just delete the obvious FHIR Resources, but would also forward the request to deleteMe to other organizations that are known to have received information about that data.  This could leverage the AuditEvent for export  events. This is just a thought at this point, no one has started that project.</p>",
        "id": 153957516,
        "sender_full_name": "John Moehrke",
        "timestamp": 1525953366
    },
    {
        "content": "<p>Gaps like this will be the thing we discuss starting at the GDPR track this saturday at FHIR Connectathon.  <a href=\"http://wiki.hl7.org/index.php?title=201805_GDPR\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201805_GDPR\">http://wiki.hl7.org/index.php?title=201805_GDPR</a></p>",
        "id": 153957517,
        "sender_full_name": "John Moehrke",
        "timestamp": 1525953416
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195844\">@Jack Liu</span> keep in mind that from a GDPR perspective, the patient's right to be forgotten is not absolute. There will be some logic to determine which/whether data can be deleted.</p>",
        "id": 153957529,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1525957929
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> I don't know much about security and authentication which seems to be a large chunk of the meeting you are proposing.  I can contribute with practicalities of GDPR implementation, but not sure if that is what you want. Saturday is a hard day for me to attend but depending on the time, I can bring some info.</p>",
        "id": 153957535,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1525958267
    },
    {
        "content": "<p>Thanks all. The information is very useful.</p>",
        "id": 153958137,
        "sender_full_name": "Jack Liu",
        "timestamp": 1526066169
    },
    {
        "content": "<p>I envisage we'll need an operation, e.g. $gdpr-delete to deal with a) the logic of whether one should do a hard delete or not (given local [EU country] legal requirements as to persistence of clinical data) and b) having to notify all third parties that have received a copy of your data that they should also erase the data, based on the AuditEvent record. It's a cascading process: if a citizen requests system A to delete item D, and A is aware the data has been sent/queried by application B, then A should call the $gdpr-delete operation on B. If B is aware it has made the information available to C, then B has to use $gdpr-delete on application C. <br>\nWe'll need to distinguish between a DELETE and a gdpr-delete, one can't and shouldn't assume that all DELETEs will be gdpr erasure requests.</p>",
        "id": 153958267,
        "sender_full_name": "René Spronk",
        "timestamp": 1526112833
    },
    {
        "content": "<p>also need a consent profile, please</p>",
        "id": 153958268,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526112924
    },
    {
        "content": "<p>there's a spread of actions in health, across casual tracking through to real healthcare provision</p>",
        "id": 153958270,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526112950
    },
    {
        "content": "<p>I have a copy of a legal opinion HL7 got on it's own obligations under GDPR</p>",
        "id": 153958271,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526112965
    },
    {
        "content": "<p>which reminds me - we need a way to audit that the patient has been informed about their rights etc</p>",
        "id": 153958272,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526113005
    },
    {
        "content": "<p>a profile on Audit Trail</p>",
        "id": 153958273,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526113015
    },
    {
        "content": "<p>The use case of 'record that the subject has been informed about their rights' is in the Consent resource today.</p>",
        "id": 153958422,
        "sender_full_name": "John Moehrke",
        "timestamp": 1526128070
    },
    {
        "content": "<p>really? why? I don't follow that logic to use the Consent resource</p>",
        "id": 153958423,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526128122
    },
    {
        "content": "<p>Why not?</p>",
        "id": 153958424,
        "sender_full_name": "John Moehrke",
        "timestamp": 1526128138
    },
    {
        "content": "<p>you're just recording that you informed the patient of something. I didn't think that was a proper use of consent</p>",
        "id": 153958431,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526129085
    },
    {
        "content": "<p>It has been discussed. Need it in USA as it is all that HIPAA asks for. I did just add a CR to make it more clear. The recording of the date/time and conditions of the informing act is still useful.</p>",
        "id": 153958432,
        "sender_full_name": "John Moehrke",
        "timestamp": 1526129179
    },
    {
        "content": "<p>Keep in mind that for gdpr, each consent must be explicit and atomic</p>",
        "id": 153958433,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1526129496
    },
    {
        "content": "<p>For each purpose you may have to get consent or not , but that consent works for one purpose.</p>",
        "id": 153958434,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1526129592
    },
    {
        "content": "<p>\"I've read my rights\" does not cover gdpr</p>",
        "id": 153958436,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1526129642
    },
    {
        "content": "<p>There are two different things ... <br>\na) you might need explicit consent for specific PoU and for others you may not because of legal obligation of the processor to process the data (6c)<br>\nb) in any case you have to inform the data subject \"at the time when personal data are obtained\" about controller, PoU, categories of data concerned, ... (12, 13, 14)</p>",
        "id": 153958438,
        "sender_full_name": "Alexander Mense",
        "timestamp": 1526129975
    },
    {
        "content": "<p>Just want to revive this thread, the spec says \"For servers that maintain a version history, the delete interaction does not remove a resource's version history. From a version history respect, deleting a resource is the equivalent of creating a special kind of history entry that has no content and is marked as deleted. Note that there is no support for deleting past versions - see notes on the history interaction.\"  in the delete section, I am wondering what is the rational behind not allowing deleting past versions? It feels to me that occasionally we'll need to delete some of the old versions.</p>",
        "id": 153964343,
        "sender_full_name": "Jie Fan",
        "timestamp": 1527088597
    },
    {
        "content": "<p>most servers will keep a history, in a version control sense. What that makes clear is that the spec version of delete is not the same as GDPR's fantasy of erasure</p>",
        "id": 153964393,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527098718
    },
    {
        "content": "<p>further discussion - see <a href=\"#narrow/stream/111-Security-and.20Privacy/subject/GPDR\" title=\"#narrow/stream/111-Security-and.20Privacy/subject/GPDR\">https://chat.fhir.org/#narrow/stream/111-Security-and.20Privacy/subject/GPDR</a></p>",
        "id": 153964394,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527098744
    },
    {
        "content": "<p>I'm surprised at this statement in the FHIR specification. It seems we have discussed before that the actions taken on a Delete would be dependent on policy. That the FHIR specification simply indicates how a delete is communicated. The FHIR specification should not indicate the functionality. Where is this text specifically, which page?</p>",
        "id": 153964426,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527101974
    },
    {
        "content": "<p>I don't think we're making policy rules there. We don't say a server has to retain the history, just that the interaction is not understood to delete past versions</p>",
        "id": 153964427,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527102056
    },
    {
        "content": "<p>what does that mean? And if it mean what I think you just said, that sounds very different than the text Jie mentions.</p>",
        "id": 153964428,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527102142
    },
    {
        "content": "<p>It's here: <a href=\"https://www.hl7.org/fhir/http.html#delete\" target=\"_blank\" title=\"https://www.hl7.org/fhir/http.html#delete\">https://www.hl7.org/fhir/http.html#delete</a>, the last but one paragraph</p>",
        "id": 153964429,
        "sender_full_name": "Jie Fan",
        "timestamp": 1527102348
    },
    {
        "content": "<p>Sorry for any confusion, but my question was not less about GDPR, I think there should be some way to delete past versions. It's true that most of time one would not want to delete them, but sometimes such an API is useful.</p>",
        "id": 153964430,
        "sender_full_name": "Jie Fan",
        "timestamp": 1527102739
    },
    {
        "content": "<p>I don't think it sounds different.</p>",
        "id": 153964434,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527103354
    },
    {
        "content": "<p>we would have to change the text if we define an $erase operation, which would remove everything. But we should not change delete to do so.</p>",
        "id": 153964435,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527103380
    },
    {
        "content": "<p>I tend to disagree. The paragraph is asserting a specific policy. I don't disagree that this is a very likely policy.  I think Delete is so specific to policy that we need to be clear that the action actually taken will depend on local policy, and authority of the requesting actor.</p>",
        "id": 153964595,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527170500
    },
    {
        "content": "<p>I created <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17254\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17254\">GF#17254</a> to further track this formally to a conclusion.</p>",
        "id": 153964598,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527170982
    },
    {
        "content": "<p>I don't know what you think the policy we're making is</p>",
        "id": 153964628,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527184148
    },
    {
        "content": "<p>we're just clarifying what the meaning of the interaction is</p>",
        "id": 153964629,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527184170
    },
    {
        "content": "<p>John and Grahame, where can I check all the GDPR related progress made so far? I am most interested in the \"right to be forgotten\" part (especially on how it works for historical versions).</p>",
        "id": 153979995,
        "sender_full_name": "Jie Fan",
        "timestamp": 1533083635
    },
    {
        "content": "<p>By the way, how do you like the idea that providing an API at the spec level to purge a specific resource and all its historical versions? A mechanism to handle the \"right to be forgotten\" case is critical to my team in short-term, and we probably need a solution before an official one lands in the spec. We thought about the patient central approach, i.e. remove all resources associated with a patient, and decided it was less ideal because the server cannot accommodate all possible purging logic, in addition, it is hard to maintain reference integrity from an implementation perspective.</p>",
        "id": 153979997,
        "sender_full_name": "Jie Fan",
        "timestamp": 1533084333
    },
    {
        "content": "<p>Just to be sure: why do you want to delete all data from a patient? I ask because the right to be forgotten is not.absolute, and from a gdpr perspective I don't see an obvious case where one would hard delete all patient data.</p>",
        "id": 153979999,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1533084721
    },
    {
        "content": "<p>secondary records need to support purge. We don't have time to add it for R5 anymore, but HAPI already supports it - I believe it's $purge...</p>",
        "id": 153980033,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533097386
    },
    {
        "content": "<p>I wonder if that should record an AuditEvent that the $purge occurred... <span class=\"emoji emoji-1f914\" title=\"thinking face\">:thinking_face:</span></p>",
        "id": 153980087,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1533105416
    },
    {
        "content": "<p>So, although there are Medical Records retention requirements that will keep an EHR data safe... There are still other reasons to want a $deletePatient operation.<br>\n1. First of all, the Medical Records retention period does have a sunset. Even if it is 100 years past death. At some point that Medical Records regulation reason to not Erase expires. At that time one MUST Erase the data. This is mandated by GDPR, when the data is no longer needed for the collection purpose it must be eliminated.<br>\n2. the fact that FHIR is not limited to PurposeOfUse of Treatment... One might be using FHIR as a database to a Research project, and that project might have the patient come back and demand to be Erased.</p>",
        "id": 153980205,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533129424
    },
    {
        "content": "<p>The Security wg would very much like to define this operation. Yes it would include audit requirements, and options for how to record that.</p>",
        "id": 153980207,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533129484
    },
    {
        "content": "<p>However, we need interested parties to engage with us to work on this. I only have so much time available. RIght now is summer, so most Europeans are on holiday so not available to help.</p>",
        "id": 153980209,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533129546
    },
    {
        "content": "<p>Which gets back to the overall progress on GDPR... Europeans are on holiday...</p>",
        "id": 153980210,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533129571
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> why is it too late to get into \"R5\"? It seems we could get it into R4 ballot if we could get someone to propose it. Why has HAPI not proposed their solution?</p>",
        "id": 153980211,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533129666
    },
    {
        "content": "<p>I meant R4. The problem is that I have no idea how we’re going to get all the changes made as it is. There’s just no time...</p>",
        "id": 153980213,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533129822
    },
    {
        "content": "<p>whew... should be okay to work on it in R5 timeframe.  Having someone like HAPI experimenting is good.</p>",
        "id": 153980215,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533130111
    },
    {
        "content": "<p>I advise my gdpr customers to avoid jumping to hard erase. Had to avoid this 'GDPR scare' a few times. Hence my question. I think capability to erase data should be there, but I'd always frame things in terms of \"right to be forgotten is not universal\" and \"anonymize instead of deleting\"..</p>",
        "id": 153980217,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1533131363
    },
    {
        "content": "<p>Since the question was about right to be forgotten, my opinion is - rtbf does not automatically erase all data. I'd advise lots of  caution with that.</p>",
        "id": 153980218,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1533131487
    },
    {
        "content": "<p>Yes, the discussion always starts with calming them down with a reminder that GDPR Erase (and right to be forgotten) do not override other regulated reasons to maintain the data, such as Medical Records retention ...  but you must remind them that is a timeframe with a sunset, and after that sunset  the data must be erased. This is the big news to healthcare, as the data tends to NEVER be erased.</p>",
        "id": 153980220,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533131546
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195841\">@Jie Fan</span> apologies for bursting in. I just hope it is clear that gdpr does not say that \"when the patient wants to delete all their data, the hospital must do a hard delete\". I  actually think specific case will never or seldom happen. Data most likely will have to be retained</p>",
        "id": 153980222,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1533131691
    },
    {
        "content": "<p>Grahame, what do you mean by secondary records?</p>",
        "id": 153980232,
        "sender_full_name": "Jie Fan",
        "timestamp": 1533133074
    },
    {
        "content": "<p>OK, we (Google) would love to engage on this, or even propose our solution, but we have immediate need on such an operation, even R4 might be too late for us. We want to be aligned with the TBD spec solution as much as possible (it'll be great if we could agree on the URL that's going to be used for the solution, but it can be hard as I understand)</p>",
        "id": 153980237,
        "sender_full_name": "Jie Fan",
        "timestamp": 1533133362
    },
    {
        "content": "<p>I suspect Grahame was referring to 'secondary records' as in use of FHIR that is not for \"Treatment\". This is commonly referred to as secondary use.</p>\n<p>Yes, please suggest what you would like it to be. When someone suggests something, it tends to be what is chosen.  Yes, HL7 is a consensus organization, so the consensus might come up with different solution. This is almost always with good reason. Even a poorly written solution put into the ballot could result in a recognized R4 operation (at STU). However delay, and it becomes an R5 project.   Alternative is it becomes an IG with a path to core, which might be a good place for it to be developed. I am not sure what effort is involved for Security WG (my workgroup) to add a Draft level Operation. It seems it should not be too hard.  Something like <a href=\"http://build.fhir.org/resource-operation-convert.html\" target=\"_blank\" title=\"http://build.fhir.org/resource-operation-convert.html\">http://build.fhir.org/resource-operation-convert.html</a>, even without examples.???</p>",
        "id": 153980275,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533134352
    },
    {
        "content": "<p>Interesting that HAPI supports a $purge API. We also settled on the same exact verb i.e. /Patient/[id]/$purge. <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> Can you please confirm if HAPI supports a $purge API? I was not able to see it anywhere in the documentation or code.</p>",
        "id": 153980330,
        "sender_full_name": "Anand Mohan Tumuluri",
        "timestamp": 1533140193
    },
    {
        "content": "<p>FYI the HAPI operation is called <code>$expunge</code>. There is info on how it works here: <a href=\"https://smilecdr.com/docs/current/fhir_repository/deleting_data.html#the-expunge-operation\" target=\"_blank\" title=\"https://smilecdr.com/docs/current/fhir_repository/deleting_data.html#the-expunge-operation\">https://smilecdr.com/docs/current/fhir_repository/deleting_data.html#the-expunge-operation</a> .. still need to backport the documentation into HAPI's doc set, but the operation works the same.</p>",
        "id": 153980336,
        "sender_full_name": "James Agnew",
        "timestamp": 1533142237
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> the $expunge operations fits our use case well, is this what you are going to propose?</p>",
        "id": 153980342,
        "sender_full_name": "Jie Fan",
        "timestamp": 1533146975
    },
    {
        "content": "<p>I wouldn't say that I'm proposing it for anything at this point.. We implemented it in response to a specific need that a group of HAPI FHIR users had.</p>\n<p>It has some quirks for sure (it'll only delete up to N records, and N is capped to avoid overloading the database) and it will not expunge data that hasn't already (and separately) been deleted the normal way. Personally I think these are both good decisions but who knows...</p>\n<p>When is the GDPR connetathon stream happening? Baltimore? Happy to participate.</p>",
        "id": 153980344,
        "sender_full_name": "James Agnew",
        "timestamp": 1533147329
    },
    {
        "content": "<p>it sounds like $expunge is more of a 'empty waste basket'?</p>",
        "id": 153980347,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533149761
    },
    {
        "content": "<p>I think for GDPR  like use-cases the verb $erase seems to be the logical verb for the operation. just because that is the verb used in GDPR. Else $forget, but that seems like a strange one... What kind of parameters? I think we are mostly here talking Patient, would that be too limiting? Or would that help clarity? There would certainly be STU experimentation needed around some of the fringe data, like data that is shared with another patient (mother/child).  There would need to be a declaration of who is responsible for checking that the operation should actually work, or not -- is it the caller or service that is responsible?... lots to STU expriment with</p>",
        "id": 153980349,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533149993
    },
    {
        "content": "<p>$erase is fairly non-ambiguous, and the wording does indeed fit with the gdpr. If &amp; when one needs to do a hard erase (and at some point in the lifecycle of the data one will have to do so), then such an operation makes sense.  </p>\n<p>When one defines what the operation does, that's where the caveats are: if one has a resouce X (not a patient resource) referenced from the EHR of a patient P1, and it's also referenced from the EHR of a patient P2, then X should not be erased.  There may be meta flags on a resource which indicate 'used in ongoing legal proceedings' etc. These are the usual caveats well known in ILM and ECM in general. Note that HAPI's expunge operation doesn't extend to 'all data associated with patient resource P1', but just to 1 Patient resource P1, without following references, so the scope of the operation will have to clarified.</p>",
        "id": 153980863,
        "sender_full_name": "René Spronk",
        "timestamp": 1533198914
    },
    {
        "content": "<p>I don't think we should confuse $erase with a correction of an instance of data. Like found in the right to be forgotten, this can be just one report that is being 'forgotten'. Different from GDPR Erase all traces of an individual including that the individual even existed. Thus it would seem the first proposal for $erase would have one input parameter of the Patient to erase... this then can't be confused with more targeted corrections.   Right?</p>",
        "id": 153980917,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533214347
    },
    {
        "content": "<p>? - my question is whether one should design /Patient/1/$erase in such a way that it only erases Patient/1, or all resources part of the EHR of Patient/1 ? It all depends on whether one wishes the client or the server to have control over this.</p>",
        "id": 153980931,
        "sender_full_name": "René Spronk",
        "timestamp": 1533216061
    },
    {
        "content": "<p>and my response was... the operation is a request by a client to erase all record of that Patient... I say this because this is the GDPR need, and correction of some piece of data can be done with normal CRUD operations on that piece of data. Hence why it s an operation, rather than just a flavor of CRUD (Delete). As an operation it can also do all the softer (yet required) things. As an operation it might also execute site specific implementation such as de-identification rather than delete, or isolating some data needed by some other regulated action while removing visibility for the non-regulated uses... So, I am proposing the hard part be put into the service, not the client. That is my response to your question... Others can provide their response... you can reject my response. i is just a response</p>",
        "id": 153980936,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533217116
    },
    {
        "content": "<p>I'm not a GDPR expert by any means (I'm not sure I even qualify as a newbie), but is there a reason that FHIR needs to support/standardize any of these purge mechanisms? What is the interoperability need here?</p>",
        "id": 153981865,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1533317405
    },
    {
        "content": "<p>For gdpr I would actually look at more atomic operations like finding data related to a patient under a given legal grounds of processing, or data stored at or before a given date...</p>",
        "id": 153981868,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1533318070
    },
    {
        "content": "<p>Patients don't want only to be forgotten, they want to see what data there is, and why</p>",
        "id": 153981869,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1533318308
    },
    {
        "content": "<p>Elliot, the fact that some have found it useful to have an operation does not mean that ALL will find it useful. However if there is some critical set of need, that is what should drive the creation of the operation... The fact it is being discussed shows some interest. I don't think that this is critical evidence of need...  But enough need to discuss is a low bar... someone must still come forward with critical evidence of need, and that has not yet happened.</p>",
        "id": 153981874,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533319456
    },
    {
        "content": "<p>Jose, that is a different thread... don't change the subject of a thread that has a clear purpose.</p>",
        "id": 153981875,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533319484
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Agree. My thought was just that having a purge capability, and being able to invoke a purge in an interoperable way are two distinct things. I understand why some are wanting the capability. I don't yet understand the interoperable cross-system need.</p>",
        "id": 153981878,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1533319716
    },
    {
        "content": "<p>Sure. I am looking at the interoperability needs for gdpr and I am happy Elliott asked what is the need. Discovery is imho a precursor for \"hard delete\". But that is just my advice. Don't want to distract from the hard delete topic, just frame it.</p>",
        "id": 153981880,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1533319799
    },
    {
        "content": "<p>I would agree that what we are talking about could be used beyond GDPR specific Erase need... but then again, we are not done talking... so talk away...    None of this is clear as needing to be a defined operation... it all clearly needs to be done. I simply expect these unusual administrative tasks to be done using some service specific method</p>",
        "id": 153981881,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533319851
    },
    {
        "content": "<p>Jose, why is $everything not sufficient?  <a href=\"http://build.fhir.org/patient-operation-everything.html\" target=\"_blank\" title=\"http://build.fhir.org/patient-operation-everything.html\">http://build.fhir.org/patient-operation-everything.html</a></p>",
        "id": 153981883,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533319977
    },
    {
        "content": "<p>$everything doesn't disambiguate based on purpose of use.  GDPR would need to filter on what's tied to the patient <em>and</em> is outside (or inside?) particular purpose-of-use boundaries.</p>",
        "id": 153981950,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533328841
    },
    {
        "content": "<p>I think the interesting problem therefore isn't so much query, but how to assert/track/expose purpose of use on different records (or data elements - <em>shudder</em>)</p>",
        "id": 153981967,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533331344
    },
    {
        "content": "<p>You can tag each resource with PurposeOfUse if you like...  see discussion on the security-labels page <a href=\"http://build.fhir.org/security-labels.html#core\" target=\"_blank\" title=\"http://build.fhir.org/security-labels.html#core\">http://build.fhir.org/security-labels.html#core</a></p>",
        "id": 153982091,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533394985
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> thanks for this. Are the  Purposes of use coded in the labels? In practice, purposes can range from defined valuesets (\"To validate the reimbursement as defined in internal procedure XXXX\") to ad-hoc purposes (\"i really need this because my boss is away\")</p>",
        "id": 153983736,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1533751154
    },
    {
        "content": "<p>The Lables can carry purposeOfUse vocabulary, yes. When they do this, they are explicitly labeling that data as having been Gathered for that specific PurposeOfUse. More comonly it is understood that a whole FHIR Server is for a specific purposeOfUse, so there isn't redundant labeling. This voabulary can also be put on a Bundle to indicate that the data is being released for that set of PurposeOfUse... And a specific request to access data can carry a set of purposeOfUse to indicate that the intention of the request is to use the data for those purposes.</p>",
        "id": 153983896,
        "sender_full_name": "John Moehrke",
        "timestamp": 1533764832
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> I'm trying to figure out how to use the operation $expunge to physically delete \"test\" resources by type.</p>",
        "id": 220691542,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1608645654
    },
    {
        "content": "<p>start a new thread... and likely this is a HAPI question.</p>",
        "id": 220703261,
        "sender_full_name": "John Moehrke",
        "timestamp": 1608652234
    }
]