[
    {
        "content": "<p>We are a company based in EU and we will have FHIR data from multiple GPDR Data Controllers in our system, e.g. data from multiple GP Practices about the same patient. </p>\n<p>The problem I'm currently thinking about is, if one of these GP Practices were to leave our platform, we need to delete their data. For example let's say we have Resource where v1 was created by the Patient, v2 by GP A and v3 by GP B and now GP B wants to leave the platform.</p>\n<p>When I read the FHIR standard, it seems to me you cannot delete specific versions of a Resources. This causes me to believe that the only solution to this is to actually use multiple Resources, one for each Data Controller, even if they are about the same patient?</p>",
        "id": 244259567,
        "sender_full_name": "Håkan MacLean",
        "timestamp": 1624962081
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 244279840,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624973231
    },
    {
        "content": "<p>Most of the time each GP will be creating unique resource instances. These instances stand alone, although with relationships. They would have clear provenance.  Few resources would be cooperative with multiple GP, those cases would be problematic as you describe. They likely would be patient medical safety risk to tear apart. Which brings up the question I have, what is the intended purpose of this data collection? If it is treatment, then the patient is the biggest factor.</p>",
        "id": 244282569,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624974255
    },
    {
        "content": "<p>The company exists in many countries and provides both digital and physical primary care. Provided we have the patient's consent, we want a clinican to get the full picture of a patient, irrespective of which clinician (i.e. data controller) the patient met with previously. </p>\n<p>So while we need separation for GDPR reasons, we would also like to be able to present a unified view for both patients and clinicians. But I guess we need to solve that using Provenance and/or Linkage resources? I was reading about the last two resources and I was missing a section on when to use which of these two, like there is a <a href=\"https://www.hl7.org/fhir/observation.html#bnr\">Boundaries and Relationships</a> section for Observation.</p>",
        "id": 244283442,
        "sender_full_name": "Håkan MacLean",
        "timestamp": 1624974589
    },
    {
        "content": "<p>What I am hearing is that the \"data from multiple GP Practices about the same patient\" is not available via the FHIR RESTful API on its own from these data sources, it is only through your FHIR server that the information is available, is that correct?</p>",
        "id": 244298484,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1624979826
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"364590\">Håkan MacLean</span> <a href=\"#narrow/stream/179166-implementers/topic/GDPR.20Data.20Controllers.20and.20FHIR/near/244259567\">said</a>:</p>\n<blockquote>\n<p>if one of these GP Practices were to leave our platform, we need to delete their data. For example let's say we have Resource where v1 was created by the Patient, v2 by GP A and v3 by GP B and now GP B wants to leave the platform.</p>\n</blockquote>\n<p>I don't understand the base requirement/assumption: when a GP leaves, why would GDPR say that you'd need to delete their updates to the patient record?</p>",
        "id": 244329169,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624992689
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/GDPR.20Data.20Controllers.20and.20FHIR/near/244329169\">said</a>:</p>\n<blockquote>\n<p>I don't understand the base requirement/assumption: when a GP leaves, why would GDPR say that you'd need to delete their updates to the patient record?</p>\n</blockquote>\n<p>In the example above, GP A works for Health Care Provider A and GP B works for Health Care Provider B. These are separate Data Controllers in the GDPR world. It is my understanding that if one of these Health Care Providers/Data Controllers wants to end their relationship with the company,  we need hand over all the data we have to the Health Care Provider and then remove all the data from our servers.</p>",
        "id": 244333143,
        "sender_full_name": "Håkan MacLean",
        "timestamp": 1624994368
    },
    {
        "content": "<p>If the data needs to be severable, then it seems like the data would be isolated. GP A and GP B wouldn't be able to update the same resources. Slicing out updates to a resource is just going to mangle the data. Audit trail. GP B creates resource, GP A updates, GP B updates based on previous update, GP A updates in B's update. GP B leaves the collective. Do you delete the resource or try to just slice out the updates made by B? That's a mess. If if have a data sharing agreement then as data is updated by GP A then those updates get applied to GP B data but GP B owns their \"copy\", GP A can leave but all that data that was shared is now held by GP B, you can't slice it out. - My opinion, IANAL.</p>",
        "id": 244338060,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1624996595
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"364590\">Håkan MacLean</span> <a href=\"#narrow/stream/179166-implementers/topic/GDPR.20Data.20Controllers.20and.20FHIR/near/244333143\">said</a>:</p>\n<blockquote>\n<p>In the example above, GP A works for Health Care Provider A and GP B works for Health Care Provider B. These are separate Data Controllers in the GDPR world. It is my understanding that if one of these Health Care Providers/Data Controllers wants to end their relationship with the company,  we need hand over all the data we have to the Health Care Provider and then remove all the data from our servers.</p>\n</blockquote>\n<p>I am not a lawyer either but I would challenge this step. IMO it's a common (mis?)interpretation that GDPR gives the absolute write to erasure and erasure means delete everything. <br>\nAssuming your company is only doing statistics and your collected data is not used for benefit of the patient, I'd still say that the GPs provided the data while performing a contract, and unless the contract says they only let you use their data for a while, that data is yours.</p>",
        "id": 244341564,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624997945
    },
    {
        "content": "<p>if the concern is ownership of the data that results from the work performed, I don't see GDPR addressing this.</p>",
        "id": 244341714,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624998008
    },
    {
        "content": "<p>If the concern is the GP's privacy (that their privacy is affected if someone knows that they were the ones seeing the patient), you could cleanse the data in the source e.g. going to the tables / objects that hold the GP's id and replace by 00000Unknown.</p>",
        "id": 244342076,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624998163
    },
    {
        "content": "<p>And if the purpose of the data is actually clinical, the vital interests of the patient and the legitimate interests of your company should perhaps justify that you keep the data just for those purposes. I don't see a GP or anyone asking to delete vital data because of their privacy concerns.</p>",
        "id": 244342489,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624998347
    },
    {
        "content": "<p>I think that should be checked with the lawyers. I just jumped on this because I experienced that rush to overprotect everyone (sometimes everyone except the patient)</p>",
        "id": 244342607,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624998393
    },
    {
        "content": "<p>GDPR also falls down once peers can affect each other's records</p>",
        "id": 244372661,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1625022197
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/179166-implementers/topic/GDPR.20Data.20Controllers.20and.20FHIR/near/244298484\">said</a>:</p>\n<blockquote>\n<p>What I am hearing is that the \"data from multiple GP Practices about the same patient\" is not available via the FHIR RESTful API on its own from these data sources, it is only through your FHIR server that the information is available, is that correct?</p>\n</blockquote>\n<p>This does not necessarily have to be true. We could have FHIR endpoints on each service. However, the <em>same service</em> can handle data from different Health Care Providers (i.e. Data Controllers), so I'm not sure if that is relevant to the question?</p>",
        "id": 244389223,
        "sender_full_name": "Håkan MacLean",
        "timestamp": 1625040064
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179166-implementers/topic/GDPR.20Data.20Controllers.20and.20FHIR/near/244372661\">said</a>:</p>\n<blockquote>\n<p>GDPR also falls down once peers can affect each other's records</p>\n</blockquote>\n<p>Sorry Graham, I failed to understand this. Do you have time to elaborate?</p>",
        "id": 244389290,
        "sender_full_name": "Håkan MacLean",
        "timestamp": 1625040111
    },
    {
        "content": "<p>sure. you have the right to see who accessed and modified your records. And you have the right to withdraw your data, as if you didn't exist. but if you accessed someone else's records, then you can no longer disappear from the database. GDPR generally fails to envisage this situation. There's verious outs in the law, of course</p>",
        "id": 244391892,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1625041830
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179166-implementers/topic/GDPR.20Data.20Controllers.20and.20FHIR/near/244391892\">said</a>:</p>\n<blockquote>\n<p>sure. you have the right to see who accessed and modified your records. And you have the right to withdraw your data, as if you didn't exist. but if you accessed someone else's records, then you can no longer disappear from the database. GDPR generally fails to envisage this situation. There's verious outs in the law, of course</p>\n</blockquote>\n<p>as i understand it you as a <em>data subject</em> have the right to be forgotten (even though health data is slightly different), perform a subject access request (i.e. make a request  to the data controller to show all the data they have on you, including logs of who has accessed your health data) etc. </p>\n<p>but here I am not talking about the data subject wanting their data removed. now it's a <em>data controller</em> (who is storing data about a subject) that wants to <em>move their data</em> from our platform to somewhere else.</p>",
        "id": 244408521,
        "sender_full_name": "Håkan MacLean",
        "timestamp": 1625052307
    },
    {
        "content": "<blockquote>\n<p>This does not necessarily have to be true. We could have FHIR endpoints on each service. However, the same service can handle data from different Health Care Providers (i.e. Data Controllers), so I'm not sure if that is relevant to the question?</p>\n</blockquote>\n<p>I think what is relevant is whether you are simply replicating a FHIR interface to the data of the Data Controller using the data controller's FHIR API  vs. having the data in your system. Having it in your system is presumably the result of some kind of agreement. That agreement is where you could avoid the need to \"delete\" versions of a resource, just because a Data Controller is withdrawing from the service.</p>",
        "id": 244414589,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1625056033
    },
    {
        "content": "<p>Data subject rights are not absolute. In many cases you have the right to request the system to forget about you, but that doesn't mean the system will forget about you.</p>",
        "id": 244441307,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625066732
    },
    {
        "content": "<p>People don't have the right to erase their tax record or criminal record. Or professional record.</p>",
        "id": 244441675,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625066853
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"364590\">@Håkan MacLean</span> if it is a data controller wanting to move their data to somewhere else, that seems far away from Data Access Rights. This seems a case for Privacy by Design - making sure that you preserve the integrity of the records while still granting the possibility to do-whatever-you-need-to-do-contractually. <br>\nSome thoughts: </p>\n<ul>\n<li>If the contract between processor and controller describes a need like \"forget that the doctor that gave this diagnosis to Patient X was Dr Y\", I'd really question that, but it may be legitimate. And you can always anonymize Dr. Y, from which moment you should not need to delete anything.</li>\n<li>If the contract describes the need like \"when the contract is ended, the work that has been done by Dr. Y shall be removed from the platform\", I'd have another check with the lawyers. Normally it doesn't work like that.</li>\n</ul>",
        "id": 244443085,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625067341
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179166-implementers/topic/GDPR.20Data.20Controllers.20and.20FHIR/near/244391892\">said</a>:</p>\n<blockquote>\n<p>And you have the right to withdraw your data, as if you didn't exist.</p>\n</blockquote>\n<p>I'd say \"you have the right to <em>ask to</em> withdraw your data, as if you didn't exist, and there is an obligation to fulfill that request to the maximum possible\".</p>",
        "id": 244443459,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1625067488
    },
    {
        "content": "<p>note, healthcare treatment is a special case carved out of GDPR as part of the requirements to fulfill \"other regulated requirements\". Such as Medical Records Retention, and Medical Safety.  As Jose indicates the subject can request data be erased, but that request does not overrule 'other regulated requirements'.  From my understanding of this stream, this is not a subject request for erasure. This is a data source request to erase. I don't think GDPR has anything to say about this. Where is the GDPR linkage here? The only link I could understand is a business contract, which is where the solution should be.  In that case, Jose also provides the solution I would recommend, and that is to de-identify the source organization identifiers. I would add that these de-identified (organization, provider, location, etc) should be proper Pseudonyms in that there will be legal reason to re-identify (legal challenge).   --- note, i am not a lawyer, and you clearly need  a lawyer.  We are only providing technical solutions that are informed by the FHIR capability and our understanding of GDPR.</p>",
        "id": 245044790,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625581088
    }
]