[
    {
        "content": "<p>What resource should one use for substance administration of products other than medication and immunizations?</p>",
        "id": 169281418,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1561782916
    },
    {
        "content": "<p>Can you give an example of such substance administration?</p>",
        "id": 169284190,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561788745
    },
    {
        "content": "<p>Guessing here --- 'water to flush a wound' or some 'home remedy' that isn't traditionally considered a medication, e.g. butter on a burn ( ;-) )</p>",
        "id": 169296500,
        "sender_full_name": "John Silva",
        "timestamp": 1561813442
    },
    {
        "content": "<p>Actually, I am working on a project that is looking at tobacco use that goes beyond the concept of smoking status. This project wants to know not only the status of tobacco use, but also what kind of tobacco product, the average daily consumption, and the start and end period of usage. The Medication Administration resource seems like a good fit, but tobacco is not a medication.</p>",
        "id": 169313481,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1561845031
    },
    {
        "content": "<p>I think i would prefer those would be a statement, not an administration. Administration is \"here, patient just took this now\", statement is \"patient says they are taking this every day\".</p>",
        "id": 169328777,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561879058
    },
    {
        "content": "<p>(OR an observation but that is not my preference if you want to cross that data with other product use)</p>",
        "id": 169328826,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561879139
    },
    {
        "content": "<p>This fits in the generic Product workflow discussions - IMO we do not have a clear answer yet. This would be something like a \"productUseStatement\".</p>",
        "id": 169328837,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561879171
    },
    {
        "content": "<p>Does this mean that any 'self-administered' substance should be recorded as a statement rather than an administration where the person doing the administration is the patient themself?    These days there are many 'self-administered' substances like tobacco, CBDs, marijuana, and herbals or 'home remedies', etc.  that may not be prescribed by are definitely self-administered.</p>",
        "id": 169339587,
        "sender_full_name": "John Silva",
        "timestamp": 1561900430
    },
    {
        "content": "<p>MedicationStatement would be a reasonable place to record details of that sort of thing (where a simple Observation no longer suffices).  The scope clearly includes \"the recording of non-prescription and/or recreational drugs\".  If you can record frequency and THC content of marijuana smoked, it seems that capturing frequency and nicotine content of cigarettes would be reasonable.  <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> ?</p>",
        "id": 169343148,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561907250
    },
    {
        "content": "<blockquote>\n<p>Does this mean that any 'self-administered' substance should be recorded as a statement rather than an administration where the person doing the administration is the patient themself?    These days there are many 'self-administered' substances like tobacco, CBDs, marijuana, and herbals or 'home remedies', etc.  that may not be prescribed by are definitely self-administered.</p>\n</blockquote>\n<p>Hi <span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> it does not mean that. the boundary between administration and statement is not who administered, but whether you  are registering one single event of administration or a more synthetic \"i take this every day for the last 2 years\"</p>",
        "id": 169349298,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561918862
    },
    {
        "content": "<p>so, for the smoking use case:  if you have an app that tracks times you smoked and for every time you smoke   you click a button - that is an admin. If the app asks \"do you usually smoke\" and if you answer \"every weekend\" then that is a statement</p>",
        "id": 169349379,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561918974
    },
    {
        "content": "<p>btw, MedicationStatement is now MedicationUsage</p>",
        "id": 169349391,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1561919020
    },
    {
        "content": "<p>Medication Statement (or Medication Usage) seems closer to what I am looking for since, in general, the reporting of tobacco use is more often, if not always, a statement of use rather than the administration of tobacco. Thanks. Has any consideration been given to renaming the resource SubstanceUse instead of MedicationUse?</p>",
        "id": 169359024,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1561938631
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196402\">@AbdulMalik Shakir</span>  -- Good question.   In the \"V2 world\" the messages related to this were \"Pharmacy/Treatment ...\" to indicate it was not only for Pharmaceutical use.</p>",
        "id": 169383147,
        "sender_full_name": "John Silva",
        "timestamp": 1561976121
    },
    {
        "content": "<p>Agree with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> MedicationStatement (now called MedicationUsage in the current build) can be used to record non-prescription medications or recreational drug use.  You can record as little or as much \"use\" information as you have access to.</p>",
        "id": 169498462,
        "sender_full_name": "Melva Peters",
        "timestamp": 1562086991
    },
    {
        "content": "<p>A name change hasn't been raised before.  You could add a tracker item if you think it should be considered.</p>",
        "id": 169498621,
        "sender_full_name": "Melva Peters",
        "timestamp": 1562087097
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>  -- I think <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  has already raised this question as part of the overall modeling of Meds and other \"substances\" and I believe name consistency came up in those discussions so I'll not file a tracker item for it.</p>",
        "id": 169501579,
        "sender_full_name": "John Silva",
        "timestamp": 1562089042
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> The question was whether cigarettes would qualify as \"non-prescription medication/recreational drug\".  If so, it might be good to make that explicit - and also note that Observation is typically used to capture aggregations/statistics on such use.</p>",
        "id": 169503200,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562090077
    },
    {
        "content": "<p>in V2 it also encompasses \"treatments\" -- so where would things like homeopathic substances and acupuncture and physical therapy land.   For example in PT they use 'substances' like stretchy rubber bands as part of the treatment; is that a 'substance' used as part of the PT 'administration'?</p>",
        "id": 169520363,
        "sender_full_name": "John Silva",
        "timestamp": 1562102535
    },
    {
        "content": "<p>Acupuncture would likely be captured as a \"procedure\" (like massage, chiropractic, etc.)  The purpose isn't to cause the body to take up a substance where the substance has the effect, but rather to manipulate the body.  (Metal from the acupuncture needles <em>shouldn't</em> be ingested into the body.</p>",
        "id": 169522446,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562104397
    },
    {
        "content": "<p>in addition, needles and rubber bands would not be substances. at best, devices, and that is if there is a need to capture them AND a need to exchange that info.</p>",
        "id": 169523327,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562105303
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  -- thanks for the clarification.  I asked the question to help identify the boundaries between what is a 'substance administration' and a procedure (I kind of guessed acupuncture and PT would be procedures -- good to have clarification).   Jose, I also remembering you bringing up the question about the boundaries between devices and substances; I guess the boundary there (again) is the difference between what is meant to be 'entered into the body' as opposed to what is used in a treatment, e.g. needles or an infusion pump, etc.</p>\n<p>The other thing I'm trying to understand is other examples of 'substance administrations' that are not what we typically think of as 'medication administrations' since the wisdom of the V2 community (years of experience) had 'Pharmacy/Treatment together so they must have some use cases in mind or that these were used for.   Is vaccine administration a 'medication administration' in FHIR or something else (in V2 there were even separate message event types for it if I remember right)?   Are there others you can think of?    Just like this question came up about cigarette use, is it a MedicationUsage (assuming the active ingredient in it is nicotine -- a 'medicinal product'), do we need to clarify what distinguishes a medication from a more general substance use or substance administration?    [Here's a possible example, if a patient came to the ED with severe dehydration and was administered normal saline to restore their fluid level, is that a substance vs a medication administration?   In V2 it would be represented by the same RDE and RAS messages even though we (I) might not think of 'normal saline' as a 'medication']</p>",
        "id": 169553087,
        "sender_full_name": "John Silva",
        "timestamp": 1562147380
    },
    {
        "content": "<p>Some other administered substances that are not obviously medications:</p>\n<ul>\n<li>Sugar candies for hypoglycemia</li>\n<li>Thickened fluids for people with swallowing disorders</li>\n</ul>",
        "id": 169611189,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1562198419
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> i agree, usual split med/device is whether it gets absorbed by the body. but I believe any such boundary is fluid and may change, and my  focus has been that our standard does not rely too much on that boundary - so that in edge cases, implementers do not have to chose between very different approaches.</p>",
        "id": 169619103,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562212770
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> thanks for those cases. Some of these may or not be orderable, or be part of a catalogue, or be registered as administrations or as usages.</p>",
        "id": 169619248,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1562213019
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  - was the 'boundary is fluid\" a pun? :-)    If this is really the case then how does FHIR (community) give guidance on how and when to make the distinction of what to use when?    I guess if everything was a SubstanceAdministration or a SubstanceUsage then it wouldn't matter because 'everything would fit in those buckets' (besides devices - which already have their own bucket).    Maybe this is why the wisdom of the V2 community chose the wording 'Pharmacy/Treatment' since they recognized that the boundary is somewhat 'artificial' or fluid.</p>\n<p>To <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span>  point; if these substances are recorded in an EMR then some implementer has to decide how to represent these in FHIR (assuming a FHIR interface on the EMR).</p>",
        "id": 169635752,
        "sender_full_name": "John Silva",
        "timestamp": 1562235168
    }
]