[
    {
        "content": "<p>Hi, The project I am currently working on uses a number of internal code sets. I understand when using FHIR data items where the data type is \"code\" there is \"Required\" which means the code provided must be in the specified list versus \"Preferred\" etc. However, when the data type is \"string\" as per the country element in the address field it makes sense to allow for the country name in full i.e. Australia or a code.  In the Description and Constraints it states \"can be ISO 3166 2 or  3 letter code\" My question is .... if using a code, must it be the ISO 2 or 3 letter code or can it be the internal code which could be something like 1101. Sorry for the long-winded question but this is just one example where the internal codes would not match either the ISO or HL7 code sets for certain fields so I would like to know what the rules would be in these scenarios. Thanks in advance Julia</p>",
        "id": 161325368,
        "sender_full_name": "Julia Davis",
        "timestamp": 1553156190
    },
    {
        "content": "<p>If you're asserting a binding for a 'string' element, you can still choose required, extensible or preferred.  (You could do example too, but it doesn't make much sense).  If you do a required binding to the 3166 and allow both 2 or 3 character codes, then that's the <em>only</em> thing that will be allowed - anything else will be an error.  If you make it extensible, then it'll be possible to specify other strings, but it'll be an error if any of those strings correspond to a country that is representable using one of the 3166 codes.  If the binding is preferred, you can send whatever you like, but will get a warning if it's not one of the preferred codes.</p>",
        "id": 161360067,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553184365
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Many thanks Lloyd. We are not asserting a binding, it was more a case of the FHIR documentation for the Address field saying \" Country (e.g. can be ISO 3166 2 or 3 letter code)\" in section 2.26.0.13 Address ..... I just don't want us to be breaking any FHIR rules if we use the internal codes.  It sounds as though we wouldn't be breaking rules though, is that true? ... thanks again Julia</p>",
        "id": 161400174,
        "sender_full_name": "Julia Davis",
        "timestamp": 1553206483
    },
    {
        "content": "<p>The key thing is that the string must be recognizable and understandable by human readers.  It needs to be something you can print on an envelope you're sticking in the mail.  For most places that limits you to ISO or the full country name</p>",
        "id": 161402129,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553208258
    },
    {
        "content": "<p>Perfect! Thank you Lloyd</p>",
        "id": 161403811,
        "sender_full_name": "Julia Davis",
        "timestamp": 1553209863
    }
]