[
    {
        "content": "<p>Hi,</p>\n<p>What would be the best way to represent a generic role? By generic role, we know their role, but do not know who they are exactly and this role is actively involved with the patient care. In addition, we do have a list of Practitioners who can take on this role, but we do not know precisely which PRactitioner in this role was involved with the care.</p>\n<p>Think of like PractitionerRole, but instead of just applying to one Practitioner, it applies to many Practitioner resources. </p>\n<p>Say, for an example, we have an Appointment, we know that Prince George Nurse 1 will be seeing the patient, however we do not know which Practitioner is, just the role of Prince George Nurse 1.</p>",
        "id": 183274925,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1576167543
    },
    {
        "content": "<p>Is that the same question as this one <a href=\"#narrow/stream/179166-implementers/topic/One.20role.20for.20many.20Practitioners\" title=\"#narrow/stream/179166-implementers/topic/One.20role.20for.20many.20Practitioners\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/One.20role.20for.20many.20Practitioners</a>?</p>",
        "id": 183275142,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1576167694
    },
    {
        "content": "<p>It is similar, but what I'm trying to figure out is how to represent the generic aspect, where the Practitioner may not be able to be determined, and we only know the role.</p>",
        "id": 183275634,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1576168008
    },
    {
        "content": "<p>Have you looked at CareTeam?</p>",
        "id": 183277498,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1576169104
    },
    {
        "content": "<p>I have yes, but I wasn't sure if this was the best way to represent a generic role of Practitioners.</p>\n<p>We would have <em>Prince George Care Team 1</em> being a CareTeam resource; then as a participant of this CareTeam we would have <em>Prince George Care Team Nurse 1</em> also being a CareTeam resource? Then as part of this CareTeam resource we'd have the participants be the actual Practitioners?</p>\n<p>Like this:</p>\n<p>CareTeam<br>\n-name = 'Prince George Care Team 1'<br>\n-participant = 'Prince George Care Team Nurse 1' (as CareTeam)</p>\n<p>CareTeam<br>\n-name = 'Prince George Care Team Nurse 1'<br>\n-participant = (Practitioners)</p>",
        "id": 183279933,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1576170514
    },
    {
        "content": "<p>IMO, it is like this:<br>\n<a href=\"http://CareTeam.name\" target=\"_blank\" title=\"http://CareTeam.name\">CareTeam.name</a> = Prince George Care Team 1<br>\nCareTeam.participant[x].role = Nurse</p>",
        "id": 183284021,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1576173519
    },
    {
        "content": "<p>How would I from an Appointment or Encounter reference that Nurse then?</p>",
        "id": 183284109,
        "sender_full_name": "Josh Haskins",
        "timestamp": 1576173584
    },
    {
        "content": "<p>Only concrete actor can participate an event. A generic/abstract \"role\" cannot. You cannot say a nurse treated this patient but we don't know who the nurse was.</p>",
        "id": 183285622,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1576174646
    },
    {
        "content": "<p>That's not true.  You can absolutely say something was done by \"a nurse\" or \"a nurse working for XYZ organization\" without indicating exactly who.  PractitionerRole allows you to convey any combination of: specific practitioner, what role they were playing, and/or what organization they were working for.</p>",
        "id": 183286545,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576175217
    },
    {
        "content": "<p>A PractitionerRole can exist without a Practitioner! I didn't know that. From this statement \"Roles/organizations the practitioner is associated with\", it does sound like the roles must be played by a practitioner. Learn something new everyday!</p>",
        "id": 183287983,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1576176001
    },
    {
        "content": "<p>Appointment and CareTeam can both provide the role without a prac or PracRole to cover these cases.</p>",
        "id": 187173134,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1580584454
    }
]