[
    {
        "content": "<p>We normally get master data for Patients from official registries in Norway, and thereby we get the business identifiers for Patients. In addition to people registered in Norway we also need to include patients living abroad who is covered by Norwegian official health insurance due to a family member being registered here. For the patients who does not have an official Norwegian ID we need to establish a unique health ID for them which will be forwarded to the health insurance authorities in their home country.</p>\n<p>Is there something in FHIR which we can use in order to add a generated CDV-compliant business ID at the same time as we create the Patient? If not, is there anyone who have solved a similar issue and can give us some advice?</p>",
        "id": 198433381,
        "sender_full_name": "Ellen Gregusson",
        "timestamp": 1590148995
    },
    {
        "content": "<p>You distinguish the business identifiers by the identifier system. In this case you could have one system for the identifiers of Norwegian residents, and another system for identifiers of the patients who live abroad. The patient resource can have any number of different identifiers. If you are creating a Patient resource via a POST, you simply provide the identifier you have for them, if any.</p>",
        "id": 198444104,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1590155958
    },
    {
        "content": "<p>Is there anything we can use in FHIR to generate the ID, or must we generate it outside FHIR?</p>",
        "id": 198444392,
        "sender_full_name": "Ellen Gregusson",
        "timestamp": 1590156118
    },
    {
        "content": "<p>It must be generated outside FHIR.</p>",
        "id": 198447107,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1590157361
    },
    {
        "content": "<p>Indeed. a business identifier is an identifier that is relevant outside of FHIR that needs to be recorded within the FHIR resource for search/discovery/use reasons. If you don't have an identifier relevant outside of FHIR, then you don't need to use the .identifier element.</p>",
        "id": 198447349,
        "sender_full_name": "John Moehrke",
        "timestamp": 1590157443
    },
    {
        "content": "<p>The reason why we want to generate the identifier in FHIR is because this is the first place we are storing these persons. The ID generated in FHIR will then be distributed to all systems needing this identifier to communicate with the external world.</p>",
        "id": 198456102,
        "sender_full_name": "Ellen Gregusson",
        "timestamp": 1590161982
    },
    {
        "content": "<p>Sounds like there are assumptions and expectations that are not clear in this question.<br>\nHow is a new patient created?<br>\nHow do you assign the business identifier when the patient is a resident?</p>",
        "id": 198460073,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1590163753
    },
    {
        "content": "<p>FHIR is an 'exchange' syntax.  You need the identifiers to persist in the systems at either end of the exchange - so the \"creation\" mechanism needs to be outside the exchange to allow that persistence.</p>",
        "id": 198460508,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590163934
    },
    {
        "content": "<p>Within the EEA/EU all citizens should have a EHIC card, which shows their national insurance id. That'd be the business id to use for those citizens, as that would be the only id understood by their home country. Other countries will have different mechanisms. Only if the business identifier of the insured party in their home country isn't know will one be forced to generated a temporary one. (In Norway the FH identification scheme was supposed to be a solution to this, if I'm not mistaken).<br>\nIn general these are policy/governance issues, outside of the scope of FHIR.</p>",
        "id": 198523809,
        "sender_full_name": "René Spronk",
        "timestamp": 1590220138
    },
    {
        "content": "<p>Do we have a system uri for EHIC card? </p>\n<p>Slightly amused EHIC card is meant to show national insurance number - always thought it would be useful if my EHIC card showed either my English NHS Number or UK National Insurance number. That would be very logical, I think in the UK its a database ID......</p>",
        "id": 198567496,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1590298054
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> ?</p>",
        "id": 198637873,
        "sender_full_name": "René Spronk",
        "timestamp": 1590388574
    },
    {
        "content": "<p>We use the FHIR database as a contact register for people not registered in official registries in Norway. The people we are discussing are registered for the first time in our FHIR contact register. The exchange of data will start with what we have stored. There is no other system which starts the exchange.<br>\nIn EESSI we are required to have a Norwegian ID for these people which we can report to their country of residence.</p>",
        "id": 198740210,
        "sender_full_name": "Ellen Gregusson",
        "timestamp": 1590486631
    },
    {
        "content": "<p>The functionality of \"contact register\" is something that is outside of FHIR. In fact, \"FHIR database\" is just a concept that has any number of implementations, and it is not something that FHIR itself defines.</p>\n<p>In other words, your implementation needs to be enhanced to provide proper contact register functionality, which includes creating and storing the necessary identifier. What FHIR does is, it provides you with the requirements of the features that the identifier needs to have (e.g. system, type), and the ability to share the identifier once the patient record is created.</p>",
        "id": 198756528,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1590497492
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> We never tackled the EHIC issue of arbitrary payers from arbitrary countries with no harmonization in identifying them. In V3 we finally settled for &lt;id nullFlavor=\"UNC\" extension=\"ehic number\"/&gt;.</p>\n<p>For passports this problem was actually tackled by issuing an OID branch for countries and the instruction to attach the ISO country code to it. Presumably you could invent something like that for parts of EHIC like the payer itself: &lt;id root=\"country-oid\" extension=\"BulgarianCompanyId\"/&gt;. This could translate into FHIR too.</p>",
        "id": 198889703,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1590586059
    }
]