[
    {
        "content": "<p>We'd like to use the Location.position element in national NZ project - but the national geocoding service uses a different datum than WGS84, which is specified in the spec. It's impractical to convert to WGS84 at this time, so we need an extension of some sort. </p>\n<p>This could either be a complex extension at the root level, or a modifierExtension on Location.position.</p>\n<p>What's the best approach?</p>",
        "id": 186130345,
        "sender_full_name": "David Hay",
        "timestamp": 1579551464
    },
    {
        "content": "<p>Should we push back against the WGS84 requirement and make the element more generic in R5?  (Still would need an extension in R4)</p>",
        "id": 186136929,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579558350
    },
    {
        "content": "<p>Or have a different extension for the other datum</p>",
        "id": 186342263,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1579735366
    },
    {
        "content": "<p>Which could also be used in the location type too.</p>",
        "id": 186342301,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1579735419
    },
    {
        "content": "<p>Which would be more intuitive implementers?</p>",
        "id": 186345347,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1579737960
    },
    {
        "content": "<p>Assuming that most of the world (especially google) uses WGS84, then leaving that <em>seems</em> most intuitive to other developers to me. In the absense of a strong opinion otherwise, I'd go for a separate extension at the root (rather than the modiferExtension on the element) - that way if we do eventually support WGS84 as well, we can populate Location.position as well...</p>",
        "id": 186832124,
        "sender_full_name": "David Hay",
        "timestamp": 1580247645
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> at Healthpoint we use WGS84 (longitude and latitude) as specified in FHIR. Will that be fine and not to use the NZ extension? Cheers, Sam</p>",
        "id": 238239008,
        "sender_full_name": "Samantha Burchell",
        "timestamp": 1620697691
    },
    {
        "content": "<p>That would be best - if you can be compliant with the spec then so much the better!</p>",
        "id": 238242131,
        "sender_full_name": "David Hay",
        "timestamp": 1620700106
    }
]