[
    {
        "content": "<p>What is the right way to ask a server to get all instances of a resource? The fact that some servers return all instances on GET [base]/[type] doesn't seem to be a thing in the spec</p>",
        "id": 153843972,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1471303721
    },
    {
        "content": "<p>This is described in http.html and search.html (searching with no parameters)<br>\nAnd all servers I know of are doing this, except some don't on the Patient as they expect only parameterized searching</p>",
        "id": 153843975,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1471303880
    },
    {
        "content": "<p>not all servers will do this. </p>",
        "id": 153843976,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471303893
    },
    {
        "content": "<p>I don't see where in http.html and search.html it says that searching with no parameters returns all resources</p>",
        "id": 153843977,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1471304421
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> do you remember something in particular about this? So far it seems to be an implicit behaviour that some servers implement and some don't, and it's not described by the spec or in the conformance statements</p>",
        "id": 153843978,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1471304519
    },
    {
        "content": "<p>It is the search rest operation that you are hitting at that location.<br>\nSo the conformance should indicate that it supports that.<br>\nI don't believe that there is any way of knowing if an open search is permitted or will return content.</p>",
        "id": 153843979,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1471304612
    },
    {
        "content": "<p>Yeah, that's the thing about this open search returning something or nothing. Seems like there isn't a way to explicitly ask for all resources of a particular type, it's left up to this undefined behaviour</p>",
        "id": 153843980,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1471304713
    },
    {
        "content": "<p>That request is the open search. Nothing for the server to declare that it supports it.</p>",
        "id": 153843981,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1471304904
    },
    {
        "content": "<p>Yeah, that's why I'm wondering what is the right way to ask a server to get all instances of a resource, since open search isn't reliable</p>",
        "id": 153843982,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1471305023
    }
]