[
    {
        "content": "<p>Hi All,</p>\n<p>I have a question regarding the implementation of  GetAll resources functionality in the FHIRServer which I am going to build.I am returning a Bundle of resource as response from my FHIRServer to the consumers of GetAllResource functionality.The question is when preparing the resource and adding it to the bundle,if I encounter any issue,should I construct an OperationOutcome resource and add the same to the bundle and proceed with other resource creation or should I halt the resource creation and respond with the current Bundle that has been prepared so far?</p>",
        "id": 166615649,
        "sender_full_name": "Swathy Parameswaran",
        "timestamp": 1558943214
    },
    {
        "content": "<p>If you've encountered an error - i.e. something that prevents the query from being returned, you'll respond with a bare OperationOutcome (no Bundle at all).  If you encountered a warning situation (i.e. the query response might not contain everything it should, but you can still produce a useful response), then you'll continue processing the query to return as much data as possible and will include an OperationOutcome  (search.mode=outcome) with warning(s) indicating any limitations on the set of data returned.</p>",
        "id": 166636270,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558963000
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> it would be really helpful if you can share any documentation link for my reference.</p>",
        "id": 166652363,
        "sender_full_name": "Swathy Parameswaran",
        "timestamp": 1558977374
    },
    {
        "content": "<p>By \"get all\" are you talking about the Patient/$everything operation or just doing a GET on the root endpoint without any filters (except perhaps _since)</p>",
        "id": 166652994,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558978126
    },
    {
        "content": "<p>I mean \"Patient/Everything\"</p>",
        "id": 166688802,
        "sender_full_name": "Swathy Parameswaran",
        "timestamp": 1559027022
    },
    {
        "content": "<p>This section would apply: <a href=\"http://build.fhir.org/operations.html#response\" target=\"_blank\" title=\"http://build.fhir.org/operations.html#response\">http://build.fhir.org/operations.html#response</a></p>",
        "id": 166713131,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559048239
    },
    {
        "content": "<p>And because the operation is effectively performing a search (and is defined as having a search response), this would also apply: <a href=\"http://build.fhir.org/search.html#errors\" target=\"_blank\" title=\"http://build.fhir.org/search.html#errors\">http://build.fhir.org/search.html#errors</a></p>",
        "id": 166713212,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559048296
    }
]