[
    {
        "content": "<p>What would be in your opinion, the best choices/resources in order to reach a fast catch up on fhir implementation using HAPI: courses, books, tutorials...</p>",
        "id": 153865246,
        "sender_full_name": "Roberto Álvarez Sánchez",
        "timestamp": 1483433058
    },
    {
        "content": "<p>see this: <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Teaching\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Teaching\">http://wiki.hl7.org/index.php?title=FHIR_Teaching</a></p>",
        "id": 153865289,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483473231
    },
    {
        "content": "<p>I've kind of happened across this chat group while browsing github and thought it could be useful.<br>\nFHIR is something that is of interest to my company - we develop niche Patient Management Systems for the NHS.<br>\nAs an ISV, where is the best place to \"Get Started\" with any sort of FHIR integration?</p>",
        "id": 154023070,
        "sender_full_name": "Dave Russell",
        "timestamp": 1544008664
    },
    {
        "content": "<p>Hi Dave, welcome to the community!  The FHIR specification website is the main source of information, maybe you can start here: <a href=\"http://hl7.org/fhir/overview-dev.html\" target=\"_blank\" title=\"http://hl7.org/fhir/overview-dev.html\">http://hl7.org/fhir/overview-dev.html</a>.  Also, several parties (amongst them HL7 International - who maintain the FHIR standard) periodically give webinars about the standard.</p>",
        "id": 154023079,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1544011401
    },
    {
        "content": "<p>Thanks Ewout.  Great start.  That will be extremely useful.<br>\nWhat about infrastructure?  For example, If I need my system to receive messages related to a patient's test results, or when certain events happen to a patient how would I go about achieving that? Is there some sort of trigger/webhook integration, or do I just have to poll a server in an \"are they there yet?\" mode ?</p>",
        "id": 154023082,
        "sender_full_name": "Dave Russell",
        "timestamp": 1544013035
    },
    {
        "content": "<p>FHIR not only supports a REST-based paradigm (though that's currently the favorite), but also supports pub/sub - which is probably what you are looking for: <a href=\"http://build.fhir.org/subscription.html\" target=\"_blank\" title=\"http://build.fhir.org/subscription.html\">http://build.fhir.org/subscription.html</a></p>",
        "id": 154023083,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1544013132
    },
    {
        "content": "<p>Ah right.  So a subscription is an entity in the same way as everything else.  Makes perfect sense.  Webhooks would be ideal.<br>\nOn the surface, this seems to be fairly straightforward to implement using modern development tools.  Are there any more hoops you have to go through?  Our company has been IGSoC registered for a few years - need to look at DSaPT imminently.<br>\nIs NHS-related FHIR limited to the N3 / HSCN network? Or can calls be made to/from AWS \"Official\" secured hosting, for example?</p>",
        "id": 154023110,
        "sender_full_name": "Dave Russell",
        "timestamp": 1544022648
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191362\">@Richard Kavanagh</span> might have some idea about that. Or you could ask very uk specific questions like that on the uk stream</p>",
        "id": 154023262,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544040241
    },
    {
        "content": "<p>Hey!</p>\n<p>What is the quickest way to get started and get something running?</p>\n<p>Steve.</p>",
        "id": 155073811,
        "sender_full_name": "Steve",
        "timestamp": 1547460342
    },
    {
        "content": "<p>That depends on what sort of thing you want to get running...  What are you wanting to do?</p>",
        "id": 155086989,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1547475702
    },
    {
        "content": "<p>Please be kind. New to FHIR and trying to wrap my head around things. I'm working in Java with Netbeans and I'm struggling even getting started with a basic import. Can someone help point me to which files I need to import to be able to parse a Patient resource in Java?</p>",
        "id": 161592412,
        "sender_full_name": "Timothy",
        "timestamp": 1553454762
    },
    {
        "content": "<p>Best starting point is the Java reference implementation:  <a href=\"http://build.fhir.org/downloads.html#refimpl\" target=\"_blank\" title=\"http://build.fhir.org/downloads.html#refimpl\">http://build.fhir.org/downloads.html#refimpl</a></p>\n<p>If you have issues getting that running, raise your questions on the <a class=\"stream\" data-stream-id=\"179167\" href=\"/#narrow/stream/179167-hapi\">#hapi</a> stream which is where most of the FHIR Java folks hang out.  (And welcome to the community :))</p>",
        "id": 161593060,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553455760
    }
]