[
    {
        "content": "<p>Given a CodeSystem, is there a way to query a read-only FHIR server for the codes that are in it?</p>\n<p>We have an app for which we would like to show a list of the values in ResearchStudy.category, on the particular FHIR server to which we've connected.   The category Codings on the FHIR server are looking at have a custom CodeSystem, in the resource for which I can see a dozen or so values.  My thought was:</p>\n<p>1) Fetch the first ResearchStudy<br>\n2) Get the CodeSystem resource for the system listed in ResearchStudy.category<br>\n3) Get the list of codes for that CodeSystem</p>\n<p>I am stuck on (3).  CodeSystem does not define $expand, so presumably I need a ValueSet that includes all the codes in the CodeSystem.  Assuming there is such a ValueSet, I don't know how to find it.  There doesn't seem to be a way search for it.</p>",
        "id": 242246770,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1623348228
    },
    {
        "content": "<p>Most likely, for the CodeSystems for which this is practical, I can probably just read from CodeSystem.concept.</p>",
        "id": 242255479,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1623352138
    },
    {
        "content": "<p>If the CapabilityStatement provide profile, you can get the profile and check the valueset binding on the profile and call valueset/$expand to get all codes in the valueset.</p>",
        "id": 242260458,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1623354523
    },
    {
        "content": "<p>For 3), you could try sending a <code>ValueSet/$expand</code> request with a POST body like:</p>\n<div class=\"codehilite\"><pre><span></span><code>{\n  &quot;resourceType&quot;: &quot;ValueSet&quot;,\n  &quot;compose&quot;: {\n    &quot;include&quot;: [{\n      &quot;system&quot;: &quot;http://my.code.system.url&quot;\n    }]\n  }\n}\n</code></pre></div>",
        "id": 244999139,
        "sender_full_name": "Jim Steel",
        "timestamp": 1625552033
    }
]