[
    {
        "content": "<p>Hello all,<br>\nOur whole ig is currently in the same directory but for some reason I get an error while testing an <code>example</code> of the Israeli Core Patient we are currently testing. There are definitely all the codeSystems and valueSets required but I am getting an error. <br>\nHere is the command I use to start the validator:<br>\n<code>java -jar validator_cli.jar c:\\FHIR\\IsraelCoreProfile\\tests\\Patient\\Patient-Tomer.json -version 4.0.1 -ig c:\\FHIR\\IsraelCoreProfile\\fsh-generated\\resources</code></p>\n<p>and here is the response I get: <br>\n<code>*FAILURE*: 3 errors, 0 warnings, 0 notes\n  Error @ Patient.extension[0].value.ofType(CodeableConcept).coding[0] (line 14, col12) : Code System URI 'http://fhir.health.org.il/cs/paying-entity' is unknown so the code cannot be validated for 'http://fhir.health.org.il/cs/paying-entity#103'\n  Error @ Patient.extension[0].value.ofType(CodeableConcept).coding[0] (line 14, col12) : The code system \"http://fhir.health.org.il/cs/paying-entity\" is not known (encountered paired with code = \"103\"); The code provided (http://fhir.health.org.il/cs/paying-entity#103) is not valid in the value set 'All codes known to the system' (from http://tx.fhir.org/r4) for 'http://fhir.health.org.il/cs/paying-entity#103'\n  Error @ Patient.identifier[0].value (line 30, col6) : il-id-chk: 'Israeli ID must be 9-digits with a correct check-digit at the end.' failed</code></p>\n<p>But there are definitely all the files for it to work. Is there some param that I need to ass so that it doesn't look for a terminology service but ONLY for the the local IG files?<br>\nDon't mind the last error. That's fine.</p>",
        "id": 234070329,
        "sender_full_name": "Kippi Bordowitz",
        "timestamp": 1618170084
    },
    {
        "content": "<p>Are the code systems and value sets in question showing up in the 'published' IG?  If not, there must be some issue with them being found.  If they're being published, look for spelling errors, capitalization issues or other minor differences in the URLs.</p>",
        "id": 234085264,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618184343
    }
]