[
    {
        "content": "<p>Has anyone set up a FHIR server using Google's Healthcare API? If so what Proxy did you use for the FHIR store?  From my understanding the Healthcare API uses IAM for security, i'm trying to build a FHIR server where SMART-on-FHIR apps can connect to?  Looking for the best way to set this up.  Thanks.</p>",
        "id": 168437445,
        "sender_full_name": "Justin Jones",
        "timestamp": 1560879706
    },
    {
        "content": "<p>The \"in-house\" GCP solution is to use Apigee as a proxy. We have some oauth2 token generation solution components on github: <a href=\"https://github.com/GoogleCloudPlatform/healthcare-api-token-generator\" target=\"_blank\" title=\"https://github.com/GoogleCloudPlatform/healthcare-api-token-generator\">https://github.com/GoogleCloudPlatform/healthcare-api-token-generator</a> - but this is oriented towards server-side integration rather than patient-facing. More solutions are under development as the API progresses through beta.</p>",
        "id": 168449062,
        "sender_full_name": "Paul Church",
        "timestamp": 1560887396
    },
    {
        "content": "<p>It has been a while since I set it up but I believe all that is required is a Service Account, which can be created in the cloud console.  This required that I be able to create a JWT using the credentials and keys that came along with that account.<br>\nThat was for integration engine, so machine to machine, and perhaps not applicable to apps.</p>",
        "id": 168718036,
        "sender_full_name": "sean zitello",
        "timestamp": 1561152393
    },
    {
        "content": "<p>I noticed the healthcare API is in STU3, do you know if there are any plans to move to R4?  And if so how will that look like to migrate?  with it be changing the v1beta1 to v1beta2?</p>",
        "id": 169050742,
        "sender_full_name": "Justin Jones",
        "timestamp": 1561569332
    },
    {
        "content": "<p>Yes, we are working on adding support for R4 (and DSTU2). The version will be configured when creating a new store with an enum on fhirStores.create - it won't require an API version change. STU3 stores will continue acting the way they do today. A healthcare API dataset can contain a mix of stores using different FHIR versions.</p>\n<p>(For backwards compatibility, v1beta1 will continue defaulting to STU3 if the user doesn't specify a version in fhirStores.create; in future API versions we'll probably force the user to specify something.)</p>",
        "id": 169062229,
        "sender_full_name": "Paul Church",
        "timestamp": 1561571380
    },
    {
        "content": "<p>How are custom resources (e.g., a marketingCampaign) defined in Google Healthcare API?</p>",
        "id": 169494766,
        "sender_full_name": "Jayte Boehler",
        "timestamp": 1562084482
    },
    {
        "content": "<p>We do not support custom resources at the moment - only extensions on spec-defined resources.</p>",
        "id": 169495276,
        "sender_full_name": "Paul Church",
        "timestamp": 1562084851
    },
    {
        "content": "<p>Presumably you could use Basic and a bunch of extensions (which is the conformant way to do custom resources regardless of platform).</p>",
        "id": 169503020,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1562089973
    },
    {
        "content": "<p>That's true, we do support doing this using Basic.</p>",
        "id": 169507560,
        "sender_full_name": "Paul Church",
        "timestamp": 1562092747
    }
]