[
    {
        "content": "<p>Hi, we have built some FHIR API's for GP Consultation Notes to be submitted as a Composition. The Composition has contained resources. We are mainly interested in using the text narrative associated with each resource, but received previous guidance that even though this is the case, it would be more compliant with the intent of FHIR to have contained resources rather than just have text sections for the data. </p>\n<p>The problem is, these contained resources have a bunch of fields on them that we don't really need (and won't foreseeably need) - some of which are mandatory per the standard e.g a CarePlan should have a status,  intent, and subject.. but we already have the status and subject of the composition, so it's pointless (from our perspective) to have it on the CarePlan as well.</p>\n<p>On this basis, our implementers have just left off these fields.... interested in any thoughts on this... has anyone done something similar or encountered a similar challenge? </p>\n<p>Thanks</p>",
        "id": 171647103,
        "sender_full_name": "Holly Gillett",
        "timestamp": 1564005731
    },
    {
        "content": "<p>You can't leave off mandatory fields and be conformant.  If all you care about is the text, just populate the section.text and don't have entries.  (But be aware that means there's no computable information for downstream systems to use.)  Also, be very cautious about using 'contained'.  It's only for use with resources that cannot stand alone.  Typically with a Composition you'd have a Bundle that contained the Composition as well as referenced resources - i.e. you'd have a proper FHIR document.</p>",
        "id": 171649154,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1564008020
    },
    {
        "content": "<p>Hi Holly, you seem to have a similar use case to us. As Lloyd has pointed out you MUST include all mandatory fields (validation will fail otherwise).  Also contained resources should be limited for references such as Author, but IMHO only if you have an unqualified  Practitioner (i.e. in NZ one that does not have a HPI-CPN etc). Also note that here in NZ the MoH has plans to introduce core infrastructure for both NHI and HPI - although how long this will take to be up and running is the question.</p>",
        "id": 171663574,
        "sender_full_name": "David Moorhouse",
        "timestamp": 1564030445
    },
    {
        "content": "<p>seems you are using Composition as a compilation of text notes, in which case are you sure you need the structured resources like CarePlan?</p>",
        "id": 171672605,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1564043221
    }
]