[
    {
        "content": "<p>Can someone help me sorting GraphQL and CQL?<br>\nWhat's the difference? Which is better and why? Are the use cases the same?<br>\nWhich one should I prefer...  etc. <br>\nAll insights are appreciated...</p>",
        "id": 153923114,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1512552205
    },
    {
        "content": "<p>Hi Simone, from my point of view, they cover totally different usecases.</p>\n<p>GraphQL is good at collecting a coherent set of resources by traversing across resource references thus compiling a graph, which can then be turned into a search result, document etc, as a collection of resources. Since it is focused on walking graphs, it has limited capabilities to do queries. It was designed for the Facebook API and allows you to compose, in one fetch, a set of related records and properties in those records to be able to populate your UI. E.g. this would fetch from a \"table\" hero the heroes name, then traverse to his friends, and fetch the name of the heroes friends:</p>\n<div class=\"codehilite\"><pre><span></span>{\n    hero {\n        name\n       friends {\n           name\n       }\n    }\n}\n</pre></div>\n\n\n<p>CQL is human-readable query language to define quality measures and decision support rules. It focuses on defining criteria for concepts in these quality measures, formulated as a query. E.g.:</p>\n<div class=\"codehilite\"><pre><span></span>define &quot;Encounters with overlapping Warfarin and Parenteral Therapies&quot; = \nfrom \n     &quot;Encounters&quot; E, \n     &quot;Warfarin Therapy&quot; W, \n     &quot;Parenteral Therapy&quot; P \n where W. whenGiven starts during E. period \n  and P.whenGiven starts during E. period \n  and duration in days of (W.whenGiven intersect P.whenGiven) 5\n</pre></div>",
        "id": 153923176,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1512568865
    },
    {
        "content": "<p>Thanks for the clarification, <span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span> <br>\nI got confused with all the ...QLs floating around :)</p>",
        "id": 153923462,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1512676904
    }
]