[
    {
        "content": "<p>My team and I are exposing the FHIR Group as a REST service, where we have been able to satisfy most of our needs in a fully FHIR-compliant manner. We have found some difficulty satisfying our requirement to GET a Group and filter the member list based on criteria about the relationships, which are BackboneElement type. We need to page results as well, given that one group could have tens or hundreds of thousands of member entries, and a UI may need to expose these. </p>\n<p>Examples of filter criteria:<br>\n - if period will expire within some unit of time<br>\n - if the given time is within the period<br>\n - if currently active or not<br>\n - truncate to a given offset (front truncation, page start)<br>\n - truncate to a given maximum count (rear truncation, page size)</p>\n<p>We were also looking at the Operation-group-everything, but this is not an official type, and doesn't offer all of the filters we require above.<br>\n<a href=\"http://hl7.org/fhir/2018May/operation-group-everything.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2018May/operation-group-everything.html\">http://hl7.org/fhir/2018May/operation-group-everything.html</a></p>\n<p>However, it does mention something indirectly: \"The key differences between this operation and simply searching the group's patients compartment are...\" which implies there is a way to \"[search] the group's patients compartment,\" which may refer to the member list. We have been unable to identify how this is done from a fully-FHIR-compliant REST API. </p>\n<p>We welcome all input on this topic, as our ability to solve this problem will ultimately decide whether we implement a custom or FHIR-compliant service, and I am very much advocating for the latter.</p>",
        "id": 154011937,
        "sender_full_name": "Erik Greif",
        "timestamp": 1540401038
    },
    {
        "content": "<p>To do something like that, you'd need to define an Operation - essentially generating an anonymous or non-identified Group instance that represents the filtered view.  The 'read' and 'search' operations have to return the resource as it is.  They can filter to only show certain data elements or constrain data based on permissions, but they can't transform the content of the resource.</p>",
        "id": 154012069,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540439782
    },
    {
        "content": "<p>That is a great suggestion... I have posed it to my team, and we will see if that works. In my eyes, I see one custom operation as a \"more compliant\" solution than adding a custom resource with all custom operations. Thank you!</p>",
        "id": 154012641,
        "sender_full_name": "Erik Greif",
        "timestamp": 1540571381
    }
]