[
    {
        "content": "<p>Hi! </p>\n<p>Could a characteristic of a group be the existence in a specific List?</p>\n<p>I (think) I understand the subtle difference between a <a href=\"https://www.hl7.org/fhir/group.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/group.html\">Group</a> of patients and a <a href=\"https://www.hl7.org/fhir/list.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/list.html\">List</a> of patients -- a List is a \"flat\" collection of the same type of resource, a Group can either be a flat collection or a set of characteristics that the member of the group shares. A Group is treated as a whole, a List is a collection.  Further, Group.type restricts the members to only a few types of resources; whereas, List. entry.item is Reference(Any). </p>\n<p>The <a href=\"https://github.com/smart-on-fhir/fhir-bulk-data-docs/blob/master/export.md#endpoint---group-of-patients\" target=\"_blank\" title=\"https://github.com/smart-on-fhir/fhir-bulk-data-docs/blob/master/export.md#endpoint---group-of-patients\">bulk data api</a> uses Group and the quality <a href=\"https://www.hl7.org/fhir/measurereport.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/measurereport.html\">MeasureReport</a> resource uses List, -- which both seem pretty reasonable. Is it possible to unify these, such that a bulk data client could query for the information of patients in a quality measure ?</p>\n<p>Isaac</p>\n<p>p.s. I'm trying to incorporate <span class=\"user-mention\" data-user-id=\"195362\">@Kevin Weaver</span> 's feedback on this <a href=\"https://github.com/smart-on-fhir/fhir-bulk-data-docs/pull/37\" target=\"_blank\" title=\"https://github.com/smart-on-fhir/fhir-bulk-data-docs/pull/37\">bulk data PR</a>.</p>",
        "id": 153969925,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1528997351
    },
    {
        "content": "<p>The other difference is that List is a collector but not an actor.  Groups, on the other hand, can be the subject of events.  (e.g. observations, medication administrations, research studies, etc.)  So a Group is an enumerated and/or characteristic derived collection of entities that are intended to be the subject of one or more actions.  A List is an enumerated currated collection of arbitrary entities that cannot directly be a subject of an action.  I think MeasureReport is incorrect.  It should be using Group because it's talking about the 'subject' of the report.  The only reason I can think they might have gone with List is because they wanted to force enumeration.  <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> , any thoughts?</p>",
        "id": 153969929,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1528998659
    },
    {
        "content": "<p>Yes, we wanted to force enumeration, and we didn't want the added complexity of having to represent the result with a resource that included mechanisms to describe the Group. Having said that, I'd be amenable to using the Group resource with language that in that context, it would be expected to be a strict enumeration Group (no definitional components). I think it would also make sense to extend that back to the Measure to say that Group could be used in a strictly definitional role to define the populations. Perhaps profiles of Group for GroupDefinition and GroupEnumeration?</p>",
        "id": 153969931,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1528998969
    },
    {
        "content": "<p>Or even more strict, separate Group into GroupDefinition and Group?</p>",
        "id": 153969932,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1528999092
    },
    {
        "content": "<p>Either of these two approaches would work great for my specific question / use-case.</p>",
        "id": 153969933,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1528999205
    },
    {
        "content": "<p>I can see the appeal of moving Group.characteristic to a GroupDefinition resource, but wouldn't this further muddy the distinction between List and Group?</p>",
        "id": 153969934,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1528999290
    },
    {
        "content": "<p>Bryn, to ensure that this is more formally considered, should I submit a gforge issue against MeasureReport ?</p>",
        "id": 153969936,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1528999658
    },
    {
        "content": "<p>Yes please, thank you!</p>",
        "id": 153969939,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1528999800
    },
    {
        "content": "<p>As far as the distinction between List and Group, I don't think so, I agree with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> there, Groups are intended to be groups of subjects, and it's such a ubiquitous concept, it makes sense that we'd have more to say about Groups of subjects, than we do about just Lists.</p>",
        "id": 153969940,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1528999878
    },
    {
        "content": "<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17355\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17355\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=17355</a></p>",
        "id": 153969941,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1529000576
    },
    {
        "content": "<p>I don't think Bryn was proposing a distinct resource, just a profile that constrained whether the enumeration had to be present or not</p>",
        "id": 153969945,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529001596
    },
    {
        "content": "<p>I did suggest it as an option. Seems worth considering to me since the distinction comes up in several different places already.</p>",
        "id": 153969962,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1529005882
    },
    {
        "content": "<p>Especially since Group is partly definitional and I can't reference it in the same way I do other definitional resources.</p>",
        "id": 153969963,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1529005970
    },
    {
        "content": "<p>Not a huge deal, but worth considering I think.</p>",
        "id": 153969964,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1529005976
    },
    {
        "content": "<p>It's actually an instance, even if you only describe the criteria.  If you spray all the chickens in barn 5, you don't have to enumerate the chickens.  It's still a specific group of individuals.</p>",
        "id": 153969967,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1529006466
    },
    {
        "content": "<p>I am not in favour of splitting Group into GroupList and GroupDefinition since you often mix both, and the general case, it's valid to have either. That's true for MeasureReport too. I understand that you might want to simplify for a particular case, but I don't see that as a reason for forcing a separation into 2 resources</p>",
        "id": 153970029,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529019540
    }
]