[
    {
        "content": "<p>Hi. How do we convey \"give this medication for 5 mins at x ml/min, then increase the rate to y ml/min, then add this other medication to the mix...?<br>\nRegardless of the dosing changes, we need to group several medicationRequests. Is there a preferred way to do this? So far I found<br>\na) medicationrequest.group Identifier is the same for all the requests. the client will use this to understand they are together.<br>\nb) we have a requestGroup that groups all the requests)<br>\n...?<br>\nI am thinking of opting for a) because I don't see a need to have a requestgroup. Besides, I think RequestGroup seems a bit definitional which is not what I need.Complex medication administration requets</p>",
        "id": 153904677,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1504722123
    },
    {
        "content": "<p>MedicationRequest.dosageInstruction can repeat and a sequence can be assigned to each.  So it can all be done within one order.</p>",
        "id": 153904684,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504722957
    },
    {
        "content": "<p>Though mixing medications is a bit more problematic - for that you may need to use RequestGroup</p>",
        "id": 153904685,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504722986
    },
    {
        "content": "<p>Isn't it sufficient to put them with a common GroupIdentifier?</p>",
        "id": 153904695,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1504724378
    },
    {
        "content": "<p>A common group identifier means that they're all independent with their own statuses and can be cancelled, suspended, etc. separately.  If that's what you need, then yes, groupIdentifier will work.</p>",
        "id": 153904706,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504727406
    },
    {
        "content": "<p>We want to be able to stop medication #2 independently of medication #1,  etc. I think for now  GroupIdentifier will work.</p>",
        "id": 153904716,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1504728392
    }
]