[
    {
        "content": "<p>While Questionnaire supports grouping of Questions with in it self. But is there nay way we can represent group / hierarchy of Questionnaires.</p>",
        "id": 209503700,
        "sender_full_name": "Shubham Sharma",
        "timestamp": 1599654506
    },
    {
        "content": "<p>We have an approved proposal for allowing one questionnaire to 'import' questions from another Questionnaire that will be part of the SDC implementation guide when it's approved.  Is that what you mean?</p>",
        "id": 209512920,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599659524
    },
    {
        "content": "<p>Thanks Lloyd, Can you point me to the draft of same.<br>\nYes use is some what similar where A Set of Questions can be asked independently as well as with in combination of other set of Questions.</p>",
        "id": 209596728,
        "sender_full_name": "Shubham Sharma",
        "timestamp": 1599714631
    },
    {
        "content": "<p>The tracker item is <a href=\"http://jira.hl7.org/browse/FHIR-22356\">FHIR#22356</a></p>",
        "id": 209597363,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599715472
    },
    {
        "content": "<p>Thanks Lloyd..,<br>\nWhile looking at SDC Base Questionnaire Profile came across 'performerType' extension which states who can record answers for this Questionnaire.  <br>\nWe had similar need on Questionnaire Response to know who had actually provided the answer. <br>\nAs many time applications does not store identity on patient's relative who had answered the questions excepts a flag that it is answered by a relative instead of Patient. <br>\n'QuestionnaireResponse.source' is of Reference type as demands some sort of identity.<br>\nIs there any proposal to include  something similar to 'performerType' to be included on QuestionnaireResponse' as well.</p>",
        "id": 209665524,
        "sender_full_name": "Shubham Sharma",
        "timestamp": 1599752396
    },
    {
        "content": "<p>If you just wanted to indicate Patient vs. Relative without indicating identity, you could just populate Reference.type.  (You could also populate Reference.display to say \"Aunt Sue\" without any further identifying information.)</p>",
        "id": 209673526,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599755660
    },
    {
        "content": "<p>Thanks Reference.type works for us.</p>",
        "id": 209687979,
        "sender_full_name": "Shubham Sharma",
        "timestamp": 1599762057
    },
    {
        "content": "<p>Also i guess we need to populate the display with default text as one of the reference, identifier or display is must.</p>",
        "id": 209688298,
        "sender_full_name": "Shubham Sharma",
        "timestamp": 1599762200
    }
]