[
    {
        "content": "<p>Has anyone started to use the <a href=\"http://github.com/google/fhir\" title=\"http://github.com/google/fhir\">github.com/google/fhir</a> project to generate fhir objects that can marshal to json OR gRPC?  I did this and it generated 680MB of jars for java :( :( as it generates the entire FHIR spec.  This is a bit more than we want for our slice of FHIR.  Curious if anyone has open sourced *.proto files(which compile to any language)?</p>",
        "id": 195711368,
        "sender_full_name": "Dean Hiller",
        "timestamp": 1588168228
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196561\">@Nick George</span></p>",
        "id": 195715206,
        "sender_full_name": "Paul Church",
        "timestamp": 1588169531
    },
    {
        "content": "<p>Has anyone used google healthcare api yet and talk from Java to that api?  I am wondering what others are using while I look into googles gRPC FHIR to talk to that api.</p>",
        "id": 195734383,
        "sender_full_name": "Dean Hiller",
        "timestamp": 1588176895
    },
    {
        "content": "<p>We haven't published the gRPC service protos for the FHIR API yet. Although the beta documentation refers to it, that API endpoint is not really usable. We are collecting customer interest in FHIR gRPC but the product is mainly focused on the standards compliant REST API.</p>\n<p>There are generated Java client libraries that apply to all GCP REST APIs including FHIR: <a href=\"https://github.com/googleapis/google-api-java-client-services\" title=\"https://github.com/googleapis/google-api-java-client-services\">https://github.com/googleapis/google-api-java-client-services</a> (or you can use any FHIR client library)</p>",
        "id": 195736974,
        "sender_full_name": "Paul Church",
        "timestamp": 1588178114
    },
    {
        "content": "<p>ok, thanks <span class=\"user-mention\" data-user-id=\"197072\">@Paul Church</span> !!!!  I did so much digging and even built the <a href=\"http://github.com/google/fhir\" title=\"http://github.com/google/fhir\">github.com/google/fhir</a> project which ended up with 680 megs of around 600 FHIR jars (a bit toooo large).  I am trying to figure out how we can use a 'slice' of FHIR in our microservices.  I would rather avoid a bunch of work creating *.proto files to talk FHIR and HAPI is really java only.  Do you know if the fhir *.proto's will be more officially released at some point(even if just in beta form?).  Also, do you know if there is a way to slice and dice it so people can import slices of it OR are all the *.proto files a massive web pulling each other in?  thanks much!!! Dean.  Oh, will google be at the connectathon to further discuss?  Is there a track I can join?  NOTE: I am in the process of adding a gRPC json plugin to the webpieces webserver.  Adding straight gRPC is actually more difficult for some reason.</p>",
        "id": 195753483,
        "sender_full_name": "Dean Hiller",
        "timestamp": 1588186158
    },
    {
        "content": "<p>There are .proto files in the repo - is this what you are looking for? <a href=\"https://github.com/google/fhir/tree/master/proto/r4/core/resources\" title=\"https://github.com/google/fhir/tree/master/proto/r4/core/resources\">https://github.com/google/fhir/tree/master/proto/r4/core/resources</a></p>\n<p>The R4 proto files are separate per resource, you don't get the whole web by importing one. STU3 is one big monolithic proto as that was how the generator used to work.</p>",
        "id": 195754283,
        "sender_full_name": "Paul Church",
        "timestamp": 1588186544
    },
    {
        "content": "<p>We'll have some people at the connectathon but there isn't a track related to protos.</p>",
        "id": 195754430,
        "sender_full_name": "Paul Church",
        "timestamp": 1588186604
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197072\">@Paul Church</span> actually, I got to the point of running \"bazel build //java:json_format\" BUT realized I have 'no idea' what target I should actually build for what I need.  We need just the organization/practitioner/etc as seen in the image at the bottom of this page <a href=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/index.html\" title=\"https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/index.html\">https://build.fhir.org/ig/HL7/davinci-pdex-plan-net/index.html</a></p>\n<p>Is there a command I can run to 'clear' out this 680MB of jars and just generate that section?  I would LOVE to start using it and bring it to the connectathon in a  couple weeks but really am hoping for more &lt;100MB or even less if possible.</p>",
        "id": 195756682,
        "sender_full_name": "Dean Hiller",
        "timestamp": 1588187608
    },
    {
        "content": "<p>\"bazel clean\" will clear out the output. I'm not personally familiar with how the java part of the repo is organized so I'm not sure which targets to suggest for what you need.</p>",
        "id": 195760134,
        "sender_full_name": "Paul Church",
        "timestamp": 1588189256
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197072\">@Paul Church</span> Do you perhaps know someone that might know which target I want for that link?  If I can get a hold of that, I may be able to bring something to this upcoming connectathon based on google grpc fhir which would ROCK.  If not, totally understand and either way, THANKS for all the help here!!!</p>",
        "id": 195775564,
        "sender_full_name": "Dean Hiller",
        "timestamp": 1588197470
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197072\">@Paul Church</span> or perhaps you can pass my email along.  <a href=\"mailto:dean@orderlyhealth.com\" title=\"mailto:dean@orderlyhealth.com\">dean@orderlyhealth.com</a></p>",
        "id": 195775624,
        "sender_full_name": "Dean Hiller",
        "timestamp": 1588197489
    },
    {
        "content": "<p>I'll see what I can track down for you.</p>",
        "id": 195864267,
        "sender_full_name": "Paul Church",
        "timestamp": 1588263780
    }
]