[
    {
        "content": "<p>Hi</p>\n<p>I am attempting to model a FHIR profile - a visit by a health visitor which occurs after 12 months of a baby being born. It consists of a number of observations about the home (still breastfeeding, smoking in the environment etc) as well as a number of general questions about baby behaviour and development.</p>\n<p>We use snomed ct coding, and therefore the online browsers for snomed provide quite a bit of guidance in how we should possible construct the profiles (usually in the description of the snomed coded item).</p>\n<p>So, looking up snomed for events similar to this - I noticed that it references a 12 month visit as a procedure. </p>\n<p>Therefore I have attempted to model this process as a procedure based on this, but am becoming a bit unstuck.<br>\nWhat I have: a Procedure for the 12 month visit, an Encounter describing the attributes of the visit (location, dates, practitioner etc); a series of observations as above, and a QuestionnaireResponse for the (rather large) set of supplementary questions/answers for this event. </p>\n<p>Is the procedure the right thing to use here? If so, how do I  \"link\" the observations to the procedure - do I need a DiagnosticReport which contains the observations? Reading the guidance on the FHIR resources page I'm not so certain this is correct.</p>\n<p>Hopefully this makes sense - maybe Procedure is not the right way to go - any guidance would be appreciated</p>\n<p>Thanks<br>\nDuncan</p>",
        "id": 153862957,
        "sender_full_name": "Duncan McLean",
        "timestamp": 1481480555
    },
    {
        "content": "<p>I would just use Encounter, and then reference the Encounter from the Observations made during that encounter. Same for the QuestionnaireResponse...</p>",
        "id": 153862958,
        "sender_full_name": "David Hay",
        "timestamp": 1481482470
    },
    {
        "content": "<p>SNOMED's nomenclature doesn't necessarily always align with FHIR's.  It's important to be guided by the HL7 resource definitions and only then look at what terminology you're using.</p>",
        "id": 153862963,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481486100
    },
    {
        "content": "<p>Great - thanks for your quick responses.</p>\n<p>Duncan</p>",
        "id": 153863101,
        "sender_full_name": "Duncan McLean",
        "timestamp": 1481532757
    },
    {
        "content": "<p>We are developing an application to capture diagnostic information, such as, blood pressure, blood glucose, stethoscopy, dermoscopy etc. We use Observation and Media to record the captured data, ServiceRequest to request data and DiagnosticReport to summarise the data. </p>\n<p>However, we are unsure of,  how and if, we should use the Procedure resource. The docs says \"...an observation does not require an explicit representation of the procedure...\" and  \"...The Procedure record is only necessary when there is a need to capture information about the physical intervention...\"</p>\n<p>So, in what situations would it be appropriate to use Procedures? <br>\nAny help or guidance is greatly appreciated</p>",
        "id": 240904740,
        "sender_full_name": "Joakim Antus",
        "timestamp": 1622533055
    },
    {
        "content": "<p>Procedure would be used by some systems to represent the process of taking a biopsy or other invasive processes that are used in the process of making an Observation</p>",
        "id": 240945532,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622555882
    },
    {
        "content": "<p>Thank you for the clarification!</p>\n<p>Joakim</p>",
        "id": 241115167,
        "sender_full_name": "Joakim Antus",
        "timestamp": 1622619804
    }
]