[
    {
        "content": "<p>Our software has the  ability to \"merge\" patient records.  For example, say two records exist (patient-5 and patient-10) and they both refer to the same \"real\" person (Bob Smith, who happened to visit two different locations in your large hospital system but for reasons unknown his existing record was not found when visiting the second location).  Our software allows you to merge all patient data onto one record and deactivate the other (i.e. all data for Bob Smith on record patient-5 would be moved to record patient-10, record patient-5 would be deactivated, and the patient-10 would be the ongoing source of truth for Bob Smith).  Let's say a request is then later made for patient-5 via FHIR.  Does FHIR support the concept of a redirect, or even an HTTP 301 type response that points to where a resource now lives (if it moved)?  It's not quite appropriate to simply throw a 404, since, although patient-5 has been deleted/deactivated, the data the user actually cared about retrieving really just lives elsewhere.  I haven't been able to find much guidance about this use case.  Suggestions?</p>",
        "id": 229928386,
        "sender_full_name": "Aaron Moronez",
        "timestamp": 1615497819
    },
    {
        "content": "<p>This is what we have in the spec: <a href=\"https://build.fhir.org/patient.html#merge\">https://build.fhir.org/patient.html#merge</a> <br>\nIn short - no standard behavior, at least not yet.  You can use <a href=\"http://Patient.link\">Patient.link</a> as part of the merge process.  However, what happens to references and queries is currently up to individual implementers to decide</p>",
        "id": 229930233,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615498515
    },
    {
        "content": "<p>And practically, I agree 301 would likely be more useful than 404.  Event though not listed explicitly here <a href=\"https://www.hl7.org/fhir/http.html\">https://www.hl7.org/fhir/http.html</a> (table at bottom of page), at least allowed per the text below the page.</p>",
        "id": 229934012,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1615499939
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <a href=\"http://Patient.link\">Patient.link</a> would seem like a possibility, but in this case, the patient-5 record is also deleted/deactivated.  You wouldn't actually be able to retrieve patient-5 in order to see the link to get to patient-10.</p>\n<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> Yea, since 301 isn't explicitly referenced, we were hesitant to use it.  We were considering using a 410, since the merged record is deleted/activated, and putting the new location in the OperationOutcome.issue.expression returned with that error (and documenting that use case for our users).</p>",
        "id": 230036455,
        "sender_full_name": "Aaron Moronez",
        "timestamp": 1615559014
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> We could also plow forward with using a proper 301 and also document that workflow so our users know to grab the new resource location from the 301 response header (and we'd probably throw it somewhere in the OperationOutcome as well).</p>",
        "id": 230038836,
        "sender_full_name": "Aaron Moronez",
        "timestamp": 1615559863
    },
    {
        "content": "<p>Rather than 'deleting' you could mark Patient.active as 'false' - meaning it won't show up in searches for active patients, but will still manifest as a linked Patient.</p>",
        "id": 230039720,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615560195
    }
]