[
    {
        "content": "<p>If I have a system that works internally with metric units (meter, Celsius, kilogram, .. ) and I have sensor device / application that report Observations like weight / length / temperature in US / imperial units (feet/inch, Fahrenheit, pounds), what would be a good way to model this using FHIR Observation resources?<br>\nNote that a single observation includes a CodeableConcept that can have multiple codings, but that an Observation can only have a single value.<br>\nOptions considered are:<br>\n- creating two Observation resources, one with the original unit / quantity and one with the converted unit / quantity - using the \"related\" attribute with relation type \"derived-from\" or \"replaces\".<br>\n- creating an Observation resource with the internally used unit / quantity and a component with the original unit / quantity.<br>\n- creating an profile/extension by adding \"originalValue\" to an Observation resource.</p>\n<p>Is this a general enough problem to be solved in the standard FHIR resources?<br>\nWhat would be seen as advantages / disadvantages of the listed options?</p>",
        "id": 153912572,
        "sender_full_name": "Erik Moll",
        "timestamp": 1507190628
    },
    {
        "content": "<p>You could also choose to persist the device output data in the original format and perform queries in another format using a library such Fhir.Metrics:<br>\n<a href=\"https://github.com/furore-fhir/Fhir.Metrics\" target=\"_blank\" title=\"https://github.com/furore-fhir/Fhir.Metrics\">https://github.com/furore-fhir/Fhir.Metrics</a></p>",
        "id": 153912573,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1507191197
    },
    {
        "content": "<p>That is certainly an option as well, but that would imply that the needed conversions are done each time the observation is included in a query.<br>\nAlso note that the mentioned library does NOT include all imperial to metric conversions (yet). <br>\nWe would like to convert only once and keep the original observation as well.</p>",
        "id": 153912611,
        "sender_full_name": "Erik Moll",
        "timestamp": 1507210439
    },
    {
        "content": "<p>This doesn't answer you're question, but I think all Observations internally should use the metric system by default, or whatever the recommended units are if the Observation uses LOINC. For example, LOINC recommends degrees Celsius for Body Temperature.</p>\n<p>I'm in the US. Conversion of those units into feet, inches, pounds, Fahrenheit, etc -- should all be done by display or export. Storage should be consistent.</p>",
        "id": 153912643,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1507217161
    },
    {
        "content": "<p>Michel and I  talked about this a bit in San Diego and I'm in favor of his suggestion is using a retrieval method that does the conversion from the original.   Perhaps a set standard search parameter  like _metric or  _usunits  ( which could be part of us-core) -_impunits  ( what is a  stone anyway?)</p>",
        "id": 153912655,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507222108
    },
    {
        "content": "<p>I don't like any of the choices above but rather this one:  <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13988\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13988\">GF#13988</a></p>",
        "id": 153912656,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507222743
    },
    {
        "content": "<p>I like the gforge option as well - an extension. We've seen profiles that try to get servers to do conversions to standards on output. This seems like a great idea until you try to put it into practice. For eg, many apps want to see exactly what's in the source (for example, a doctor switching from his native app to a SMART app that shows the same data but does additional work). Also, if you convert going out, writing becomes an issue - trying to determine if the client was trying to modify the value and trying to determine what units you should record it in the source system</p>",
        "id": 153912659,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1507225246
    },
    {
        "content": "<p>While I would love to say that all source systems should be metric, I don't see that happening anytime soon :)</p>",
        "id": 153912660,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1507225264
    },
    {
        "content": "<p>And even then - do you prefer kg, g, etc</p>",
        "id": 153912661,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1507225276
    },
    {
        "content": "<p>Not to mention all the fun decimal precision issues you may encounter when converting and trying to compare...</p>",
        "id": 153912662,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1507225301
    },
    {
        "content": "<p>The extension is nice because it allows you to return the source of truth as well as conversions</p>",
        "id": 153912663,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1507225321
    },
    {
        "content": "<p>hmm. I really should have done this already. I've just added a new extension <a href=\"http://hl7.org/fhir/StructureDefinition/iso21090-PQ-translation\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/iso21090-PQ-translation\">http://hl7.org/fhir/StructureDefinition/iso21090-PQ-translation</a> that you can use in a Quantity to add another quantity that's a translation of the same quantity to a different set of units</p>",
        "id": 153912682,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507233291
    },
    {
        "content": "<p>(should be visible in the next 20min or so)</p>",
        "id": 153912683,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507233300
    },
    {
        "content": "<p>sounds like a good way to move ahead on it</p>",
        "id": 153912684,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1507233359
    },
    {
        "content": "<p>Erik,<br>\nUnfortunately the units associated with the valueQuantity, in spite of being a code, does not support multiple translations to other coding systems like the coding element. That being said, I would upload the unit code the device provides. That is what is done, in any case, in the PCHA PHD upload profiles. It is then up to the readers to make the necessary transition of the value and units to the realm of interest.</p>\n<div class=\"codehilite\"><pre><span></span>\n</pre></div>",
        "id": 153912685,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1507233866
    },
    {
        "content": "<p>I assume that if you were to do a search for a quantity with a certain value/range/etc. you'd want it to search the quantity as well as the extension. </p>\n<p>(Actually, from a user point of view, I'd probably want it to search for a value in the range I give in my choice of units, regardless of the element's choice of units or presence of an extension. I say 20-30 kg, and it matches anything between 20 and 30 kg, 20,000 and 30,000 g, 44 and 66 lbs, or 3.1 to 4.7 stone. Ouch.)</p>",
        "id": 153912758,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507240100
    },
    {
        "content": "<p>on my server, the server automatically normalises units when you search for a quantity.</p>",
        "id": 153912761,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507240237
    },
    {
        "content": "<p>but only ucum units</p>",
        "id": 153912762,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507240246
    },
    {
        "content": "<p>grahame's behavior is documented here: <a href=\"http://build.fhir.org/search.html#quantity\" target=\"_blank\" title=\"http://build.fhir.org/search.html#quantity\">http://build.fhir.org/search.html#quantity</a></p>\n<p>\"\"The search processor may choose to perform a search based on canonical units (e.g. any value where the units can be converted to a value in mg in the case above).</p>",
        "id": 153912771,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507240919
    },
    {
        "content": "<p>For .NET-based implementations, you can leverage the Fhir.Metrics library to perform unit conversions:<br>\n<a href=\"https://github.com/furore-fhir/Fhir.Metrics\" target=\"_blank\" title=\"https://github.com/furore-fhir/Fhir.Metrics\">https://github.com/furore-fhir/Fhir.Metrics</a><br>\nUsually, I think a user would expect a FHIR server to be able to return submitted resources as-is, i.e. with the original values in the original units (esp. for audit logs). However this expectation does not prevent a server from calculating and storing conversions on insert/update (e.g. in some internal db tables), in order to speed up retrieval and search.</p>",
        "id": 153913055,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1507539676
    },
    {
        "content": "<p>Vonk stores a canonicalized value if the input is a UCUM unit, accounting for the precision. It does not alter the value in the resource itself, but stores it along with it to support search. Quantities in a search operation are canonicalized the same way, so as long as units are convertible to each other it does not matter which one you use in the Resource and which one in the search operation. We leverage the Fhir.Metrics library that <span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> mentioned, so if any conversion is missing from it I would like to hear which.<br>\nAllowing an extension for conversions of the same value is fine in our solution. I would just suggest to also add a SearchParameter to it that enables searching the value in this extension.</p>",
        "id": 153913090,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1507549189
    },
    {
        "content": "<p>another good use-case where a Resource might be legitimately modified by the server... I point out as another example of where Digital-Signatures that are not well designed (with experience) would break. Crude solution is this update is a version following the signed version, but that puts into question 'this' version vs the version that was digitally-signed...  blunt digital-signatures are very strong, but fragile.  I have updated our wiki page on digital signature challenges <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Digital_Signature_Working_Page\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Digital_Signature_Working_Page\">http://wiki.hl7.org/index.php?title=FHIR_Digital_Signature_Working_Page</a></p>",
        "id": 153913309,
        "sender_full_name": "John Moehrke",
        "timestamp": 1507646165
    },
    {
        "content": "<p>Our server does quantity conversions for searching in the same way (using the Fhir.Metrics lib too)</p>",
        "id": 153913999,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1508126390
    },
    {
        "content": "<blockquote>\n<p>hmm. I really should have done this already. I've just added a new extension <a href=\"http://hl7.org/fhir/StructureDefinition/iso21090-PQ-translation\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/iso21090-PQ-translation\">http://hl7.org/fhir/StructureDefinition/iso21090-PQ-translation</a> that you can use in a Quantity to add another quantity that's a translation of the same quantity to a different set of units</p>\n</blockquote>\n<p>Hi there! trying to work with the PQ Translation Quantity extension. It looks like the link Grahame posted goes 404. mayhap this is the resource he is talking about? <a href=\"https://build.fhir.org/extension-iso21090-pq-translation.json.html\" target=\"_blank\" title=\"https://build.fhir.org/extension-iso21090-pq-translation.json.html\">https://build.fhir.org/extension-iso21090-pq-translation.json.html</a> :)</p>",
        "id": 153915737,
        "sender_full_name": "Suranga Kasthurirathne",
        "timestamp": 1508868854
    },
    {
        "content": "<p>\"<a href=\"http://hl7.org/fhir/StructureDefinition/iso21090-PQ-translation\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/iso21090-PQ-translation\">http://hl7.org/fhir/StructureDefinition/iso21090-PQ-translation</a>\" is the correct URL.  It doesn't resolve yet because the definition was defined as part of R4 which is not yet published</p>",
        "id": 153915738,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1508869640
    },
    {
        "content": "<p>However, yes the URL you pointed to is where you can find the current definition</p>",
        "id": 153915739,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1508869657
    },
    {
        "content": "<p>excellent! thank you :)</p>",
        "id": 153915755,
        "sender_full_name": "Suranga Kasthurirathne",
        "timestamp": 1508873957
    },
    {
        "content": "<p>what is opinion about this.. <a href=\"https://en.wikipedia.org/wiki/EIDAS\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/EIDAS\">https://en.wikipedia.org/wiki/EIDAS</a> for digital signatures</p>",
        "id": 153915982,
        "sender_full_name": "Venkateswara R Davuluri",
        "timestamp": 1508937573
    },
    {
        "content": "<p>sounds like a new thread to me.</p>",
        "id": 153916024,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508945995
    },
    {
        "content": "<p>Yes, EIDAS should be a different thread... but EIDAS is simply a set of EU hosted services. The result of a digital signature under this, would fit nicely into the FHIR Signature data-type; specifically use of Provenance.signature can hold this. Nothing new, just a deployment of 'trustable Identities that the EU is declaring they support.</p>",
        "id": 153916029,
        "sender_full_name": "John Moehrke",
        "timestamp": 1508947723
    },
    {
        "content": "<p>On the combination of different units for the same observation and digital signatures an idea popped up: Would it be feasable to have something like ElementDefinition.inSignature, akin to .isSummary? So you can change some values that are not considered vital to the signature.</p>",
        "id": 153917907,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1510035965
    },
    {
        "content": "<p>The elements that would be covered by a signature would be specific to that signature, each signature standard has a method of excluding/including. We are leveraging existing signature standards and their capability.    I also am not sure we could flag elements that everyone would want to be in/out of a signature.</p>",
        "id": 153917987,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510062492
    },
    {
        "content": "<p>It would be straight-forward enough to define an extension you could drop anywhere and a canonicalization algorithm that only grabbed elements with the extension.  But I'm not sure that approach would be a common enough use-case to define the approach as part of core.</p>",
        "id": 153917994,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510064025
    }
]