[
    {
        "content": "<p>Hi All,<br>\nI was trying look for a resource that can be used to populate HCC ( described below) derived for a Patient and codesystem associated to it. <br>\nThe closest resource I was able to find is \"Condition\", <br>\nbut wanted to know if anyone has experience in using HCC in FHIR resources or have any better suggestion ? </p>\n<p>Hierarchical Condition Category (HCC) coding is a risk adjustment payment model mandated by the <br>\nCenters for Medicare and Medicaid Services (CMS). <br>\nThere are more than 9000 ICD-10 codes that map to more than 70 HCC codes in the model. </p>\n<p>Thanks in advance.</p>",
        "id": 200488925,
        "sender_full_name": "Pranathi Reddy",
        "timestamp": 1591830094
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span></p>",
        "id": 200496032,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591836377
    },
    {
        "content": "<p>I'm from the administrative side of the house so with not a great deal of analysis, it seems to me this should be on the Coverage Record. The person (patient) must be enrolled in a Medicare Advantage Plan for the HCC to matter. The HCC Category is how much the Plan would be paid (capitated) for the member. Guessing the patient's HCC score doesn't change from MA plan to MA plan, but the payment amounts may. HCC scores can change as a patient's condition changes, but as I understand it the HCC only changes for 'payment' by plan year (need to confirm this statement).... <br>\nWould the patient be treated any differently if practitioners knows what the HCC is? <br>\nAnd what documentation does CMS currently require - outside of the encounters submitted?<br>\nSeems like a good conversation for a future FM call.<br>\nMK</p>",
        "id": 200557336,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1591888168
    },
    {
        "content": "<p>Thanks for your response . JUst wanted to correct from my question that this is not related to any CMS documentation(i was only mentioning to give details on HCC) <br>\nbut my use cases are <br>\n1) Provide an output identifying HCC's of a Patient ,HCC factors score based on the conditions patient has(for Payors).<br>\n2) Represet Suspect HCC and suspected Conditions that will be used by practitioners to Assess/treat the Patient accordingly . <br>\nSo i was looking for a representation/FHIR resources where i could present HCCs in resources .</p>",
        "id": 200627812,
        "sender_full_name": "Pranathi Reddy",
        "timestamp": 1591926804
    },
    {
        "content": "<p>Well, you've moved me way outside my comfort range. AND I am NOT well versed in the Clinical Resources, but it seems like this is almost a RiskAssessment. All the 'conditions' would have been documented in a condition resource. Wouldn't what you are really attempting to do is gather all the conditions (i.e., diagnosis) to match against a smaller set of HCCs at a particular point in time. The overall 'result' is the HCCs identified and a score? <br>\nHopefully others who understand the RiskAssessment could offer up an opinion?</p>",
        "id": 200633841,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1591935778
    }
]