[
    {
        "content": "<p>In a multi tenant platform, how one incorporate header information on any given resource. Eg. if the resource in question is an appointment but you also wanted to see the originating system and destination systems as well as the use who initiated the transaction, how would you deliver this? This is similar that the MSH segment we use to have in HLv2.x</p>",
        "id": 188374705,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1581943078
    },
    {
        "content": "<p>One approach is to have different base URL for each tenant, and your authorization and authentication mechanisms will take care of identifying the source system and user.</p>",
        "id": 188381717,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1581949517
    },
    {
        "content": "<p>In a RESTful interface, the only destination is the server it gets posted to.  (If you're looking for routing, you'll need FHIR messaging.). Information about where a record came from can/should be captured using Provenance.</p>",
        "id": 188387036,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581953364
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>  I agree thats one way of doing it... I am however after something more scalable for a large scale solution... <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Is using Provenance a common way of doing it? Isnt it better to add extension for that?</p>",
        "id": 188390791,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1581956525
    },
    {
        "content": "<p>Provenance is the standard way of capturing the context for any record - who created it, what organization they did it on behalf of, what location they were in, why they did it, when they did it, who supervised or approved it, etc.</p>",
        "id": 188400485,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1581966143
    },
    {
        "content": "<p>Can you have multiple resources contained in one resource. For example have the provenance which has three resources contained in parallel <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 189166020,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1582755381
    },
    {
        "content": "<p>Resource.contained repeats, so yes you can have multiple contained resources.  Just remember that containment is for resources that can't stand alone, it's not a packaging mechanism for simple delivery.  If you make a resource contained, you should expect the receiver to keep it contained and not usually support searching on it directly.</p>",
        "id": 189167718,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582756421
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  so if you have a documentReference and wanting to send the patient details as a contained resource, you cannot do it because patient resource can exist separately and is searchable . This is an extreme case where the patient reference cannot be provided in the documentReference</p>",
        "id": 189216844,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1582812978
    },
    {
        "content": "<p>In the IHE implementation Guide for document sharing, there is use of contained Patient as known at the source. This is expected use-case.  Lloyd is just cautioning to not use contained when one should not use contained, a common warning as it is easy to use it and later be unhappy.</p>",
        "id": 189218359,
        "sender_full_name": "John Moehrke",
        "timestamp": 1582813983
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> .. Cant agree more. My usecase is similar to above example. I have a job description (literally a job/role) and I want to make a request based on that. But the request cannot reference the job always, this is to increase workforce management staff placement enhancement. So I want to send a request whilst I have got the job details contained</p>",
        "id": 189219427,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1582814748
    },
    {
        "content": "<p>It's fine to send the patient info as a contained resource if you've got limited information.  E.g. you're just capturing birth year and gender.  However, if you've got a contained patient, then you can't expect to be able to subsequently search for all DocumentReferences associated with a given patient.</p>",
        "id": 189223981,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582817671
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Technically speaking I dont have any problem with the logic provided, but from what I ve seen in IHE projects, this may not be necessarily the case. I will have to contained in for my example above as I really have to send them all together but they may exist also outside the contained bundle. Thanks again.</p>",
        "id": 189224950,
        "sender_full_name": "Medi Harsini",
        "timestamp": 1582818278
    }
]