[
    {
        "content": "<p>I have been looking into the overall scheduling domain (both traditional OP appointments and surgeries).</p>\n<p>I think the core resources make up a really robust model:<br>\n*schedule<br>\n*slot<br>\n*appointment</p>\n<p>When we look at a <strong>Slot</strong>, it is important to know what type of \"service\" is provided during that slot. This is supported like this:<br>\n<em>serviceType    0..</em>    CodeableConcept <br>\nThe type of appointments that can be booked into this slot (ideally this would be an identifiable service - which is at a location, rather than the location itself). If provided then this overrides the value provided on the availability resource<br>\nService type (Example)*</p>\n<p><strong>Question/Suggestion</strong><br>\nWouldn't it be better to instead reference a<strong>HealthcareService</strong> which is defined as a service that is provided at a certain location? This matches the description of the Slot's serviceType element as well.</p>\n<p>This would also bring other benefits, such as specifying resource requirements for a service (this slot needs a certain staff type, equipment and/or room) which would then be attributes on the HealthcareService.</p>",
        "id": 163983666,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1556022069
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 163996895,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556031205
    },
    {
        "content": "<p>You are correct. The serviceType is there so that if the HealthcareService referenced has multiple types, the slot might have different availability for different types.</p>",
        "id": 164034462,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1556057518
    },
    {
        "content": "<p>And yes, would expect more often to find the HealthcareService reference to be used.<br>\nCan you please log a tracker and will try to make that clearer.</p>",
        "id": 164034538,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1556057573
    },
    {
        "content": "<p>While you're looking might also be worth noting that the slot gives the availability info without exposing appointments. So doesn't inadvertently expose info as part of normal design.</p>",
        "id": 164034645,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1556057680
    },
    {
        "content": "<p>Better late than never :)<br>\n<a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22687\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22687\">https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22687</a></p>\n<p>And yes, the possibility of giving slot availability without the appointments is good, especially for finding available slots and similar use cases. For viewing a Schedule I think it is probably more likely that you will want to also see the Appointments as well. But there are scenarios there where you dont want to show the appointments. I know as an example that if you book and mange a clinicians schedule where the clinician works at multiple clinics you maybe want to see slots+appointments for the slots and appointments at the clinic you are booking for/at, but you are not allowed to see the appointments at the other clinic which the clinician is working at (but you of course still need to see busy slots as not available for you).</p>",
        "id": 167831246,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1560243130
    },
    {
        "content": "<p>When we reviewed this today, we noticed that above I didn't point out that the slot has a link to the schedule, which is for the healthcare service. And not all slots needs to exist.<br>\nThe extra data on the slot was to provide capability to further restrict the applicability of  the time slot.<br>\nWe haven't ruled out changes, and added some notes into the tracker in Jira (sorry for being very slow on this one)<br>\nGiven it's now been quite some time, how has the use of your extensions gone?</p>",
        "id": 200471779,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1591820752
    }
]