[
    {
        "content": "<p>Note: For some more background see <a href=\"#narrow/stream/implementers/topic/Should.20HealthcareService.20reference.20Practitioner.3F\" title=\"#narrow/stream/implementers/topic/Should.20HealthcareService.20reference.20Practitioner.3F\">https://chat.fhir.org/#narrow/stream/implementers/topic/Should.20HealthcareService.20reference.20Practitioner.3F</a> </p>\n<p>I discussed the concept of a HealthcareService directory vs. a Provider Registry with a few people this weekend (<span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> , <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , <span class=\"user-mention\" data-user-id=\"193795\">@Joel Francis</span>, others... ), and after digesting it enough, I've convince myself that HealthcareService should reference PractitionerRole. I wanted to get my detailed thoughts out to the working groups for this week if it's on the agenda to discuss.</p>\n<p>See this screenshot for the relationship diagram and description:<br>\n<a href=\"https://www.screencast.com/t/GbawYdC4ZdsU\" target=\"_blank\" title=\"https://www.screencast.com/t/GbawYdC4ZdsU\">https://www.screencast.com/t/GbawYdC4ZdsU</a></p>\n<p>SUMMARY OF MY ARGUEMENT:<br>\n=======================<br>\nProvider directories and healthcareService directories serve different but sometimes overlapping purposes. The fact that PractitionerRole references healthcareService highly benefits Provider registries, but is seldom used by provider registries. Meanwhile, the direction of the arrow makes it much more complicated to implement and search a healthcareService directory, which could make good use of the arrow being in the opposite direction.</p>\n<p>DETAILED ARGUEMENT:<br>\n=====================<br>\nProvider Directory:<br>\n- The MAIN search starts with /PractitionerRole<br>\n- The main purpose of provider directories is often to find specialists or other professions (I’m looking for a cardioloGIST), and is often used for billing, certifications, associating with user accounts, etc… can SOMETIMES also be used for eReferrals.<br>\n- The practitionerRole.specialty is often used as a provider directory’s “service directory” (e.g., <br>\n- Sometimes the .specialty is used to categorize things that aren’t specialties…<br>\n- Often (Usually?) provider directories don’t even use the HealthcareService (e.g, not in Argonaut, or in an NPI converted FHIR view of a provider directory). </p>\n<p>HealthcareService Directory:<br>\n- The MAIN search starts with /healthcareserivce. <br>\n- The primary purpose of a healthcareService directory is to find the right service, MOST OFTEN for the purpose of sending referrals.<br>\n- If I GET /healthcareService, I would have no idea there are PractitionerRoles associated with it unless I explicitly ask for it. <br>\n- If I want to find all Practitioners attached to a HealthcareService… the query gets really really messy.</p>\n<p>Summary:<br>\n- It’s EASY for a PROVIDER directory to find all HealthcareServices for a provider, but UNCOMMON<br>\n- It’s HARD for a HEALTHCARESERIVCE directory to find all providers in a HealthcareService, but COMMON</p>",
        "id": 153933044,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1517257647
    },
    {
        "content": "<p>It's this way round as there are going to be a single healthcare service and the prac's allocated at these and revised removed added over time without modifying the service.</p>",
        "id": 153933188,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1517271944
    }
]