[
    {
        "content": "<p>Hi all,  how can I create profile for heart sounds? There are various sounds first, second, third, fourth, prosthetic valve sounds and murmur and the sounds in turn have quality, split and many more. Can any one please suggest me? Thank you</p>",
        "id": 153927295,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1514532416
    },
    {
        "content": "<p>Not heard of recording these as audio. They are normally recorded as electrical, ECG/EKG. In that case they are converted to digital measurements, and those are recorded in an Observation. Or alternatively there is a DICOM object to hold an ECG/EKG in full fidelity. More importantly the signal is analyzed (one of the early form of Computer Assisted Diagnostics - aka CDS).</p>",
        "id": 153927314,
        "sender_full_name": "John Moehrke",
        "timestamp": 1514552856
    },
    {
        "content": "<p>You could, if you insist on recording audio, use an Observation --&gt; Media --&gt; Binary. Where the audio is recorded as a WAV or MP3 in a Binary.</p>",
        "id": 153927315,
        "sender_full_name": "John Moehrke",
        "timestamp": 1514552916
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  It's not about recording the audio. The main aim is to create a profile for the heart sounds using forge. Can you suggest me any solution?</p>",
        "id": 153927316,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1514553029
    },
    {
        "content": "<p>I have a history with GE and their MUSE product,  but am not there now. My current job has nothing to do with ECG.  I have modeled ECG into FHIR multiple times, but no workgroup took it up. There is a common model for an ECG, defined in IEEE 11073.       That said, there is an example in the Observation,  <a href=\"http://build.fhir.org/observation-examples.html\" target=\"_blank\" title=\"http://build.fhir.org/observation-examples.html\">http://build.fhir.org/observation-examples.html</a>    I don't think this is a good example.  To get a profile, or new resource, to handle all the flavors of ECG is a major project. I would be happy to help, but it is not n my current work scope. --- There are two different levels of detail to model, first is simply what the Observation would look like, holding all the calculations (intervals, min, max, rate, ..) and interpretations, and a human readable rendering of the heart waveform (pdf/jpg/png); this is what most want; the second is to hold the waveform data for each perspective (e.g. 3 lead, 12 lead, 15 lead, stress).  This second part, is huge and not all that reusable without the ECG analysis algorithms. The first part is what is more reusable, and more actionable.</p>",
        "id": 153927318,
        "sender_full_name": "John Moehrke",
        "timestamp": 1514553977
    },
    {
        "content": "<p>Ok. But its only about capturing different heart sounds in a profile. For instance, 'murmur' has category, intensity, quality, inspiration etc. , the category consists of systolic, diastolic and continuous, systolic in turn has Holosystolic, Early, Late systolic and MidSystolic  and diastolic has Early, Mid-diastolic and Pre-Systolic. How can I create a profile considering the above mentioned points?</p>",
        "id": 153927321,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1514555287
    },
    {
        "content": "<p>Those would be  either measurements or interpretations made of the data. Given that Observation.interpretation is a 0..1; I assume it can only hold the overall interpretation.   I think the measurements/interpretations you are thinking of would go into Observation.component given that it can hold 0..*       I am not understanding your use of the word 'category'.</p>",
        "id": 153927326,
        "sender_full_name": "John Moehrke",
        "timestamp": 1514561308
    },
    {
        "content": "<p>I would not say these are interpretations, they are observations (A machine could identify many of them.) I agree with John that \"category\" is not the best phrasing for this. It would normally be considered \"timing,\" in this case the timing of a murmur because you are using a fixed enumerated list of possible values that describe when the item you are qualifying is occurring in the heart rhythm cycle.  I'd need to better understand the entire model you are considering to give other advice. Consider looking at LOINC for the types of observations you are working on, for example see <a href=\"https://s.details.loinc.org/LOINC/80281-9.html?sections=Comprehensive\" target=\"_blank\" title=\"https://s.details.loinc.org/LOINC/80281-9.html?sections=Comprehensive\">https://s.details.loinc.org/LOINC/80281-9.html?sections=Comprehensive</a></p>",
        "id": 153927803,
        "sender_full_name": "Robert McClure",
        "timestamp": 1515185852
    }
]