[
    {
        "content": "<p>Hi, I have a question regarding heart rate at blood pressure observations. The device we use will always give us a heart rate reading when doing a blood pressure measurement. So, should we create a single observation with components for systolic, diastolic and heart rate or is it better to create a \"panel\" with two \"child\" observations, one for blood pressure and one for heart rate?</p>",
        "id": 277116538,
        "sender_full_name": "Joakim Antus",
        "timestamp": 1648632290
    },
    {
        "content": "<p>The former is better, have a look at <a href=\"http://hl7.org/fhir/R4/bp.html\">http://hl7.org/fhir/R4/bp.html</a> and the example on <a href=\"http://hl7.org/fhir/R4/observation-example-bloodpressure.json.html\">http://hl7.org/fhir/R4/observation-example-bloodpressure.json.html</a></p>",
        "id": 277119151,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1648633779
    },
    {
        "content": "<p>I think whether the former is \"better\" depends on how the data is intended to be used.  If this heart rate measurement will always be used only along with the systolic and diastolic BP measurements, then I agree that is an appropriate use of component and doing it that way would be better (since they are done at the same time and with the same method, etc.).  But if the heart would ever be used independently of the BP measurements, then representing it as a \"panel\" with separate observations should at least be considered.  I expect that in your case with the device the heart rate probably won't have an independent use, so using component would make sense - but it's worth giving some thought to it.</p>",
        "id": 277128581,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1648639595
    },
    {
        "content": "<p>I think heart rate should always be a separate Observation, to comply with the vital signs profile (<a href=\"http://hl7.org/fhir/observation-vitalsigns.html\">http://hl7.org/fhir/observation-vitalsigns.html</a>), that is what client would be expecting. If you put it in a component of the blood pressure clients most likely would not 'see' it at all</p>",
        "id": 277149772,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1648649218
    },
    {
        "content": "<p>I wasn't thinking about it in regard to the vital signs profile.  That's another reason to consider representing it as a separate observation.  If the heart rate data in this case has any independent use (actual or potential) as a \"vital sign\", then it is required for it to conform to the vital signs profile.</p>",
        "id": 277159570,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1648652973
    },
    {
        "content": "<p>\"Collected together by the same instrument and method\" is a necessary but not sufficient criteria for using 'component'.  The other is \"cannot be usefully interpreted independently or almost always interpreted and considered together\".  The latter bit is what allows systolic and diastolic to be sent as components of a single Observation.  However, it'd be much harder to argue that's true of blood pressure and heart rate.  The first part comes into play a lot for things like microbiology (where you need both organism and sensitivity together to have a complete statement) or genetics (where there are a bunch of properties that together describe a variant).</p>",
        "id": 277173880,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648658968
    },
    {
        "content": "<p>We're seeing a lot of uses of component which are considerably looser than the criteria that Lloyd quoted - largely based on the \"or may provide qualifying information to Observation.code\" clause.  I agree generally with Lloyd's analysis.  But I think that the microbiology identification/ susceptibility scenario isn't as clearly in favor of using component as he thinks it is. :)  For one thing, the necessary (but not sufficient) criterion of \"Collected together by the same instrument and method\" is not true for organism identification and susceptibility results.</p>",
        "id": 277206809,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1648675932
    },
    {
        "content": "<p>Sorry, I misspoke.  I didn't mean 'organism', I meant antibiotic.  Knowing \"susceptible\" isn't useful if you don't know \"to what\".  Similarly, knowing \"to what\" isn't useful if you don't have the susceptibility.  The organism is completely orthogonal and would indeed be a separate Observation.</p>",
        "id": 277223266,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648690574
    }
]