[
    {
        "content": "<p>Hello, I'm trying to determine where some reasonably standard content would typically appear in the FHIR Coverage model. This information is needed for HEDIS calculations so we're looking for guidance on where this information should be exposed via the FHIR domain model.</p>\n<p>Using NCQA terminology:<br>\n1) Where would product line information typically be exposed, e.g. Medicare, Medicaid, Commercial, Marketplace?<br>\n2) Where would product information typically be exposed, e.g. HMO, PPO, EPO?<br>\n3) Where would benefit package information be exposed, e.g. Special Needs Plans such as DSNP, ISNP?</p>\n<p>Some related coverage fields but not specifically for HEDIS.<br>\n4) Where would the metal level be exposed for Marketplace coverage, e.g. Bronze, Silver, Gold or Platinum. (<a href=\"https://www.healthcare.gov/choose-a-plan/plans-categories/\" target=\"_blank\" title=\"https://www.healthcare.gov/choose-a-plan/plans-categories/\">https://www.healthcare.gov/choose-a-plan/plans-categories/</a>)</p>\n<p>I've already noticed that actual benefit information isn't exposed by Coverage, e.g. vision, dental, hospice, chemical dependency etc, but in my mind probably should be otherwise I'm not sure how a client system would know what benefits a given coverage includes to help support HEDIS measure calculations.</p>",
        "id": 153947798,
        "sender_full_name": "David Teirney",
        "timestamp": 1522038482
    },
    {
        "content": "<p>My understanding is that a new resource is planned for this, though I would expect at least some of it should be exposed in Coverage.  When passing data between clinical systems, having just the bare identifiers isn't much use if you don't know what type of coverage the identifiers are tied to.  <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> ?</p>",
        "id": 153948016,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1522073876
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191709\">@David Teirney</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> The Coverage resource intentionally contains the identifiers and not the 'benefits' as this is historically what is required to enquire about or seek authorization or reimbursement under an insurance policy. <br>\nHistorically most insurers do not provide the benefit information or consumption to-date electronically, but some are and do in certain circumstances (Eligibility, EOB) so the various resources contain means to convey that information.<br>\nIn FHIR we try to contain within resources as elements those concepts which are more universal in nature - although the specific vocabulary by be set by jurisdiction in a jurisdiction profile (IG), and in extensions where the concept is of limited use. I in a US profile on Coverage you may place: product line in Coverage.type and the HMO/PPO, DSNP/ISNP and metal level would either be Coverage.Class instances or extensions.<br>\nWe are exploring both Contract and ProductPlan to hold benefits, although the latter would not be suitable for to-date consumption.</p>",
        "id": 153950133,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1522756036
    },
    {
        "content": "<p>It's not a question of what the insurers provide, it's a question of what the EHR and other clinical systems store and pass around to other clinical systems.  The information on Coverage needs to be sufficient to meet the business needs of the clinical systems when they're looking at the patient record and determining what type of insurance the patient has.  Whether that information comes from the insurer electronically or in paper form or over the phone or is relayed by the patient doesn't matter.  Once it's in an EHR, it'll be passed around elecronically from that point forward.</p>",
        "id": 153950233,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1522775005
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <br>\nYou indicated ‘in a US profile on Coverage you may place: product line in Coverage.type and the HMO/PPO, DSNP/ISNP and metal level would either be Coverage.Class instances or extensions’; however, Coverage.type has a terminology binding to Coverage Type and Self-Pay Codes [1].  That valueset does not appear to include any explicit/specific Medicare, Medicaid, Commercial… (‘product line’) concepts, but does include HMO, PPO and POS (‘product information’) concepts.    Would Coverage.type vs. Coverage.class be a better fit for the NCQA ‘product information’ concepts?  If so, do you still see Coverage.type as the right place for the NCQA ‘product line’ (Medicare, Medicaid, Commercial, Marketplace…) concepts?</p>\n<p>[1] <a href=\"http://build.fhir.org/valueset-coverage-type.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-coverage-type.html\">http://build.fhir.org/valueset-coverage-type.html</a></p>",
        "id": 153973128,
        "sender_full_name": "David Riddle",
        "timestamp": 1530626051
    },
    {
        "content": "<p>I think what you are looking for is covered in the draft <a href=\"http://build.fhir.org/productplan.html\" target=\"_blank\" title=\"http://build.fhir.org/productplan.html\">ProductPlan</a>  resource?</p>",
        "id": 153973198,
        "sender_full_name": "Eric Haas",
        "timestamp": 1530638151
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span> Can you attend next weeks FM conference call to discuss this?</p>",
        "id": 153973674,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1530790134
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>  I can attend next week's FM conference call ( 7/10/2018 @11:00 AM Eastern).<br>\nThat will be the first HL7 conference call I have participated in, so I might need some guidance/coaching on how best to raise the topic.</p>",
        "id": 153973769,
        "sender_full_name": "David Riddle",
        "timestamp": 1530802575
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span>  Hi David: My apologies for missing yesterdays FM call but I will be on the call next week and did review the issues raised with Mary Kay. The Coverage.type would be the right place to hold a code related to the type of insurance. I am thinking, perhaps incorrectly, that you have two kinds of information you wish to capture so I'm not sure of the nature of that 'other' information such that I can correctly advise on how it should be handled. I would appreciate if you can make it to next weeks call and we can sort out your needs.</p>",
        "id": 153974595,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1531308432
    },
    {
        "content": "<p>The new ProductPlan resource (soon to be renamed InsurancePlan) holds the practitioner catalog of plans, not any consumer/patient specific details</p>",
        "id": 153974602,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1531309244
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span>  No worries Paul.  Everyone on the FM call was very helpful.  <br>\nThat said, I do think it would be good to discuss the 'two kinds of information' (Medicare, Medicaid, Commercial…/'product line’ in NCQA terminology &amp; HMO, PPO and POS.../‘product information’ in NCQA), since Coverage.type only supports a single entry.  Unfortunately I have schedule conflicts on 7/17 &amp; 7/24.  Could we discuss it on the 7/31 call?</p>",
        "id": 153974714,
        "sender_full_name": "David Riddle",
        "timestamp": 1531330838
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span> Yes!</p>",
        "id": 153974877,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1531393886
    },
    {
        "content": "<p>@PaulKnapp @BrianPostlethwaite <span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span> <br>\nWe really need to talk about all of these.<br>\nThe code sets and the terms used are going to cause some interesting commentary:<br>\nWhat does /what is an InsurancePlan???<br>\nIn the US there is state regulation that defines \"Types of Insurance\" - i.e., Automobile, Health, Homeowner/residential, Life &amp; Annunity, LTC, Pet, Worker's Compensation<br>\nThere is also Federal Regulation that defines Plan Type, i.e., HMO, PPO, EPO, POS, HDHP, CP<br>\nThen there is the whole discussion of Product line:  Medicare, Medicaid, Commercial (Private) which started this thread,<br>\nAnd don't let us forget the metal level discussion which is really about how much (on average)  I'm responsible for,  10-20-30-40%<br>\nAND head down the path of Special Need Plans - Medicare and Medicaid - but what about all the county specific plans???</p>\n<p>I'd love to have a larger industry discussion and then come back to map/develop and ... write it all out???<br>\nit appears we need to look at several resources: Coverage, Eligibility, Contract and the new InsurancePlan.</p>\n<p>thanks!<br>\nMK</p>",
        "id": 153975041,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1531444557
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span>  +1</p>\n<p>Just some ‘food for thought’…   For whatever it is worth the Public Health Data Standards Consortium (PHDSC) Source of Payment Typology [1] contains codes that seem to ‘pre-coordinate’ some of these concepts.  e.g.  111 = ‘Managed Medicare HMO’, 511 = ‘Commercial Managed Care - HMO’, 512 = ‘Commercial Managed Care – PPO’…   </p>\n<p>The PHDSC Payer Typology Sub-Committee appears to have lobbied [2] to replace the existing X12 Claim Filing Indicator codes employed in X12 837 and 835 transactions with the Source of Payment Typology codes.  I think they make some good arguments [2] for why the existing Claim Filing Indicator concepts are inadequate for some use cases. </p>\n<p>[1] <a href=\"http://www.phdsc.org/standards/pdfs/SourceofPaymentTypologyVersion7FINALJune27_2016.pdf\" target=\"_blank\" title=\"http://www.phdsc.org/standards/pdfs/SourceofPaymentTypologyVersion7FINALJune27_2016.pdf\">http://www.phdsc.org/standards/pdfs/SourceofPaymentTypologyVersion7FINALJune27_2016.pdf</a><br>\n[2] <a href=\"http://phdsc.org/standards/pdfs/The_Source_of_Payment_Typology_X12Presentation_September2015.pdf\" target=\"_blank\" title=\"http://phdsc.org/standards/pdfs/The_Source_of_Payment_Typology_X12Presentation_September2015.pdf\">http://phdsc.org/standards/pdfs/The_Source_of_Payment_Typology_X12Presentation_September2015.pdf</a></p>\n<p>cc <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 153975121,
        "sender_full_name": "David Riddle",
        "timestamp": 1531489516
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span>  <span class=\"user-mention\" data-user-id=\"191884\">@MaryKay McDaniel</span> Makes sense, we should consider.</p>",
        "id": 153975129,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1531492693
    },
    {
        "content": "<p>@paulknapp, <span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span> <br>\nI'll put a score card together for the call on the 31st</p>",
        "id": 153975137,
        "sender_full_name": "MaryKay McDaniel",
        "timestamp": 1531495406
    }
]