[
    {
        "content": "<p>In my IG am struggling how to represent an extensible binding for a codeableConcept type element that repeats:</p>\n<ul>\n<li>Slicing works (kind of ) for required bindings but not for extensible bindings</li>\n<li>I tried a FHIRPath invariant with a warning  (see below) which is  what I would like but I can't validate that it will work. </li>\n</ul>\n<p><code>Condition.where(category in 'http://hl7.org/fhir/us/core/ValueSet/us-core-condition-category').exists()</code></p>\n<p>Other suggestions?</p>",
        "id": 153871484,
        "sender_full_name": "Eric Haas",
        "timestamp": 1487117024
    },
    {
        "content": "<p>an extensible binding on a repating element sounds veyr straight forward, so I am assuming that there's something you haven't told us here</p>",
        "id": 153871496,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487123098
    },
    {
        "content": "<p>As we discussed before the extensible binding would apply to each repeat of the codeableconcept  unless you can slice it.   but according to <a href=\"http://build.fhir.org/profiling.html#slicing\" target=\"_blank\" title=\"http://build.fhir.org/profiling.html#slicing\">this</a> \" Note: At present, only a fixed value or a <strong>required</strong> value set should be used for slicing;\"  and my invariant does not seem to work.   I would like to know if I have misunderstood something here.</p>",
        "id": 153871509,
        "sender_full_name": "Eric Haas",
        "timestamp": 1487125677
    },
    {
        "content": "<p>do you want only the first category to be subject to the extensible binding? </p>",
        "id": 153871510,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487125736
    },
    {
        "content": "<p>To clarify I would like valueset \"A\" to be used at least once.  Another value from a nother valueset may be used in another repeat assuming orthogonal categorizations in this case.</p>",
        "id": 153871511,
        "sender_full_name": "Eric Haas",
        "timestamp": 1487125768
    },
    {
        "content": "<p>Yes </p>",
        "id": 153871512,
        "sender_full_name": "Eric Haas",
        "timestamp": 1487125786
    },
    {
        "content": "<p>well, you can slice by index, and make the first slice required. That makes re-profiling that element hard though. Or you can use your invariant. Are you making this constraint in the resource, or in a profile?</p>",
        "id": 153871514,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487125841
    },
    {
        "content": "<p>For a profile, but after further consideration,  I relaxed the binding to 'prefered' in this instance.  For future reference if I were to use an invariant is this correct ( and I may still use it as a best practice warning).</p>\n<p><code>Condition.where(category in '[some valueset url]').exists()</code></p>",
        "id": 153871592,
        "sender_full_name": "Eric Haas",
        "timestamp": 1487172452
    },
    {
        "content": "<p>yes</p>",
        "id": 153871619,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487182029
    }
]