[
    {
        "content": "<p>Hi, we would like to track the history of our device properties and I was wondering what the best way to do it would be. </p>\n<p>Scenario: we have a Device D with properties A,B,C. The provider now adjusts the settings A and B which is sent to the server (maybe as a Message? or as Observation?). </p>\n<p>The Message could have a reference to a DeviceMetric describing A/B and through an Operation (Is this the right concept? still a little new...) the content of the message would be used to apply the new setting to the Device.Property. The message could then be stored for later data analysis. </p>\n<p>However, we are likely to have many different types of messages so I was wondering whether there would be a better way of storing that information?</p>\n<p>I would really appreciate some clarification on this. Thank you.</p>",
        "id": 226159278,
        "sender_full_name": "Michael Ilewicz",
        "timestamp": 1613147100
    },
    {
        "content": "<p>Ideally, you wouldn't use messaging, you'd use PATCH.  The server would also retain the history of the resource and have a Provenance instance of each change, so you could go back and see what had happened, who had done it and why.</p>",
        "id": 226162317,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613148386
    },
    {
        "content": "<p>I see that makes a lot of sense, Thank you. Could you give me a hint on how the reason for the change and the person behind it can be identified? I can't see that from <a href=\"https://www.hl7.org/fhir/fhirpatch.html\">https://www.hl7.org/fhir/fhirpatch.html</a></p>",
        "id": 226164001,
        "sender_full_name": "Michael Ilewicz",
        "timestamp": 1613149054
    },
    {
        "content": "<p>The person would typically be handled by the authorization of the user performing the change.  If you need to capture reason, you'd have to convey Provenance in the header alongside the PATCH.  (See <a href=\"https://build.fhir.org/provenance.html#header\">https://build.fhir.org/provenance.html#header</a>)</p>",
        "id": 226164749,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1613149354
    }
]