[
    {
        "content": "<p>Hi all, We are trying to capture history and physical document note of a patient,we are using composition resource for getting the history document. In composition resource we have sliced the section element.So, In section element for example we are capturing vitals of a patient. Here my doubt is.. vitals will have thousands of values. but when we refer them in a document, we cannot refer all of them. how to refer only \"reviewed\" vitals data only.</p>",
        "id": 153898709,
        "sender_full_name": "Mounika",
        "timestamp": 1501132935
    },
    {
        "content": "<p>In the entries to your document, you'll have to refer explicitly to each resource you want in the document - whether that's 5 or 5000.</p>",
        "id": 153898809,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501169811
    },
    {
        "content": "<p>Okay <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Thank you</p>",
        "id": 153898947,
        "sender_full_name": "Mounika",
        "timestamp": 1501216892
    },
    {
        "content": "<p>hello everyone,<br>\npresent i'm working on fhir documentation, in our use case i want to add some other entries to the History &amp; phisical ( <a href=\"http://www.hl7.org/fhir/us/ccda/StructureDefinition-CCDA-on-FHIR-History-and-Physical.html\" target=\"_blank\" title=\"http://www.hl7.org/fhir/us/ccda/StructureDefinition-CCDA-on-FHIR-History-and-Physical.html\">http://www.hl7.org/fhir/us/ccda/StructureDefinition-CCDA-on-FHIR-History-and-Physical.html</a>) .<br>\nbut i'm unable to load this profile into the forge tool so what is the best way to implement the doc any suggestions?</p>",
        "id": 153904616,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1504689698
    },
    {
        "content": "<p>It seems your StructureDefinition is not valid, which is the reason you cannot load it in Forge. Forge will give you the validation error upon loading, complaining about the \"comments\" field in your elements. I have tried to change that to \"comment\", which eliminated that validation message, but another one appeared. Perhaps you could build the profile from scratch with Forge, so you're sure you end up with a valid StructureDefinition?</p>",
        "id": 153904623,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1504699741
    }
]