[
    {
        "content": "<p>Hi all, noob to the chat here, but getting pulled back into HL7 2x related development work as of late.  My question relates to HL7 conformance profiles and programmatic creation of Orion Health/Lyniate Rhapsody definition files (.s3d).  Does anyone know of anything out there to facilitate the process?  I've been out of it for a 6+ years and imagine there'd be something by now.  This is the doc I'm trying to constrain for <a href=\"http://www.hl7.org/documentcenter/public/standards/dstu/V26_IG_VR_BAFDRPT_R1_STU2.1_2020APR.pdf\">http://www.hl7.org/documentcenter/public/standards/dstu/V26_IG_VR_BAFDRPT_R1_STU2.1_2020APR.pdf</a></p>",
        "id": 263484435,
        "sender_full_name": "Eric Bauer",
        "timestamp": 1638471381
    },
    {
        "content": "<p>The Conformance WG deals with v2 profiles (lots of good expertise). I don't know if any of them has any experience with Rhapsody. Interest in the v2 Birth and Fetal Death standard has largely been replaced by efforts to implement the FHIR version of the IG. I'm a bit surprised someone wants to use v2 for this. Happy to talk more if it's helpful.</p>",
        "id": 263490972,
        "sender_full_name": "Craig Newman",
        "timestamp": 1638474341
    },
    {
        "content": "<p>Me too. This was started earlier this year and fell on me to complete after a contractor left it incomplete. I'd love to sidestep the headache of translating a pdf spec into a definition file for validation, but seems like that's the only choice at this point.</p>",
        "id": 263492743,
        "sender_full_name": "Eric Bauer",
        "timestamp": 1638475182
    },
    {
        "content": "<p>Any idea how to reach out to that workgroup would help if you happen to know.</p>",
        "id": 263492943,
        "sender_full_name": "Eric Bauer",
        "timestamp": 1638475244
    },
    {
        "content": "<p>you should probably ask this question on <a class=\"stream\" data-stream-id=\"229447\" href=\"/#narrow/stream/229447-V2\">#V2</a> - the v2 folks watch that channel and not this one (too busy)</p>",
        "id": 263493057,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638475313
    },
    {
        "content": "<p>The <em>Messaging Workbench</em> creates HL7v2 profiles based on the HL7v2 model. The tool is free but it's hard to find it on the Internet.</p>",
        "id": 263503740,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1638480969
    },
    {
        "content": "<p>MWB is not really supported anymore, please see IGAMT instead. And Rhapsody should be able to import MWB files - to my knowledge</p>",
        "id": 263561325,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1638528320
    },
    {
        "content": "<p>what's igamt?</p>",
        "id": 263563555,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638529544
    },
    {
        "content": "<p>a NIST tool which amongst other things replaces MWB</p>",
        "id": 263577780,
        "sender_full_name": "René Spronk",
        "timestamp": 1638537508
    },
    {
        "content": "<p>The link to the NIST tool portal (including IGAMT) is <a href=\"https://hl7v2tools.nist.gov/portal/#/tools\">https://hl7v2tools.nist.gov/portal/#/tools</a>. Many of the latest v2 IGs have been written with IGAMT. And their testing tools have been used for EHR certification in the US.</p>",
        "id": 263578423,
        "sender_full_name": "Craig Newman",
        "timestamp": 1638537830
    },
    {
        "content": "<p>Thank you all for your help - i've been able to export an HL7 XML profile from the v1 IGAMT tool</p>",
        "id": 264330752,
        "sender_full_name": "Eric Bauer",
        "timestamp": 1639068972
    }
]