[
    {
        "content": "<p>Dear all, thanks in advance for your time to read this!</p>\n<p>A clinician places an order set for a patient that is associated with a package. The package has a discounted price relative to the sum of individual orders in the package.</p>\n<p>The order placing software sends the individual HL7 order messages to the order fillers which are diagnostic departments.</p>\n<p>The order filling software sends HL7 DFT messages to the Charge Processor at various stages of completing the order. The filler is unaware the order is part of a package and sends standard charges for services and materials.</p>\n<p>So how is the Charge Processor able to folder the charges from the fillers into the ordered package.</p>\n<p>It seems the only way is for the order placer to send a DFT to the Charge Processor directly specifying the orders in ORC and OBX segments followed by a FT1 segment to specify the package.</p>\n<p>The Charge Processor would then be able to somehow override the filler charges with the package charge from the placer.</p>\n<p>Has anyone implemented a placer or charge processor that handles package orders that can help me?</p>",
        "id": 277399503,
        "sender_full_name": "Jim",
        "timestamp": 1648810561
    },
    {
        "content": "<p>It may be helpful to know what country you're in, or rather the country/context of these DFT messages. Besides, the <a class=\"stream\" data-stream-id=\"229447\" href=\"/#narrow/stream/229447-V2\">#V2</a> stream may prove to be better for this type of question, given that almost of of the users of this (current) stream will be FHIR-focused. </p>\n<p>At a glance the 'Filler order number' would be the only useful field for such a charge processor (to work out if any special charge fees apply). Caveat: not my area of specialty.</p>",
        "id": 277402885,
        "sender_full_name": "René Spronk",
        "timestamp": 1648812682
    },
    {
        "content": "<p>Thank you René. The product runs in British Commonwealth countries as well as several Asian countries. To help explain the problem, an order is placed for a package for a set price such as at <a href=\"https://www.healthtestingcenters.com/discount-test-panels/\">https://www.healthtestingcenters.com/discount-test-panels/</a>. This package is associated with an order set which will fire off individual order messages with the appropriate service code for each one. The diagnostic departments (fillers) will then send charges to the Charge Processor. So the question is, how does the placer communicate that these orders are part of a package and should not be charged individually to the Charge Processor.<br>\nI will post to v2 stream, you are right, that would be a better fit for this question, thanks.</p>",
        "id": 278254341,
        "sender_full_name": "Jim",
        "timestamp": 1649390261
    }
]