[
    {
        "content": "<p>Hello All, I am new for FHIR File. I am looking for assistance  to convert them into the normal csv format file.</p>",
        "id": 277247633,
        "sender_full_name": "Er.Madhav Adhikari",
        "timestamp": 1648715094
    },
    {
        "content": "<p>Welcome to this forum. Could you tell us what you've already tried ? And please read <a href=\"https://confluence.hl7.org/display/FHIR/FHIR+Rules+for+Asking+Questions\">https://confluence.hl7.org/display/FHIR/FHIR+Rules+for+Asking+Questions</a> - thanks.</p>",
        "id": 277253669,
        "sender_full_name": "René Spronk",
        "timestamp": 1648718495
    },
    {
        "content": "<p>First, there is no 'normal' CSV file - all CSV files are a custom set of columns.  Second, CSV is a flat list of values for each record.  FHIR is a nested hierarchy, so you'll have to accommodate that.  For example, a patient can have an unlimited number of addresses, each of which can have various parts.  Same deal with names (and each name can have multiple given names).  You'll have to figure out how you want to 'flatten' that structure to correspond to your desired set of CSV columns.</p>",
        "id": 277297622,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648740120
    },
    {
        "content": "<p>Hello Rene,   Yes I have read the instructions provided as your link. I heard the HAPI FHIR will work. I am looking into this. Could you please share the links or any recourses if you have related to the FHIR JSON file to CSV converter  . I am new for FHIR. so looking for  training  or document t know about the this file format</p>",
        "id": 277297743,
        "sender_full_name": "Er.Madhav Adhikari",
        "timestamp": 1648740152
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  sound good.  Do you know the JSON file of one one patient or member have multiple resources files or  combined JSON file of all module for one member ?</p>",
        "id": 277299103,
        "sender_full_name": "Er.Madhav Adhikari",
        "timestamp": 1648740698
    },
    {
        "content": "<p>Hello everyone, I am also looking for the same portion for  having FHIR content data to flatten structure.Can anyone provide me the link or resources to go through that</p>",
        "id": 277300313,
        "sender_full_name": "Nabin Pandey",
        "timestamp": 1648741154
    },
    {
        "content": "<p>First, you'll need to figure out how you want to retrieve the data - are you performing a simple search, a search with _include or _revinclude,  a Batch with a bunch of searches, a Bulk Data retrieval?  (You'll need to go read about all of those things and understand what the options are.)  Then you'll have to look at the data structures and map them to your own CSV data structure and figure out how to manage the possibility that there might be more repetitions of things than your data structure knows how to handle (by filtering, by choosing one, by modifying your data structure).  There's no one-size-fits-all solution.</p>",
        "id": 277301130,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648741493
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  for detailing on this.</p>",
        "id": 277301598,
        "sender_full_name": "Nabin Pandey",
        "timestamp": 1648741698
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"490765\">@Er.Madhav Adhikari</span>, as <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> indicates, a major challenge converting a FHIR resource to <em>a</em> CSV file (or any flat representation, or relational database) is that elements can repeat and are hierarchical. If you're converting a patient resource to CSV, do you want one row per patient, and add additional columns for each name (and how many name columns do you allocate)? Or do you repeat the patient info on multiple lines, one for each name, and somehow link all those lines together? Or do you create some sort of structure that lets you have the non-repeating info in one CSV file, and the repeating info in another CSV file with \"links\" back to the main file (essentially re-inventing a relational database in CSV). And that's just for one attribute in one resource; now repeat that evaluation for other attributes and in other resources.</p>\n<p>Beyond that, resources are heavily cross-linked. How do you want to represent that? Does that full information of a patient's preferred doctor show up in the patient CSV, or is there somehow a \"link\" to the practitioner CSV? What if multiple patients have the same preferred doctor?</p>\n<p>Finally, FHIR supports extensions on most elements--which can be thought of as a standard way of adding non-standard information. Does the data your using have/will have/might at some point have any extensions? Do you have control over which extensions might be encountered? Do you care about expressing the extension content in the CSV or are you willing to drop that information? How will your CSV approach support arbitrary additional (potentially hierarchical) information at any place in the model?</p>\n<p>As you can see, there is no simple one-size-fits-all FHIR (JSON or XML) to CSV transform.</p>",
        "id": 277309605,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1648745297
    },
    {
        "content": "<p>Actually, the discussion should have started not with <em>how</em> to do a JSON to CSV transform, but <em>why</em> do a JSON to CSV transform. What are you trying to accomplish?</p>",
        "id": 277309741,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1648745390
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  yes I agreed with you and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> .<br>\nFirstly,  My requirements :  I have  my healthcare application which support only parquet or CSV file formate after performing transformation from  raw data file to our standard format by running in distribution system (hadoop/spark).  So my some vendor sent the FHIR file in the JSON file formate, I have to convert it into csv.</p>\n<p>And , I want one row per patient  for each  module ( patient info, coverage ,EOB, medication  etc)  and later linked or merged all modules to one flattened file.</p>",
        "id": 277311243,
        "sender_full_name": "Er.Madhav Adhikari",
        "timestamp": 1648746149
    },
    {
        "content": "<p>This sounds like basically the classic Object to Relational mapping problem --- not easy as already stated.<br>\nYou can 'sort of' think of the FHIR 'data model' as an object model, and, in fact, is represented as such with UML on each FHIR resource spec page.   The CSV is 'sort of' the relational, row/column, flattened model.</p>",
        "id": 277313635,
        "sender_full_name": "John Silva",
        "timestamp": 1648747311
    },
    {
        "content": "<p>If parquet is an option, I suggest browsing the <a class=\"stream\" data-stream-id=\"179250\" href=\"/#narrow/stream/179250-bulk-data\">#bulk data</a> stream. I know there has been discussion about parquet export, but don't know where that landed.</p>",
        "id": 277318844,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1648749925
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span>  Thank you for suggestion  however, I cant  get any solution there.</p>",
        "id": 277407707,
        "sender_full_name": "Er.Madhav Adhikari",
        "timestamp": 1648815403
    },
    {
        "content": "<p>There won't be a solution that won't require a bunch of analysis and custom development on your end</p>",
        "id": 277423595,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648822136
    }
]