[
    {
        "content": "<p>Very minor/cosmetic thing I noticed: on <a href=\"http://www.hl7.org/fhir/DSTU2/conformance-rules.html#cardinality\" target=\"_blank\" title=\"http://www.hl7.org/fhir/DSTU2/conformance-rules.html#cardinality\">http://www.hl7.org/fhir/DSTU2/conformance-rules.html#cardinality</a> the #cardinality anchor is duplicated for both the 'Cardinality' section and the 'Base Conformance Rules' section. This means you can't actually link directly to the Cardinality section.</p>\n<p>This isn't an issue on this page since they are so close to one another but I thought I'd mention in case the way the site is built would mean this affects lots of other places in the site, and especially pages where the affected sections are longer.</p>\n<p>If it's worth raising an issue on gforge would you mind giving me a pointer to which Reviewing Working Group to link this to (if any)?</p>",
        "id": 153892094,
        "sender_full_name": "Jonathan Mew",
        "timestamp": 1496403365
    },
    {
        "content": "<p>In fact, this is fixed on <a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">build.fhir.org</a> and on <a href=\"http://www.hl7.org/fhir/conformance-rules.html#cardinality\" target=\"_blank\" title=\"http://www.hl7.org/fhir/conformance-rules.html#cardinality\">http://www.hl7.org/fhir/conformance-rules.html#cardinality</a> - will this ever be updated on DSTU2 or is that no longer under development?</p>",
        "id": 153892095,
        "sender_full_name": "Jonathan Mew",
        "timestamp": 1496403635
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193478\">@Jonathan Mew</span> No need to worry about which work group to assign it to.  If you're not sure, just don't select one.  It'll get assigned (or possibly reassigned) during the triage process.  In terms of corrections to DSTU2, at this time we would only consider updates for critical security issues or something of similar magnitude.  We would not make cosmetic fixes.  (In fact, it's unlikely we'd make cosmetic fixes even to  STU3 which is the current release.</p>",
        "id": 153892117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496415645
    },
    {
        "content": "<p>Thanks for the clarification, Lloyd - I'll leave it in that case :)</p>",
        "id": 153892119,
        "sender_full_name": "Jonathan Mew",
        "timestamp": 1496416024
    }
]