[
    {
        "content": "<p>Hello!</p>\n<p>Which FHIR resources are most suitable to capture patient assessment data typically asked for during hospital admission– mobility, DNR, the risk of falling, hepatitis B status, etc.    Observation?  DiagnosticReport?   ClinicalImpression? - this one looks like a good fit,  but is at zero-maturity level currently...</p>\n<p>Thanks!</p>",
        "id": 153954436,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1524718688
    },
    {
        "content": "<p>This may be captured using a Quesitonnaire (as a form) / QuestionnaireResponse, but ultimately will be other resources such the ones you've mentioned (Obs/Reports...). It depends on you admission scope/workflows/forms.</p>",
        "id": 153954440,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1524726156
    },
    {
        "content": "<p>For high-risk things that you want flagged to everyone interacting with the patient, consider Flag - it's intended to essentially provide the equivalent of orange stickies on the front of the patient chart - high-priority/low-volume.  More detail on something like mobility, falling risk, Hep B would be captured as Condition - because they're something that can evolve and are tracked over time.   A formal DNR might be expressed as Consent or Contract.</p>",
        "id": 153954560,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524763479
    },
    {
        "content": "<p>Thank you!  Is ClinicalImpression <a href=\"https://www.hl7.org/fhir/clinicalimpression.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/clinicalimpression.html\">https://www.hl7.org/fhir/clinicalimpression.html</a> going to mature?  it looks like a suitable umbrella for this context</p>",
        "id": 153954576,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1524767095
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  ???????</p>",
        "id": 153954587,
        "sender_full_name": "Eric Haas",
        "timestamp": 1524770070
    },
    {
        "content": "<p>Yes, Patient Care intends to mature ClinicalImpression, but I don't have an exact timeframe to communicate.  We have a few other higher priority resources that are taking precedence at the moment.  That said, if you have specific change requests in mind, feel free to log them using the \"propose a change\" link at the bottom of each page.</p>",
        "id": 153957689,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1525990840
    }
]