[
    {
        "content": "<p>How would you model a \"hospital\" in FHIR?  With Organization and Location?  thanks!</p>",
        "id": 153912542,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1507179485
    },
    {
        "content": "<p>yes</p>",
        "id": 153912544,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507181911
    },
    {
        "content": "<p>well, actually, typically a \"hospital\" is a set of healthcare services offered from a single location, run by a single organization. but for each of these 3 things, there's lots of exceptions from the typical case:<br>\n- hospitals that only offer a single service<br>\n- hospitals that have multiple locations (compuses)<br>\n- hospitals where the building facilities at a single location are shared between multiple organizations</p>",
        "id": 153912545,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1507182060
    },
    {
        "content": "<p>Ok,  thank  you for your help validating the approach!</p>",
        "id": 153912551,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1507183000
    },
    {
        "content": "<p>\"Organization\" does not seem to have a spot to enter the website, any thoughts where to put it?</p>",
        "id": 153912567,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1507186229
    },
    {
        "content": "<p>You can specify that information in a <code>Organization.telecom</code> component with <code>system = \"url\"</code>.<br>\n<a href=\"http://hl7.org/fhir/datatypes.html#ContactPoint\" target=\"_blank\" title=\"http://hl7.org/fhir/datatypes.html#ContactPoint\">http://hl7.org/fhir/datatypes.html#ContactPoint</a></p>",
        "id": 153912568,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1507187721
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> url seems to be for personal contacts: \"A contact that is not a phone, fax, pager or email address and is expressed as a URL. This is intended for various personal contacts including blogs, Skype, Twitter, Facebook, etc. Do not use for email addresses.\"</p>",
        "id": 153912569,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507187788
    },
    {
        "content": "<p>should the documentation there be updated to also accommodate institutional communication?</p>",
        "id": 153912570,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507187812
    },
    {
        "content": "<p>Good point. I tried to search examples that specify a link to an official website, but I couldn't find any.</p>",
        "id": 153912571,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1507188396
    },
    {
        "content": "<p>...extension then?</p>",
        "id": 153912622,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1507215416
    },
    {
        "content": "<p>probably the most important element of any organization these days :)</p>",
        "id": 153912623,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1507215683
    },
    {
        "content": "<p>What is a <em>personal contact</em> in the context of an <em>organization</em>?<br>\n+1 for extending the description of telecom system=\"url\" rather than adding an extension.</p>",
        "id": 153912624,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1507216490
    },
    {
        "content": "<p>easy does it!  Any other votes?</p>",
        "id": 153912676,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1507230216
    },
    {
        "content": "<p>The intention is definitely to use Organization.telecom[system=url] for organization websites.  If this isn't sufficiently clear, feel free to submit a change proposal with proposed improved wording</p>",
        "id": 153912852,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507310421
    },
    {
        "content": "<p>It is, thank you!</p>",
        "id": 153912919,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1507337536
    },
    {
        "content": "<p>To continue the discussion, are there any emerging best practices for modeling Hospital census statistics?  Number of beds?  Medicare/medicaid mix?  Current occupied beds?  etc?</p>\n<p>I just wrapped up a project modeling such things; and have some thoughts on the matter, but would like to know if there are existing proposals or working groups.</p>",
        "id": 153913399,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1507674469
    },
    {
        "content": "<p>I would assume each of those things would be captured as Observations - they're point-in-time measurements/assessments</p>",
        "id": 153913558,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507788933
    },
    {
        "content": "<p>Building up further: Would there be any difference between <br>\na) an observation that is an assessment (number of beds)<br>\nb) an aggregate (average % beds occupied)<br>\n?</p>",
        "id": 153913572,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507799114
    },
    {
        "content": "<p>Other than the Observation.code, no.</p>",
        "id": 153913599,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507809255
    },
    {
        "content": "<p>ok, cool. <br>\nbtw, tracker created for the url : #14015</p>",
        "id": 153913617,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507814291
    },
    {
        "content": "<p>I don't yet totally believe having an Observation be the way to capture these attributes.  OO (and II, and others) are currently trying to handle something like that with Media &amp; Observation boundaries.  </p>\n<p>But in particular what would the subject of the Observation be (or what other resource would reference it)?  In general, how would one group these observations correctly and get all of the related ones, or exclude them when they aren't relevant?</p>",
        "id": 153913679,
        "sender_full_name": "Daniel Rutz",
        "timestamp": 1507835405
    },
    {
        "content": "<blockquote>\n<p>I would assume each of those things would be captured as Observations - they're point-in-time measurements/assessments</p>\n</blockquote>\n<p>Huh.  Not the answer I expected.  Interesting.</p>",
        "id": 153913680,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1507835421
    },
    {
        "content": "<p>subject would be location</p>",
        "id": 153913681,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507836798
    },
    {
        "content": "<p>As long as there is consistent guidance it's ok. <br>\nI see Observation as a Clinical observation, but it seems that Observation is becoming a generic information container.</p>",
        "id": 153913733,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507843469
    },
    {
        "content": "<p>Aye, that's kind of a big question right now - the scope of clinical vs. non-Clinical for Observation.</p>",
        "id": 153913734,
        "sender_full_name": "Daniel Rutz",
        "timestamp": 1507844389
    },
    {
        "content": "<p>Observation absolutely includes non-clinical use-cases - though it could use some more examples of that.</p>",
        "id": 153913744,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507851452
    },
    {
        "content": "<p>I have just seen too many ORUs out there, hence my fear of Observation overuse - but if that is intended and clear, it's ok</p>",
        "id": 153913816,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507917961
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> What is the basis for that statement? I don't see anything in the resource suggesting that; all content, not just examples, is related to clinical uses. I don't think there is general agreement about it.</p>",
        "id": 153913817,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507918040
    },
    {
        "content": "<p>It fits the characteristics of an Observation.  It's a measurement.  It's asserted by someone at a particular point in time.  Observation was designed to have subjects other than Patient.</p>",
        "id": 153913818,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507918080
    },
    {
        "content": "<p>I agree that we're short of examples of other types of examples - but the way the resource is defined makes it clear that it doesn't have to be patient-specific.</p>",
        "id": 153913819,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507918111
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14036\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14036\">GF#14036</a></p>",
        "id": 153913821,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507918478
    },
    {
        "content": "<p>I think there's difference between not patient-specific and non-clinical. Are stock levels observations?</p>",
        "id": 153913822,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507918525
    },
    {
        "content": "<p>It depends.  If you're gathering statistical information (e.g. \"What was the average number of product X's we had on hand in the last 6 months?\"), that's definitely an Observation.  If you're actually tracking current inventory, I'd expect that to be handled by another resource - just as when you're capturing the amount of medication being administered right now you'd use something other than an Observation.</p>",
        "id": 153913823,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507918658
    },
    {
        "content": "<blockquote>\n<p>I think there's difference between not patient-specific and non-clinical. Are stock levels observations?</p>\n</blockquote>\n<p>There's a bit of philosophical tradition with regard to Observation by way of the Philosophy of Science and the Scientfic Method.  In the broader sense of the term, yes, an Observation and Hypothesis could be made about stock levels.  Hence the field of Economics.</p>\n<p>One part of the question is whether an Observation is made by an individual or device that is prone to error or bias.  Which is why I wouldn't argue about using Observation to record hospital census stats; and am pleasantly surprised at the philosophical rigor being presented.</p>",
        "id": 153913824,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1507918780
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , nice 2 points there: <br>\n1\"If you're actually tracking current inventory, I'd expect that to be handled by another resource\" and <br>\n2\"when you're capturing the amount of medication being administered right now you'd use something other than an Observation.\"</p>",
        "id": 153913825,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507918879
    },
    {
        "content": "<p>for 1, i agree (it may be just a tad premature to look at that resource but we're not far fromit)<br>\n2 is actually a concern - people using Observation to capture a statement about the use of medication, for example</p>",
        "id": 153913826,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507919007
    },
    {
        "content": "<p>So, we use Observation for historical average product levels; but not current levels, or current medication administration. Is this because they are not (lower-case) observations, or because we have a more specialized resource to capture that type of observation?</p>",
        "id": 153913828,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1507919231
    },
    {
        "content": "<blockquote>\n<p>So, we use Observation for historical average product levels; but not current levels, or current medication administration. Is this because they are not (lower-case) observations, or because we have a more specialized resource to capture that type of observation?</p>\n</blockquote>\n<p>Now that's an interesting question.  What's the difference between an Observation (aka, an assertion) about the number of patients in beds in a hospital (because maybe a patient has gone missing, or do you count pregnant women as more than 1, etc) vs statistical averages and synthetic values such as maximum capacity or legal staffed beds?</p>",
        "id": 153913829,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1507919730
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> People can - and will - use Observation to capture all sorts of things - patient had a procedure, patient takes a drug, patient's birth date, etc.  This will particularly be true when the data is captured as a questionnaire-type response and the results are treated en-masse as observations.  However, FHIR has \"better\" ways to capture such information - more specific resources for making authoritative statements.  When a nurse administers a drug, we capture that as a MedicationAdministration, not an Observation.  And if FHIR ever gets into the space of inventory management (not something we've yet agreed to take on - and it would take some arm-twisting), I'd expect a resource that would be used to manage that - capturing quantity, type of product, location and perhaps a few other things.</p>",
        "id": 153913831,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507919797
    },
    {
        "content": "<p>I am leaving out the inventory bit for now.</p>",
        "id": 153913832,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507919852
    },
    {
        "content": "<p>my concern is from having seen ORUs to register medication administration.</p>",
        "id": 153913833,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507919903
    },
    {
        "content": "<p>If you're capturing statistics, Observation gives you what you need - who's making the assertion, when they're making it, what period of time the assertion is deemed to hold, what information was used to infer the assertion, how certain the assertion is, etc.</p>",
        "id": 153913834,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507919917
    },
    {
        "content": "<p>Right.  And ORUs <em>shouldn't</em> be used to register medication administration.  That's what RXA is for.  The same holds in FHIR.  Systems may misuse Observation, but they should use MedicationAdministration.</p>",
        "id": 153913835,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507919962
    },
    {
        "content": "<p>Indeed. That is what I care about in the Observation discussions. As for the rest, whether observation is clinical or non-clinical, i think there are a few things to it, but I don't know enough to be able to formulate an opinion</p>",
        "id": 153913836,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507920045
    },
    {
        "content": "<p>There is no real discussion about clinical vs non-clinical.   Clinical is in the eye of the beholder. Observations important to  hospital surge capacity, oyster testing, and airflow measurements are important to population health but not necessarily clinical.     My general rule is that you use an existing FHIR resource to represent a lot of specific things that could be consider observations.  But not everybody will do that and there is nothing we can do to prevent it.    This is the constant tension that Grahame mentioned.  lumping everything as an Observation or Representing them in uniquely.   ( e.g. Media)</p>",
        "id": 153913841,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507922498
    },
    {
        "content": "<p>I will be looking at this when we start looking more at operational stuff. I feel Healthcare tends to assume 2 that operational is a foreign body or at best a simple extension to the clinical universe.</p>",
        "id": 153913843,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507927126
    },
    {
        "content": "<blockquote>\n<p>Observation absolutely includes non-clinical use-cases - though it could use some more examples of that.</p>\n</blockquote>\n<p>Thanks Lloyd</p>",
        "id": 153913871,
        "sender_full_name": "Peter Kasson",
        "timestamp": 1507982955
    },
    {
        "content": "<p>But actually, the subject of an observation is quite limited. It's only ref(Patient) or ref(Group) or ref(Device) or ref(Location). That seems arbitrary.  You can't do many types of useful observations: Observations about the efficacy of an intervention, observations about conditions, observations about behaviors, observations about encounters.   I think Observation.subject should be ref(Any)</p>",
        "id": 153922166,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1512001090
    },
    {
        "content": "<p>some of those are assessments and the others are still  patient-centric  (e.g encounter).    Observation is at its core an atomic measurement of something.  Observation needs some boundaries lest it becomes a swiss army knife resource.</p>",
        "id": 153922181,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512005782
    },
    {
        "content": "<p>\"inventory management (not something we've yet agreed to take on \"<br>\nIs this still true? I don't see anything obvious,  but need to ask.</p>",
        "id": 172729425,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1565225913
    }
]