[
    {
        "content": "<p>Is a Pain (1-10) like what I think is LOINC 72514-3 to be recorded as an Observation? As a Vital-Sign? is this the right LOINC?</p>",
        "id": 153992400,
        "sender_full_name": "John Moehrke",
        "timestamp": 1535742580
    },
    {
        "content": "<p>To me this code appears perfectly appropriate, and it's active, not deprecated. However, I am an IT developer, not a clinician!</p>\n<p>Speaking of FHIR, this could be either an Observation or a Condition:</p>\n<ul>\n<li>Observation is for general key-value data points.</li>\n<li>Condition is an item on the problem list. Kind of a specialized Observation, where in addition to code, we state that this is something clinically relevant for this case right now, and it's important for making decisions. Condition also includes body site, problem stage and its timing of onset and potential abatement.</li>\n</ul>\n<p>It is generally safe to use Observation, unless you need the extra fields and want to express this semantic distinction of clinical importance.</p>\n<p>Another issue to consider is what resources you will reference this data item from. Here is a diff of resources that link to Observation (left) and Condition (right):<br>\n<a href=\"/user_uploads/10155/ZEa3-BTA6VkybYZ7st-_MFyT/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/ZEa3-BTA6VkybYZ7st-_MFyT/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/ZEa3-BTA6VkybYZ7st-_MFyT/pasted_image.png\"></a></div><p>So, for example, you can include the Observation in a DiagnosticReport, but not include a Condition (highlighted red). Correspondingly, a Condition can be referenced by CarePlan, but an Observation not.</p>\n<p>Since you want to use a LOINC code, it is Observations that typically use LOINC (see the example value set for the 'code' field), but Conditions are typically coded with SNOMED. However, this is a stylistic remark, and specification does not prevent you from using any CodeableConcept, and does not encourage use of any particular code system.</p>\n<p>As for 'Vital-Sign', there is no dedicated resource for that, apart from the profile in examples, which is based on Observation.</p>",
        "id": 153992405,
        "sender_full_name": "Vladimir Smirnov",
        "timestamp": 1535746781
    },
    {
        "content": "<p>Clinically, its a bit practitioner dependent on where they want pain scores to live.  I feel like its usually part of a subjective assesment, but that's a separate loinc code.  Maybe consider an observation with category code 'survey'.  That's also where they put apgar scores, etc....</p>",
        "id": 153992407,
        "sender_full_name": "Michael Wang",
        "timestamp": 1535747361
    },
    {
        "content": "<p>There has been data collected for years as Patient Generated that is simply recorded as the 1-10 scale of Pain. I expect it is used as an overall assessment of pain. Likely chronic pain. So I have very little to go on how it is used, or how it is to be interpreted. I simply know that it is a patient self evaluation and self recording. This is why I figured it would be an Observation vs a Condition.</p>",
        "id": 153992449,
        "sender_full_name": "John Moehrke",
        "timestamp": 1535756574
    },
    {
        "content": "<p>A score like that shouldn't ever be captured as a Condition.  A pain score is a point-in-time assessment.  A Condition might be \"suffers from chronic pain\"</p>",
        "id": 153992453,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535757080
    },
    {
        "content": "<p>Which LOINC code to use?  There are so many to chose from:  <a href=\"https://loinc.org/groups/community/pain-severity-for-a-patient-at-a-pt/\" target=\"_blank\" title=\"https://loinc.org/groups/community/pain-severity-for-a-patient-at-a-pt/\">https://loinc.org/groups/community/pain-severity-for-a-patient-at-a-pt/</a><br>\nSeems picking the first one on the list is not a reasoned approach: 72513-3.. but that is my current thinking</p>",
        "id": 153992854,
        "sender_full_name": "John Moehrke",
        "timestamp": 1535996462
    },
    {
        "content": "<p>I think it depends on how the assessment is being captured (e.g., was a specific instrument used?).  For example, if the popular FACES scale was used, then you'd want to use the specific code for the Wong-Baker FACES scale (38221-8).  I <em>think</em> that terminologists would say that based on how the question is asked, an 8 on one pain scale may be different than an 8 on another (even if they're both 1-10) -- so the more specific the code, the better.</p>",
        "id": 153993097,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1536085047
    },
    {
        "content": "<p>We developed some CDS around pain management and for that CDS we represented pain scales as <code>Observation</code>s with the <code>survey</code> category (as <span class=\"user-mention\" data-user-id=\"195679\">@Michael Wang</span> suggested above).  We also discovered, however, that some major vendors don't support returning <code>survey</code> Observations via their FHIR APIs (since Argonaut only describes vitals, labs, and smoking status).</p>",
        "id": 153993101,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1536085251
    },
    {
        "content": "<p>In this case it is just a drop-down number selection. so no faces. I can eliminate that more specific code. Which is the most general code? It is not clear to me which is the most general (yet an evaluation of pain 1-10).</p>",
        "id": 153993118,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536087541
    },
    {
        "content": "<p>In <a href=\"https://github.com/synthetichealth/synthea\" target=\"_blank\" title=\"https://github.com/synthetichealth/synthea\">synthea</a> we're about to add pain Observations to wellness encounters using the <code>72514-3</code> LOINC code on the scale of 1-10.</p>",
        "id": 153993177,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1536094063
    },
    {
        "content": "<p>so does the evaluated pain value go into Observation.valueQuantity, for which what are the units for 1-10 evaluation. Or do we put it into Observation.valueCodeableConcept, for which what is the code-system. or do we just drop the value into Observation.valueString?</p>",
        "id": 153996756,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536858690
    },
    {
        "content": "<p>or valueInteger?</p>",
        "id": 153996757,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536858714
    },
    {
        "content": "<p>Is a value of 1.372 allowed?  If not, you're looking at valueCodeableConcept or valueInteger</p>",
        "id": 153996761,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536859274
    },
    {
        "content": "<p>I think it is just integers 1-10. Just wondering if there is a unit standard defined so that I could use valueQuantity for most clarity.  Not sure how valueCodeableConcept helps without a coding system...</p>",
        "id": 153996766,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536859946
    },
    {
        "content": "<p>loinc 72514-3 as the Observation.code seems to make it clear that the value is just an integer from 1-10. So I am leaning toward valueInteger. except I have DSTU2 which does not have valueInteger, so should I use valueString in DSTU2?</p>",
        "id": 153996769,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536860221
    },
    {
        "content": "<p>I guess I could use valueCodeableConcept with this valueset, but ugly values <a href=\"https://r.details.loinc.org/AnswerList/LL2335-9.html\" target=\"_blank\" title=\"https://r.details.loinc.org/AnswerList/LL2335-9.html\">https://r.details.loinc.org/AnswerList/LL2335-9.html</a></p>",
        "id": 153996771,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536860337
    },
    {
        "content": "<p>Glad the sequence numbers are 1 based, and the answers are 0 based, no confusion there...</p>",
        "id": 153997937,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1537326753
    },
    {
        "content": "<p>I noticed that too... of course the codes they offer are even worse.</p>",
        "id": 153998100,
        "sender_full_name": "John Moehrke",
        "timestamp": 1537365900
    }
]