[
    {
        "content": "<p>I am converting CCD (v3 and CDA) documents into FHIR, specifically working on Medication right now.  I would like to capture not only the codeSystem  but also the codeSystemName; e.g. OID \"2.16.840.1.113883.6.69\" and  \"NDC\", respectively.  However, the <a href=\"https://www.hl7.org/fhir/datatypes.html#Coding\" target=\"_blank\" title=\"https://www.hl7.org/fhir/datatypes.html#Coding\">FHIR datatype Coding</a> doesn't have the ability to capture the codeSystemName.  We don't currently have a FHIR server set up, so having this on the FHIR resource would make it easier to query for the proper code system, based on name instead of URI.<br>\n1) How is an end-user supposed to be able to identify the code system name in FHIR?  Does a FHIR server return the codeSystemName with a request?<br>\n2) Would it be possible/advisable to create an extension on Coding to include .systemName or .system.name?</p>",
        "id": 177923597,
        "sender_full_name": "Matt Zajack",
        "timestamp": 1570811043
    },
    {
        "content": "<p>Search CodeSystem resource using that uri. <code>CodeSystem?system=2.16.840.1.113883.6.69</code> then you get the name at <code>CodeSystem.name</code> or <code>CodeSystem.title</code></p>",
        "id": 177926978,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1570813359
    },
    {
        "content": "<p>it appears that we haven't defined an extension for that purpose. There's this one:</p>",
        "id": 177927204,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570813548
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/StructureDefinition/iso21090-CD-codeSystemName\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/iso21090-CD-codeSystemName\">http://hl7.org/fhir/StructureDefinition/iso21090-CD-codeSystemName</a></p>",
        "id": 177927330,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1570813633
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> - that is exactly what I was looking for.  For our purposes, we'll go ahead and define a CodeSystem Resource for each of our expected URI's.  We are taking that and transforming it into \"analytics-ready\" relational databases through well-specified flattening and exploding.<br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, thank you, also.  Great template there, but I will go with Yunwei's option to try to get more-ready for when we finally get a FHIR server.</p>",
        "id": 177960314,
        "sender_full_name": "Matt Zajack",
        "timestamp": 1570838504
    }
]