[
    {
        "content": "<p>Can anyone point me to resources or examples I should be exploring if I want to publish messages on , e.g., a patient-facing portal, notifying users of a planned outage (for example, from Wednesday through Saturday, display \"The system will be down between midnight and 3 AM Saturday for maintenance.\")? I've looked at Subscription, which feels like part of the puzzle...</p>",
        "id": 192472746,
        "sender_full_name": "John Carter",
        "timestamp": 1585702840
    },
    {
        "content": "<p>This does not seem something you would be doing using FHIR</p>",
        "id": 192474605,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1585704782
    },
    {
        "content": "<p>I've had a system that did this in v2.  It was handled using the data structure whose equivalent in FHIR is OperationOutcome.  Essentially it would be an 'information' message sent as a response to any request.  Not necessarily ideal, but potentially workable.</p>",
        "id": 192477579,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585708382
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . I will investigate  OperationOutcome. I wasn't quite comfortable with the idea that FHIR wouldn't be a way to do this thing, and I've since (re-)discovered  the HealthcareService.notAvailable...  <a href=\"http://hl7.org/fhir/R4/healthcareservice-definitions.html#HealthcareService.notAvailable\" title=\"http://hl7.org/fhir/R4/healthcareservice-definitions.html#HealthcareService.notAvailable\">http://hl7.org/fhir/R4/healthcareservice-definitions.html#HealthcareService.notAvailable</a>. That would seem to do what I want, at least for a physical practice, and I think the user of an online system could benefit from a similar kind of advertisement, so I can at least base an extension on something that already exists.</p>",
        "id": 192755224,
        "sender_full_name": "John Carter",
        "timestamp": 1585885639
    }
]