[
    {
        "content": "<p>We are currently facing the problem how to represent textual notes in FHIR. (e.g. for supportedBy(any) fields). The only option we currently are seeing is to save textual notes inside of a Binary resource. With the downside to be forced to base64 encode plaintext, which feels kind of strange to us as it introduces a transformation step for plaintext which shouldn't be necessary.</p>",
        "id": 153946488,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1521555958
    },
    {
        "content": "<p>One solution to this problem would be to allow content to be a string if contentType equals text/plain</p>",
        "id": 153946489,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1521556074
    },
    {
        "content": "<p>The two solutions that have been discussed are Observation and DocumentReference</p>",
        "id": 153946515,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521557479
    },
    {
        "content": "<p>As far as I remember from the New Orleans WGM, this is an ongoing discussion at the moment.</p>",
        "id": 153946518,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521557603
    },
    {
        "content": "<p>a DocumentReference pointing at a Binary. Where the Binary holds the text... Although when you upload the Binary it must be encoded inside the Binary resource structure, the same is not true when you retrieve it. If you retrieve it using http mechanisms that indicate you can accept the mime-type that the Binary content is natively known as, you will just get that native encoded content.... So if you have purely text, you will get back purely text; it will not be wrapped in a Binary, it will not be base64 encoded... (unless of course you ask for it in FHIR form)    see <a href=\"http://build.fhir.org/binary.html#rest\" target=\"_blank\" title=\"http://build.fhir.org/binary.html#rest\">http://build.fhir.org/binary.html#rest</a></p>",
        "id": 153946554,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521559009
    },
    {
        "content": "<p>This is a key question for clinical notes.  And John has explained the technical details using DR but I don't think we have come up with single way to do this going round and round a few times.  DR is really a reference to the thing and not the thing itself which is unsatifying.</p>",
        "id": 153946564,
        "sender_full_name": "Eric Haas",
        "timestamp": 1521559499
    },
    {
        "content": "<p>What I took from New Orleans on the point of \"notes\" is mainly, that it is not even clear, what \"note\" means exactly.<br>\nIt may be a formal clinical document containing many clinical details, or just an attachment to something like a Condition, Procedure or whatever. This makes it hard to have a single method of representing/storing/transmitting \"a note\".</p>",
        "id": 153946567,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521559770
    },
    {
        "content": "<p>Yes we have discussed this many times in PC and circle around  the question of \"what is a simple free text note\".    Lloyd forgot to mention ClinicalImpression although I'm in favor of a slimmer 'Evaluation' resource instead of overloading Observation even more.</p>",
        "id": 153946573,
        "sender_full_name": "Eric Haas",
        "timestamp": 1521560105
    },
    {
        "content": "<p>The proposal is that there would always be a DocumentReference.... where the DocumentReference could point at the various encodings. This only solves the 'how would I find notes''. It does not solve the 'where do I put this note', except to say 'where ever you put it, you must also create a DocumentReference.... which is why it is very unsatisfying.</p>",
        "id": 153946574,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521560173
    },
    {
        "content": "<p>I understood a FHIR Connectathon track was going to focus on further refinement... right?</p>",
        "id": 153946576,
        "sender_full_name": "John Moehrke",
        "timestamp": 1521560219
    },
    {
        "content": "<p>and Argonaut project as well</p>",
        "id": 153946580,
        "sender_full_name": "Eric Haas",
        "timestamp": 1521560424
    },
    {
        "content": "<p>The <em>thing</em> itself could be a Binary, pointed to by Attachment/DR. <br>\nBUT it feels strange to Base64 encode plaintext. Of course it works, but it is wasted traffic &amp; disk space. Therefore the idea of supporting plaintext directly in the Binary resource.</p>",
        "id": 153946589,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1521561418
    },
    {
        "content": "<p>Connectathon track write up: <a href=\"http://wiki.hl7.org/index.php?title=201805_Clinical_Notes_Track\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201805_Clinical_Notes_Track\">http://wiki.hl7.org/index.php?title=201805_Clinical_Notes_Track</a></p>",
        "id": 153946653,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521573308
    },
    {
        "content": "<p>Or the narrative in a Basic resource of some sort. ;)</p>",
        "id": 153947437,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1521763350
    },
    {
        "content": "<p>I also have the requirement to send plain text in a message (along with structured data). I've read the Connectathon write up (201805 Clinical Notes Track), which said it was going to test DocumentReference &amp; DiagnosticReport. I can only see a write up of DocumentReference, the Argonaut Clinical Notes HomePage doesn't seem to link to anywhere useful (for me to view the Clinical Notes profiling) &amp; Clinical Notes don't seem to have made it onto the US Core Implementation Guide site yet. From what I can see, to send some plain text, you create a DocumentReference, use DocumentReference.type to say what sort of plain text is being transmitted, you convert your plain text to base64 and put that in DocumentReference.content.attachment.data and set DocumentReference.content.attachment.contentType to \"text/plain\". Does that sound about right? - or has the thinking moved on? (perhaps to along the lines of Brian's thoughts of having a Basic resource with an Annotation &amp; type code extension)</p>",
        "id": 153963852,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1526914515
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span></p>",
        "id": 153963855,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526915971
    },
    {
        "content": "<p>The write-up on clinical notes will improve significantly in June -- we have been trying a few different approaches out.</p>",
        "id": 153963858,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1526916741
    },
    {
        "content": "<p>Your understanding of our current approach is correct (DocumentReference.content.attachment.data and set DocumentReference.content.attachment.contentType to \"text/plain\". )</p>",
        "id": 153963859,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1526916789
    },
    {
        "content": "<p>DiagnosticReport is a bit tricky -- it's not clear all vendors will expose through DocumentReference. We agreed to focus our energy on these five types:<br>\nDischarge documentation (18842-5)<br>\nConsultation (11488-4)<br>\nHistory &amp; Physical (34117-2)<br>\nProgress note (11506-3)<br>\nProcedures note (28570-0)</p>",
        "id": 153963860,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1526916950
    },
    {
        "content": "<p>This summary <a href=\"https://docs.google.com/presentation/d/160GBt9caqXGx2CiizRJjI9mZa3ZjMej2RQRwIKlVK_c/edit#slide=id.g372a78d230_2_92\" target=\"_blank\" title=\"https://docs.google.com/presentation/d/160GBt9caqXGx2CiizRJjI9mZa3ZjMej2RQRwIKlVK_c/edit#slide=id.g372a78d230_2_92\">presentation</a> to patient care last week might be helpful.</p>",
        "id": 153963862,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1526916994
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192158\">@Dave Barnet</span> If an example would help, we've got a set of Postman requests you can check out: <a href=\"https://www.getpostman.com/collections/80389c641f9570e2745b\" target=\"_blank\" title=\"https://www.getpostman.com/collections/80389c641f9570e2745b\">https://www.getpostman.com/collections/80389c641f9570e2745b</a></p>",
        "id": 153963909,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1526933434
    },
    {
        "content": "<p>The attachment content in there is base 64 encoded plaintext.</p>",
        "id": 153963910,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1526933473
    },
    {
        "content": "<p>You have to use the native Postman client (not the Chrome app) for these to work.</p>",
        "id": 153963911,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1526933492
    },
    {
        "content": "<p>I am guessing that raw text would be loaded in Postman.</p>",
        "id": 153974250,
        "sender_full_name": "Dwight Walker",
        "timestamp": 1531061133
    }
]