[
    {
        "content": "<p>We are trying to find the best way to represent materials like Syringes, Gloves, Masks, Diapers, etc. Should we use Substance or DeviceDefinition?</p>\n<p>As I understand, the DeviceDefinition has more detailed information, but it implies the need to use the Device to represent the instances of the Material. </p>\n<p>The problem here is some materials we don't have an UUID, and we just need to control the amount in storage with the inputs and outputs.</p>\n<p>On the other hand we have the Substance Resource, that seems to allow us to represent some Simple Materials. But I am not sure if that is the \"natural\" way to represent the Material.</p>\n<p>Anyway, anybody has faced this dilemma? Any thoughts about what aproach is the best?</p>\n<p>Thanks in advance!</p>",
        "id": 275653277,
        "sender_full_name": "Rodrigo Sendin",
        "timestamp": 1647524364
    },
    {
        "content": "<p>Unless you want to represent the glove etc. purely by what they are made of (e.g. latex) then these things are definitely not substances. A substance is a basic material, not the things made out of it.</p>",
        "id": 275654482,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1647524879
    },
    {
        "content": "<p>FHIR isn't really designed around inventory management.  If you're going to exchange information on that, you're likely to need to create your own using the Basic resource.</p>",
        "id": 275657775,
        "sender_full_name": "David Pyke",
        "timestamp": 1647526116
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192587\">David Pyke</span> <a href=\"#narrow/stream/179166-implementers/topic/How.20to.20represent.20Common.20Materials.20in.20FHIR.3F/near/275657775\">said</a>:</p>\n<blockquote>\n<p>FHIR isn't really designed around inventory management.  If you're going to exchange information on that, you're likely to need to create your own using the Basic resource.</p>\n</blockquote>\n<p>Ok. But what about the financial management? How do I represent these materials in the ChargeItemDefinition? The instance of a ChargeItemDefinition allows me to reference (Medication | Substance | Device). Should I extend it to allow to reference this \"new resource\"?</p>",
        "id": 275808908,
        "sender_full_name": "Rodrigo Sendin",
        "timestamp": 1647613318
    },
    {
        "content": "<p>If you use a Basic resource to represent generic materials, then an extension-reference to that Basic resource would be called for.</p>",
        "id": 275811795,
        "sender_full_name": "René Spronk",
        "timestamp": 1647614645
    },
    {
        "content": "<p>I think those are not \"materials\" at all, but are Devices. The only reason I didn't suggest devices in the first place is that there can be some grey areas around what are devices or  medications (not just in FHIR but in the real world). But I think in this case best to use Device.</p>",
        "id": 275813954,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1647615612
    },
    {
        "content": "<p>Looking at the definition of Device - that doesn't match at all I'm afraid. Basic it is.</p>",
        "id": 275824823,
        "sender_full_name": "René Spronk",
        "timestamp": 1647619883
    },
    {
        "content": "<p>there is a bunch of CR asking for clarity to Device... as it is rather medical-device specific today, yet it is not intended to be that specific.</p>",
        "id": 275825143,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647619991
    },
    {
        "content": "<p>so my understanding is that Device is intended to cover any 'thing' that is not clearly in another camp (medication)</p>",
        "id": 275825634,
        "sender_full_name": "John Moehrke",
        "timestamp": 1647620193
    },
    {
        "content": "<p>Mmm. Okay, but a  definition in terms of (use C if \"not A, not B\") is always a sign of weakness, so we better come up with something sensible. Devices may also then not be the best name for the resource.</p>",
        "id": 275826344,
        "sender_full_name": "René Spronk",
        "timestamp": 1647620478
    },
    {
        "content": "<p>~A type of a manufactured item that is used in the provision of healthcare without being substantially changed through that activity. The device may be a medical or non-medical device.<br>\nWhy would a glove or syringe not fit that I wonder?</p>",
        "id": 275828517,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1647621297
    },
    {
        "content": "<p>Device absolutely covers bandages, blankets, etc.</p>",
        "id": 275833442,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647623175
    }
]