[
    {
        "content": "<p>We are using the MedicationAdministration resource to capture each Insulin administration recorded by a pump device at different times of the day. We also need to capture a summary/total of the Insulin administered per day. We are unable to capture this in MedicationAdministration again because it will lead to data duplication. Is there any way to handle this in the MedicationAdministration resource? Or can we use a different resource like MedicationStatement to capture the summary? Since this data is coming from a device I am not sure MedicationStatement is ideal. Any inputs are highly appreciated. <br>\nThanks!</p>",
        "id": 231619463,
        "sender_full_name": "Keerthi M",
        "timestamp": 1616585942
    },
    {
        "content": "<p>Two options:</p>\n<ul>\n<li>you could have two MedicationAdministration instances, with the detailed ones having a 'partOf' relationship to the overall.  That would mean you'd need to define your 'overall' before you define your details, and then update it at the end of the day to reflect the totals (or perhaps update it as you go).  You wouldn't have a duplication issue because the partOf relationships would differentiate the 'detail' records from the 'summary' record</li>\n<li>you could use MedicationStatement as your summary and would need to use an extension to indicate the source as a Device (feel free to submit a change request to add Device as an allowed informationSource in future versions).  That's probably more granular than what most systems would expect MedicationStatement to be used for, but it could work.</li>\n</ul>",
        "id": 231630087,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616591346
    },
    {
        "content": "<p>+1 for option 1 above, this is what was defined in IHE Pharmacy MMA profile for this very topic.</p>",
        "id": 231666838,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616604065
    },
    {
        "content": "<p>The \"overall\" medAdmin should be created from the moment you know that you have a \"overall\" and a detail. <br>\nSo you can actually start with the details, but the moment that you change anything (flow rate, change the bag of drug or the bag of solvent, etc) at that moment you create a \"overall\"</p>",
        "id": 231667259,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616604219
    },
    {
        "content": "<p>An Observation for the summary/total derived from those MedicationAdministrations everyday?</p>",
        "id": 231667449,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616604270
    },
    {
        "content": "<p>Observation is also viable - but it's sort of sliding down the \"everything's an Observation\" slope.</p>",
        "id": 231668726,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616604747
    },
    {
        "content": "<p><a href=\"https://www.ihe.net/uploadedFiles/Documents/Pharmacy/IHE_Pharm_Suppl_MMA_Rev1.0_PC_2017-10-19.pdf#page=21\">https://www.ihe.net/uploadedFiles/Documents/Pharmacy/IHE_Pharm_Suppl_MMA_Rev1.0_PC_2017-10-19.pdf#page=21</a></p>",
        "id": 231671949,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616605750
    },
    {
        "content": "<p>Ha-ha， EHR would be at the bottom<span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 231727019,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1616629395
    },
    {
        "content": "<p>Many thanks for all the inputs!</p>",
        "id": 232403366,
        "sender_full_name": "Keerthi M",
        "timestamp": 1617099893
    }
]