[
    {
        "content": "<p>Hi, I need to use FHIR for patient emergency number similar to v2 PID.13 with type code \"EMG\".  I noticed that in ContactPointUse there is no code for \"emergency\" but \"home\" may be a fit since it \"Typically used with urgent cases, or if no other contacts are available\". Is this an acceptable way to do it? I'm hesistant to use Patient.contact since the number may not belong to the emengency contact person, but the patient himself. Thanks a lot!</p>",
        "id": 154021393,
        "sender_full_name": "frank cao",
        "timestamp": 1543434927
    },
    {
        "content": "<p>For emergency contacts, you could use RelatedPerson.contact, where RelatedPerson.relationship=C (Emergency Contact). Will the Emergency Contact always be a separate person, or could it also be an Emergency Number for the Patient themselves?</p>",
        "id": 154021419,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1543439477
    },
    {
        "content": "<p>Hi Ken, in our use case, all we have is a patient emergency number. We don't know if the number belongs to the patient or someone else. Between RelatedPerson and Patient.contact (currently used), I think the latter is a better fit. My question is more driven from the v2 perspective, since in v2, the emergency number is represented in PID, not NK1.</p>",
        "id": 154021680,
        "sender_full_name": "frank cao",
        "timestamp": 1543502284
    },
    {
        "content": "<p>It is unfortunate that ContactPoint.use vocabulary is \"Required\", meaning you can't add a new type of contact point. This would seem to be the most logical solution given your use-case.  You could add an extension to Patient. I think your use-case is common enough to submit a change request that could affect R5</p>",
        "id": 154021688,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543503227
    },
    {
        "content": "<p>Thanks John.  We'll take this into consideration.</p>",
        "id": 154021726,
        "sender_full_name": "frank cao",
        "timestamp": 1543510369
    },
    {
        "content": "<p>Hope Graham or Llyod can provide their opinon on this. I would like to understand the design rationale to support patient emergency number concept in FHIR.  Was there a reason to not support \"EMG\" (emergency) in ContactPointUse? Is it the FHIR recommendation to use Patient.contact or another element to capture this concept?</p>",
        "id": 154022549,
        "sender_full_name": "frank cao",
        "timestamp": 1543861701
    },
    {
        "content": "<p>This would be Patient.contact[relationship.coding.code = C].telecom, just like in v2 (at least in FHIR R4 that is true)</p>",
        "id": 154022581,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543866967
    },
    {
        "content": "<p>Comparing the CDA and FHIR representation of the IPS based on this <a href=\"#narrow/stream/207835-IPS/topic/Representing.20Patient.20emergency.20contact.20in.20IPS\">thread</a>) I noticed that the CDA representation allows to distinguish between the kind of contact (e.g. emergency contact)and the relationship with the person. <br>\nAre both these concepts conveyed by the relationship FHIR element ?</p>",
        "id": 219609894,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1607695880
    }
]