[
    {
        "content": "<p>Hi. Someone could tell me what is the best way to do BI using FHIR. That is, in the case of having all the information on an FHIR server, what is recommended to build a data warehouse, including the dimensional modeling, from these data in FHIR structure. If you could give me some suggestions or point me in the rigth direction I’ll be grateful.</p>",
        "id": 160215355,
        "sender_full_name": "Andy Sanchez",
        "timestamp": 1551977306
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 160215408,
        "sender_full_name": "Andy Sanchez",
        "timestamp": 1551977340
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 160215861,
        "sender_full_name": "Andy Sanchez",
        "timestamp": 1551977662
    },
    {
        "content": "<p>There's no single solution or best approach.  There are a wide variety of ways of organizing FHIR data for persistance and query and what is \"best\" will depend on your use-cases, what types of technologies you want to use, what your volume and performance needs are, etc.  You might find some useful ideas - and get a sense of some of the options - reading through the <a class=\"stream\" data-stream-id=\"179289\" href=\"/#narrow/stream/179289-storage-for-FHIR\">#storage for FHIR</a> stream.</p>",
        "id": 160217016,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551978508
    },
    {
        "content": "<p>Thanks for the response Lloyd. In my case I am working on a project in which there are two SQL databases in Azure, one to concentrate data from several external systems with a bit of preprocessing and another that is dimensionally modeled to facilitate the analysis of the business, which It consumes the data directly from the first database. The entire ETL process is being carried out through  Azure Data Factory. Finally, Power BI is used to create different reports according to the needs of the business having as source the second database.</p>\n<p>The problem is that now the external systems that had their data in SQL relational databases are now migrating to FHIR servers, which means that the ETL process changes completely as does the structure of our databases. On the other hand, Power BI, which is the data analysis tool that we must use, does not yet have integration with FHIR. I would like to know under these conditions and taking into account that we consider the performance important, which are the edges that are currently being used in these cases. Maybe if you know some references that can help us would be great.</p>",
        "id": 160234845,
        "sender_full_name": "Andy Sanchez",
        "timestamp": 1551990669
    },
    {
        "content": "<p>I'd recommend raising this question on the <a class=\"stream\" data-stream-id=\"179289\" href=\"/#narrow/stream/179289-storage-for-FHIR\">#storage for FHIR</a> stream.  Hopefully someone there can provide some insights.</p>",
        "id": 160235292,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551991052
    },
    {
        "content": "<p>Ok thanks <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 160235401,
        "sender_full_name": "Andy Sanchez",
        "timestamp": 1551991124
    },
    {
        "content": "<p>RonFHIR is a package for accessing a FHIR server. And R can be used in PowerBI (<a href=\"https://docs.microsoft.com/fr-fr/power-bi/desktop-r-in-query-editor\" target=\"_blank\" title=\"https://docs.microsoft.com/fr-fr/power-bi/desktop-r-in-query-editor\">https://docs.microsoft.com/fr-fr/power-bi/desktop-r-in-query-editor</a>). It can be a solution.</p>",
        "id": 160357580,
        "sender_full_name": "Jean-Christophe Cauvin",
        "timestamp": 1552119947
    }
]