[
    {
        "content": "<p>According to the FHIR documentation regarding Canonical URLs (<a href=\"https://www.hl7.org/fhir/references.html#canonical\">https://www.hl7.org/fhir/references.html#canonical</a>) references using the <code>url</code> element should be used when referencing conformance resources. According to the docs, a link such as <code>http://hl7.org/fhir/ValueSet/my-valueset|1.0</code> should be translated into a fhir search as in <code>fhir/ValueSet?url=http://hl7.org/fhir/ValueSet/my-valueset&amp;version=1.0</code>. Does this mean that a FHIR server should return a bundle when encountering <code>ValueSet/my-valueset</code> or just the resource? The docs mention about a result bundle if there is no match. Should the fhir server supposed handle this link at all? I'm working with a microsoft fhir server, and this type of interaction is not supported.</p>",
        "id": 271950224,
        "sender_full_name": "Donn Relacion",
        "timestamp": 1644919046
    },
    {
        "content": "<p>It's a search like any other, so the result will always be a Bundle, regardless of the number of matches.</p>",
        "id": 271951779,
        "sender_full_name": "René Spronk",
        "timestamp": 1644919869
    },
    {
        "content": "<p>My concern is that the link <code>ValueSet/my-valueset</code> doesn't really look like a search interaction, it looks like a read interaction.</p>",
        "id": 271952827,
        "sender_full_name": "Donn Relacion",
        "timestamp": 1644920428
    },
    {
        "content": "<p>There is no expectation that <code>[base]/ValueSet/my-valueset|someVersion</code> will necessarily resolve.  Instead, you parse and do a search wherever you typically store valuesets.  As a last resort, you can do a search on [base]/ValueSet?url=...&amp;version=someVersion.  (There's no expectation you can necessarily do a 'read' because there could be multiple instances of the same value set on the server, though it's super-convenient if doing a read gives you the 'current' value set.</p>",
        "id": 271989715,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644938695
    },
    {
        "content": "<p>Our project is currently working with Questionnaire resources, and we want it to be easier for the front-end to easily get the Questionnaire without using the autogenerated id created by the server. Initially, we decided with controlling the resource Id by using PUT instead of POST. But then the topic of versioning came up, I found that the same Id cannot be used, and that's when I looked into adding support for the canonical link.</p>\n<p>Returning a bundle may not be very convenient with the end users though, but since this behavior is not expected of FHIR servers, I guess we could get away with returning only the best matching resource. Another option would be to continue using  the custom resource Id but adding the version in the Id and avoid this change altogether.</p>",
        "id": 272065911,
        "sender_full_name": "Donn Relacion",
        "timestamp": 1644977861
    },
    {
        "content": "<p>We're looking at defining an operation that will retrieve a canonical - it'll grab the \"most recent\" if no version is specified, using the version comparison mechanism defined by the resource.  That would give you a singleton.  Otherwise, yes, you'll be dealing with a Bundle - presumably with one instance if you specify url + version.</p>",
        "id": 272068405,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644980554
    }
]