[
    {
        "content": "<p>Hi,</p>\n<p>Long story short. Im working on a web api and have an endpoint /Appointment. One thing that it supports is GET on all Appointments for a certain Patient. The frontend guy in the other end now want to know if any of the Appointments hes reciving is available for cancellation. Basically we have a set of rules, \"Cant cancel within 24 hours\" etc. </p>\n<p>After looking at the Appointment resource i cant find any way of describing this? So my question is how can i do this? <br>\nI was thinking that a simple status code like \"cancellation-not-available\" would do it but cant find anything like that. Im guessing im missing something around the idea of working with Appointment in Fhir?</p>\n<p>Thank you,</p>",
        "id": 177316692,
        "sender_full_name": "Jakob Lindblad",
        "timestamp": 1570174647
    },
    {
        "content": "<p>There are many situations like this, and you might still be able to cancel, but will incur charges, or need further actions if it occurs. Many of these are not standardised, so what we have included is a cancellation reason that can be used to indicate what happened, then other back end rules can take it from there.</p>",
        "id": 177322536,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1570180669
    },
    {
        "content": "<p>(can't recall if it's an extension or prop going into R5)</p>",
        "id": 177322604,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1570180706
    },
    {
        "content": "<blockquote>\n<p>There are many situations like this, and you might still be able to cancel, but will incur charges, or need further actions if it occurs. Many of these are not standardised, so what we have included is a cancellation reason that can be used to indicate what happened, then other back end rules can take it from there.</p>\n</blockquote>\n<p>Not sure if we are on the same page here. What i am trying to achive is some sort of indication to frontend that this Appointment cant be cancelled. Basically the frontend will list all current Appointment for the specific patient with a button to each one -&gt; \"Cancel booking\".  I will decide based on business rules if this Appointment can be cancelled or not and frontend should be able to \"toggle\" on this status. So the reason for the cancellation is irrelevant since the Appointment never should be cancelled in the first place :-) </p>\n<p>This leads me to my question if there is any thought around this scenario or maybe i should do some profiling? Like: \"AppointmentCanBeCancelled : true\" etcetc...</p>",
        "id": 177331660,
        "sender_full_name": "Jakob Lindblad",
        "timestamp": 1570190234
    },
    {
        "content": "<p>You can do that, but I would suspect that you'll then get the questions on how do I cancel this appointment, the patient has moved interstate, was deceased, the appointment is no longer possible as the patient took a medication that prevents it from being done, the practitioner is unable to attend for various reasons...</p>",
        "id": 177334236,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1570192708
    },
    {
        "content": "<p>This attribute doesn't exist, so you would create a profile on Appointment and add a field via an extension.   That field can be a boolean like you suggested.  Or you can give it a code if you want to convey more information than a simple yes/no.</p>",
        "id": 177335547,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1570193649
    },
    {
        "content": "<p>If you go the extension route, you'll also have to work within your community to ensure that client systems support it.  Obviously, in the event a system <em>doesn't</em> support it and tries to cancel anyhow, you'd return a business error</p>",
        "id": 177350100,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570202957
    },
    {
        "content": "<p>Thank you for all the answers. After looking at the options i was thinking about using the \"Tag\" with some defined codes. Since im not very keen on going the extension route in this case.</p>",
        "id": 177590832,
        "sender_full_name": "Jakob Lindblad",
        "timestamp": 1570520681
    }
]