[
    {
        "content": "<p>I am trying to search resources by extensions, like searching all the Observation resource with gene name TPMT, and this gene name is stored in the observation-geneticsGene profile extension. Someone told me that to search by an extension, you'll need to define a custom SearchParameter and declare it in your CapabilityStatement.<br>\nI am confused about the CapabilityStatement, can anyone tell me what it is?</p>",
        "id": 153900160,
        "sender_full_name": "Sophie Chen",
        "timestamp": 1501693728
    },
    {
        "content": "<p>You can read all about it here: <a href=\"http://build.fhir.org/capabilitystatement.html\" target=\"_blank\" title=\"http://build.fhir.org/capabilitystatement.html\">http://build.fhir.org/capabilitystatement.html</a>.  It basically declares what your system supports - in your case you would want the server to support your custom search parameter.   Here is an example Capability Statement for US Core: <a href=\"http://build.fhir.org/ig/HL7/US-Core/capstmnts.html#patient\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/US-Core/capstmnts.html#patient\">http://build.fhir.org/ig/HL7/US-Core/capstmnts.html#patient</a>   ( Note it doesn't support any custom search parameters.)</p>",
        "id": 153900162,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501694089
    },
    {
        "content": "<p>note that you don't need to <em>do</em> any of the things with SearchParameter and CapabilityStatement to make the search actually work - they are just a computable way to tell users of your server what you did</p>",
        "id": 153900204,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501707461
    },
    {
        "content": "<p>Thank you for your notice. I am now using HAPI server. Shouldn't I firstly create examples of SearchParameter and CapabilityStatement to support the observation extension that I want to search?</p>",
        "id": 153900255,
        "sender_full_name": "Sophie Chen",
        "timestamp": 1501713742
    },
    {
        "content": "<p>Thank you for your notice. I am now using HAPI server. Shouldn't I firstly create examples of SearchParameter and CapabilityStatement to support the observation extension that I want to search?</p>",
        "id": 153900256,
        "sender_full_name": "Sophie Chen",
        "timestamp": 1501713758
    },
    {
        "content": "<p>Thank you for your information, and I am sure it will be useful. I am now using HAPI server. Should I also create an example of CapabilityStatement to support the observation extension that I want to search?</p>",
        "id": 153900258,
        "sender_full_name": "Sophie Chen",
        "timestamp": 1501713866
    },
    {
        "content": "<p>I am unclear if you are just searching on the hapi reference server. if you are only searching.  You don't need either one.  The server does all the work.  You can specify your client capabilities too - but if the server doesn't support it you are out of luck</p>",
        "id": 153900261,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501714308
    },
    {
        "content": "<p>The HAPI documentation explains how to set up an additional search parameter...</p>",
        "id": 153900267,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1501716212
    }
]