[
    {
        "content": "<p>I am pretty sure that it is not a new question, but anyway:<br>\nWhat is the best approach to handle Code Systems if I can receive any data? <br>\nEX: third-party system sends to me Allergy resource with something like: \"Code\": \"7982\", \"Codeset\": \"RxNorm\", \"Name\": \"Penicillin\". And I need to convert it to FHIR AllergyIntolerance with AllergyIntolerance.code (CodeableConcept).<br>\nCodesets from that third-party are not \"official\" and no restrictions to them, so anything can be there. The same for code. <br>\nSo how to convert that data to FHIR? <br>\nOptions I see so far:</p>\n<ol>\n<li>Use only \"text\" in CodeableConcept? But the type itself will be lost since we can store only one value there. And search by that field will not work.</li>\n<li>\"System\" field = original \"Codeset\" as is. Not sure.</li>\n<li>Use for \"System\" some custom URLs like \"<a href=\"https://myapp.com/CodeSystem/{codeSystemFamily\">https://myapp.com/CodeSystem/{codeSystemFamily</a> or just \"Unknown\"}/{codeset received from third-party as is}\". Looks as less evil for me but still evil since we are creating CodeSystems on a fly.<br>\nPlease advise.</li>\n</ol>\n<p>UPD<br>\nOr even:</p>\n<ol start=\"4\">\n<li>\"<a href=\"https://myapp.com/CodeSystem/{codeSystemFamily\">https://myapp.com/CodeSystem/{codeSystemFamily</a> or just \"Unknown\"}/{third-party system id}/{codeset received from third-party as is}\". In this case it will be linked to a specific third-party source.</li>\n</ol>",
        "id": 229927135,
        "sender_full_name": "Pash",
        "timestamp": 1615497347
    },
    {
        "content": "<p>I'd probably use a normalization algorithm to try to recognize as many variants of RxNorm as possible (RX NORM, Rx-Norm, Rxnrm), etc. based on your historical data for any common/well-known systems that have actual URLs and then map to those URLs.  For anything else, send the code with no system and send the \"code system name\" as an extension.  (In fact, submit a change request and we can define a 'standard' extension for this, because it's certainly an issue lots of people will have).</p>",
        "id": 229929610,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615498274
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> yes, I've already implemented some simple normalization, so \"RxNorm\" is a bad example here, \"hurrdurr\" is a better example. Solution with extension is great but it will make it impossible to search by it (I am implementing only proxy app and using FHIR server I can't extend)</p>",
        "id": 229932078,
        "sender_full_name": "Pash",
        "timestamp": 1615499242
    },
    {
        "content": "<p>You can search by identifier without specifying system - but you risk false matches.  That's the price of not having a computable system.</p>",
        "id": 229932614,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615499433
    },
    {
        "content": "<p>Generating on the fly doesn't help because the person searching won't know what URL to use to search when they're looking for the \"hurrdurr\" id.  (Also, in some case there are 'standard' URIs defined in the core spec and if you use something other than the approved URI, you're non-conformant.</p>",
        "id": 229932919,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615499535
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> at least it will be possible to search by \"<a href=\"https://myapp.com/CodeSystem/Unknown/hurrdurr\">https://myapp.com/CodeSystem/Unknown/hurrdurr</a>\". So do you think that it is so a bad workaround?</p>",
        "id": 229933776,
        "sender_full_name": "Pash",
        "timestamp": 1615499848
    },
    {
        "content": "<p>I wouldn't use \"CodeSystem\" in the URL because it looks like a FHIR URL but isn't.  Also, you'd have to worry about whether all of your string values would fit nicely in a URL.  However the biggest question is: who's going to know to search on it?</p>",
        "id": 229935632,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615500345
    },
    {
        "content": "<p>So will just \"hurrdurr\" be better for \"System\" or \"<a href=\"https://myapp.com/UnknownCodeSystem/hurrdurr\">https://myapp.com/UnknownCodeSystem/hurrdurr</a>\"? <br>\nGood point, string values will be escaped, so it should be OK. <br>\nRegarding \"who's going to know\" , yes, it is a problem, but at least we can provide a search mechanism, handle some situation when normalization failed and data already saved, and use guidance \"try to search by \"https://myapp.com/CodeSystem/Unknown/\"code you may expect\"\" and not just \"it's impossible to search by not supported codes (normalized)\". So want to find \"less evil\" here.</p>",
        "id": 229937907,
        "sender_full_name": "Pash",
        "timestamp": 1615500913
    },
    {
        "content": "<p>It really comes down to your clients.  If they're going to be customized to work in your space and will have a clue what \"hurrdurr\" is, then your approach has merit.  If not, then you're not achieving interoperability and may be adding complexity to it because you're making it appear that the identifier is a different system than it really is.  A system that's looking for a match on BC provincial health number that gets a match on an identifier for an identifier with no system can treat that as a \"possible match\".  On the other hand, if it sees an identifier with a system of \"<a href=\"http://myapp.com/CodeSystem/Unknown-bchn\">http://myapp.com/CodeSystem/Unknown-bchn</a>\", it'll say definitively that that's <em>not</em> a match.</p>",
        "id": 229940099,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615501818
    },
    {
        "content": "<p>Good Qs&amp;As. Looking foward to a standard practice.</p>",
        "id": 230035163,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1615558543
    }
]