[
    {
        "content": "<p>Hi all, is there a good way to represent a household, family, neighbourhood and/or community? I have 2 use cases where a household is being tracked. Wondering if it makes sense to categorize them in a Group resource. Organization and then specifying a type seems like it could also work. Otherwise I'll just create a web of Patients and RelatedPerson resources.  For Neighbourhood and Community I think Location could make a lot of sense.</p>",
        "id": 230733444,
        "sender_full_name": "Alex Goel",
        "timestamp": 1616002348
    },
    {
        "content": "<p>Are you representing the population or the geographic boundaries?</p>",
        "id": 230734515,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1616002684
    },
    {
        "content": "<p>population</p>",
        "id": 230740625,
        "sender_full_name": "Alex Goel",
        "timestamp": 1616004826
    },
    {
        "content": "<p>Typically it would be Group.  A Group is a collection that cannot take collective action or have collective responsibility.  An Organization can take collective action and have responsibility.</p>",
        "id": 230748751,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616007803
    },
    {
        "content": "<p>In this scenario, assuming there is a head of the household and all other patients (members of the household) are effectively organised underneath them (e.g. I search for a patient by a mobile number and I return all of the household members), what would be the best way to model that? Would it require an extension on the Patient resource? Thanks<br>\ncc: <span class=\"user-mention\" data-user-id=\"192545\">@Alex Goel</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"366686\">@Jing Tang</span> <span class=\"user-mention\" data-user-id=\"388012\">@Matt Berg</span></p>",
        "id": 242059577,
        "sender_full_name": "Fred Hersch",
        "timestamp": 1623243160
    },
    {
        "content": "<p>For what purpose?  Are you looking for who's covered by insurance?  Who resides in the same building?  The same apartment?</p>",
        "id": 242060377,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623243545
    },
    {
        "content": "<p>In some LMICs insurance is covered by who is in the household, <span class=\"user-mention\" data-user-id=\"315122\">@Fred Hersch</span> is that use case here?</p>",
        "id": 242061299,
        "sender_full_name": "Alex Goel",
        "timestamp": 1623243984
    },
    {
        "content": "<p>If you're talking about insurance, then you'd be querying based on the Coverage resource.  The head of household would be the 'member' and the family members would be beneficiaries.</p>",
        "id": 242071335,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623247845
    },
    {
        "content": "<p>Quite common in an LMIC community health setting ..e.g a community health worker performing household visits. A specific one is for a population health registry. You want to register all members of the household and nominate a specific member as the 'head of household'</p>",
        "id": 242086931,
        "sender_full_name": "Fred Hersch",
        "timestamp": 1623253647
    },
    {
        "content": "<p>Hmm.  There's an ability to link RelatedPerson to a corresponding Patient resource - in theory you could traverse that to get a full set of Patient instances tied to a particular head of household.  The other option would be using Group.  If you're getting into neighborhood or community, Group is really your only option.</p>",
        "id": 242217857,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623336149
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Thanks a lot</p>",
        "id": 242228009,
        "sender_full_name": "booma radhakrishnan",
        "timestamp": 1623340149
    },
    {
        "content": "<p>Thanks all. Sounds good. cc: <span class=\"user-mention\" data-user-id=\"366686\">@Jing Tang</span></p>",
        "id": 242562042,
        "sender_full_name": "Fred Hersch",
        "timestamp": 1623656458
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Would it be feasible to use (or extend) the Group.managingEntity(Patient) to refer to the Head of the Household? I think this is primarily used for defining who is responsible for managing the entity .. and should probably be the Practitioner .. But there would be a CareTeam to Group reference to capture this latter relationship.</p>",
        "id": 242966828,
        "sender_full_name": "Fred Hersch",
        "timestamp": 1623897856
    },
    {
        "content": "<p>I think if you want to flag one of the group members as having some special significance, an extension is probably best.  managingEntity is who's responsible for maintaining the group - which I'm assuming typically wouldn't be the head-of-household.</p>",
        "id": 243975119,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624657799
    }
]