[
    {
        "content": "<p>It is important to note the maximally tolerated dosage for various medications in some settings.  A good example is beta blockers, where patients with heat failure should be titrated to the maximally tolerated dose or the guideline dose, whichever is lower.  I've been thinking about the best way to model this with FHIR and not having much luck.  AlergyIntolerance doesn't have the notion of a dosage, nor does it take into account other medications that might be prescribed at the same time that are leading to the intolerance.  I've spoken with some HF Cardiologists that are hacking the Allergy section of their EMR to do this, but there should be a more expressive way.    </p>\n<p>AdverseEvent may be a way to model some of this, but there are gaps still.  MedicationStatement can be used to represent a single medication and has an ability to include the dosage, and I can model multiple meds through multiple suspectEntity entries.  Querying AdverseEvents to find intolerances doesn't seem like the right approach though, there needs to be some judgement here as to the conclusion to be drawn from the AdverseEvent.  There is also the problem that most of the AdverseEvent fields and codes seem to indicate that AdverseEvents are never to be expected or a normal course of traetment.</p>\n<p>Would appreciate any advice in this area.</p>",
        "id": 212781716,
        "sender_full_name": "Tom Stanis",
        "timestamp": 1602216681
    },
    {
        "content": "<p>Maybe LOINC Codes could be used to model such a panel.</p>",
        "id": 212814736,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602244430
    },
    {
        "content": "<p>A simple search shows that there is no such a specific LOINC code.  Perhaps need to propose a new term.</p>",
        "id": 212815299,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602244782
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span></p>",
        "id": 212816409,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602245500
    },
    {
        "content": "<p>MedicationKnowledge has this sort of context specific use of a medication e.g. MedicationKnowledge.administrationGuideline, perhaps with Dosage.type = \"max tolerated\"?</p>\n<p>It is definitely not AllergyIntolerance, AdverseEvent or MedicationStatement. Those are for actual patient contexts, not for this sort of \"textbook\" information.</p>",
        "id": 212817148,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602245942
    },
    {
        "content": "<p>This is actually in the context of a patient.  Some patients may only be able to tolerate X dose of something and we want to record that maximum for future care.</p>",
        "id": 212863104,
        "sender_full_name": "Tom Stanis",
        "timestamp": 1602269693
    },
    {
        "content": "<p>I think the semantics of <a href=\"http://hl7.org/fhir/allergyintolerance-definitions.html#AllergyIntolerance.reaction\"><code>AllergyIntolerance.reaction</code></a> are actually close -- they model things like what substance the patient was exposed to, and what <em>route</em> they were exposed by... it wouldn't feel totally out of place to have something like <code>exposureDose</code> here next to <code>exposureRoute</code>.</p>",
        "id": 212867214,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602272379
    },
    {
        "content": "<p>I take your point about capturing other concomitant meds, if you suspect it's a combination leading to the intolerance. This would feel more like the job of a new prop like <code>AllergyIntolerance.reaction.additionalSubstances</code> with the reaction record.</p>",
        "id": 212867542,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602272610
    },
    {
        "content": "<p>Yes, if AllergyIntollerance.reaction had exposureRoute that was a list of References (MedicationStatement|Procedure|Device) that would fit a lot of use cases.  Including a list of additional routes would be good also as a list of references.</p>",
        "id": 212876633,
        "sender_full_name": "Tom Stanis",
        "timestamp": 1602278076
    },
    {
        "content": "<p>\"route\" generally refers to a mechanism of exposure (oral, injection, etc) -- but yeah, a kind of <code>reaction.exposureReference</code> would help here.</p>\n<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> is this something Patient Care might explore, either as a core extension or element?</p>",
        "id": 212884348,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602284483
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> Also seems like an appropriate topic for Pharmacy.  My personal leaning is Observation.</p>",
        "id": 212939975,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602373136
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> so in the Observation model, one would use Observation.basedOn or Observation.partOf to reference the medications?</p>",
        "id": 212972630,
        "sender_full_name": "Tom Stanis",
        "timestamp": 1602435323
    },
    {
        "content": "<p>I'd just use Observation, in a similar manner to susceptability Observations - a component would identify the med and the Observation.value would identify the max tolerated dose.</p>",
        "id": 212976619,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602441709
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"333353\">@Tom Stanis</span> <strong>Goodness</strong> please lets not continue to cement ourselves into the \"any medication intolerance is an allergy\" hole. You'll give <span class=\"user-mention\" data-user-id=\"191487\">@Russell Leftwich</span> and I a stroke...  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> is on the right path.</p>",
        "id": 213091649,
        "sender_full_name": "Robert McClure",
        "timestamp": 1602541039
    },
    {
        "content": "<p>Observation is also a point-in-time assertion (max tolerated dose isn't static) and can assert method used to make the determination.</p>",
        "id": 213091761,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602541138
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> wait, who's suggesting that all intolerances are allergies? FHIR <code>AllergyIntolerance</code> isn't just about allergies.</p>",
        "id": 213091892,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602541256
    },
    {
        "content": "<p>oops - I stand corrected. I had forgotten the two ideas are melded into one resource. But I remain a bit concerned that a max <em>tolerated</em> dose would be an intolerance.</p>",
        "id": 213092276,
        "sender_full_name": "Robert McClure",
        "timestamp": 1602541606
    },
    {
        "content": "<p>I appreciate <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> looking out for my cerebrovascular health.   I think whatever distinction you try to make between an allergy and an intolerance, the Allergy/Intolerance resource models a property of the patient, not the dose or pharmacologic effect of the medication.   Allergy (broadly defined without mechanism) is an adverse reaction to an amount (dose) that would not be expected to cause an adverse reaction in most individuals.  The reference to titrating a dose in a patient with a certain condition places this in the category of a drug-disease integration.   As Rob suggests, the \"max dose\" concept is a different concept of tolerance and relates to the pharmacologic effect.  Clinically we refer to that as the maximum tolerated dose, not as intolerance of a higher dose.  Chemotherapy would be a more common example where \"maximum tolerated dose\" is typical in dose determinations. And I agree with Rob that Lloyd has the correct handling of this other type of intolerance.</p>",
        "id": 213107538,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1602558202
    },
    {
        "content": "<p>For what it's worth, Patient Care discussed this today and generally agreed Observation is acceptable if the intent is just to document the max tolerated dose in the chart.  However, Flag should be considered for future management.<br>\nCC:  <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 213506735,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1602810006
    },
    {
        "content": "<p>Thanks for the the followup on this.  Observation will work, but it  punts the problem to be dealt with in some coding system somewhere.  It effectively says this isn't a core problem that FHIR wants to model.  Allergies have all the same temporal problems as listed above (they change, and can be dependent on underlying conditions).   To ask another way, how might we model maximum tolerated dose?</p>",
        "id": 214275279,
        "sender_full_name": "Tom Stanis",
        "timestamp": 1603430888
    },
    {
        "content": "<p>I wouldn't say \"this isn't a core problem that FHIR wants to model\" as that seems too negative.  I'd say that it's the first time that someone has brought forward patient-specific maximum tolerated doses.  As a Pharmacy chair, I would agree with Patient Care's assessment that Flag is the proper resource for this.<br>\nFlag.status = active<br>\nFlag.category = maximum tolerated dose<br>\nFlag.code.text = &lt;what the maximum dose is&gt;<br>\nFlag.subject = Patient</p>",
        "id": 214322811,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1603464434
    },
    {
        "content": "<p>Where in this proposal do you say what the <em>drug</em> is?</p>",
        "id": 214335110,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1603470625
    },
    {
        "content": "<p>(This feels ad-hoc to me; the semantics for Flag can be super wide-ranging.)</p>",
        "id": 214335157,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1603470650
    },
    {
        "content": "<p>Flag is to highlight information that exists elsewhere in the record - it's for information that is urgent/critical for a practitioner to see prior to engaging with the patient.  It's not a primary place for storing information.  The primary place here would be Observation.  And I probably wouldn't recommend duplicating them in Flag as I don't think they meet the purpose of the resource.</p>",
        "id": 214335465,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603470815
    },
    {
        "content": "<p>Oh, Flag is interesting.  How do we indicate the context in which it is relevant?  One specialists might care very much about these maximum tolerated dose, while another might not and don't want the noise.</p>",
        "id": 214363419,
        "sender_full_name": "Tom Stanis",
        "timestamp": 1603485614
    },
    {
        "content": "<p>Flag has a category, so you can differentiate administrative flags from pharmacy flags from nursing flags.</p>",
        "id": 214396253,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603495018
    },
    {
        "content": "<p>Note that Flag isn't about \"what might a provider want to see\", but more \"What does a provider urgently need to know before engaging with or doing anything with the patient\".  Examples might include 'severe latex allergy\" or \"hard of hearing\" or \"has a dog that bites\"</p>",
        "id": 214396337,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603495092
    },
    {
        "content": "<p>Well, maximum tolerated doses aren't things that a clinician \"urgently needs to know before engaging\", they are more about understanding patient history.  In the context of prescribing new meds that are in the adjacent classes they would become urgently needed to be known.</p>",
        "id": 214453667,
        "sender_full_name": "Tom Stanis",
        "timestamp": 1603579361
    },
    {
        "content": "<p>This is interesting, as the actual \"maximum tolerated dose\" as worded, seems to imply within context of the specific patient. If you were to consider the \"Maximum indicated dose\" / guideline dose then that would imply the specific medication without context to a patient. Noting that there are always outliers and some medications are more flexible than others - mainly due to ADEs eg gentamicin, colchicine, and some are flexible: eg escitalopram, the AMH states 20mg is usually the maximum dose, but its not uncommon to see 40mg or 60mg. <br>\nTo the point though, under emergency treatment, you'd keep administering until a response is desired. Similarly, out in the community, doses are usually slowly titrated based on response. Its at that point that a clinician might want to record what the maximum dose was, in the case that the patient reduced their medication as it wasn't needed. But, again, clinical status/conditions change, what might've been the highest tolerated dose of medication (due to clinical response, eg blood pressure/ HR), 5 years later, may not be, and the patient may need less or more.</p>",
        "id": 214868157,
        "sender_full_name": "Jeremy R",
        "timestamp": 1603905037
    }
]