[
    {
        "content": "<p>Hi. I'm new to fhir. </p>\n<p>Im trying to map a set of lab results in a legacy database to fhir. Originally, each lab result is associated with a \"laboratory test type\" (eg. s-haemoglobin) which is again associated with a number of reference ranges (eg. this range applies for patients of  this age, sex an so on).  </p>\n<p>The Observation resource (<a href=\"https://www.hl7.org/fhir/observation.html\">https://www.hl7.org/fhir/observation.html</a>) has a field for referenceRange, and even seems to supports listing ranges that arent particulary relevant for the result in the observation (eg \"This reference range would have applied if the subject had been 20 years younger\"). I have a lot of results and would prefer not having to redeclare reference ranges for every single observation. </p>\n<p>From what i can read on this forum, there are different ways for representing more general observation information. One strategy is to have a \"parent observation\" which stores all the general information I don't want to repeat (and no result), and have all the individual results referenced as observations linked via the parents hasMember field (or childs derivedFrom?). </p>\n<p>Alternatively, you could use the new ObservationDefinition (right?).  In the \"Boundaries and Relationships\" section (<a href=\"https://www.hl7.org/fhir/observationdefinition.html#8.26.2\">https://www.hl7.org/fhir/observationdefinition.html#8.26.2</a>) its stated that it can be referenced in Observation.basedOn. However, I can't find ObservationDefinition listed as a valid reference type in the specs (<a href=\"https://www.hl7.org/fhir/observation-definitions.html#Observation.basedOn\">https://www.hl7.org/fhir/observation-definitions.html#Observation.basedOn</a>). Also, from the description (\"A plan, proposal or order that is fulfilled in whole or in part by this event\") the basedOn field doesnt really look like a good fit for what I want to use the ObservationDefinition for. </p>\n<p>Have I misunderstood what ObservationDefinition is supposed to be used for? How (if ever) do you establish a relationship between Observation and ObservationDefinition?</p>",
        "id": 238029064,
        "sender_full_name": "Torbjørn Torsvik",
        "timestamp": 1620559223
    },
    {
        "content": "<p>For compatibility with clients it's quite helpful to populate at least <em>one</em> reference range on lab Observations  (specifically: the one that you applied to this patient, resulting in the Interpretation you're assigning to the result.</p>",
        "id": 238036197,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620566800
    },
    {
        "content": "<p>For a fuller set of reference ranges you could perhaps use an ObservationDefinition, but it's important within an Observation to describe <em>which range</em> applied in this case.</p>",
        "id": 238036342,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620567002
    },
    {
        "content": "<p>^^ having written this, I don't see how to designate a specific <code>Observation.referenceRange</code> as \"the one we applied in determining this <code>Observation.interpretation</code>\". Is there a way <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ?</p>",
        "id": 238036430,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620567080
    },
    {
        "content": "<p>Typically, observation ranges are used to trigger specific Observation.interpretation values (low, critical high, etc.)  A single Observation can have multiple interpretations and thus, in theory, can have multiple relevant ranges.   If you wanted to tie them together, we'd need an extension - though you could propose a standard extension for that purpose.  Keep in mind that sometimes knowing what the ranges were that <em>didn't</em> trigger an interpretation is still relevant - e.g. \"you're <em>just</em> below the 'high' range\".</p>\n<p>You can't presume that a package of Observations will always be kept together, nor that the ObservationDefinition will always be available to someone accessing the Observation, so standard practice is to repeat the \"relevant\" reference ranges on each Observation.  Determination of what's 'relevant' is up to the lab.)  Linking from Observation to ObservationDefinition would be done with 'instantiates', though that's only introduced in R5.  You'd need to use an extension in R4.</p>",
        "id": 238037830,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620568787
    },
    {
        "content": "<p>Based on this review, I would recommend publishing observations with at least one reference range that is relevant for the given interpretation; if including more, I'd avoid including multiple reference ranges for a given type (e.g., at most one critical range, at most one normal range, and so on).</p>",
        "id": 238040579,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620571672
    },
    {
        "content": "<p>Thanks for the replies! Josh Mandel, I'm really enjoying your guided walk through fhir. Thank you McKenzie, I'm looking into R5. </p>\n<p>So to sum up. You should add relevant reference ranges to the observations in order to ensure their usefulness as isolated entities, since no context is guaranteed. Optionally, you can also tie them to an ObservationDefinition, either using an extension in R4 or by using the instantiates field in R5. I do feel like reference ranges for tests are valid concepts that should also exist outside the scope of each individual observation. I now assume that ObservationDefinition is a valid resource for storing such information (and also preferable to a hierarchy of observations)?</p>",
        "id": 238041147,
        "sender_full_name": "Torbjørn Torsvik",
        "timestamp": 1620572327
    },
    {
        "content": "<p>(Thanks for the shout-out on my video series <span class=\"user-mention\" data-user-id=\"406522\">@Torbjørn Torsvik</span>  -- always feel free to send me a direct message or @-mention me here with any suggestions for topics.)</p>",
        "id": 238059565,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620592334
    },
    {
        "content": "<p>also see <a href=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/ObservationDefinition.20Questions\">https://chat.fhir.org/#narrow/stream/179256-Orders-and.20Observation.20WG/topic/ObservationDefinition.20Questions</a></p>",
        "id": 238064911,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620597642
    },
    {
        "content": "<p>ObservationDefinition is indeed valid for storing 'definitional' ranges (there are often different ones for different genders, age groups or other circumstances.  I don't know that you'd get an ObservationDefinition that applied to a hierarchy of observations - each observation in a panel would have its own definition, each with its own normal ranges, though there might be a parent definition that defined the grouping of the panel</p>",
        "id": 238080213,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620614978
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> can i get some real examples for StructureMapUtils conversions ??</p>",
        "id": 238730485,
        "sender_full_name": "Ravishankar P",
        "timestamp": 1620978164
    },
    {
        "content": "<p>look in the test cases?</p>",
        "id": 238831574,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1621027219
    }
]