[
    {
        "content": "<p>I create a DateTimeDt object (and likely this is true with the STU3 analog) but I do not want a timezone. Does anyone know how to clear the time zone? I tried putting a \"null\" in the setTimeZone() arguement  but that caused the remainder of the resource not to get generated. If I specify nothing I get the defaultTimeZone. </p>",
        "id": 153854526,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1477572295
    },
    {
        "content": "<p>Unfortunately this is not legal in FHIR, which is why HAPI is blocking you from doing it. All dateTime values that include a time component must also include a timezone offset.</p>\n<p>This is troublesome in device-land as my colleagues here keep reminding me, but it ultimately prevents a very common source of errors..</p>",
        "id": 153854533,
        "sender_full_name": "James Agnew",
        "timestamp": 1477575746
    },
    {
        "content": "<p>Yes, I now recall that which is a little bit of a disappointment. In V2 messaging not including the time zone indicates that the device does not have a time zone at all. Many devices don't. But we will just have to accept that we cannot indicate that the device lacks any time zone knowledge. In the end that means that the time zone is assumed to be the current time zone, even if it is stored data. We simply don't know. Now it looks like the agent  does know. Not a really big issue though.</p>",
        "id": 153854535,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1477576043
    },
    {
        "content": "<p>I'm not sure that I follow this. Is it not known what timezone the device is in? </p>",
        "id": 153854556,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477595156
    },
    {
        "content": "<p>I think in some cases it's not. Brian, jump in here if I'm getting this wrong but I believe a bunch of devices store times in this wacky format of \"epoch time that I received during bluetooth pairing + offset in millis since that time\"</p>",
        "id": 153854620,
        "sender_full_name": "James Agnew",
        "timestamp": 1477685038
    },
    {
        "content": "<p>In our mappings we just use GMT when we map that to FHIR, so no big deal.</p>",
        "id": 153854621,
        "sender_full_name": "James Agnew",
        "timestamp": 1477685104
    }
]