[
    {
        "content": "<p>The Dutch MedMij FHIR IG states that references SHALL be resolvable. See here: <a href=\"https://informatiestandaarden.nictiz.nl/wiki/MedMij:V2020.01/FHIR_IG#Use_of_the_reference_datatype\">https://informatiestandaarden.nictiz.nl/wiki/MedMij:V2020.01/FHIR_IG#Use_of_the_reference_datatype</a></p>\n<p>When, within MedMij context, a FHIR client interacts with FHIR server, for instance posts a bundle of Observation resources, should the client be expected to include the references from the Observation resource (to Patient, Practitioner for example) in the bundle so the server can resolve them in the bundle? Or is the client expected to act as a server and let the actual server resolve the references on an endpoint?</p>\n<p>In both situations: would it make sense to describe such expected behavior in the IG, or is there a part of the FHIR spec where we can rely on / refer to?</p>",
        "id": 232732961,
        "sender_full_name": "Niek van Galen",
        "timestamp": 1617271875
    },
    {
        "content": "<p>Clients usually provide UUIDs for resources in a Bundle and use them to reference the entries in a Bundle, see <a href=\"http://hl7.org/fhir/bundle.html#bundle-unique\">http://hl7.org/fhir/bundle.html#bundle-unique</a></p>",
        "id": 232768350,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1617288232
    },
    {
        "content": "<p>In our IGs we sometimes use an invariant on the Bundle to check whether every reference resolves to an entry with a corresponding fullURL of the same UUID:  <code>Bundle.entry.descendants().reference.distinct().subsetOf(%context.entry.fullUrl)</code></p>",
        "id": 232769102,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1617288488
    },
    {
        "content": "<p>Are the Patient and Practitioner resources in the Bundle? is this a transaction/batch bundle, or a different kind? The answer to that will determine how to provide the references. <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>'s answer is correct when the answers to the first two questions are <code>Yes</code> and <code>No</code></p>",
        "id": 232769169,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1617288508
    },
    {
        "content": "<p>Yes, I should have added that in our case these Bundles are of type <code>document</code>. So there is an expectation that all references resolve within the Bundle.</p>",
        "id": 232769355,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1617288582
    }
]