[
    {
        "content": "<p>This might be more of an EHR general practice question than FHIR specifically, but do EHRs generally maintain a task list for a practitioner, practitioner role or other groups within the system?</p>\n<p>More specifically in the FHIR context: If I send a Task resource to say Epic (<a href=\"https://open.epic.com/Interface/FHIR\">supports Task</a>) or Cerner (<a href=\"https://fhir.cerner.com/millennium/overview/\">don't think it does support Task</a>) to check a certain set of data within the EHR or in an outside system, will it show up for them in a nice to-do list?</p>",
        "id": 241405485,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1622733311
    },
    {
        "content": "<p>Task is super generic, and how it is handled in the EHR will vary significantly based on the context of use of Task.  For Epic, our current Task support is limited to sharing care coordination referral related activities for post-discharge services.  So those tasks might show up in a worklist of a care coordinator.   However, other task types (that we don't support yet) might show up in other user worklists, or might not be worklist items at all.  For example, a task to collect a specimen might show up in a phlebotomist worklist, or it might not show up in a worklist at all if the collection is happening in the external lab system and the EHR only has the task for tracking.</p>",
        "id": 241406844,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1622733860
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>, that is super helpful! I realize I should learn from the currently implemented eReferral works in FHIR.<br>\nThe situation I am working with refers from a nationwide triage site to specific care providing organizations, so I think that should fit your paradigm.</p>\n<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> can you (refer to someone who could) speak to how Cerner is looking at this?</p>",
        "id": 241913558,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1623156701
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191357\">@Drew Torres</span> ^^</p>",
        "id": 241915876,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1623157728
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> - are you asking about EHR support for referral workflows, or Task?</p>",
        "id": 241927500,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1623162313
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> Well, the use case: Trying to send the task to a care provider that they should check whether a patient should indeed be referred to them for care.<br>\nIt looked similar to the eReferral workflow Nictiz is building in the Netherlands, leveraging the Task resource: <a href=\"https://informatiestandaarden.nictiz.nl/wiki/vpk:V4.0_FHIR_eOverdracht#Using_Task_to_manage_the_workflow\">https://informatiestandaarden.nictiz.nl/wiki/vpk:V4.0_FHIR_eOverdracht#Using_Task_to_manage_the_workflow</a></p>",
        "id": 241939428,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1623166619
    },
    {
        "content": "<p>I agree with Cooper's take. Task is a new concept akin to Facebook or iPhone notifications that's really only come into vogue with FHIR, imo. Prior to that, EHRs have had it in different concepts (radiology worklists, lab worklists, ROI worklists). The closest thing was the inbox or inbasket, but that's more like email than this new generic Task concept.</p>",
        "id": 241993413,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1623189649
    },
    {
        "content": "<p>Some of the functions now handled by Task used to be handled as part of the 'order' - but that sort of messed things up because it didn't draw distinction between an authorization and the request/response process involved in filling it.  It worked fine in inpatient settings where there was only one possible filler, but it falls down in the community environment where there are many possible fillers.</p>",
        "id": 242010114,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623204048
    },
    {
        "content": "<p>Thanks for the answers all! I'm concluding that using FHIR Tasks to assign a task to someone in an EHR seems to be the direction, but the future isn't fully here yet.<br>\nFor now, our direction is using a FHIR Task to maintain the status in our system and EHRs can choose whether to only update that one on our server (and handle the task in any way they choose internally) or also copy it to their system.</p>",
        "id": 243789315,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1624542919
    },
    {
        "content": "<p>Having external systems drive workflow within an EHR is one of the most invasive things we can do from an interoperability perspective, so we should expect it to take a while before we see significant support/capability there.</p>",
        "id": 243939981,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624638955
    },
    {
        "content": "<p>I think Task <em>might</em> be one way that some types of tasks may be managed in EHRs, but Task has (in my opinion) the one major flaw of being far too optimistic.  Today, in health care ecosystems, most types of tasks are inferred from other actions rather than explicitly defined.  And that is good (in most cases).  Some cases do benefit from having explicit tasks of course, but if that is the broad pattern, then you need some sort of system that knows about all the Tasks in the ecosystem, and that is neither realistic nor desirable.  This <a href=\"https://youtu.be/TXh5oU_yo9M?t=36\">Amazon EventBridge video</a> did a really good job summarizing the design problem in my opinion (I'm not a user of EventBridge, I just think this video describes the high-level design problem well).</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"TXh5oU_yo9M\" href=\"https://youtu.be/TXh5oU_yo9M?t=36\"><img src=\"https://uploads.zulipusercontent.net/4916ccfd2785d6f936f411a2b8f67c5d602be391/68747470733a2f2f692e7974696d672e636f6d2f76692f545868356f555f796f394d2f64656661756c742e6a7067\"></a></div>",
        "id": 244148570,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1624888878
    },
    {
        "content": "<p>So <em>some</em> types of tasks may be available via a FHIR Task API in the future, but very likely not all, or even most.  That doesn't mean that external actors don't have a way to drive tasks in the EHR, the FHIR API for driving tasks just might not be a Task API.</p>",
        "id": 244148799,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1624888959
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>. I'll put some more reservations around Task being the future direction <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> I never understood the feature of regular to do-apps to allow others to create tasks for you either. And even your own to do list needs lots of regular cleanup based on context in your own head.</p>",
        "id": 244162216,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1624894239
    },
    {
        "content": "<p>There is a fair amount of workflow in EHRs which is done, and managed via the \"inbox\" with a message. These often lead to 1:many actual units of work, but are not always clearly defined.  Often you'll hear \"oh, I asked my nurse to do it\" or \"I had a task/message/note/whatever and had to  do it\". These can come from other providers, patient phone calls, notes, lab results, etc etc. ... it can be vague, but linking/tracebility to these tasks might be important to consider in the scope of this conversation.</p>",
        "id": 246203054,
        "sender_full_name": "Ed VanBaak",
        "timestamp": 1626428486
    },
    {
        "content": "<p>To add another question about this. Is there a way to specify that while a Task is to be completed by a certain individual, there is a certain service that is supposed to help the person manage it. That's a terrible description, let me give two examples.</p>\n<p>I have a Practitioner that needs to reconcile a patient's vaccine records, and see what vaccines they are due. The owner would be the Practitioner. However, the Practitioner would use a Vaccine Forecasting service to do this. Is there a way to specify this Vaccine Forecasting service as part of the Task?</p>\n<p>Another would be a Patient that needs to complete a Questionnaire, using a Questionnaire service. The owner would be the Patient, but I'd like to attach the fact that this Task needs to use the Questionnaire service. </p>\n<p>Is there a way to specify this?</p>",
        "id": 250224266,
        "sender_full_name": "Grey Faulkenberry",
        "timestamp": 1629561566
    },
    {
        "content": "<p>You could specify the service as a Task.input, but you'd need some pre-negotiation for the recipient of the Task to recognize the input and know what to do with it.</p>",
        "id": 250253681,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629605915
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/How.20does.20a.20Task.20show.20up.20in.20an.20EHR.3F/near/243939981\">said</a>:</p>\n<blockquote>\n<p>Having external systems drive workflow within an EHR is one of the most invasive things we can do from an interoperability perspective, so we should expect it to take a while before we see significant support/capability there.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> what would you say would be a good approach for an external system wanting to have some sort of an effect on the workflow? One that would be easy and nice from the EHR's point-of-view. Let's say if the external system monitors data the EHR does not have access to, and the external system then wants an alarm to be raised on the EHR for a certain practitioner role in a specific unit, based on some thresholds when monitoring the data?</p>",
        "id": 253867495,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1631970498
    },
    {
        "content": "<p>It's hard for me to say what's easiest for EHRs.  Raising an alarm could be an Observation or a Communication, both of which are more likely to be supported for 'write' early, though ensuring urgent routing would be something that would be EHR-specific.  That's an easier form of workflow than a \"please do\", or worse yet, \"I'm going to re-jig what's already been requested by suspending or cancelling it\".</p>",
        "id": 253879344,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631983010
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, understood.</p>",
        "id": 253922978,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1632033505
    },
    {
        "content": "<p>IHE has an existing set of alarm communication profiles (<a href=\"https://wiki.ihe.net/index.php/PCD_Profile_Alarm_Communication_Management_Overview\">IHE PCD Alarm Communication Management</a>).  Some EHRs (including Epic) support that today. Rather than reinventing the wheel for alarms in FHIR, you might look at that.</p>",
        "id": 254050056,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632144608
    },
    {
        "content": "<p>But in general, it is probably worth considering whether you want to push data and let the EHR drive the task, or push the task.  If you have new vaccination info, for example, and you want to trigger someone to review and reconcile that into the EHR, just send in the vaccination administration info.  The EHR will internally determine who should review that, and when.</p>",
        "id": 254050273,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632144712
    },
    {
        "content": "<p>Part of triggering review is knowing <em>who</em> should do the review.  Since the EHR keeps track of provider schedules (including vacation, for example) and support pools, etc., pushing all that to an external app gets really complicated.</p>",
        "id": 254050548,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632144835
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191764\">Cooper Thompson</span> <a href=\"#narrow/stream/179166-implementers/topic/How.20does.20a.20Task.20show.20up.20in.20an.20EHR.3F/near/254050273\">said</a>:</p>\n<blockquote>\n<p>The EHR will internally determine who should review that, and when.</p>\n</blockquote>\n<p>And what I mean by this, is that the healthcare organizational policy will determine this, but that policy will be implemented in the EHR.  It is probably undesirable to have that policy be enshrined in multiple systems.</p>",
        "id": 254081467,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632156790
    },
    {
        "content": "<p>what is the mechanism to push a task?  in other words, is a task created automatically because it is tied to some other action?  or can a task just be created on its own?</p>",
        "id": 254252626,
        "sender_full_name": "Carl Silva",
        "timestamp": 1632247932
    },
    {
        "content": "<p>Tasks can be created on their own.  It's possible for a Task to auto-spawn due to the creation of another record, but typically they're initiated by a separate process, even if they're seeking fulfillment of something else.</p>",
        "id": 254291042,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632265396
    },
    {
        "content": "<p>I think it is really important to remember that a FHIR Task is a very different thing than a \"task in the EHR\".  We have implemented the  Task resources for things that are not EHR tasks, and have EHR tasks that probably never make sense to expose as a FHIR Task.  </p>\n<p>Any discussion of EHR tasks (or really tasks for any system) really needs to have specific workflow context, and involve an exercise of mapping to the relevant exchange models and FHIR resources (which may or may not be FHIR Task).</p>",
        "id": 254363836,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632316119
    }
]