[
    {
        "content": "<p>What's the best practice for binding multiple ValueSets?</p>\n<ul>\n<li>Create a ValueSet that includes the multiple ValueSets</li>\n<li>Slice the element or the Coding element and bind a ValueSet to each slice</li>\n<li>Other?</li>\n</ul>\n<p>Pro cons?</p>",
        "id": 221661661,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1609861712
    },
    {
        "content": "<p>The former sets an expectation for one code from any of the sets.  It's problematic if codes from the referenced value sets have overlapping meaning.  The latter allows you to set expectation for inclusion of multiple codes - and different expectations via both cardinality and binding strength for the inclusion, though things get messy if the binding strengths aren't all 'required' because a code that doesn't fall into any of the value sets will potentially match against all slices with 'extensible' bindings.</p>",
        "id": 221662105,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609861915
    },
    {
        "content": "<p>Thanks Lloyd. That helps. I am however wondering why it is problematic if codes from the reference value sets have overlapping meaning.</p>",
        "id": 221668979,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1609864739
    },
    {
        "content": "<p>It results in inconsistent data.  If there are two different codes that mean the same thing and both are allowed, then software needs to check for both codes when looking for a particular meaning</p>",
        "id": 221669705,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609865069
    },
    {
        "content": "<p>why are there multiple value sets? What's the purpose?</p>",
        "id": 221701438,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1609880695
    },
    {
        "content": "<p>I did it in once. The underlying terminology server does not support creating valueset from different code systems directly. So if I want to say include these three codes from SCT and those five codes from LONIC, I have to create three value sets, one for SCT and one for LONIC, and then the 3rd value set to include codes from those two value sets for  binding.</p>",
        "id": 221726891,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1609899612
    },
    {
        "content": "<p>The multiple value sets (contained value sets being from different code systems) are grouped into one value set. MANY value sets in VSAC are like this (aka \"Grouping). When from different code systems it doesn't matter if terms have overlapping meaning - in fact they will. However, there should be no need to create and bind to different value sets from the SAME code system that are appropriate for the bound context - it would not make sense. Also, this thread should be in the Terminology stream.</p>",
        "id": 221781249,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1609947369
    },
    {
        "content": "<p>I agree it happens.  (i.e. multiple codes in a value set with the same/overlapping meaning)  However, it's something to avoid as much as you can</p>",
        "id": 221795759,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609953967
    },
    {
        "content": "<p>Example of perfectly OK: a Diabetes type 2 problem value set with SNOMED  disorder codes in one subset, and ICD10 CM in the other \"fused\" into a grouping value set . Perfection is the enemy of the good and we need to support clinicians and the implemented vocabularies and the terms the clinician select. I disagree it should be avoided.</p>",
        "id": 221798882,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1609955443
    },
    {
        "content": "<p>And as you know both terms could be sent</p>",
        "id": 221799070,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1609955541
    },
    {
        "content": "<p>Sure.  But you do that because of a need to support multiple stakeholders or legacy data, not because you really want diabetes to be coded two different ways.  \"Avoid if you can\" isn't an absolute, but it means to be aware of the costs.</p>",
        "id": 221803394,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609957583
    },
    {
        "content": "<p>Is creating a combined value set the only option? Can slicing be used to indicate, for example, that either a SNOMED code from a SNOMED value set, or an ICD code from an ICD value set, or both can be sent in the CodeableConcept? And also require that if both are sent, they follow a ConceptMap?</p>",
        "id": 221808381,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1609960039
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> , <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span>  --- FYI this discussion (which should be in vocab)</p>",
        "id": 221808796,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1609960224
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> That has been answered above by Lloyd (2nd post in this thread).</p>",
        "id": 221813522,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1609962555
    },
    {
        "content": "<p>Ah, yes, that was part of the original question. I was responding on  <span class=\"user-mention\" data-user-id=\"191991\">@Gay Dolin</span> 's comment that combining value sets with overlapping codes (in her example) should not be avoided.</p>",
        "id": 221813944,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1609962762
    },
    {
        "content": "<p>It really depends on the use-cases for the ValueSet.  If it's to bind a field for data entry, then you don't want codes with overlapping meaning (esp. you don't want to mix clinical codes with classification codes), but if it's for retrieval / validation / the range of a conceptmap, etc then it may be exactly the right thing.</p>",
        "id": 221833693,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1609973050
    },
    {
        "content": "<p>Hence <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> 's question above - what is the purpose in this case?</p>",
        "id": 221833799,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1609973117
    },
    {
        "content": "<p>So another option would be to use a compound value set for validation and provide written implementation guidance on the different component value sets.</p>",
        "id": 222262434,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1610344124
    },
    {
        "content": "<p>Thanks all for the discussion. For now, I will continue here although I noted that it should be transferred to another stream. Can we copy the whole thread?  </p>\n<p>To give a bit more background information regarding my initial question. We are modelling Dutch Health Care information models to FHIR. Some models concern similar concepts as FHIR resources, for example, the <a href=\"https://zibs.nl/wiki/Procedure-v5.2(2020EN)\">hcim-Procedure</a>. To classify a procedure 5 different code systems can be used according to this model. They are represented as code lists / ValueSet as they can also contain a selection of a code system. Different Healthcare domains will likely use different code systems. Within one domain/use case, a single code system should be sufficient is the general idea. </p>\n<p>So we are wondering how we could best represent these information models in FHIR while we take into account that derived profiles can be created to specify the specific requirements of a healthcare domain/use case. Our current thinking it to bind one ValueSet that includes other needed ValueSets.</p>",
        "id": 222276888,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1610358630
    },
    {
        "content": "<p>I might have to do that as well <span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span> The official validator does not like this profile: <a href=\"https://simplifier.net/hl7norwayno-basis/nobasisendpoint\">https://simplifier.net/hl7norwayno-basis/nobasisendpoint</a><br>\nBecause we try to slice a non repeating element as a way to include codes from the norwegian specific Endpoint.connectionType CodeSystem. <br>\nA possible solution would be to instead bind the connectionType to a third ValueSet that includes both:</p>\n<ul>\n<li>EndpointConnectionType</li>\n<li>NoBasisConnectionType</li>\n</ul>\n<p>That would probably validate.</p>",
        "id": 222473340,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1610475761
    },
    {
        "content": "<p>Slicing is only allowed right now if an element repeats or is polymorphic (and in the latter case, you can only slice by type)</p>",
        "id": 222476172,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610476987
    }
]