[
    {
        "content": "<p>Hi, there.</p>\n<p>I read the example about a profile of Diagnostic Report, <a href=\"http://hl7.org/fhir/2016Sep/diagnosticreport-example-lipids.json.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2016Sep/diagnosticreport-example-lipids.json.html\">http://hl7.org/fhir/2016Sep/diagnosticreport-example-lipids.json.html</a>, but I cannot find a valid key to reveal this is a lipid profile extension from DIagnosticReport (I don't think the key,display text is a good idea to classify).  Its resourceType follows the base type is extends (e.g. DiagnosticReport in this example)</p>\n<p>And <a href=\"http://hl7.org/fhir/2016Sep/search.html#profile\" target=\"_blank\" title=\"http://hl7.org/fhir/2016Sep/search.html#profile\">http://hl7.org/fhir/2016Sep/search.html#profile</a> Indicates that a serach parameter is supported to locate this profile :<br>\n'''<br>\nGET [base]/DiagnosticReport?_profile=http://hl7.org/fhir/StructureDefinition/lipid<br>\nGET [base]/DiagnosticReport?_profile=Profile/lipid<br>\n'''<br>\nSo the server is capable of selecting this kind of profile. Can anyone explain how to achieve this target? Will it depend on a primate key as an identity? or will it depend on the check of the structure definition followed by fhir specification? thx</p>",
        "id": 153846299,
        "sender_full_name": "yiwang",
        "timestamp": 1472837205
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192319\">@yiwang</span> Can you explain a bit more what you're trying to do?  _profile allows you to filter to only include resources that declare a specified profile.  Profiles and extensions are not the same thing.  Profiles are a collection of constraints that a particular instance might be compliant with.  Extensions are additional elements that might be present in an instance (and which could be mandated to be present or otherwise constrained by a profile).  The specific example you pointed to doesn't declare a profile in the instance, so you won't be able to find it by searching by profile - even though in this case it should be conformant with the lipids profile.</p>",
        "id": 153846316,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1472847306
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I'm sorry for using the word 'profile extension'. Actually I only concern about profile. I just wonder how the search param works and how can we distinguish a specified profile (e.g. lipids profile) from the original(or the base type) (e.g. DiagnosticReport) They are both with key referenceType='DiagnosticReport‘ and I did not find any tagged symbol/token to indicate it is profiled as lipid profile ones. : (</p>",
        "id": 153846318,
        "sender_full_name": "yiwang",
        "timestamp": 1472847832
    },
    {
        "content": "<p>See this: <a href=\"http://hl7-fhir.github.io/resource.html#profile-tags\" target=\"_blank\" title=\"http://hl7-fhir.github.io/resource.html#profile-tags\">http://hl7-fhir.github.io/resource.html#profile-tags</a>  </p>",
        "id": 153846326,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472849129
    },
    {
        "content": "<p>it's up to the server how it works; the server can do one 4 things:<br>\n- not support the parameter<br>\n- only index resources that arrive with a profile claim <br>\n- validate resources against profiles for itself, and explicitly mark them with the claim, and search on that<br>\n- validate resources against profiles, remember the association, and search on that (without explicitly marking the claim)</p>",
        "id": 153846327,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472849221
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  wow, excellent. I think it would be better if there are some links <a href=\"http://hl7.org/fhir/2016Sep/search.html#profile\" target=\"_blank\" title=\"http://hl7.org/fhir/2016Sep/search.html#profile\">http://hl7.org/fhir/2016Sep/search.html#profile</a> beneath the RESTful API to explain the profile-tags issue  :  ) . Thank u</p>",
        "id": 153846330,
        "sender_full_name": "yiwang",
        "timestamp": 1472849424
    },
    {
        "content": "<p>yes, and in fact, there used to be text like this somewhere, but I couldn't find it. can you create a task to add it? </p>",
        "id": 153846334,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472850038
    },
    {
        "content": "<p>Ok , I'll figure out how to fix it : )</p>",
        "id": 153846335,
        "sender_full_name": "yiwang",
        "timestamp": 1472850084
    }
]