[
    {
        "content": "<p>Hi folks,</p>\n<p>Just a quick question - for many of the resources on my FHIR server, my \"subject.reference\" field references a Patient ID in the following format: <br>\n\"urn:uuid:111222333444\". </p>\n<p>I am attempting to query for all Encounter resources that reference a certain ID as the subject.reference. </p>\n<p>I am trying to search using this syntax: [base URL]/Encounter?subject=urn:uuid:11112222233333</p>\n<p>But I am unsuccessful. I tried passing \\ and / in front of those colons in the patient ID but to no avail. Just wondering if anyone here knew how to query for a Patient ID that contains colons within it. Thanks!</p>",
        "id": 178995602,
        "sender_full_name": "Mike C.",
        "timestamp": 1571949833
    },
    {
        "content": "<p>The way to escape those is to use %3A for :<br>\nBut are you sure that that's the id of the patient? Seems an identifier more than an id</p>",
        "id": 178996335,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1571950359
    },
    {
        "content": "<p>Convert the colon to it's equivalence of %3A</p>",
        "id": 178996372,
        "sender_full_name": "David Pyke",
        "timestamp": 1571950389
    },
    {
        "content": "<blockquote>\n<p>The way to escape those is to use %3A for :<br>\nBut are you sure that that's the id of the patient? Seems an identifier more than an id</p>\n</blockquote>\n<p>Michele, thank you for your reply! Yes, it is experimental patient data attained from Synthea. It is the identifier that corresponds to the \"reference\" property of the \"subject\" element for my Encounter resource. It is the only Patient identifier in the resource.</p>",
        "id": 178996499,
        "sender_full_name": "Mike C.",
        "timestamp": 1571950496
    },
    {
        "content": "<p>In general, references to a uuid are only expected to resolve inside a Bundle.  The server processing the transaction is responsible for translating those UUID references into proper resource URLs on its server</p>",
        "id": 179011650,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571963252
    }
]