[
    {
        "content": "<p>I need to capture the business identifier for different facilities where a patient is either currently receiving treatment or has previously received treatment.  The only information that I need to capture is the business identifier and not other attributes such as name or address.  The facility identifiers, in addition to other patient demographic information, will be used to uniquely identify a patient within our system.  Should an organization resource instance be created or could an extension on the patient resource be used? What is the best way to capture this information?</p>",
        "id": 153978672,
        "sender_full_name": "Robinette Renner",
        "timestamp": 1532699402
    },
    {
        "content": "<p>I think using  Reference.identifier is appropriate if there is an appropriate element of type reference.  Although reading the the spec seems to imply that is should (eventually) resolve to a FHIR resource but it does not have to now or in the future.  That part is honestly a bit murky to me.   <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  ?  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 153978695,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532702619
    },
    {
        "content": "<p>Murky indeed</p>",
        "id": 153978701,
        "sender_full_name": "John Moehrke",
        "timestamp": 1532703759
    },
    {
        "content": "<p>Is this organizations where the patient is actively receiving care, has received care at some point in the past or is registered with but has not actually received care.  (E.g. Someone who has had their records transferred to a new GP, but hasn't actually ever visited that GP)?  The elements that are candidates are Patient.generalPractitioner or CareTeam.  Neither are super good fits though.  You could also just look at all of the known Patient.identifier instances that are medical record numbers if you happen to know the Identifier.system for the organizations of interest.  If none of those seem like they'll work, custom extension is probably your best bet.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>, <span class=\"user-mention\" data-user-id=\"191797\">@Irma Jongeneel</span> other thoughts?</p>",
        "id": 153978709,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1532704233
    },
    {
        "content": "<p>The facility IDs could be current or historical facilities where care was actually received.  General practitioner or careTeam would not fit.  Most of the facilities are hospitals where a patient received a transplantation.</p>",
        "id": 153978715,
        "sender_full_name": "Robinette Renner",
        "timestamp": 1532705023
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>   :-)</p>",
        "id": 153978743,
        "sender_full_name": "Eric Haas",
        "timestamp": 1532707742
    },
    {
        "content": "<p>I'm a bit lost as to what IDs you're talking about, the facility, or the patient at the facility.</p>",
        "id": 153979064,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1532865626
    },
    {
        "content": "<p>It is the identifier for the facility and not the patient.  When trying to uniquely identify a patient in our system, we search for patients that have received treatment at the same facility.</p>",
        "id": 153979365,
        "sender_full_name": "Robinette Renner",
        "timestamp": 1532952986
    }
]