[
    {
        "content": "<p>More specifically, the question arises from what to do when one FHIR server implements multiple IG's, but these IG's have overlapping resources. Take the Da Vinci PDex IG and the CARIN BB IG for instance--both have a patient resource. How does a server handle being able to serve multiple patient resources?</p>\n<p>My current solution is to use a base Patient FHIR resource as the source of truth for the patient resource. This means for instance that the fhirUser claim URL as specificed by the SMART spec will be a link to this base R4 patient resource. The base patient resource will then have links to a PDex patient and a CARIN BB patient via the link field.</p>\n<p>At the last connectathon this was brought up as a major issue, where no one was aware of a standard or best practice for handling this expected use case. Some other options I heard were as follows:</p>\n<ul>\n<li>Simply combine the profiles to make one super profile that is compliant with all the profiles (rejected because although there are no conflicts in the example I listed, there is nothing stopping different IG's from creating a profile on the same resource that would cause a conflict)</li>\n<li>Don't have a base R4 resource (rejected because there is no obvious way as to what the entry point of the application should then be i.e. the fhirUser claim in the SMART token)</li>\n</ul>\n<p>There were possibly others, but there is a lot of confusion around a topic that I feel should be explicitly called out in the FHIR specification somewhere considering the spec was designed with this in mind of a server being able to implement multiple IGs and the community at large being unsure as to how to handle this.</p>",
        "id": 255619508,
        "sender_full_name": "Ryan Conley",
        "timestamp": 1633024860
    },
    {
        "content": "<p>Combine the profiles. If they are incompatible then you'll need to have separate end points</p>",
        "id": 255620653,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1633025115
    },
    {
        "content": "<p>(But PDex and Carin and US core etc profiles should be compatible - if they are not they should be fixed)</p>",
        "id": 255620849,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1633025170
    },
    {
        "content": "<p>In general, you serve up resources, not profiled instances.  You simply work to ensure that the resources you serve up meet the requirements of all of the profiles you need to.  (And monitor the creation of profiles to ensure they don't impose constraints that would prevent compliance with other profiles.)</p>",
        "id": 255629980,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633028715
    },
    {
        "content": "<p>there's a tool that can be do the profile combining for you, to make it easy</p>",
        "id": 255633659,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1633030208
    },
    {
        "content": "<p>both from a reading and a writing perspective</p>",
        "id": 255633698,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1633030224
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> That's good to know, but is it not true that there is nothing stopping these independent IGs from creating conflicts with one another? Is this not a big enough concern? Is there any documentation or further discussion on this matter? (I didn't find anything else in Zulip.)</p>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> If you know what it's called or where I should look for this tool it would be greatly appreciated.</p>",
        "id": 255637224,
        "sender_full_name": "Ryan Conley",
        "timestamp": 1633031574
    },
    {
        "content": "<p>there's nothing stopping it, but we do have processes in place to make it less likely - it's not an outcome we're in favor of at all. And it's a valid criticism to make of the IGs that they don't allow combining like that. And in our experience, it's rare.</p>",
        "id": 255637566,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1633031693
    },
    {
        "content": "<p>HL7 working groups should be voting down any IG that is so restrictive that it couldn't be compatible with other IGs. It shouldn't even be necessary for the group to understand all possible combinations - just avoid patterns that are likely to cause conflict.</p>",
        "id": 255637671,
        "sender_full_name": "Paul Church",
        "timestamp": 1633031729
    },
    {
        "content": "<p>Nothing stops IGs from creating conflicts other than good design.  It's possible that not all of your data will be valid against all profiles.  For example, a profile on Patient might say that deceased[x] is prohibited - because deceased patients aren't allowed for that use.  That doesn't mean that your system can't have patients where that element is true, only that they can't be used for the use-case the profile is designed for.</p>",
        "id": 255637685,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633031733
    },
    {
        "content": "<p>as for the tool: <a href=\"https://confluence.hl7.org/display/FHIR/Using+the+FHIR+Validator#UsingtheFHIRValidator-ComparingImplementationGuides\">https://confluence.hl7.org/display/FHIR/Using+the+FHIR+Validator#UsingtheFHIRValidator-ComparingImplementationGuides</a> - but this is rather unuseful right now.</p>",
        "id": 255637850,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1633031788
    },
    {
        "content": "<p>More problematic is profiles that do things like say \"<a href=\"http://Patient.name\">Patient.name</a> is 1..1\" - i.e. patients aren't allowed to have multiple names.  That's generally not a true statement, and the profile should instead say \"There must be one slice of <a href=\"http://Patient.name\">Patient.name</a> that meets these narrow filter characteristics\" (e.g. has a particular extension).  That allows the system that wants only one name to find the one it needs without prohibiting all the others from being present.</p>",
        "id": 255638165,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633031893
    },
    {
        "content": "<p>this is more useful: <a href=\"https://confluence.hl7.org/display/FHIR/Using+the+FHIR+Validator#UsingtheFHIRValidator-ComparingProfiles\">https://confluence.hl7.org/display/FHIR/Using+the+FHIR+Validator#UsingtheFHIRValidator-ComparingProfiles</a></p>",
        "id": 255643671,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1633034000
    },
    {
        "content": "<p>If one stores the union of all profiles one needs to be able to communicate, you'll have to morph them into the appropriate profiled-resource before sending the resource. Given that in general it's not a good idea to store profile metadata in your persistence layer, this kind of approach may be a  best practice anyway. You will encounter incompatible profile requirements - certainly if one were to be involved in any projects/product development that is to be used across jurisdictions/countries.</p>",
        "id": 255748467,
        "sender_full_name": "René Spronk",
        "timestamp": 1633096811
    },
    {
        "content": "<p>I don't know that it's a given that profile requirements across differing jurisdictions/countries means it's a given that they must be non-compatible.  If well designed, they <em>shouldn't</em> be non-compatible.  It should ideally possible for a system to spit out prescriptions or vital signs that are just as valid in the US as Russia as Nigeria.  The only possible issue might be language, and even there there are standard conventions for supporting multiple languages if your software has the capability of figuring out the translations.</p>",
        "id": 255830527,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633138731
    },
    {
        "content": "<p>Language, and terminologies, and the \"terminfo\" challenge, and more/less richness in terms of data. Besides, not all profiles will be 'well designed' ..</p>",
        "id": 255877910,
        "sender_full_name": "René Spronk",
        "timestamp": 1633187911
    },
    {
        "content": "<p>Terminologies shouldn't prevent interoperability - simply send the codes required by all jurisdictions.  (Well-designed profiles shouldn't ever mandate that only 'their' code is present.)  Certainly it's true that not all profiles will be well-designed, but there's nothing that makes jurisdiction boundaries present that <em>prevents</em> following good design principles.</p>",
        "id": 255881194,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633191450
    },
    {
        "content": "<p>Should terminologies require a license (e.g. SNOMED), one may not be able to send \"all codes\". But in general you're correct that such an approach should work.</p>",
        "id": 255932085,
        "sender_full_name": "René Spronk",
        "timestamp": 1633246565
    },
    {
        "content": "<p>There's a general expectation of putting a filter on your outbound content to strip off anything \"this receiver isn't <em>allowed</em> to have\".  Terminology licensing considerations would need to be a part of this just as patient consent and other business rules would.  (I wasn't aware of any SNOMED restriction that prohibits licensed senders from transmitting codes to non-licensed receivers, though there may be limitations on what licensed receivers can do.  Obviously whether a sender counts as licensed or not may depend on where their system is installed.)</p>",
        "id": 255955869,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633272004
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191912\">Michele Mottini</span> <a href=\"#narrow/stream/179166-implementers/topic/How.20to.20handle.20multiple.20IG's.20on.20one.20server.3F/near/255620653\">said</a>:</p>\n<blockquote>\n<p>Combine the profiles. If they are incompatible then you'll need to have separate end points</p>\n</blockquote>\n<p>not necessarily - conflicting profiles are ok on the same endpoint. Its on the receiver side where you then have to filter it out on what is supported and what isn't supported</p>",
        "id": 257991316,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1634544287
    },
    {
        "content": "<p>If one profile says \"must have no more than 1\" and another profile says \"must have at least 2\", then the instances coming out of the endpoint can't comply with both.</p>",
        "id": 258034657,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634566216
    },
    {
        "content": "<p>Right - reading might be necessary to handle on different endpoints - but writing <em>in theory</em> can be handled on the same endpoint.</p>",
        "id": 258082734,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1634584137
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/How.20to.20handle.20multiple.20IG's.20on.20one.20server.3F/near/258034657\">said</a>:</p>\n<blockquote>\n<p>If one profile says \"must have no more than 1\" and another profile says \"must have at least 2\", then the instances coming out of the endpoint can't comply with both.</p>\n</blockquote>\n<p>I don't know if I'm getting this right, but I pretty much expect the same endpoint to support several profiles for one same resource</p>",
        "id": 258086875,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634585854
    },
    {
        "content": "<p>A medication system may have MedRequests for prescriptions and for instance-orders, for example.</p>",
        "id": 258087049,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634585912
    },
    {
        "content": "<p>No two IGs should be mutually exclusive. They should be worded, may have 1 with this condition (slice) but allow others. Must have 2 with this condition (slices) but allows more. If you find 2 IGs that are mutually exclusive it should be brought to the authors attention so it can be addressed.</p>",
        "id": 258088418,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1634586487
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"335936\">Daniel Venton</span> <a href=\"#narrow/stream/179166-implementers/topic/How.20to.20handle.20multiple.20IG's.20on.20one.20server.3F/near/258088418\">said</a>:</p>\n<blockquote>\n<p>No two IGs should be mutually exclusive. They should be worded, may have 1 with this condition (slice) but allow others. Must have 2 with this condition (slices) but allows more. If you find 2 IGs that are mutually exclusive it should be brought to the authors attention so it can be addressed.</p>\n</blockquote>\n<p>I don't understand this. <br>\nIf one IG says \"this MedRequest resource SHALL have intent=X, no other allowed\"<br>\nand another says \"this MedRequest resource SHALL have intent=Y, no other allowed\"<br>\nthey can still work together, right?</p>",
        "id": 258089413,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634586939
    },
    {
        "content": "<p>What that means is that only intent=X MedRequests are considered part of the profile. It doesn't mean that all MedRequests on the server are intent=X. You just don't return intent&lt;&gt;X when you know that they want resources that conform to that profile.</p>",
        "id": 258091009,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1634587505
    },
    {
        "content": "<p>agree, but even that level of filtering is not implied by a server saying it is conformant to both IGs.</p>",
        "id": 258092234,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634587928
    },
    {
        "content": "<p>one resource can't be compliant with both profiles. but the server can certainly support both profiles.</p>",
        "id": 258092284,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634587950
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span> I don't know if that conflicts with what I meant. I want the same server to support both intent=X and intent=Y</p>",
        "id": 258094254,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634588754
    },
    {
        "content": "<p>so what do you mean by \"support\"?  I think that is the problematic word. It is not defined, and when \"support\" is not defined it can take on the definition of \"support\" related to dangling-from-a-rope-tied-around-ones-neck.</p>",
        "id": 258095397,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634589209
    },
    {
        "content": "<p>I believe this is where _profile filter comes into play. /Resource?_profile=IntentXProfile vs _profile=IntentYProfile.  As a server you could implement the request of \"I want all resources that conform to IntentXProfile\" by SELECT * WHERE Intent=X. This allows you to have all the data, regardless of profile and only return the subset that matches the profiles requested.</p>",
        "id": 258097706,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1634590145
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179166-implementers/topic/How.20to.20handle.20multiple.20IG's.20on.20one.20server.3F/near/258095397\">said</a>:</p>\n<blockquote>\n<p>so what do you mean by \"support\"?  I think that is the problematic word. It is not defined, and when \"support\" is not defined it can take on the definition of \"support\" related to dangling-from-a-rope-tied-around-ones-neck.</p>\n</blockquote>\n<p>Well, \"support\" as \"carry\" or \"hold\" - being able to hold both types of resources.</p>",
        "id": 258100141,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634591138
    },
    {
        "content": "<p>dangling from a rope seems a distant declination from the word \"support\"</p>",
        "id": 258100450,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634591266
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"335936\">Daniel Venton</span> <a href=\"#narrow/stream/179166-implementers/topic/How.20to.20handle.20multiple.20IG's.20on.20one.20server.3F/near/258097706\">said</a>:</p>\n<blockquote>\n<p>I believe this is where _profile filter comes into play. /Resource?_profile=IntentXProfile vs _profile=IntentYProfile.  As a server you could implement the request of \"I want all resources that conform to IntentXProfile\" by SELECT * WHERE Intent=X. This allows you to have all the data, regardless of profile and only return the subset that matches the profiles requested.</p>\n</blockquote>\n<p>We can use it like that, or we can search ?intent=X</p>",
        "id": 258100566,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634591305
    },
    {
        "content": "<p>You can support multiple profiles if _different_ instances of the resource matches different profiles (as in the <code>MedicationRequest.intent</code> example) but if one Immunization profile says that <code>protocolApplied</code> is 1..1 and another Immunization profile says that <code>protocolApplied</code> is 0..0 then the same end point cannot support both</p>",
        "id": 258105406,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1634593397
    },
    {
        "content": "<p>Why is that?</p>",
        "id": 258145127,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634622725
    },
    {
        "content": "<p>Can we not post one of each, provided we declare the profile?</p>",
        "id": 258145204,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634622839
    },
    {
        "content": "<p>The problem is that a server stores the instance. And if conflicting profiles enforce different details than there must be some kind of translation...</p>",
        "id": 258180578,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1634643969
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> if the profiles are mutually exclusive your instance cannot conform to both. If the profiles are NOT mutually exclusive, then the sender can submit an instance, an the receiver can (if it wants to, at its own expense) mark up the instance with all the profiles it knows to the degree that in finds it beneficial that the instance conforms to.</p>",
        "id": 258183534,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1634645527
    },
    {
        "content": "<p>It is my belief that there should only ever be 1 instance of any resource and it should have 100% of the data that corresponds to it. <br>\nIn the example of IGa says SHALL NOT have protocolApplied and IGb says SHALL have protocolApplied then the IG authors should come together to resolve.<br>\nOR perhaps you use the _profile filter again Immunization?_profile=IGa means \"SELECT * FROM Immunization where protocolApplied is null\" <br>\nYou have all the data, you can comply with IGa by returning just those that do not have protocolApplied.<br>\nMaybe in some alternate reality you strip protocolApplied from the resource on the way out the door JIT, but I don't imagine that is legally, clinically sound. As in what if you strip off a piece of information that changes treatment for the worse, I think you'd be liable for the harm.</p>\n<p>If a user does Immunization?all and then they complain \"You gave me resources that don't comply with IGa\" you get to say, you didn't ask for only resources that apply to IGa you asked for all.<br>\nOr perhaps they say, \"This resource doesn't comply with IGa.\" As long as you don't declare that it does, then what's the harm. What makes it comply with IGa (not having protocolApplied) thusly any resource that does have protocolApplied isn't part of that IG.</p>",
        "id": 258183644,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1634645577
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"335936\">Daniel Venton</span> <a href=\"#narrow/stream/179166-implementers/topic/How.20to.20handle.20multiple.20IG's.20on.20one.20server.3F/near/258183644\">said</a>:</p>\n<blockquote>\n<p>... In the example of IGa says SHALL NOT have protocolApplied and IGb says SHALL have protocolApplied then the IG authors should come together to resolve.</p>\n</blockquote>\n<p>I disagree. That would require world global harmonization on ALL levels. The author of IG's cannot take all other IG's into account, and probably shouldn't.</p>",
        "id": 258184100,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1634645775
    },
    {
        "content": "<p>I'm pretty sure that <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> mentioned that IGs shouldn't be written a mutually exclusive manner, but I'll leave that to the wayside.</p>\n<p>The point is, you still store all the data. If a user requests data that matches IGa then only return the resources that match IGa. If the user requests data that matches IGb only return resources that match. You can have them all, just filter based on the requested profile. IGa doesn't tell you that your database can only have conformant resources, it says only resources that meet certain conditions are conformant with this profile. All other resources are allowed to exist.</p>",
        "id": 258186828,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1634647153
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span> in terms of best practice.  However, sometimes reality intervenes.  Some receivers have a legitimate legal requirement to never receive data they don't recognize.  (Some receivers may think they have that need, but in fact don't...)  Also, some interfaces only want a subset of data - e.g. only active living patients.  That doesn't mean that others can't exist, just that certain operations or whatever need to be filtered.</p>",
        "id": 258193455,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634649846
    },
    {
        "content": "<p>(My example is a real case: <a href=\"https://worldhealthorganization.github.io/ddcc/StructureDefinition-DDCCImmunization.html\">https://worldhealthorganization.github.io/ddcc/StructureDefinition-DDCCImmunization.html</a>, <a href=\"http://hl7.org/fhir/uv/shc-vaccination/2021Sep/StructureDefinition-shc-vaccination-ad.html#tab-diff\">http://hl7.org/fhir/uv/shc-vaccination/2021Sep/StructureDefinition-shc-vaccination-ad.html#tab-diff</a>)</p>",
        "id": 258197833,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1634651534
    },
    {
        "content": "<p>You cannot 'POST both version' because systems in general do not store FHIR - they have some database that contains an immunization record, and then they render it as FHIR - and they cannot really render it both ways out of the same end point</p>",
        "id": 258198141,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1634651657
    },
    {
        "content": "<p>What about my case where I want a medication system to hold both prescriptions and instance orders (both flavors of MedRequest)?</p>",
        "id": 258224634,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634660249
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  is it a case where the profiles conflict?</p>",
        "id": 258237807,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1634664456
    },
    {
        "content": "<p>Those 2 flavors have different fixed code for MedRequest.intent</p>",
        "id": 258238709,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634664773
    },
    {
        "content": "<p>well - then your instance can only conform to one of the profiles</p>",
        "id": 258238999,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1634664855
    },
    {
        "content": "<p>I thought this was about the server supporting the 2 profiles or not. as long as that's possible, I'm not worried. Of course my instances will not claim compatibility with incompatible profiles.</p>",
        "id": 258251319,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634669228
    },
    {
        "content": "<p>Thanks</p>",
        "id": 258251346,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634669241
    },
    {
        "content": "<blockquote>\n<p>What about my case where I want a medication system to hold both prescriptions and instance orders</p>\n</blockquote>\n<p>That is OK because those are separate things (if I understand correctly) - the server holds both and renders them according to the two profiles</p>",
        "id": 258251752,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1634669407
    },
    {
        "content": "<p>The server doesn't render. The server serves, right?</p>",
        "id": 258253176,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1634669973
    },
    {
        "content": "<p>there's a language problem here- a single server can host conflicting profiles, but only if the data and the usage is compartmented logically - somehow - so that the conflicting data is a requirement. An underlying issue here is the difference between system-ish profiles and data-ish profiles. The spec describes them as entirely different, and they are in principle, but they tend to leak into each other in practice</p>",
        "id": 258253189,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634669982
    },
    {
        "content": "<p>Agree re language - \"supports\" may be thought to imply disallowing other instances. If you \"support\" X then can you allow a Y that doesn't conform to X? The words \"hosts\" or \"serves\" seem more open.</p>",
        "id": 258254700,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1634670525
    },
    {
        "content": "<blockquote>\n<p>The server doesn't render. The server serves, right?</p>\n</blockquote>\n<p>Servers render the data they have as FHIR</p>",
        "id": 258263537,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1634674189
    },
    {
        "content": "<p>Is there an expectation that if a server can serve resources that comply to a specific IG, that all resources served by the server comply with the specific IG?</p>",
        "id": 258263851,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1634674295
    },
    {
        "content": "<p>It probably depends on the IG...</p>",
        "id": 258264458,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634674520
    },
    {
        "content": "<p>If true, that all resources served by a server comply with a profile. You can still have 1 database with all data. But instead of doing the filter via the _profile parameter you implement the filter by the domain name:<br>\n<a href=\"http://IGa.myfhirserver.com/Resource\">IGa.myfhirserver.com/Resource</a> = returns (SELECT * FROM MyDb WHERE IGa compliant)<br>\n<a href=\"http://IGb.myfhirserver.com/Resource\">IGb.myfhirserver.com/Resource</a> = returns (SELECT * FROM MyDb WHERE IGb compliant)</p>",
        "id": 258266474,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1634675385
    },
    {
        "content": "<p>so it all depends on the nature of the profiles. Obviously with observations, there'll be multiple applicable profiles that observations conform to and anything more sophisticated than a $10 device will have different kinds of observations. Where as system level profiles - it's hard to have more than one.</p>\n<p>The example of observations is pertinent - you do a search for observations for a patient, obviously you're going to get lots of different kinds of observations, and those observations will conform to lots of different profiles (mostly, not explicitly). But you search for all observations with a particular code... they're probably all going to conform to a single profile, but even then, there could be some observations that conform to some profiles, and some that conform to others</p>\n<p>Kinds of profiles on Observations:</p>\n<ul>\n<li>jurisdictional polices about coding</li>\n<li>system policies about provenance/authorship etc</li>\n<li>domain policies about observation codes and components and units and reference ranges</li>\n<li>institutional policies about annotations and workflow rules</li>\n<li>etc</li>\n</ul>\n<p>The problem is that IGs don't provide a computable way to understand all this.</p>",
        "id": 258272172,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634677621
    },
    {
        "content": "<p>Postel's Law</p>",
        "id": 258443285,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634763556
    }
]