[
    {
        "content": "<p>I was wondering how to represent an observation where we want to store multiple units for the same quantity/range.</p>\n<p>Our use case is alcohol: we have the original location-dependent alcohol units/standard drinks and also converted to a canonical format of grams of alcohol.</p>\n<p>I had some ideas, but not sure if any are right:</p>\n<ul>\n<li>Store multiple Observations (this creates technical challenges for us because they are dependent on each other, e.g. if one is amended)</li>\n<li>Store an Observation with multiple components (but this feels like an abuse of what \"component\" means)</li>\n<li>Create an extension</li>\n</ul>",
        "id": 260820594,
        "sender_full_name": "Felix Chapman",
        "timestamp": 1636474243
    },
    {
        "content": "<p>Is there a reason you couldn't standardize internally on a unit of measure and compute the changes of unit of measure on a per request basis based on your i18n? E.G. store everything as grams internally and then convert to ounces if a user passes in an Accept-Language header value of en-US</p>",
        "id": 260858307,
        "sender_full_name": "Mike Lohmeier",
        "timestamp": 1636490841
    },
    {
        "content": "<p>We plan to do that kind of thing as well, but we're also interested in knowing the original units as-inputed by the patient.</p>",
        "id": 260965540,
        "sender_full_name": "Felix Chapman",
        "timestamp": 1636537288
    },
    {
        "content": "<p>There's a standard translation to capture Quantity translations: <a href=\"http://hl7.org/fhir/extension-iso21090-pq-translation.html\">http://hl7.org/fhir/extension-iso21090-pq-translation.html</a></p>",
        "id": 261456488,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1636951231
    },
    {
        "content": "<p>Thanks Lloyd, that looks like exactly what I need!</p>",
        "id": 261525783,
        "sender_full_name": "Felix Chapman",
        "timestamp": 1636995421
    }
]