[
    {
        "content": "<p>What is the guidance on how to map a field that didn't exist in DSTU2 to STU3 or R4 that is now a required property with a required ValueSet?<br>\nI have a specific example in mind, but I suppose this is a general question that come about across any two FHIR versions.</p>\n<p>In DSTU2 CarePlan there is no .intent property but in STU3 (and R4) this is now a required property (1..1) and uses an FHIR Required ValueSet (CarePlanIntent)?    The FML from DSTU2 to STU3 (where this prop was introduced) doesn't have any help or FML to describe what do do in this case.   What should the .intent value be set to if a DSTU2 resource was converted to STU3 (or R4) --- 'plan'?</p>",
        "id": 263911635,
        "sender_full_name": "John Silva",
        "timestamp": 1638820541
    },
    {
        "content": "<p>the answer is that it depends on the context - you have to figure out from the context of use what the correct value should be</p>",
        "id": 263911976,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638820608
    },
    {
        "content": "<p>OK, I'm trying to figure out \"what context\" you mean?   Do you mean the use case around the CarePlan or something in the DSTU2 resource (reference to Encounter?) that helps determine that 'context'?    For an automated conversion process, the only thing it has available is the DSTU2 FHIR resource instance.  (I suppose, there could be a profile associated with it that could help.). </p>\n<p>I guess this shows how problematic it is when a new required property is added in a subsequent FHIR version that doesn't have a \"default or recommended value\".</p>",
        "id": 264053785,
        "sender_full_name": "John Silva",
        "timestamp": 1638903395
    },
    {
        "content": "<p>the source of the data being converted</p>",
        "id": 264054764,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638903725
    },
    {
        "content": "<p>if a committee does add a new required property, that means you have to figure out what the value should be based on information not found in the source resource</p>",
        "id": 264054863,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638903760
    },
    {
        "content": "<p>OK, that's a non-computable thing then.  It can't be done by an automated conversion process without some \"external input\".   I guess the question is, how did the committee get to the meaning of the new property and make it required, that might help answer my (and other's) question.</p>",
        "id": 264055310,
        "sender_full_name": "John Silva",
        "timestamp": 1638903941
    },
    {
        "content": "<p>it always depends on the element</p>",
        "id": 264055965,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638904218
    },
    {
        "content": "<p>OK, but whenever a committee decides to add a new elementX, they must have a use case for adding this new element and even more precise reasoning why it becomes a required element and with a (fixed) Required ValueSet.   I guess for someone who was not intimately involved in committee discussions (like most of the FHIR user community) this is not something easily discovered.   I guess I could go search committee ballot and discussions about this to discover this reasoning but that is \"above and beyond\" what most users would be expected to do.</p>\n<p>Do you know of other examples of a new, required element being added with a (fixed) required ValueSet?   Hopefully this is something that doesn't happen very often because it is 'painful' for implementers.</p>\n<p>[I guess this also shows up in the \"Functional status for this map\" and  \"R(x) Validation Errors\" section on the bottom of the auto-generated version-map pages.</p>",
        "id": 264057338,
        "sender_full_name": "John Silva",
        "timestamp": 1638904838
    },
    {
        "content": "<p>Or perhaps you put conformance as a goal and recognize that historical data may never meet new requirements. The only thing you can do is record the data going forward. <br>\nYou could also hope for an \"unknown\" value I suppose.</p>",
        "id": 264058303,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1638905257
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"335936\">@Daniel Venton</span>  - yes, I like the idea of an 'unknown' value, but I suppose the committee wouldn't like that if the use case is really to constraint the value in the Required ValueSet.  (if it were only an Extensible ValueSet then it wouldn't be as much of a problem)</p>",
        "id": 264082749,
        "sender_full_name": "John Silva",
        "timestamp": 1638916001
    },
    {
        "content": "<p>sometimes that has been the case - the committee thinks that you should explicitly say that you don't know. Really, you should create a task asking the committee that owns the resource to at least provide some  documentation about what to do if you don't know the value</p>",
        "id": 264084950,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638917295
    },
    {
        "content": "<p>OK, but I can't find where to post this?   There used to be a mechanism for posting 'change requests'; I haven't done this for a while, probably since the change to Jira.  I thought the FHIR Zulip channel had an 'always available' link to submit 'change requests'?</p>\n<p>At any rate, I was able to find out that CarePlan seems to be owned by the PatientCare committee and I've visited their Confluence page but can't seem to find a place to post this question or as a Jira ticket.  (sorry if this is an FAQ).<br>\n<a href=\"https://confluence.hl7.org/display/PC/Care+Plan+Projects\">https://confluence.hl7.org/display/PC/Care+Plan+Projects</a></p>",
        "id": 264190467,
        "sender_full_name": "John Silva",
        "timestamp": 1638984794
    },
    {
        "content": "<p>You can create a Jira ticket and assign it to the specific workgroup. The most easy-to-remember mechanism is to start at the current build, and click on the \"Propose a change\" link in the footer. The direct link is <a href=\"http://hl7.org/fhir-issues\">http://hl7.org/fhir-issues</a> and that will take you Jira, where you can use the \"create\" button to create your issue (if you are logged in).</p>\n<p>Note that the field to specify the workgroup is on the Advanced tab.</p>",
        "id": 264199007,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1638988170
    },
    {
        "content": "<p>Added Jira ticket: <a href=\"http://jira.hl7.org/browse/FHIR-34430\">FHIR-34430</a> for this CarePlan.intent problem.</p>",
        "id": 264210547,
        "sender_full_name": "John Silva",
        "timestamp": 1638993119
    }
]