[
    {
        "content": "<p>I am trying to design an architecture for ROUTING eReferrals.</p>\n<p>I have a conceptual idea of giving referable services a \"eReferral #\", like a fax number or phone number, except that the value would be the target ENDPOINT for a /referralRequest. That way, as long as you know the services \"eReferral #\", you can send a ReferralRequest /bundle to that endpoint, and it will land in the right spot. It could work very well with building directories or registries of services.</p>\n<p>However, often many services might share an endpoint, so the routing to the right service would depend on the contents of the data package (particularly, the ID of he /healthcareService in the bundle). Also, i think this is probably the more standard way of approaching it from the FHIR perspective.</p>\n<p>The reason i don't like the latter method as much is that that in order to route the package, you need to know TWO values, and endpoint and an ID. I like the simplicity of just publishing an endpoint, which will route a referralRequest /bundle to the right service.</p>\n<p>So my question is, should i pursue the idea of using endpoints alone to route eReferrals, or stick with the ID/endpoint combo approach? (or pursue a different approach entirely)?</p>",
        "id": 153903269,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1503422712
    },
    {
        "content": "<p>Using the endpoint makes sense to me (that's how I plan to do it) and other information may need to be considered with routing, depending on the channel you use. Here in Australia there is a standard for doing this called SMD, and in the USA, I believe that the Direct messaging is used (don't know a greatdeal more than that)</p>",
        "id": 153903806,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1503916562
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , Is this what you are referring to (SMD)?</p>\n<p><a href=\"https://www.digitalhealth.gov.au/get-started-with-digital-health/what-is-digital-health/secure-messaging\" target=\"_blank\" title=\"https://www.digitalhealth.gov.au/get-started-with-digital-health/what-is-digital-health/secure-messaging\">https://www.digitalhealth.gov.au/get-started-with-digital-health/what-is-digital-health/secure-messaging</a></p>",
        "id": 153904472,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1504623541
    },
    {
        "content": "<p>Yes, thats the stuff. There is lots of documentation on it there.</p>",
        "id": 153904523,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1504649593
    },
    {
        "content": "<p>How is the \"target endpoint\" you are describing different from the FHIR server url? If an EHR has a FHIR interface then a referring entity should be able to send in a referral by doing a \"POST &lt;fhir server url&gt;/ReferralRequest\", correct? In other words, if you and your referral submitter agree on using FHIR ReferralRequest resource to submit a referral, then all the submitter needs to know is your FHIR server url.. or, are you envisioning something different?</p>",
        "id": 153905634,
        "sender_full_name": "Sandeep Giri",
        "timestamp": 1505002953
    },
    {
        "content": "<p>That's correct, but if its not in FHIR, then could be a v2 messaging endpoint or direct details etc.</p>",
        "id": 153905884,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1505067019
    },
    {
        "content": "<blockquote>\n<p>How is the \"target endpoint\" you are describing different from the FHIR server url? If an EHR has a FHIR interface then a referring entity should be able to send in a referral by doing a \"POST &lt;fhir server url&gt;/ReferralRequest\", correct? In other words, if you and your referral submitter agree on using FHIR ReferralRequest resource to submit a referral, then all the submitter needs to know is your FHIR server url.. or, are you envisioning something different?</p>\n</blockquote>\n<p>Sorry i missed this comment in Sept <span class=\"user-mention\" data-user-id=\"192382\">@Sandeep Giri</span>  and <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> </p>\n<p>Quick recap: I'm trying to target a SERVICE to refer to, kind of like how you would give a service a fax number, give it an eReferral number. </p>\n<p>There are a few important caveats:<br>\n1) If your EMR has an endpoint to submit your referralRequest to, your service/EMR might actually support MANY different services. Thing of referring to a hospital outpatient unit. If i send to the hospital EMR endpoint, which outpatient unit does it go to? the EMR would have to configure an endpoint for each service.<br>\n2) If I send the referral as a /bundle (because maybe the sending system can't provide endpoints), the my understanding is you always submit to the &lt;Fhir Server url&gt;., instead of a specific subfolder/resource. </p>\n<p>Both these things might be ok, and would require the receiving system to create a &lt;fhir server url&gt; that is unique for each target service. I am unsure if this is ok in the FHIR context still, or too complicated for the kinds of FHIR servers currently in popular use.</p>",
        "id": 153921676,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1511805566
    },
    {
        "content": "<p>Note that the content of the referral can provide an indication of who it's for/what is to be done that could support additional routing within an institution once received</p>",
        "id": 153921681,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1511806480
    },
    {
        "content": "<p>Yes, that's the alternate approach that I think i'm leaning on now instead of trying to adopt a \"eReferral #\", include the target /healthcareService in the referralRequest. This seems to be the strong approach when factoring everything in. Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 153921753,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1511832124
    },
    {
        "content": "<p>having a central endpoint makes implementation easier (kind of like having a single email or fax # to catch all incoming service requests) -- then you can apply some \"pre-processing logic\" that looks at the various attributes in the ReferralRequest to route them to the appropriate entity. Some other options to consider -- the Direct project (<a href=\"https://www.healthit.gov/policy-researchers-implementers/direct-project\" target=\"_blank\" title=\"https://www.healthit.gov/policy-researchers-implementers/direct-project\">https://www.healthit.gov/policy-researchers-implementers/direct-project</a> ) has already assigned endpoints to a majority of health systems and clinics, you may be able to use that as a commonly known endpoint to receive referral requests, and implement your own logic for triaging and routing. Alternately, the EHR may also give you the option to implement logic where incoming referrals are assigned to different department's work queues.</p>",
        "id": 153922823,
        "sender_full_name": "Sandeep Giri",
        "timestamp": 1512413690
    },
    {
        "content": "<p>Yes, I considered that you could reference the endpoint from the healthcare service as someone mentioned. (needs to be discovered to put into the referral for sending)</p>",
        "id": 153923304,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1512635952
    }
]