[
    {
        "content": "<p>Am trying to handle operational device events, such as errors, warnings, user-event. These seem like log/audit types of things, but some are appropriate to the patient as well. Consider a portable Insulin Pump: it may issue a stream of log events like Power-on, power-off, cartridge-low, cartridge-empty, battery-low, etc. Have been leaning toward Observations against the Device itself, with Observation.subject=Device. Is there a different appropriate resource for this sort of thing? Thoughts?</p>",
        "id": 153934492,
        "sender_full_name": "Dale Nelson",
        "timestamp": 1517492264
    },
    {
        "content": "<p>Use Observation with an empty value and a .dataAbsentReason   <a href=\"http://build.fhir.org/valueset-observation-valueabsentreason.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-observation-valueabsentreason.html\">http://build.fhir.org/valueset-observation-valueabsentreason.html</a></p>",
        "id": 153934808,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517518060
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <br>\nI take <code>Observation.dataAbsentReason</code> to be the reason for there being no data, not substitute data when there is no normal data. <code>dataAbsentReason</code> would not have a value of \"cartridge-low\", that is data, not a reason for a lack of data. <code>dataAbsentReason</code> might have a value of \"system message\", but then there needs to be an extension to hold the system message, e.g. \"cartridge-low\".</p>",
        "id": 153934886,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1517528831
    },
    {
        "content": "<p>I also tend towards having an observation against the device.</p>",
        "id": 153934887,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1517529012
    },
    {
        "content": "<p>I assumed you got an error message instead of data.  Is that not the case.... in  other words is the machine warning you about somethin in addition to the normal data stream?</p>",
        "id": 153934889,
        "sender_full_name": "Eric Haas",
        "timestamp": 1517529252
    },
    {
        "content": "<p>Eric, I guess I read Dale's post differently.</p>",
        "id": 153934890,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1517529455
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span>  Thanks - I didn't check follow-ups here for a few days;  I am trying to handle Richard's description- devices upload streams that may embed operational behavior with or withput data values. Frequently this is conveyed with sensor annumciation bytes that employ positional bit settings to indicate anhything from a \"battery is low\" to \"reading was outside sensor limits\" or outright \"device failed\". Some of these obviously map to a databsentReason, but others are conveying an operational log of device status (e.g. power-on, power-off, glucometer strip was not inserted properly, etc etc).    </p>\n<p>I am trying to separate concerns, to handle status that can be directly mapped to operational events outside of Observation values. I believe that is best handled by Observations against the device, made by the device. Obviously something other than LOINC for Observation.code.</p>",
        "id": 153935169,
        "sender_full_name": "Dale Nelson",
        "timestamp": 1517689303
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191637\">@Dale Nelson</span>, what's your status regarding this activity? We're profiling insulin pump and CGM data in Finnish PHR project. Would appreciate any resources and examples you can share.</p>",
        "id": 156698033,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1548257701
    }
]