[
    {
        "content": "<p>We are currently implementing a FHIR based tumor conference software. We are uncertain how to represent the actual conference (which includes the planned Date of the conference,  Patient information, DiagReports, Documents, etc..). Currently in our consideration:</p>",
        "id": 153946491,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1521556340
    },
    {
        "content": "<p>Appointment (which is more Workflow focused)<br>\nEncounter (which scope is more focused on the actual participation of the patient)</p>",
        "id": 153946493,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1521556438
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 153946519,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1521557606
    },
    {
        "content": "<p>Appointment seems like a good starting point to me.<br>\n- it offers time and context information<br>\n- it offers participant information<br>\n- supportingInformation allows to refer every information you might need for the tumor conference<br>\n- comment even allows for free text notes, in case your other question relates to that</p>",
        "id": 153946563,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521559483
    },
    {
        "content": "<p>Thanks for your comment, Appointment is also our favorite at the moment. We are just insecure because of the emphasis of the Workflow pattern in the scope description. <br>\nA tumorboard won't (directly) lead to encounters, nor will it have a AppointmentResponse following. Apart from that it fits quite well.<br>\nYes the other question is related to this question ;-) but comment alone would be to unstructured to capture the notes of the different participants. Currently we are thinking about a extension on particpant to capture the individuals plain text notes.</p>",
        "id": 153946584,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1521560579
    },
    {
        "content": "<p>Right with comment being probably too simple.<br>\nFrom my experience with tumor conferences, some person would document the decisions, while the individual participant's notes would have been less important.</p>\n<p>I would also consider CarePlan representing the decision a tumor board makes in the context of a certain patient's tumor condition. So maybe it's CarePlan.note you're looking for?</p>",
        "id": 153946586,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521561144
    },
    {
        "content": "<p>Concerning scope:<br>\n\"Examples include [...] a scheduled conference call between clinicians to discuss a case [...]\".<br>\nOk, many tumor conferences are in-person as of today, but I see the scope fitting perfectly.</p>",
        "id": 153946590,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521561450
    },
    {
        "content": "<p>CarePlan is also in our scope as the result of the conference. The notes are notes taken before the actual conference is conducted.</p>",
        "id": 153946591,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1521561500
    },
    {
        "content": "<p>But wouldn't these notes be part of the diagnostic process, like a pathology report, some imaging, and clinical findings?</p>",
        "id": 153946592,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521561575
    },
    {
        "content": "<p>thanks for the comment and confirmation that Appointment is a considerable choice.</p>",
        "id": 153946593,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1521561605
    },
    {
        "content": "<p>No these notes are thoughts of practitioners on the case when analyzing the available information during the preparation phase of the meeting, like a memory aid until the actual conference is scheduled. At this stage this won't be structured information/ practitioners are hard to motivate to structure their thoughts. We will be lucky to have structured data as a outcome at the end of the conference.</p>",
        "id": 153946594,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1521561773
    },
    {
        "content": "<p>I know exactly what you mean ;)</p>",
        "id": 153946595,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521561800
    },
    {
        "content": "<p>How about ClinicalImpression.note then?</p>",
        "id": 153946596,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521561813
    },
    {
        "content": "<p>You could reference these via Appointment.supportingInformation</p>",
        "id": 153946598,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1521561879
    },
    {
        "content": "<p>will have a look, thanks</p>",
        "id": 153946599,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1521562132
    },
    {
        "content": "<p>Sorry for my tardiness getting back to this one, all the advice here makes sense.</p>",
        "id": 153947438,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1521766797
    }
]