[
    {
        "content": "<p>I know metadata is useful at client app design time to understand the server profile. But do you really use it at runtime? I know the \"security\" section need to be retrieved for security connection (SMART for example). My question is more on the \"resource\" section. As a client, does it need to read the resource section every time to verify that resource profiles, extension, etc are not changed? What is the best practice here for using metadata?</p>",
        "id": 153885485,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1492784517
    },
    {
        "content": "<p>apps need to do only what the app needs to do. There is no requirement that an app confirm resources are tagged with any specific profile. However if that app is reliant on the fact that a resource is compliant with a specific profile, then it should look for that in the tag. BUT it must also be robust to the fact that a resource can be compliant and not be tagged with that profile that it is compliant with.... so, it is not all l that helpful to apps, unless there is a specific helpfulness designed in...</p>",
        "id": 153885487,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492786795
    },
    {
        "content": "<p>In general, it's best not to presume that anything in an inbound instance agrees with what you expect it to be unless you have full control of the coding and configuration of the system that's talking to you.  So anything that could affect your processing of the instance (e.g. modifier extensions) needs to be checked every single time.</p>",
        "id": 153885494,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492788778
    },
    {
        "content": "<p>We added a <code>fhirVersion</code> extension to meta, so we can look at <code>Resource.meta.fhirVersion</code>.  That lets us do schema validations against specific versions of the FHIR spec, do schema migrations across collections, and translate FHIR versions.  For instance, <a href=\"http://open.epic.com\" target=\"_blank\" title=\"http://open.epic.com\">http://open.epic.com</a> is still serving up DTSU2 resources; and we're on v3.0.0 for many of the resources now.  Our JSON cache/datastore has dynamic schemas, so it can write down the DTSU2 resource as it comes in; but if it goes through the scrubbing process, it will get a <code>meta.fhirVersion</code> of <code>fhir-3.0.0</code> added to it; so our housecleaning worker scripts will know if it's already been migrated or needs migrating.  </p>",
        "id": 153885516,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1492802508
    },
    {
        "content": "<p>We're also starting to find good use from the <code>version</code> number for operational transform; i.e. undo/redo, collaborative editing, revisions of a patient file, etc.  But it took us a while to grok how to do that, because <code>version</code> only works to the extent that there is another identifier acting to bundle the different versions together into a history.  </p>",
        "id": 153885517,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1492802681
    },
    {
        "content": "<p>One of our clients uses metadata to determine whether batch it supported, security stuff (SMART), and the set of supported search parameters per Resource type. It also looks for whether create and/or update are supported.  Pre-STU3 we also looked for the de-facto extension that listed supported CodeSystems.  We also look for fhirVersion, publisher, name, and description to display to the end user.</p>",
        "id": 153885664,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1492987489
    }
]