[
    {
        "content": "<p>What is the best way to communicate programatically the \"name\" of an identifier (e.g., BC Driver's licence, SystemX Patient ID, Ontario HCN, etc...)? IF I understand the identifier dataType correctly, you have to go lookup the name of the identifier at the \"system\" uri, which may or may not be programatically retrievable in the absence of the receiving system having a pre-defined awareness of the system. </p>\n<p>What is the best way to communicate the name of an identifier (in a human and machine readable way?</p>",
        "id": 154022370,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1543777497
    },
    {
        "content": "<p>Looks to me as if the only option is an extension.<br>\nIdentifier.type seems to be more for \"Driver license\" than for \"BC Driver license\".<br>\nThe extension <a href=\"http://build.fhir.org/extension-valueset-reference.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-valueset-reference.html\">reference</a> is rather indirect and assumes that the valueset is known and is useful.</p>",
        "id": 154022406,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1543801124
    },
    {
        "content": "<p>Try using the NamingSystem resource.</p>",
        "id": 154022411,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1543805612
    },
    {
        "content": "<p>I encourage the use of identifier.Type.Text for the human label</p>",
        "id": 154022440,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1543830570
    },
    {
        "content": "<p>The drivericense will be in the coded value, not the free text in type.</p>",
        "id": 154022441,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1543830608
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> do you think that Identifier.type is meant to be specific enough to say \"BC Driver License\" rather than just \"Driver License\"? See <a href=\"http://build.fhir.org/datatypes-definitions.html#Identifier.type\" target=\"_blank\" title=\"http://build.fhir.org/datatypes-definitions.html#Identifier.type\">http://build.fhir.org/datatypes-definitions.html#Identifier.type</a></p>",
        "id": 154022652,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1543883101
    },
    {
        "content": "<p>no I don't think so. type = there can be more than on thing with these properties</p>",
        "id": 154022657,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543886744
    },
    {
        "content": "<p>I was suggesting in the text value, not the coding values (which can have many different values)</p>",
        "id": 154022658,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1543887387
    },
    {
        "content": "<p>I think of the text as another way of saying what the codings do, not a way of saying something different. So the text can be \"license for driving vehicles\" but not \"BC driver license\".</p>",
        "id": 154022679,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1543901082
    },
    {
        "content": "<p>BC drivers license would go in assigningAuthority. display</p>",
        "id": 154022680,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543901720
    },
    {
        "content": "<p>Wouldn't Identifier.assigner.display hold \"Issuer of BC  licenses\"?</p>",
        "id": 154022681,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1543902091
    },
    {
        "content": "<p>if we were being truly pedantic, yes. but in practice, people aren't</p>",
        "id": 154022682,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1543902124
    },
    {
        "content": "<p>Identifier does not have assigningAuthority property</p>",
        "id": 154023145,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1544025495
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 154023225,
        "sender_full_name": "Eric Haas",
        "timestamp": 1544034402
    },
    {
        "content": "<p>.assigner is waht I meant</p>",
        "id": 154023263,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1544040283
    },
    {
        "content": "<p>I like the simplicity of <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> approach ;)</p>\n<p>What i'm think of is if the sending sending system is sending over a bunch of identifiers that are not necessarily defined or registered. There are cases too where the \"issuing authority\" is not necessarily name of the identifier. For example, \"band #\" (for native populations) isn't issued by \"band\".  </p>\n<p>Other types of identifier titles might be like, from a SPECIFIC IT system (or a specific implementation of a specific IT system, i.e. EMR_X at Organization_Y). an individual could have identifiers across a number of these various systems and identifier types.</p>",
        "id": 154024124,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1544462321
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> is correct.  \"BC Physician License number\" definitely belongs in Identifier.type.text, <strong>not</strong> Identifier.assigner.display.  Assigner is about the organization, not about the kind of identifier.  The same assigner could well assign multiple identifier types, but the display would be the same for all of them.  On the other hand the type.text allows you to convey a more nuanced type for the identifier than the code provides.  \"BC Physician License number\" is a perfectly appropriate \"original text\" for a code of \"practitioner license number\"</p>",
        "id": 154024344,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544495547
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193959\">@Tim Berezny</span> If you submit a change request, we can add an explicit example to the spec showing that.</p>",
        "id": 154024345,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1544495617
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193959\">@Tim Berezny</span> If this is specific to Canada only, then there is a work stream lead by Igor to translate provincial OIDs to URIs with assumption that URIs are human readable and should be understood without looking for OIDs in the registry. If, for some reason, this is not enough, then yes, you may use Identifier.type.text, Identifier.assigner or \"originalText\" extension. Specifically in BC most of the identifiers are driven by our local OID master list or corresponding URIs. Health Authorities may invent their own up to the point when they decide to communicate their data with other HAs, in which case URIs need to be made public (i.e. registered with BC MOH).</p>",
        "id": 159439907,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1551200960
    },
    {
        "content": "<p>Identifier.assigner is only for the organization, not for the original type.  It's not appropriate to use an extension when a core element (Identifier.type.text) exists.</p>",
        "id": 159440282,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551201252
    },
    {
        "content": "<p><code>quote It's not appropriate to use an extension when a core element (Identifier.type.text) exists.</code></p>\n<p>originalText extension is to link structured data to human readable part in the narrative. (2.4.0.5)</p>",
        "id": 159442405,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1551203135
    },
    {
        "content": "<p>That wouldn't eliminate the need to provide the display value in the instance if you expect anyone to render it.  The link into narrative is provenance/attribution purposes, not with any expectation that systems will use it to render a field.  The links won't be that precise.  (And few, if any, systems would have that degree of sophistication.)</p>",
        "id": 159442739,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551203393
    },
    {
        "content": "<p>I've just listed all possible options without preferences.</p>",
        "id": 159443301,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1551203870
    },
    {
        "content": "<p>Understood.  And I'm asserting that there's a single clear answer that will ensure consistency with how the same problem is addressed elsewhere</p>",
        "id": 159446879,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551206836
    },
    {
        "content": "<p>I would say that Identifier.type.text is a text value for the type, not for the system (several systems could have the same type )<br>\nSo I think an extension is only  way to go here.</p>",
        "id": 162284012,
        "sender_full_name": "Allan Bro Hansen",
        "timestamp": 1554156675
    },
    {
        "content": "<p>Identifier.type.text is what the user sees for the identifier type and can convey more nuance than just the type.  It is the expected place to say \"Michigan State Drivers License Number\" or \"New South Wales Podiatry Registration Number\".   The responsible work group has already approved a change request to add clarifying language and an example to the specification supporting this usage.  An extension is unnecessary.</p>",
        "id": 162298609,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554173408
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nOkay - I was confused because it goes against the current description of type, <a href=\"https://www.hl7.org/fhir/datatypes-definitions.html#identifier\" target=\"_blank\" title=\"https://www.hl7.org/fhir/datatypes-definitions.html#identifier\">https://www.hl7.org/fhir/datatypes-definitions.html#identifier</a>. E.g. \"It SHOULD not be used for codes that correspond 1..1 with the Identifier.system\". But as I understand you this description of type is also about to change.<br>\nSo to make sure I understand this correctly:<br>\nLets say we have to different Radiology System: RIS-A og RIS-B each with their identifier.system. They could use the same identifier.type coding-wise to state they are RIS-systems but they should have different type.text. RIS-A will basically say \"RIS-A\" and likewise for RIS-B. Correct?</p>",
        "id": 162307229,
        "sender_full_name": "Allan Bro Hansen",
        "timestamp": 1554186473
    },
    {
        "content": "<p>I believe so.</p>",
        "id": 162317615,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1554197747
    },
    {
        "content": "<p>Correct.  CodeableConcept.text can be hightly variable even when the same code is communicated.</p>",
        "id": 162345010,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1554218335
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 245784916,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1626158988
    }
]