[
    {
        "content": "<p>How to map HTML form to a FHIR XML format or vice versa</p>",
        "id": 153863682,
        "sender_full_name": "harsh kumar",
        "timestamp": 1481870186
    },
    {
        "content": "<p>anyone?</p>",
        "id": 153863684,
        "sender_full_name": "harsh kumar",
        "timestamp": 1481870710
    },
    {
        "content": "<p>Are you asking how to technically do the conversion or how do you figure out which elements map where?</p>",
        "id": 153863686,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481873653
    },
    {
        "content": "<p>How to map which elements where?</p>",
        "id": 153863687,
        "sender_full_name": "harsh kumar",
        "timestamp": 1481873706
    },
    {
        "content": "<p>You'll need to be more specific. Please read this: <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions\">http://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions</a></p>",
        "id": 153863699,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1481889928
    },
    {
        "content": "<p>Okay, here it is. I have a Patient record, that I want to store on my Hapi FHIR server (locally hosted), to do so I need to upload my record in proper format of resource type \"Patient\" i.e. a valid FHIR XML format. Now I want to create such an XML i.e. I need to create an interface that would map HTML form data into XML supported by FHIR. For I will have an HTML form to input the Patient Information, and then storing the information collected into patient resource on fhir server.</p>",
        "id": 153863701,
        "sender_full_name": "harsh kumar",
        "timestamp": 1481897302
    },
    {
        "content": "<p>Hope this helps</p>",
        "id": 153863702,
        "sender_full_name": "harsh kumar",
        "timestamp": 1481898155
    },
    {
        "content": "<p>You'd need to write some application code (either in  the browser or in a backend that you write) to create the Patient resource from your form data,  and then post that to the FHIR server. If you choose to do this in the browser, you'll probably want to use JSON rather than XML. </p>",
        "id": 153863703,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1481898338
    },
    {
        "content": "<p>Umm Okay, First has this not been explored? And this is there any other way you could suggest to put user collected data into FHIR, ie an existing interface, if any?</p>",
        "id": 153863704,
        "sender_full_name": "harsh kumar",
        "timestamp": 1481898451
    },
    {
        "content": "<p>I'm sure others have taken HTML data and turned it into FHIR, though the typical path is using JavaScript to produce JSON rather than producing XML.  (JSON and Javascript seem to align with HTML a bit better).  There are numerous possible \"hows\" to turn stuff into XML though - it really depends on your language of preference, how you prefer to navigate the HTML data, etc.  There's lots of alternatives for user-collected data too, including FHIR Questionnaires.</p>",
        "id": 153863708,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481905087
    },
    {
        "content": "<p>Ohh, okay. thanks.</p>",
        "id": 153863871,
        "sender_full_name": "harsh kumar",
        "timestamp": 1481998024
    }
]