[
    {
        "content": "<p>How to check for semantic interoperability using questionnaire?</p>",
        "id": 153859902,
        "sender_full_name": "Shalini Sheoran",
        "timestamp": 1480681010
    },
    {
        "content": "<p>could you please specify? This question is way to broad. </p>",
        "id": 153859904,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1480682271
    },
    {
        "content": "<p>Hi</p>",
        "id": 153859910,
        "sender_full_name": "Shalini Sheoran",
        "timestamp": 1480683408
    },
    {
        "content": "<p>Let's consider there are two patients. And these two patients while using a text area to answer a question in a questionnaire ( Questionnaire.group.text) uses two different words : huge and large. How does HAPI parser takes care of this? I mean how it is being standardized? I am exploring FHIR for storing epileptic data. I want to see a example demo of FHIR supporting semantic interoperability?</p>",
        "id": 153859914,
        "sender_full_name": "Shalini Sheoran",
        "timestamp": 1480684049
    },
    {
        "content": "<p>The API parser is not a natural language parser., it is meant to parse XML or JSON data into an in memory FHIR object.<br>\nIf you specify your program to put the text of a text area into Questionnaire.group.text, that's just what's going to happen. Perhaps you should have the patient click on standardized text/buttons, or choose from a dropdown list instead of being able to enter text themselves, and then code those answers. The codes can then be stored and compared. Or you should run your own natural language parser on the text area.<br>\nBTW, to store the answers, use the QuestionnaireResponse resource.</p>",
        "id": 153859917,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1480684844
    },
    {
        "content": "<p>Also see Joshs' answer in the HAPI stream: FHIR provides you with building blocks, but you still need to agree on things like vocabulary. That's not something that FHIR dictates.</p>",
        "id": 153859921,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1480685171
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191347\">@Mirjam Baltus</span>  for your insights. But I have one more question now, when we say FHIR supports semantic interoperability what do we mean by that? I mean what is it's context?</p>",
        "id": 153859926,
        "sender_full_name": "Shalini Sheoran",
        "timestamp": 1480688558
    },
    {
        "content": "<p>That applies to structured and coded elements. Free-text elements are clearly not there for supporting semantic, but rather free-text.</p>",
        "id": 153859940,
        "sender_full_name": "John Moehrke",
        "timestamp": 1480691757
    },
    {
        "content": "<p>Ok. Are there any existing coded or structured elements, where we can see semantic interoperability being implemented. Basically, I wanted to understand how semantic interoperability is being supported in FHIR. Any pointers on which resources can I try to see where data is structured and semantic interoperability is happening?</p>",
        "id": 153859952,
        "sender_full_name": "Shalini Sheoran",
        "timestamp": 1480695694
    },
    {
        "content": "<p>If you take a look at the GCS examples for Questionnaire and -Response, you'll find that, with LOINC codes for Glasgow Coma Score and coded answers. For epilepsy, something similar could be done, with probably Snomed codes.</p>",
        "id": 153859956,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1480696901
    }
]