[
    {
        "content": "<p>While testing our PDQm consumer at the IHE Connectathon, we found that many servers weren't handling our requests, due to our (browser based) client sending HTTP OPTIONS requests. This is caused by the browsers implementing the Cross Origin Request (CORS) protocol.</p>\n<p>The CORS protocol describes that non-trivial requests (e.g. GET requests with Authorization headers) should be preceded by a so called CORS preflight request, which is an HTTP OPTIONS call. Servers don't seem to be expecting this.</p>\n<p>In the interest of interoperability, I'm interested to seeing who should be fixing this. The clients not sending the HTTP CORS requests, or the servers correctly handling them. In my opinion FHIR should make it easy to create clients, so the browser behavior will be encountered more often and the servers should just handle this (there are CORS filter libraries out there for Java server implementers).</p>\n<p>What do the implementers here think?</p>",
        "id": 153821512,
        "sender_full_name": "Rick Riemer",
        "timestamp": 1460561110
    },
    {
        "content": "<p>Hi Rick - do you know which servers weren't handling this? Is this just via an unauthenticated flow or authenticated? I know the Conformance statement allows servers to specify CORS support: <a href=\"http://hl7.org/fhir/dstu2/conformance-definitions.html#Conformance.rest.security.cors\" target=\"_blank\" title=\"http://hl7.org/fhir/dstu2/conformance-definitions.html#Conformance.rest.security.cors\">http://hl7.org/fhir/dstu2/conformance-definitions.html#Conformance.rest.security.cors</a></p>",
        "id": 153821531,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1460567895
    },
    {
        "content": "<p>Sorry - not quite clear - was the issue that clients didn't send the pre-flight, or that they did and the servers didn't process correctly...</p>",
        "id": 153821532,
        "sender_full_name": "David Hay",
        "timestamp": 1460567966
    },
    {
        "content": "<p>It was about servers not handling the preflight CORS request. It was caused by our clients sending Authentication headers, which made the requests non-trivial and thus triggering the browser to try a CORS preflight first. When we removed the Authentication, there wasn't any CORS.</p>\n<p>I wasn't aware about the conformance possibility, but I don't think it's really a Conformance choice for servers. Servers need to support it at least in combination with Authentication, as the browser clients will automatically send CORS preflight if required. It can only be prevented by removing all Authentication and alike headers.</p>\n<p>My suggestion is that there's some clarification towards CORS needing to be supported on servers. WDYT?</p>",
        "id": 153821548,
        "sender_full_name": "Rick Riemer",
        "timestamp": 1460571127
    },
    {
        "content": "<p>It is a bit tricky, as HTTP OPTIONS request is treated as a request for a conformance statement in FHIR,<br>\nso sending pre-flight requests will produce may prodoce some overhead on the server side,</p>\n<p>I wonder how many systems will use browser based clients and thus need CORS support.<br>\nBut on the other hand it ist not too complicated to add CORS handling,  so at least it should be possible to add it on the server side.</p>",
        "id": 153821549,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1460572508
    },
    {
        "content": "<p>From what I've seen, generally if you support the SMART standard on top of FHIR, you likely support CORS (as a server). But if a server chooses not to trust browser-based cross origin, then that would be up to their security stance.</p>",
        "id": 153821551,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1460573125
    },
    {
        "content": "<p>As to clients - usually as a javascript client you don't have a choice - the browser handles cors for you. It doesn't apply to non-browser based calls</p>",
        "id": 153821552,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1460573155
    },
    {
        "content": "<p>The Options request isn't that hard to filter out in the server (to differentiate from the Conformance request) because the Origin header is on there</p>",
        "id": 153821553,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1460573213
    },
    {
        "content": "<p>Rick - CORS is proving hard for many servers. Especially the intersection between CORS and authentication, and the registration of a client. Can you be specific about which servers are a problem?</p>",
        "id": 153821580,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1460578934
    },
    {
        "content": "<p>There were various servers here at the IHE Connectathon. Some have put in temporary solutions for working through the Connectathon (Indra, Systelab), some completely fixed it (OSM, Visus), and some mentioned that they might fix it somewhere down the road (ICW, Lexmark).</p>",
        "id": 153821713,
        "sender_full_name": "Rick Riemer",
        "timestamp": 1460627614
    },
    {
        "content": "<p>from my perspective (developing the clinFHIR resource builder for the clinician challenge) I'm doing everything in the browser, so CORS has become essential for me...   I didn't realize the issue around the preflight request which might explain some puzzling errors I've had!  Would definitely appreciate clarification around that - maybe OPTIONS is no longer a good choice for the conformance resource?</p>",
        "id": 153821995,
        "sender_full_name": "David Hay",
        "timestamp": 1460746190
    },
    {
        "content": "<p>(ah - just saw Jenni's comment)...</p>",
        "id": 153821996,
        "sender_full_name": "David Hay",
        "timestamp": 1460746217
    },
    {
        "content": "<p>We ran into an issue a while bacl (I think it was with HAPI) where OPTIONS on [base]/** always gave back the metadata rather than just on [base]</p>",
        "id": 153822311,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1460992225
    },
    {
        "content": "<p>peter scholz, you wrote \"It is a bit tricky, as HTTP OPTIONS request is treated as a request for a conformance statement in FHIR...\"  HTTP OPTIONS is really about the communication options available for a given server (e.g., does it support GET, UPDATE, etc.). The FHIR Conformance statement is more about what the FHIR services available at a particular FHIR server. FWIW, I've tested a number of FHIR servers from my browser-based client and all have implemented CORS correctly (if they don't, I let them know about it ;)</p>",
        "id": 153822315,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1460997179
    },
    {
        "content": "<p>We did implement handling of CORS too. But that does mit change my statement as the FHIR spec says that you have to respond to a HTTP OPTIONS by sending a conformance resource</p>",
        "id": 153822412,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1461036643
    },
    {
        "content": "<p>I don't think it does actually say that. But perhaps we could be specific about CORS</p>",
        "id": 153822413,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461037818
    },
    {
        "content": "<p>AT the least I think you should be clear that it is only OPTIONS on the [base] URL that should trigger the conformance resource (although why this is needed when [base]/metadata exists I am not sure)</p>",
        "id": 153822418,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1461042462
    },
    {
        "content": "<p>I can't find that in the FHIR spec. And if it is, it should be changed.</p>",
        "id": 153822472,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1461079707
    },
    {
        "content": "<p>Section 2.1.025 reads<br>\nGET [base]/metadata or OPTIONS [base] triggers the sending of the Conformance Resource </p>",
        "id": 153822473,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1461081576
    },
    {
        "content": "<p>Sorry should be 2.1.0.15</p>",
        "id": 153822474,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1461081620
    },
    {
        "content": "<p>thanks for the link, Peter. I've just added a change request here: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9841\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9841\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9841</a></p>",
        "id": 153822478,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1461082625
    },
    {
        "content": "<p>Perfect </p>",
        "id": 153822495,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1461090904
    },
    {
        "content": "<p>is there any update on this? we try to access a HAPI 2.0 server build from the hapi jpa example. CORS is supported by the JPA example server like it is described here: <a href=\"http://hapifhir.io/doc_cors.html\" target=\"_blank\" title=\"http://hapifhir.io/doc_cors.html\">http://hapifhir.io/doc_cors.html</a></p>\n<p>However we are still getting preflight errors:<br>\nfhir-client.min.js:5 OPTIONS <a href=\"https://fhir.iap.hs-heilbronn.de/baseDstu2/Specimen\" target=\"_blank\" title=\"https://fhir.iap.hs-heilbronn.de/baseDstu2/Specimen\">https://fhir.iap.hs-heilbronn.de/baseDstu2/Specimen</a> send @ fhir-client.min.js:5ajax @ fhir-client.min.js:5http @ fhir-<br>\norders.html:1 XMLHttpRequest cannot load <a href=\"https://fhir.iap.hs-heilbronn.de/baseDstu2/Specimen\" target=\"_blank\" title=\"https://fhir.iap.hs-heilbronn.de/baseDstu2/Specimen\">https://fhir.iap.hs-heilbronn.de/baseDstu2/Specimen</a>. Response for preflight has invalid HTTP status code 403</p>",
        "id": 153847384,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1473952988
    },
    {
        "content": "<p>HTTP 403 sounds to me like the issue isn't CORS, but rather authentication.. That server seems to be down right now, but does it allow anonymous access?</p>",
        "id": 153852240,
        "sender_full_name": "James Agnew",
        "timestamp": 1475808101
    }
]