[
    {
        "content": "<p>from the spec:</p>\n<div class=\"codehilite\"><pre><span></span>the server SHALL return either a 200 OK HTTP status code if the resource was updated,\nor a 201 Created status code if the resource was created\n</pre></div>\n\n\n<p>However this doesn't say what to return if the resource was previously deleted, and it is now re-created (my server is returning 200 as it existed previously - even though it had been deleted) - which in turn fails some of the Touchstone tests.</p>",
        "id": 153892345,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1496713396
    },
    {
        "content": "<p>My initial take on this behavior was that since the resource instance was being re-\"create\"d, the action was indeed a \"create\" and therefore a 201 Created is the expected response. Based on the specification description that <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>  copied, as well as the fact that even though a resource instance is deleted it can be brought back to an existing state via the update operation, I am now inclined to expect a 200 OK or a 201 Created from this scenario. In any case as the specification does not explicitly declare one response code or the other in this scenario, I am inclined to update the Touchstone tests to accept either. Additional feedback is welcome.</p>",
        "id": 153892427,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1496745667
    },
    {
        "content": "<p>201 is the correct response. see <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13498\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13498\">GF#13498</a></p>",
        "id": 153893004,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496955061
    },
    {
        "content": "<p>Thank you.</p>",
        "id": 153893054,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1496972044
    }
]