[
    {
        "content": "<p>In the FHIR world, is there a preferred approach to handle error codes?</p>\n<p>One approach we're looking at is always providing HTTP 200 OK, and putting all of our errors (like bad credentials, bad formatted payload, etc...) into the operationOutcome response.</p>\n<p>We're also considering using a limited set of HTTP codes in addition to operationOutcome</p>\n<p>200 (OK) - Successfull request<br>\n400 (Bad Request) - There was a problem with the API request<br>\n500 (Internal Server Error) - There was a server side issue. Try the request again and/or report the issue to Caredove.<br>\n401 (Unauthorized) - There is a problem with the user's credentials<br>\n403 (Forbidden) - The request is attempting to access a resource beyond the scope of its credentials<br>\n404 (Not Found) - A requested or referenced resource cannot be found</p>",
        "id": 153951826,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1523454068
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/http.html#summary\" target=\"_blank\" title=\"http://build.fhir.org/http.html#summary\">http://build.fhir.org/http.html#summary</a> - summarises the error codes. in some cases, returning the correct code is required, not optional . In other cases, your discretion applies</p>",
        "id": 153951827,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523454162
    },
    {
        "content": "<p>but there is a rule that you SHALL not return an OperationOutcome  that contains errors with a 200OK http response</p>",
        "id": 153951828,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1523454210
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 153951832,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1523455194
    },
    {
        "content": "<p>for example: In some of the IHE profiles (Implementation Guides) we have identified for very specific warnings/errors more exacting ways to use the OperationOutcome and http to more consistently drive the way that specific error condition is handled. We never contradict the core requirements from FHIR http, but have found it useful to be more specific when there is a specific expectation driven by the use-case analysis and the guidance given.</p>",
        "id": 153951837,
        "sender_full_name": "John Moehrke",
        "timestamp": 1523455491
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , that's good to know. That feels like the right way to go...</p>",
        "id": 153952049,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1523540284
    }
]