[
    {
        "content": "<p>What was the rationale for having the fields .given and .family of HumanName optional? We encountered some Patient resources only having the .text field filled. Is there a reason why a name would neither have given nor family?</p>",
        "id": 245971769,
        "sender_full_name": "Olivia Bellamou-Huet",
        "timestamp": 1626274798
    },
    {
        "content": "<p>Some patients only have single names, like Pele, Madonna, Prince, Bjork, etc.</p>",
        "id": 245977504,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1626277104
    },
    {
        "content": "<p>Also, see #5 and #20 on <a href=\"https://www.kalzumeus.com/2010/06/17/falsehoods-programmers-believe-about-names/\">https://www.kalzumeus.com/2010/06/17/falsehoods-programmers-believe-about-names/</a></p>",
        "id": 245977622,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1626277161
    },
    {
        "content": "<p>Simple answer - some systems only store name as a single string, most typically when dealing with provider names.</p>",
        "id": 245978531,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626277581
    },
    {
        "content": "<p>Then why did we need HumanName.given and .family if we could simply use .text for all kinds of names?</p>",
        "id": 246090375,
        "sender_full_name": "Olivia Bellamou-Huet",
        "timestamp": 1626354343
    },
    {
        "content": "<p>Because some systems distinguish between given and family, in order to address the person correctly. E.g. there is a German tennis player called Tatjana Maria. Tatjana is the given, Maria the family name. If you don't know that, you could ask for the family name. If you know it, you know that you should address her as Mrs Maria.</p>",
        "id": 246090951,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1626354593
    },
    {
        "content": "<p>Lots of systems rely on separation of given and family for sorting and matching purposes.  As well, the order in which the order of given vs. family can vary.  So ideally you'll have both - the discrete values for matching and sorting and the combined string for display.</p>",
        "id": 246099645,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626358354
    },
    {
        "content": "<p>Also, may jurisdictions use extensions to add locale-specific name properties.  So family/given is just the \"80%\" starter set of discrete name properties.  There are so many other name properties that vary by realm that they mostly land in extension space.</p>",
        "id": 246101412,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1626359066
    }
]