[
    {
        "content": "<p>Hi!<br>\nI found here that i can use <a href=\"http://tx.fhir.org/r4\" title=\"http://tx.fhir.org/r4\">http://tx.fhir.org/r4</a> to lookup and validate codes. Is there any support for icd-10-cm? Any plans in future to support it?<br>\nThanks!</p>",
        "id": 193363821,
        "sender_full_name": "Roman Rodnin",
        "timestamp": 1586372360
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 193366186,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1586373423
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  Didn't we do this?</p>",
        "id": 193379354,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586380363
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"253983\">@Roman Rodnin</span>  Well, yes - and no.  What we have for ICD-10 in general (and specifically for \"base\" ICD-10 [WHO], ICD-10-CM [US] and ICD-10-VN [Vietnam], which are the variations that we currently have) is support for only a limited set of the concepts.  We haven't determined a good source for the full sets of codes for any of the variants.  Part of the reason why that is difficult is that the publicly available distribution formats (not from the commercial vendors) generally may not be computable, and none of them that I am aware of are even complete - for the higher level digits (5th, 6th, 7th, etc.) they typically state rules for adding the higher level digits to the listed codes rather than actually enumerating the possibilities (and the higher level digits are frequently required for the codes to be billable).  So I think this is actually pretty much of a mess, and I'm still not sure of a path forward to a good, sustainable solution.  This may finally happen when everyone adopts ICD-11 (but in the US, for example, that is likely going to be a long time in the future).</p>\n<p>In the meantime, anyone who has needs for particular codes to be supported by the FHIR terminology server (<a href=\"http://tx.fhir.org\" title=\"http://tx.fhir.org\">tx.fhir.org</a>) can provide a source and list of the codes and request that they be added to the supported set.  And any ideas for how to improve the situation are welcome.</p>",
        "id": 193400432,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1586398549
    },
    {
        "content": "<p><a href=\"http://tx.fhir.org\" title=\"http://tx.fhir.org\">tx.fhir.org</a> will start supporting ICD-11 shortly. I like it from a technical point of view, and am looking forward to seeing it implemented. </p>\n<p>Hopefully before I retire :-)</p>",
        "id": 193400516,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1586398670
    },
    {
        "content": "<p>Yes, absolutely.</p>",
        "id": 193400566,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1586398701
    },
    {
        "content": "<p>FWIW, I did see some mention of ICD-11 from CMS, so maybe there is a chance...</p>",
        "id": 193451695,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1586439823
    },
    {
        "content": "<p>I'm curious as to what people are generally referring when they say \"ICD 11\", is it the Foundation, the MMS linearisation, \"everything\", or ...?</p>",
        "id": 194306330,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1587044817
    },
    {
        "content": "<p>for me+ the MMS + foundation, though I'm really not clear on what the split itself has achieved</p>",
        "id": 194364901,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1587069858
    }
]