[
    {
        "content": "<p>I'm mapping data from an EHR system to Encounter. The source system contains a list of diagnosis codes for each encounter. They're standardized codes used for statistics and billing, and there's no additional information apart from the list of codes. Would it be poor use of FHIR to create a single Condition resource for each canonical code, and have multiple encounters for multiple patients refer to the same Conditions? I get the sense that the idea is to create a new Condition instance for every encounter or episode, but it's not clear to me if that is the case. If it is, I'd have to make up arbitrary unique Condition IDs for every time a diagnosis is referenced.</p>",
        "id": 153954480,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1524735564
    },
    {
        "content": "<p>in general making up new ids in a facade to the database is an anti-pattern.</p>",
        "id": 153954483,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524736587
    },
    {
        "content": "<p>Then what would you suggest Grahame?</p>",
        "id": 153954493,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1524740781
    },
    {
        "content": "<p>The fact is, I've realized, I might not have a lot of choice in this case since Condition has a mandatory subject patient. So it would have to be one instance per patient at least, unless I make up an imaginary generic patient also.</p>",
        "id": 153954494,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1524740879
    },
    {
        "content": "<p>so all you have is a code?</p>",
        "id": 153954496,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524742667
    },
    {
        "content": "<p>Yes</p>",
        "id": 153954497,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1524743367
    },
    {
        "content": "<p>and a description, e.g. J50E = \"Cellulitis\"</p>",
        "id": 153954498,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1524743431
    },
    {
        "content": "<p>ok so I think that this is the kind of situation for which we defined contained resources</p>",
        "id": 153954499,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1524743520
    },
    {
        "content": "<p>Ah, that's an interesting angle. Sounds like a good idea.</p>",
        "id": 153954501,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1524743622
    }
]