[
    {
        "content": "<p>Is there any way to identify sender (application) through FHIR in Composition resource?</p>",
        "id": 153863428,
        "sender_full_name": "Slaven Hrkac",
        "timestamp": 1481724758
    },
    {
        "content": "<p>The Composition is the document.  It might be sent numerous times, each time it is delivered the wrapper  that carries it will have the kind of data you are asking about. See DocumentReference, DocumentManifest, MessageHeader, and the REST interaction...</p>",
        "id": 153863429,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481725865
    },
    {
        "content": "<p>Thank you. Actually, the Composition is in Bundle wrapper, which is root of my message. I need to identify sender of that Bundle. Imagine client-server architecture where every client has it's unique ID. Can I force a client to introduce himself with that ID through message? My beginner FHIR knowledge level doesn't allow me to find that information anywhere else than here. Thanks in advance.</p>",
        "id": 153863431,
        "sender_full_name": "Slaven Hrkac",
        "timestamp": 1481729210
    },
    {
        "content": "<p>yes the Composition is a Bundle... that is the document wrapper. You need a communication wrapper, which might be a Message in the case of push, or REST in query/response, or DocumentReference in a document exchange.</p>",
        "id": 153863432,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481729550
    },
    {
        "content": "<p>I think you are mizing language. Do you mean 'author' rather then 'sender'? If you do, then Composition.author. If you doin't, what do you mean?</p>",
        "id": 153863459,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481745981
    },
    {
        "content": "<p>Thank you guys. I imagined field 'author' to be reserved for physical person who used some system (client application) to create and send message to my server. How to force client side to send unique identifier for application?</p>",
        "id": 153863478,
        "sender_full_name": "Slaven Hrkac",
        "timestamp": 1481749834
    },
    {
        "content": "<p>Author can be a Device. You can require that a device author be present, but that wouldn't mean that clients would have to make them unique</p>",
        "id": 153863479,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481749912
    },
    {
        "content": "<p>Can you link me to some example on web? It would be easier for me to understand by example.</p>",
        "id": 153863485,
        "sender_full_name": "Slaven Hrkac",
        "timestamp": 1481750951
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193150\">@Slaven Hrkac</span> Documents have no notion of \"sending\".  Documents are persistence-centric.  As John M. said, once created a document might be sent to many systems over a period of many years.  Nothing in a document will tell you who sent it or where it was sent - anymore than a PDF can tell you who emailed it.  To track the transmission of documents, you need some sort of a wrapping layer.  You could use FHIR messaging.  You could use SMTP or SOAP.  You can also record actions that happen to documents RESTfully using Provenance.</p>",
        "id": 153863629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481817715
    }
]