[
    {
        "content": "<p>HL7 Norway is in the process of defining national base profiles for Appointment and Encounter. With regards to identifiers we are discussing two alternatives: <br>\n•   using OID identifiers (preferably in URL-format) that identifies the local clinical application in .system, and use the local identifier in the application in Value. <br>\n•   use .system urn:ietf:rfc:3986.and use a UUID in value. </p>\n<p>What is the most common or recommended practice? We can also define a slice with both alternatives and let it be up to projects to decide, but we do not want to have more variation than necessary.</p>",
        "id": 256702059,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1633679784
    },
    {
        "content": "<p>The primary way to refer to profiles is with their canonical URL.  The URL <em>should</em> resolve to the source of truth for the profile, typically on a registry somewhere.  There's no requirement to have StructureDefinition.identifier at all.  If you don't have a specific need for it, I wouldn't bother.</p>",
        "id": 256765003,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633710095
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , the thing is that we need a unique identifier for the individual Appointment or Encounter instance. An example we are working with are sharing Appointments/ Encounters  on a national patient portal which makes it is necessary to identify the correct instance of the Appointment/ Encounter in the clincal application that created it. When the patient accepts/ rejects an Appontment the AppointmentRespons must fed back to the correct clinical application. </p>\n<p>We want the national base profiles to act as guidelines that helps harmonize  profiling at the national level and provide templates that makes profling for later projects more efficient. So the question is what guideline - if any - to give on the identifiers of these resources. </p>\n<p>Using an identifier.system that identifies uniquely  the application (url-based oid) combined with the lnternal Appointment/ Encounter-value from the clinical application is uniquely  identifying the instance using the clinial application's native identifier. Some argue that the clinical application should send a UUID as this will have a unique value in all contexts. </p>\n<p>Is there any preferred practice for other doing base profiles? <span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> <span class=\"user-mention\" data-user-id=\"192369\">@Ben McAlister</span> <span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span> <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span>  I have heard of some using the primary approach, but also some arguing for using UUIDs. For what kind of use-cases would use of UUID be an advantage? </p>\n<p>There is of course also the possiblity to slice the no-basis-xx.identifier with both oid and uuid-identifiers to show two equally recommended practices in Norwegian context.</p>",
        "id": 256862710,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1633778675
    },
    {
        "content": "<p>I misunderstood the issue.  I thought you were talking about identifying the profiles, not identifying the appointments &amp; encounters.  For identifying those, the first question is whether humans need to see the appointment or encounter identifiers.  If they do, then typically you won't want either an OID or a UUID as both syntaxes tend to be difficult for humans to wrap their heads around, let alone enter.   If not, then UUIDs or OIDs are fine.  (UUIDs having a slight benefit in that they don't require management of a hierarchy.)  I'm not sure, however, that you should try to standardize the identification approach.  All that matters is that the combination of system + value is globally unique.  If one system uses UUIDs and another system uses a numeric identifier combined with an OID based system, both should work just fine.</p>",
        "id": 256877320,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633792888
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> Having written an Appointment Book for a GP system, back in the day, I'm quite surprised that the Appointment Resource doesn't have a CreatedBy property and would be tempted to create an extension for that, rather than use an Identifier. However, I'm guessing that  may have already been discussed by the PA Work Group - <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 256892208,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1633807021
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> in general \"created by\" is covered by incoming references from a Provenance resource - as a contained resource possibly.<br>\nBut I am unsure if the issue is who created the resource or who created the identifier. Or if the identifier.system is being used as a proxy for who created the appointment (which isn't really correct).</p>",
        "id": 256895382,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1633810027
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span>  Looks to me as if identifier is being used here as a proxy for who created the appointment, which could be any one of a number of different entities (patient, family member, practitioner, receptionist, software app, etc.).</p>",
        "id": 256896849,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1633811521
    },
    {
        "content": "<p>No detailed (England) guidance but have been favouring making identifier mandatory on national profiles.<br>\nNot convinced on uuid, we aren't using them on central English profiles for central services. So not seeing this as a requirement elsewhere, think this is down to provider/supplier to manage.<br>\nWhere we have mandated uuid, I believe we are still allowing the original identifier</p>",
        "id": 256921456,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1633837770
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> - in regards to the use of Identifiers: it comes down to what trust you have to your applications. If you assign a url/uuid/oid pr. application/vendor it is essentially not of importance which one you pick for identifier.system. If you instead go with a single national-picked identifier.system eg. <code>helse.no</code> then you would need all application/vendors to figure out an identifier.value that does not gives you clashes across applications/vendors. If you're into that I recommend that you look into the use of UUIDv5 as they are scoped pr. issuer. meaning that UUID's can be used as globally unique identifier.value while being within the zone of a single application/vendor.</p>\n<p>In regards to the 'created by': At least, in my perspective, it is usually not important who created a certain appointment. It is more important who that has the responbility of the Appointment, as entities such as appointments usually are created by proxies such as secretaries/assistants. Have a look at eg. <a href=\"https://docs.ehealth.sundhed.dk/latest/ig/StructureDefinition-ehealth-appointment.html\">https://docs.ehealth.sundhed.dk/latest/ig/StructureDefinition-ehealth-appointment.html</a> where we've modelled the <code>responsible</code>extension.</p>",
        "id": 256937625,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1633855046
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> - with regards to people reading the profile I guess that would be restricted to logging and tracing-scenarios. When referring to OIDs I think of a URL-synonym to the numeric OID in our national OID-identification schemes, and thus human readable (slight advantage over UUIDs?). We have a  distributed OID-regime with branches in place for identifying clinical applications, so I guess we will not go for one central identifier.system a la ehelse (for clinical applications). <br>\nHowever there is as of now no other information in the message to identify the sending application (and I know that is not the purpose of the identifier, but still). i guess Provenance - which we have not started using - also could be used for identifying responsible for the Appointment, or possibly Appointment.participant.Device? What is the most common/ correct practice?<br>\nGood point Lloyd that this mayebe not is the most important element to secure a common national implementation practice for. What we would do would be to provide an open slice that at least can act as something to help implemenation projects think less :),  by providing a template to follow.</p>",
        "id": 256946741,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1633864234
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> are you sure that it is 'sending' you actually want to model, and not ownership/responsibility instead? Your auditlog will tell you who sent it/spawned it</p>",
        "id": 256947679,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1633865159
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> -agree sending is not the best word - original sender/ responsible/ owner of the Appoitment is more correct with regards to what we want to model</p>",
        "id": 256948729,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1633866201
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> - the modelling in the Danish national Telemedicin platform (the link above) is done by having an extension modelling the person / team / organization that is responsible for the appointment. Furthermore, there's an invariant that statest that the person / team SHALL be among the participants.</p>",
        "id": 256949833,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1633867285
    },
    {
        "content": "<p>but it looks like you just as well could use the participant.type (<a href=\"http://hl7.org/fhir/R4/valueset-encounter-participant-type.html\">http://hl7.org/fhir/R4/valueset-encounter-participant-type.html</a>) to model that part of the ownership</p>",
        "id": 256950036,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1633867459
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - the table on <a href=\"http://hl7.org/fhir/R4/valueset-encounter-participant-type.html\">http://hl7.org/fhir/R4/valueset-encounter-participant-type.html</a> might need some adjusting in R5 since teams  and groups are now permitted as participants - and the wording on the participant types seems a bit 'singular' to me</p>",
        "id": 256950108,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1633867534
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> - with regard to the identifier issue we are considering the clinical application/ EHR that generates the identifier as the owner, responsible for the appointment instance. With regards to organizational ownership we have per now not done anything to define that beyond identifying the participants. What requirements makes participant not sufficient for you here? Could it be an option if this of interest in R5 to mirror the serviceProvider element in Encounter?</p>",
        "id": 256951786,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1633869155
    },
    {
        "content": "<p>Encounter shouldn't have Group as a participant - Groups can't have responsibility.  I'll raise a change request.  <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> You might want a change request to add support for CareTeam to the value set.</p>",
        "id": 256967508,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633883811
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-34100\">FHIR#34100</a>  (<span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> FYI)</p>",
        "id": 256967665,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633883967
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 256969687,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1633885814
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> yep - very much. The service provider <em>could</em> be of value here - it could be a solution to introduce it or it could be transitively resolved through a link to the encounter</p>",
        "id": 256982880,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1633898303
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192369\">@Ben McAlister</span> <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> <br>\nI think this is also a gap in HL7 UK Core guidance. </p>\n<p>I've logged this <a href=\"https://simplifier.net/nhsdigitalspine/~issues/1795\">https://simplifier.net/nhsdigitalspine/~issues/1795</a> for NHS Digital perspective (so not national).</p>",
        "id": 257020931,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1633935497
    },
    {
        "content": "<p>If it's also tracking just the source record, there's the Meta.source property which can hold the full url of the original record.</p>",
        "id": 257120489,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1633988820
    },
    {
        "content": "<p>Otherwise using a unique identifier in the identifiers would do it as you've described.</p>",
        "id": 257120522,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1633988847
    }
]