[
    {
        "content": "<p>Hi there, </p>\n<p>I am having some troubles finding conclusive information on the right way to support this in FHIR. </p>\n<p>DICOM more or less has a 1:1 mapping from HL7 v2 into attributes like IssuerOfPatientID and IssuerOfPatientIDQualifiersSequence.</p>\n<p>I can see from resources like <a href=\"https://build.fhir.org/ig/HL7/v2-to-fhir/ConceptMap-datatype-cx-to-identifier.html\">https://build.fhir.org/ig/HL7/v2-to-fhir/ConceptMap-datatype-cx-to-identifier.html</a> that Assigning Authority should be conditionally mapped to a system or Organization.</p>\n<p>Users need to set up the Assigning Authorities in our system prior to use, so its possible for us to add some extra inputs to that so the user can qualify if it should map to a system or organization. </p>\n<p>Where I'm hung up is if another system adds an Identifier to a Patient using a system, upon exporting that DICOM image, we would need to add that Identifier to the OtherPatientIDsSequence and include the system. </p>\n<p>Does anyone have any guidance on the best way to go about this?</p>",
        "id": 276592641,
        "sender_full_name": "Ben Ganley",
        "timestamp": 1648199782
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span></p>",
        "id": 276628646,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648219443
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"485929\">Ben Ganley</span> <a href=\"#narrow/stream/179166-implementers/topic/Identifier.20to.20DICOM.20Patient.20ID.20with.20IssuerOfPatientID/near/276592641\">said</a>:</p>\n<blockquote>\n<p>Where I'm hung up is if another system adds an Identifier to a Patient using a system, upon exporting that DICOM image, we would need to add that Identifier to the OtherPatientIDsSequence and include the system. </p>\n</blockquote>\n<p>I'm not sure what the real question is here, and there are too many \"systems\" with potential to add identifiers to too many things, for me to figure out the workflow described. However, my initial reaction is, if you know about multiple patient IDs from a v2 source, and would update DICOM instances based on that, I would expect that being told about multiple patient IDs from a FHIR source would lead to the same outcome. And OtherPatientIDsSequence would be where I'd expect to see those additional IDs. (Also, I'd expect AA is mapped to an identifier \"system\" [in the namespace/url/OID sense of the word, not in the device sense] rather than an Organization, but I can see some implementations going a different way.)</p>",
        "id": 276682389,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1648244554
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> re-reading my question after spending some time away from the computer, I can see the reason for the confusion!</p>\n<p>Nonetheless this answer has provided some clarity so I will go ahead and implement it as such.</p>",
        "id": 276774994,
        "sender_full_name": "Ben Ganley",
        "timestamp": 1648369227
    }
]