[
    {
        "content": "<p>Hi,<br>\nI have a use case to detect the duplicate resources in a bundle-say Practitioner resource which is same, but  may come twice or n times in the bundle due to the type of the data source used(e.g-conversion from CDA to FHIR). I would like to know if there is a standard practice to identify the duplicate resources. Can we rely on the identifiers for each resource?Will that be the right way to do? Or are there any other approach where we can determine duplicate resources within a Bundle?</p>",
        "id": 242834975,
        "sender_full_name": "Vivek TK",
        "timestamp": 1623824841
    },
    {
        "content": "<p>If they have the same <code>id</code>, it is not a valid bundle (unless it is a history bundle with multiple versions of the same resource, but from your description that is not the case).  Details are on the <a href=\"http://hl7.org/fhir/bundle.html#bundle-unique\">Bundle</a> resource page (the formal constraint is <a href=\"http://hl7.org/fhir/bundle.html#invs\">bdl-7</a>).  So, the best solution is to fix the generation so that it doesn't include them.  If that is not an option, you should be able to use the <code>entry.fullUrl</code> element.</p>\n<p>If the entries are the same data but different identifiers, then the process for de-duplication will vary depending on what that data is (e.g., for patients are you matching names exact + date of birth, partial names, etc.).</p>",
        "id": 242930026,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1623871593
    },
    {
        "content": "<p>Thanks for the suggestion <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> . Will check with the full url option. Also I feel the process of de-duplication will become very complex as there are multiple resources involved and also they use custom profiles.</p>",
        "id": 243104731,
        "sender_full_name": "Vivek TK",
        "timestamp": 1623977437
    },
    {
        "content": "<p>No problem.  But yes, if the resources are coming from different sources they are quite unlikely to have matching URLs or IDs.  You will need to determine what constitutes a duplicate for each resource and remove them.  Note that this also means checking everything else in the bundle for links <em>to</em> that resource (e.g., if you remove a Patient record, any Encounter that points to that patient needs to be changed to point at the new one).</p>\n<p>De-duplication like that can be challenging - good luck!</p>",
        "id": 243176519,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1624030339
    },
    {
        "content": "<p>just for clarity... the id is only unique within a resource at a root url. so the id value of \"1\" might show up for both Patient/1, as wells Obsrvation/1, and Practitoner/1. These are not the same, even though the id is all \"1\".</p>",
        "id": 243177580,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624030848
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  . Also would like to know if you have any thoughts on the updates of these resources when they are stored in a FHIR server. During the first transformation, consider these resources converted from CDA documents are stored to a FHIR server. Now the challenge is to update these FHIR resources in the FHIR server when the CDA document gets updated so that the data in XDS and its transformed copy stored in FHIR server are intact.</p>\n<p>For a few resources like Patient, Practitioner etc, we may rely upon the identifier(not the logical id), but I am not sure of the case when the identifiers are not available for other resources that are extracted from CDA sections. Basically, the resources created from CDA sections like Observation, Medication,MedicationStatement etc which does not have any identifiers available in the CDA document(which is the source of transformation).  .. As <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  mentioned before, this makes us depend on the data within each resource to identify the duplicates and they can vary from resource to resource.</p>",
        "id": 243251989,
        "sender_full_name": "Vivek TK",
        "timestamp": 1624112204
    },
    {
        "content": "<p>What is the purpose of transforming the contents of CDA documents into FHIR resources in the first place? Is it to make that data available to be used by FHIR clients?</p>",
        "id": 243271671,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1624140822
    },
    {
        "content": "<p>Right <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span></p>",
        "id": 243286509,
        "sender_full_name": "Vivek TK",
        "timestamp": 1624165177
    },
    {
        "content": "<p>In that case, I think you need an intermediate step: CDA - &gt; normalized data - &gt; mapping the normalized data to FHIR resources. All the things that you are discovering about needing to do still need to be done, but if you separate the CDA processing from providing the data as FHIR resources, I think it will be more manageable.</p>",
        "id": 243313153,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1624210924
    },
    {
        "content": "<p>Note that what you are describing is what the IHE mobile Cross-Element Data Extraction implementation guide recommends - <a href=\"https://wiki.ihe.net/index.php/Mobile_Cross-Enterprise_Document_Data_Element_Extraction\">https://wiki.ihe.net/index.php/Mobile_Cross-Enterprise_Document_Data_Element_Extraction</a>. <br>\nThis recommends use of FHIR Provenance to enable linking back to the CDA document(s), and thus you have Provenance details to enable updates as you mention.<br>\nAs to the problem, this is simply a problem for systems-design to overcome. There is no interoperability specification that is going to help you. It comes down to the tough task of de-duplication on the edge of false-negatives and false-positives.</p>",
        "id": 243371079,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624276388
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> . Provenance indeed keeps track of the resources along with their logical ids. I guess that's a good point to start.</p>",
        "id": 243512502,
        "sender_full_name": "Vivek TK",
        "timestamp": 1624367151
    },
    {
        "content": "<p>good tutorial <span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span> gave on mapping CDA to FHIR at DevDays is available <a href=\"https://www.youtube.com/watch?v=d941K8CMWq4\">https://www.youtube.com/watch?v=d941K8CMWq4</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"d941K8CMWq4\" href=\"https://www.youtube.com/watch?v=d941K8CMWq4\"><img src=\"https://uploads.zulipusercontent.net/a64fb1c5276f65bcb8ab033bb029b3ae21ad1149/68747470733a2f2f692e7974696d672e636f6d2f76692f643934314b38434d5771342f64656661756c742e6a7067\"></a></div>",
        "id": 243792802,
        "sender_full_name": "John Moehrke",
        "timestamp": 1624544306
    }
]