[
    {
        "content": "<p>The Managing Resource Contention section in the http chapter describes the If-Match header as a solution for Optimistic concurrency control. However this only works if the Server understands versioning. The HTTP standard also offers the  If-Unmodified-Since header for cases where the Last-Modified Header is known. Is there any precedent in using it for FHIR?</p>",
        "id": 172020262,
        "sender_full_name": "Johannes Höhn",
        "timestamp": 1564478699
    },
    {
        "content": "<p>I don’t recall discussing it before - that doesn’t mean that you can’t use it, just that we haven’t talked about it</p>",
        "id": 172022383,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564480587
    },
    {
        "content": "<p>As HTTP dates have only second resolution and depends on proper clock sync, the use of an If-Unmodified-Since header will not provide 100% certainty to not override an already done update. If you can live with that restriction, the next question would be whether FHIR server will support that header.</p>",
        "id": 172055113,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1564505577
    },
    {
        "content": "<p>mine doesn't.</p>",
        "id": 172069597,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1564515682
    },
    {
        "content": "<p>You don't need clock sync as you use the last-modified header or meta.lastUpdated, but you're right that it's a problem if a resource gets updated more than once per second.</p>",
        "id": 172104196,
        "sender_full_name": "Johannes Höhn",
        "timestamp": 1564557085
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197584\">@Johannes Höhn</span> Yes you are right, you can use the value from the last-modified header like a weak ETag with second resolution.</p>",
        "id": 172104409,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1564557374
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-31927\">https://jira.hl7.org/browse/FHIR-31927</a></p>",
        "id": 235229728,
        "sender_full_name": "Joe Lamy",
        "timestamp": 1618858217
    }
]