[
    {
        "content": "<p>I want to publish documentation for a set of profiles, extensions, value sets, and code systems.  Putting together a simple IG seems the best approach.  I'd like each profile/extension page to contain the stuff most people would want: Summary or Narrative, Differential/Snapshot/All tables (like in the FHIR spec), XML/JSON views of the structdef.  Is there a starter template/project that provides most of this (just slap in the JSON structuredefs and a few index pages and it does the rest)?  I tried using the ccda2 guide as a template (from 1.8 sources), and it works OK, but not great.  Wondering if there is a better starting point...</p>",
        "id": 153871386,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487087691
    },
    {
        "content": "<p>You might look at SDC.  It makes things pretty easy from a maintenance perspective, though it does require the use of Ant and gets rid of the real-time publication feature.  (I'm hoping to fix that over the next week or so.)</p>",
        "id": 153871400,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487091858
    },
    {
        "content": "<p>There's also an IG Template here: <a href=\"https://github.com/cqframework/igtemplate\" target=\"_blank\" title=\"https://github.com/cqframework/igtemplate\">https://github.com/cqframework/igtemplate</a></p>",
        "id": 153871401,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1487091922
    },
    {
        "content": "<p>It's pretty bare bones right now, but the intent is that it provides a starter template exactly like what you're looking for.</p>",
        "id": 153871403,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1487091941
    },
    {
        "content": "<p>Commits welcome to improve the starting point, I'm using it for several IGs and committing improvements back to the template as I go.</p>",
        "id": 153871406,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1487091972
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> and <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> .  I'll probably try out Bryn's template first, since its purpose is exactly what I'm looking for.  Funny -- I'm an admin for that GitHub organization (cqframework) -- so I probably saw when that igtemplate repo was created and forgot about it!</p>",
        "id": 153871422,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487097471
    },
    {
        "content": "<p>I have a template for creating IGs  (see Argonaut/US-Core) and other as well uses a python script to take care of the definitions file so you don't have to and lots of Markdown too.</p>",
        "id": 153871483,
        "sender_full_name": "Eric Haas",
        "timestamp": 1487116590
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  -- is there an actual blank(-ish) template, or would someone just take the Argonaut/US-Core IG from the build and modify that?</p>",
        "id": 153871524,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487129319
    },
    {
        "content": "<p>The only Argonaut Guide I found was <a href=\"https://github.com/hl7-fhir/fhir-svn/tree/master/guides/argonaut\" target=\"_blank\" title=\"https://github.com/hl7-fhir/fhir-svn/tree/master/guides/argonaut\">here</a>, but it's based on spreadsheets, hasn't been implemented in a while, and has no python scripts.  Am I looking in the right place?</p>",
        "id": 153871535,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487135204
    },
    {
        "content": "<p>no. check <a href=\"https://github.com/Healthedata1/Argo-DSTU2\" target=\"_blank\" title=\"https://github.com/Healthedata1/Argo-DSTU2\">https://github.com/Healthedata1/Argo-DSTU2</a></p>",
        "id": 153871538,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487135932
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>   I just uploaded <a href=\"https://github.com/Healthedata1/IG-Template\" target=\"_blank\" title=\"https://github.com/Healthedata1/IG-Template\">this barebones template</a> to github hopefully that will help.  </p>",
        "id": 153871621,
        "sender_full_name": "Eric Haas",
        "timestamp": 1487182406
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> , I think this is very helpful. I'm wondering if this template would work with StructureDefinition files or just with spreadsheets.</p>",
        "id": 153871638,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1487184612
    },
    {
        "content": "<p>It works with both.  My extensions are SD.xml files  not spreadsheets.   The Python script might need to be updated though if you are considering using it.</p>",
        "id": 153871646,
        "sender_full_name": "Eric Haas",
        "timestamp": 1487185917
    },
    {
        "content": "<p>Thank you Eric.</p>",
        "id": 153871666,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1487187756
    },
    {
        "content": "<p>Thanks Eric.  I ended up using your template as a starting point and after a small amount of tweaking (specific to my use case), I'm happy with the results!  I am not using your Python script, as I already had a generator that properly built out the ig.json and ig.xml files for me (as well as the listing pages).  I did find one bug in one of your html files, which I'll submit a PR for.</p>",
        "id": 153872069,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487260112
    },
    {
        "content": "<p>The only thing that's still a little wonky is that the \"Summary\" flag doesn't get properly rendered.  It shows up as <code>∑</code>.  I think this is an issue with the IG Publisher jar, though, as it was happening with my initial IG templates too.  Anyone know how to fix that (outside of a global search and replace on the generated files)?</p>",
        "id": 153872070,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487260137
    },
    {
        "content": "<p>I see that too - sometimes - that is according to Grahame a browser dependent thing or something like that.   I will check to see if  all the files are there.  and I merged the typo fix.</p>",
        "id": 153872090,
        "sender_full_name": "Eric Haas",
        "timestamp": 1487269215
    },
    {
        "content": "<p>Chris, it's something weird around UTF-8 and your system and your browser. as far as I know, I am coding the UTF-8 correctly, but some browsers on some systems seem incapable of recognising that. </p>",
        "id": 153872121,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487276827
    },
    {
        "content": "<p>specifically, the xhtml header says it is UTF-8, I am using UTF-8 correctly so far as I can tell, and I am not using a BOM (I was, but some browsers on some systems simply refused to load the pages at all)</p>",
        "id": 153872122,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487276871
    },
    {
        "content": "<p>Hmmm... When I view the real FHIR doc online, my browser renders it correctly.  It's only when viewing the IG that I published that it looks weird.</p>",
        "id": 153872128,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487277355
    },
    {
        "content": "<p>I've updated the <a href=\"https://github.com/Healthedata1/IG-Template\" target=\"_blank\" title=\"https://github.com/Healthedata1/IG-Template\">IG starter template</a> to be a bit more complete and streamlined the pages adding more boilerplate content to each.  Added an extension, complex extension  code system and valueset  using the spreadsheets  and search parameter in XML.</p>",
        "id": 153874814,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488748400
    }
]