[
    {
        "content": "<p>I'm using the IG Publisher jar to attempt to produce documentation for a set of profiles and extensions.  It seems the the generated XHTML Differential Tables are not correct.  For every profile, the Differential Table only has ONE entry (usually the first extension in the profile) -- and that is it.  If you look at the XHTML Snapshot Table, it looks right (multiple extensions, etc) -- so I'm not sure why the Differential Table is not.</p>\n<p>I'm using the igpublisher.jar from the 1.8 release (on a Mac).  How should I go about debugging this?  I'd like to figure out what is throwing it off!</p>",
        "id": 153871379,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487085842
    },
    {
        "content": "<p>Is the differential right in the profile XML/JSON?</p>",
        "id": 153871410,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487092096
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> set me in the right direction.  I inspected the JSON and XML more closely, comparing it to working ones, and realized that I was not putting the root element for the SD in the differential.  I think I was under the impression that the differential <em>only</em> had to have those things that are <em>different</em> -- but it appears that if an element is in the differential, its ancestor elements must also be in the differential (even if they haven't changed).  So obviously that means the root element must be there, but also any backbone elements if you are including one of their children as a differential.</p>",
        "id": 153871419,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487097277
    },
    {
        "content": "<p>Once I fixed that, it worked as expected.  Unfortunately, the igpublisher didn't produce any errors in the qa.html reflecting this problem.  Perhaps that's something that can be checked and reported against in future versions of the igpublisher?</p>",
        "id": 153871420,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487097371
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> I think the root is the only element that must be there.  I don't remember off the top of my head why.  But agree that build tool should certainly yell if it isn't.  Can you submit a change request?</p>",
        "id": 153871423,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487097521
    },
    {
        "content": "<p>Sure.  The root is sufficient if you only add/override things at the root of the resource, but if you go into a nested structure, it seems you need to include the intermediate path definition there too.</p>\n<p>For example, I override cardinality of <code>Encounter.participant.individual</code> to 1..1.  If I put the element for <code>Encounter.participant.individual</code> in the differentials, but don't put an <code>Encounter.participant</code> element in too, then the publisher does not show the participant.individual element in the Differential Table.</p>",
        "id": 153871427,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487098121
    },
    {
        "content": "<p>It seems like there might be an issue with recursive element definitions then as well, and I'm guessing that's the issue that <span class=\"user-mention\" data-user-id=\"191676\">@Lee Surprenant</span> ran into the other day.</p>",
        "id": 153871429,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1487099375
    },
    {
        "content": "<p>for spreadsheets you must include all the intermediate paths. I have no plans to fix this. </p>",
        "id": 153871435,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487100769
    },
    {
        "content": "<p>if you edit structure definitions in some other way, you do not need to include all the intermediate paths</p>",
        "id": 153871436,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487100783
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Do you still need the root if you're authoring the XML directly?</p>",
        "id": 153871456,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487105314
    },
    {
        "content": "<p>in principle you shouldn't, but you might...</p>",
        "id": 153871458,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487105652
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I'm building the IGs using JSON StructureDefinitions that I've generated myself.  My experience is that you <em>do</em> need the root element and you <em>do</em> need the intermediate paths (just like you describe for spreadsheets).</p>",
        "id": 153871522,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487129148
    },
    {
        "content": "<p>Without the root element, the IG Publisher generates a Differential Table containing only the first element in the differential.  Without intermediate paths, the IG Publisher generates a Differential Table missing any nested elements that don't have the intermediate path included in the differential.</p>",
        "id": 153871523,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487129252
    },
    {
        "content": "<p>well, you could create a task prompting me to get to investigating these issues and fixing them. in theory, they shouldn't be required</p>",
        "id": 153871525,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487129389
    },
    {
        "content": "<p>I'll file this in the tracker tomorrow.  I'm just trying to ensure that there isn't any user error on my part before I file a bug!</p>",
        "id": 153871527,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1487130757
    }
]