[
    {
        "content": "<p>What are the experiences NOT using the <code>apply-version</code>-parameter in the IG aka having all codesystems, valuesets and profiles holding individual versions.</p>",
        "id": 264787981,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1639439573
    },
    {
        "content": "<p>When is it a pain and when does it actually contribute</p>",
        "id": 264788009,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1639439607
    },
    {
        "content": "<p>the HL7 terminology package, for instance, doesn't use apply-version - the resources have their own versions</p>",
        "id": 264788940,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639440181
    },
    {
        "content": "<p>the biggest downside is that most editors overlook the version and there's multiple releases with the same version</p>",
        "id": 264789073,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639440286
    },
    {
        "content": "<p>and also, it's harder to figure out what the version should be when you're versioning the package, and hard to be disciplined about it when you do have a workable policy</p>",
        "id": 264789287,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639440450
    },
    {
        "content": "<p>When apply-version is used, brand new resources get the same version number as resources carried over from previous versions.</p>",
        "id": 264796925,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1639446948
    },
    {
        "content": "<p>If you don't do it, you must manually track whether anything has changed and update the version number and do it consistently and right.  That's very hard for humans to do correctly all the time.  It also makes version-specific referencing miserable as you now need to know the specific version of the artifact rather than just the version of the IG.</p>",
        "id": 264815844,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639461264
    },
    {
        "content": "<p>Rigth - and one also needs to consider what kind of change it is when a  resource profile to a reference is changed within the referencing resource. That part is definetly hard. However, there also the downside that using apply-version EVERYTHING is bumped - and that especially might not make sense for eg. ValueSets and CodeSystems if they literally have not changed - <span class=\"user-mention\" data-user-id=\"195340\">@Erik Nielsen</span> feel free to share your thoughts. If one can consider an IG as any other software library/component/package I guess that it is also the case that not all code is changed when a version is bumped - yet the software library/component/package is incremented in its entirety and that makes sense.</p>",
        "id": 264941018,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1639523405
    }
]