[
    {
        "content": "<p>I have 2 questions regarding pre-processing in the IG Publisher:</p>\n<ul>\n<li>If one has access to Saxon, is there anyway to swap out the Apache-derived (I presume) XSL engine with Saxon so that one could use XSL 2.0?</li>\n<li>If I use pre-processing to create UML SVG, can I use the name format that the publisher uses, i.e. <code>[type]-[id]-uml.xhtml</code>, or will these get wiped out by the IG Publisher and so I should some other file name construct?</li>\n</ul>",
        "id": 153900608,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1502074600
    },
    {
        "content": "<p>first: we hate saxon because of it's weird deployment issues</p>",
        "id": 153900610,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502074888
    },
    {
        "content": "<p>that's not a no, but I'm just not interested in supporting saxon for the IG publisher unless someone funds it</p>",
        "id": 153900611,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502074929
    },
    {
        "content": "<p>I don't know about the names</p>",
        "id": 153900612,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502074941
    },
    {
        "content": "<p>you'd have to try</p>",
        "id": 153900613,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502074945
    },
    {
        "content": "<p>Thanks.</p>",
        "id": 153900614,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1502075547
    },
    {
        "content": "<p>One more thing: what's the actual input to the pre-process XSL?</p>",
        "id": 153900615,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1502075574
    },
    {
        "content": "<p>you'll have to askLloyd</p>",
        "id": 153900616,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502077502
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  - question for you</p>",
        "id": 153900617,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502077514
    },
    {
        "content": "<p>The input is the XHTML page files.  You can use the transform to assign section headings and the like.  I'll send you the one I use.</p>",
        "id": 153900619,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502080319
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . :simple_smile:<br>\nShould I expect to have seen something in my e-mail inbox?</p>",
        "id": 153900627,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1502089332
    },
    {
        "content": "<p>I assume that input means you don't have direct access to the actual StructureDefinition XML.</p>",
        "id": 153900628,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1502090637
    },
    {
        "content": "<p>You should - if you didn't, then I must have the wrong one.  Can you PM me the correct one?</p>",
        "id": 153900769,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502139368
    },
    {
        "content": "<p>Okay, so I _finally_ got around to trying some stuff out here, but I'm confused about a few things.  In particular, right now, what do you put in the JSON control file for pre-processing?  I put the name of my XSL file in the <code>pre-process.transform</code>, but then it complained about not having a value for <code>pre-process.folder</code>.  Is this folder the output directory or the input directory?  I assume it's the former, so if I want just a trivial, pass-through result, should I set the value to \"output\" or perhaps \"pages\"?  </p>\n<p>Also, I noticed I got an error in the <code>net.sf.saxon</code> namespace when I used \"temp\" as the value for <code>pre-process.folder</code>.  Does this mean that Saxon is available?  Or is it ancient Saxon (v6.5.5) and so XSLT2 is still not an option?</p>",
        "id": 153904420,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1504593606
    },
    {
        "content": "<p>pre-process.folder is the folder to grab from.  pre-process.relativePath is the folder to put the output in (relative to 'temp').  To the best of my knowledge, we can't use XSLT2.  Grahame was pretty firm :)</p>",
        "id": 153904455,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504619381
    },
    {
        "content": "<p>Thanks.  So what folder should I be grabbing from? <code>temp</code>?</p>",
        "id": 153904546,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1504667012
    },
    {
        "content": "<p>Whatever folder contains the files you want to pre-process</p>",
        "id": 153904586,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504674040
    },
    {
        "content": "<p>How do I find which files are where?  <br>\n(The ones I'm looking for are the StructureDefinition HTML files which seem to be in <code>temp</code>, and the profile/extension lists, which I would have thought would be in <code>temp/_includes</code> but I can't find and which I expect will be difficult to pre-process anyway because they're not well-formed.)</p>",
        "id": 153904614,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1504685300
    },
    {
        "content": "<p>the files in temp don't exist when pre-processing happens - that's why it's called 'pre-processing'</p>",
        "id": 153904615,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1504685469
    },
    {
        "content": "<p>Pre-processing lets you take source and do something with it before it's used as source for the publication process.  For example, I use pre-process to assign section numbers to my pages and mini table-of-contents for the page.</p>",
        "id": 153904628,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504703817
    },
    {
        "content": "<p>The publisher then uses the transformed files as source for my pages.</p>",
        "id": 153904629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504703848
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> When you say \"source\", what exactly do you mean?  Is it your own content?  If so, what's the point; can't you just include the section numbers in the source at creation?  If not, then where is it coming from.  I looked at your XSL and I can see what it's doing, but if the HTML source is not the generated content from the IG Publisher, what is it?<br>\nBTW, I had thought  the \"pre\" in \"pre-processing\" meant before Jekyll, not before content creation.</p>",
        "id": 153904771,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1504766317
    },
    {
        "content": "<p>So here's my problem: I want to add some Bootstrap classes to some of the HTML content generated by the IG Publisher, but before it's assembled by Jekyll.  Can I use pre-processing to do this, or do I have to write my own post-processor.  (I really hope not, because post-processing would amount to screen scraping, and that's <em>really nasty</em>!)</p>",
        "id": 153904773,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1504766419
    },
    {
        "content": "<p>I could include the section numbers in the source at creation, but it's a huge pain and chances of getting them right is slim.  Having it done automatically is much easier.  The transform step doesn't touch the generated HTML - I have no need to do that.  It's to pre-process the various ad-hoc descriptive pages and supporting content.  There's presently no way to change the HTML fragments produced by the IG-publisher except by editing the IG-publisher's java code.  You can certainly submit a change request asking for what you'd like.  If it would have general utility, we'd probably make the change.  Or if we could make a transparent change that would allow you to use CSS to drive the desired behavior, that could work too.</p>",
        "id": 153904788,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1504790025
    },
    {
        "content": "<p>There is a resource variable index for each structuredefinition which is shown <a href=\"http://build.fhir.org/ig/Healthedata1/IG-Template/StructureDefinition-template-basic.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/Healthedata1/IG-Template/StructureDefinition-template-basic.html\">here</a>  which you can use in the templates to creates section numbers.</p>",
        "id": 153904858,
        "sender_full_name": "Eric Haas",
        "timestamp": 1504808659
    },
    {
        "content": "<p>Blast! <br>\nBut maybe there's a silver lining: does this mean that I can use pre-processing on the items in the <code>resources</code> directory to do things like create my own UML SVG fragments?</p>",
        "id": 153904911,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1504830839
    },
    {
        "content": "<p>yes that you can do</p>",
        "id": 153904923,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1504839677
    },
    {
        "content": "<p>How to use HAPI FHIR APIs: <a href=\"http://hapifhir.io/doc_rest_client.html\" target=\"_blank\" title=\"http://hapifhir.io/doc_rest_client.html\">http://hapifhir.io/doc_rest_client.html</a></p>",
        "id": 153905812,
        "sender_full_name": "Parijat Kar",
        "timestamp": 1505061470
    },
    {
        "content": "<p>Server used: <a href=\"http://fhirtest.uhn.ca/baseDstu3\" target=\"_blank\" title=\"http://fhirtest.uhn.ca/baseDstu3\">http://fhirtest.uhn.ca/baseDstu3</a></p>",
        "id": 153905813,
        "sender_full_name": "Parijat Kar",
        "timestamp": 1505061512
    }
]