[
    {
        "content": "<p>I would a list of all the implementation guides and seems the only way I can do that is mine Zulip.  The FHIR spec says that they would be published under profiles or the profile registry.  Is profile registry going to be used that way?  Also, I was not able to just get a list of the Implementation Guides the registry contains - had to put in searches and not sure if what I got back was complete.<br>\nThe guides I have found are inconsistent - I am looking for an example of one that follows all the best practices to use as a gold standard but have not succeeded - anyone have a suggestion?<br>\nStill interested in the videos and checklists from the IG review class - thanks.</p>",
        "id": 176806890,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1569644473
    },
    {
        "content": "<p>I don't think <em>any</em> of our IGs follow all the best practices yet.  (And the best practices continue to evolve).  Not sure what you mean by \"All the implementation guides\".  Given that anyone who wants can create one and there's no requirement to register them anywhere, there's no list of all.  The HL7 registry is here: <a href=\"http://www.fhir.org/guides/registry/\" target=\"_blank\" title=\"http://www.fhir.org/guides/registry/\">http://www.fhir.org/guides/registry/</a><br>\nThe continuous integration build ones are here: <a href=\"https://fhir.github.io/auto-ig-builder/builds.html\" target=\"_blank\" title=\"https://fhir.github.io/auto-ig-builder/builds.html\">https://fhir.github.io/auto-ig-builder/builds.html</a> (considerable overlap with the previous list)<br>\nSimplifier has a whole lot more: <a href=\"https://simplifier.net/\" target=\"_blank\" title=\"https://simplifier.net/\">https://simplifier.net/</a></p>",
        "id": 176807186,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569645063
    },
    {
        "content": "<p>we are reconciling these to a single list</p>",
        "id": 176821365,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1569667995
    },
    {
        "content": "<p>Indeed, Simplifier guides are here: <a href=\"https://simplifier.net/guides\" target=\"_blank\" title=\"https://simplifier.net/guides\">https://simplifier.net/guides</a> (It has no manual curation like the HL7 list, so there are some test IGs in there, even while they are not linked to a test project.)<br>\nAnd as Grahame mentions we eventually want to role it into <a href=\"https://registry.fhir.org\" target=\"_blank\" title=\"https://registry.fhir.org\">https://registry.fhir.org</a> to give you one place to find all registered IGs.<br>\nOf course people are still free to not register IGs, keeping them just unlisted or private.</p>",
        "id": 176916968,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1569836519
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-7049\">This Zulip item</a> suggests a registry is in the works. What can we do to encourage or support this notion?</p>",
        "id": 225924084,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1612997517
    },
    {
        "content": "<p><a href=\"http://registry.fhir.org\">http://registry.fhir.org</a> and <a href=\"http://www.fhir.org/guides/registry/\">http://www.fhir.org/guides/registry/</a></p>",
        "id": 225924869,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1612997886
    },
    {
        "content": "<p>The Zulip item Jay references is very old. As Grahame says, we already have a registry.  We need to make more use of it.</p>",
        "id": 225925014,
        "sender_full_name": "Wayne Kubick",
        "timestamp": 1612997970
    }
]