[
    {
        "content": "<p>From: Olga Vovk &lt;<a href=\"mailto:ovovk@samvit-solutions.com\">ovovk@samvit-solutions.com</a>&gt;<br>\nDear all,<br>\nI have a few questions related to ImagingStudy resource. These questions inspired by trying to use FHIR in clinical research.<br>\nMy questions are:<br>\nWhat would be the best way to capture in FHIR the following information:</p>\n<p>1.  A response of yes or no to indicate if an imaging agent was used in the imaging study. - with answers Yes, No, Unknown<br>\n  2.  A response to indicate if the imaging procedure was performed according to the protocol. - with answers Yes, No, Unknown<br>\n  3.  A response to indicate whether the imaging procedure started - - with answers Yes, No, Unknown<br>\n  4.  A response to indicate if diffusion or accumulation in a tissue or cells of an imaging agent not normal to it or in amounts above normal has occurred. - with answers Yes, No, Unknown</p>\n<p>All these responses came from common data elements, and some of them are also part of some research questionnaires.</p>\n<p>My question here is:</p>\n<p>1.  How can I capture this information in FHIR preserving both the context and semantics.<br>\n  2.  Should I resort myself to using Questionnaire and QuestionnaireResponce resources? If I want preserve semantics, I have a feeling I should better use ImagingStudy resource, but please advise.<br>\n  3.  Regarding #a and b, if I am using Questionnaire and QuestionnaireResponce resources (because it looks like an easy way, given the nature of these \"Yes;No\" questions), how can I link a given questionnaire/response to the particular ImagingStudy resource?<br>\n  4.  #c is absolutely necessary given that we are talking about research.</p>\n<p>Thank you!</p>\n<p>Olga Vovk<br>\n&lt;:3)))~~~~</p>",
        "id": 241982778,
        "sender_full_name": "Email Gateway",
        "timestamp": 1623184809
    },
    {
        "content": "<p>If you truly need things as Yes/No/Unknown, you're probably looking at a QuestionnaireResponse - as that's not the natural way most of this information would be captured.  However, you could auto-populate the answers in that QuestionnaireResponse from the relevant elements in the record (if available).  Provenance would allow you to indicate that certain answers had been derived from certain resources.</p>\n<ol>\n<li>By 'imaging agent' do you mean something like a contrast agent?  If so, that would be a MedicationAdministration with a 'partOf' relationship to the imaging Procedure</li>\n<li>That would probably be a complex extension on the 'instantiates' relationship - that extension would allow capture of exactly what deviation(s) had occurred - possibly pointing to a CarePlan or something.  Keep in mind that multiple protocols could be in play and failing to follow one might well mean adhering to another</li>\n<li>This would be driven by the Procedure.status</li>\n<li>This would be an Observation - or might need to be inferred from a set of Observations.</li>\n</ol>",
        "id": 242009989,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623203895
    },
    {
        "content": "<p>First off, I'd hesitate to use ImagingStudy for most of this. I tend to think of ImagingStudy as the results of a DICOM C-FIND, or as an index to the images. You <em>could</em> define extensions on ImagingStudy to capture most of this info, but I'd looke towards Procedure and Observation instead.</p>\n<p>For the captured data:</p>\n<ol>\n<li>I'm split on whether this is an Observation or an attribute of Procedure (and which attribute). I'm thinking it might be Procedure.used, with a codeable reference of the contrast agent or a code indicating no contrast.</li>\n<li>I think this is an Observation with the Procedure (not the Patient) as the subject. It also seems like a candidate for a standard extension on Procedure.</li>\n<li>If the Procedure.status is in-progress, on-hold, stopped, or completed, then it was started.</li>\n<li>I think this is an Observation with subject of the patient; focus, bodySite, or specimen of the particular tissue, and partOf of the procedure.</li>\n</ol>\n<p>For your questions:</p>\n<ol>\n<li>An Observation has a patient and/or a procedure; a Procedure has a patient -- that covers the context. The semantics should be covered by the code of the Observation, and the Observation value.</li>\n<li>If these are coming from a paper form, Questionnaire and QuestionnaireResponse aren't a bad option for an intermediate state, but to do something with the data, you'll probably want to keep going and convert the QR to the resources I suggest.</li>\n<li>There are ways to define the resource context of a Q/QR. Again, though, I would suggest that isn't where you want to stop.</li>\n<li>(I'm assuming #c means item 3) No, you could leave your results as QR, but that will make analysis more difficult, and will mean that this information can only be used in the context of that questionnaire, rather than making it available as a general observation.</li>\n</ol>",
        "id": 242010261,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1623204225
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , I think capturing the info using QR makes sense, but I would use that to generate the other resources. I don't think you stop there. And, yes, some of the info could be pre-populated by the Questionnaire mechanism.</p>",
        "id": 242010856,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1623204918
    },
    {
        "content": "<p>Dear Lloyd and Elliot,<br>\nThank you so much for your time assessing my multiple questions and your answers. Much appreciated!<br>\nI will share them with  my research team,<br>\nThank you!<br>\nOlga</p>",
        "id": 242061205,
        "sender_full_name": "Olga Vovk",
        "timestamp": 1623243944
    },
    {
        "content": "<p>Hi Lloyd and Elliot,<br>\nI have a follow up question,<br>\nYou wrote:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> , I think capturing the info using QR makes sense, but I would use that to generate the other resources. I don't think you stop there. And, yes, some of the info could be pre-populated by the Questionnaire mechanism.<br>\n'''</p>\n<p>So, if, we are to proceed with using Questionnaire and QuestionnaireResource to capture \"indicator\" questions, then my next question is</p>\n<ol>\n<li>Which elements from these resources can be used to provide the reference back to the corresponding domain resource(s)?</li>\n</ol>\n<ul>\n<li>E.g. if I am asking a question “xx” in  a questionnaire X designed for a particular study Z, how can I link this particular Questionnaire and QuestinnaireResponce resources to this particular Z? Which elements should I use/refer to?</li>\n<li>Or. if I am asking a question in a questionnaire related/designed to a particular imaging study/imaging acquisition instance, how can I link it to a particular Imaging.Study resource? Which elements should I use/refer to?</li>\n</ul>\n<p>Thank you!!!<br>\nOlga</p>\n</blockquote>",
        "id": 242116252,
        "sender_full_name": "Olga Vovk",
        "timestamp": 1623266412
    },
    {
        "content": "<p>I think the Structured Data Capture implementation guide would be useful here. (<a href=\"http://build.fhir.org/ig/HL7/sdc/\">http://build.fhir.org/ig/HL7/sdc/</a>) It describes the flow of finding a questionnaire, filling in a response, and extracting the data into resources. You probably need to look at launchContext, but I'll leave it to others to chime in on that detail.</p>",
        "id": 242118579,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1623267555
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191380\">Elliot Silver</span> <a href=\"#narrow/stream/179166-implementers/topic/ImagingStudy.20related.20questions/near/242118579\">said</a>:</p>\n<blockquote>\n<p>I think the Structured Data Capture implementation guide would be useful here. (<a href=\"http://build.fhir.org/ig/HL7/sdc/\">http://build.fhir.org/ig/HL7/sdc/</a>) It describes the flow of finding a questionnaire, filling in a response, and extracting the data into resources. You probably need to look at launchContext, but I'll leave it to others to chime in on that detail.</p>\n</blockquote>\n<p>Hi Elliot,<br>\nThank you so much for the reference to SDC.<br>\nI will definitely look into it,<br>\nThank you!<br>\nOlga</p>",
        "id": 242124404,
        "sender_full_name": "Olga Vovk",
        "timestamp": 1623270132
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"377694\">Olga Vovk</span> <a href=\"#narrow/stream/179166-implementers/topic/ImagingStudy.20related.20questions/near/242061205\">said</a>:</p>\n<blockquote>\n<p>Dear Lloyd and Elliot,</p>\n</blockquote>\n<p>Thank you so much for answering my questions and for your time.<br>\nI have more imaging study related questions. This time related o IV imaging contrast administration.<br>\nI need to be able to capture the following information in FHIR:</p>\n<ol>\n<li>[Was] IV contrast used for a given imaging acquisition? - answers Yes/No/Unknown</li>\n<li>Confirmation that the patient has no allergy to IV contrast agent. -  That ideally should be obtained prior to IV contrast agent administration, question 2.</li>\n<li>IV contrast name - answered if \"Yes\" was for #1</li>\n<li>Time when IV contrast administered, if \"Yes\" was for #1</li>\n<li>Amount of IV contrast injected</li>\n<li>Flow rate of IV contrast</li>\n<li>IV contrast concentration</li>\n<li>Location of injection site</li>\n<li>Was a test bolus performed? - answers Yes/No/Unknown</li>\n<li>What type of contrast bolus was administered?</li>\n<li>Bolus timing method. E.g. the method in which the imaging agent was administered intravenously over time. <br>\nand to capture it in a full context. </li>\n</ol>\n<p>I mean for the research purposes the question above needed to be captured in a context of <br>\n1.  A given ResearchStudy, and ResearchSubject.<br>\n2.  For a given imaging acquisition.<br>\n3.  In a context of a given condition/observation.<br>\nI believe MedicationAdministration resource could be a good choice to capture most of the questions above.</p>\n<p>My difficulty is in figuring out which other resources I need to use and fill out to in order to provide the full context/semantics.<br>\nThank you!<br>\nOlga</p>",
        "id": 242221590,
        "sender_full_name": "Olga Vovk",
        "timestamp": 1623337480
    },
    {
        "content": "<p>Agree that MedicationAdministration would be a good fit for most.  My recommendation would be to map what you can that's straightforward and ask on the <a class=\"stream\" data-stream-id=\"179249\" href=\"/#narrow/stream/179249-Medication\">#Medication</a> stream if there are elements remaining you're not sure about</p>",
        "id": 242222885,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623337975
    },
    {
        "content": "<p>Hi Lloyd,<br>\nThank you!<br>\nWill do,<br>\nBest,<br>\nOlga</p>",
        "id": 242224290,
        "sender_full_name": "Olga Vovk",
        "timestamp": 1623338594
    }
]