[
    {
        "content": "<p>Hi All,<br>\nWe want to use image attachment for Organization resource. Shall we create an extension for Organization resource.<br>\nCan anyone suggest me?<br>\nThanks in advance.</p>",
        "id": 164322530,
        "sender_full_name": "rekha",
        "timestamp": 1556349176
    },
    {
        "content": "<p>What sort of image are you storing?  An extension would be reasonable for a logo or something like that.</p>",
        "id": 164336577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556373077
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . We are planning to add an extension for attaching Hospital image.</p>",
        "id": 164423753,
        "sender_full_name": "rekha",
        "timestamp": 1556512626
    },
    {
        "content": "<p>Ok.  That sounds slightly more appropriate for Location than Organization, but you can put it on Organization if they have a 1..1 relationship.  If you wanted to submit a change request for the creation of a standard extension, that wouldn't necessarily be a bad idea.  However, you're free to define your own extension if you prefer.</p>",
        "id": 164449923,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556543074
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 164450260,
        "sender_full_name": "rekha",
        "timestamp": 1556543267
    },
    {
        "content": "<p>The company logo would be appropriate for the org, and a photo of the hospital on the location resource.</p>",
        "id": 164583399,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1556664214
    },
    {
        "content": "<p>Similar - in a way...  A provider wants to have a logo print based on their location for the day (etc.).  The media resource supports location as a subject, and maybe include note as a tag of logo?  We want to easily find the logo for the provider and send the provider with the associated logo in a bundle and wondering if anyone has done this...</p>",
        "id": 189837374,
        "sender_full_name": "Daniel Lanphear",
        "timestamp": 1583443009
    },
    {
        "content": "<p>That's not something I've heard of.  What's the purpose of having a location-based logo?  Is logo the right word?</p>",
        "id": 189838046,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583443448
    },
    {
        "content": "<p>Yes it's really more of a letterhead, so the provider can print off patient notes and have the location logo show up</p>",
        "id": 189844007,
        "sender_full_name": "Daniel Lanphear",
        "timestamp": 1583447155
    },
    {
        "content": "<p>It seems more natural to have an extension on the PractitionerRole's link to a particular HealthCareService that indicates that they're \"in\" today.  The logo could be an extension on (either an attachment or a reference to Media) for the logo.  You wouldn't really want a separate copy of the logo stored for each provider for each day, which is what you'd end up with in using just Media.</p>",
        "id": 189850859,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583452882
    }
]