[
    {
        "content": "<p>Hi, we are working with a purchase of a multimedia archive supporting DICOM.  In addition to  ImagingStudy the IHE-profile Web Image Access (WIA) is mentioned. Can anyone briefly describe the relationship between the two with regards to adaption to use cases?</p>",
        "id": 213525887,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1602832912
    },
    {
        "content": "<p>ImagingStudy is the FHIR equivalent of a KOS-object, and WIA is effectively MHD for imaging, where (speaking from memory) the content.attachment of the DocumentReference is an ImagingStudy. <br>\nAs I recall WIA was affectively abandoned in favor of the use of DICOMWeb based URLs in combination with DocumentReference (DocRef.content.attachment is the DICOMWeb URL to an imaging object).</p>",
        "id": 213530689,
        "sender_full_name": "René Spronk",
        "timestamp": 1602836235
    },
    {
        "content": "<p>WIA replaced MHD-I,which was deprecated in 2017. WIA prescribes the use of restful services (DICOMweb) but is agnostic about the infrastructure behind the Document Responder actor. The Document Responder thus can act as a facade to underlying imaging services. \"WIA enables retrieval of imaging studies shared within an enterprise and across enterprises using<br>\nRESTful services. WIA can be used with different image sharing infrastructures, including but<br>\nnot limited to XDS / XDS-I and DICOM / DICOMweb.\"</p>",
        "id": 213547348,
        "sender_full_name": "Bjørn Ravnestad",
        "timestamp": 1602847717
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> ?</p>",
        "id": 213564014,
        "sender_full_name": "John Moehrke",
        "timestamp": 1602857020
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191372\">René Spronk</span> <a href=\"#narrow/stream/179166-implementers/topic/ImagingStudy.20vs.20IHE.20WIA/near/213530689\">said</a>:</p>\n<blockquote>\n<p>ImagingStudy is the FHIR equivalent of a KOS-object</p>\n</blockquote>\n<p>Actually, it is closer to a C-FIND result. The now-deprecated ImagingManifest is closer to a KOS object.</p>\n<p><span class=\"user-mention\" data-user-id=\"192719\">@Bjørn Ravnestad</span> is correct about WIA and MHD-I. Just as MHD can be seen as \"XDS on FHIR,\" MHD-I could be seen as \"XDS-I on FHIR.\" MHD-I used ImagingManifest as the FHIR representation of the KOS.</p>\n<p>(All of the following is going off memories of stuff I haven't looked at recently, so pardon me if I get it wrong.)</p>\n<p>However, MHD-I inherited many of the the shortcomings of XDS-I, both of which trace back to the limited information present in the KOS. That limited information makes both XDS-I and MHD-I suitable for study transfer, but less useful for on-demand viewing. For example, (going off memory) I don't believe image number, or flagging is present in either, which makes it hard to know which images to retrieve first.</p>\n<p>On the other hand, WIA avoids the KOS and sticks to QIDO and WADO (or at least allows a facade in front of the KOS), and is better positioned for interactive use.</p>\n<p>Back to <span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span>'s original question... I'd say Imaging Study is good for non-imaging-centric systems that need to be aware of the existence of a DICOM study, and a few of the key parameters of the study. As long as you know how to create a WADO-RS url, you can also display or retrieve the images. On the other hand, you WIA assumes a higher level of DICOM awareness, since it uses DICOM query, etc. and would be more appropriate for systems willing to \"step into\" the DICOM world in exchange for deeper information and capabilities.</p>",
        "id": 213622611,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1602888811
    },
    {
        "content": "<p>All the acronyms</p>",
        "id": 213638166,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1602916243
    },
    {
        "content": "<p>Thanks, a lot of good information here about the imaging standards acronym-puzzle :). <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> - to what extent would you say that EHRs are or should be willing to \"step into\" the DICOM world?</p>",
        "id": 213639662,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1602919523
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194096\">@Brendan Keeler</span> : KOS - a DICOM Key Object Selection SOP class; WIA - IHE’s Web Image Access profile; MHD - IHE’s Mobile Access to Health Documents profile; MHD-I - MHD for Imaging; XDS - IHE’s Cross-Enterprise Document Sharing profile; XDS-I - XDS for imaging; C-FIND - traditional DICOM query; QIDO - RESTful DICOM query; WADO - RESTful DICOM retrieve. That should be most of them, except the ones I introduced in this response.</p>",
        "id": 213641509,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1602923465
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> that is perhaps a better question for someone on the EMR side of the aisle. I think image viewing within the EMR will increase, but image archive will remain separate. New uses of DICOM outside of radiology, such as in pathology or dermatology, as well as point-of-care ultrasound and other encounter-based imaging will drive the need for more systems that deal with both worlds. I suspect some AI and CDS systems will be heavily EMR-focused but will want to use high-level imaging info.</p>",
        "id": 213641843,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1602924167
    },
    {
        "content": "<p>Oh, sorry, I'm familiar with all of them. It just reminds me how the imaging space is still very all-over-the-place with standards and formats, like this blog from a few years ago talks about - <a href=\"http://dclunie.blogspot.com/2016/03/how-many-medical-image-exchange.html?m=1\">http://dclunie.blogspot.com/2016/03/how-many-medical-image-exchange.html?m=1</a></p>",
        "id": 213688765,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1602997558
    },
    {
        "content": "<p>Is this because of competition in the \"imaging space\" or just a growing maturity and recognition of the need to make \"imaging systems\" more interoperable with the \"rest of the HealthCare IT ecosystem\"?</p>",
        "id": 213716273,
        "sender_full_name": "John Silva",
        "timestamp": 1603041852
    },
    {
        "content": "<p>Some countries have converged on a standard. The Netherlands uses XDS-I in a widespread manner</p>",
        "id": 213789076,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1603115945
    }
]