[
    {
        "content": "<p>In FHIR Release 3, the Immunization resource included the vaccinationProtocol BackboneElement which contained elements related to protocol under which the dose of vaccine was administered. It contained elements such as the series name, the total number of doses in the series (e.g. the series is complete after 5 doses), the dose sequence (e.g., it was the second dose in the series) and the dose status (valid/invalid). In response to a gForge comment, in Release 4, we removed the vaccinationProtocol BackboneElement and move much of the content to a new resource called ImmunizationEvaluation. This arrangement suits workflows in the US and Canada where clinical decision support (CDS) is typically used to evaluate the whole immunization history for the patient and validate (or invalidate) each dose according to the current recommendations in force at the time (recommendations do continually evolve overtime). However, this new arrangement of resources may present a problem in Australia (see gForge ticket #14536) and likely New Zeland where automated CDS is more rare and the emphasis is on the provider to document the dose sequence for the immunization event. We can solve this issue by adding the dose sequence element back to the Immunization resource as either part of the core resource or as an extension or by leaving it to be a local extension.</p>\n<p>Before we decide the best course of actions, we’d like to learn more about the reporting of immunizations in other countries to better understand how widespread the need for a dose sequence is. Please let us know if your country relies on the provider indicating the dose sequence (or any of the elements formerly in the vaccinationProtocol BackboneElement) as part of the record of the immunization event.</p>",
        "id": 153940590,
        "sender_full_name": "Craig Newman",
        "timestamp": 1519651061
    },
    {
        "content": "<p>AKAIK in NZ we do require the administrator (of the vaccine) to include the dose sequence in the report, but have reached out to a couple of others to confirm...</p>",
        "id": 153941661,
        "sender_full_name": "David Hay",
        "timestamp": 1519945316
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> I have reached out to <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> on this as Dose Sequence is included in the GP2GP Data Model and the V2 messaging spec for passing data to the NIR (I sent Craig a copy of the later).</p>",
        "id": 153941714,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1519959073
    }
]