[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> I am looking at Immunization again for a project that is using it. Immunization.protocolApplied.targetDisease is still 1..1... why? In most u I've seen, you have a doseSequence, and maybe a series, and no specified target disease. We've already discussed this - it should be optional. <span class=\"user-mention\" data-user-id=\"191839\">@diego kaminker</span> - please ask locals to chime on this one</p>",
        "id": 154011411,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540305570
    },
    {
        "content": "<p>I believe our thinking was that because protocolApplied itself was 0..*, that we only needed a single targetDisease per protocol. A given administration might satisfy multiple protocols - for example Twinrix contains both HepA and HepB and so a dose of Twinrix would satisfy both Hepatitis A and Hepatitis B protocols but that each protocol would be distinct and apply to a single disease. </p>\n<p>Under what circumstances would a target disease not be known/relevant for a protocol? It seemed like it was core to the protocol  and therefore we required it. What is the purpose of the protocol if not to provide protection to at least a single disease.</p>\n<p>We actually have a similar gForge ticket #17773 for ImmunizationRecommendation.recommendation.targetDisease asking it to be changed to 0..*. We'll likely find that persuasive for the case where a particular vaccine is indivisible. For example the MMR vaccine is against measles, mumps and rubella and individual vaccines are not available. Would this logic also apply here?</p>\n<p><span class=\"user-mention\" data-user-id=\"191418\">@Joginder Madra</span>  can add his two cents as well.</p>",
        "id": 154011429,
        "sender_full_name": "Craig Newman",
        "timestamp": 1540307925
    },
    {
        "content": "<p>Not much to add other than have things within ProtocolApplied be 0..1 would allow for being very granular with information - e.g. this is dose 1 for measles, but dose 2 for mumps and dose 1 for rubella.  The question is do need to communicate like that.</p>",
        "id": 154011563,
        "sender_full_name": "Joginder Madra",
        "timestamp": 1540325137
    },
    {
        "content": "<p>The issue is that all the survellience programs I've seen - national ones - routinely collected doseSequence, and not target disease. That is considered to be implied by the protocol, not not cared about. If R4 forces you to have targetDisease if you want dose sequence, and implementers don't know the targetDisease ,what do they do?</p>\n<ul>\n<li>don't use FHIR </li>\n<li>use an extension for doseSequence (non-conformant)</li>\n<li>make up a pretent targetDisease (bad)</li>\n<li>leave targetDisease out (non conformant)</li>\n</ul>\n<p>I hope you don't prefer that the answer be #1: FHIR is not suitable for national immunization reporting.</p>",
        "id": 154011582,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540327260
    },
    {
        "content": "<p>Please fix this for R4 (which means: ASAP). <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> <span class=\"user-mention\" data-user-id=\"191418\">@Joginder Madra</span> to me this feels like best practice desire running into the reality that target disease is usually considered implied</p>",
        "id": 154011584,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540327365
    },
    {
        "content": "<p>I agree that #1 is not the right answer<br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> the protocol being followed is indicated by Immunization.protocolApplied.series right? If so, it doesn't seem ideal to have to infer a coded concept like a targetDisease from a string element like series. If a target disease is implied by the protocol, how much of a burden is it to declare it explicitly in a coded fashion?</p>",
        "id": 154011623,
        "sender_full_name": "Craig Newman",
        "timestamp": 1540331774
    },
    {
        "content": "<p>it's an incredible burden for most users, since they are writing adapters that take existing messages and databases that do not have the target disease and converting to FHIR. Further, the protocol is not published in a computable form, and even if it were, the implication is something that specialists can do, sometimes only by hand. Even if it were possible to infer it computably, the provision of the data element is not believed to have any value, and it might cost many millions to (a) populate it correctly and (b) check that all implementations are populating it correctly. </p>\n<p>THe principle should be clear in FHIR: if some existing implementations are not populating the element, committees should not make it mandatory except in the most compelling circumstance (no matter how much they think it's a good idea or best practice)</p>",
        "id": 154011627,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540332724
    },
    {
        "content": "<p>Is there a gForge ticket necessary for this sort of change? I might need a bit of help as I've not successfully applied a change yet with TortoiseGit yet. I think I've got it all set up but haven't had the guts (or time) yet to pull the trigger.</p>",
        "id": 154011631,
        "sender_full_name": "Craig Newman",
        "timestamp": 1540333120
    },
    {
        "content": "<p>I can make a gForge ticket for it. I will now. GitHub questions - take them up on <a href=\"#narrow/stream/138-committers.2Fgit-help\" title=\"#narrow/stream/138-committers.2Fgit-help\">https://chat.fhir.org/#narrow/stream/138-committers.2Fgit-help</a></p>",
        "id": 154011633,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540333158
    },
    {
        "content": "<p>Sounds good.</p>",
        "id": 154011635,
        "sender_full_name": "Craig Newman",
        "timestamp": 1540333309
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19487\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19487\">GF#19487</a></p>",
        "id": 154011636,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540333482
    },
    {
        "content": "<p>A STU3 implementation could use  {\"system\":\"http://hl7.org/fhir/v3/NullFlavor\",\"code\":\"NAVU\",\"display\":\"Not available\"} for target disease.</p>",
        "id": 154011686,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1540342578
    },
    {
        "content": "<p>Optional is better.</p>",
        "id": 154011687,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1540342824
    },
    {
        "content": "<p>Any time systems use \"not available\" and a receiving system has a hope of successfully processing the instance, it means the design of the resource is broken.  If it's not information that <em>must exist</em> for the instance to be useable in any of its possible use-cases, the min cardinality should be 0 - regardless of expected or desired practice.  (Good practice is covered by \"good practice\" invariants.)</p>",
        "id": 154011700,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540351633
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - please confirm you are looking for the targetDisease cardinality to be 0..1 (or do you prefer 0..*)</p>",
        "id": 154012286,
        "sender_full_name": "Craig Newman",
        "timestamp": 1540499126
    },
    {
        "content": "<p>I don't have any sense of what the upper cardinality should be.</p>",
        "id": 154012387,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540559586
    },
    {
        "content": "<p>Just that the lower one should be 0</p>",
        "id": 154012388,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540559593
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I applied the change (<a href=\"https://github.com/HL7/fhir/pull/149\" target=\"_blank\" title=\"https://github.com/HL7/fhir/pull/149\">https://github.com/HL7/fhir/pull/149</a>) to Immunization.protocolApplied.targetDisease. Please take a look and make sure it meets your needs. Thanks.</p>",
        "id": 154012529,
        "sender_full_name": "Craig Newman",
        "timestamp": 1540565051
    },
    {
        "content": "<p>ok thanks.</p>",
        "id": 154012530,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540565062
    },
    {
        "content": "<p>yes looks good to me. I see that we still have the split between integer/string - is that landed yet?</p>",
        "id": 154012548,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540565414
    },
    {
        "content": "<p>We didn't have a chance to get to that on yesterday's Public Health call (It was tough to squeeze in the targetDisease discussion). How critical do you think the integer/string issue is? Does that need to be in R4? I'm assuming changing the data type would be substantive but would removing the search parameter (which we've already done for Immunization and ImmunizationEvaluation) be something we could do in early November?</p>",
        "id": 154012554,
        "sender_full_name": "Craig Newman",
        "timestamp": 1540565582
    },
    {
        "content": "<p>it's a subtantive change, yes. So it should be done this week.</p>",
        "id": 154012559,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540565762
    },
    {
        "content": "<p>but I'd rather have it done late than not done, I think</p>",
        "id": 154012560,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540565774
    },
    {
        "content": "<p>I will see if we can address it on the Nov 1 PH call. If so, I should be able to make whatever change is required next Friday (Nov 2)</p>",
        "id": 154012565,
        "sender_full_name": "Craig Newman",
        "timestamp": 1540565862
    },
    {
        "content": "<p>that would be good, thanks</p>",
        "id": 154012570,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1540565923
    },
    {
        "content": "<p>I'm working on generating the FHIR Immunization Resource (STU3) from a CCDA 2.1.<br>\nI have trouble mapping the <br>\n1. <strong>Path: Immunization - Site  in FHIR STU3</strong>:  For populating this path from a CCDA 2.1, i'm planning to get this information from the approachSiteCode . <br>\n     The codes that I get from this approachSiteCode is different from the one that's listed in the FHIR value set.<br>\n<strong> CCDA Path</strong>         : (Immunization -&gt; entry -&gt; Substance Administration -&gt; approachsiteCode) <br>\n<strong>FHIR Value Set</strong> : Immunization Site:- <a href=\"http://hl7.org/fhir/STU3/valueset-immunization-site.html\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/valueset-immunization-site.html\">http://hl7.org/fhir/STU3/valueset-immunization-site.html</a><br>\n<strong>CCDA Value Set</strong>: It's for Body Site <br>\n                                        ( <a href=\"http://ccda.art-decor.org/ccda-html-20150727T182455/voc-2.16.840.1.113883.3.88.12.3221.8.9-2013-01-31T000000.html\" target=\"_blank\" title=\"http://ccda.art-decor.org/ccda-html-20150727T182455/voc-2.16.840.1.113883.3.88.12.3221.8.9-2013-01-31T000000.html\">http://ccda.art-decor.org/ccda-html-20150727T182455/voc-2.16.840.1.113883.3.88.12.3221.8.9-2013-01-31T000000.html</a> )</p>\n<p>Can someone shed some light on this scenario to map the  Immunization.Site from CCDA 2.1.</p>",
        "id": 160892175,
        "sender_full_name": "Vishak OS",
        "timestamp": 1552668631
    },
    {
        "content": "<p>the FHIR codes arean example binding. We can't specify the snomed binding that CCDA does internationally.</p>",
        "id": 160902624,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552675768
    },
    {
        "content": "<p>any US profile of immunization will. except I see that <a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-immunization.html\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-immunization.html\">https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-immunization.html</a> doesn't - <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span></p>",
        "id": 160902977,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552676010
    },
    {
        "content": "<p>Hi everyone!<br>\nThere are some infomations:<br>\n- Number of shots tetanus vaccinated by the mother<br>\n- Babies have neonatal tetanus protection ?<br>\n- Is the child fully immunized?<br>\nHow present them in fhir ? mapping to Resource ?<br>\nThanks all</p>",
        "id": 182029953,
        "sender_full_name": "Dongtu",
        "timestamp": 1574869037
    },
    {
        "content": "<p>Please make sure you look at the guidelines for asking questions at <a href=\"https://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions\" target=\"_blank\" title=\"https://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions\">https://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions</a></p>\n<p>Should look at the immunization related resources (Immunization, ImmunizationRecommendation and ImmunizationEvaluation (this one is only in R4). These should answer most of your questions.</p>\n<p>The hardest one is \"is the child fully immunized?\". The answer to this will depend on which guidelines you go by (the recommendations for the US may be different than those in Russia or India, etc. This determination is typically done by a clinical decision support engine and then the \"recommendations\" represented in an ImmunizationRecommendation. This sort of evaluation and recommendation is usually done only as needed because the answer varies as the patient ages, guidelines change, etc</p>",
        "id": 182053308,
        "sender_full_name": "Craig Newman",
        "timestamp": 1574884466
    },
    {
        "content": "<p>More questions about immunization:</p>\n<ol>\n<li>Suppose that protocol mandates 3 doses, but patient has skipped #2. By the time the patient should take 3rd dose, it's their second. What is the value of doseNumber? I presume it's 3, and we must create an immunization instance for #2 with status not-done - correct?</li>\n</ol>",
        "id": 197341916,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589318772
    },
    {
        "content": "<ol start=\"2\">\n<li>How does the doseNumber look like, when the schedule is \"when pregnant\"?</li>\n</ol>",
        "id": 197342017,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589318849
    },
    {
        "content": "<ol start=\"3\">\n<li>Can we have Location as a CodeableReference like CarePlan.activity.detail.location? <br>\nSame rationale: Concepts like \"at the patient's home\" would deserve a code</li>\n</ol>",
        "id": 197342626,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589319134
    },
    {
        "content": "<p>Isn't there something like 'N/A' (Not Administered - Completion Status) that can be used to indicate an admin was not given (and there a place to put reason why?)</p>",
        "id": 197357655,
        "sender_full_name": "John Silva",
        "timestamp": 1589330660
    },
    {
        "content": "<p>There's a \"not-done\" status</p>",
        "id": 197358124,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1589331188
    },
    {
        "content": "<p>The dose number is always tricky because it can be interpreted different ways. There is simply a count of the number of doses of a given vaccine but that's nothing more than a count of Immunization resources (although this gets tricky because different vaccines have different formulations (eg, a patient gets a dose of HepB and then a dose of Twinrix (HepA/HepB) so what dose number is Twinrix??).</p>",
        "id": 197413355,
        "sender_full_name": "Craig Newman",
        "timestamp": 1589377016
    },
    {
        "content": "<p>In your scenario,  clinically and from patient point of view it would be considered dose 2 with dose 3 still outstanding.   There is risk it it being considered as dose 3.  P Muir MD</p>",
        "id": 197413612,
        "sender_full_name": "Peter Muir",
        "timestamp": 1589377146
    },
    {
        "content": "<p>More frequently, the \"dose number\" is relative to a set of guidelines produced by someone. These (in my experience in the US) are rarely discrete, machine computable guidelines (although the CDC's CDSi project does a really good job at making them so). But a given Immunization resource has a variable dose number depending on what set of guidelines it's compared to which is why we have ImmunizationEvaluation as a resource). For example, an infant gets vaccinated with MMR at 10 months, 12 months and 18 months. Technically, there are 3 doses, but when compared to the CDC's recommendations there is only one valid dose (the dose at 12 months is \"dose 1 in the MMR series) because the first one was to early for recommended dose 1 and the last one was too early for recommended dose 2. But compared to the \"infant travelling internationally before the age of 1 year\" recommendation, the first dose may in fact be valid for that recommendation (but still invalid for the standard series).</p>",
        "id": 197413956,
        "sender_full_name": "Craig Newman",
        "timestamp": 1589377309
    },
    {
        "content": "<p>In your specific example, I don't think you'd want to document a missed dose unless it was offered and refused for some reason. Often the recommendations offer multiple paths to presumed immunity and it doesn't really matter which path is taken (although the one that gets the patient to presumed immunity the fastest is typically the favored one).</p>",
        "id": 197414118,
        "sender_full_name": "Craig Newman",
        "timestamp": 1589377409
    },
    {
        "content": "<p>I would expect the \"not-done\" status to primarily be used for instances where the dose is offered and refused (either the patient says no or there is some clinical precaution or contraindication that makes it best to wait)</p>",
        "id": 197414293,
        "sender_full_name": "Craig Newman",
        "timestamp": 1589377476
    },
    {
        "content": "<p>Some doses also don't have a dose number. The most common examples are boosters (tetanus, meningitis, etc) and yearly vaccines (influenza). Here there is no upper limit to the number of doses (you don't know how long someone will live). This is why the dose number element allows string to be captured. Pregnancy is a little different, I tend to think of it as a one dose series and so it's dose 1 but the patient may be recommended for that one dose series multiple times over her lifetime (once per pregnancy). It gets a bit grey.</p>",
        "id": 197414680,
        "sender_full_name": "Craig Newman",
        "timestamp": 1589377660
    },
    {
        "content": "<p>Your suggestion for .location seems reasonable. Feel free to write up a Jira ticket and we'll put it on the list to consider.</p>",
        "id": 197414829,
        "sender_full_name": "Craig Newman",
        "timestamp": 1589377714
    },
    {
        "content": "<p>Just to concur what Craig and Peter have said. There is no clinical concept of \"missing\" a second dose, rather the patient is just late in receiving the second dose. The concept of \"missing\" might be used in a retrospective analysis of patient administrations in general to note that patients who appeared in clinic are not receiving doses on time, but this would not be applied to the patient record. Analysis of \"up-to-date\" on immunizations does not use the dose number but rather the dates when each vaccination was given. The idea of doses being in a series, and having dose numbers, is really just an organizational concept that the clinician and patient can readily understand and simplify the schedule. The real schedule depends on the actual dates given.</p>",
        "id": 197416134,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1589378272
    },
    {
        "content": "<p>thank you</p>",
        "id": 197416858,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589378570
    },
    {
        "content": "<p>Just a minor remark: The immunization route value set is <br>\n<a href=\"http://build.fhir.org/valueset-immunization-route.html\">http://build.fhir.org/valueset-immunization-route.html</a></p>\n<p>but for medication and allergyIntolerance, another different set is used - with SCT codfes. <br>\n<a href=\"http://build.fhir.org/valueset-route-codes.html\">http://build.fhir.org/valueset-route-codes.html</a></p>\n<p>I know these are just examples and the value sets will be different - but would be interesting to keep consistency in our examples</p>",
        "id": 197422404,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589380954
    },
    {
        "content": "<p>BTW, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <br>\n<a href=\"http://build.fhir.org/valueset-route-codes.html\">http://build.fhir.org/valueset-route-codes.html</a> is also used in a datatype (Dosage.route) but the \"magic\" that populates \"This value set is used in the following places\" is not picking that up</p>",
        "id": 197422519,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589381011
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192758\">Craig Newman</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization/near/197414118\">said</a>:</p>\n<blockquote>\n<p>In your specific example, I don't think you'd want to document a missed dose unless it was offered and refused for some reason. Often the recommendations offer multiple paths to presumed immunity and it doesn't really matter which path is taken (although the one that gets the patient to presumed immunity the fastest is typically the favored one).</p>\n</blockquote>\n<p>Or scheduled but not possible to give - the \"not done\" reasons here are the same as we have (likely taken from the FHIR value set)</p>",
        "id": 197437847,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589386955
    },
    {
        "content": "<p>And those I would like to register</p>",
        "id": 197438136,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589387084
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/valueset-immunization-status-reason.html\">http://build.fhir.org/valueset-immunization-status-reason.html</a></p>",
        "id": 197438242,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589387130
    },
    {
        "content": "<p>I do find this strange (possibly a cultural thing):<br>\nvaccine safety concerns:The patient or their guardian objects to receiving the vaccine because of concerns over its safety.</p>",
        "id": 197438356,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589387172
    },
    {
        "content": "<p>is this \"I read on the internet\"?</p>",
        "id": 197438398,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589387183
    },
    {
        "content": "<p>Specifically, this is a) Patient objection (whatever reasons, i.e. please spare the nurse or physician about mercury and autism)</p>",
        "id": 197438519,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589387240
    },
    {
        "content": "<p>or b) someone - not specifically patient or guardian - has some concerns about safety.</p>",
        "id": 197438564,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589387267
    },
    {
        "content": "<p>if this is </p>\n<ul>\n<li>\"you are going to a danger zone, we cannot give you this vaccine less than a month before departure\" - it is contraindication</li>\n<li>\"this vaccine has some issues because I (the real doctor) got a call from the supplier or my colleagues - then it is contraindication(?)</li>\n<li>\"i (the doctor) am unsure about safety, so I put it to you as a patient who must decide\" - and then the patient can object or not.</li>\n</ul>",
        "id": 197439077,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589387474
    },
    {
        "content": "<p>Am I missing the reason behind that last value?</p>",
        "id": 197439106,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589387488
    },
    {
        "content": "<p>We did skinny down the immunization route value set because there are fewer ways to give a vaccine and we thought it best, even in an example value set, not to set a potentially wrong example by including routes that wouldn't be appropriate for a vaccine.</p>",
        "id": 197454165,
        "sender_full_name": "Craig Newman",
        "timestamp": 1589393648
    },
    {
        "content": "<p>I agree with it being subset, the thing that triggered me is that the values are different - one uses SNOMED codes, the other uses a different set of codes</p>",
        "id": 197460930,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589396715
    },
    {
        "content": "<p>I don't know the <a href=\"http://build.fhir.org/valueset-immunization-status-reason.html\">http://build.fhir.org/valueset-immunization-status-reason.html</a> code set, but I can speak to what the meaning of the codes might be. All of the codes that have a definition that starts with \"The patient or their guardian objects...\" are an overlapping set of concepts that simply indicate that the patient/parent object to receiving a vaccination that the patient is indicated for and thus should receive now. The distinctions between these are subtle semantics with little impact on the logic of giving vaccinations. Where they have the biggest impact is on local legislation for school entry. US states will define rules to exempt students from receiving vaccinations for various reasons. These concepts then are a loose set of concepts collectively drawn from these regulations. But in the end, no matter the reason for not administering it, the patient is still not protected from the disease. IIS systems may receive this information but will continue to recommend the patient receive their next needed doses. </p>\n<p>Here are my responses to the scenarios you give above:</p>\n<p>\"you are going to a danger zone, we cannot give you this vaccine less than a month before departure\" - it is contraindication</p>\n<p>Normally would expect to not receive any information on vaccination history, it would simply show the vaccination not given. No need to record the contraindication. </p>\n<p>\"this vaccine has some issues because I (the real doctor) got a call from the supplier or my colleagues - then it is contraindication(?)</p>\n<p>If the vaccine itself was bad, then it would be disposed out of the stock and not be available for administration. Then if patient's came in for vaccinations there might be an out-of-stock situation. The patient might be referred to another location, or told to reschedule, or stock might be borrowed from somewhere else. In the end, if no vaccination was given, then no information would be recorded on the patient's record. The status of bad vaccine becomes more relevant on the patient record when patient has already received the vaccination but later information indicates that that vaccine was damaged/compromised. So the patient needs to be immunized with that dose again. This dose can then be marked as not valid and so recommendations can be made again for additional doses.</p>\n<p>\"i (the doctor) am unsure about safety, so I put it to you as a patient who must decide\" - and then the patient can object or not.</p>\n<p>I haven't seen coding for indicating that the doctor was concerned about the safety of vaccinations. Even if a doctor was concerned, I don't think that would be recorded. A vaccination given assumes that the clinician and the patient/guardian agreed that the vaccination was appropriate to be given at this time. If the doctor had concerns about giving a specific vaccine to a specific patient then this would simply not be given and not recorded on the record. Other medical conditions that might lead to this decision might be recorded on the record, but do not need to be tied to a non-immunizing event.</p>",
        "id": 197726903,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1589564566
    },
    {
        "content": "<p>thanks. So \"The patient or their guardian objects to receiving the vaccine because of concerns over its safety\" is not really a clinical thing but a social thing? I can understand that, I was just assuming that \"patient refuses\" does not need to be detailed because I don't see the impact behind that (my starting point was that the patient's or guardian's opinions about a vaccine safety is usually not really relevant).</p>",
        "id": 197733300,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589567410
    },
    {
        "content": "<p>(but I may be missing something. So it's ok, i just won't use these codes)</p>",
        "id": 197733335,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1589567431
    },
    {
        "content": "<p>We are working on mapping Immunization flat file into FHIR. The flat file can either contain a CVX code OR a CPT code. We are mapping the CVX code to Immunization.vaccineCode &amp; we’re going to reference our to Procedure through Encounter for the CPT code. If we don’t get a CVX code, is it appropriate to go directly to the Procedure resource rather than through the Immunization.  These CPT codes are vaccine codes which is why we want to use the immunization resource.  Is there a best practice for this scenario?</p>",
        "id": 199539512,
        "sender_full_name": "Erin Daves",
        "timestamp": 1591125250
    },
    {
        "content": "<p>It's not wrong to put both the CVX and CPT code in .vaccineCode (and if you have both, just create two codings)</p>",
        "id": 199540600,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591125768
    },
    {
        "content": "<p>Thank you Lloyd! Couple things I should mention....<br>\n1) we could get both &amp; .vaccineCode is 1..1<br>\n2) we have 3 dates in total (if we get Both) we need to Map all 3. <br>\n3) if we get the CPT only we have 2 dates- that we need to map, which is one of the reasons we used encounter &amp; procedure to begin with.  Immunization.occurrence only allows for 1..1 as well.</p>\n<p>Appreciate your quick response!</p>",
        "id": 199541436,
        "sender_full_name": "Erin Daves",
        "timestamp": 1591126206
    },
    {
        "content": "<p>Immuniation.vaccineCode being 1..1 isn't a problem, because the CodeableConcept data type allows for multiple Codings, as long as the code in each Coding instance is intended generally to mean the same thing (allowing for differences in granularity between different code systems) - e.g. the CVX and CPT codes for the <strong>same</strong> vaccine administration.  I'm not seeing why if you have both codes you have an additional date that you need to map (if that is what you mean)?  As I mentioned, both codes should be referring to the same vaccine administration event.  Maybe you can clarify that?</p>",
        "id": 199542513,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1591126746
    },
    {
        "content": "<p>Thanks Rob!! </p>\n<p>Part of the reason why we cannot translate is because these codes are not sent all the time.We have a file that can have three dates and two codes coming in or it can be just a code and one or two dates. When the cpt codes are sent, we have a service date and a from date. When the cvx code are sent, they send an admit date. We have a need to accommodate all three dates when both codes are sent in the file. We proposed having an immunization resource which has the occurence date to capture the admit date and cvx code and to have an encounter and procedure resources to capture the from date, cpt code and service date.</p>",
        "id": 199546786,
        "sender_full_name": "Erin Daves",
        "timestamp": 1591128798
    },
    {
        "content": "<p>Immunization.occurrence should be the date the vaccine was administered. The exact date of administration is important for evaluating the validity of the dose and forecasting when the next dose is recommended. It seems like something like an admit date could be some number of days prior to the actual administration date which wouldn't be good. If you have other types of dates (admit date, \"from\" date (not sure what that is), etc) then would an extension on Immunization be appropriate (presuming you are creating Procedure and Encounter primarily to hold those other date types)?</p>",
        "id": 199550447,
        "sender_full_name": "Craig Newman",
        "timestamp": 1591130487
    },
    {
        "content": "<p>I'll also mention that the CDC maintains a translation from CPT to CVX (but in this direction only) if it makes more sense to convert your CPT to a CVX and consistently send a CVX code. Sometimes granularity is lost (multiple CPTs map to a single CVX code) but if it's better to send a consistent type of code, it may be an option provided that it's not critical to maintain a record of the original CPT code.</p>\n<p><a href=\"https://www2a.cdc.gov/vaccines/iis/iisstandards/vaccines.asp?rpt=cpt\">https://www2a.cdc.gov/vaccines/iis/iisstandards/vaccines.asp?rpt=cpt</a> - if you use this, be sure to read and understand the intent of the table at the top of the page and make sure it is consistent with your needs.</p>",
        "id": 199550807,
        "sender_full_name": "Craig Newman",
        "timestamp": 1591130663
    },
    {
        "content": "<p>Thank you! We will look at using the extensions. </p>\n<p>Appreciate all the feedback, new to this so appreciate patience &amp; clear explanations.</p>",
        "id": 199551756,
        "sender_full_name": "Erin Daves",
        "timestamp": 1591131131
    },
    {
        "content": "<p>That's what this community is for - hard to cover all the nuances in the core spec</p>",
        "id": 199553597,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591131878
    },
    {
        "content": "<p>ImmunizationRecommendation.forecastStatus is mandatory. <br>\nWhat would be the code for a recommendation for \"this patient should get their flu vaccine this year\" ?<br>\nIs \"due\" the right code? since the flu vaccine is optional, and people will get the recommendation before flu season...</p>",
        "id": 205900297,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596544332
    }
]