[
    {
        "content": "<p>We're in the process of migrating from DSTU2 to STU3 and I have a question about Immunization.status. Previously status supported on-hold or in-progress, but now the only options are completed and entered-in-error. In DSTU2 we reported multipart vaccines with a status of in-progress and documented each administration in immunization.protocol, but that's no longer an option. Do we just have it backwards - the resource is for each administration and the protocol indicates it place in the series?</p>",
        "id": 153895071,
        "sender_full_name": "Jeffrey Danford",
        "timestamp": 1498224762
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191418\">@Joginder Madra</span> ?</p>",
        "id": 153895112,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1498241452
    },
    {
        "content": "<p>It is my understanding that Immunization only represents a single administration (within a possible series).  Although Immunization.vaccinationProtocol supports 0..* that is meant for when a single administration satisfies multiple protocols (and is not used to represent all administrations in the series).  There is only one Immunization administration date, location, manufacturer, lotNumber, etc. at the root Immunization level, so it is hard for me to see how you could have used Immunization.vaccinationProtocol previously to represent all administrations in the series when each immunization administration could have its own unique date, location, lotNumber, etc.</p>",
        "id": 153895116,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1498242244
    },
    {
        "content": "<p>So we have it (mostly) backwards. Thanks for the confirmation and clarification.</p>",
        "id": 153895124,
        "sender_full_name": "Jeffrey Danford",
        "timestamp": 1498247571
    },
    {
        "content": "<p>How do we say </p>\n<ol>\n<li>This person is exempt from vaccination because she is pregnant</li>\n<li>This person does not need to be vaccinated now because they were vaccinated last week with J&amp;J vaccine (takes one dose)</li>\n<li>This person does not need to be vaccinated now because they were vaccinated last week with Pfizer vaccine (needs to wait a few weeks)</li>\n<li>This person does not need to be vaccinated because they have antibodies</li>\n</ol>",
        "id": 223809122,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611487278
    },
    {
        "content": "<p>I'm interested in the final assertion, not tracking the whole reasoning and evidence</p>",
        "id": 223809126,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611487308
    },
    {
        "content": "<p>btw <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> I presume this is a good reason to introduce the notion of protocols being highly dynamic. In the good old days, a protocol was fixed for a disease for  a country for several years. Now this protocol depends on the actual product - if you get one brand, you need one dose, if you get another brand, you need two doses with 21 day interval, or 28 day interval</p>",
        "id": 223809217,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611487416
    },
    {
        "content": "<p>This implies looking at the past,  and making a forecast, possibly including due dates or assumed protection period.</p>",
        "id": 223809353,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1611487633
    },
    {
        "content": "<p>Do we have a register for such protocols across countries and products, past and present?</p>",
        "id": 223809403,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1611487687
    },
    {
        "content": "<p>Michelle is correct, Immunization describes a single administration of a vaccine (although depending on which vaccine it is (eg DTaP), a single administration even may help protect against multiple diseases). If a patient has completed a 2 dose series (such as for MMR), we'd expect there to be a minimum of 2 Immunization resources in their history.</p>",
        "id": 223897045,
        "sender_full_name": "Craig Newman",
        "timestamp": 1611581650
    },
    {
        "content": "<p>ImmunizationEvaluation (in R4) can be used to evaluate each Immunization against a specific schedule. As Jose points out, these schedules change (recommended intervals between doses can change, vaccines weren't considered interchangeable are now considered interchangeable, etc). So the evaluation is a snapshot at a point in time against a specific set of recommendations.</p>",
        "id": 223897312,
        "sender_full_name": "Craig Newman",
        "timestamp": 1611581792
    },
    {
        "content": "<p>I don't know of any registry of immunization protocols, but in the US, the CDC has sponsored the CDSi project to convert recommendations from the CDC's ACIP group into machine processable data for ingestion into CDS engines. CDSi documentation can be found at <a href=\"https://www.cdc.gov/vaccines/programs/iis/cdsi.html\">https://www.cdc.gov/vaccines/programs/iis/cdsi.html</a></p>",
        "id": 223897501,
        "sender_full_name": "Craig Newman",
        "timestamp": 1611581897
    },
    {
        "content": "<p>I'll take shot at answering Jose's questions:<br>\nThis person is exempt from vaccination because she is pregnant<br>\nCraig - ImmunizationRecommendation could be used with .forecastStatus indicating that no vaccine is due and the reason in .forecastReason. Again, because schedules change over time (as do patient circumstances, like being pregnant), an ImmunizationRecommendation is snapshot in time. </p>\n<p>This person does not need to be vaccinated now because they were vaccinated last week with J&amp;J vaccine (takes one dose)<br>\nCraig - ImmunizationRecommendation can indicate this with .forecastStatus set to a value like Complete</p>\n<p>This person does not need to be vaccinated now because they were vaccinated last week with Pfizer vaccine (needs to wait a few weeks)<br>\nCraig - Also handled by ImmunizationRecommendation where .dateCriterion includes a date type of \"Date Vaccine Due\" and a future date</p>\n<p>This person does not need to be vaccinated because they have antibodies<br>\nCraig - ImmunizationRecommendation where .forecastStatus is something like Immune</p>\n<p>An Observation might also be appropriate although in some of these cases, but it's important that it's clear that a patient's status may change in the future (eg. presumably the woman might need a vaccination once she's no longer pregnant).</p>",
        "id": 223898393,
        "sender_full_name": "Craig Newman",
        "timestamp": 1611582333
    },
    {
        "content": "<p>So you'd use the ImmunizationRecommendation to recommend NOT to vaccinate?</p>",
        "id": 223917368,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611590444
    },
    {
        "content": "<p>I don't dislike the simplicity at all. <br>\nI do wonder if ImmunizationRecommendation is too specific / if there is another fhir resource that says \"Dr. D states that Patient P does not need this action\". (we'll have to see if there is a difference between \"does not need\" and \"is exempt from...\"</p>",
        "id": 223918125,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611590606
    },
    {
        "content": "<p>When you say it THAT way, it does seems a bit odd <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span> , but I guess the idea is that it's more about guiding actions (even if inactive is the most appropriate course). At one point, we were talking to the CDS group about a more general pattern for offering clinical support, but we never really identified a different way to do it.</p>",
        "id": 223959764,
        "sender_full_name": "Craig Newman",
        "timestamp": 1611608613
    },
    {
        "content": "<p>Let me bring the use case (ok maybe not the most relevant use case but is a very good equivalence):</p>",
        "id": 223968809,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611612490
    },
    {
        "content": "<p>I want my house to have a electric lock, that only opens if visitors provide a set of FHIR resources that tell me \"this person is as vaccinated or has one of these very good excuses)</p>",
        "id": 223969290,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611612630
    },
    {
        "content": "<p>(instead of my backyard, it can be an airplane boarding gate, or a office building space)</p>",
        "id": 223969382,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611612659
    },
    {
        "content": "<p>I don't want any explanations, I just want \"in or out\"</p>",
        "id": 223969625,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611612730
    },
    {
        "content": "<p>...and without disclosure of any  personal health data or other data that are not required for the case.</p>",
        "id": 223981698,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1611620275
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193991\">Christof Gessner</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20status/near/223981698\">said</a>:</p>\n<blockquote>\n<p>...and without disclosure of any  personal health data or other data that are not required for the case.</p>\n</blockquote>\n<p>Precisely. That is the whole case - no reasoning artifacts, no tracing, nothing - this is for me to see if I can let guests into the house, not for me to evaluate their clinical background. I am not a healthcare professional.<br>\nI have no right to look at their data, and definitely they cannot claim that they don't give consent, so I have no right to lock the door.</p>",
        "id": 224026022,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611660561
    },
    {
        "content": "<p>So it sounds like even Immunization as the \"yes\" answer is too clinical (too much detail included) and by itself insufficient because there are rules about the immunization sequence. Two Immunization resources for covid vaccine may not be sufficient if the two doses were given only 10 days apart rather than the required 21/28 days apart.</p>",
        "id": 224041256,
        "sender_full_name": "Craig Newman",
        "timestamp": 1611669283
    },
    {
        "content": "<p>There is a lot of work (on many fronts) being done to standardize some flavor of a verifiable credential (e.g., <a href=\"https://smarthealth.cards/\">https://smarthealth.cards/</a> ).  As far as I know, still very much work in progress though.</p>",
        "id": 224063746,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1611678149
    },
    {
        "content": "<p>In my own personal way of thinking: </p>\n<ol>\n<li>we need standardized ways to share verifiable clinical data (low-level details about products, dates, lot numbers, etc) -- i.e., what we call \"<strong>health cards</strong>\" in the <a href=\"https://smarthealth.cards\">SMART spec</a>. These are generally immutable and long-lived; and then </li>\n<li>we need standardized ways to generate and share evaluations (e.g., the reuslt of executing a set of rules or polices where the inputs are some combination of health cards, questionnaires, etc) -- i.e., what I call  a \"<strong>pass</strong>\" or \"<strong>summary</strong>\" artifact. These are much more contextual and short-lived.</li>\n</ol>",
        "id": 224064508,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611678451
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192758\">Craig Newman</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20status/near/224041256\">said</a>:</p>\n<blockquote>\n<p>Two Immunization resources for covid vaccine may not be sufficient if the two doses were given only 10 days apart rather than the required 21/28 days apart.</p>\n</blockquote>\n<p>Surely, the key purpose of an Immunization Resource is to record an individual administration of a vaccine regardless of the recommended interval between administrations of the same vaccine - or am I missing something here?</p>",
        "id": 224112873,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1611699445
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> that's right, the Immunization resource is about the immunization event itself (what actually happened). But just because an immunization happened doesn't mean that it meets the clinical requirements to start the patient on the road to (presumed) immunity. For example, if a dose of MMR was administered to a 10 month old, that event would be recorded in an Immunization resource. But in the US, that dose wouldn't be considered valid for the child's recommended series of MMR vaccines because it was administered too early. So just the presence of the Immunization resource doesn't mean that the child has fulfilled the recommended vaccination.</p>",
        "id": 224183105,
        "sender_full_name": "Craig Newman",
        "timestamp": 1611755579
    },
    {
        "content": "<p>copied from \"Immunization manufacturer\" topic:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"191415\">Giorgio Cangioli</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20manufacturer/near/224335164\">said</a>:</p>\n<blockquote>\n<p>Looking at the immunization manufacturer  element I was wondering if this element represents only the actual manufacturer (\"the organisation that holds the authorisation for the manufacturing process\") or if it is a more comprehensive element covering any organization having any kind of 'ownership' with the product  (as manufacturer , as marketing authorization holder (MAH), as dealer...).</p>\n<p>I'm asking that because looking at some immunization data sets  currently under development there are some referring the MAH, others the manufacturer and assuming they are using these terms appropriately (i.e. by using the IDMP definitions) I was wondering if both map in the manufacturer element or not....</p>\n</blockquote>",
        "id": 224379345,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1611861894
    },
    {
        "content": "<p>Sorry because I'm new to this thread and you may have considered this option. The MedicationKnowledge <a href=\"http://build.fhir.org/medicationknowledge.html\">http://build.fhir.org/medicationknowledge.html</a> resource may be a way to handle the immunization product details/metadata.</p>",
        "id": 224523767,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1611949606
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20status/near/224026022\">said</a>:</p>\n<blockquote>\n<p>Precisely. That is the whole case - no reasoning artifacts, no tracing, nothing - this is for me to see if I can let guests into the house, not for me to evaluate their clinical background. I am not a healthcare professional.<br>\nI have no right to look at their data, and definitely they cannot claim that they don't give consent, so I have no right to lock the door.</p>\n</blockquote>\n<p>That seems like an Observation.</p>",
        "id": 224974506,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1612329383
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192672\">Floyd Eisenberg</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20status/near/224523767\">said</a>:</p>\n<blockquote>\n<p>Sorry because I'm new to this thread and you may have considered this option. The MedicationKnowledge <a href=\"http://build.fhir.org/medicationknowledge.html\">http://build.fhir.org/medicationknowledge.html</a> resource may be a way to handle the immunization product details/metadata.</p>\n</blockquote>\n<p>Medication contains things like Lot nunmber, serial number, etc. and is the one to use in transactions like this one. Medication has too little attributes to fully define medication, MedicationKnowledge fits that purpose. The only issue is that there's no link between them - We cannot have a Medication in an immunization and univocally refer to a medicationKnowledge</p>",
        "id": 225433586,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1612651315
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191682\">Richard Townley-O'Neill</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20status/near/224974506\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20status/near/224026022\">said</a>:</p>\n<blockquote>\n<p>Precisely. That is the whole case - no reasoning artifacts, no tracing, nothing - this is for me to see if I can let guests into the house, not for me to evaluate their clinical background. I am not a healthcare professional.<br>\nI have no right to look at their data, and definitely they cannot claim that they don't give consent, so I have no right to lock the door.</p>\n</blockquote>\n<p>That seems like an Observation.</p>\n</blockquote>\n<p>I can perfectly accept that indeed. Someone is stating something based on whatever criteria is valid on their end, and it is for a very specific purpose. Thanks <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span></p>",
        "id": 225433642,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1612651390
    },
    {
        "content": "<p>I have followed a few threads and apps about tracking immunization status. I am a bit confused about why this is complex. Do we not have a consistent way to record that a vaccine is administered? I have also heard cases where people are unable to certify the vaccine because they cannot certify the codes (there is like 3, which should be easy, right?)</p>",
        "id": 225433978,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612651994
    },
    {
        "content": "<p>There's rarely any such thing as \"easy\" in healthcare :(</p>\n<p>Note: there being 3 vaccines is <em>not</em> the same as there being only 3 codes.</p>",
        "id": 225439412,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612661270
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"246928\">Josh Lamb</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20status/near/225433978\">said</a>:</p>\n<blockquote>\n<p>I have followed a few threads and apps about tracking immunization status. I am a bit confused about why this is complex.</p>\n</blockquote>\n<p>While I am after something simple (hence my silly example of a door lock that opens with a super-simple vaccination status)<br>\nSome topics I recall have added to this complexity:</p>",
        "id": 225454419,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1612690143
    },
    {
        "content": "<ul>\n<li>Immunization does not mean immunity</li>\n</ul>",
        "id": 225454421,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1612690148
    },
    {
        "content": "<ul>\n<li>a bit more than 3 codes... Let's see the Pfizer vaccine: <ul>\n<li>One code for \"Covid Vaccine\" (SNOMED <strong>1119305005</strong>, ATC <strong>J07BX03</strong>)<ul>\n<li>ICD-11 has a code <strong>91300</strong></li>\n</ul>\n</li>\n<li>There's a specific code for \"messenger RNA COVID-19 Vaccine\": in SNOMED, <strong>1119349007 </strong>fits, but <strong>1142178009 </strong>also  seems to fit.</li>\n<li>For the active substance, there is a UNII (where the U means \"it's  unique, doesn't mean it's the only one\"). for Pfizer it is TOZINAMERAN <strong>5085ZFP6SJ</strong>  <a href=\"https://fda.report/UNII/5085ZFP6SJ\">https://fda.report/UNII/5085ZFP6SJ</a></li>\n<li>one code per country per authorization - so if the vaccine has 2 authorization procedures you may get 2 codes (not sure if anyone is doing it like that, but they can)</li>\n<li>I don't know if there are GTIN codes for that.</li>\n</ul>\n</li>\n</ul>",
        "id": 225454903,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1612690981
    },
    {
        "content": "<p>Thanks for sharing <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> . I have spoken to a few devs who have apps that display vaccination status. Their feedback is similar to yours. </p>\n<p>I am also concerned about the intent of these vaccine cards. Why do other people need to know if I am vaccinated? Given the pace of the tech and vaccine distribution it seems that vaccine cards and distribution will be even. </p>\n<p>If someone does not want a vaccine that is their choice. If the vaccine does not grant immunity I do not see what we are declaring with the status (partial immunity?)</p>\n<p>If someone is vaccinated I am not sure why they need to know if other people are vaccinated. </p>\n<p>I am concerned because vaccines are a polarizing topic and there is a lot of misinformation. I hope we are not considering using vaccine cards as a way to reopen or to determine if someone can receive a service (like Uber or starbucks).</p>",
        "id": 225476336,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612722113
    },
    {
        "content": "<p>I 100% support vaccine cards and people being allowed to easily communicate their vaccine status but I hope we do not get extreme with the cards.</p>",
        "id": 225476410,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1612722177
    },
    {
        "content": "<p>a few replies on the topics I think I should comment:</p>",
        "id": 225479618,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1612726095
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 225479666,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1612726185
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"246928\">Josh Lamb</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20status/near/225476336\">said</a>:</p>\n<blockquote>\n<p>I am also concerned about the intent of these vaccine cards. Why do other people need to know if I am vaccinated? Given the pace of the tech and vaccine distribution it seems that vaccine cards and distribution will be even. </p>\n</blockquote>\n<p>I don't think that everyone is going to be immune/vaccinated against covid that soon. Maybe most people in developed countries will get their 1st covid vaccination (1 or 2 doses) but that won't be the end of the story, I guess</p>",
        "id": 225479741,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1612726271
    },
    {
        "content": "<p>Finally, some vaccines are mandatory in some places. Some schools require vaccination certificates.<br>\nIn this forum we only discuss the technical considerations.</p>",
        "id": 225480404,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1612727357
    },
    {
        "content": "<p>The cards are also an indication of probable risk of being able to get sick and possibly of risk of being able to spread virus.  There are lots of organizations that will want to reduce risk.  There will absolutely be employers and potentially others who, once vaccine access is widespread, will make vaccination (or medical documentation indicating inelligibility) a requirement for employment.  (Not getting a vaccine may be the employee's choice, but continuing to employ them is the employer's choice.)  Also, there may come appoint where testing people who have been properly vaccinated is deemed a waste of resources.  Finally, some vaccines may need boosters or may be more or less effective against certain variants, so the cards will be key to determining if/when subsequent vaccinations are necessary.  It seems very unlikely that this is going to be a situation where you get 2 shots and are done forever.</p>",
        "id": 225481050,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612728353
    }
]