[
    {
        "content": "<p>What would be the status for a recommendation for yellow fever immunization, before the patient travels?</p>",
        "id": 217606975,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606124882
    },
    {
        "content": "<p>I don't think any of the values in <a href=\"http://build.fhir.org/valueset-immunization-recommendation-status.html\">http://build.fhir.org/valueset-immunization-recommendation-status.html</a> are a good match. <br>\nWe can define a local value set but this seems a common eough need, no?</p>",
        "id": 217607117,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606124951
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span></p>",
        "id": 217607128,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606124960
    },
    {
        "content": "<p>Use \"due\" for the first immunization?</p>",
        "id": 217618083,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1606131934
    },
    {
        "content": "<p>I would agree that \"due\" is appropriate. While most immunization recommendations are based on a person's age, there are a number of recommendations that are based on other factors (risk factors, behaviors, occupation, etc). In my mind, an immunization is still \"due\" even if the vaccine is to be given because of one of these other factors.</p>",
        "id": 217626478,
        "sender_full_name": "Craig Newman",
        "timestamp": 1606137640
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193813\">@Nathan Bunker</span> may have thoughts too</p>",
        "id": 217626511,
        "sender_full_name": "Craig Newman",
        "timestamp": 1606137670
    },
    {
        "content": "<p>If a person is known to be traveling to a place that would require a yellow fever immunization then this would be something the CDS engine could be told and then it could recommend the vaccination by saying it is \"due\". </p>\n<p>However, in practice most of the CDS engines I work with do not support travel recommendations because the primary utility of CDS engines is to remind people of standard vaccinations in routine care. People who get Yellow Fever present themselves at a travel clinic where the staff specialize in giving travel vaccinations, this is all outside of routine care and workflows. The vaccination schedule itself is not complex but the rules for identifying if the vaccination are needed are. In the US I've never seen this implemented, but did see travel vaccinations implemented very nicely in the Mes Vaccins system in France. In that one they had an extensive intake form that would allow the person to specify their travel in a very detailed way that could then support a specific travel vaccination recommendation. </p>\n<p>Perhaps the question is what should a CDS engine do if it can recommend Yellow Fever but doesn't have any reason to do so for a patient? In what case should the status be? Is that the question?</p>",
        "id": 217627892,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1606138464
    },
    {
        "content": "<p>Ok, so one step back: AFAIK, </p>\n<ol>\n<li>vaccines like HPV or yellow fever etc are recommended in certain circumstances That recommendation may or not be formally captured</li>\n<li>for some of these vaccines, the patient still needs to have a valid request from a  GP to go pick up the vaccine<br>\nThe immunization should be pointing at the GP's request as a justification.</li>\n</ol>",
        "id": 217650897,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606149236
    },
    {
        "content": "<p>1 is captured with an immunizationRecommendation.<br>\n2 could be either an immunizationRecommendation or a MedicationRequest. What I read above is that 2 is not a ImmunizationRecommendation but a MedicationRequest. Is that what I should interpret?</p>",
        "id": 217651066,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606149306
    },
    {
        "content": "<p>I agree with you. ImmunizationRecommendation says that some CDS system thinks that the vaccine is appropriate and then the MedicationRequest is the provider's official request that the vaccine be given (and this request may be based on the CDS recommendation)</p>",
        "id": 217752420,
        "sender_full_name": "Craig Newman",
        "timestamp": 1606224263
    }
]