[
    {
        "content": "<p>This seems to be about non-eligibility. the value set only includes \"negative\" values (ineligible, uninsured) - but where is the vaccination program?</p>",
        "id": 193904610,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586874126
    },
    {
        "content": "<p>this only has 2 negative values <br>\n<a href=\"http://build.fhir.org/codesystem-immunization-program-eligibility.html\" title=\"http://build.fhir.org/codesystem-immunization-program-eligibility.html\">http://build.fhir.org/codesystem-immunization-program-eligibility.html</a></p>",
        "id": 193904719,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586874159
    },
    {
        "content": "<p>I do not understand whether this resource is supposed to be a record for an immunization administration event, or a history of past immunization(s) or both.<br>\nIn my project I have to report the current immunization record for a patient: <br>\n1- Whether a person has their vaccines in order (according to a program)<br>\n2- The history of administrations (including the details such as brand and lot of the product), and possibly things like \"missed the 2nd dose\"<br>\n3- Eventually the vaccination plan ahead.<br>\nI wonder if I am looking at it the right way.</p>",
        "id": 193906755,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586874940
    },
    {
        "content": "<p>how can I learn how this is supposed to be implemented?</p>",
        "id": 193906793,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586874961
    },
    {
        "content": "<p>Sorry if this re-hashes stuff you already know. There are three related resources. Immunization is recording immunization events. They can be \"new\" events or historical events. The only difference really being how much data could reasonably be expected to be included in the resource (\"new\" vaccines could logically be expected to have things like lot number or amount, etc that a historical event wouldn't have where you're lucky if someone is able to even say \"I got my flu shot last fall\"). The set of all Immunization resources for a patient is their immunization history. Eligibility is about whether or not patient was eligible for a particular program. An example from the US is the Vaccines for Children (VFC) program. The values for eligibility are highly variable by location (in the US, different states have different values including state specific programs, etc) so we didn't include anything more than an example value set. At least in the US, there often are more reasons why someone is ineligible (too old, covered by private insurance, etc) than why someone is eligible.</p>",
        "id": 193938365,
        "sender_full_name": "Craig Newman",
        "timestamp": 1586888876
    },
    {
        "content": "<p>The second resourse is ImmunizationEvaluation which is new in R5 and is intended to be a representation of a comparison of a specific immunization event against a set of recommendations (aka a schedule) for a vaccine preventable disease. This is separated from the Immunization event itself because recommendations change over time, so something that is invalid today may become valid tomorrow. Or sometimes the recommendations give specific conditions under which an immunization could be considered valid even though normally it wouldn't be valid (for example, measles/mumps/rubella (MMR) is invalid for anyone under 1 year of age. But if the infant is travelling internationally, a dose of MMR vaccine before age 1 year is actually valid. But even though it's valid for the travel requirement, it's still not valid for the standard, age-based series. So in the end, that dose at 9 months is both valid and invalid depending on what recommendation you're evaluating against (it's the Schrodinger Cat of immunization events).</p>",
        "id": 193938939,
        "sender_full_name": "Craig Newman",
        "timestamp": 1586889146
    },
    {
        "content": "<p>Finally, ImmunizationRecommendation is the list of vaccines that the patient is due for now or in the future (AKA are recommended for). This can only be produced after the immunization history is evaluated against a set of rules. In theory, a set of immunization recommendations should result in a new round of Immunization events which then impact the next set of immunization recommendations.</p>",
        "id": 193939135,
        "sender_full_name": "Craig Newman",
        "timestamp": 1586889249
    },
    {
        "content": "<p>So, when you say:<br>\nIn my project I have to report the current immunization record for a patient:<br>\n1- Whether a person has their vaccines in order (according to a program)<br>\n2- The history of administrations (including the details such as brand and lot of the product), and possibly things like \"missed the 2nd dose\"<br>\n3- Eventually the vaccination plan ahead.</p>\n<p>I would say that #1 is really ImmunizationEvaluation, #2 is Immunization (although \"missed the 2nd dose\" is really more like ImmunizationEvaluation/ImmunizationRecommendation) and #3 is ImmunizationRecommendation.</p>\n<p>Hope that helps.</p>",
        "id": 193939263,
        "sender_full_name": "Craig Newman",
        "timestamp": 1586889346
    },
    {
        "content": "<p>Thanks, this helps.</p>",
        "id": 193942969,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586891064
    },
    {
        "content": "<p>what about programEligibility? Is the value set complete?</p>",
        "id": 193943005,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586891082
    },
    {
        "content": "<p>I'll use immunization - but I find confusing the ambiguity of roles (history / event) so I will make assumptions - should I bring any conclusions and remarks to the group?</p>",
        "id": 193943252,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1586891178
    },
    {
        "content": "<p>The programEligibility value set is very, very incomplete. Even in just the US, there isn't a widely agreed upon set of concepts. The value set in the US national v2 implementation guide has the concepts below, but even these are uniformly used across all jurisdictions in the US (and probably won't be at all usable outside the US)<br>\nV01 Not VFC eligible<br>\nV02 VFC eligible - Medicaid/Medicaid Managed Care<br>\nV03 VFC eligible - Uninsured<br>\nV04 VFC eligible - American Indian/Alaska native<br>\nV05 VFC eligible - underinsured at FQHC/RHC/deputized provider<br>\nV22 CHIP<br>\nV23 317<br>\nV24 Medicare<br>\nV25 State program eligibility</p>",
        "id": 193955086,
        "sender_full_name": "Craig Newman",
        "timestamp": 1586897301
    },
    {
        "content": "<p>Please bring any questions or suggestions back here and we'll take a look.</p>",
        "id": 193955138,
        "sender_full_name": "Craig Newman",
        "timestamp": 1586897331
    }
]