[
    {
        "content": "<p>in immunization resource there is 'reaction' that has a reference to observation resource. if we have reactions in condition resource (because our product treats it as a condition and in our data base it is under conditions domain), how can we reference this reaction to condition resource? FHIR only allows a reference to observation resource for reaction detail?<br>\n<a href=\"/user_uploads/10155/y0bpveRmjYJCTcURxO9U4Cpx/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/y0bpveRmjYJCTcURxO9U4Cpx/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/y0bpveRmjYJCTcURxO9U4Cpx/image.png\"></a></div>",
        "id": 260980073,
        "sender_full_name": "Lital Inghel",
        "timestamp": 1636546070
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> - when we last talked about syncing the reaction elements in Immunization and AllergyIntolerance, we didn't talk about expanding the reference side of things to include Conditions. When I think of reactions, I mostly think about short term issues (which Observation seems to fit) and not longer term issues where Condition might be used. What do you think of adding that as an option?</p>",
        "id": 260989032,
        "sender_full_name": "Craig Newman",
        "timestamp": 1636551220
    },
    {
        "content": "<p>I don't see how a Condition is a reaction to a vaccination.</p>",
        "id": 261011015,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1636560195
    },
    {
        "content": "<p>The one that came to my mind was Guillain-Barré (although my clinical knowledge of whether this is truly a reaction to a vaccination is severely lacking). <span class=\"user-mention\" data-user-id=\"437616\">@Lital Inghel</span> do you have examples of the sorts of things you store as a Condition?</p>",
        "id": 261027557,
        "sender_full_name": "Craig Newman",
        "timestamp": 1636566706
    },
    {
        "content": "<p>Is such a condition onset and diagnosed right after the vaccination event? Immunization is an event so its lifecycle ends some short time after the administration, I think. It would not be a ongoing record from which we can hang future findings.</p>",
        "id": 261050736,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1636576405
    },
    {
        "content": "<p>I think a condition may be linked to a vaccination event, maybe through an observation. Not the other way around</p>",
        "id": 261051079,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1636576577
    },
    {
        "content": "<p>I think it's legitimate to say it could be either Observation or Condition.  There's a fair bit of flex in terms of where information goes depending on the system and organizational (and individual) preference.  If a clinician thinks the patient's state is something they want on the problem list and will manage as it evolves, then it can be Condition.  Even something like \"sore arm\" could, in theory, be captured as a Condition and managed if someone really wanted to.</p>",
        "id": 261458539,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1636953927
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20resource.20-.20reaction/near/261458539\">said</a>:</p>\n<blockquote>\n<p>I think it's legitimate to say it could be either Observation or Condition.  There's a fair bit of flex in terms of where information goes depending on the system and organizational (and individual) preference.  If a clinician thinks the patient's state is something they want on the problem list and will manage as it evolves, then it can be Condition.  Even something like \"sore arm\" could, in theory, be captured as a Condition and managed if someone really wanted to.</p>\n</blockquote>\n<p>thanks. But FHIR spec as it is today do not allow a reference to condition resource under 'reaction detail', correct? this would have been helpful so that we can tie immunization to its reaction.</p>",
        "id": 261699914,
        "sender_full_name": "Lital Inghel",
        "timestamp": 1637093449
    },
    {
        "content": "<p>I'm agreeing with you - and would encourage you to submit a change request with some examples of why you need it.</p>",
        "id": 261747158,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1637129185
    }
]