[
    {
        "content": "<p>How can we link an immunization to an order e.g. from a physician ?</p>",
        "id": 194894045,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587538704
    },
    {
        "content": "<p>Not seeing a way to do that now. I know we've discussed it in the past, but doesn't look like we ever added anything. Immunization is based on Event so we could look at adding .basedOn and suggesting that it be used to point to the MedicationRequest order resource. Would that work?</p>",
        "id": 194968397,
        "sender_full_name": "Craig Newman",
        "timestamp": 1587578158
    },
    {
        "content": "<p>That would work, yes.<br>\nMedicationRequest or ImmunizationRecommendation?</p>",
        "id": 194969626,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587578724
    },
    {
        "content": "<p>(or both)?</p>",
        "id": 194969644,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1587578730
    },
    {
        "content": "<p>I expect the resource should allow both and perhaps CarePlan as well - 0..*.  <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> can you submit a change request?</p>",
        "id": 195006073,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587600481
    },
    {
        "content": "<p>I agree that .basedOn could point to either MedicationRequest or ImmunizationRecommendation (and maybe CarePlan - I'd have to think about that a bit more). I would have sworn that we added text somewhere that MedicationRequest is the appropriate resource for the order (rather than ServiceRequest), but I don't think I see that anywhere now.</p>",
        "id": 195056780,
        "sender_full_name": "Craig Newman",
        "timestamp": 1587646941
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192758\">Craig Newman</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20order/near/195056780\">said</a>:</p>\n<blockquote>\n<p>I agree that .basedOn could point to either MedicationRequest or ImmunizationRecommendation (and maybe CarePlan - I'd have to think about that a bit more). I would have sworn that we added text somewhere that MedicationRequest is the appropriate resource for the order (rather than ServiceRequest), but I don't think I see that anywhere now.</p>\n</blockquote>\n<p>I do see that <a href=\"http://hl7.org/fhir/medicationrequest-definitions.html#MedicationRequest.basedOn\">MedicationRequest.basedOn</a> has a reference to ImmunizationRecommendation, maybe this was what you were looking for?</p>\n<p>But when a physician wants to register a desired immunization for a patient I assume that should be registered as ImmunizationRecommendation? What is the purpose of the subsequent MedicationRequest? Only a logistic event to get the product dispensed?</p>",
        "id": 218311515,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1606754479
    },
    {
        "content": "<p>The ImmunizationRecommendation is just clinical decision support for the provider. It may come from the local IIS (think the v2 history and forecast query) or from the EHR itself. If the provider decides to follow the recommendation, I could see the MedicationRequest being created if there the workflow needs it to schedule or execute the immunization (maybe vaccine needs to be dispensed, maybe the \"task\" needs to get on someone's to-do list, etc). I suspect the MedicationRequest could also potentially be the authorization to vaccine (as opposed to the ImmunizationRecommendation's suggestion to vaccinate).</p>",
        "id": 218312350,
        "sender_full_name": "Craig Newman",
        "timestamp": 1606754868
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> Aaah I see. That makes a bit more sense now. Thanks. However, it raises a new question in my head. If we use MedicationRequest for the actual physician's intention to go ahead and do stuff (i.e. perform an Immunizatin), why not use MedicationAdministration to register it has been done?</p>\n<p>In other words: what has been the rationale for the separate resource Immunization?</p>",
        "id": 218313444,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1606755276
    },
    {
        "content": "<p>That decision (Immunization versus a profile of MedicationAdministration) was before my time, but I believe it had was decided that an immunization was distinct enough to warrant a separate resource. I'm not sure exactly why that was decided (we might make a different decision today if we were starting from scratch). It might have to do with the fact that an immunization is typically more simple than other types of medication administrations (it's typically a set quantity via a set route administered in a set body site at a more regimented point in someone's lifetime).</p>",
        "id": 218314315,
        "sender_full_name": "Craig Newman",
        "timestamp": 1606755635
    },
    {
        "content": "<p>I agree it is quite distinct from other medicationAdministrations, but more in a conceptual way. You need immunization overview reports for other use cases (in real life) than medication overview reports and typically don't want them mixed.<br>\nAlso (at least in The Netherlands) the logistical processes are quite distinct. Pharmacy's are not typically involved for dispense of immunization products. Furthermore: a lot of immunizations are administered via specific institutions typically not involved in \"normal\" medication processes (well maybe there is an exception to this rule: malaria profylaxe prescriptions).</p>",
        "id": 218315484,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1606756136
    },
    {
        "content": "<p>And it is also related to travelling across borders.</p>",
        "id": 218364659,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1606781388
    },
    {
        "content": "<p>I don't see a strong functional difference</p>",
        "id": 218473868,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606853075
    },
    {
        "content": "<p>The fact that immunizations are many times administered per protocol (and do not have an order) is overlapping - some medications don't have an order, and some vaccines have a prescription.</p>",
        "id": 218474061,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606853197
    },
    {
        "content": "<p>the main reason that the two WGs agreed on a separate resource was that the existing systems captured them differently.  A lot of it is exactly what Arianne said.  We have had standing meetings between PH and Rx to ensure that the two resources were functionally compatible.</p>",
        "id": 218474190,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1606853282
    },
    {
        "content": "<p>For immunization, we usually care about \" did this person follow the protocol yet\" more than \"is this order fulfilled\". But the concepts are not so different</p>",
        "id": 218474337,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606853352
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191437\">@Arianne van de Wetering</span> is your analysis based on the current ZIBs (dutch model)?</p>",
        "id": 218474757,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606853534
    },
    {
        "content": "<ol>\n<li>ordering vs recommendation - IIRC ImmunizationRecommendation predates medicationOrder.intent (which, can be proposal/plan) - and I think there is overlap there</li>\n</ol>",
        "id": 218475119,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606853723
    },
    {
        "content": "<ol start=\"2\">\n<li>MedAdministration vs Immunization - I understand the needs are different (medication is taken vs person has fulfilled one more step towards immunization). We should at  least make sure that we have guidance for the gaps and overlaps.</li>\n</ol>",
        "id": 218475365,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606853839
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191437\">Arianne van de Wetering</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20order/near/218311515\">said</a>:</p>\n<blockquote>\n<p>I do see that <a href=\"http://hl7.org/fhir/medicationrequest-definitions.html#MedicationRequest.basedOn\">MedicationRequest.basedOn</a> has a reference to ImmunizationRecommendation, maybe this was what you were looking for?</p>\n</blockquote>\n<p>No, we want the Immunization event to point to the order taht caused it. The way it is is fine for this case.</p>\n<blockquote>\n<p>But when a physician wants to register a desired immunization for a patient I assume that should be registered as ImmunizationRecommendation? What is the purpose of the subsequent MedicationRequest? Only a logistic event to get the product dispensed?</p>\n</blockquote>\n<p>The physician does not enter a ImmunizationRecommendation (that is what I am learning, and I'm glad with this)<br>\nThe MedRequest is a formal request. I think the Dutch model would consider it a logistics - it allows dispense, reimbursement, etc. It is the doctor's signed paper that this patient can have a vaccine.</p>",
        "id": 218475983,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606854098
    },
    {
        "content": "<p>There is a difference between \"this person should be vaccinated\" and \"give this person a vaccine\" - currently I think there are at least 7.8 billion cases of that difference... :)</p>",
        "id": 218476151,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606854178
    },
    {
        "content": "<p>(Our system uses the same underlying concept for both Immunization and MedicationAdministration so we had to split it to implement the FHIR resources)</p>",
        "id": 218486413,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1606859148
    },
    {
        "content": "<p>I think that we could trim Immunization , leaving Immunization only for the immunization-specific things - those that do not overlap with medicationadministration</p>",
        "id": 218487109,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606859493
    },
    {
        "content": "<p>There was in depth discussion with implementers about whether they wanted to use MedicationAdministration to capture immunizations and the strong response was \"no\" - systems treat them separately.  Different databases, different user interfaces, different reports, different decision support logic, often completely separate modules.  So while we <em>could</em> combine them on the basis of reasonable degree of functionality, the implementer community doesn't want us to.</p>",
        "id": 218494227,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606863603
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20order/near/218474757\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191437\">Arianne van de Wetering</span> is your analysis based on the current ZIBs (dutch model)?</p>\n</blockquote>\n<p>Amongst others. Looking at different current implementations and (real life) processes.</p>",
        "id": 218521007,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1606892386
    },
    {
        "content": "<p>It would help us to have a reference to Medication from Immunization(Recommendation) as - I believe - <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> has argued before.</p>",
        "id": 218521439,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1606892940
    },
    {
        "content": "<p>Yes. Vaccines are medicines. The role of Immunization seems be \"get the important information about the person's vaccination event\" - which is fair but it could well refer to other resources.  For example, in FHIR, the lot number of a product is always in the \"product\" except in Immunization, where it is in the event. This has an impact on traceability.</p>",
        "id": 218522053,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1606893739
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20order/near/218522053\">said</a>:</p>\n<blockquote>\n<p>Yes. Vaccines are medicines. The role of Immunization seems be \"get the important information about the person's vaccination event\" - which is fair but it could well refer to other resources.  For example, in FHIR, the lot number of a product is always in the \"product\" except in Immunization, where it is in the event. This has an impact on traceability.</p>\n</blockquote>\n<p>Exactly!</p>",
        "id": 218522840,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1606894707
    },
    {
        "content": "<p>Do we want to have a joint Public Health and Pharmacy session at the January WGM to further discuss this, particularly linkages between Immunization and Medication? We've discussed this just within Public Health, but expanding to Pharmacy might be helpful. I know WGM isn't for a while, but it might be the best place to get the right people together to talk.</p>",
        "id": 218557241,
        "sender_full_name": "Craig Newman",
        "timestamp": 1606916694
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> we can schedule a joint session.  Pharmacy is meeting Monday to Thursday Q1-4 during the WGM.</p>",
        "id": 218557405,
        "sender_full_name": "Melva Peters",
        "timestamp": 1606916765
    },
    {
        "content": "<p>Public Health is meeting Monday through Friday Q1 and Q2 with a sprinkling of Q3 sessions as well. An early session might work better for the European folks interested. <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> , <span class=\"user-mention\" data-user-id=\"191437\">@Arianne van de Wetering</span> does this idea seem useful to you?</p>",
        "id": 218558071,
        "sender_full_name": "Craig Newman",
        "timestamp": 1606917113
    },
    {
        "content": "<p>I would agree with a conversation about the link between medication and immunizations at the HL7 WGM in January. I think there is a good case to be made that they remain separate concepts. You can reduce immunizations to simply another medication, but they have an odd status in how systems manage them and how they are recorded on a person's record. They tend to be couched in their own location and remain an important part of the patients record even years later, as it establishes their status in immunity to critical diseases. But it may be good to talk about what links can be made. In my own projects I'm wondering if it would be helpful to be able to link an immunization to a medication resource and then be able to represent that immunization resource as both an immunization and a medication so that it can be linked to other concepts.</p>",
        "id": 218617960,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1606942398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193813\">@Nathan Bunker</span> Do we have a specific session in the January WGM to discuss immunization issues for such issues as the linkages you suggest? Perhaps a session with Pharmacy Committee and with Public Health (together or individually)?</p>",
        "id": 220799234,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1608737998
    },
    {
        "content": "<p>Our usual Immunization roundtable session (hosted by PHWG) is on the agenda for the WGM but a specific quarter hasn't been set yet. If there is a day and quarter that works best for you let us know and we can do our best to get it scheduled at that time. At the moment we don't have an official joint session with Pharmacy, but we can certainly let them know if there are topics they might be interested in.</p>",
        "id": 220829450,
        "sender_full_name": "Craig Newman",
        "timestamp": 1608759362
    },
    {
        "content": "<p>Agree with Craig that the roundtable would be a good place to bring this up and discuss, at least at the level of figuring out where this should go for future discussions. The roundtable is good for bringing up general questions and reporting on progress while trying to avoid going down into too much detail to find the final technical solution. This is an area I'm hoping we'll have more time in the new year to work on.</p>",
        "id": 221064049,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1609165592
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193813\">Nathan Bunker</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20order/near/221064049\">said</a>:</p>\n<blockquote>\n<p>In my own projects I'm wondering if it would be helpful to be able to link an immunization to a medication resource and then be able to represent that immunization resource as both an immunization and a medication so that it can be linked to other concepts.</p>\n</blockquote>\n<p>you mean represent the Immunization concept as both Immunization resource and a MedicationAdministration resource?</p>",
        "id": 221069826,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609171130
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> do you have a quarter in mind for this discussion during the WGM?</p>",
        "id": 221772446,
        "sender_full_name": "Melva Peters",
        "timestamp": 1609943263
    },
    {
        "content": "<p>not yet. Would Thursday Q1 work for everyone? Alternatively, we could look at Thursday Q2 or Friday Q1.<br>\n<span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> <span class=\"user-mention\" data-user-id=\"193813\">@Nathan Bunker</span> <span class=\"user-mention\" data-user-id=\"192672\">@Floyd Eisenberg</span></p>",
        "id": 221783788,
        "sender_full_name": "Craig Newman",
        "timestamp": 1609948625
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> Thursday Q1 or Q2 works  - Pharmacy has a conflict for Friday Q1</p>",
        "id": 221785187,
        "sender_full_name": "Melva Peters",
        "timestamp": 1609949171
    },
    {
        "content": "<p>Thursday Q1 is impossible due to OO / BRR discussion<br>\nQ2 is also difficult due to FHII-I.</p>",
        "id": 221785930,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609949567
    },
    {
        "content": "<p>are there any other slots?</p>",
        "id": 221785935,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609949572
    },
    {
        "content": "<p>All the times Craig gives I can make work.</p>",
        "id": 221791011,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1609951968
    },
    {
        "content": "<p>Those are the only slots Public Health still has open where we were planning on holding a session. We hadn't planned on holding sessions on Monday or Friday Q3 or any day during Q4. We could add a session, but that starts to get pretty late in the day for Europe.</p>",
        "id": 221804421,
        "sender_full_name": "Craig Newman",
        "timestamp": 1609958055
    },
    {
        "content": "<p>I appreciate not having to join a session in Q4 PT</p>",
        "id": 221805326,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609958496
    },
    {
        "content": "<p>Pharmacy isn't meeting on Friday.</p>",
        "id": 221805352,
        "sender_full_name": "Melva Peters",
        "timestamp": 1609958514
    },
    {
        "content": "<p>is Monday an option?</p>",
        "id": 221805366,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609958520
    },
    {
        "content": "<p>Thursday Q1 would be optimal for me, Q2 is ok, Friday Q1 is not ok. Monday Q1 or Q4 works but I share Jose's concern about Q4 Pacific Time.</p>",
        "id": 221813303,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1609962432
    },
    {
        "content": "<p>Oh - Friday Q 2 or Q3 can work for me as well</p>",
        "id": 221813469,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1609962518
    },
    {
        "content": "<p>PH has Monday Q2 open but I don't think that <span class=\"user-mention\" data-user-id=\"193813\">@Nathan Bunker</span> can make that time.</p>",
        "id": 221941588,
        "sender_full_name": "Craig Newman",
        "timestamp": 1610026531
    },
    {
        "content": "<p>Pharmacy has a conflict Monday Q2 so can't join.</p>",
        "id": 221943792,
        "sender_full_name": "Melva Peters",
        "timestamp": 1610027787
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> what slots does Pharmacy have open. If Pharmacy can host the discussion, we might be able to split Public Health and get the right people there. I'm definitely not available Tuesday Q2 or Wednesday Q1</p>",
        "id": 221971034,
        "sender_full_name": "Craig Newman",
        "timestamp": 1610039761
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> Pharmacy has availability Monday Q4, Tuesday Q3 or Q4, Wednesday Q2, Q3, Q4 or Thursday Q1, Q2, Q3 or Q4.  We can host.</p>",
        "id": 221971339,
        "sender_full_name": "Melva Peters",
        "timestamp": 1610039895
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> Has Public Health discussed which quarter works for a joint session?</p>",
        "id": 222431212,
        "sender_full_name": "Melva Peters",
        "timestamp": 1610458749
    },
    {
        "content": "<p>I didn't think there was a session that worked for everyone. <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"192672\">@Floyd Eisenberg</span> <span class=\"user-mention\" data-user-id=\"193813\">@Nathan Bunker</span> <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> would Friday Q2 work for you?</p>",
        "id": 222444256,
        "sender_full_name": "Craig Newman",
        "timestamp": 1610464417
    },
    {
        "content": "<p>What time is Q2?</p>",
        "id": 222444388,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1610464459
    },
    {
        "content": "<p>11 am PT, I think that's 8pm your time?</p>",
        "id": 222444517,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1610464520
    },
    {
        "content": "<p>This time works for me.</p>",
        "id": 222444561,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1610464536
    },
    {
        "content": "<p>I think Friday Q2 works</p>",
        "id": 222449080,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1610466224
    },
    {
        "content": "<p>Pharmacy isn't meeting on Friday and I have a conflict at that time.</p>",
        "id": 222449661,
        "sender_full_name": "Melva Peters",
        "timestamp": 1610466444
    },
    {
        "content": "<p>Public Health can probably host</p>",
        "id": 222485861,
        "sender_full_name": "Craig Newman",
        "timestamp": 1610481438
    },
    {
        "content": "<p>Friday Q2 isn't possible for Pharmacy</p>",
        "id": 222509909,
        "sender_full_name": "Melva Peters",
        "timestamp": 1610493384
    },
    {
        "content": "<p>It's sounding like WGM may not be possible. Do we want to add this to the agenda for a PH or Pharmacy WG call instead? The late Thursday afternoon timeslot for the weekly PH WG call, may not be ideal for Jose.</p>",
        "id": 222607732,
        "sender_full_name": "Craig Newman",
        "timestamp": 1610555645
    },
    {
        "content": "<p>Pharmacy meets on Monday's at 4pm Eastern.  Maybe that would work?</p>",
        "id": 222638432,
        "sender_full_name": "Melva Peters",
        "timestamp": 1610568611
    },
    {
        "content": "<p>It's been a while, but we finally wound up scheduling Friday Q2 of the Public Health WG program to be an immunizations session. If folks are available, we can discuss the topic of immunization orders and then bring any updates to Pharmacy on one of their weekly calls.</p>",
        "id": 223428635,
        "sender_full_name": "Craig Newman",
        "timestamp": 1611173595
    },
    {
        "content": "<p>Craig, I'll see if Pharmacy can send a rep to Friday Q2.</p>",
        "id": 223440207,
        "sender_full_name": "Melva Peters",
        "timestamp": 1611179078
    },
    {
        "content": "<p>Question: Patient has taken vaccine for Disease D. Patient has taken Product X. <br>\nFor Product X, it is known that the patient should take a next dose of the same product in 21 days.<br>\nWhat is that\"should take Product X in 21 days\"? ImmunizationRecommendation or MedicationRequest?</p>",
        "id": 223543768,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611250660
    },
    {
        "content": "<p>I'm thinking MedicationRequest</p>",
        "id": 223543789,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611250669
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> John Hatem will attend Friday Q2 if you can email him the information.  Thanks</p>",
        "id": 223544519,
        "sender_full_name": "Melva Peters",
        "timestamp": 1611251020
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20order/near/223543768\">said</a>:</p>\n<blockquote>\n<p>Question: Patient has taken vaccine for Disease D. Patient has taken Product X. <br>\nFor Product X, it is known that the patient should take a next dose of the same product in 21 days.<br>\nWhat is that\"should take Product X in 21 days\"? ImmunizationRecommendation or MedicationRequest?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> ?</p>",
        "id": 223545697,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611251552
    },
    {
        "content": "<p>I would say it depends on who is saying it and with what authority. If it's clinical decision support, then it would be ImmunizationRecommendation. But if it's a provider placing a future order to fulfilled in 21 days, then I'd say it's a MedicationRequest</p>",
        "id": 223581431,
        "sender_full_name": "Craig Newman",
        "timestamp": 1611268854
    },
    {
        "content": "<p>It's the nurse, telling the patient they have to come back, because the product manufacturer says so</p>",
        "id": 223584906,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611271111
    },
    {
        "content": "<p>(and I don't think it depends on who is saying it - a decision support system or a person may provide the same type of information)</p>",
        "id": 223616386,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611306072
    },
    {
        "content": "<p>If it's the nurse telling the patient something, is that a Communication?</p>",
        "id": 223640247,
        "sender_full_name": "Craig Newman",
        "timestamp": 1611321946
    },
    {
        "content": "<p>If you just want a record of \"this information was disclosed\", yes.  If you're wanting to trigger action that you can then track execution against, then you need an Appointment or ServiceRequest or Task or something.</p>",
        "id": 223646613,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611325178
    },
    {
        "content": "<p>it's a record of \"this patient needs to have another dose in 21 days\".</p>",
        "id": 223679503,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611339810
    },
    {
        "content": "<p>sounds like MedicationRequest</p>",
        "id": 223679557,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1611339832
    },
    {
        "content": "<p>Is there any expectation that the patient will return to that same provider for the second dose? Is it basically a future order?</p>",
        "id": 223681835,
        "sender_full_name": "Craig Newman",
        "timestamp": 1611340948
    },
    {
        "content": "<p>it may have an intent or proposal and not order depending on who is recording the MedicationRequest</p>",
        "id": 223698253,
        "sender_full_name": "Melva Peters",
        "timestamp": 1611348728
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> I think the above is saying that \"The patient should take the second dose in 21 days\" is done by a MedicationRequest, not a ImmunizationRecommendation. Do you agree?</p>",
        "id": 234422257,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1618359578
    },
    {
        "content": "<p>and <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span></p>",
        "id": 234422603,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1618359805
    },
    {
        "content": "<p>If I remember correctly, both are mapped to the workflow request pattern.</p>",
        "id": 234425140,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1618361693
    },
    {
        "content": "<p>yes that is correct, but doesn't solve the issue. CarePlan is also a request but I hope we can agree it's not the request to use for due vaccination. MedicationRequest is IMO more appropriate (not that my opinion is a strong argument, but if there is ambiguity, should this be fixed?</p>",
        "id": 234446498,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1618380879
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I'd agree with you if I should represent the \"The patient should take the second dose in 21 days\" as atomic request to administer a medicinal product (in that case a vaccine). <br>\nBut if I think that request as part of a vaccination protocol and linked to other vaccinations I'd prefer to have it represented into an ImmunizationRecommendation.</p>",
        "id": 234461236,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1618389154
    },
    {
        "content": "<p>(that is why i mentioned the careplan - if the immunization protocol is a plandefinition, the patient's plan is a careplan.)</p>",
        "id": 234461636,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1618389353
    },
    {
        "content": "<p>To be more clear I'd map the element \"next dose date\" present in several data sets (WHO SVC; EU DGC; ISO TS 5384) into the  ImmunizationRecommendation and not in the MedicationRequest</p>",
        "id": 234461880,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1618389456
    },
    {
        "content": "<p>My concern is only of an overlap from a FHIR perspective. I think  the ImmnunizationRecommendation resource does not have a large base for applicability.</p>",
        "id": 234462523,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1618389783
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Immunization.20order/near/234461636\">said</a>:</p>\n<blockquote>\n<p>(that is why i mentioned the careplan - if the immunization protocol is a plandefinition, the patient's plan is a careplan.)</p>\n</blockquote>\n<p>I believe this is a separate discussion :-)<br>\nI read this as should we rid off of some Immunization specialized resources and reuse instead other generic ones ?<br>\n.. but IMO this is not for R4...</p>",
        "id": 234462714,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1618389879
    },
    {
        "content": "<p>Right. If there is confirmed overlap in R4, we can choose either MedRequest or ImmunizationRecommendation. And we can review for future versions if we need that overlap</p>",
        "id": 234469356,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1618393126
    },
    {
        "content": "<p>For R4, my personal choice would be to use MedRequest as is stated above, but I don't know the reasons you may have to keep immunizationrecommendation.</p>",
        "id": 234469595,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1618393245
    },
    {
        "content": "<p>Not sure why CarePlan <em>wouldn't</em> be viable.  Not saying it's the only option, but I don't think it would be wrong if what you're trying to say is a 'should' rather than a 'must'.</p>",
        "id": 234889117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618592767
    },
    {
        "content": "<p>I understand CarePlan, in this context, as a \"vaccination plan\". So it could be used (given the overlap of medicationrequest and careplan when saying \"this is planned\". For one specific expected immunization, I'd still use MedRequest. <br>\nIf we have 3 overlapping resources, we have to at least provide guidance; And I don't know if ImmunizationRecommendation has a strong base for existence TBH</p>",
        "id": 235067924,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1618748276
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span>  - any thoughts on this in the light of your recent blog posts on <a href=\"https://fhirblog.com/2021/03/26/fhir-enabling-an-immunization-registry/\">FHIR Enabling an Immunization Register</a>?</p>",
        "id": 235099503,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1618778969
    },
    {
        "content": "<p>On Tuesday Q4 of next week's WGM, Pharmacy will be hosting Public Health to further discuss immunization orders and other related topics. Everyone is welcome to join.<br>\n<span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> <span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span> <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span></p>",
        "id": 239274844,
        "sender_full_name": "Craig Newman",
        "timestamp": 1621352174
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span>  this is good because we have some questions from the IPS track (<span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> )  we'd like to discuss with the team.</p>",
        "id": 239275251,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1621352329
    },
    {
        "content": "<p>Yes, we definitely want to discuss this.</p>",
        "id": 239275729,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1621352515
    },
    {
        "content": "<p>Are there any updates? I think that having a link to a protocol (which is formally defined elsewhere) is a common need. I can see only 2 non-working options:</p>\n<ol>\n<li>We use the protocolApplied - but there is no reference there to a PlanDefinition or any other resource that we could use. We'd need an extension</li>\n<li>We could have an element like \"instantiates\" but this is not there. and there is no standard extension we can use</li>\n</ol>",
        "id": 260965136,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1636537037
    },
    {
        "content": "<p>There is a PH WG Friday vaccination call every other week at 11AM Eastern (not great for all of the European crowd, sorry about that) that we can use for discussion if necessary. We are meeting this week (11/12). Let me know if you'll be attending and I can put it on the agenda.</p>",
        "id": 260990023,
        "sender_full_name": "Craig Newman",
        "timestamp": 1636551719
    },
    {
        "content": "<p>So if immunization orders become MedicationRequest, what's the right way to distinguish immunization MedicationRequests from regular medication order MedicationRequests?</p>",
        "id": 264877263,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1639496871
    },
    {
        "content": "<p>MedicationRequest.category</p>",
        "id": 264882277,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639498680
    },
    {
        "content": "<p>Typically is used for inpatient / outpatient / etc, no?</p>",
        "id": 264912084,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1639509704
    },
    {
        "content": "<p>It can be used for a variety of things.  If you need to distinguish and can't just figure it out by looking at the medication, that's where I'd stick it.</p>",
        "id": 264925719,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639516126
    },
    {
        "content": "<p>Agree. Vaccination is not that different from other prophylactic use of medication. Request.category can be used for many things but this is actually a good use of category</p>",
        "id": 264927296,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1639516951
    },
    {
        "content": "<p>and the max cardinality of <code>MedicationRequest.category</code>is * , so you don't have to sacrifice your original use</p>",
        "id": 264927386,
        "sender_full_name": "Eric Prud'hommeaux",
        "timestamp": 1639517011
    },
    {
        "content": "<p>I missed that cardinality was multiple response. Nice</p>",
        "id": 265118875,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1639638545
    }
]