[
    {
        "content": "<p>Hi all,<br>\nI was wondering if anyone else has tried to implement the concept of an inpatient rounding teams in FHIR.  For example, I'm a hospitalist and we typically have 1 attending + 3 residents (1 senior, 2 juniors) working on a \"team\" that takes care of a single patient list.   However, while the senior resident and the attending handle the whole list, each junior is only directly responsible for half of the list.  We are trying to figure out how to represent this in FHIR and are currently looking at careTeam, groups, and lists.  One thing we've been thinking about it using Group to hold all patients being taken care of by a single inpatient team (a Patient List).  Then we could use CareTeam to keep track of the providers and have a 1:1 relationship between a CareTeam and its associated patient list (which is a Group).  This could result in multiple different CareTeams for a given patient if a patient is on multiple inpatient lists (ie primary and consulting teams).  I'm worried about implementing it this way because the spec seems to imply that a CareTeam is explicitly all providers associated with a single patient during a single episode of care.  Would it be better for us to use Group for both the Practitioner List and the Patient List,  Or should we use List for both lists?  I'd love to hear thoughts....</p>",
        "id": 153992395,
        "sender_full_name": "Michael Wang",
        "timestamp": 1535736309
    },
    {
        "content": "<p>CareTeam can take responsibility and act.  Group and List can't.  CareTeam also gives you the ability to distinguish functions within the team.</p>",
        "id": 153992399,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535740867
    },
    {
        "content": "<p>Thanks Lloyd! sounds like we're best off with careTeam for Practitioner List targetting Group for Patient List; CareTeam is actually designed to have multiple careTeams acting on a single inpatient patient Group.  I think I was too caught up in some of the language in the documentation referring to a single patient.</p>",
        "id": 153992401,
        "sender_full_name": "Michael Wang",
        "timestamp": 1535743079
    },
    {
        "content": "<p>I do hope your impatient care team does learn some patients!</p>",
        "id": 153992694,
        "sender_full_name": "David Hay",
        "timestamp": 1535937268
    }
]