[
    {
        "content": "<p>Hi, I am working on an experimental FHIR server for us to publish profiles on to better support implementers. I was looking at the ImplementationGuide resoucre as a way of providing a helpful entrypoint for users wanting to understand the subset of profiles required to implement a specific set of APIs for a domain. I can see how to create a resource showing the various profiles, but the spec isn't 100% clear on how the \"pages\" should be used. We have some online documentation already for specific domains which cover all the aspects of API implementation, and I wanted to see if we could use the \"pages\" entries in the ImplementationGuide resource to give a high level overview of the domain and link out to the detailed online content. My difficulty is in interpreting the spec and understanding how the \"pages\" in the ImplementationGuide should ideally be used. Can anyone point me to any good worked examples (the one on the spec page is not very helpful), or blog posts talking about how this resource was intended to be used in a bit more detail?</p>",
        "id": 153873046,
        "sender_full_name": "Adam Hatherly",
        "timestamp": 1487773587
    },
    {
        "content": "<p>If you are looking for and implementation guide like <a href=\"http://www.fhir.org/guides/argonaut/r2/\" target=\"_blank\" title=\"http://www.fhir.org/guides/argonaut/r2/\">Argonaut</a> in both DSTU2 and  <a href=\"http://hl7.org/fhir/us/core/\" target=\"_blank\" title=\"http://hl7.org/fhir/us/core/\">US Core</a>  STU3.  There is  <a href=\"http://wiki.hl7.org/index.php?title=IG_Publisher_Documentation\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=IG_Publisher_Documentation\">FHIR publishing tool</a> that ties this all together.   I have put up a very <a href=\"https://github.com/Healthedata1/IG-Template\" target=\"_blank\" title=\"https://github.com/Healthedata1/IG-Template\">simple template</a> for this and Forge has an IG tool as well.  This uses the implementationGuide resource but only tangentially and does the pages using  a Jekyll framework ( don't know if that is the right word)</p>",
        "id": 153873059,
        "sender_full_name": "Eric Haas",
        "timestamp": 1487791084
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192729\">@Adam Hatherly</span>, note that the ImplementationGuide resource is still at maturity level 0:<br>\n<a href=\"http://build.fhir.org/implementationguide.html\" target=\"_blank\" title=\"http://build.fhir.org/implementationguide.html\">http://build.fhir.org/implementationguide.html</a><br>\nThere are many possible ways to create/generate an IG, which may or may not involve the IG resource. Forge (the FHIR profile editor) provides some basic support for managing IG resources. But this is mainly focused on creating IG packages; support for IG pages is very primitive. At Furore, we create FHIR IG's for our customers, but currently our internal process does not involve the IG resource. If the current IG resource is convenient for you, then go ahead and implement it; if not, then feel free to try something else. Any which way, as the IG resource is still immature, community feedback on how to improve it is very welcome!</p>",
        "id": 153873122,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1487848928
    },
    {
        "content": "<p>I'm using the IGPublisher but have an Ant script around it.  The pages part of ImplementationGuide gets used to create a table of contents and manage section headings for the IG</p>",
        "id": 153873137,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1487860703
    },
    {
        "content": "<p>to actually answer the question: the pages part is provided so that you can provide a structured view into the html documentation that accompanies the definitions. It's not required to be comprehensive; it's intent is to allow a tool that is using the IG to jump into the documentation, or to show a user some index/toc type view. Minimally the IG reosurce should include a single page, which is the welcome page (which is traditionally index.html, but there is no formal rule to this effect)</p>",
        "id": 153873286,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1487964258
    },
    {
        "content": "<p>That said, I'm on the opposite end of Lloyd.  Don't use the pages at all.  In fact, I think its unnecessary overhead and my .Page content says \"blah\".   </p>",
        "id": 153873493,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488079609
    },
    {
        "content": "<p>you should at least register the index.</p>",
        "id": 153873499,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488080388
    },
    {
        "content": "<p>OK - that's easy enough to do</p>",
        "id": 153873501,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488080520
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> How do you generate a table of contents or manage section numbering?</p>",
        "id": 153873510,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488083394
    },
    {
        "content": "<p>hello , please do semone have a tutorial of how to start a hapi fhir server and use it with its own oracle for ex database ,,,  </p>",
        "id": 153873519,
        "sender_full_name": "wassim",
        "timestamp": 1488099618
    },
    {
        "content": "<p>I think you will have  better luck posting this question to the <a href=\"https://chat.fhir.org/#narrow/stream/hapi\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/hapi\">hapi</a> stream.   Have you looked <a href=\"http://hapifhir.io/\" target=\"_blank\" title=\"http://hapifhir.io/\">here</a>?</p>",
        "id": 153873573,
        "sender_full_name": "Eric Haas",
        "timestamp": 1488126871
    },
    {
        "content": "<p>Hello all, I want to implement FHIR server with MySQL? Can I have all the required steps to be done?</p>",
        "id": 153875222,
        "sender_full_name": "Jack Anelson",
        "timestamp": 1488887075
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193460\">@Jack Anelson</span> - welcome.  I'd suggest you start here: <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions\">http://wiki.hl7.org/index.php?title=FHIR_Rules_for_asking_questions</a></p>",
        "id": 153875248,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488910392
    },
    {
        "content": "<p>There isn't a single recipe for implementing FHIR.  Your question is sort of like walking into a grocery store and saying \"Can you feed me supper?\".  We can help you on the way to getting fed, but you're going to need to narrow down your parameters a bit (what do you want to eat, what's your cooking experience), etc.  Start by reading through the spec, figuring out what parts of FHIR are relevant to you, what you want your server to do, looking at the reference implementations for your language of choice, perhaps examinging some of the open source servers and then once you've gotten up to speed a bit, ask your more detailed questions here.  </p>",
        "id": 153875249,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488910612
    },
    {
        "content": "<p>Hi FHIR pros. I'm hoping to model some clinical and workflow elements that I have mapped pen-and-paper style and I would like to create an IG. I intend to use the IG spreadsheet (until Forge's update) and have some questions. Please excuse my newbie questions, still leveling my FHIR magic.</p>\n<p>I want to define some value sets. Can this be done within the IG template spreadsheet? Might you direct me to some instructions or information? I could just alter a value set json, but I don't know what happens when that jar file runs, so I want to get it right. I've read the majority of the authoring wikis and the answer didn't jump out at me</p>\n<p>Second, can the code field be hard bound to a single code(like in an observation type), such that this profile only represents that particular concept? Though I don't expect it to be necessary, I couldn't find the answer. Is there a better solution to constrain a profile with code 'X-finding' to value set 'types-of-X-findings'? </p>\n<p>Third,  I suspect this is true but to be sure.. is it only one profile per spreadsheet? or can multiple exist within one?</p>",
        "id": 153875689,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1489037703
    },
    {
        "content": "<p>multiple profiles can be defined in the spreadsheet </p>",
        "id": 153875694,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489038505
    },
    {
        "content": "<p>you can bind a code to a fixed value.</p>",
        "id": 153875695,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489038533
    },
    {
        "content": "<p>you edit the value sets by hand- there is no designer at the moment</p>",
        "id": 153875696,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489038548
    },
    {
        "content": "<p>Ok great. Thanks Graham. Your second answer - would that mean if I have two observations, codes X-finding and Y-finding. Both findings are similar but the value field will have different value sets(types-of-X and types-of-Y). Does this situation require two profiles?</p>",
        "id": 153875697,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1489038655
    },
    {
        "content": "<p>that's the simplest way to do it. The other way is a single profile with invariants that assert bindings; this is much harder all around</p>",
        "id": 153875699,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489038779
    },
    {
        "content": "<p>Awesome, thank you. Finally, multiple profiles from the same spreadsheet. Do I just need multiple structure definition tabs?</p>",
        "id": 153875701,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1489038906
    },
    {
        "content": "<p>yes you register them in the meta data tab</p>",
        "id": 153875710,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489041672
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196572\">@Travis Stenerson</span> pardon my intrusion - as you think about your IG - I would also like to introduce IG modelers and writers to consider developing test-cases to accompany their IG.  A core component to FHIR is the Test Script Resource - we have been developing Test Scripts against FHIR base resource profiles.  Looking forward, as each new IG comes on line - and IG sponsors want to ensure their IG is being implemented in a consistent manner - (e.g. Interoperable across organizational implementations) - we believe FHIR will benefit from continuing to leverage FHIR Test Script.  Initiall IG folks can simply put pen-to-paper to write what/how they believe their IG should be tested (please do not forget about the negative testing and exception handling - if something goes wrong what should be done).  Learn more about Test Script, and how Test Script can help an IG gain wider interoperable adoption.  If you would like to see a demosntration of Test Script being used - Touchstone currently has more 1,200 avaialble to review as a reference example or template.  If anyone is interested - please send me a directed message.</p>",
        "id": 153875984,
        "sender_full_name": "Mario Hyland",
        "timestamp": 1489155853
    },
    {
        "content": "<p>hello everyone, can anybody suggest me, how to add race extension to patient resource using clin fhir?</p>",
        "id": 153876451,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1489476815
    },
    {
        "content": "<p>you might have better luck getting an answer in the <a href=\"https://chat.fhir.org/#narrow/stream/clinFHIR\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/clinFHIR\">clinfhir stream</a></p>",
        "id": 153876645,
        "sender_full_name": "Eric Haas",
        "timestamp": 1489508178
    },
    {
        "content": "<p>hello all, can anyone explain briefly which resource(encounter or episode of care) is used to store patient admission info? </p>\n<p>and how to implement EMPI, MRN for patient?</p>",
        "id": 153877406,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1489658504
    },
    {
        "content": "<p>Encounter would capture admissions.  Episode of care is more for things like tying records to a pregnancy or to a patient's diabetes.  Medical Record Number would just be an identifier on Patient.  EMPI would be a server that supports Patient.  It would probably also support the Patient/$match operation</p>",
        "id": 153877487,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489676724
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"lloyd@lmckenzie.com\">@Lloyd McKenzie</span><br>\nwrt to Encounter,<br>\nactually here my doubt is, for example  a patient joins in a hospital for 3days. so 3 encounters will be created. and we stode admission info in 1st encounter along with other details, but 2nd day onwards admission info is not required right? so how to recognize this is the 2nd encounter, 3rd encounter etc? can we create 1st Encounter as main Encounter and then add the other encounters to that main Encounter as partOfEncounter?</p>\n<p>in HL7 website they have given like this<br>\nThe primary difference between the EpisodeOfCare and the Encounter is that the Encounter records the details of an activity directly relating to the patient, while the EpisodeOfCare is the container that can link a series of Encounters together for problems/issues.</p>\n<p>so what i'm thinking is we can link no of Encounters to EpisodeOfCare. but when i see the profile or base resource we don't have any link to add Encounter to EpisodeOfCare. but reverse is possible(we can add the EpisodeOfCare to Encounter). i'm confusing alot.</p>",
        "id": 153877623,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1489725019
    },
    {
        "content": "<p>In North America and most other places I'm familiar with, if a patient is in the hospital for 3 days, that's a single encounter.  The only time you'd have multiple encounters is if they were initially admitted to Emergency and later were admitted as an in-patient.  You could also have \"child\" encounters if they were sent to radiology for a bit or went from one department to another.  An encounter is the coming together of a patient and a care provider for a particular continuous duration (with exceptions for things like leave-of-absence).  On the other hand, EpisodeOfCare only deals with the responsibility for care, but doesn't require continuous engagement.  So you might have a single episode of care for a particular pregnancy.  Attached to that would be separate encounters representing each office visit, a few home consultations, a 2-night hospital stay due to high blood pressure, the mid-wife attended home-birth and a few follow-up visits.  On the other hand, you can have a single encounter that represents a continuous 2.5 year stay in a psychiatric institution or even one that represents a 10 year stay in a nursing home.  It's considered a single encounter because the patient is \"meeting with\" the care provider continuously (with the exception of the odd weekend pass) over the entire period of time of the stay.</p>",
        "id": 153877647,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1489735820
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\n thank you so much</p>",
        "id": 153877654,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1489738566
    },
    {
        "content": "<p>hello <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , dose hapi fhir supports EMPI consept? if yes, could you please  explain how to implement that.</p>",
        "id": 153877678,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1489748500
    },
    {
        "content": "<p>for guidance on EMPI -- See <a href=\"http://build.fhir.org/patient.html#match\" target=\"_blank\" title=\"http://build.fhir.org/patient.html#match\">http://build.fhir.org/patient.html#match</a>  or See the IHE PIXm profile <a href=\"http://wiki.ihe.net/index.php/Patient_Identifier_Cross-Reference_for_Mobile_(PIXm)\" target=\"_blank\" title=\"http://wiki.ihe.net/index.php/Patient_Identifier_Cross-Reference_for_Mobile_(PIXm)\">http://wiki.ihe.net/index.php/Patient_Identifier_Cross-Reference_for_Mobile_(PIXm)</a></p>",
        "id": 153877784,
        "sender_full_name": "John Moehrke",
        "timestamp": 1489757226
    },
    {
        "content": "<p>ok, thank you <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> </p>",
        "id": 153878465,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1489986015
    },
    {
        "content": "<p>hello everyone, can anyody explain how to implement the questions and ans. for example <a href=\"/user_uploads/10155/0a6RE0CJFpBSW3B4fdDF19bP/quest-and-ans.PNG\" target=\"_blank\" title=\"quest-and-ans.PNG\">quest-and-ans.PNG</a>. i have gone through the Questionnaire,QuestionnaireResponse resources, but didn't get how to implement that. so please help.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/0a6RE0CJFpBSW3B4fdDF19bP/quest-and-ans.PNG\" target=\"_blank\" title=\"quest-and-ans.PNG\"><img src=\"/user_uploads/10155/0a6RE0CJFpBSW3B4fdDF19bP/quest-and-ans.PNG\"></a></div>",
        "id": 153878568,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1490015073
    },
    {
        "content": "<p>Questionnaire would represent your form, QuestionnaireResponse would represent a particular answered form.  Can you be a bit more specific in your question?  \"How to implement\" is a bit generic :)</p>",
        "id": 153878587,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490020914
    },
    {
        "content": "<p>our scenario - in consent form we want to use Q, QA. Using MOLTS form we created the Q,QA now we want to use it.  We are facing following problems - multiple questions &amp; Answers in the consent form. How to have multiple questions and answers in consent form ?</p>\n<p><a href=\"http://molst-ma.org/sites/molst-ma.org/files/MOLST%20Form%20and%20Instructions%208.10.13%20FINAL.pdf\" target=\"_blank\" title=\"http://molst-ma.org/sites/molst-ma.org/files/MOLST%20Form%20and%20Instructions%208.10.13%20FINAL.pdf\">http://molst-ma.org/sites/molst-ma.org/files/MOLST%20Form%20and%20Instructions%208.10.13%20FINAL.pdf</a></p>",
        "id": 153878737,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1490100918
    },
    {
        "content": "<p>Still not understanding the issue.  Each question or group of questions is an \"item\".  You can have as many items as you like in the Questionnaire.  Each item in the QuestionnaireResponse will \"link\" to the corresponding item in the Questionnaire.  If an item in the Questionnaire had repeats=true, then you can have multiple items in the QR pointing to one item in the Q.</p>",
        "id": 153878783,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490110486
    },
    {
        "content": "<p>hello <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, actually we want to implement<br>\n the Privacy Consent Directive: Agreement to collect, access, use or disclose (share) information.<br>\nMedical Treatment Consent Directive: Consent to undergo a specific treatment (or record of refusal to consent).<br>\nAdvance Care Directives: Consent to instructions for potentially needed medical treatment (e.g. DNR).</p>\n<p>we want to use the above Q and QR for Advance Care Directives.</p>",
        "id": 153878972,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1490154573
    },
    {
        "content": "<p>Ok.  That seems reasonable.  I'm still not understanding what challenge you're running into</p>",
        "id": 153878974,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490155444
    },
    {
        "content": "<p>actually we want to implement the above Q and A then attach it to consent.</p>",
        "id": 153878976,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1490156557
    },
    {
        "content": "<p>is it necessary to have both Q and QR to implement the above form?</p>",
        "id": 153878984,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1490167283
    },
    {
        "content": "<p>Q is for the form, R is for a filled-out form.  You can render just the response, but if you want to see what the choice options were, what was required, etc., you'll need the Q too.</p>",
        "id": 153879182,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490200314
    },
    {
        "content": "<p>If you want the Consent to point to the Questionnaire, you'll need to use an extension.  (Might make sense to request getting this defined as a 'standard' extension.)</p>",
        "id": 153879183,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490200380
    },
    {
        "content": "<p>Not true.. Consent.sourceReference is specifically there to point at QuestionnaireResponse where one is used to obtain a consent. The use of Questionnaire to obtain consent is considered a primary pathway, we have just not yet had time to focus on that. We would love to get your feedback, and hear of experience that we can leverage to advance the state-of-the-art</p>",
        "id": 153879188,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490201293
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> - not sure how I missed that</p>",
        "id": 153879193,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490202140
    },
    {
        "content": "<p>Glad to bring good news to you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> </p>",
        "id": 153879202,
        "sender_full_name": "John Moehrke",
        "timestamp": 1490206223
    },
    {
        "content": "<p>Thank you everyone for your help, we want to implement the above MOLTS form and use it in consent this is our main thing, so please any suggestions  to implement that?  whether we should  attache that form to consent's  resource as QR or any other way? because in consent (<a href=\"http://build.fhir.org/consent.html\" target=\"_blank\" title=\"http://build.fhir.org/consent.html\">http://build.fhir.org/consent.html</a>)  we have Except element also right? so whats the exact use of that? and what is the best scenario? </p>",
        "id": 153879444,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1490243577
    },
    {
        "content": "<p>Hi evryone,</p>",
        "id": 153879445,
        "sender_full_name": "nisha ks",
        "timestamp": 1490243595
    },
    {
        "content": "<p>I was trying to do a reverse include of communication in my encounter resource, but I found that communication context ref is not getting saved in communication resource. that is why I am not able to do a rev include . Can any one help me with that.</p>",
        "id": 153879446,
        "sender_full_name": "nisha ks",
        "timestamp": 1490243913
    },
    {
        "content": "<p>Got the answer... thank u...</p>",
        "id": 153879447,
        "sender_full_name": "nisha ks",
        "timestamp": 1490243930
    },
    {
        "content": "<p>Hello everyone, which datatype should I use to indicate the  occupation of a patient? what is the difference between the \"add element\" in the logical modeller and extension definition builder?</p>",
        "id": 153881288,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1491566259
    },
    {
        "content": "<p>Also, please let me know about annotation data type </p>",
        "id": 153881291,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1491566713
    },
    {
        "content": "<p>The data type for occupation would usually be CodeableConcept - that lets you capture coded information (which is usually necessary for that sort of element).  It also lets you capture free text for those situations where your value set doesn't cover the relevant occupation or you want to cpature more detail.  Annotation allows you to capture \"notes\" - it lets you capture who recorded the note, when and what was said.  So it's most useful when multiple people might capture notes over time.  There's no specific meaning to the notes though - you can't use them to capture specific data elements.</p>",
        "id": 153881317,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491571855
    },
    {
        "content": "<p>Ok thank you. Can I use it for the resource DiagnosticReport?  Cause the DiagnosticReport resource is not given in the list of resources where the annotation datatype can be used</p>",
        "id": 153881318,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1491571955
    },
    {
        "content": "<p>hello all, we are using the Encounter resource to store admission info along with the practitioners info. here i'm confusing whether to use Encounter.participant  or careTeam? which one is the better? and whats the diff?</p>",
        "id": 153881319,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1491572008
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193568\">@Pranitha Sruthi</span> With extensions, you can put it anywhere.  It's not core to DiagnosticReport because DiagnosticReports are typically authored once and are then static - they don't tend to accumulate comments the way Conditions, Allergies and other types of resources do.</p>",
        "id": 153881327,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491572423
    },
    {
        "content": "<p>Ok thank you so much</p>",
        "id": 153881328,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1491572492
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span> Encounter.participant is limited to the scope of the Encounter.  CareTeam is not.  For your use-case as described, it sounds like Encounter is appropriate.  That's certainly where you'd capture the admitting clinician - that would make no sense on CareTeam.</p>",
        "id": 153881330,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491572597
    },
    {
        "content": "<p>Shall I add the occupation as an extension or just add simply using the 'add element ' option in the logical modeller module? Please let me know</p>",
        "id": 153881334,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1491572739
    },
    {
        "content": "<p>If you want to send it over the wire, you'll need to use an extension.  Logical models are for mapping, but don't let you send real instances</p>",
        "id": 153881336,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491572846
    },
    {
        "content": "<p>Ok thank you</p>",
        "id": 153881337,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1491572876
    },
    {
        "content": "<p>btw - if you're talking about clinFHIR it's exactly as Lloyd says - that's intended to help with modelling a specific domain, and as a precursor to 'real' profiles (it can generate simple ones, but otherwise use it to capture information then a tool like Forge to create it)</p>",
        "id": 153881368,
        "sender_full_name": "David Hay",
        "timestamp": 1491593717
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193568\">@Pranitha Sruthi</span>  and  <span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span>  Please create  a new topic with more appropriate titles when discussing some issue other than  the Implementation Guide resources.</p>",
        "id": 153881373,
        "sender_full_name": "Eric Haas",
        "timestamp": 1491597581
    },
    {
        "content": "<p>okay <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> </p>",
        "id": 153881443,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1491642875
    },
    {
        "content": "<p>Okay  <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> </p>",
        "id": 153881540,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1491799649
    },
    {
        "content": "<p>thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , but in our admission info screen we want to capture  team, resident, attendingTeam, service, room, unit and chief complaints info. for room i'm mapping location name and for unit( <a href=\"http://hl7.org/fhir/2017Jan/v3/ServiceDeliveryLocationRoleType/vs.html\" target=\"_blank\" title=\"http://hl7.org/fhir/2017Jan/v3/ServiceDeliveryLocationRoleType/vs.html\">http://hl7.org/fhir/2017Jan/v3/ServiceDeliveryLocationRoleType/vs.html</a>) we are using Location. for attendingTeam using Encounter.participant.type and for remaining things i'm not sure which one should use? so please let me know.</p>",
        "id": 153881542,
        "sender_full_name": "Jayashree Surnar",
        "timestamp": 1491800368
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Implementation.20Guide.20resources/near/153877487\">said</a>:</p>\n<blockquote>\n<p>Encounter would capture admissions.  Episode of care is more for things like tying records to a pregnancy or to a patient's diabetes.  Medical Record Number would just be an identifier on Patient.  EMPI would be a server that supports Patient.  It would probably also support the Patient/$match operation</p>\n</blockquote>\n<p>Hello <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . I am also interested in knowing how to capture an EMPI as an identifier. For MRN, we will use the patient.identifier, and .type = \"MR\" (from <a href=\"http://hl7.org/fhir/R4/v2/0203/index.html\">http://hl7.org/fhir/R4/v2/0203/index.html</a>). I was hoping to capture EMPI identifiers the same way, but there is no code in this value set for EMPI (not in SCT or LOINC either). Can you suggest how to do this? Would we create an extension, something like identifier:empiid?</p>",
        "id": 198817069,
        "sender_full_name": "Christopher Vitale",
        "timestamp": 1590524750
    },
    {
        "content": "<p>You would still have to use 'MR'.  You could choose to send an additional finer-grained code too, but the extensible binding requires you to use the one of the codes if they apply (even if you might rather have more detail).  And an EMPI is a type of MR.  If you're interested in it being a <em>specific</em> EMPI identifier, you should distinguish that by using the Identifier.system.</p>",
        "id": 198826035,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1590529829
    }
]