[
    {
        "content": "<p>Hello!<br>\nWe're using the Communication resource to communicate between a patient portal and the clinic. I'm in a bind here trying to include the recipient  and sender within the Communication resource. These would reference a staff or Patient, and I'm not finding a way to contain both recipient and the sender withing the communication resource. I know contained shouldn't be used in this  manner, but the portal we're trying to communicate with doesn't want to query our servers for the resources and would like to get everything included in the communication resource itself.<br>\nany advice or pointers on how we should proceed?</p>",
        "id": 170776747,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1562998997
    },
    {
        "content": "<p>You could look at transaction or batch.  An alternative would be using a custom operation.  FHIR messaging is also a possibility, though it has more overhead.</p>",
        "id": 170809593,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563061009
    },
    {
        "content": "<blockquote>\n<p>You could look at transaction or batch.  An alternative would be using a custom operation.  FHIR messaging is also a possibility, though it has more overhead.</p>\n</blockquote>\n<p>Thanks Llyod. I How could a transaction or a batch be used in this case?The communication resource is the only resource that needs to be posted, the staff and patient -sender/receiver would be resources that the end point uses to match data on. How would I indicate this on these resources in their request in a batch?</p>",
        "id": 170897538,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1563200491
    },
    {
        "content": "<p>You could send conditional create of the recipient and sender organization/Practitioner along with the request to create the Communication.  If you're just doing matching, you could use transaction with conditional references (which are essentially queries that determine what resources the match will occur against).</p>",
        "id": 170900224,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563202398
    },
    {
        "content": "<p>Oh I see! Thank you! Digging into transactions with conditional references- are there are examples out there to share?</p>",
        "id": 170905515,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1563205700
    }
]