[
    {
        "content": "<p>We are looking to follow the US Core or Australian Base idea of having a set of profiles that are suitable for implementation within a Nation's jurisdiction (in our case the UK). The idea is that we'll have a UK Core set of profiles that are fairly generic &amp; so can be used in several use cases. Each use case may have its own set of business rules (for example tighten cardinalities, use specific valueSets, make certain elements mandatory for example). We are not intending to have a set of FHIR profiles for each use case, but rather have a validation engine that will test an instance written against a use case by testing against the base resorces (UK Core), and then validate against the use case specific business rules. What I'm not certain is how to write the business rules so that they are computable. For example, I could write them in bespoke template, I could use a FHIR resource such as ElementDefinition or TestScript as these have elements to add rules, or I could use something like FHIRPath. <br>\nHas anyone looked at adding business rules, and if so is there a preferred approach to documenting them?</p>",
        "id": 180035039,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1573049123
    },
    {
        "content": "<p>Derived profiles seem to cover your requirements...</p>",
        "id": 180035850,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1573049693
    },
    {
        "content": "<p>Yeah, I know Michel. However, we are trying not to have profiles that relate to use cases, as you tend to end up with loads of profiles (we'll be talking to Firely about this soon), so we are looking to run with a base set of profiles &amp; use business rules to use case specific rules. For example we might say that for a particular use case maritalStatus is mandated - so rather than create a Patient profile where maritalStatus is set to [1..1] (so now we have 2 Patient profiles - one for the base &amp; one for the use case), we are looking at have a business rule in the use case Implementation Guide to enforce the fact that martialStatus is mandated. Given that, the question is how would we code/express the business rule in the Implementation Guide?</p>",
        "id": 180036943,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1573050470
    },
    {
        "content": "<p>Document the business rules as text. Implement them in your server returning meaningful error messages.</p>",
        "id": 180037261,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1573050624
    },
    {
        "content": "<p>Have you looked at GraphDefinition? (I don't know why it's called that, it doesn't seem to describe it's use) </p>\n<p>Having looked at some of the NHS Digital tests, it seems many of the rules could be written as GraphDefinitions <br>\ne.g. Rule (GraphDefinition) = this bundle should contain MessageDefinition (1..1), Patient (1..1)</p>\n<p>It also looks as if it supports fhirPath</p>",
        "id": 180039258,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573051853
    },
    {
        "content": "<p>Having worked recently with text based rules, I find them hideous. :) [Ask me for details if you see me in your office]</p>",
        "id": 180039479,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573051977
    },
    {
        "content": "<p>FHIR pretty much expects you to define profiles, assign them URLs  etc. How would you refer to your business rules otherwise?</p>",
        "id": 180084705,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573080675
    },
    {
        "content": "<p>not sure why you don't want to create a profile...</p>",
        "id": 180084713,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573080690
    },
    {
        "content": "<p>If you want a computable set of business rules, you're going to have an extra artifact anyhow to maintain/share/etc.  Profiles are the artifact that's defined for that purpose, and profiles are widely supported by tools and specification infrastructure.  Why are you trying to avoid them?</p>",
        "id": 180090955,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573086424
    },
    {
        "content": "<p>Simple answer: I'm seeing evidence that many developers aren't following profiles, they are using examples and text based rules. [This maybe caused by local issues]</p>",
        "id": 180121233,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573124432
    },
    {
        "content": "<p>it's always easy to hack it ;-)</p>",
        "id": 180121390,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573124553
    },
    {
        "content": "<p>It's also practical, so a general desire not to validate on live links. Validation would be done during testing.</p>",
        "id": 180122628,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573125752
    },
    {
        "content": "<p>but live links would still have rules.</p>",
        "id": 180122636,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573125775
    },
    {
        "content": "<p>I'm not sure I follow there. Of course you want to be judicious validating in production systems, but I don't see what that has to do with the question</p>",
        "id": 180123479,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573126651
    },
    {
        "content": "<p>I think I'm seeing rules and validation as two separate things in practice. Rules being mandated on operational links.</p>\n<p>So an operational link may have a business rule that a SNOMED code in Observation is mandatory</p>",
        "id": 180123780,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573126938
    },
    {
        "content": "<p>What <span class=\"user-mention\" data-user-id=\"192158\">@Dave Barnet</span> didn't mention is a general dislike of multiple/many profiles coming from implementers.</p>",
        "id": 180124221,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573127331
    },
    {
        "content": "<p>I understand that, but what I don't really follow is some magical separation of 'I made some rules' and 'I made a profile'. What matters is what the rules are. Why would expressing them in a more computer processible way be a problem? I think it's a proxy for the real issue, which is managing contention between rule making (semi) authorities</p>",
        "id": 180128015,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573130746
    },
    {
        "content": "<p>If you're wanting to define rules in a computable way that can be consumed by various servers and enforced consistently, Profiles are the way FHIR does that.  If the issue is that developers don't like reading the way that profiles <em>express</em> the rules and you think they'd be more likely to read a text expression, we could look at generating a text expression.  (My personal experience is that diagram-based and table-based representations are <em>much</em> easier to consume and understand than pages of SHALL and SHOULD statements as was commonly found in CDA IGs.)</p>",
        "id": 180144023,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573141196
    },
    {
        "content": "<p>USCore does indeed express the rules text like cda.   I dont think that will solve the problem of human nature trying to take a shortcut and start with the example first approach.</p>",
        "id": 180145342,
        "sender_full_name": "Eric Haas",
        "timestamp": 1573141968
    },
    {
        "content": "<p>Just a reminder to take the examples seriously</p>",
        "id": 180145395,
        "sender_full_name": "Eric Haas",
        "timestamp": 1573142010
    },
    {
        "content": "<p>That is what testing is for... By testing MORE than was shown in examples one catches those that only coded to the examples.  Test plans and Test tools are just as critical to compliance as good specifications.</p>",
        "id": 180145512,
        "sender_full_name": "John Moehrke",
        "timestamp": 1573142066
    },
    {
        "content": "<p>And make more example friendly igs</p>",
        "id": 180145513,
        "sender_full_name": "Eric Haas",
        "timestamp": 1573142066
    },
    {
        "content": "<p>I'm absolutely a fan of using profiles to express business rules. But I think it's also true that \"reading profiles\" and turning them reliably into code is often quite hard for developers, at least if they don't have previous experience with similar standards (based on personal and shared experience). It's a complex format and there are quite a few things to keep an eye out for (is-modifers indicated with a tiny <code>?!</code> in the rendering, FHIRPath constraints hiding on nested elements etc.). Of course, that complexity is really there and will not go away, but I think exploring ways of making it easier to consume for devs would be a worthwhile thing to pursue (I'd be happy to chip in my 5ct).</p>",
        "id": 180149310,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1573144381
    },
    {
        "content": "<p>We're always open to new/better ways of rendering information that makes it faster/easier/more likely to create compliant implementations</p>",
        "id": 180149704,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573144660
    },
    {
        "content": "<p>+1 for textual descriptions. Those in Argonaut / US Core are perfect (or see the Cerner documentation for another nice example: <a href=\"https://fhir.cerner.com/millennium/dstu2/individuals/patient/\" target=\"_blank\" title=\"https://fhir.cerner.com/millennium/dstu2/individuals/patient/\">https://fhir.cerner.com/millennium/dstu2/individuals/patient/</a>)</p>",
        "id": 180149846,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1573144745
    },
    {
        "content": "<p>Would be good to link the text to the actual constraint and vice-versa. Something that says \"Click here if you want to see why this constraint is here\".</p>",
        "id": 180158709,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1573150570
    },
    {
        "content": "<p>For this, we'd probably need business rules to be identifiable chunks of text. Not sure we have that.</p>",
        "id": 180158849,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1573150670
    },
    {
        "content": "<p>(i'm jumping in because I made a side comment in the Atlanta IG training about having \"requirements\" as an entity. That is probably not the role of FHIR but...)</p>",
        "id": 180158971,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1573150734
    },
    {
        "content": "<p>Agree with <span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> I've been implementing FHIR for several years and so familiar with profiles. Where I struggle is identifying new business rules within profiles - to be honest I mostly miss them.<br>\nMost projects seem to be more concerned about adherence to rules rather than FHIR conformance.</p>\n<p>An example is here <a href=\"https://nhsconnect.github.io/gpconnect/accessrecord_structured_development_medicationrequest.html#extensionrepeatinformation\" target=\"_blank\" title=\"https://nhsconnect.github.io/gpconnect/accessrecord_structured_development_medicationrequest.html#extensionrepeatinformation\">https://nhsconnect.github.io/gpconnect/accessrecord_structured_development_medicationrequest.html#extensionrepeatinformation</a><br>\nThis extension has a rule: which is mandatory if the order is a repeat, it must not be present if not. </p>\n<p>You could create two derived profiles to enforce this rule (this profile is already derived) or create a constraint (which I would probably miss). <br>\nI think I would prefer ruleset, which states which profile I should use and what are the extra rules. </p>\n<p>This sounds similar to FHIR Graph Definition. Am I correct in believing many of the rules on the link above, could be defined in a GraphDefinition (<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ).</p>\n<p>This same resource is returned in a FHIR Bundle which also has business rules (), again I think GraphDefinition would work here as a way of defining rules. (<span class=\"user-mention\" data-user-id=\"191495\">@Jonny Rylands</span>  thoughts). These rules are best illustrated in this diagram <a href=\"https://nhsconnect.github.io/gpconnect/accessrecord_structured_development_retrieve_patient_record.html#bundle-population-illustrated\" target=\"_blank\" title=\"https://nhsconnect.github.io/gpconnect/accessrecord_structured_development_retrieve_patient_record.html#bundle-population-illustrated\">https://nhsconnect.github.io/gpconnect/accessrecord_structured_development_retrieve_patient_record.html#bundle-population-illustrated</a>.</p>",
        "id": 180211119,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573201918
    },
    {
        "content": "<p>I guess discoverability of constraints is mainly related to presentation/rendering, more so than the actual underlying representation/wire format. I'm not sure if/how this would improve by expressing your business logic in some other way.</p>",
        "id": 180222320,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1573213665
    },
    {
        "content": "<p>Lots of useful discussion. Just to try out the \"make a profile\" solution, here's a few scenarios (I'm relally thinking messaging &amp; validation rather then REST)</p>\n<p><strong>Scenario 1</strong> <a href=\"http://Patient.name\" target=\"_blank\" title=\"http://Patient.name\">Patient.name</a> - the base profile we use has <a href=\"http://Patient.name\" target=\"_blank\" title=\"http://Patient.name\">Patient.name</a> as optional. A project comes along that mandates <a href=\"http://Patient.name\" target=\"_blank\" title=\"http://Patient.name\">Patient.name</a> - is that reason enough to create a profile of Patient that mandates <a href=\"http://Patient.name\" target=\"_blank\" title=\"http://Patient.name\">Patient.name</a>?<br>\n<strong>Scenario 2</strong> Condition.code - the base profile we use has a preferred binding to a large condition  SNOMED CT refset. A project wants to use condition to capture whether a mother suffers from a recognised post-natal list of conditions. They provide a valueSet. Is this reason enough to have a Condition profile that binds the code element to this new valueSet?<br>\n<strong>Scenario  3</strong> Observation - We need to standarise units from pathology lab tests - is this reason enough to create Observation profiles for each lab test that fix codes (type of test) and expected units?</p>",
        "id": 180236286,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1573224787
    },
    {
        "content": "<p>Observation Definition  and graph definition are shortcuts to profiling.  But still needs to be documented clearly.</p>",
        "id": 180237175,
        "sender_full_name": "Eric Haas",
        "timestamp": 1573225335
    },
    {
        "content": "<p>I'm not sure they are shortcuts. Have played around with ObservationDefinition and it was pretty straight forward (from a dev perspective) to understand and use, especially when compared to equivalents in Observation profiles (I'd start coming close to being anti-fhir if pushed to use multiple obs profiles).</p>",
        "id": 180245138,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573229969
    },
    {
        "content": "<p>GraphDefinition would be good for defining invariants that hold across resources - particularly those that don't have direct relationships with each other.  Invariants within a resource would still be expected to be handled within a profile though.  (Our ability to render profiles may not be ideal, but our capabilities and experience with authoring GraphDefinitions, let alone rendering them in an understandable way, is significantly less.</p>",
        "id": 180245797,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573230395
    },
    {
        "content": "<p>However for RESTful interactions I am a fan of using profiles only. </p>\n<p>For messaging, firstly I want to know what should be in the message bundle. What I want is something this HL7v2 for ADT^A04 which I believe is what GraphDefinition can do.</p>\n<p><a href=\"/user_uploads/10155/C4vCPbMZW73p0g6TGiNDYqcI/ADTA04.PNG\" target=\"_blank\" title=\"ADTA04.PNG\">ADTA04.PNG</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/C4vCPbMZW73p0g6TGiNDYqcI/ADTA04.PNG\" target=\"_blank\" title=\"ADTA04.PNG\"><img src=\"/user_uploads/10155/C4vCPbMZW73p0g6TGiNDYqcI/ADTA04.PNG\"></a></div>",
        "id": 180245956,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573230521
    },
    {
        "content": "<p>From there I would go to the profiles, so PID being Patient would say CareConnect-Patient-1.<br>\nIf a derived profile is used I only want to know what the diff is, I'm not going to want to wade through a full profile.</p>",
        "id": 180246143,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573230619
    },
    {
        "content": "<p>my responses:</p>\n<ul>\n<li>Scenario 1 is definitely a profile whatever you try to call it</li>\n<li>Scenario 2 depends. It might be a value set condition buried in a Trigger Definition. It's not clear that it's a 'profile' </li>\n<li>Scenario 3: no I advise against using profiles in this case; there's no useful differentiation in structure between 1000s of different numerical lab tests. There's about 10 or so relevant data patterns; use ObservationDefinition to describe the 1000s of variants.</li>\n</ul>",
        "id": 180265208,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573242748
    },
    {
        "content": "<p>Scenario 2 is more complex. On a practical level a lot of things need to happen before the rule is followed (mostly around SNOMED, code conversions, term server interactions and validation engines), so at best it's going to be guidance.</p>",
        "id": 180304726,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573291441
    },
    {
        "content": "<p>Sure. But my point is, there are other computable places in FHIR than profiles for stuff like this</p>",
        "id": 180305180,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573292223
    },
    {
        "content": "<p>Given readability and expressivity of the CQL, is it possible to use CQL for the rules in the FHIR profile?  Just a wierd idea :)</p>",
        "id": 180307287,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1573296350
    },
    {
        "content": "<p>well... CQL is optimised for queries across resources. The inside resource bit is FHIRPath which is common with profiles. and it's possible to have a profile that says nothing in structured content, just makes a bunch of fhirpath invariants</p>",
        "id": 180309064,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573299309
    },
    {
        "content": "<p>Appreciate so much for your explanation</p>",
        "id": 180315138,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1573309397
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> agree. Any worked through examples - if not I'll look at doing some.</p>",
        "id": 180316412,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573311393
    },
    {
        "content": "<p>I am very interested in rendering a graph definition as a table or a DAG to make it more useful for readers.   Has anybody done that already before I give it a go.?</p>",
        "id": 180322219,
        "sender_full_name": "Eric Haas",
        "timestamp": 1573319528
    },
    {
        "content": "<p>like this? <a href=\"http://hl7.org.au/fhir/rcpa/cprofiles.html\" target=\"_blank\" title=\"http://hl7.org.au/fhir/rcpa/cprofiles.html\">http://hl7.org.au/fhir/rcpa/cprofiles.html</a></p>",
        "id": 180328744,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573329597
    },
    {
        "content": "<p>I've had a go at rendering <a href=\"https://data.developer.nhs.uk/ccri/term/graph/7\" target=\"_blank\" title=\"https://data.developer.nhs.uk/ccri/term/graph/7\">https://data.developer.nhs.uk/ccri/term/graph/7</a> (and a GraphDefinition)<br>\nto help describe how to build a Bundle I'm currently working on.</p>\n<p>Some of the rules on the response, are below: </p>\n<p><a href=\"/user_uploads/10155/g9bsgyFj0BRcBbr1jKN0AWGQ/Screenshot-2019-11-10-at-08.10.34.png\" target=\"_blank\" title=\"Screenshot-2019-11-10-at-08.10.34.png\">Screenshot-2019-11-10-at-08.10.34.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/g9bsgyFj0BRcBbr1jKN0AWGQ/Screenshot-2019-11-10-at-08.10.34.png\" target=\"_blank\" title=\"Screenshot-2019-11-10-at-08.10.34.png\"><img src=\"/user_uploads/10155/g9bsgyFj0BRcBbr1jKN0AWGQ/Screenshot-2019-11-10-at-08.10.34.png\"></a></div><p>Although the patient profile doesn't require a generalPractitioner, the response does and graphDefinition has allowed me to override that. </p>\n<p>Probably a better example are the lists.  The lists differ by code and which resource is in the list.</p>\n<p><a href=\"/user_uploads/10155/Xrd5TMXHMGZsnzHDWnQLpT5b/Screenshot-2019-11-10-at-08.14.07.png\" target=\"_blank\" title=\"Screenshot-2019-11-10-at-08.14.07.png\">Screenshot-2019-11-10-at-08.14.07.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Xrd5TMXHMGZsnzHDWnQLpT5b/Screenshot-2019-11-10-at-08.14.07.png\" target=\"_blank\" title=\"Screenshot-2019-11-10-at-08.14.07.png\"><img src=\"/user_uploads/10155/Xrd5TMXHMGZsnzHDWnQLpT5b/Screenshot-2019-11-10-at-08.14.07.png\"></a></div><p>This rule is quite brief and for that reason I don't think it justifies a profile.</p>",
        "id": 180353365,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573374239
    },
    {
        "content": "<p>what is it that 'justifies a profile'?</p>",
        "id": 180354009,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573375340
    },
    {
        "content": "<p>I think that's the question.</p>",
        "id": 180354445,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573376190
    },
    {
        "content": "<p>well, our answer so far is: any time you want to make rules about what is acceptable in a resource. But you don't seem to like that answer very much, because you seem to think that there's some...weight...price... to having a profile</p>",
        "id": 180354673,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573376621
    },
    {
        "content": "<p>Don't think it's as simple as that. </p>\n<p>I'd say I'm trying to profile/define Bundle responses (most UK standards are messaging or document based).</p>\n<p>I believe some of the response requirements shouldn't be profiled. I need to look further though.</p>",
        "id": 180358154,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573382405
    },
    {
        "content": "<p>is this <a href=\"https://nhsconnect.github.io/gpconnect/accessrecord_structured_development_retrieve_patient_record.html#bundle-population-illustrated\" target=\"_blank\" title=\"https://nhsconnect.github.io/gpconnect/accessrecord_structured_development_retrieve_patient_record.html#bundle-population-illustrated\">https://nhsconnect.github.io/gpconnect/accessrecord_structured_development_retrieve_patient_record.html#bundle-population-illustrated</a></p>\n<p>rendered from a GraphDefinition as well?</p>",
        "id": 180438332,
        "sender_full_name": "Eric Haas",
        "timestamp": 1573490292
    },
    {
        "content": "<p>Nope. I think it's a good candidate for it though (working on an example for it)</p>",
        "id": 180441786,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573492657
    },
    {
        "content": "<p>Leaning towards Rene's view in here though <a href=\"#narrow/stream/179177-conformance/topic/GraphDefinition.20as.20a.20conformance.20resource\" title=\"#narrow/stream/179177-conformance/topic/GraphDefinition.20as.20a.20conformance.20resource\">https://chat.fhir.org/#narrow/stream/179177-conformance/topic/GraphDefinition.20as.20a.20conformance.20resource</a></p>",
        "id": 180442075,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573492829
    },
    {
        "content": "<p>FWIW Friday at the DevDays in Amsterdam, there'll be a tutorial about GraphDefinition at 11:05 in The Richard.</p>",
        "id": 181294276,
        "sender_full_name": "René Spronk",
        "timestamp": 1574334327
    },
    {
        "content": "<p>Wish I was there.</p>",
        "id": 181294385,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1574334398
    }
]