[
    {
        "content": "<p>I've been askd this: </p>\n<p>If you had an application that currently does not have HL7 interfaces, and you want to interface using FHIR, would you create a new database to publish the FHIR resources too or would you map to the existing schema?  What are the advantages and disadvantages to each?</p>\n<p>Of course, I have my own opinions, but interested in anyone else's comments...</p>",
        "id": 153866157,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1483999612
    },
    {
        "content": "<p>I would typically lean towards mapping to the existing schema. Of course, there are run-time computational costs, but for specific use cases those typically aren't too high. Mapping to existing lends itself more to an incremental approach, I think.</p>",
        "id": 153866195,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1484015750
    },
    {
        "content": "<p>I presented on this at HL7 NZ in June Last year, just posted to Slideshare for others<br>\n<code>http://www.slideshare.net/BrianPostlethwaite1/fhir-server-design-review</code></p>",
        "id": 153866205,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1484019773
    },
    {
        "content": "<p>+1 to mapping to existing schema. If you used a new database, you would need to keep the old and new in synch, which raises a bunch of other questions/complications. They're solvable, but not without some extra infrastructure that you may not want to add</p>",
        "id": 153866473,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1484250156
    },
    {
        "content": "<p>Unless you don't need interop at all between the \"legacy\" and new</p>",
        "id": 153866474,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1484250180
    },
    {
        "content": "<p>typically, it's if you want bidirectional data flow that mapping to existing schema becomes really compelling. Otherwise, there's pro's and con's either way</p>",
        "id": 153866484,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484254015
    },
    {
        "content": "<p>thanks all for input</p>",
        "id": 153866485,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1484254023
    },
    {
        "content": "<p>I think that if the intent is to keep using the existing application then it would be better to map to the existing schema. However, if the intent is to eventually replace the existing legacy application with a new one, creating a new database would make sense.</p>",
        "id": 153866490,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1484255236
    },
    {
        "content": "<p>Someone has just written to me with this:</p>\n<blockquote>\n<p>I want to get a better idea of all the capabilities of FHIR and get a better understanding of how it plays into an IT infrastructure with KAFKA, Hadoop, Spark, and OT protocols like MQTT, AMQP, and DDS</p>\n</blockquote>\n<p>They're asking for a phone call. I hadn't even heard of those OT protocols before, so I'm not sure I'm the best person to talk to. Has anyone got any perspectives to offer?</p>",
        "id": 165864637,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558056785
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191318\">@nicola (RIO/SS)</span> ?</p>",
        "id": 165883289,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1558083160
    },
    {
        "content": "<p>Yes, i can participate in call and share my thoughts</p>",
        "id": 165885064,
        "sender_full_name": "nicola (RIO/SS)",
        "timestamp": 1558085121
    },
    {
        "content": "<p>What was the outcome of the call. We are using AMQP and MQTT as internal standards. But we we just want to use FHIR over our API gateway. Is there any knowledge over mapping AMQP to FHIR?</p>",
        "id": 261841840,
        "sender_full_name": "Roel Barelds",
        "timestamp": 1637179982
    },
    {
        "content": "<p>For asynchronous messaging, FHIR messaging may be pertinent (but also \"some assembly required\"):<br>\n<a href=\"http://hl7.org/fhir/messaging.html\">http://hl7.org/fhir/messaging.html</a></p>",
        "id": 261846249,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1637181935
    },
    {
        "content": "<p>Which call today? Worth evaluating whether Subscriptions revamp (since 2019) addresses any of this  but if don't have context on the question(s) <span class=\"user-mention\" data-user-id=\"192983\">@Roel Barelds</span></p>",
        "id": 261855057,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1637185817
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Hi josh,<br>\nI'm not sure if I understand you correctly. Are you saying that a mapping can be done through subscriptions from AMQP/MQTT to FHIR</p>",
        "id": 268252449,
        "sender_full_name": "Roel Barelds",
        "timestamp": 1642415315
    },
    {
        "content": "<p>Roel, I think what Josh is referring to is that the changes for Subscriptions (R5, with a backport to R4B once that is published) include the ability to define custom channels for communication.</p>\n<p>It should be fairly straightforward to define a channel type for any of those protocols, but it would not be something in the core spec.</p>",
        "id": 268415998,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1642522588
    },
    {
        "content": "<p>Hi guys, I am wondering how can I install / Use an Implementation Guide. Unfortunately I couldn't find much documentation how to use them. Thanks</p>",
        "id": 274866500,
        "sender_full_name": "John",
        "timestamp": 1646932616
    },
    {
        "content": "<p>What do you mean by \"install\"?  Typically there's no automatic mechanism to point a server at an IG and have the software magically support it.  Implementing an IG typically will involve writing code to enforce the rules of the IG and/or add new capabilities to the system.</p>",
        "id": 274869812,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646934059
    }
]