[
    {
        "content": "<p>Hi there,</p>\n<p>I am not exactly sure what to search for and searching for notification/subscription has to many meanings in FHIR hence I am trying here.</p>\n<p>We store several <em>telecom</em> items on the <em>Patient</em> resource (mainly email and phone numbers). Now we do have certain types of actions in our system where we want to notify the patient via sms or email. For instance if an appointment is rescheduled and originally would have happened within the next hour we schedule an <em>appointment_changed_urgent</em> event in our system and notify the patient (most likely via SMS). If it is more than one hour we simple schedule an <em>appointment_changed</em> event and also notify the patient (probably via mail). The patient is able to choose which communication medium he wants for which event (well not exactly the patient themself, but you get the idea). Now I also want to be able to provide this information to integrators. Does such an extension (or even core resource) already exist? If no, where would you attach such an extension? I am leaning towards the individual <em>telecom</em> items. Do you have other ideas on how to implement such a thing?</p>\n<p>Thanks,<br>\nFlorian</p>",
        "id": 224335692,
        "sender_full_name": "Florian Apolloner",
        "timestamp": 1611845234
    },
    {
        "content": "<p>It's kind of tempting add a repeating complex extension to each telecom to denote which telecom is to be used for which event notification. That may get complex really quickly 9especially of the list of events is longish), so I'm not that sure this is a good idea. One could use Basic to construct a 'communication preference' resource, but then one would have to manage telecom updates both in patient as well as in this Basic resource.</p>",
        "id": 224336778,
        "sender_full_name": "René Spronk",
        "timestamp": 1611845690
    },
    {
        "content": "<p>Assuming I would go down the <em>Basic</em> route, how would that look like? Have the patient as subject and then encode the individual events? How would the events refer to the communication transport (sms/phone?) -- our telecoms currently do not have individual IDs, which would making the link rather awkward.</p>\n<p>Currently I am kinda leaning towards the extension on the telecom, seems easier for us.</p>",
        "id": 224339163,
        "sender_full_name": "Florian Apolloner",
        "timestamp": 1611846637
    }
]