[
    {
        "content": "<p>I am somewhat at a loss when trying to figure out how to create an implementation guide. All my profiles are complete but this part seems very vague; especially the creation of 'pages'. It looks like a bunch of links to free-form anything. That being said, there is an Implementation Guide editior in Forge and Simplifier. Simplifier uses markdown so I thought it would be easier to use Forge. But after creating the Forge guide (putting in all the concrete items but no 'free-form' material), Simplifier gave me this message on an upload \"resource cannot be rendered\". Are the implementation guides produced by Forge and Simplifier incompatible?</p>",
        "id": 153901226,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1502291489
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span>, correct, IG support is preliminary and currently under active development.</p>\n<p>Forge allows you to author a FHIR IG resource. This was mainly implemented to allow users to open/save a set of related resources as an IG package. You cannot author actual IG content pages from within Forge.</p>\n<p>Simplifier currently provides an online IG editor (in beta). The editor allows you to author and publish actual page content and embed profile renderings.  We are currently working on improving this functionality, e.g. allowing you to import/export actual FHIR IG resources and markdown pages. However these new features are currently being developed and not yet available. We're planning to start releasing new IG features on Simplifier later this summer. Stay tuned!</p>",
        "id": 153901267,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1502293276
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> On Simplifier it states that one can create an implementation guide by </p>\n<p>You can access the IG editor via the Portal in your Simplifier account. To get there, log in to Simplifier and select the Implementation Guides tab from your Portal page. </p>\n<p>However, I could not find this 'Portal' in Simplifier. How do I get to the Portal?<br>\nThanks</p>",
        "id": 153901276,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1502293485
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span>, the online IG editor in Simplifier is currently only available on paid accounts. We will update the documentation to mention this.</p>",
        "id": 153901286,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1502294021
    },
    {
        "content": "<p>we're planning an IG tutorial in the near future. We will probably devote time on Sunday Q4 in San Diego to this</p>",
        "id": 153901383,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502319753
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"grahame@healthintersections.com.au\" data-user-id=\"10\">@Grahame Grieve</span> </p>\n<blockquote>\n<p>we're planning an IG tutorial in the near future. We will probably devote time on Sunday Q4 in San Diego to this</p>\n</blockquote>\n<p>I'M hoping so! Will it be available by webex? I did not get funded to go so I will need to attend remotely.</p>",
        "id": 153902797,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1503086410
    },
    {
        "content": "<p>I'll be in San Diego, but unfortunately not available Sunday Q4 for the tutorial discussion. Hope we can have some additional discussions during the week because I definitely want to contribute.</p>",
        "id": 153902801,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1503088010
    },
    {
        "content": "<p>The tutorial won't be held in San Diego.  We'll just be kicking off the discussions about what it should try to cover (and incidentally talking about what degree of consistency we can get around IG construction using the different tools available).  One of the topics will be whether this is best offered at WGMs or as a webinar.  If the latter, it'll be more widely accessible and will also be recorded.</p>",
        "id": 153902823,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1503101870
    },
    {
        "content": "<p>Yes, I understand that in San Diego we will be discussing what an IG publishing tutorial should look like, not actually delivering one. I still want to contribute :)</p>",
        "id": 153902845,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1503149233
    },
    {
        "content": "<p>We'll probably devote an evening session to it too Rick.  You'll definitely get a chance to contribute Rick :)</p>",
        "id": 153902852,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1503149995
    }
]