[
    {
        "content": "<p>Hi Everyone ,<br>\nI am trying to run the sample Implementation Guide from fhir-svn/tests/. Everytime I run it I am getting the following error: differential.element.tail().all(path.startsWith($context.differential.element.first().path+'.')) at 1, 1: Found $context expecting a valid token name<br>\n   org.hl7.fhir.dstu3.utils.FHIRLexer.error(FHIRLexer.java:93)<br>\n   org.hl7.fhir.dstu3.utils.FHIRLexer.error(FHIRLexer.java:89)</p>\n<p>Is there anything I have to change in the diagnosticorder-daf-profile-spreadsheet.xml. or any other suggestion ?</p>",
        "id": 153847433,
        "sender_full_name": "Shovan",
        "timestamp": 1473995692
    },
    {
        "content": "<p>works for me - how are you running it? </p>",
        "id": 153847511,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474067102
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-email=\"grahame@healthintersections.com.au\">@Grahame Grieve</span>, I have downloaded the 'org.hl7.fhir.igpublisher.jar' from <a href=\"https://hl7-fhir.github.io/downloads.html\" target=\"_blank\" title=\"https://hl7-fhir.github.io/downloads.html\">https://hl7-fhir.github.io/downloads.html</a> and running with all default settings (java -jar org.hl7.fhir.igpublisher.jar)</p>",
        "id": 153849281,
        "sender_full_name": "Shovan",
        "timestamp": 1474249734
    },
    {
        "content": "<p>Hi all,<br>\nI'm in the process of creating a FHIR implementation guide using the Jekyll static web generator (not the IG resource). The guide is for the Consent resource which will be used in a RESTful manner. <br>\nWhat I'd really appreciate, is some input from those who implement FHIR API's and what information within a guide would be useful to them. The areas I'm adding so far are:</p>\n<p>Security - TLS, SSL, JWT<br>\nGuidance per element - element summary, how to use it, formatting, examples<br>\nRendered versions of the profile and valuesets<br>\nConformance - capabilityStatement provided<br>\nREST examples for POST, GET and PUT<br>\nCode snippets for the above - C#, Java, VB, etc.<br>\nTesting - UAT, test results, test data</p>\n<p>This is in addition to the project overview  material.</p>\n<p>If there are any areas of implementation that cause issues, where some supporting information would be useful, I'd like to here from you.<br>\nMany thanks<br>\nDave</p>",
        "id": 153893084,
        "sender_full_name": "Dave Henderson",
        "timestamp": 1496995150
    },
    {
        "content": "<p>Hello!</p>",
        "id": 153893085,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1496996285
    },
    {
        "content": "<p>Hi. Serialization of partial FHIR resources has been an issue for me. For example if you receive a JSON patch that you need to parse as a FHIR element (not necessarily a complete resource) before applying to your backend database</p>",
        "id": 153893095,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1497004610
    },
    {
        "content": "<p>Also when one FHIR server is a frontend for multiple FHIR-compliant systems, it's not obvious how to ensure IDs do not collide. You could add qualifiers to the ID, but there's a fairly strict length limitation on IDs</p>",
        "id": 153893096,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1497004756
    },
    {
        "content": "<p>64 characters is pretty long </p>",
        "id": 153893165,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497046963
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193699\">@Dave Henderson</span> that seems fairly complete. </p>",
        "id": 153893166,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497046982
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193699\">@Dave Henderson</span>  We covererd about 80% of what you listed for <a href=\"http://www.fhir.org/guides/argonaut/r2/\" target=\"_blank\" title=\"http://www.fhir.org/guides/argonaut/r2/\">Argonaut DQ</a>  ( missing the Testing bit) So yeah is a really complete list.</p>",
        "id": 153893179,
        "sender_full_name": "Eric Haas",
        "timestamp": 1497058837
    },
    {
        "content": "<p>Thanks guys. Its good to know I'm on the right path.</p>",
        "id": 153893235,
        "sender_full_name": "Dave Henderson",
        "timestamp": 1497260493
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> if a single system generates UUIDs as ID, and you want the frontend system to qualify each ID with the ID of the source system, then you have surpassed 64 characters.</p>\n<p>I realize UUIDs technically don't need to be qualified with another ID as they're already unique, but architecturally you might not want the framework to be aware of how IDs are generated in the source system, or impose requirements that they should be universally unique.</p>",
        "id": 153893336,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1497336095
    },
    {
        "content": "<p>Not saying it's necessarily a flaw in the standard, but I still consider it a use case that could benefit from some guidance documentation</p>",
        "id": 153893337,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1497336197
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193772\">@Mattias Flodin</span> check out UUIDv5 if you need to make sure that the ID's does not collide between vendors</p>",
        "id": 153895479,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498670887
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> yeah if I had control over ID generation there wouldn't be an issue. In my case though I'm writing FHIR adapters for existing heterogenous third-party products. IDs can look any which way. They might be UUID or they might be simple autoincrement IDs. I'm trying to bring all these products into a single FHIR namespace so I need to qualify the IDs.</p>",
        "id": 153895598,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1498717186
    },
    {
        "content": "<p>Sometimes an ID is a long string.</p>",
        "id": 153895599,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1498717229
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193772\">@Mattias Flodin</span> How about setting a controlled proxy up front of your server adding UUIDv5 for each endpoint?</p>",
        "id": 153895606,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498719398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> Do you mean constructing a mapping table from vendor IDs to UUID? Sure I can always resort to that, but it will create a maintenance cost (running a database for storing mappings, cleaning up stale IDs, etc) so it would be preferable to avoid.</p>",
        "id": 153895612,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1498719902
    },
    {
        "content": "<p>Right ... </p>",
        "id": 153895614,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1498719923
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193699\">@Dave Henderson</span> , I did a presentation on FHIR DevDays 2015 about authoring IGs (<a href=\"https://www.slideshare.net/DevDays/authoring-implementation-guides-marten-smits\" target=\"_blank\" title=\"https://www.slideshare.net/DevDays/authoring-implementation-guides-marten-smits\">https://www.slideshare.net/DevDays/authoring-implementation-guides-marten-smits</a>) and created a template based on US-Lab. You can find that here: <a href=\"http://implementationguidetemplate.azurewebsites.net/\" target=\"_blank\" title=\"http://implementationguidetemplate.azurewebsites.net/\">http://implementationguidetemplate.azurewebsites.net/</a> <br>\nThis is all based on work from HL7 WG CGIT, which published a document on the topic here: <a href=\"http://wiki.hl7.org/index.php?title=ImplementationGuide_Guidance\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=ImplementationGuide_Guidance\">http://wiki.hl7.org/index.php?title=ImplementationGuide_Guidance</a></p>\n<p>If you have questions about this, don't hesitate to ask. I'm very happy to elaborate.</p>",
        "id": 153895645,
        "sender_full_name": "Marten Smits",
        "timestamp": 1498737677
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193772\">@Mattias Flodin</span> I'm confused why a UUID with a qualified id is a problem for 64 characters - a UUID is 36 characters. That leaves you with plenty still</p>",
        "id": 153895833,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498827219
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> because the qualification of that ID is also made with a UUID. That's 36 + 36 = 72 characters</p>",
        "id": 153895844,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1498831326
    },
    {
        "content": "<p>I have ideas for handling it. One way would be to tag IDs to say that they're already universal and don't need qualification. Another would be to simply look at the length and assume that no qualification is needed if it's already long enough. But leaving out the qualifier complicates routing.</p>",
        "id": 153895846,
        "sender_full_name": "Mattias Flodin",
        "timestamp": 1498831895
    },
    {
        "content": "<p>so use a shorter qualifier. You need a look table for it anyway - so just use a single digit </p>",
        "id": 153895874,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1498853824
    },
    {
        "content": "<p>I'm brand new to FHIR.  I keep hearing that the electronic IG can be used to automate the development needed.  Is this possible? can you ingest or upload the IG?  Can you validate your outputs against the structures of the IG?</p>",
        "id": 153998338,
        "sender_full_name": "Kesara Liyanage",
        "timestamp": 1537382811
    },
    {
        "content": "<p>A FHIR ImplementationGuide is a package of a number of other \"conformance\" resources.  Typical resources include: profiles (StructureDefinition), ValueSets, CodeSystems, ConceptMaps, StructureMaps, CapabilityStatements, SearchParameters, OperationDefinitions and NamingSystems.  Each of these enables some degree of automation.  ValueSets and CodeSystems support terminology validation.  Those together with StructureDefinition supports instance validation.  CapabilityStatements, OperationDefinitions and SearchParameters can support the generation of API code and the testing of APIs.  ConceptMaps and StructureDefintitions allow automation of transformations between models.</p>",
        "id": 153998342,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537383227
    },
    {
        "content": "<p>Thanks Lloyd. So the implementation guide, the one i'm seeing is essentially an HTML website that's been converted to a XML format. But your're right it has the value sets, data structures, and bundles needed  for the specific API calls defined. But the IGs don't have any pseudo code to do actually implementation logic,  like calling an API and communicating the appropriate payload?  Last question.  I'm seeing a tool called FHIR validator, i'm confused on exactly what it's validating, is it validating the resource to be FHIR compliant, or is it basically providing validation against the IG for an expected outcome.  For example,, is it validating that the output has the appropriate data structure. Or is it validating that the output is FHIR compliant resources?</p>",
        "id": 153998350,
        "sender_full_name": "Kesara Liyanage",
        "timestamp": 1537384613
    },
    {
        "content": "<p>Right.  The ImplementationGuide should include a downloads link that gives you all of the conformance resources as XML and JSON.  Actually generated code is not provided.</p>\n<p>The validator will validate instances against the core spec and can also validate against the profiles in an implementation guide - though if the instances don't declare the relevant profiles, you'll have to assert the profile along with the instance name.</p>",
        "id": 153998379,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1537392227
    },
    {
        "content": "<p>thanks a bunch</p>",
        "id": 153998593,
        "sender_full_name": "Kesara Liyanage",
        "timestamp": 1537451523
    },
    {
        "content": "<p>Anyone know how to upload Implementation Guide package (.tgz) to HAPI FHIR Server?</p>",
        "id": 241880589,
        "sender_full_name": "Hùng Bùi Duy",
        "timestamp": 1623137728
    },
    {
        "content": "<p>Probably best to ask on <a class=\"stream\" data-stream-id=\"179167\" href=\"/#narrow/stream/179167-hapi\">#hapi</a></p>",
        "id": 241919992,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1623159394
    }
]