[
    {
        "content": "<p>Hey all</p>",
        "id": 153853301,
        "sender_full_name": "Dulanjan Lokupathirage",
        "timestamp": 1476942577
    },
    {
        "content": "<p>We are implementing our REST API to be used by clients using the FHIR standards. But we have data structures which might deviate from the current FHIR standards and it was recommended we publish these ones privately.<br>\nBut thought to clarify with you first:</p>\n<p>We need to list a set of Provider Types (example: GP, Nurse, Specialist. etc) <br>\nIs there an existing FHIR resource which will support this or will this be an example of where we implement our own resource?</p>",
        "id": 153853302,
        "sender_full_name": "Dulanjan Lokupathirage",
        "timestamp": 1476943030
    },
    {
        "content": "<p>have you looked at care team? </p>",
        "id": 153853304,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1476944813
    },
    {
        "content": "<p>I think the Practitioner is what you are really looking for, and the Role.Code property can be used on it to define that the practitioner providers the service types that you are listing.<br>\nThe list of valid types of roles would then be stored in a valueset that you would create and populate with those values.<br>\nAnd then, if you're looking to define a set of practitioners that are allocated to service a patient, then these would be done in a CareTeam resource.</p>",
        "id": 153853317,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1476958081
    },
    {
        "content": "<p>In what way are your vision for GP, Nurse, Specialist different than Practitioner? It might be instructive to see your need to deviate.  I would expect your deviations are representable as a subset of Practitioner, possibly useful written up as a profile of it.</p>",
        "id": 153853361,
        "sender_full_name": "John Moehrke",
        "timestamp": 1476972973
    },
    {
        "content": "<p>If you're just wanting a list of types (i.e. just a set of codes and names), that sounds like ValueSet to me.  If you're actually wanting to list providers who correspond to particular types, that would be Practitioner</p>",
        "id": 153853406,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1476980292
    },
    {
        "content": "<p>Agree with Lloyd. If we just need to get list of practitioner type (GP,Nurse...), we should return list of valueset instead of practitioner resource as this will confuse users </p>",
        "id": 153853573,
        "sender_full_name": "Arpan Saxena",
        "timestamp": 1477003373
    },
    {
        "content": "<p>Thanks for the responses everyone!!<br>\nMaybe I should have been more clear. As Arpan mentioned in this case its only for a list of types so we can look at using valueset for this case.</p>",
        "id": 153853574,
        "sender_full_name": "Dulanjan Lokupathirage",
        "timestamp": 1477003588
    },
    {
        "content": "<p>yes ValueSet/CodeSystem for this </p>",
        "id": 153853575,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477003689
    }
]