[
    {
        "content": "<p>Hi, When downloading tasks from the Fhir backend we also download referenced information like Patients,  Encounters, Requester:Organization with include statements on the task. <br>\nLike this: Task?_include=Task%3Aencounter&amp;_include=Task%3Arequester%3AOrganization&amp;_include=Task%3Apatient</p>\n<p>Here we also want to include referenced locations, but it does not seems to work with an include statement.<br>\nLike this: Task?_include=Task%3Aencounter&amp;_include=Task%3Arequester%3AOrganization&amp;_include=Task%3Apatient&amp;_include=Task%3Alocation<br>\n Is this not possible or can anyone explain to me how to include locations?</p>",
        "id": 239384580,
        "sender_full_name": "Christian Schmidt",
        "timestamp": 1621412468
    },
    {
        "content": "<p><code>location</code> is no common search parameter for the Task resource. Includes work with search parameter codes/names not property names. However, you could create your own search parameter for location, if your server supports custom search parameters.</p>",
        "id": 239403193,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1621422182
    },
    {
        "content": "<p>Thanks Alexander. Are you able to supply me with some example or redirect me to some documentation on how to structure the searchParameter, to make it available with the include statements?</p>",
        "id": 239428577,
        "sender_full_name": "Christian Schmidt",
        "timestamp": 1621432722
    },
    {
        "content": "<p>You can download all the SearchParameters defined in the core spec here: C:\\Users\\lloyd\\Documents\\SVN\\fhir\\publish\\search-parameters.json (or change the extension to XML if you prefer).  That provides lots of examples.  However, you'd also have to get the server in question to <em>support</em> the search parameter (and to allow it to be used with _include).  If you're in control of the server, that's easy.  If not, you'll have to ask the server owner.</p>\n<p>As an aside, you might submit a change request asking for Task.location to be a standard search parameter in R5.</p>",
        "id": 239450592,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621439857
    },
    {
        "content": "<p>Thanks for the great answers! I succeeded making the search parameters and include locations in taks downloads.</p>",
        "id": 239576538,
        "sender_full_name": "Christian Schmidt",
        "timestamp": 1621511245
    },
    {
        "content": "<p>Any chance of you submitting a change request to seek a standard Search Parameter in R5 <span class=\"user-mention\" data-user-id=\"413560\">@Christian Schmidt</span> ? :)</p>",
        "id": 239588380,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621516337
    }
]