[
    {
        "content": "<p>Hi,<br>\nThe resource FinnishPatient (<a href=\"https://simplifier.net/FinnishPHR/FinnishPatient\" target=\"_blank\" title=\"https://simplifier.net/FinnishPHR/FinnishPatient\">https://simplifier.net/FinnishPHR/FinnishPatient</a>) is based on the Patient resource (<a href=\"https://www.simplifier.net/core-base-resources/Patient\" target=\"_blank\" title=\"https://www.simplifier.net/core-base-resources/Patient\">https://www.simplifier.net/core-base-resources/Patient</a>). I would like to make a new resource using FinnishPatient as a base, and which contains the telecom field from the original Patient. When I open the FinnishPatient resource in Forge (San Antonio 2017 edition), I can see the telecom field in the editor as overlined, but I cannot restore it. When I try to change its cardinality from 0..0 to anything else, the program gives a validation error, and says that cardinalities can only be restricted.</p>\n<p>Can anyone please tell me how to change or increase the cardinality  of a resource in Forge?</p>",
        "id": 153871909,
        "sender_full_name": "Omar El-Begawy",
        "timestamp": 1487250768
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193329\">@Omar El-Begawy</span> this is by design. According to FHIR rules, a profile can only further constrain the base profile. Specifically, you can only further limit the element cardinality. So if the base profile prohibits a certain element (max = 0), then derived profiles can never relax that constraint.</p>",
        "id": 153871953,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1487254503
    },
    {
        "content": "<p>The reasoning behind this is that an instance that conforms to one of the derived profiles must also conform to the base profile, per definition. So a base profile cannot be \"stricter\" than a derived profile.</p>",
        "id": 153871954,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1487254649
    }
]