[
    {
        "content": "<p>Resources and profiles can indicate how an element should be coded. Let's call that the \"prescribed\" coding. Of course, CodeableConcept.coding can contain multiple codings. Although FHIR provides a way to indicate the original coding (in Coding.userSelected), there is no obvious way to indicate which is the prescribed coding. What is the best way to flag the \"prescribed\" coding, to distinguish it from the other N codings that might be present?</p>",
        "id": 153913170,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1507570975
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> Do you mean the default value?</p>",
        "id": 153913173,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1507575587
    },
    {
        "content": "<p>The instance might comply against multiple profiles - each with a different \"prescribed\" coding.  So the only way such an indicator could be useful is if it pointed to the profile element it was claiming to align with - which would be pretty ugly.  You can get a close approximation by including the Coding <a href=\"http://hl7.org/fhir/extension-valueset-reference.html\" target=\"_blank\" title=\"http://hl7.org/fhir/extension-valueset-reference.html\">reference-valueset</a> extension.</p>",
        "id": 153913212,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507606797
    },
    {
        "content": "<p>Note that you should <em>not</em> require Codings to be in any particular order because that then prevents the same interface from being used to satisfy multiple consumers that each might want different codes.</p>",
        "id": 153913213,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507606832
    },
    {
        "content": "<p>The typical way this is done is just look through the list of codes and see if you find one you recognize.  If you want to be thorough, look through the whole list and if you recognize more than one, pick the one that gives you the most information.</p>",
        "id": 153913214,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1507606876
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191447\">@Mark Kramer</span> Do you mean the default value?</p>\n</blockquote>\n<p>no, not a default value</p>",
        "id": 153913296,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1507641034
    },
    {
        "content": "<p>Thanks, Lloyd. That makes a lot of sense.</p>",
        "id": 153913686,
        "sender_full_name": "Mark Kramer",
        "timestamp": 1507837797
    }
]