[
    {
        "content": "<p>Seeking guidance for most effective way to indicate that an observation intentionally did not occur with a reason it was not done and when that information was documented.  Current R4 Observation modeling uses a specific Observation.status value set which is different from the Event.status value set. The Event.status value set includes \"not-done\" as an option but Observation.status value set does not. Resources such as Procedure allow a .status = not-done and statusReason for indication of rationale for not performing the procedure.  For the QI-Core implementation guide ballot reconciliation I am seeking advice about whether to consider Observation with an extension to address not-done status or if Procedure.status is more appropriate.  Thanks, in advance for suggestions.</p>",
        "id": 178205067,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1571153800
    },
    {
        "content": "<p>Use the standard extension:  <a href=\"http://hl7.org/fhir/StructureDefinition/event-statusReason\" target=\"_blank\" title=\"http://hl7.org/fhir/StructureDefinition/event-statusReason\">http://hl7.org/fhir/StructureDefinition/event-statusReason</a></p>",
        "id": 178205539,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571154099
    },
    {
        "content": "<p>for an observation status of:</p>\n<p>cancelled   'The observation is unavailable because the measurement was not started or not completed (also sometimes called \"aborted\")'</p>",
        "id": 178205712,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571154187
    },
    {
        "content": "<p>Somewhere  Rob H or I have a concept mapping to the event statuses.</p>",
        "id": 178205964,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571154340
    },
    {
        "content": "<p>cancelled doesn't fit our use case. It assumes the activity was started and then something changed to cancel it. Our use case is a decision not to do something that might otherwise be expected. Clinicians don't start and then cancel. There needs to be a way to indicate \"I don't want to do this expected activity\" -- and we have used \"resource\".status = not-done for this purpose, but Observation has a specific status value set that does not include not-done. So our use case is not met.  Hence the question if Procedure is a better way to indicate not-done (I.e., the lab test wasn't done - it wasn't cancelled, it wasn't done in the first place for a reason).  Does that help with the request?  Event.status would help if Observation.status used event.status but it doesn't.</p>",
        "id": 178242597,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1571179970
    },
    {
        "content": "<p>So we have 2 options - create an extension to use event.status (perhaps this is actually a profile Observation.statusAvoided with event.statusReason) but that seems excessive perhaps, or to consider use of Procedure instead when \"not-done\"</p>",
        "id": 178242652,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1571180042
    },
    {
        "content": "<p>What about using the terminology</p>",
        "id": 178245605,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571183069
    },
    {
        "content": "<p>This sound like cda negation indicator stuff which we don’t really do in fhir</p>",
        "id": 178245646,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571183118
    },
    {
        "content": "<p>Actually I take that back</p>",
        "id": 178245740,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571183218
    },
    {
        "content": "<p>We use data absent reason to say not done</p>",
        "id": 178245759,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571183255
    },
    {
        "content": "<p>The pattern is to have a specific status for \"not done\" (as distinct from cancelled).  Is there a reason OO decided not to follow that route?  Is that something that could be considered for R5?</p>",
        "id": 178250596,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571188994
    },
    {
        "content": "<p>Yes, Observation.dataAbsentReason was my first thought but the value set, though extensible seems to suggest more operational reasons for lack of results - <a href=\"http://hl7.org/fhir/r4/valueset-data-absent-reason.html**http://hl7.org/fhir/r4/valueset-data-absent-reason.html\" target=\"_blank\" title=\"http://hl7.org/fhir/r4/valueset-data-absent-reason.html**http://hl7.org/fhir/r4/valueset-data-absent-reason.html\">http://hl7.org/fhir/r4/valueset-data-absent-reason.html**http://hl7.org/fhir/r4/valueset-data-absent-reason.html</a>. And the only available timings that might fit are (a) Observation.issued, which indicates when the version of the observation was made available to providers and (b) Observation.effective[x] the time or time-period the observed value is asserted as being true. Timing for the decision or recording of decision not to perform the observation is not covered by strict interpretation of .effective or .issued.    So the current question in R4 is whether we can \"extend\" the meaning by using .dataAbsentReason and .effective[x] to indicate such an intended negation. That would mean we need a status that works (and there is no applicable status in the required value set for observation.  OR we could consider using Procedure.status = not-done to address such intentional negation.   Considerations for R5 are helpful but we need to address the issue in R4 as well.    Perhaps another alternative might be ServiceRequest since the concept might be considered a request/determination not to do something.   Thoughts?</p>",
        "id": 178283801,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1571229383
    },
    {
        "content": "<p>If you want to use Observation, cancelled looks like the only option.</p>\n<p>'cancelled' means \"The observation is unavailable because the measurement was not started or not completed (also sometimes called \"aborted\").\"</p>\n<p>It seems to _include_ the semantics of aborted (started, not finished), but also to include never started. So it seems OK to me, if not perfect. But if the potential implication that an observation was intended before being cancelled is untenable, then you don't want Observation; you want Procedure with a \"not done.\"</p>\n<p>I seem to recall being told that a required binding means no DAR allowed. And Observation is normative, so adding a value to R5 will be difficult.</p>\n<p>Semantically, I think Procedure works better. Your primary assertion is that the act was not done, the absence of the result is incidental.</p>",
        "id": 178299092,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1571238969
    },
    {
        "content": "<blockquote>\n<p>I seem to recall being told that a required binding means no DAR allowed. And Observation is normative, so adding a value to R5 will be difficult.</p>\n</blockquote>\n<p>is not correct here:</p>\n<p>there is a DAR element:  Observation.dataAbsentReason</p>\n<p>so code = X<br>\nvalue  is absent  ( not populated)<br>\nDAR = not done, patient refused, dog ate it etc,</p>\n<p>Lloyd   - No</p>",
        "id": 178322271,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571255397
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Was that 'no' a response to the \"is there a reason?\" question or the \"could we change it in R5?\" question?</p>",
        "id": 178325134,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1571257418
    },
    {
        "content": "<p>These statuses have been discussed ad nauseam and  the burden lies with anybody requesting the change  to convince the committee to change.  So the starting point is no.</p>",
        "id": 178343017,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571275934
    },
    {
        "content": "<p>What I take from this discussion: DataAbsentReason might work for why observation did not occur. However, our eCQM expressions require a status and there is no acceptable Observation.status required code that works. If there is a dataAbsentReason, it may be due to a status = cancelled or something else (but cancelled doesn't fit the eCQM use case).  Hence, since the workflow probably works better as a Procedure.status = not-done since the procedure to perform the observation did not happen (per Jay's comment and my thoughts as well).  Thanks for this feedback.</p>",
        "id": 178393339,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1571326826
    },
    {
        "content": "<p>My take could get challenging, as it is based on actual data out there.  We need to allow for the use of:<br>\n- Observation.valueCodeableConcept = Not Done.  Examples would be where various assessments are valued Not performed | 262008008 | 2.16.840.1.113883.6.96<br>\n- Observation.dataAbsentReason = not-performed<br>\n- Obsevation.status = not-done<br>\nUpdates would need to be made to status value set to include not-done.  We should not remove cancelled as there is a nuance between not-done and cancelled.  Plus Observation is normative.</p>\n<p>However, we should not start to use a Procedure to record when something was not done, but Observation when it was done.  That will get very confusing.</p>",
        "id": 178398726,
        "sender_full_name": "Hans Buitendijk",
        "timestamp": 1571330433
    },
    {
        "content": "<p>is the actual data out there really Observation.status = not-done?  because in the HL7 world there has never been a status of not-done for Observation not table 85 or 123 in V2 nor in CCDA. (2.16.840.1.113883.5.14)</p>\n<p>the first two are typically how it is stated. within the name value pair paradigm.</p>",
        "id": 178405014,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571334881
    },
    {
        "content": "<p>And introducing a 3rd way will as Hans indicated \"get challenging\" for implementers</p>",
        "id": 178405177,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571334978
    },
    {
        "content": "<p>Hans - I like your suggestion but, like Eric, I don't know where to find Observation.valueCodeableConcept = Not Done.  Further Observation.dataAbsentReason allows an eCQM author to create a specific value set (I.e., the existing FHIR value set is not Required) - please confirm.   And what would be the timing - Observation.issued?   I think what I'm seeing is that we might be able to create an extension in QI-Core to use a different value set (I.e., the same as what you have plus \"not-done\") -   Does that work?</p>",
        "id": 178484174,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1571412222
    },
    {
        "content": "<p>In scenarios 1 and 2 above the dateTime elements 'issued'  aka when the observation of not done was posted and effective aka the clnically relevent dateTime  of when the observation was (supposed to be made) are no different than if the observation was made.</p>",
        "id": 178523180,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571449265
    },
    {
        "content": "<p>... and the status for observation would be the same</p>",
        "id": 178523194,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571449297
    },
    {
        "content": "<p>In scenario three which I am against.  the dateTime elements would be the same....  I am not sure why QI-Core would want to carve out its own path.  Can you present a real life simple example to illustrate what you want exactly?</p>",
        "id": 178523310,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571449458
    },
    {
        "content": "<p>to document a reason in order to meet the intent:</p>\n<ul>\n<li>for scenario 1 above the <code>note</code> element would contain the reason.</li>\n<li>for scenario 2 above the <code>valueAbsentReason</code> element would contain the reason.</li>\n</ul>",
        "id": 178525907,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571454435
    },
    {
        "content": "<p>Eric, I'm having trouble understanding scenario 1 and scenario 2 - what are the 2 scenarios you reference?  My concern is about something that didn't happen \"on purpose\" for a reason. So I think that means: status = final (the fact it isn't happening is final); dataAbsentReason is valued with a direct reference code or a value set to allow a specific instance specify what reasons are acceptable; and timing = observation.issued - because that is when the reason not done is valued.  Will that work?    Example - asthma risk assessment was expected at the visit but it was not performed because the patient was in the midst of an asthma attack requiring acute treatment.  So Observation.status = final (for that encounter), Observation.dataAbsentReason = Medical Reason, Observation.issued = dateTime reason was entered.</p>",
        "id": 178704016,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1571695957
    },
    {
        "content": "<p>From Hans' Post:</p>\n<ol>\n<li>Observation.valueCodeableConcept = Not Done. Examples would be where various assessments are valued Not performed | 262008008 | 2.16.840.1.113883.6.96</li>\n<li>Observation.dataAbsentReason = not-performed</li>\n</ol>",
        "id": 178714779,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571707107
    },
    {
        "content": "<p>Thanks - but Hans' comment dataAbsentReason = not-performed is not sufficient.  We actually need the reason, we already know it isn't performed by the attribute.  I think my options still work:<br>\nObservation.dataAbsentReason = [value set] or [direct reference code]<br>\nObservation.status = final<br>\nObservation.issued = dateTime (I.e. time of the entry of the dataAbsentReason since the observation did not occur)</p>",
        "id": 178754543,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1571750364
    },
    {
        "content": "<p>As I stated above:</p>\n<p>to document a reason in order to meet the intent:</p>\n<p>for scenario 1 above the note element would contain the reason.<br>\nfor scenario 2 above the valueAbsentReason element could contain the reason. and the note element would contain the reason. too</p>",
        "id": 178767606,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571758678
    },
    {
        "content": "<p>I understand the response but it doesn't match the use case. We need to be able to state (1) not done (the scenario 1) and (2) a reason it wasn't done.  However, the reason cannot be a \"note\" it must meet specific allowable coded reasons.  And the Observation.dataAbsentReason value set is consistent with why a result wasn't published by a laboratory, but it does not fit with reasons that a clinician or a patient failed to perform the observation (I.e., a medical consideration or a patient refusal).  VSAC contains 51 value sets created to address reasons for not performed an activity just related to medical reason (all coded and that doesn't include patient reasons). While there are many duplicates in that set, it does provide the use case.</p>",
        "id": 178946968,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1571920660
    },
    {
        "content": "<p>Observation.dataAbsentReason value set .  could all those 51 valuesets be additional codings to 'not-performed' providing more granular details.</p>\n<p>also I think that the note element of type Annotations allow for codes. too.  since the markdown datatype is a string specialization and you can bind valuesets to strings.</p>\n<blockquote>\n<p>The instance carries a string. In some cases, applications may wish to control the set of valid strings for a particular element, so the string value can be treated as a coded element (like code)</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  verifying that  markdown can be treated as codes as well?</p>",
        "id": 178982512,
        "sender_full_name": "Eric Haas",
        "timestamp": 1571941880
    },
    {
        "content": "<p>we haven't said so</p>",
        "id": 178982581,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1571941920
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> &amp; <span class=\"user-mention\" data-user-id=\"192672\">@Floyd Eisenberg</span>  Sorry, for a recap request, but can we reestablish where the scenario below is problematic?<br>\nScenario: <br>\nWhere there is an observation (and I think this is also true for procedure) that is not done/performed and therefore does not have \"typical\" observation.value, we want to say this is the FINAL status of that observation, and the reason it was not done must be a coded concept.<br>\nApproach: <br>\nobservation.status = Final<br>\nobservation.valueCodableConcept = Not performed | 262008008 | 2.16.840.1.113883.6.96 (or some such, but I'd like this)<br>\nobservation.dataAbsentReason = binding is currently extensible <a href=\"http://hl7.org/fhir/ValueSet/data-absent-reason\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/data-absent-reason\">DataAbsentReason</a> so for an eCQM profile we bind to value set that we need to cover our QM uses, but if someone want to send something additional, they need to create a new value set with the additional codes they need. </p>\n<p>Now I understand that you want to scope all the specifics we need under the existing not-performed concept in DAR, but in this case, at least, that is not the correct semantics, IMO. For me, the current semantics are system focused and not clinical user focused.</p>",
        "id": 179178218,
        "sender_full_name": "Robert McClure",
        "timestamp": 1572195440
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> &amp; <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> - Modification to your scenario with respect to what is problematic:   <br>\nScenario:<br>\nWhere there is an observation that is not done/performed, there is an observation.code (type of observation/code) and there is no observation.value (I.e., there is no actual result).  We still need to indicate a status for which the most appropriate status value = final. And, the reason the observation was not performed must be a coded concept that is different than the existing dataAbsentReason value set (extensibly bound) since that existing value set as you noted is system-focused and not clinical user (or patient) focused.  So the need is to address QDM's negation rationale consisting of three \"components\":</p>\n<ul>\n<li>Observation.status = final</li>\n<li>Observation.issued (the time the reason not performed is entered)</li>\n<li>Some way of indicating the reason the observation action did not occur (clinical or patient reason)</li>\n</ul>\n<p>So, Rob, from your comments, I take 2 notes:</p>\n<p>1) dataAbsentReason may be inadequate and perhaps we need a specific extension for notDoneReason with the clinically-focused value set we discussed (unless we can shoe-horn in re-use of dataAbsentReason<br>\n2) Perhaps we also need to specify Observation.value[x] with \"not performed\" - however, I my expectation is that no observation.value exists and that implementers will have more trouble forcing a value into the Observation.value[x] than just using a CQL expression indicating \"not exists Observation.value\" - If we need a direct reference code value, I think we want something like \"intentionally not performed\" - just \"not performed\" is too generic.  My preference is to avoid insistence of a value for Observation.value.<br>\n2.a.) If we must value the Observation.value, we would need to value the \"result\" for all of the QI-Core/FHIR resource profiles that enable \"not performed for reason\" - that includes MedicationRequest, MedicationAdministered, Observation, Procedure, Communication, ServiceRequest, Communication.  Are you sure we need to do that?</p>",
        "id": 179179937,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1572198580
    },
    {
        "content": "<p>I don't see any reason from this thread to think that we want to populate Observation.value when there is no value. The most obvious approach is to define a new value set with extensions to the DAR value set and use those.</p>",
        "id": 179189529,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572214630
    },
    {
        "content": "<p>I happens in the real world as Hans stated above that users stick \"not performed' in observation values whether is ideal or not.   So I don't it can be ignored.</p>",
        "id": 179262246,
        "sender_full_name": "Eric Haas",
        "timestamp": 1572288291
    },
    {
        "content": "<p>@Eric, I appreciate implementers may place \"not performed\" in the observation.value but for our use case we don't expect a real result. Hence, whether it is empty or it includes \"not performed\" there is no difference.  I think that specifically looking for a value = not performed is highly problematic because it will often be missing.</p>",
        "id": 179270231,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1572293343
    },
    {
        "content": "<p>Can you clarify what the use case is?    I have been under the assumption that use case was to identify and formulate some guidance around how represent \"not done\" Observations in FHIR for QI Core so that the QDM criteria are met in a machine readable way.</p>",
        "id": 179279194,
        "sender_full_name": "Eric Haas",
        "timestamp": 1572299111
    },
    {
        "content": "<blockquote>\n<p>It happens in the real world as Hans stated above that users stick \"not performed' in observation values whether is ideal or not.   So I don't it can be ignored.</p>\n</blockquote>\n<p>Sure. but let's not encourage that at all</p>",
        "id": 179282145,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572301330
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> The use case is to represent \"not done for a reason\" observations in FHIR for QI-Core so that QDM criteria are met in a machine readable way.  So if there is a reason why an observation did not occur, there should not be a populated value field. If it is populated with \"not done\" (which I agree with Grahame should not be encouraged), that doesn't matter.  We do want to know there is not a \"valid\" result in the value field and CQL can indicate <em>not exists</em> value = \"expected response (I.e., specific code from a measure-defined value set, or numerical value with UCUM units)\"</p>",
        "id": 179327474,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1572355139
    }
]