[
    {
        "content": "<p>All, </p>\n<p>We are trying map Infections to fhir resource and we found \"Condition\" as a an appropriate resource.</p>\n<p>One of the use cases to complete or resolve an infection is to draw blood culture and review the results, due to that business decided to have one custom status for the Infection as \"Culture reviewed\".</p>\n<p>Our clarification is,  the Condition resource status attributes currently are not extensible (both clinicalStatus and verificationStatus). </p>\n<p>I am not sure if its a valid request to make the condition's status extensible.</p>\n<p>Is there any approach to handle this scenario?</p>\n<p>We can document the culture results as Observation but Infection status is the only limitation here.</p>\n<p>please help me if I am missing something here.</p>\n<p>Thanks,<br>\nVijay</p>",
        "id": 153902630,
        "sender_full_name": "Vijay Thangavelu",
        "timestamp": 1502898538
    },
    {
        "content": "<p>Does Culture reviewing make the difference between a verificationStatus of \"provisional\" (before review) and \"confirmed\" or \"refuted\" (after the review)?<br>\nIf not, in which part of the process would a status of \"Culture reviewed\" be valid and what is the difference to the standard codes defined for verificationStatus?</p>",
        "id": 153902633,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502901063
    },
    {
        "content": "<p>Culture reviewed isn't really a status of the condition.  It's more a status of the workflow associated with the order.  So the typical place you'd see \"culture reviewed\" is in the Task.businessStatus of the Task that's tracking fulfillment of the order.  The Condition would presumably be \"provisional\" or \"differential\" before the culture was reviewed and \"confirmed\" after.</p>",
        "id": 153902639,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502905839
    },
    {
        "content": "<p>Thanks Stefan/Lloyd. It really helps.</p>",
        "id": 153902640,
        "sender_full_name": "Vijay Thangavelu",
        "timestamp": 1502906014
    }
]