[
    {
        "content": "<p>I have been using provenance resource to present operation made by practitioner. 'CREATE' is at the moment used for \"Measurement operation\" and 'UPDATE' for \"Update operation\". Codes are from: <a href=\"https://www.hl7.org/fhir/v3/DataOperation/cs.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/v3/DataOperation/cs.html\">https://www.hl7.org/fhir/v3/DataOperation/cs.html</a>. Now I would need a way to present few more operations. These operations are associated with serial monitoring study where the device is initialized for patient. Patient makes measurements and practitioner unloads measurements afterwards. So I would need way to present initialization of device and another for unloading of measurements from the device.  Any tips how to present these would be much appreciated.</p>",
        "id": 163450847,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1555403773
    },
    {
        "content": "<p>Keep in mind that Provenance represents metadata associated with the creation of a new version of a resource.  Would all of these result in new versions of the Device resource?  If not, you might want to look at AuditEvent instead.</p>",
        "id": 163465809,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555419085
    },
    {
        "content": "<p>Thanks fro the answer <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . I'm not sure if I fully understood Your reply. Provenance was recommended for me earlier as a best way to present operations.  Now I'm confused how to get this work. I already added provenance to our implementation. Provenance  has now reference to practitioner and to top level  grouper observation which groups whole study together (grouper observation is referenced from target and practitioner from agentWho).  Reference to this grouper observation is obligatory because there can be several studies. So device itself is not referenced directly from Provenance. Device is only referenced from observation. These operations which I'm trying to present are operations practitioner can make for the \"study\" (measurement, update, initialization of device, unload measurements from device and later calibration check for device).  I have been studying AuditEvent resource. There can be only one resource as a agent.reference. Is there a another place for reference in AuditEvent, I can't figure that out? If I have to use AuditEvent could the operation itself be presented as (\"outcomeDesc\": \"Device initialised\") and action would be (\"action\": \"E\"). If this is the right way to use this resource it seems more flexible than provenance.</p>",
        "id": 163544130,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1555492460
    },
    {
        "content": "<p>For provenance as activity I was considering code: ENT, Data Enterer, from <a href=\"http://terminology.hl7.org/CodeSystem/v3-ParticipationType\" target=\"_blank\" title=\"http://terminology.hl7.org/CodeSystem/v3-ParticipationType\">http://terminology.hl7.org/CodeSystem/v3-ParticipationType</a> to present UnloadMeasurements. For initalization of device I didn't find anything suitable. So does the use of Provenance seem wrong way to do this?</p>",
        "id": 163548629,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1555496961
    },
    {
        "content": "<p>Provenance reflects the creation of a new 'version' of one or more records.  It doesn't reflect things that happen in the real world unless there's a record that's updated as a result.  The Provenance <em>must</em> point to the record version that was created as a result of the event the Provenance is describing.  (That's what Provenance.target does.)  You could have a Provenance for each Observation made and each time a Device was updated.  Alternatively, if you want to capture that there was some manipulation of the device and don't want to record an update to the Device, you could capture a Procedure that reflected device initialization or calibration.  And those Procedures could be 'partOf' the overall observation</p>",
        "id": 163569960,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555514018
    },
    {
        "content": "<p>AuditEvent is generally not explosed to clinical users.</p>",
        "id": 163569990,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555514039
    },
    {
        "content": "<p>Hey! I'm back at trying to solve this problem after holidays. At the moment when I'm referring from provenance to \"study\" observation which groups whole study together. Provenance does not directly effect to this observation but other resources under the tree of observations and other resources are effected. Actually one operation can effect more than one resource at the same time. So it would be new version after each operation. At least under the tree of observations. If practitioner makes a measurement which would be a 'CREATE' action. Measurement would make the whole tree of observations provenance referring to the top of the tree. So would this actually be the right way to do this? Using provenance I still have problem how to present \"InitialiseDevice\", \"UnloadMeasurements\" and possible calibration check. </p>\n<p>So if I would need to use AuditEvent to store these operations, would it be right way to use it as I tried to demonstrate earlier? Measurement would be create (\"action\": \"C\", \"outcomeDesc\": \"Measurement\"), \"update\" would be (\"action\": \"U\", \"outcomeDesc\": \"Update\"), \"InitialiseDevice\" could be (\"action\": \"E\", \"outcomeDesc\": \"Device initialised\"), \"UnloadMeasurements\" could be (\"action\": \"E\", \"outcomeDesc\": \"Measurements unloaded\").<br>\nIf this is proper way to use AuditEvent it seems more flexible than provenance. I still don't know if it can be used because I need a link to top level observation because there can be several studies which are made by same practitioner. I hope i managed to explain my use case right.</p>",
        "id": 163972286,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1556009011
    },
    {
        "content": "<p>Actually, Provenance would point to every single new version created.  If you do an 'import' operation that creates 30,000 new records, in principle there should be a single Provenance that points to all 30,000 new resource versions.  There's no notion of parent-child inheritance with respect to Provenance (or much of anything at all) in FHIR.  AuditEvent would tend to work the same way.</p>",
        "id": 163996820,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556031135
    }
]