[
    {
        "content": "<p>In gforge ticket 13391, PA is in agreement that we want to be able to be able to include the boundary shape for a location, however we are not exactly sure how we should represent it.  There are competing standards for geo shapes (geoJSON, KML, GML, ArcGIS (which is proprietary, but common).  One option is to make the boundary shape a backbone element with a content-type + base64binary, so that folks can use any shape format they want.  However that makes exchanging shapes harder as all parties need to either pre-coordinate what format is used or support everything.  </p>\n<p>Do folks have any input or opinions on how we should include geo-shape representations?</p>",
        "id": 153934185,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1517413397
    },
    {
        "content": "<p>My main input: let's not provide a generic binary blob! It'd be better to define extensions for individual formats <code>boundsAsGeoJSON</code>, <code>boudnsAsKML</code>, etc).</p>",
        "id": 153934186,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517413605
    },
    {
        "content": "<p>Better than than, I'd like to see if we can \"pick one\" preferred way.  <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> if you got to pick, do you know what it'd be?</p>",
        "id": 153934187,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517413648
    },
    {
        "content": "<p>PA considered having options because we don't know which format will win out.</p>",
        "id": 153934190,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517413797
    },
    {
        "content": "<p>As one hasn't \"won out\" in the past several decades, it is unlikely there will be one winner. There will likely always be several alternatives available.  The area I'm most worried about is if a new popular format arises.  If we pick a format now, we would be slow to respond to new formats.</p>",
        "id": 153934191,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1517414111
    },
    {
        "content": "<p>I wouldn't worry so much about future winners as I'd worry about functionality: what do we need, and is there a popular, well-supported, open standard today? If there's something good enough,  we should <a href=\"https://en.wikipedia.org/wiki/Satisficing\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/Satisficing\">satisfice</a>.</p>",
        "id": 153934195,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517414338
    },
    {
        "content": "<p>Looking at KML vs GeoJSON, the latter spec is ~1/10 the size; if it meets our requirements, that seems like a defensible choice.</p>",
        "id": 153934199,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517414541
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> Do you think it would be better to make it a standard extension?</p>",
        "id": 153934205,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517414771
    },
    {
        "content": "<p>If we pick one, standard extension seems better, as it give us more flexibility around changes once things go normative.  But I don't personally have a strong opinion about base spec vs. extension.</p>",
        "id": 153934223,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1517415713
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 153934224,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1517415740
    },
    {
        "content": "<p>If we can agree on a format, I'm happy for core, but certainly happy with a standard extension</p>",
        "id": 153934233,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1517418022
    },
    {
        "content": "<p>I'll do some digging and create some examples</p>",
        "id": 153934234,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1517418042
    },
    {
        "content": "<p>can we provide a blob, and a mime-type element for that blob?  This is how we solve in the Digital Security space, where there are many standards without a clear winner.</p>",
        "id": 153934327,
        "sender_full_name": "John Moehrke",
        "timestamp": 1517422349
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193299\">@Luke Duncan</span> , you have an interest in this. Do you have some thoughts?</p>",
        "id": 153934558,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1517498386
    },
    {
        "content": "<p>I'm no expert on the GIS side of things, but for my particular use case, all I need is a way to represent a polygon.  Do we want ways to represent other geometries?  For my case a list of lat/long coordinates would suffice, but perhaps that's too simple and maybe not enough information to turn that into something more complicated like KML.  There are tools that can be used to convert various formats so <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> 's suggestion would work for me.  I would also be happy for it to be in core for something similar to location.position, but a standard extension would also work.</p>",
        "id": 153934733,
        "sender_full_name": "Luke Duncan",
        "timestamp": 1517511072
    },
    {
        "content": "<blockquote>\n<p>As one hasn't \"won out\" in the past several decades, it is unlikely there will be one winner. There will likely always be several alternatives available.  The area I'm most worried about is if a new popular format arises. </p>\n</blockquote>\n<p>The new popular format _is_ GeoJson.  :)</p>\n<p>As an aside, I've implemented FHIR based geomapping with Google Maps and GeoJson with great success.  +1 for GeoJson.  KML will be needed for legacy pre-web GIS support.  But since FHIR is based on webstandards, focus should be on providing first class support for GeoJson.  </p>\n<p>As I've posted elsewhere, we may want to consider pulling in the GeoJson Spatial primitives, and positioning them next to Datatypes.... Point, Multipoint, Line, Circle, etc.     And then defining a Map resource (which is essentially what a geojson file already is).  </p>\n<p>I have pilot ready apps if anybody is interested.  They support geoshapes for boundaries of counties, health service areas, neighborhoods, paratransit/ambulance routes, etc. etc.  All the good stuff (licensable though; not free; gotta pay the rent).</p>",
        "id": 153935178,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1517757557
    },
    {
        "content": "<p>why would we define a Map resource if geoJson exists?</p>",
        "id": 153935207,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517776296
    },
    {
        "content": "<p>Can we convert the geoJason to XML and RDF?</p>",
        "id": 153935219,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517780168
    },
    {
        "content": "<p>I wouldn;t suggest that we did try to make the map datatype a fhir datatype, and just use the appropriate 3rd party standard with the widest most appropriate support.<br>\nOthers will need to be mapping to/from that anyway.</p>",
        "id": 153935220,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1517784141
    },
    {
        "content": "<p>It does mean that the XML people will need to be able to parse JSON - is that going to create any challenges?</p>",
        "id": 153935221,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1517784257
    },
    {
        "content": "<p>I personally don't think that the lack of XML support in GeoJson is enough to justify us buying into duplicating the format</p>",
        "id": 153935222,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517787048
    }
]