[
    {
        "content": "<p>Hi!<br>\nI have a question about a design solution for Inspired oxygen.</p>\n<p>The use case is that we would like to communicate if a patient has received supplemental oxygen or not. We want to use an observation-profile that is contained within an observation saturation profile.</p>\n<p>The inspired oxygen information we want to communicate is if the patient has received oxygen or not aswell as the flow rate of that oxygen if the patient has received oxygen. <br>\nAs we see it there can be different solutions for sending this information. </p>\n<p>Solution 1: </p>\n<ol>\n<li>Add value set in observation.code.coding.code that holds two codes telling that the patient has either received oxygen or not received oxygen.</li>\n<li>Add the flow rate as a ValueQuantity in observation.value.</li>\n</ol>\n<p>Comment: We would rather use a Snomed CT code of the type <em>Observable entity</em>. In this solution we would need to send codes of the type <em>finding</em>. </p>\n<p>Solution 2:</p>\n<ol>\n<li>Add a code (observable entity) for Inspired oxygen in observation.code.coding code</li>\n<li>Add either a value set or a boolean for saying that the patient has received oxygen or not in observation.component</li>\n<li>Add the flow rate as a valueQuantity in a second observation.component. </li>\n</ol>\n<p>Comment: Is this a valid use of the component elements in an observation profile?</p>\n<p>Is there anyone else that has implemented or done a profile for inspired oxygen or that have some input if this is a valid use of the components in an observation profile?</p>\n<p>Thank you!</p>",
        "id": 231446692,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1616494406
    },
    {
        "content": "<p>If you have a flow rate, why do you need a boolean?  Could you ever have a boolean of false and a flow rate &gt; 0?  It seems they are both separate observations and the assertion of \"has received\" would be derived from the flow rate?</p>",
        "id": 231468380,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616505614
    },
    {
        "content": "<p>Hi, thank you for your answer <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . <br>\nWe need to support the use case where we do not have a flow rate but only the information if the patient has received oxygen or not. We also want the profile to be as similar to the openEHR archetype as possible, even if we only support flow rate and if the patient has received oxygen or not: <a href=\"https://ckm.openehr.org/ckm/archetypes/1013.1.393/mindmap\">https://ckm.openehr.org/ckm/archetypes/1013.1.393/mindmap</a></p>",
        "id": 231480918,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1616510393
    },
    {
        "content": "<p>It still seems like these are separate statements.  Patient is/was on oxygen.  Oxygen flow rate was X.  They could both be linked as part of a panel, but one isn't a 'qualifier' of the other where it can't make sense on its own.</p>",
        "id": 231482804,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616511067
    },
    {
        "content": "<p>see <a href=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-pulse-oximetry.html\">US Core Pulse Oximetry Profile</a></p>",
        "id": 231535220,
        "sender_full_name": "Eric Haas",
        "timestamp": 1616529988
    },
    {
        "content": "<p>make em components and call it a day.</p>",
        "id": 231535569,
        "sender_full_name": "Eric Haas",
        "timestamp": 1616530123
    },
    {
        "content": "<p>That profile is rather different.  It's saying \"their blood oxygen is at X\", but also conveying (and by the way, their getting 2 litres/minute of pure O2 to get their number that high) - which is an essential part of understanding the pulseox value.</p>\n<p>What Ludvig is asking for is \"is the patient on oxygen?\" and \"What's the flow rate?\"  The situation is not the same in terms of dependency and inability to interpret the one value without knowing the other.</p>",
        "id": 231536629,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616530576
    },
    {
        "content": "<p>Thanks for the discussion <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> ,<br>\nTo add more information, I also want to add how we handle the information in our system.<br>\nWhen adding oxygen saturation information, you can also add whether the patient has received oxygen or not. If 'Yes', you can also add the flow rate for that oxygen.</p>\n<p>Inspired oxygen information cannot stand alone in our system and is connected to the saturation archetype, similar to openEHR. The flow rate cannot be added unless we have already said that the patient is receiving oxygen.<br>\nIn a post scenario, if the flow rate was communicated from an external system without the response to \"is the patient on oxygen?\" we either do not listen to it or interpret it as if the patient has received oxygen because we are getting the flow rate.(We want to avoid this).<br>\nIn a get scenario, we would always communicate the inspired oxygen information \"if the patient is receiving oxygen\" and if so, there may be additional information about the flow rate if it was documented (not mandatory).<br>\nIn both scenarios, the inspired oxygen data will be information related to the saturation of the patient because it is stored internally in that archetype. We can only store the inspired oxygen data on our internal OxygenSaturation archetype.</p>\n<p>Today we intended to use a contained observation resource in the observationSaturation profile in one of the above formats. But I see and understand your arguments here. May I ask what you would recommend?</p>",
        "id": 231594408,
        "sender_full_name": "Ludvig Eek Hofmann",
        "timestamp": 1616571968
    },
    {
        "content": "<p>If you're sending an O2 sat, then sending \"yes, the patient was on oxygen\" as a component is completely reasonable (and sending the rate as a separate component).  The question is more about sending inspired oxygen on its own.  For that, the 'standard' observation would be the flow rate.  That's what most systems would expect to be in Observation.code and Observation.value.  If you need to send a flag that also says \"patient is on oxygen\", you could do so as a component, but that would be largely redundant.  Sending the flag as your root code and the flow rate as a component wouldn't be terribly interoperable because most systems looking for flow rate wouldn't expect to look for it in a component (except as a component of O2 sat).</p>",
        "id": 231627134,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616590197
    },
    {
        "content": "<p>Just FYI - premature infants are frequently on nasal cannula liter flow at varying rates delivering \"room air\".  Just the flow helps prevent apnea and bradycardia.</p>",
        "id": 231645195,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1616596836
    }
]