[
    {
        "content": "<p>Hi,</p>",
        "id": 153900896,
        "sender_full_name": "Shlomy Reinstein",
        "timestamp": 1502199441
    },
    {
        "content": "<p>I use HAPI FHIR, and would like to do the following: Search for some DiagnosticReport resources, and include all the Procedure resources which refer to these resources. It seems like _revinclude cannot be used in this case, so currently we first search for the DiagnosticReports, and then, sequentially, search for all Procedure resources of the same patient, and filter out those which refer to the DiagnosticReports that were found.</p>\n<p>Is there a way to do this in a transaction? Can I make the original DiagnosticReport search request (which may or may not contain a \"patient\" parameter in the search criteria) <em>and</em> the other search request (for all procedures of the patient) in the same transaction? Thanks!</p>",
        "id": 153900897,
        "sender_full_name": "Shlomy Reinstein",
        "timestamp": 1502199691
    },
    {
        "content": "<p>There's no ability for the results of one query within a transaction to populate variables that are used in the execution of a subsequent query in the same transaction.</p>",
        "id": 153901078,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502244242
    },
    {
        "content": "<p>Thanks! Any reason why _revinclude cannot bring all referencing resources? For a database-backed server, this should not be a problem. Why is it limited to particular fields? Same goes for search parameters and _include.</p>",
        "id": 153901433,
        "sender_full_name": "Shlomy Reinstein",
        "timestamp": 1502353055
    },
    {
        "content": "<p>FHIR doesn't presume the use of any particular persistence layer approach.  Each search parameter supported (whether for direct search or for including or reverse-including) may require code to be written to support that capability.  Implementations wishing to search/include/revinclude on alternate elements are free to define additional search criteria to allow declaration of additional search capabilities.</p>",
        "id": 153901618,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502377526
    }
]