[
    {
        "content": "<p>Hi all. I'm new to the list and have some questions right away. We're discussing which resource is most suitable to model the time a patient resides in the interventional (cath)lab, for instance for a PCI intervention. Thanks!</p>",
        "id": 153828457,
        "sender_full_name": "Roy van Pelt",
        "timestamp": 1463586608
    },
    {
        "content": "<p>sounds like an Encounter...</p>",
        "id": 153828467,
        "sender_full_name": "David Hay",
        "timestamp": 1463594419
    },
    {
        "content": "<p>Thanks David. That seems intuitive to me too. I'm a bit puzzled about the use of medication. If I would need to know all medication used during an encounter (say in the cathlab), how could I obtain that information? Would you follow the route of MedicationAdministrations for that encounter, or would you divide the period of time in the cathlab into procedures, which in turn reference the Medication resource?</p>",
        "id": 153828843,
        "sender_full_name": "Roy van Pelt",
        "timestamp": 1463743299
    },
    {
        "content": "<p>MedicationAdministration is the intent. But you'd have to check that all of them were actually recorded</p>",
        "id": 153828845,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463743627
    },
    {
        "content": "<p>Great. Of course it is up to the user to check completeness. So where do you see the relation between Procedure and Medication stepping in? Is it the intend to divide an encounter into procedures, e.g., diagnostic and therapeutic?</p>",
        "id": 153828850,
        "sender_full_name": "Roy van Pelt",
        "timestamp": 1463744662
    },
    {
        "content": "<p>Can anyone comment on the intended use of Procedure in this context, also in relation with Medication?</p>",
        "id": 153829203,
        "sender_full_name": "Roy van Pelt",
        "timestamp": 1463983991
    },
    {
        "content": "<p>I think you can link Procedure and Medication using Encounter.</p>",
        "id": 153829366,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464037295
    },
    {
        "content": "<p>Indeed there is a link between Procedure and Medication - that is useful. Just wondering if I can query the administered medication per procedure, assuming there can be multiple procedures per Encounter.  The same holds for observations by the way. How can I know which Observations are performed during a certain Procedure?</p>",
        "id": 153829597,
        "sender_full_name": "Roy van Pelt",
        "timestamp": 1464089610
    },
    {
        "content": "<p>timestamps tell all...</p>",
        "id": 153829601,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464092305
    },
    {
        "content": "<p>often with procedures there is anaesthetist giving medication independent of the main procedure...</p>",
        "id": 153829602,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464092372
    },
    {
        "content": "<p>and then nurse will step up and slip a suppository up the nethers...</p>",
        "id": 153829603,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464092416
    },
    {
        "content": "<p>but on reflection I can see a need to tie a medication administration directly to a procedure...</p>",
        "id": 153829606,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464093115
    },
    {
        "content": "<p>We were at some point thinking in that direction as well. I see your point that some tasks, e.g., anaesthesia, can be performed independent of the main procedure. These should be related to the Encounter. However, other tasks (e.g., MedicationAdministration or Observation) will be part of the Procedure, and there is no way to distinguish from the other tasks purely on timestamps.</p>",
        "id": 153829607,
        "sender_full_name": "Roy van Pelt",
        "timestamp": 1464093126
    },
    {
        "content": "<p>looking here for example <a href=\"https://www.hl7.org/fhir/valueset-route-codes.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-route-codes.html\">https://www.hl7.org/fhir/valueset-route-codes.html</a></p>",
        "id": 153829608,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464093173
    },
    {
        "content": "<p>Indeed, that would require the possibility to tie MedicationAdministration and Observation instances to Procedure. Or am I missing something?</p>",
        "id": 153829609,
        "sender_full_name": "Roy van Pelt",
        "timestamp": 1464093179
    },
    {
        "content": "<p>i agree <span class=\"user-mention\" data-user-id=\"192051\">@Roy van Pelt</span> </p>",
        "id": 153829610,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464093200
    },
    {
        "content": "<p>there are many nerve blocks being a clear example</p>",
        "id": 153829611,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464093251
    },
    {
        "content": "<p>sometimes (especially children) an entire anaesthetic is simply to give a medication (eg chemo into the csf via a lumbar puncture)</p>",
        "id": 153829612,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464093315
    },
    {
        "content": "<p>and its not too unusual for surgeons to apply/inject a medication directly into wherever they are</p>",
        "id": 153829613,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464093392
    },
    {
        "content": "<p>eg the opthamologists inject antibiotics below the conjunctiva</p>",
        "id": 153829614,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464093435
    },
    {
        "content": "<p>when the obstetricians are unhappy they inject things directly into the uterus</p>",
        "id": 153829615,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464093470
    },
    {
        "content": "<p>(ie during a Caesarian)</p>",
        "id": 153829616,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464093489
    },
    {
        "content": "<p>theoretically a combination of expanded route codes and the timestamp would capture all this (together with who administered)</p>",
        "id": 153829617,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464093563
    },
    {
        "content": "<p>Thanks, these are interesting examples. These seem to relate mainly to access routes. It seem Procedures as such can be used in a broader scope as well, e.g., chemo treatment in your example.</p>",
        "id": 153829618,
        "sender_full_name": "Roy van Pelt",
        "timestamp": 1464093918
    },
    {
        "content": "<p>another example is use of contrast medium injected by surgeons</p>",
        "id": 153829619,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464093983
    },
    {
        "content": "<p>local anaestheics can be injected by both surgeons and anaethetists... often v close to the maximum dose...</p>",
        "id": 153829620,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464094055
    },
    {
        "content": "<p>vascular surgeons commonly inject contrast, as do general surgeons doing cholecystectomies, and urologists doing RPGs...</p>",
        "id": 153829621,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464094225
    },
    {
        "content": "<p>gynaes use blue die to look at fallopian tubes...</p>",
        "id": 153829622,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464094256
    },
    {
        "content": "<p>and breast surgeons inject blue dye below the nipple to find the \"sentinel node\"</p>",
        "id": 153829623,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464094294
    },
    {
        "content": "<p>it is interesting to ponder if the \"administrator + timestamp\" link is enough...</p>",
        "id": 153829624,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464094496
    },
    {
        "content": "<p>Indeed <span class=\"user-mention\" data-user-id=\"192001\">@Erich Schulz</span>. There are many different situation that can occur, and it seems not all information can be resolved with the current references between the Resources. Perhaps the intended use is to query for all medication administered or observations during an Encounter, and if you want this divided per Procedure, you need to introduce your own Extension?</p>",
        "id": 153829628,
        "sender_full_name": "Roy van Pelt",
        "timestamp": 1464095094
    },
    {
        "content": "<p>I actually thinking that if you have \"who\" and \"when\" administered an agent then that is probably sufficent</p>",
        "id": 153829629,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464095186
    },
    {
        "content": "<p>the fact the same person was performing a procedure at the same time is the link</p>",
        "id": 153829630,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464095217
    },
    {
        "content": "<p>specifying the precise route of administration is a bit tricky </p>",
        "id": 153829631,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464095267
    },
    {
        "content": "<p>Perhaps \"Who\" and \"When\" is clinically sufficient indeed - I'm curious if this is the way it was intended in the specification? Using timestamps to find out the associated Procedure is a kind of reverse engineering for a lack of structure. Going via the Practitioner is an interesting thought, but seems a roundabout way of doing things.</p>",
        "id": 153829632,
        "sender_full_name": "Roy van Pelt",
        "timestamp": 1464096177
    },
    {
        "content": "<p>I think you need to use workflow in such complicated scenario. So you can have multiple ProcedureRequest paired with MeidcationOrder.</p>",
        "id": 153829667,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464102888
    },
    {
        "content": "<p>well its not that complicated a scenario really (at least it isn't a rare scenario by any means)</p>",
        "id": 153829689,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464128915
    },
    {
        "content": "<p>it's a recurring theme in records - much information is just a tranformation of some records into others</p>",
        "id": 153829691,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464128960
    },
    {
        "content": "<p>ie many \"conditions\" are simply a restating and summary of certain observations</p>",
        "id": 153829692,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464128999
    },
    {
        "content": "<p>the issue is how much redundant implied linkage to make -and how to achieve that reliably</p>",
        "id": 153829693,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1464129053
    },
    {
        "content": "<p>I know this is a simple case. The problem is that there is no direct link between these two resources.</p>",
        "id": 153829706,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464138159
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192051\">@Roy van Pelt</span> I have raised this question to Pharmacy WG. We will discuss this topic in next WG conference call on June 6th. I will get you updated.</p>",
        "id": 153829766,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1464185653
    },
    {
        "content": "<p>As part of a general pattern for \"event\" resources, the Workflow project is recommending that most/all of them have \"parent\" relationships, so you can indicate that a particular MedicationAdministration is \"part of\" a Procedure (or vice versa).  Note that this is a recommendation - it'll be up to the committees to decide whether to do so and whether to do so as a core element or an extension, based on what they see common practice to be.</p>",
        "id": 153830130,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1464304849
    },
    {
        "content": "<p>Thank you all for you kind responses. <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> : I'm looking forward to hear the result from the conference call. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> : my first impression is that this suggestion is a fair generalization. It would be great if each \"event\" resource has a \"part of\" relationship. For MedicationAdministration we're bound to the Encounter for now, but it would be convenient if that will become more flexible, and a relation to Procedures becomes possible as well. </p>",
        "id": 153832176,
        "sender_full_name": "Roy van Pelt",
        "timestamp": 1465476415
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192051\">@Roy van Pelt</span> The linkage to Encounter/EpisodeOfCare will remain as that's a different sort of assertion.  I expect the ability to have the \"partOf\" relationship will end up everywhere, though it may be extension in some places.</p>",
        "id": 153832184,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1465477797
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Do you suggest that Order/Request resource could have a parent/child relationship just like what Task resource has now?</p>",
        "id": 153832214,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1465506112
    },
    {
        "content": "<p>Not for \"request\" resources, no.  They have an \"in fulfillment of\" relationship, but we decided against allowing parent/child.</p>",
        "id": 153832228,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1465514497
    },
    {
        "content": "<p>What are the \"event\" resources you referred to?</p>",
        "id": 153832235,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1465517134
    },
    {
        "content": "<p>Things like Procedure, Observation, Encounter, etc.  Things that reflect actions rather than requests for actions.</p>",
        "id": 153832240,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1465518312
    },
    {
        "content": "<p>Now I understand. Thanks.</p>",
        "id": 153832241,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1465518357
    },
    {
        "content": "<p>That was very helpful, thanks. Continuing on the topic of 'event-type' resources, we see that for Medication there is a MedicationAdministration resource. In an interventional setting, a DeviceAdministration could be convenient resource as well (e.g., sheath, catheters). Has this been considered?</p>",
        "id": 153832703,
        "sender_full_name": "Roy van Pelt",
        "timestamp": 1465881950
    },
    {
        "content": "<p>I believe that's also event-type resource.</p>",
        "id": 153833004,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1465998416
    },
    {
        "content": "<p>Yes, indeed MedicationAdministration seems to be an event-type resource. However, DeviceAdministration does not currently exist, and I was wondering if such a resource was considered? It would be convenient in the interventional setting.</p>",
        "id": 153833250,
        "sender_full_name": "Roy van Pelt",
        "timestamp": 1466055713
    }
]