[
    {
        "content": "<p>I have a question regarding the ability for FHIR implementations based upon different FHIR releases, in particular, STU 3 and R4. </p>\n<p>Are the following assumptions correct?:</p>\n<ol>\n<li>The profiles included in an IG must all be based upon the same version of FHIR</li>\n<li>Extensions and constraints can be used to bridge known gaps or inconsistencies between base resources in different versions of FHIR</li>\n<li>An implementation can draw from different IGs based upon different versions of FHIR and take advantage of defined extensions and constraints to bridge any gaps or inconsistencies in the different versions of FHIR.</li>\n<li>A FHIR server can support only one version of FHIR at a time.</li>\n<li>An implementer implementing multiple versions of FHIR will need to use multiple FHIR servers, at least one for each version. </li>\n</ol>\n<p>These questions/assumptions are related to the BSeR IG. We have implementers interested in both the current balloted version of BSeR based upon FHIR STU3 and the next release of BSeR that will be based upon FHIR R4.</p>",
        "id": 179283649,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1572302807
    },
    {
        "content": "<ol>\n<li>at present this is true as a tooling limitation but there's ways to work around that. in the future this will be resolved and an IG will be able to constrain multiple versions</li>\n<li>true. </li>\n<li>true if the developer is prepared to do the work </li>\n<li>not true - please read <a href=\"http://hl7.org/fhir/versioning.html\" target=\"_blank\" title=\"http://hl7.org/fhir/versioning.html\">http://hl7.org/fhir/versioning.html</a></li>\n<li>also not true, depending on how you implement</li>\n</ol>",
        "id": 179283815,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1572302976
    },
    {
        "content": "<p>One thing that is true is that solutions supporting multiple versions for a single data repository will need to perform different mappings to convert between the versions they support and whatever their internal persistence layer looks like.  In some cases, differences between FHIR releases for certain resources may make that challenging.</p>",
        "id": 179297157,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572319430
    }
]