[
    {
        "content": "<p>I am trying to map an intermediary organization in Communication.  I see that receiver max is * .  I am considering an extension indiicate an intermediate receiver who distributes an electronic document to the ultimate recipient.   E.g,  State Public Health Agency X receives a case report and forwards to the appropriate county Public Health Agency Z.  ... or... is this more of a Provenance thing?</p>",
        "id": 153898897,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501197013
    },
    {
        "content": "<p>Indirect delivery is more of a messaging thing.  Communication should be about end recipients, not routing.  Routing would be the responsibility of the transport layer.</p>",
        "id": 153898954,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501220799
    },
    {
        "content": "<p>Public health Case reports pass through more than  one organization and jurisdictional authority and there is a need to track that</p>",
        "id": 153898981,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501228233
    },
    {
        "content": "<p>But wouldn't that tracking be with AuditEvent or Provenance?</p>",
        "id": 153898983,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501230415
    },
    {
        "content": "<p>Tracking the pathway as it happens would be AuditEvent or Provenance. But Eric, are you looking for a way to specify that pathway (routing list) prior to starting down the path?</p>",
        "id": 153899181,
        "sender_full_name": "John Moehrke",
        "timestamp": 1501246356
    },
    {
        "content": "<p>That is my question.  is the intermediary  ( e.g., a state PHA that looks at  case report then forwards it to county PHA ) represented in Communication.reciever or as a Provenance or AuditEvent.)</p>",
        "id": 153899412,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501290717
    },
    {
        "content": "<p>For more context:</p>",
        "id": 153899413,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501290735
    },
    {
        "content": "<p>Case Report originates from provider A ---&gt; jurisdiction B ----&gt; jurisdiction C</p>",
        "id": 153899414,
        "sender_full_name": "Eric Haas",
        "timestamp": 1501290789
    }
]