[
    {
        "content": "<p>We are looking displaying Condition data in our UI and obviously want to include the clinical status. However, the clinical status seems of limited use unless one knows when it was asserted. However (at least for R4), it is perfectly valid to have a Condition without any date information  (i.e. none of <code>onset[x]</code>, <code>abatement[x]</code>, or <code>recordedDate</code> present). Some IGs profile require <code>recordedDate</code> (e.g. <a href=\"https://simplifier.net/medizininformatikinitiative-moduldiagnosen/diagnose\">the German medical informatics initiative profile</a>), but e.g. IPS allows \"timeless\" conditions. </p>\n<p>My question is: Are there any guidelines/experience for dealing with <code>Observation.clinicalStatus</code> (especially \"active\") in the following cases:</p>\n<ul>\n<li>No time time information whatsoever</li>\n<li>Only <code>onset[x]</code> provided</li>\n</ul>\n<p>(I found <a href=\"#narrow/stream/179166-implementers/topic/use.20of.20Condition.2EclinicalStatus\">a related thread</a> but din't quite find the answers there.)</p>",
        "id": 236697048,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1619710943
    },
    {
        "content": "<p>There's a proposed change request to add a \"lastVerified\" or similar date.  However, the reality is that sometimes you'll have a record and have no dates - obviously not as useful as having them, but better to know it's \"possibly still relevant\" or \"happened at some point\" than to have no information at all.</p>",
        "id": 236700504,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619712258
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - we will find a way.</p>",
        "id": 236956548,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1619865164
    },
    {
        "content": "<p>I will also add that \"happened at some point\" is sufficient for a lot of requirements so \"limited use\" is fairly limited.  :)</p>\n<p>Not arguing against the proposed change though.  Completely agree having the option to have the date would be a good thing.</p>",
        "id": 236970912,
        "sender_full_name": "Rob Reynolds",
        "timestamp": 1619878724
    },
    {
        "content": "<p>Out of curiosity: I see that in moving from STU3 to R4, the field <code>assertedDate</code> was replaced by <code>recordedDate</code> (with an associated change of meaning from assertion to recording on system). With the proposed change <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  mentions, it seems one would come back to smt.  close to the STU3-field. What was the motivation for moving away from it with R4?</p>",
        "id": 237167147,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1620051411
    },
    {
        "content": "<p>Assuming we are talkind about Condition and not Observation.  I'd say the reason was to align with the workflow patterns  which occurred at that time.</p>",
        "id": 237184709,
        "sender_full_name": "Eric Haas",
        "timestamp": 1620057509
    },
    {
        "content": "<p>Also, the word \"asserted\" can be a bit misleading in terms of what it means.  'reported' is clearer.</p>",
        "id": 237188693,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1620059277
    },
    {
        "content": "<p>OK, thanks!</p>",
        "id": 237201897,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1620064701
    }
]