[
    {
        "content": "<p>Hi everyone,<br>\n<span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span>  and I just had a discussion about how to interpret the section in the FHIR specification about case and accent normalization.<br>\nIt states that when executing a search with a string parameter, accents should be normalized as a default behavior.  Could someone please elaborate if this is intentionally restricted to only accents and not other diacritical signs like circumflex, cedilla, etc? From my understanding, these glyphs would technically not be an accent.</p>\n<p>Thank you!</p>",
        "id": 153953590,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1524490960
    },
    {
        "content": "<p>It's intended to apply to all diacritical signs.   I.e. search would only be on the base alphabetic characters A-Z.  If you submit a change request, we can clarify in the spec</p>",
        "id": 153953640,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524497295
    },
    {
        "content": "<p>Thanks for the clarification. Will do.<br>\nBased on this, am I right to assume that :exact matches if the string is visually identical? So, even if different Unicode characters are used to form a letter, a server is expected to return a result? E.g. the search for \"ä\" (U+00E4 LATIN SMALL LETTER A WITH DIAERESIS) would match even if the search requests contains \"ä\" (U+0061 LATIN SMALL LETTER A + U+0308 COMBINING DIAERESIS)?</p>",
        "id": 153953655,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1524502782
    },
    {
        "content": "<p>Exact match would do whatever your language does when you do a String.equals(x).  I <em>presume</em> that they look for exact unicode matches, but I don't know for sure.</p>",
        "id": 153953656,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524504825
    },
    {
        "content": "<p>Would you be in favour of additionally adding a sentence stating that the handling of :exact is within the discretion of the server?<br>\nI just did a quick test, you will definitely get different results across implementations.</p>",
        "id": 153953670,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1524508290
    },
    {
        "content": "<p>That's probably a good idea.</p>",
        "id": 153953671,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524508374
    },
    {
        "content": "<p>How come others haven't ran into it already? This seems like a big problem. Is it just that the normal expectation right now is that the special characters just don't work so people don't bother?</p>",
        "id": 153953813,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1524552207
    },
    {
        "content": "<p>Could someone please activate my GForge account?</p>",
        "id": 153953815,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1524553444
    },
    {
        "content": "<p>Looks like you've already been approved.  Let me know if you have issues.</p>",
        "id": 153953914,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1524585849
    },
    {
        "content": "<p>Added GForge Item #16016 and #16017.<br>\nThank you for discussing this :)</p>",
        "id": 153954266,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1524657410
    }
]