[
    {
        "content": "<p>Has anyone ever had to deal with a Locations (e.g. a ward) that are associated with multiple organizations (e.g. an interdiciplinary ward)?<br>\nIt is vital for us to have a link between the Encounter and the Organization. So far we did this through Encounter.Location.managingOrganization. But now we hit a wall because some wards are used by different Organizations.<br>\nOur initial idea was instead of \"hardwiring\" Location and Organization to rather reference the Organization through Encounter.serviceProvider.<br>\nBut the problem is, that Encounter.serviceProvider is not a searchable attribute and we need to be able to select Encounters by Organization. Anyone have an idea?</p>",
        "id": 153843931,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471274437
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> Organization is the group of people responsible.  So if something goes wrong in the ward, both departments are at fault?  I think you're probably looking at extension space, either an extension on Encounter to allow a list of responsible organizations, or an encounter on Organization to indicate that the Ward organization is part of two organizaitons</p>",
        "id": 153843935,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1471276298
    },
    {
        "content": "<p>I think it definitely makes sense to pin the Organisation to the Encounter (where the relationship would always be 1..1) rather than at the Location as we do now. The problem ist just that it isn't a search parameter. What are my chances of getting a change request through?</p>",
        "id": 153843943,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471280026
    },
    {
        "content": "<p>Don't know.  Never hurts to ask and present the use-case :)</p>",
        "id": 153843944,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1471281209
    },
    {
        "content": "<p>Looking forward to hearing the use case.<br>\nAnd how the relationship between the org and location heirachies is in this case. (and which point in the tree you want to attach the encounter)</p>",
        "id": 153843963,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1471295822
    },
    {
        "content": "<p>Situation is the following: Hospital has differnt wards (e.g. S1, P2, ICU), and differnent departments (Surgical, Gastro-Enterology...). <br>\nEach of these wards (Locations)  is associated with a department (We have this modeled as Location.managingOrganization) who's in charge of the ward.<br>\nBUT: The Patients treated in some of these wards, may not be associated with the same Department as the ward. Especially ICUs are often shared between different departments. So the Location \"ICU\"'s managingOrganization may be \"Surgical\" but some patients therein may actually be from the GE department. <br>\nHowever, it is crucial that we are able to distinguish/filter the Encounters by Department. Up until now we did this through Encounter.location.organization but that gives false results if the ICU Patient is from a different department than the one the ward is associated with. <br>\nTo resolve this, we are now planning to put the Patient's (or rather the Patient's Encounter's) department in Encounter.serviceProvider  - which IMO makes a lot more sense that our initial approach.<br>\nThe only issue is (and that's unfortunately a dealbreaker) that Encounter.serviceProvider is not a search parameter. So our requirement to search and filter by department is not satisfied. </p>",
        "id": 153844009,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471334712
    },
    {
        "content": "<p>you can define your own search parameters</p>",
        "id": 153844010,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471334769
    },
    {
        "content": "<p>Hm. I guess I could. But this is a very common use case, at least in Germany. So I'd like to hear from other user's around the globe.  if it's as common in their realm as in ours, I think it should be considered for core.</p>",
        "id": 153844011,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471334925
    },
    {
        "content": "<p>I think it's core. Absolutely. PV1 has both location and unit, which is what you're talking about. And shared wards are everywhere I've ever been in Australia</p>",
        "id": 153844012,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471334971
    },
    {
        "content": "<p>and filtering by ward and unit are obvious things to do in any workflow support</p>",
        "id": 153844013,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1471334986
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10462\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10462\">GF#10462</a></p>",
        "id": 153844030,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471467995
    },
    {
        "content": "<p>With that additional information I hope you've created a tracker item for PA, thanks.</p>",
        "id": 153844031,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1471467998
    },
    {
        "content": "<p>P.S. Sounds like you have some test data, any you'd be able to share with the specification/community for reference?</p>",
        "id": 153844032,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1471467999
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153844071,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471468015
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153844225,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1471504274
    }
]