[
    {
        "content": "<p>Hi all,<br>\nWe are working on Health care project which uses FHIR R4 . can any one help for a little introduction how to start implementing that. Thanks in advance</p>",
        "id": 205467573,
        "sender_full_name": "TTNJyothi",
        "timestamp": 1596109110
    },
    {
        "content": "<p>Hi there (and probably welcome). <br>\nI think a few more details are helpful:</p>\n<ul>\n<li>Which part are you implementing: a FHIR-server, a client using FHIR, or both? </li>\n<li>Do you have any constraints or plans as to other framework, language etc.?</li>\n</ul>\n<p>I ask because there are already some APIs which might be used, e.g. hapi. The answer where to start might depend on your thoughts and constraints.</p>",
        "id": 205467979,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1596109471
    },
    {
        "content": "<p>Thank you for the reply. Here are the details <br>\n    . We are looking for both(Client and Server)<br>\n    . We are using .net framework</p>",
        "id": 205469671,
        "sender_full_name": "TTNJyothi",
        "timestamp": 1596110814
    },
    {
        "content": "<p>Hi all, <br>\nSame question here, I've been involved in a few mappings between v2 and FHIR in both directions earlier, but now we'll start building a new product from scratch. The product consists of:</p>\n<ul>\n<li>a FHIR-server part for storage of the data (should be installed on-prem, data storage on a SQL server)</li>\n<li>an in-hospital client webapp (for the clinical staff, with both read and write access)</li>\n<li>a mobile webapplication for the patients (running in cloud, with server/server access to the FHIR-server, with both read and limited write access).</li>\n</ul>\n<p>We don't have a real constraint regarding Java / .Net, both are possible.</p>",
        "id": 205470083,
        "sender_full_name": "Lieven Peeters",
        "timestamp": 1596111115
    },
    {
        "content": "<p>Thank you.</p>\n<p>There is a <a class=\"stream\" data-stream-id=\"179171\" href=\"/#narrow/stream/179171-dotnet\">#dotnet</a> stream in zulip where you might find further information. Unfortunately I don't work with .net, so I can't help you any further, but I hope some others might help you. </p>\n<p>For Java, there is HAPI, and there is also a <a class=\"stream\" data-stream-id=\"179167\" href=\"/#narrow/stream/179167-hapi\">#hapi</a> stream which might be interesting.</p>\n<p>Then in general the following links might help you, depending on your knowledge about FHIR (recommendation inside another stream) :</p>\n<blockquote>\n<p>Please read the 'first time here' section of <a href=\"http://hl7.org/fhir/\">http://hl7.org/fhir/</a> , and view videos such as FHIR for Executives (TED-like talk), <a href=\"https://vimeo.com/112905640\">https://vimeo.com/112905640</a> (April 2019), and Introduction to FHIR (general IT audience), <a href=\"https://vimeo.com/199173771\">https://vimeo.com/199173771</a> (June 2016).</p>\n</blockquote>\n<p>In general the following stream might help you to understand the different ways of communicating and information gathering, which you correctly started by asking here: <a href=\"#narrow/stream/179166-implementers/topic/community\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/community</a></p>\n<p>For further guidance others might be of more help.</p>",
        "id": 205470862,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1596111610
    },
    {
        "content": "<p>You might want to check out Firely. They offer a FHIR .NET API that \"is typically used by .NET developers who want to build their own FHIR client, server or add-on and who want to be sure to be FHIR compliant without having to implement the basis and more advanced FHIR features themselves.\" I have never used it as I am a newbie, but it might be a good starting point for you.</p>",
        "id": 205492738,
        "sender_full_name": "Michael E Campbell",
        "timestamp": 1596122622
    },
    {
        "content": "<p>Take a look of this page. It listed FHIR development package for many programming languages:<br>\n<a href=\"https://confluence.hl7.org/display/FHIR/Open+Source+Implementations\">https://confluence.hl7.org/display/FHIR/Open+Source+Implementations</a><br>\n<span class=\"user-mention\" data-user-id=\"326285\">@TTNJyothi</span> <span class=\"user-mention\" data-user-id=\"250774\">@Lieven Peeters</span></p>",
        "id": 205494823,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1596123649
    }
]