[
    {
        "content": "<p>I am a business analyst/data analyst and have been tasked with learning about FHIR servers (not exactly my wheelhouse). I think I've found some good articles but am not sure whether I'm on the right track, and haven't been able to find a FHIR server overview diagram.  These are my current findings:<br>\n   a. Server receives a request from a client<br>\n   b. Server validates request URL<br>\n   c. Server routes the request through a handler (POST, GET, PUT, DELETE)<br>\n   d. Handler extracts, parses and validates request body to ensure valid XML/JSON<br>\n   e. Handler performs any necessary parameter validation<br>\n   f. Handler accesses the resource type in the database (insert, select, update, delete)<br>\n   g. Handler uses profile strings to map returned data (and complex data types) and success/failure code to XML/JSON<br>\n   h. Examples of profile strings (aka request handler functions?):</p>\n<div class=\"codehilite\"><pre><span></span><code>  - fhir/mappings/Db_to_XML/patient\n  - fhir/mappings/Db_to_JSON/patient\n  - fhir/mappings/XML_to_Db/patient\n  - fhir/mappings/JSON_to_Db/patient\n</code></pre></div>\n\n\n<p>i. Server returns result to client<br>\nThanks to:  <a href=\"https://help.interfaceware.com/v6/fhir-client-and-server\">https://help.interfaceware.com/v6/fhir-client-and-server</a></p>",
        "id": 199185882,
        "sender_full_name": "David Reeves",
        "timestamp": 1590773540
    },
    {
        "content": "<p>How FHIR servers work is an internal 'detail', and for sure there are a lot of different ways to implement one - the FHIR specs describe the outside behavior: which requests are valid, what is the expected response, and FHIR server implement that as they see fit</p>",
        "id": 199186409,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1590773813
    },
    {
        "content": "<p>The FHIR specification itself is a good starting point for learning about FHIR.<br>\n<a href=\"https://hl7.org/fhir/\">https://hl7.org/fhir/</a></p>\n<p>It includes introductory documentation targeted toward various audiences, and specification details organized into modules.</p>\n<p>The Exchange module contains details about data exchange methods, including the RESTful API.<br>\n<a href=\"https://hl7.org/fhir/exchange-module.html\">https://hl7.org/fhir/exchange-module.html</a></p>",
        "id": 199452607,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1591077201
    },
    {
        "content": "<p>Hi all, I am trying to implement an FHIR server in Golang as an educational exercise. I started off by writing datatypes and the Patient resource by hand, but I noticed that other server implementations, like <a href=\"https://github.com/grahamegrieve/fhirserver\">https://github.com/grahamegrieve/fhirserver</a>, generate the code. What files are used to generate the code for an FHIR server? Is it the FHIR definitions at <a href=\"https://www.hl7.org/fhir/downloads.html\">https://www.hl7.org/fhir/downloads.html</a>? I guess I am looking for guidance on what parts of the server can be generated and how that is done in general terms.</p>",
        "id": 199509787,
        "sender_full_name": "Jakub Kaczmarzyk",
        "timestamp": 1591111741
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197072\">@Paul Church</span></p>",
        "id": 199512737,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591112991
    },
    {
        "content": "<p>I don't know if you consider it \"cheating\", but you might have a look at this Go FHIR implementation: <a href=\"https://github.com/eug48/fhir\">https://github.com/eug48/fhir</a></p>\n<p>It's forked from a project I originally worked on a few years ago.  When we initially built the GoLang FHIR server, we hooked into the Java FHIR build process to generate models (among other things).  If I were to do it today, I'd definitely generate code from the published StructureDefinitions instead.  I'm not sure how the forked implementation handles code generation, but they definitely improved on our original implementation (which we no longer maintain) in several other areas -- so if you're going to check one out, do check out the fork I linked above.</p>",
        "id": 199514870,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1591113895
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> - I will take a look at that fork, and I will try to generate code using the StructureDefinitions.</p>",
        "id": 199761856,
        "sender_full_name": "Jakub Kaczmarzyk",
        "timestamp": 1591283679
    },
    {
        "content": "<p>What is the difference between creating a database based on the FHIR resources model and using something like MuleSoft or MIRTH (from NextGen) to access the data, versus using a FHIR server?  Or are MuleSoft and MIRTH also FHIR servers?  Obviously I'm pretty new to this (and probably just as obvious I'm out of my depth) and the reason I'm asking is we are wondering whether to be FHIR conformant we need an actual FHIR server...</p>",
        "id": 199922466,
        "sender_full_name": "David Reeves",
        "timestamp": 1591384836
    },
    {
        "content": "<p>Most FHIR implementations don't have FHIR-based data bases.  Most convert between their internal data models and the FHIR API - whether they do that using an interface engine or custom code depends on the implementation.</p>",
        "id": 199924680,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591386109
    },
    {
        "content": "<p>Thanks Lloyd, and when you say \"custom code\" you're referring to a FHIR server, right?<br>\nAnd when you say an interface engine, would they still have a Capability Statement, IG's, profiles, etc.?</p>",
        "id": 199930394,
        "sender_full_name": "David Reeves",
        "timestamp": 1591389142
    },
    {
        "content": "<p>Which kind of system do you have that should be made 'FHIR conformant'? an EHR ? A patient app? A...?</p>",
        "id": 199932276,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1591390105
    },
    {
        "content": "<p>Thanks Michele, we are integrating data from a community care EHR, primary care EMR and a wound care system into a new Operational Data Store (ODS) with a data model based on FHIR resources.</p>",
        "id": 199933914,
        "sender_full_name": "David Reeves",
        "timestamp": 1591391009
    },
    {
        "content": "<p>So is this new operational data store that should be FHIR conformant? Then it needs to have a FHIR API on top of it - ie it should be a FHIR server (that if the data model is already based on FHIR should not be too difficult)</p>",
        "id": 199934785,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1591391611
    },
    {
        "content": "<p>Thanks Michele. Yes, it is our new Community Care ODS that should be FHIR conformant. And if we do not implement a FHIR server (and instead use MuleSoft or something like that), would we not say it is FHIR conformant?</p>",
        "id": 199935700,
        "sender_full_name": "David Reeves",
        "timestamp": 1591392200
    },
    {
        "content": "<p>From a cursory web scan, it looks like MuleSoft is capable of exposing at least a limited FHIR API for some resources - whether it's sufficient for your needs, whether it is fully conformant and whether it supports the version(s) of FHIR you'll need, I don't know.</p>",
        "id": 199936293,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591392568
    },
    {
        "content": "<p>Can I use Spring boot rest instead of HAPI Plain Server? is there any particular thing I need to notice?</p>",
        "id": 200073505,
        "sender_full_name": "Steven Wang",
        "timestamp": 1591607544
    },
    {
        "content": "<p>This is a good question to raise on <a class=\"stream\" data-stream-id=\"179167\" href=\"/#narrow/stream/179167-hapi\">#hapi</a></p>",
        "id": 200104873,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591626494
    }
]