[
    {
        "content": "<p>Hi,<br>\nwe have a need for documenting involuntary commitments/ forced treatments (Involuntary commitment or civil commitment  - also known informally as sectioning or being sectioned in some jurisdictions, such as the United Kingdom - is a legal process through which an individual who is deemed by a qualified agent to have symptoms of severe mental disorder is ordered by a court into treatment in a psychiatric hospital (inpatient) or in the community (outpatient). )<br>\nIs information on these kind of decisions within scope of FHIR?</p>\n<p>Cheers,<br>\nøyvind</p>",
        "id": 173022631,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1565616194
    },
    {
        "content": "<p>I don't think that Provenance is your solution, but Provenance can record much of the reason behind why a resource was created or updated. Thus it might be useful to bind actions to cause. However I am unclear that this is what you were asking about.</p>",
        "id": 173024444,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565617532
    },
    {
        "content": "<p>Hi John, the question was maybe not so clear - most of it was a copy-pasted definition of the concept from Wikipedia :). To clarify - the question is what clinical (or maybe adminstrative?) resource is the most fit to describe the fact that a patient is hospitalized/ treated (normally for mental conditions) against the patients own will. So there is some kind of decision that overrides the patients normal rights to deny treatment. How can we represent these facts in FHIR?</p>",
        "id": 173090516,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1565679362
    },
    {
        "content": "<p>have you looked at the Encounter resource? This might be the right level of which to document these kinds of facts. You might think about using a specific encounter type or class.</p>",
        "id": 173109555,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1565700401
    },
    {
        "content": "<p>Hi Josh,   that could be an option. A consequence of this is that the decision then is bound to the Encounter. And normally this will be linked to some kind of encounter/intervention. If so - what kind of information could be profiled/extended to express the (legal) decision that is the background for the encounter and the subsequent procedures.  I was thinking that this (legal) decision maybe could be referenced on its own - as an independent entitity in order to communicate in all necessary setting that this patient now is under involuntary commitments/ forced treatment ....</p>",
        "id": 173120923,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1565708268
    },
    {
        "content": "<p>I don't think there would be a specific Resource type for this. I would expect that this is an exception case, and thus paper explaination would be used. Where that paper is captured in a DocumetReference. This DocumentReference could be referenced where ever it is needed to add emphasis. I don't think there is a LOINC defined document code for this, so possibly a locally defined code for the DocumentReference.type</p>",
        "id": 173123414,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565709963
    },
    {
        "content": "<p>Possibly a use of Consent that is got a Consent.performer that is the legal authority that is committing against the wishes. But even this would likely defer to Consent.sourceReference as the DocumentReference I mention above.</p>",
        "id": 173123523,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565710047
    },
    {
        "content": "<p>would be best to see how this use-case is done in paper world today. Guessing without that background is dangerous. Doing use-case analysis given that paper world is a good</p>",
        "id": 173123704,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565710163
    },
    {
        "content": "<p>The Consent resource with a use case of treatment would be a good start. Having the court order (or other document) attahced as Consent.sourceReference (or any other Consent.source) would be a good start.</p>",
        "id": 173124596,
        "sender_full_name": "David Pyke",
        "timestamp": 1565710736
    },
    {
        "content": "<blockquote>\n<p>The Consent resource with a use case of treatment would be a good start. Having the court order (or other document) attahced as Consent.sourceReference (or any other Consent.source) would be a good start.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> isn't that using consent to something other than a consumer’s choice?</p>",
        "id": 173132663,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565716806
    },
    {
        "content": "<p>In the case of court ordered treatment, consumer choice isn't the issue.  Consent has been \"given\" on their behalf via court order.</p>",
        "id": 173132734,
        "sender_full_name": "David Pyke",
        "timestamp": 1565716869
    },
    {
        "content": "<p>I think we need something to express permission. Consent is the consumer choice, so perhaps we need something else.</p>",
        "id": 173132773,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565716903
    },
    {
        "content": "<p>(I just took the Consent resource description, which states consumer choice)</p>",
        "id": 173132942,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565717029
    },
    {
        "content": "<p>I think I am struggelig togheter with Jose with what i perceive as a break with the fundamental semantics of the Consent resource (ref - A healthcare consumer's choices to permit or deny recipients or roles to perform actions for specific purposes and periods of time).  This is more or less the complete opposite - the healtcare consumer is stripped for all rights to choose. Maybe we can introduce a negation on the resource ;). DocumentReference.type is maybe a possibility - if there is no way to reference these semantics more directly? I could not find any SCT-codes for the two terms used in the stream-header either, but I expect this is a quite universal thing - and very important to document properly</p>",
        "id": 173148127,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1565727863
    },
    {
        "content": "<p>This is the first time the use case has been brought forward.  And while the description is about patient choice, when the patient is unable to choose (or a court chooses for them) we need to document that \"consent\".  A code added to the consent-category may be the first step in addressing this.  We meet at 2pm ET on Thursday (I know that may be late for you).  That would be the best time to discuss this case</p>",
        "id": 173152377,
        "sender_full_name": "David Pyke",
        "timestamp": 1565730987
    },
    {
        "content": "<blockquote>\n<p>Maybe we can introduce a negation on the resource ;). </p>\n</blockquote>\n<p>I really don't think we should do that.</p>",
        "id": 173167989,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565747095
    },
    {
        "content": "<p>I would gove one step back - why are we even looking at Consent resource?</p>",
        "id": 173168158,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565747329
    },
    {
        "content": "<p>The use case is: how do we document that the patient is there against their will, forced by a court?<br>\nThis is not security, this could more easily be encounter.class.</p>",
        "id": 173168250,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565747473
    },
    {
        "content": "<p>Thanks for the invitation David, I will do my best to be there. <br>\nCheers</p>",
        "id": 173191220,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1565778616
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span> <br>\nCommunity-Based Care and Privacy (CBCP) ?</p>",
        "id": 173191543,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1565779052
    },
    {
        "content": "<p>Yes, that' s us</p>",
        "id": 173198092,
        "sender_full_name": "David Pyke",
        "timestamp": 1565786088
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 173200048,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1565787711
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>Maybe we can introduce a negation on the resource ;). </p>\n</blockquote>\n<p>I really don't think we should do that.</p>\n</blockquote>\n<p>We do have negation in the Consent resource. Each rule is either a PERMIT or a DENY rule.   <br>\nFurther we do not constrain the policy upon which the Consent is built.</p>",
        "id": 173205898,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565791614
    },
    {
        "content": "<p>No question \"Consent\" is an overloaded term... What we have (and intend to support) is a resource that holds both consents and dissents, rules associated with a subject/patient for access to ...    \"PatientRules\" seems equally obscure...</p>",
        "id": 173206089,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565791740
    },
    {
        "content": "<p>or should we go back to a profile on Contract? We left Contract because it has overloaded term and because it is a very complex resource intended to cover a much broader space.</p>",
        "id": 173206840,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565792234
    },
    {
        "content": "<p>Well, if the encounter is involuntary, that would be in the encounter resource</p>",
        "id": 173210480,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565794773
    },
    {
        "content": "<p>That is the starting point, right?</p>",
        "id": 173210488,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565794783
    },
    {
        "content": "<p>Then we see where to put the legal justification</p>",
        "id": 173210588,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565794814
    },
    {
        "content": "<p>I proposed a different model that seems more linear, based on the notion of permission, of which an expression of consent can be an evidence.</p>",
        "id": 173210728,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565794925
    },
    {
        "content": "<p>I think some people would surely model this as an observation ... :) I would make our resource boundaries are clear. I do not see why consent came into this picture. Seemed a long stretch</p>",
        "id": 173210822,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565794992
    },
    {
        "content": "<p>If we keep adding stuff to the Consent resource, when is the time to evaluate the core concept? I pointed that the definition of the resource already seems to misalign with this case. We can update the definition, but that seems we are redefining the consent notion, not only adjusting the text.</p>",
        "id": 173211794,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565795622
    },
    {
        "content": "<p>Last week, <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> asked me to read the definition. That was clear but something was missing. <br>\nNow if the consent can also be used for court mandates it is no longer clear because that is not what it says in the box.</p>",
        "id": 173211900,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565795679
    },
    {
        "content": "<p>I think it is not the word that is overloaded, it is the concept that does not have a stable boundary.</p>",
        "id": 173211915,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565795692
    },
    {
        "content": "<p>also, keep in mind that for a latin brain, Consent means Agreement.</p>",
        "id": 173212092,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565795794
    },
    {
        "content": "<blockquote>\n<p>also, keep in mind that for a latin brain, Consent means Agreement.</p>\n</blockquote>\n<p>yes it is a problem. but there is not really a better word.. permission is also a positive word and wouldn't be understood as holding denials.</p>",
        "id": 173214961,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565797565
    },
    {
        "content": "<p>I have been dealing with this going back to IHE-BPPC profile.</p>",
        "id": 173215000,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565797592
    },
    {
        "content": "<p>Yes, but permission is also not what I would use in this case. I did not want to force \"permission\" as a solution, I just think consent is not a clear solution for this use case</p>",
        "id": 173229189,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565807407
    },
    {
        "content": "<p>Sorry I can't be more constructive than saying \"this could be a class of encounter, and we need to find a way to convene the mandate for that. It could be an extension</p>",
        "id": 173229331,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565807517
    },
    {
        "content": "<p>Or we can use an Episode of are which honestly sounds much more adequate semantically, and we could use something like .referralrequest instead of Consent. Point is that consent seems inadequate</p>",
        "id": 173229572,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565807653
    },
    {
        "content": "<p>(and on this thread I want to go back to the question and say we should have a better solution than stretching consent to fit the need</p>",
        "id": 173229938,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565807909
    },
    {
        "content": "<p>I think in this case, the root concept is spread across multiple resources - a Contract for the underlying paperwork/directives, a flag on the Encounter/CareEpisode. And the consent that works as per usual, but the author of the consent is not the patient, it's the court</p>",
        "id": 173260492,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565836407
    },
    {
        "content": "<p>The modeling question is if the part within Consent today that defines various PERMIT/DENY permissions, could be exteralized so that it could be used in Contract more naturally or in a more general \"business\" policy way.  The concept of a permission is an abstraction used throughout privacy, security, and business process. Thus it is potentially something that is standalone. <br>\nThe then question is if this need is specific to FHIR, or we should just use other standards such as XACML. The benefit of defining it in FHIR is that we can leverage the FHIR constructs and more naturally call out common FHIR vocabulary. The drawback is that one must convert this FHIR permission structure to another permission standard, such as XACML, in order to use a permission decision/enforcement engine.<br>\nNote that IHE, for XDS/XCA, defined a mapping of XDS metadata and such, into XACML vocabulary --- this is what the IHE APPC profile is all about.</p>",
        "id": 173299994,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565883436
    },
    {
        "content": "<p>Encounter represents a particular stay.  A given patient could be shuffled amongst multiple institutions all based on one court order - so Encounter is definitely <em>not</em> the ideal way to represent an involuntary commitment order.  I look at Consent as a record of permission - permission might well be granted by the patient themselves, their representative or the state.  And that might be part of the story here.  I.e. \"The state is giving permission for this to occur on the patient's behalf\" - just as a mother might give permission for a child to be immunized (over the child's vocal objections).  However, the actual order for treatment should be captured as a ServiceRequest - the same as an order/referral for psychiatric assessment/treatment would be represented in cases where the patient was fully on-board.  In summary, my recommendation:<br>\n- ServiceRequest (to indicate what sort of therapy is being ordered - and by whom) + Consent (to indicate that consent has been explicitly given by the state on patient's behalf, and potentially overriding the patient's express wishes).</p>",
        "id": 173698326,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566337074
    }
]