[
    {
        "content": "<p>At present IPS makes Patient.name.given and Patient.name.family as must-support, and have a constraint that there must be at least one of them (or both). </p>\n<p>I have made a comment that IPS should make Patient.name.text as mandatory (1..1) and must-support. I've said this because of cultural variance around the world that means that </p>\n<ul>\n<li>a consuming system can't know how to present the name correctly (where as the source always knows)</li>\n<li>not all the parts of the name go in given or family (it's a looong story)</li>\n</ul>\n<p>Also, in terms of CDA equivalence, you need HumanName.text to be the same. aince the CDA name allows for just a human name txt, and has the order fixed by virtue of the way the name works. In fact, you can just use an untyped part and bingo, you have HumanName.text</p>\n<p>So for this reason, I think that IPS should require source systems to fill out HumanName.text. It's easy to do, though, yes, it's a few bytes. But for a recipient, the name order is lost information is not present. Hence, I think it should be required.</p>\n<p>Finally, I'd like to make this as a base rule in IPA (International Patient Access, the UV equivalent of US-Core, focused on just patient access). Note, also, that US-Core doesn't mandate HumanName.text, or even make it must-support, since US has a globally fixed name order, though I think it still should.</p>\n<p>Finally, I made this comment on IPS after consulting several european countries who should comment in this thread.</p>\n<p>The editors aren't very keen about all this. I'll let them explain their reasoning.  <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> </p>\n<p>(US Core relevance: <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>)</p>",
        "id": 187193109,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580625178
    },
    {
        "content": "<p>Do we believe most systems have an ability to consume an unstructured name?  (Generating one obviously isn't problematic)</p>",
        "id": 187199295,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580638138
    },
    {
        "content": "<p>well, if they can consume the structured name, they will. but they can store or display an unstructured name plenty simply - web clients, in particular, will do that</p>",
        "id": 187199603,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580638714
    },
    {
        "content": "<p>I'd like to encourage anyone who has an opinion or a question on this to post something here today.  We would like to decide on the disposition for <a href=\"http://jira.hl7.org/browse/FHIR-24932\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-24932\">J#24932</a> (from Grahame) during Q2 tomorrow (Tuesday morning, Sydney time) in Patient Care WG.</p>",
        "id": 187221998,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1580681038
    },
    {
        "content": "<p>Hi Grahame,<br>\nthank for putting this question forward.</p>\n<p>I agree with you that having the .text field could help a correct visualization of the full name, but I still have doubts on having this as required field or allowing for having only the unstructured form.</p>\n<p>When we prepared the IG IPS CDA ballot we investigated with other affiliates in the IC if requesting to have given and family parts would be a problem; the answer we collected at that time was that even though for some countries the concept of \"family\" name is not totally appropriate; the concept of splitting the name in parts is appropriate.</p>\n<p>The only addiitonal requirement for support global interoperability was to include always the Alphabetic representation. </p>\n<p>The rules have been changed in the FHIR IG guide in order to align with the US core profile. (at least given or family should be given better both) .</p>\n<p>I could support the inclusion as reccomended field of the full name to better suppport the visualization. I'm afraid instead that having potentially only the unstructured name could be an issue. <br>\nThis is not infact what several solutions that I know expect to receive in order to be able to \"update their records\". <br>\nUsing IPS doesn't mean in fact only to visualize it (if this would be case no problems of having only the unstructured form). </p>\n<p>..But happy to learn from the other countries...</p>",
        "id": 187224888,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1580686599
    },
    {
        "content": "<p>From what I know, Chinese EHRs use fullname (name.text). Though the name has family and give but it is very rare to use (input and report) name in two pieces.</p>",
        "id": 187277439,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1580746936
    },
    {
        "content": "<p>Also Chinese regulation requires patient's full name be displayed as one field.</p>",
        "id": 187280854,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1580748871
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>.  So I think I can infer from your comment that you think IPS at least should allow for Patient.name.text to be populated alone (without 'family' or 'given')?  And I assume that you wouldn't have an issue with making Patient.name.text required in all cases as Grahame suggests?  Is that correct?</p>",
        "id": 187296593,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1580759206
    },
    {
        "content": "<p>Yes. that is correct.</p>",
        "id": 187303587,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1580763723
    },
    {
        "content": "<p>Interesting...this makes the solution more complex since other countries expect instead not to have only the unstructured name.</p>",
        "id": 187409752,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1580857458
    },
    {
        "content": "<p>yes. that's the problem with the <em>international</em> part of IPS</p>",
        "id": 187410018,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580857721
    },
    {
        "content": "<p>Sure - but <em>international</em> is, of course, the main point.</p>",
        "id": 187410077,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1580857798
    },
    {
        "content": "<p>For The Netherlands the structured name is the norm for Patient. Unstructured names occur in places like contact persons, doctors and then some. For unconscious persons you might have just an unstructured name initially, but that's not the IPS use case.<br>\nSeems to me that if an unstructured name is what any person/animal will always have, as the only string you have or generated from structured parts, and if it's deemed so important to always have it, it should be a datatype requirement for HumanName, and not a per IG decision.</p>",
        "id": 187410464,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1580858120
    },
    {
        "content": "<p>the question at this point is if we should give the burden to the creator (provide all the information that a receiver could expect) or to the receiver (uses what it receive)</p>",
        "id": 187411660,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1580859210
    },
    {
        "content": "<p>The point of sending something off to a receiver is that you want to tell him something useful. I lean towards putting the burden on the sender here</p>",
        "id": 187411741,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1580859278
    },
    {
        "content": "<p>Would it work if we propose an invariant of \"(name.given or name.family or name.text) must be provided\"? It prevents conflicts with US-Core and current IPS (and generally most international implementations today), supports mononym cultures through supplying of name.family or name.given only, and also supports Chinese EHR implementations as per Yunwei's comment. Any derivatives of IPS for national use still be conformant to that invariant.</p>",
        "id": 187415805,
        "sender_full_name": "Ken Sinn",
        "timestamp": 1580863708
    },
    {
        "content": "<p>we decided to mark HumanName.text as must-support and to strongly encourage it's use in narrative, while leaving the existing rule that at least one of given and family are mandatory. Well also add a note that a future version may make HumanName.text mandatory. </p>\n<p>that's s step short of what Ken proposed (and I wanted) but was a compromise based on input from existing systems that are very name part focused</p>",
        "id": 187422311,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580873084
    }
]