[
    {
        "content": "<p>Hello dear implementers, how many days of effort do you think is needed to implement the International Patient Summary exchange? I am trying to estimate. My current guess based on what I know is 2-4 months - am I right or too off? Thank you! Based on 1 developer , FHIR server , tools etc.</p>",
        "id": 228609148,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1614784697
    },
    {
        "content": "<p>That depends a lot on starting point.  What experience to the developers have with XML/JSON?  How closely aligned is current data to IPS constraints?  How much terminology mapping is needed?  Are you using a language that will let you take advantage of one of the reference implementations to help with parsing/serialization?</p>",
        "id": 228615004,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614786682
    },
    {
        "content": "<p>HAPI FHIR, Java. The plan is to do a pilot, a reference implementation.</p>",
        "id": 228615260,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1614786773
    },
    {
        "content": "<p>for example, we don't need or already have terminology. We need to accept prepared IPS, query the latest IPS or previous version of IPS.</p>",
        "id": 228615702,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1614786907
    },
    {
        "content": "<p>Are you just looking to render the document or do you need to do something specific with the discrete data?  Accepting, rendering, querying and displaying should take less than a week if you don't care about the discrete data.  How long the discrete data will take depends on how much you want to extract and how complex the structure and terminology mapping is to what your internal model is.  (Caveat - I don't usually write code and can't estimate worth beans... <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> )</p>",
        "id": 228616536,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614787163
    },
    {
        "content": "<p>That's already helpful, Lloyd :)</p>",
        "id": 228617646,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1614787503
    },
    {
        "content": "<p>It depends on your internal model - and how much of HAPI FHIR you are using (JPA, plain or simply as parser) and how much of the IPS you are going to support. Only MS or the whole shabang? Is the developer familiar with HAPI? What level of code quality are you aiming for? How much/little coverage are you willing to accept?</p>",
        "id": 228647794,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1614798115
    },
    {
        "content": "<p>All of these are good points.  And I think there aren't really very clear answers in the community (yet).  But my gut feeling is that you are probably in the ballpark from a technical perspective (although it may be between this and Lloyd's suggestion of a week).  Determining the related policy considerations may, of course, take much longer. ;)</p>",
        "id": 228650145,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1614798959
    },
    {
        "content": "<p>Good points from <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> . In addition, my experience to date, mapping to the IPS from an existing data model (based on the US CCR) that's currently rendered into CDA suggests that much of the development effort (which I'm doing, as a reality check, alongside the model mapping) will go into handling data quality issues. Ultimately, as nearly always with interoperability solutions, the major constraint and time-consumer is the quality of the source data in endpoint systems. I also expect that reaching consensus with all stakeholders on data filtering issues will be a lengthy process.</p>",
        "id": 228665131,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1614804421
    },
    {
        "content": "<p>Thank you! Yes, I agree, the effort to map something to generate a valid IPS can be significant. I am aiming to pilot the server side of it: accepting the IPS composition into HAPI FHIR/FHIR-compliant server and storing information, retrieving a list of compositions or a particular composition by id. Am I missing anything from the server side? I am planning on building profiles for the validation of incoming data but I don't see a huge development effort. Correct?</p>",
        "id": 228670222,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1614806305
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191416\">@Iryna Roy</span> - why don't you use the existing IPS Profiles for validation purposes? There are also testing tools available, such as MITRE's Inferno, that can perform validation against those Profiles?</p>",
        "id": 228671109,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1614806677
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span>  that's exactly what we are planning to do but we have our national profiles, we need to do the gap analysis and create profiles compatible with IPS but national-based. Thank you for pointing out the tools. Do you mean Inferno can generate the IPS to send against the end point?</p>",
        "id": 228688898,
        "sender_full_name": "Iryna Roy",
        "timestamp": 1614814650
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191416\">@Iryna Roy</span>  AFAIA, Inferno can currently be used to test IPS instances (Bundles) against the IPS Profiles. However, I do believe that there are plans to generate IPS examples - <span class=\"user-mention\" data-user-id=\"191942\">@Matt Rahn</span>  and <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  might have more information.</p>",
        "id": 228692000,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1614816382
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191416\">@Iryna Roy</span>  if you are interested in IPS examples , <span class=\"user-mention\" data-user-id=\"191532\">@dr Kai U. Heitmann</span>  is working on a project aiming to generate a large amount of  IPS examples.</p>",
        "id": 228766817,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1614862619
    }
]