[
    {
        "content": "<p>Sorry if the questions are stupid, I am just starting to look at IPS (International Patient Summary) and IPA (International Patient Access) specifications. EDIT -- And I only now found out that there is a separate IPS stream.. sorry about that.</p>\n<ol>\n<li>\n<p>Why would one use IPA resource definitions instead of IPS resources (for patient summary purposes)? Is the only reason to be able to use more relaxed definitions? Of course you can transmit a wide variety of different resources with IPA (being also IPS) and for that the specifications seem to serve different purposes, but there seems to be quite a bit of overlap.</p>\n</li>\n<li>\n<p>Where does Provenance fit in the IPS world or does it?</p>\n</li>\n<li>\n<p>Regarding IPA being more relaxed, I noticed that there are some elements that profile the same base resources, but IPA ones being mandatory and IPS ones optional? How does that fit the basic premise of IPA being more relaxed, or did I just interpret something incorrectly. I would have to look the examples up as I don't remember them currently, but is this a known issue with a good explanation? :)</p>\n</li>\n<li>\n<p>Is IHE profile QEDm (Query for Existing Data for Mobile, part of Care Coordination) mostly overlapping with IPA as it would seem? Does IHE mXDE fit well with IPA as it would also seem? This having also read that IHE is going for IPS as well (mostly for conformance, testing and demonstrations)</p>\n</li>\n</ol>",
        "id": 189587148,
        "sender_full_name": "Marko Jalonen",
        "timestamp": 1583237658
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"237526\">Marko Jalonen</span> <a href=\"#narrow/stream/179166-implementers/topic/IPS.20on.20IPA.20on.20Smart.20on.20FHIR.3F/near/189587148\" title=\"#narrow/stream/179166-implementers/topic/IPS.20on.20IPA.20on.20Smart.20on.20FHIR.3F/near/189587148\">said</a>:</p>\n<blockquote>\n<ol start=\"2\">\n<li>Where does Provenance fit in the IPS world or does it?</li>\n</ol>\n</blockquote>\n<p>The role of Provenance is relevant for the IPS scope, even if not widely explored in this version of the IG.<br>\nsee also <a href=\"https://build.fhir.org/ig/HL7/fhir-ips/knownIssues.html#future-development\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/fhir-ips/knownIssues.html#future-development\">https://build.fhir.org/ig/HL7/fhir-ips/knownIssues.html#future-development</a></p>\n<p>some examples in <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=48237134#InternationalPatientSummary:UseCases-Examples\" target=\"_blank\" title=\"https://confluence.hl7.org/pages/viewpage.action?pageId=48237134#InternationalPatientSummary:UseCases-Examples\">https://confluence.hl7.org/pages/viewpage.action?pageId=48237134#InternationalPatientSummary:UseCases-Examples</a></p>",
        "id": 189593776,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583243492
    },
    {
        "content": "<p>as a general comment, to discuss about IPA and IPS constraints and differences seems to me a little bit premature now ... :-) ...</p>\n<p>... the intent, as far as I understood, is to have the IPS profiles conformant with the IPA ones... but the IPS is going to be publish as STU and the IPA is still in a sort of proof of concept stage.... </p>\n<p>I believe that there is a lot of work that need to be done for both  :-)</p>",
        "id": 189594505,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1583244073
    },
    {
        "content": "<p>As Giorgio indicates, all of this is rather premature. Everyone is trying to make progress, and synchronizing their progress is harder than going alone.</p>",
        "id": 189598899,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583246873
    },
    {
        "content": "<p>Yes QEDm could be used to access portions of IPS. It has been around IHE for a number of years.</p>",
        "id": 189598982,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583246908
    },
    {
        "content": "<p>Yes mXDE is applicable to ANY document content shared, to make that data more consumable by applications that want a more fine grain access method based on FHIR Resources rather than Documents.</p>",
        "id": 189599046,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583246949
    },
    {
        "content": "<p>Might be some in IHE Connectathon in Brussels that could answer these questions better. <a href=\"https://connectathon.ihe-europe.net/\" target=\"_blank\" title=\"https://connectathon.ihe-europe.net/\">https://connectathon.ihe-europe.net/</a></p>",
        "id": 189599192,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583247008
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span> and <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> about where we are with the specifications and their relations with each other.  I will add, though, that I believe that thinking about \"IPS on IPA\" and how the two specifications fit together is on the right path.  I'm not sure if asking questions about this as <span class=\"user-mention\" data-user-id=\"237526\">@Marko Jalonen</span> has is actually \"premature\".  Considering and answering questions like this is exactly what we need to be doing and are working toward.  I do agree with Giorgio and John, though, that what would be premature is to expect that we already have developed clear and well-defined answers for some of these questions.  We should continue asking the questions and work together on answering them - and, as Marko mentioned, probably the best place to continue with that is on the <a href=\"#narrow/stream/207835-IPS\" title=\"#narrow/stream/207835-IPS\">IPS</a> stream (IPS Community of Practice).</p>",
        "id": 189601601,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1583248406
    }
]