[
    {
        "content": "<p>Happy New Year!!</p>\n<p>For the elements flagged as modifiers (is-modifier set to true), specifically “patient.animal” :   The example at <a href=\"https://www.hl7.org/fhir/patient-example.xml.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/patient-example.xml.html\">https://www.hl7.org/fhir/patient-example.xml.html</a>   just skips the animal element.  But the conformance link  <a href=\"https://www.hl7.org/fhir/conformance-rules.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/conformance-rules.html\">https://www.hl7.org/fhir/conformance-rules.html</a>  tells us to have cardinality set to one for such modifiers.  What is your advice?  Our patients are only humans.   Also, can profiles be used to trim out not needed modifiers?</p>",
        "id": 153927479,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1514934129
    },
    {
        "content": "<p>isModifier=true SHOULD also have a minimum cardinality of 1, but it is not always the case like this one where it makes no sense to require the element.  So <code>Patient.animal</code> is 0..1 and can constrain it away in a profile with a card of 0..0</p>",
        "id": 153927480,
        "sender_full_name": "Eric Haas",
        "timestamp": 1514934810
    },
    {
        "content": "<p>Typically their minimum cardinality can be 0 if there's a default interpretation to a missing element - as there is for Patient.animal (namely that the patient is a human).</p>",
        "id": 153927481,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1514935765
    },
    {
        "content": "<p>Actually, I mis-spoke.  There's no default for Patient.animal.  If it's not specified, you don't know if they're an animal or not.  There's no way to definitively say that someone is a human.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 153927494,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1514940731
    },
    {
        "content": "<p>I believe that is correct. And for the most part, I'd suggest that it would be assumed.<br>\nIf you knew it was an animal, but didn't know the details, you'd likely include the animal element with a null flavour indicating that you don't know what type.</p>",
        "id": 153927498,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1514942892
    },
    {
        "content": "<p>If that's the presumption, then it should be stated as \"meaning when missing\"</p>",
        "id": 153927499,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1514949158
    },
    {
        "content": "<p>If you were a veterinary system, then maybe that assumption is the other way around.</p>",
        "id": 153927500,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1514949877
    },
    {
        "content": "<p>We can't have the default context-specific by sender because as a receiver you don't necessarily have that information.  (The only exception we allow is for language, which can be defaulted by national borders and is slightly easier.)</p>",
        "id": 153927501,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1514951233
    },
    {
        "content": "<p>The ElementDefinition.isModifier is set to true has the following effect:  \"The effect of this is that the element cannot be ignored by systems: they SHALL either recognize the element and process it, and/or a pre-determination has been made that it is not relevant to their particular system.\"    So how can we communicate the pre-determination of non-relevance?</p>",
        "id": 153927504,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1514961345
    },
    {
        "content": "<p>A system \"...SHALL either recognize the element and process it, and/or a pre-determination has been made that it is not relevant to their particular system.\"  is true for any element for an implementation whether isMod or not.</p>",
        "id": 153927526,
        "sender_full_name": "Eric Haas",
        "timestamp": 1514994861
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Actually, that's not really true.  For non-modifiers, an implementer who comes to the spec with a list of 3 elements they want to exchange can map only those elements and safely ignore the rest of the spec except for modifier elements and communicate safely (though they might miss useful \"additional\" functionality they could have taken advantage of).</p>\n<p><span class=\"user-mention\" data-user-id=\"194569\">@Malgorzata Schwab</span> There's no need to communicate the pre-determination of non-relevance.  The determination - and what action is taken based on it - is internal to your system.</p>",
        "id": 153927531,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1514996697
    },
    {
        "content": "<p>So it would be ok just to ignore it, not even implement the animal element.   Wouldn't it be elegant to make a profile and trim it out?</p>",
        "id": 153927550,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1515008013
    },
    {
        "content": "<p>Well, first PA needs to decide whether its absense can be presumed to be a default.  If they agree there's a default, then yes you can safely constrain it out in a profile.  (And given that there are profiles that already do this, that's a strong argument for PA to define such a default...)</p>",
        "id": 153927551,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515008646
    },
    {
        "content": "<p>PA as ... ?</p>",
        "id": 153927563,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1515013812
    },
    {
        "content": "<p>Sorry.  Patient Administration.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> is one of the co-chairs.</p>",
        "id": 153927584,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515030336
    },
    {
        "content": "<p>when can we expect a decision?</p>",
        "id": 153927785,
        "sender_full_name": "Malgorzata Schwab",
        "timestamp": 1515173572
    },
    {
        "content": "<p>Decision - I would hope by end of the WGM, which is first week of Feb.  However, R4 - which will reflect the decision - won't be published until end-of-year.  If you're implementing based on R2 or R3, you can constrain it out, but there's at least some risk of misinterpretation.</p>",
        "id": 153927786,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515174157
    },
    {
        "content": "<p>Can we please get a tracker logged for this on gforge (link at the bottom of the patient page - or any page for that matter)<br>\nThanks.</p>",
        "id": 153927828,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1515192210
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14393\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14393\">GF#14393</a></p>",
        "id": 153927847,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515210912
    }
]