[
    {
        "content": "<p>My app allows patients to authenticate using their Epic accounts (MyChart). However, is an email address guaranteed to exist within the Patient entity returned by Epic's API? Judging by these docs: <a href=\"https://fhir.epic.com/Specifications?api=931\">https://fhir.epic.com/Specifications?api=931</a> it doesn't seem that this is guaranteed. I was hoping to represent patients in a database with an email address as a primary key, but can't do that unless email always will exist.</p>",
        "id": 221272889,
        "sender_full_name": "Abhas Arya",
        "timestamp": 1609396021
    },
    {
        "content": "<p>I would say that patient.telecom is mustSupport, also with emails in their example. But from the specs I cannot tell whether email will always occur. Since that belongs to an individual to provide that I would not trust in the existence.<br>\n<span class=\"user-mention\" data-user-id=\"191859\">@Amit Popat</span>  ?</p>",
        "id": 221279666,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1609407428
    },
    {
        "content": "<p>A lot of folks don’t have emails or don’t want to share emails with providers. Someone that is using a MyChart account has a higher likelihood of having an email, though I’m not sure that is guaranteed since as a patient I have all the right to not provide my email to my physician office. <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> , any additional thoughts?</p>",
        "id": 221279879,
        "sender_full_name": "Amit Popat",
        "timestamp": 1609407763
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191859\">@Amit Popat</span>  this is what I meant.</p>",
        "id": 221281118,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1609409716
    },
    {
        "content": "<p>Also, many patients may share an email address.  My parents just have one email they both use.  Also, pediatric patients (especially newborns) very likely won’t have their own email.  If they have one on file it would be their parents.</p>",
        "id": 221325400,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1609458953
    },
    {
        "content": "<p>I’ve dealt with systems that used email as a primary key and it was a disaster.  I’d recommend against it.</p>",
        "id": 221325447,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1609459015
    },
    {
        "content": "<p>And lastly, the user that logs in to MyChart and is using you app may not be the patient.  They could be a caregiver or parent of the patient who has proxy access. And multiple people may have access to the same patient (e.g. mom and dad both have access to their kids records).</p>",
        "id": 221325576,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1609459216
    },
    {
        "content": "<p>IMO, a primary ID should always be internal. But you can - and should - associate as many details as possible. <br>\nAnd what about switching an email address...</p>",
        "id": 221343772,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1609492484
    }
]