[
    {
        "content": "<p>On the STU3 to R4 mapping page: <a href=\"https://hl7.org/fhir/r4/documentreference-version-maps.html\">https://hl7.org/fhir/r4/documentreference-version-maps.html</a><br>\nit shows:<br>\n<code>src.author as s -&gt; tgt.agent as t then agent(s, t);</code></p>\n<p>but there is NO agent property in R4 (or STU3 for that matter)</p>",
        "id": 263287492,
        "sender_full_name": "John Silva",
        "timestamp": 1638364526
    },
    {
        "content": "<p>Interesting, it appears this may have been fixed in R5:<br>\n<a href=\"https://build.fhir.org/documentreference-version-maps.html\">https://build.fhir.org/documentreference-version-maps.html</a></p>",
        "id": 263290164,
        "sender_full_name": "John Silva",
        "timestamp": 1638365648
    },
    {
        "content": "<p>If it was fixed, then it was undoubtedly an error.  It probably won't get fixed in R4 though.</p>",
        "id": 263374188,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638402419
    },
    {
        "content": "<p>So there isn't an 'errata process' to backfill discovered problems in previous releases (that are of the 'typo type' problems not functional changes)?   Anyone looking at the current official release would be misled by this incorrect FML.</p>",
        "id": 263383928,
        "sender_full_name": "John Silva",
        "timestamp": 1638409839
    },
    {
        "content": "<p>there is an errata process but following it has many costs, so we are unlikely to issue any corrections for R4.</p>",
        "id": 263387024,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638413144
    },
    {
        "content": "<p>OK, but that puts the onus on \"unsuspecting\" users of the FHIR spec to discover this error on their own.  Also for any tools that have automated the FHIR version conversion process using the FML will have problems.   I guess the FML is not yet prescriptive enough and there are many corner cases that it doesn't handle that a \"tool author\" has to work around anyway.   Oh well.</p>",
        "id": 264053040,
        "sender_full_name": "John Silva",
        "timestamp": 1638903117
    },
    {
        "content": "<p>We could, possibly, look at introducing an Errata reference in R4B that would point to a Confluence page if our intension is to not do any further corrections of R4 after that point.  The Confluence page could list things that are known to be broken...</p>",
        "id": 264066457,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1638908669
    }
]