[
    {
        "content": "<p>Does the FHIR spec require the return of an OperationOutcome when a search is performed with incorrect authorization? Considering these specs, <a href=\"http://hl7.org/fhir/http.html#search\">http://hl7.org/fhir/http.html#search</a> : <em>“If the search fails (cannot be executed, not that there are no matches), the return value return value SHALL be a status code 4xx or 5xx with an OperationOutcome.”</em> </p>\n<p>Perhaps that's me interpreting this to literal, as in <a href=\"https://www.hl7.org/fhir/http.html#Status-Codes\">https://www.hl7.org/fhir/http.html#Status-Codes</a> it is stated this an OperationOutome is not always required.</p>",
        "id": 221640306,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1609849509
    },
    {
        "content": "<p>At the very least it's a SHOULD, and from a error handling perspective I can certainly see why a SHALL is in order. The alternative is that one only receives a HTTP status code, which is too minimalistic for most purposes.</p>",
        "id": 221641290,
        "sender_full_name": "René Spronk",
        "timestamp": 1609850252
    },
    {
        "content": "<p>The argumentation for not returning a OperationOutcome would be that it will likely not contain additional information next to the HTTP status code and the authorization checks might be performed by a generic security framework before the FHIR server is given the request. Which are two valid points I guess. I am however a little confused by the expectations of the FHIR spec about this.</p>",
        "id": 221643733,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1609852101
    },
    {
        "content": "<p>At least the NHS is pretty clear about this: <a href=\"https://nhsconnect.github.io/FHIR-SpineCore/resources_error_handling.html\">https://nhsconnect.github.io/FHIR-SpineCore/resources_error_handling.html</a> \"In the event of an error, provider systems SHALL respond by providing an OperationOutcome resource\"</p>",
        "id": 221651639,
        "sender_full_name": "René Spronk",
        "timestamp": 1609857057
    },
    {
        "content": "<p>I think that while it says it is not always required, in this case - it is.</p>",
        "id": 221654511,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1609858421
    },
    {
        "content": "<p>SHALL is too strong for exactly the reason Ardon states: permission checks could be done by non-FHIR subsystems that do not know anything about FHIR</p>",
        "id": 221659802,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1609860848
    },
    {
        "content": "<p>...and a 401 or 403 are already pretty explanatory on their own</p>",
        "id": 221660062,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1609860968
    },
    {
        "content": "<p>for non-FHIR aware systems, RFC 7807 would apply .. especially if there was no Accept header which indicated support for FHIR.</p>",
        "id": 221661179,
        "sender_full_name": "René Spronk",
        "timestamp": 1609861453
    },
    {
        "content": "<p>Certainly we should clarify the wording.  Can you submit a change request?</p>",
        "id": 221662306,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609861992
    },
    {
        "content": "<p>I would happily create a ticket. But I am not completely sure if the consensus is to make it more clear that an OperationOutome is expected or not.</p>",
        "id": 221668733,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1609864618
    },
    {
        "content": "<p>The work group will need to decide.  My opinion is that there's no reason to force an OperationOutcome to be provided</p>",
        "id": 221669577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1609865023
    },
    {
        "content": "<p>Done: <a href=\"https://jira.hl7.org/browse/FHIR-30240\">https://jira.hl7.org/browse/FHIR-30240</a></p>",
        "id": 221674068,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1609866970
    },
    {
        "content": "<p>certainly the intent is that <em>if a resource is returned,</em> it SHALL be an operation outcome</p>",
        "id": 221700954,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1609880465
    },
    {
        "content": "<p>With the original request you are approaching a FHIR endpoint. Even if a preprocessing security check fails what is the reason for not drafting a proper FHIR result if we are looking for FHIR conformance?</p>",
        "id": 222045537,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1610092286
    },
    {
        "content": "<p>It only makes sense to return a resource if you've got something useful to say.  Quite often when the issue is a security violation, it's good practice to say as little as possible - to provide minimal surface area for an attacker to probe.  So if the only information you want to convey back to the client is \"you don't have permission\", then there's no value in sending anything other than a bare 403.</p>",
        "id": 222077983,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610116126
    },
    {
        "content": "<blockquote>\n<p>what is the reason for not drafting a proper FHIR result </p>\n</blockquote>\n<p>That the pre-processing system doing the security checks does not know anything about FHIR</p>",
        "id": 222083707,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1610119061
    },
    {
        "content": "<p>yes,  common in cloud systems TLS and OAuth are handled (to some degree) by dedicated general IT systems. THEY will not understand FHIR.</p>",
        "id": 222084154,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610119256
    },
    {
        "content": "<p>they don't need to understand FHIR to reject the request for security reasons</p>",
        "id": 222084214,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610119276
    },
    {
        "content": "<p>load ballancing also... not FHIR knowledgable</p>",
        "id": 222084275,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610119310
    },
    {
        "content": "<p>thus clients need to be told that sometimes failures will be reported without a OperationOutcome</p>",
        "id": 222084295,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610119316
    },
    {
        "content": "<p>Absolutely, the clients always have to expect that occasionally they are not going to get an operation outcome resource. Based on network configuration with proxies, custom DNS, custom routes and gateways, it's entirely possible that the client will receive a 200 or any other https status with no body at all. But in the examples of a LB or authentication processors, it's likely they have the ability to return custom pages (resources) for any status. </p>\n<p>In short: The client should always prepare for the situation that they might not get a resource. The servers should do their best to always return a resource (error or otherwise).</p>",
        "id": 222107649,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1610130355
    },
    {
        "content": "<p>They should return a resource <em>if</em> they have something useful to say.  Returning an OperationOutcome that doesn't communicate anything more than the HTTP code is unnecessary overhead.</p>",
        "id": 222114794,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610134073
    }
]