[
    {
        "content": "<p>As part of the Media and Imaging thread (<a href=\"https://chat.fhir.org/#narrow/stream/implementers/subject/Media.20.26.20Imaging.20Study.20Resource\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/subject/Media.20.26.20Imaging.20Study.20Resource\">https://chat.fhir.org/#narrow/stream/implementers/subject/Media.20.26.20Imaging.20Study.20Resource</a> ) I've been looking at Media. The scope includes \"Photos of patients and staff for identification purposes\". Cool, lets see how it's used in Patient...Oh, it isn't. Patient uses an attachment for the photo. OK, well, what about another use? The scope also includes \"Photos and videos of diagnostic or care provision procedures for recording purposes.\" That suggests photos and videos as an Observation, which is supported by another thread (<a href=\"https://chat.fhir.org/#narrow/stream/implementers/subject/Where.20to.20best.20place.20clinical.20photos.3F\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/subject/Where.20to.20best.20place.20clinical.20photos.3F\">https://chat.fhir.org/#narrow/stream/implementers/subject/Where.20to.20best.20place.20clinical.20photos.3F</a>). So, let's go look at Observation... Nope, that uses an attachment as well. Well, then surely the Media resource should tell me all the many places it is used...yes, its used in DiagnosticReport, and...well, DiagnosticReport.<br>\nIs there a reason for the poor adoption of Media? Is there a long term vision for the resource?</p>",
        "id": 153862837,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1481319906
    },
    {
        "content": "<p>I think that patient.photo and Observation.attachment predate Media, and at least Patient.photo should have been changed to use it. </p>",
        "id": 153862838,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481319985
    },
    {
        "content": "<p>what to do about observation.value is less obvious - maybe Media should be a choice in Observation.related.target</p>",
        "id": 153862839,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481320027
    },
    {
        "content": "<p>and/or we could make it clear how to reference a Media resource in Observation.valueAttachment</p>",
        "id": 153862841,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481320076
    },
    {
        "content": "<p>Observation.valueAttachment.url contains the URL for a Media resource, which contains an attachment which contains the photo?</p>",
        "id": 153862844,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1481320254
    },
    {
        "content": "<p>y. one way to do it. </p>",
        "id": 153862845,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481320437
    },
    {
        "content": "<p>Is there any reason not to add Media as an Observation value?</p>",
        "id": 153862846,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1481320440
    },
    {
        "content": "<p>OK, added <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12454\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12454\">GF#12454</a> to convert Patient.photo to Media.</p>",
        "id": 153862848,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1481320808
    },
    {
        "content": "<p>yes, there's technical reasons not to add Media as an observation.value. It's a reference, not a datatype. </p>",
        "id": 153862850,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481320859
    },
    {
        "content": "<p>something to think about </p>",
        "id": 153862851,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481320866
    },
    {
        "content": "<p>Aren't there other resource that have choices between datatypes and references? Provenance.who[x] is uri or Reference(...).</p>",
        "id": 153862861,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1481322011
    },
    {
        "content": "<p>Yes, but having a resource be the result of an Observation is a slippery slope we might not want to tread on</p>",
        "id": 153862864,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1481326487
    },
    {
        "content": "<p>I was planning to use Media for things like wound management, or photo's of client's homes etc for community maintanance purposes.</p>",
        "id": 153862868,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1481348940
    },
    {
        "content": "<p>Don't know that I'd want the current Client Photo to be Media resource, an extra thing to go get. And also this would then have both resources pointing at each other, not ideal either.<br>\nAnd do want to know which one is current.</p>",
        "id": 153862869,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1481348995
    },
    {
        "content": "<p>Not crazy about adding media to observation.  already have it in DR</p>",
        "id": 153862890,
        "sender_full_name": "Eric Haas",
        "timestamp": 1481402980
    },
    {
        "content": "<p>Media referenced from the DR  seems appropriate for an image included in the report, but what is the correct way to record  clinical imaging that doesn't end up in the report? I imagine many more images are taken then end up being referenced directly in a report.<br>\nUsing media for wound management is not great because Media is missing most of the context needed, e.g. what is  the encounter or episode of care? order number? body part? Is Media an Event? If so, where are the other event-like elements (e.g. basedOn)?<br>\nAs it is, Media either needs more clinical information, so that it can stand on its own, or needs to be referenced from something that can convey that clinical information.</p>",
        "id": 153863147,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1481564289
    },
    {
        "content": "<p>I'd argue the case is at least as strong for a large object like a photo not to be included in the Patient resource, as for it to be included directly, so I don't buy that argument. I do agree that the Patient to Media circular reference is an issue.</p>",
        "id": 153863148,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1481564441
    },
    {
        "content": "<p>Observation + valueAttachment gives you all the stuff you mentioned.  Observation is an Event resource and still need to do that reconciliation wiht the logical model for things like basedOn.   This bring us full circle to your original question.  What does Media give that Observation + valueAttachment doesn't.     more metadata...</p>",
        "id": 153863156,
        "sender_full_name": "Eric Haas",
        "timestamp": 1481572808
    },
    {
        "content": "<p>Or, poking at this from the other end: What does Media give that Binary doesn't? Is knowing the dimensions/playing length useful, or does that just duplicate information in the actual binary content? Media has a Patient reference, but is there a reason why Binary can't/doesn't? Is Media better achieved through core extensions on Binary?</p>",
        "id": 153863238,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1481657972
    },
    {
        "content": "<p>you can search for the metadata things in media easily. </p>",
        "id": 153863240,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481659657
    },
    {
        "content": "<p>Media has a subject , thus allowing for patient specific data. Binary might have patient specific data, but that fact must be learned by the relationships the Binary has with a metadata resource like DocumentRefererence, or other.</p>",
        "id": 153863268,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481663740
    },
    {
        "content": "<p>There are other useful meta elements in Media, including those found in Attachment datatype. But they are less compelling to me than the subject element.</p>",
        "id": 153863269,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481663873
    },
    {
        "content": "<p>\"Media has a subject, thus allowing for patient-specific data\" -- is there a reason Binary doesn't have patient? Can the two be collapsed into one resource? Or, do we add more to Media making it \"ClinicalMediaObservation\" and put space between the Binary/Media resources that way?</p>",
        "id": 153863277,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1481664759
    },
    {
        "content": "<p>Binary is intended for purely binary content.  \"This resource is generally used as the target of a Document Reference or an Attachment, when a FHIR server finds it convenient to manage the content within the same overall REST framework as the other resources.\" Binary is designed to be as thin as possible, holding only the content and the mime-type of that content. Binary will be returned to you as the binary content (not base64Binary encoded) if you can accept that binary content (MIME-TYPE). Hence if it is of mime-type pdf, and you GET it with accept headers allowing  pdf, you will get only the pdf. This does not happen with Media.</p>",
        "id": 153863278,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481666114
    },
    {
        "content": "<p>Media can point at Binary</p>",
        "id": 153863279,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481666121
    },
    {
        "content": "<p>Media.content.url can be a Binary </p>",
        "id": 153863281,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481666174
    },
    {
        "content": "<p>Of course under the turtles-all-the-way-down meme... Binary can also point at Media, but that is just silly.</p>",
        "id": 153863283,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481666254
    },
    {
        "content": "<p>Right -- forgot the weird Binary dual personality thing. OK, forget I ever suggested unifying Media and Binary.</p>",
        "id": 153863284,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1481666283
    },
    {
        "content": "<p>I guess my point  was Obs+ valueAttachment gives you patient but leaves out dimension.  So is Media really needed  as a ref from Observation.  (  see much earlier in thread ) </p>",
        "id": 153863434,
        "sender_full_name": "Eric Haas",
        "timestamp": 1481731812
    },
    {
        "content": "<p>Yes Eric. Media has a reasonable minimal set of metadata for common photo quality media. </p>",
        "id": 153863441,
        "sender_full_name": "John Moehrke",
        "timestamp": 1481735166
    },
    {
        "content": "<p>I think that metadata on the media is appropriate, and beneficial over binary.</p>",
        "id": 153863552,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1481771150
    }
]