[
    {
        "content": "<p>At Norsk Helsenett SF, and we are responsible for the CMS platform hosting the websites for all Norwegian public hospitals. This is a SharePoint-platform, which have publically available information about the hospital (departments, locations etc.), detailed information of treatments provided by the individual departments and loosely coupled information such as news and events. All the hospitals are also responsible for their own clinical trials, which is also displayed on the <a href=\"http://helsenorge.no\">helsenorge.no</a>.</p>\n<p>With all of this mentioned, our next task is to provide all of this information via a publicly available API, at first only health care related information (treatments coupled with who/where). </p>\n<p>While investigating if FHIR might be a plausible path, we have had several sessions with Kenneth Myhra, discussing how FHIR might be utilized in our situation and with the data we wish to publish.<br>\nWe have especially looked at the resources HealthCareService coupled with Organization. While we at first glance found it to be a plausible fit, we have some concerns. <br>\nA good example of a treatment can be found here: <br>\n<a href=\"https://translate.google.com/translate?sl=no&amp;tl=en&amp;u=https://stolav.no/behandlinger/gulsott-hos-nyfodte-lysbehandling%23transport-oya\">https://translate.google.com/translate?sl=no&amp;tl=en&amp;u=https://stolav.no/behandlinger/gulsott-hos-nyfodte-lysbehandling%23transport-oya</a>. <br>\nKeep in mind that no data is in context of an individual person (citizen). All data displayed is the same, regardless of the consumer of webpage/API.</p>\n<p>All information shown on this webpage, will be available through the same method in the API.</p>\n<p>Any thoughts on this?</p>",
        "id": 230842859,
        "sender_full_name": "Tommy Bjornsgard",
        "timestamp": 1616064452
    },
    {
        "content": "<p>At first glance, it looks like a good fit. How much of the content on the page is meant to be computable via the API, and how much can be just xhtml in the narrative?</p>",
        "id": 230881380,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1616080680
    },
    {
        "content": "<p>Thank you for the reply Vassil!<br>\nAll of the content on the page is meant to be available trough the API. In addition, a code (preferably SNOMED-CT) will also be added (not shown on the webpage).<br>\nA requirement is that the description of the treatment, with all content, can be recreated using the API. <br>\nA good suggestion, but you should  able to differentiate between the \"For\", \"Under\", \"After\"-texts, which can be difficult when putting most of the HTML in the narrative?</p>",
        "id": 231445203,
        "sender_full_name": "Tommy Bjornsgard",
        "timestamp": 1616493615
    },
    {
        "content": "<p>It looks to me that it makes sense to add an extension (or maybe right away an element, e.g. extraDetailsReference) that is a reference to a Composition, where \"For\", \"Under\", and \"After\" are sections.</p>\n<p>Entering a Jira ticket to represent your use case may be helpful</p>",
        "id": 231545932,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1616534516
    },
    {
        "content": "<p>Why Composition?  This seems more like a protocol - and the resource for that would be PlanDefinition.  <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> ?</p>",
        "id": 231547662,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616535268
    },
    {
        "content": "<p>That is why I asked what needs to be computable, and from what I understand, the main concern is the structure and content of the narrative. If there is no underlying formal structure beyond that, PlanDefinition seemed like an overkill. Getting deeper into the requirements will probably uncover many more assumptions that will affect any particular solution.</p>",
        "id": 231548431,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1616535686
    },
    {
        "content": "<p>Composition is also overkill.  You can have a PlanDefinition that's just text if that's what you want - no need for sections - you can just have narrative if that's what's needed.</p>",
        "id": 231555221,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616539239
    },
    {
        "content": "<p>Depends on what the importance of the sections is.</p>\n<blockquote>\n<p>you should [be] able to differentiate between the \"For\", \"Under\", \"After\"-texts</p>\n</blockquote>\n<p>Sections with potentially a code describing \"For\", \"Under\", \"After\" seem to fit this.</p>\n<p>Regardless of the exact approach, it seems that HealthcareService needs something extra to satisfy the use case...</p>",
        "id": 231556557,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1616540097
    },
    {
        "content": "<p>If I understand the use case (and as good as Google translate is, I'm sure I'm missing some nuance) then conceptually, this seems more like a definition (i.e. patient independent) than an event pattern (i.e. patient-specific). PlanDefinition seems like it would be a good fit in that case, and it essentially has the same hierarchical structure. Using PlanDefinition would also have the added benefit of being able to _apply_ it to a patient, though I don't know if this use case needs to support that.</p>",
        "id": 231574435,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1616553715
    },
    {
        "content": "<p>None of the information we seek to publish through the API will be in context of a patient or a single person. However, the must be a connection between a treatment and a treatment provider (as in providedBy), i.e. a doctor, clinic, hospital etc. This is because a given treatment can be performed in different ways by different treatment providers.<br>\nI share <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> 's concern that HealthCareService needs something more in order to be usable. <br>\nWIth regards to PlanDefiniton, how can that be applied or connected towards an organization or treatment provider?</p>",
        "id": 231615804,
        "sender_full_name": "Tommy Bjornsgard",
        "timestamp": 1616583882
    },
    {
        "content": "<p>HealthcareService is typically used as just a declaration that \"this site offers this service\" - it doesn't get into the details of 'how' the service will be performed.  However, establishing such a linkage is reasonable and would likely be done with an extension.  The HealthcareService is already tied to a specific Organization, so if you have different variations, one option is to have one HealthcareService for each, each one tied to a PlanDefinition.  If you want to have a single HealthcareService and indicate what specific providers offer it as well as how they do it, then you'd be looking at a repeating complex extension that links to both  Practitioner and PlanDefinition.</p>",
        "id": 231629258,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616591016
    }
]