[
    {
        "content": "<p>I am using v5.1.16 of the FHIR Validator and I receive this error when an ExplanationOfBenefit entry doesn't have a fullUrl. Isn't this property optional?</p>\n<p><strong>Error @ Bundle.entry[1] (line 15, col10) : Bundle entry missing fullUrl</strong></p>\n<p>Thanks ... Charlie</p>",
        "id": 212610528,
        "sender_full_name": "Charlie Filkins",
        "timestamp": 1602100283
    },
    {
        "content": "<p>The fullUrl element SHALL have a value except that fullUrl can be empty on a POST (although it does not need to when specifying a temporary id for reference in the bundle)</p>",
        "id": 212611273,
        "sender_full_name": "David Pyke",
        "timestamp": 1602100663
    },
    {
        "content": "<p>Can this be expressed as a constraint, rather than \"buried\" in documentation? I read that a while ago, but when I looked at the structure definition today all I \"saw\" was 0..1 and no constraints that would indicate a the larger SHALL conditions. </p>\n<p><span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span>  Thanks for getting back to me, I'll update the rest of my team.</p>",
        "id": 212616340,
        "sender_full_name": "Charlie Filkins",
        "timestamp": 1602103232
    },
    {
        "content": "<p>THat might be possible.  Opening a JIRA issue would probably be a good step.</p>",
        "id": 212617361,
        "sender_full_name": "David Pyke",
        "timestamp": 1602103840
    },
    {
        "content": "<p>Invariants have to be based on information in the instance - they can't have any awareness of the context in which the instance is being used</p>",
        "id": 212623013,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602107000
    },
    {
        "content": "<p>presently, the validator creates that error if there are entries without a full URL unless the bundle is a batch response or a transaction response</p>",
        "id": 212632125,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602113336
    },
    {
        "content": "<p>I do not know why, actually. At a minimum it should also be ok for batch and transaction.</p>",
        "id": 212632227,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602113404
    },
    {
        "content": "<p>but given this:</p>\n<blockquote>\n<p>Results from operations might involve resources that are not identified.</p>\n</blockquote>",
        "id": 212632259,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602113440
    },
    {
        "content": "<p>it would appear that there's no real capacity for the validator to make any rules here?</p>",
        "id": 212632275,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602113458
    },
    {
        "content": "<p>I just want to make sure I understand this. Section 2.36.4 (<a href=\"https://hl7.org/fhir/bundle.html#bundle-unique\">https://hl7.org/fhir/bundle.html#bundle-unique</a>) provides exceptions only when Bundle.type is a transaction OR batch AND the entry.request.method = POST. I should think this could be expressed as a constraint. If someone can provide a link I'll open a JIRA issue, assuming I have the authority.</p>\n<p>If we choose not to persistently identify Resources in a Bundle, e.g., an ExplanationOfBenefit, we SHALL (the text says should) use a UUID, expressed as a URN. However, for this option to be useful we would have to provide absolute references within the ExplanationOfBenefit entries in the Bundle.</p>\n<p>Thanks ... Charlie</p>",
        "id": 212681551,
        "sender_full_name": "Charlie Filkins",
        "timestamp": 1602160328
    },
    {
        "content": "<p>True.  You could submit a tracker item to add the invariant.</p>",
        "id": 212686763,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602162811
    }
]