[
    {
        "content": "<p>Hi there!  I'm looking for recommendation for where in FHIR we should store the following data point that will be captured at the Issue level?  The use case is that we would show a green up-arrow if the issue is improving, a red down-arrow if the issue is worsening, and a blue right-arrow if the issue shows no change. This will be entered manually by the Care Manager.  Our idea is that it will be associated with the Issue (the issue is getting better (improving), getting worse (worsening), or staying the same. If FHIR has something similar at the Issue/Goal level, please advise. I would be happy to hear suggestions.<br>\nAn issue is captured as a <code>CarePlan.description</code>, and we use separate care plans for each of the issues.<br>\nExamples of issues in our palliative care management system are the following:</p>\n<ul>\n<li>Pain: Acute due to neoplastic disease</li>\n<li>Caregiver (Jennifer Baker, Wife) has inadequate support</li>\n<li>Nausea: Acute due to unknown cause</li>\n<li>Patient is not compliant with Morphine Sulfate</li>\n<li>Patient needs transportation assistance for access to care</li>\n</ul>",
        "id": 153842066,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1470149077
    },
    {
        "content": "<p>Hi Aleksandra, I am also very interested in the use case you describe.  Have you considered using Condition to capture the issue?  As descrbed in the Argonaut IG (<a href=\"http://argonautwiki.hl7.org/index.php?title=Problems_and_Health_Concerns\" target=\"_blank\" title=\"http://argonautwiki.hl7.org/index.php?title=Problems_and_Health_Concerns\">http://argonautwiki.hl7.org/index.php?title=Problems_and_Health_Concerns</a>) your example issues seem to fit as Condition with category=health-concern, or complaint, or. problem.   Then the CarePlan.addresses list contains this Condition.  Or Goal.addresses could reference that Condition.   This would allow you to search for CarePlan that has a Condition with desired category code.  With a Goal-Condition relationship, you can associate Observation evidence that supports the graphical symbols for status of the condition.</p>",
        "id": 153842073,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1470157617
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191329\">@Aleksandra Pavlyshina</span> I agree with <span class=\"user-mention\" data-user-id=\"197476\">@Dave Carlson</span> that Condition is what you should use for \"Issue\".  Though I'd lean towards just adding an extension to capture your arrow information.  The linkage from Goal to Condition is many to many and it'd be pretty complicated to use that to just capture a single element with 3 choice (and perhaps one more for \"unknown\")</p>",
        "id": 153842076,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1470159560
    },
    {
        "content": "<p>Ideally, the UI arrow information would be computed using as associated CDS, e.g. using the cds-hooks.  The resulting condition or goal status for arrow indicators might then be stored in an extension.  Or if CDS performance allowed, computed on-demand.</p>",
        "id": 153842078,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1470159912
    },
    {
        "content": "<p>Thanks for your responses.</p>",
        "id": 153842093,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1470174460
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197476\">@Dave Carlson</span>  I found in our documentation that \"the decision was made to keep the issue as a description and not use an associated condition to store the issue.  After looking into the single care plan it was determined that activities relate to a single care plan within FHIR. Due to this constraint and the requirements of the system it appears we will need separate care plans for each of the issues.\" I need to find out the reasons why. Thanks for pointint me to the Argonaut IG.</p>",
        "id": 153842094,
        "sender_full_name": "Aleksandra Pavlyshina",
        "timestamp": 1470174471
    }
]