[
    {
        "content": "<p>Hi, I have a question concerning the correct usage of a field within a ItemComponent object as part of the Claim class: </p>\n<p>A ItemComponent object has a property called “productOrService” (of type CodeableConcept). However, from the description below this code can be either 1) a group code for a set of related claim details, or 2) a product, service, drug or other billing code for the (ItemComponent) item. There is an instance where it is being set with a Diagnosis/Condition code. Would this be considered acceptable usage or not? </p>\n<p>Below is an example of one of its contructors being passed a “productOrService” code</p>\n<p>public class ItemComponent: ...</p>\n<p>/**</p>\n<ul>\n<li>When the value is a group code then this item collects a set of related claim details, otherwise this contains the product, service, drug or other billing code for the item.<br>\n   */</li>\n</ul>\n<p>Protected CodeableConcept productOrService;</p>\n<p>/**<br>\n    * Constructor<br>\n*/<br>\n     public ItemComponent(PositiveIntType sequence, CodeableConcept productOrService) {<br>\n            super();<br>\n            this.sequence = sequence;<br>\n            this.productOrService = productOrService; <br>\n     }</p>",
        "id": 190448513,
        "sender_full_name": "Eric Neumann",
        "timestamp": 1584049169
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span></p>",
        "id": 190470553,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1584073975
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"270827\">@Eric Neumann</span> \"There is an instance where it is being set with a Diagnosis/Condition code. Would this be considered acceptable usage or not? \" Absolutely not, either it contains a coding.code=\"group\" and one or more .details or a biling code (CPT, HCPCS, NDC, …). You are welcome to come to the Financial Management committee calls Tuesday 11-1 Eastern.</p>",
        "id": 191061658,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1584579316
    }
]