[
    {
        "content": "<p>When implementing POSTing of QuestionnaireResponse resource we have come across a problem with the fact that there is a validation rule on the QuestionnaireResponse.item \"+ Rule: Nested item can't be beneath both item and answer\" (qrs-1). This means we cannot find a way to implement a QuestionnaireResponse that has something like this:</p>\n<p>Have you had fever? Yes/No<br>\n-How long (if yes)?</p>\n<p>The item \"Have you had fever?\" both has an answer Yes/No, and a follow up question/item nested with its own answer.</p>\n<p>This seems to me a very common use case, how should we handle this? What is the reason for this validation rule?</p>",
        "id": 177131919,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1570005996
    },
    {
        "content": "<p>Do you have to nest it? Can't you just leave it as a sibling and use \"enable-when\" to only ask the second question if the answer to the first question is \"yes\"?</p>",
        "id": 177132404,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1570006496
    },
    {
        "content": "<p>See example: <a href=\"/user_uploads/10155/KHQ9R9FeJm1ETdRTg0Ach7qF/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> <br>\nWe use the Group (i.e. no answer) to group sets of questions and enable-when logic to skip questions.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/KHQ9R9FeJm1ETdRTg0Ach7qF/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/KHQ9R9FeJm1ETdRTg0Ach7qF/pasted_image.png\"></a></div>",
        "id": 177132847,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1570006951
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191918\">@Sarah Gaunt</span> , isn't \"enable-when\" applicable in a Questionnaire context, as in when filling in the questionnaire form in the UI, not when posting the response? The outcome of the questionnaire would still be an answer Yes on the parent question? Or have I missed something?</p>",
        "id": 177134808,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1570008880
    },
    {
        "content": "<p>Maybe I'm not really understanding the question! Yes, the enable-when is on the questionnaire, but the questionnaireResponse follows the same structure as the related Questionnaire. So if you have the enable when on the question that looks back at your fever question to see if it was yes or no, then when you have the Qresponse as yes, you'd just have the \"how long' question as a sibling to the fever question.</p>",
        "id": 177135342,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1570009495
    },
    {
        "content": "<p>Is this what you are looking for: <a href=\"https://www.hl7.org/fhir/questionnaireresponse-example-bluebook.xml.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/questionnaireresponse-example-bluebook.xml.html\">https://www.hl7.org/fhir/questionnaireresponse-example-bluebook.xml.html</a>  - see the end of that example with the &lt;linkId value=\"hepBgiven\"/&gt;</p>",
        "id": 177135496,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1570009652
    },
    {
        "content": "<p>NOTE (nothing to do with your question!) Gotta love our example writers - hahaha:</p>\n<div class=\"codehilite\"><pre><span></span>&lt;item&gt;\n        &lt;linkId value=&quot;abnormalitiesAtBirth&quot;/&gt;\n        &lt;text value=&quot;Abnormalities noted at birth&quot;/&gt;\n        &lt;answer&gt;\n         &lt;valueString value=&quot;Already able to speak Chinese&quot;/&gt;\n     &lt;/answer&gt;\n &lt;/item&gt;\n</pre></div>",
        "id": 177135581,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1570009720
    },
    {
        "content": "<p>You can have questions with nested answers in QuestionnaireResponse, take a look at some of the examples here:<br>\n<a href=\"https://questionnaireresponse-parser.herokuapp.com/\" target=\"_blank\" title=\"https://questionnaireresponse-parser.herokuapp.com/\">https://questionnaireresponse-parser.herokuapp.com/</a></p>",
        "id": 177144543,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1570019178
    },
    {
        "content": "<p>If you have an answer, you must nest children within the answer.  (That's because if you have an answer that can repeat, nested questions are answered for each answer.)</p>",
        "id": 177155620,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1570026932
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , what if we have a use case where the child question is not related to the parent item <em>answer</em> but instead only related to the <em>item</em>?</p>\n<p>We at least support forms like this in our EHR which we now cannot map to FHIR due to this validation. I dont see any reasons why we really shouldnt allow it? Removing the validation would still allow you to nest your individual items to each item.answer?</p>",
        "id": 179431761,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1572442603
    },
    {
        "content": "<p>We have the ability to be dependent on whether an answer exists at all.  Other than that, I don't understand how a dependency could exist on an item.  Can you explain further?</p>",
        "id": 179431831,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572442659
    },
    {
        "content": "<p>Is it correct to see it as you should only have to type of parent/child relationships?<br>\n1) Item is a header with no answer, and it contains child items<br>\n2) Child item is enabled only for a specific answer for parent item</p>\n<p>And a third case is fundamentally incorrect, so it should be prevented with a validation rule:<br>\n3) Item has an answer (or you can see it as header has an answer), and it also has child items that have no strong dependency to the parent answer, but they instead have a dependency (of some sort) to the parent question?</p>\n<p>To be honest, I cant come up with what an example actual questionnaire would be, but this is supported in our EHR, and I dont really see why it shouldnt be allowed.</p>\n<p>What is the benefit of this validation?</p>",
        "id": 179433090,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1572443378
    },
    {
        "content": "<p>I spoke briefly to a colleague who has more knowledge about the way our customers (everything from small GP clinics to large university hospitals) set up their questionnaire forms. </p>\n<p>She gave an example where they would have a question item like \"Coronary\" where they could write something a bit more generic, probably in free text. Then they would have more specialized sub-items/child questions  to \"Coronary\" where those who want to fill in more specialized information could do that. It could be specialists that would always want to be more granular, or it could be that the use case (patient case) dictates whether you would want to use those more specialized items. </p>\n<p>For this use case, the child items do not depend on the item.answer, but instead on the item, and it is also relevant for them to record both on item.answer and item.item.answer.</p>\n<p>I can see an argument for \"shouldnt this be a header with no answer\" or \"shouldnt this use enableWhen\", but I also see no benefit of restricting this use case. I feel this validation should lie in a profile instead of the base resource. Especially with the overall strategy of being very careful with forcing implementers in one direction or the other in the base resources (such as almost never having cardinality 1..x).</p>",
        "id": 179446802,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1572450844
    },
    {
        "content": "<p>Can you be more specific about what you mean by a dependency on a parent \"question\" as opposed to an answer?<br>\nIn the example given, what is the dependency?  If the parent question is free text, what determines whether the child questions are enabled or not?  Just whether the parent has an answer?  (Because if so, that's supported)</p>",
        "id": 179448887,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572451940
    },
    {
        "content": "<p>Apologies for being unclear :)</p>\n<p>The child question is always enabled. It is independent of the answer of the parent question, and it is also independent of whether there is an answer to the parent at all.</p>",
        "id": 179451299,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1572453474
    },
    {
        "content": "<p>Why is it treated as a child?</p>",
        "id": 179458819,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572458165
    },
    {
        "content": "<p>If the parent item is a group, then the child questions will automatically be displayed.  If the parent is a question, then the child questions are displayed for each answer selected for the parent.  If the parent is a question and you want the children displayed regardless of whether the parent is answered, then just don't make them children</p>",
        "id": 179458968,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572458230
    },
    {
        "content": "<p>Alternatively, treat the parent as a group and make the first question a simple \"details\" question or something like that.</p>",
        "id": 179459037,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572458280
    },
    {
        "content": "<p>[Deleted] &lt;- had accidentally posted in wrong channel and couldn't find how to delete it, sorry</p>",
        "id": 179461085,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1572459571
    }
]