[
    {
        "content": "<p>Which resource would map best to the concept of a patient diary or journal? Just something where patients could write down anything they want... free text, not things like symptoms</p>",
        "id": 153841274,
        "sender_full_name": "David Boerner",
        "timestamp": 1469626521
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/composition.html\" target=\"_blank\" title=\"http://hl7.org/fhir/composition.html\">http://hl7.org/fhir/composition.html</a> ? that doesn't quite seem right</p>",
        "id": 153841275,
        "sender_full_name": "David Boerner",
        "timestamp": 1469626603
    },
    {
        "content": "<p>Typically Observation, I think</p>",
        "id": 153841292,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1469636211
    },
    {
        "content": "<p>Hmm I was vacillating between the two...</p>",
        "id": 153841294,
        "sender_full_name": "David Boerner",
        "timestamp": 1469636265
    },
    {
        "content": "<p>ClinicalImpression is also a possible choice for a diary or journal.  We built a basic healthlog prototype, and ClinicalImpression sufficed to get the job done.  </p>\n<p>What's interesting are the  interpretive differences that Observation vs ClinicalImpression create...  using Observation sort of assumes that the observer (i.e. patient) is fundamentally a rational observer; or rather, has the capability to be rational.  Is this always a valid assumption?  That's not entire clear.  </p>\n<p>Whereas using ClinicalImpression assumes the author (i.e patient)  has limited knowledge and is impressionable.  It also assumes a certain responsibility by the patient for their own health.  Again, are these valid assumptions?  Maybe; maybe not.   </p>\n<p>We're working on adding the Observation resource to our healthlog, and are considering the possibility of using both resources rather than replacing one with the other...  so that a journal would alternate between Observations and Impressions.  Sort of like Tumblr.  </p>\n<p>However, despite those work-arounds and attempts to work within the spec, I've got a nagging feeling that a Post or Status resource is missing from the FHIR spec.  </p>",
        "id": 153842067,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1470150153
    },
    {
        "content": "<p>I think the difference is intent rather than ability </p>",
        "id": 153842091,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470172391
    },
    {
        "content": "<p>Wondering if anyone has an updated suggestion here? We are considering a use case where the patient records diary-like notes, which are viewable by providers. Both Observation and Communication seem close, but not quite on mark.</p>",
        "id": 153991383,
        "sender_full_name": "Justin McReynolds",
        "timestamp": 1535499815
    },
    {
        "content": "<p>Why is Observation not on the mark?</p>",
        "id": 153991396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535504837
    },
    {
        "content": "<p>there's no appropriate LOINC code?</p>",
        "id": 153991432,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1535515099
    },
    {
        "content": "<p>I see this <a href=\"https://details.loinc.org/LOINC/51855-5.html\" target=\"_blank\" title=\"https://details.loinc.org/LOINC/51855-5.html\">https://details.loinc.org/LOINC/51855-5.html</a> \"Patient Note\".  So, we'll use Observation with that as the code. Thanks to you both!</p>",
        "id": 153991672,
        "sender_full_name": "Justin McReynolds",
        "timestamp": 1535568687
    }
]