[
    {
        "content": "<p>Does FHIR bundle will support JSon Patch in Bundle transaction ?</p>\n<p>[<br>\n { <br>\n   \"op\": \"replace\", <br>\n   \"path\": \"/status\", <br>\n   \"value\": \"in-progress\" <br>\n }<br>\n]</p>",
        "id": 203069832,
        "sender_full_name": "Ramesh jarabana",
        "timestamp": 1594102168
    },
    {
        "content": "<p>I believe the answer to that is 'no' - if you're using Bundle, you must use a FHIRPath Patch Parameters resource.  However, it would be good for us to make that explicit.  Can you submit a change request <span class=\"user-mention\" data-user-id=\"317920\">@Ramesh jarabana</span>?  (Just click on the 'propose a change' link at the bottom of any page in the spec.)</p>",
        "id": 203106786,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594130808
    },
    {
        "content": "<p>Alternatively, FHIR could propose a packaging format for JSON patch that will fit into Bundle (as the restriction that you cannot use JSON patch in a transaction looks arbitrary to me, and FHIR patch could be harder to implement).</p>\n<p>In our implementation, we also expose JSON patch as an extended operation that takes the whole patch as a string, which makes it possible to pass it via Bundle with little changes (alternative solution would be to map the whole JSON patch to parameters, but that would require clients to do transformation from JSON patch into Parameters).</p>",
        "id": 203133841,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1594142970
    },
    {
        "content": "<p>I think FHIRPath <em>is</em> our proposed packaging format.  I don't understand why we'd create another one that's JSON-specific.</p>",
        "id": 203139742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594145915
    },
    {
        "content": "<p>Mostly because JSON Patch is an industry standard (<a href=\"https://tools.ietf.org/html/rfc6902\">https://tools.ietf.org/html/rfc6902</a>).</p>\n<p>Since FHIR specification already supports JSON Patch (here: <a href=\"https://www.hl7.org/fhir/http.html#patch\">https://www.hl7.org/fhir/http.html#patch</a>) and supporting it inside transaction (bundle) is a minor change, from an implementation side (assuming your implementation already supports JSON Patch), it looks logical to me to also specify how JSON Patch could be used inside a bundle. Also, arguably, FHIR Path-based patch is a bit harder to implement as it needs to know FHIR semantics, so JSON Patch might be an alternative for simpler, JSON-only, implementations.</p>",
        "id": 203147492,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1594149458
    },
    {
        "content": "<p>It's not a minor change - you can't include JSON in a Bundle unless that JSON is defined by a resource</p>",
        "id": 203150969,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594151216
    },
    {
        "content": "<p>Also every Bundle must be translatable from JSON to XML to RDF and back</p>",
        "id": 203151038,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594151248
    },
    {
        "content": "<p>I'm not proposing to include JSON Patch as JSON; as I suggested above, it could be either a stringified JSON (which, arguably, not a best way to pass JSON, but on the other hand, something that is easy to do on both sides) or it could be mechanically mapped to <code>Parameters</code> resource (more work on the client, though, which sort of begs the question why not FHIR Path at this point).</p>",
        "id": 203204973,
        "sender_full_name": "Ivan Dubrov",
        "timestamp": 1594157065
    },
    {
        "content": "<p>we could use the Binary resource to actually contain it</p>",
        "id": 203210222,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594160199
    }
]