[
    {
        "content": "<p>This question may already be answered but I can't find it and I have received different answers depending on who I ask.  For a laboratory chemistry panel (potassium, sodium, bicarbonate, creatinine, glucose) I can use USCore R4 observation-lab with the panel as the code and each individual test as a component, OR I can list each test separately as an observation-lab. The fact holding these results together is that they are from the same specimen so it seems using components may be helpful.  Can someone confirm which is the best approach when requesting retrieve of such data?</p>",
        "id": 167850978,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1560260667
    },
    {
        "content": "<p>they should be different observations, not components. They have their own status and process etc.</p>",
        "id": 167861772,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560267487
    },
    {
        "content": "<p>As I thought - but multiple observations in one Laboratory report? or multiple Laboratory reports? (<a href=\"https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-diagnosticreport-lab.html\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-diagnosticreport-lab.html\">https://build.fhir.org/ig/HL7/US-Core-R4/StructureDefinition-us-core-diagnosticreport-lab.html</a>)</p>",
        "id": 167862080,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1560267693
    },
    {
        "content": "<p>typically a lab would report that as one diagnostic report and a set of observations. But there's no <em>rule</em> to that effect that I know of</p>",
        "id": 167862190,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1560267764
    },
    {
        "content": "<p>Agree with Grahame, on both counts - that would be a typical (and very likely the best) approach, but we don't have any rules that I know of that say you <strong>must</strong> do it that way.</p>",
        "id": 167863024,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1560268372
    },
    {
        "content": "<p>Thanks Grahame and Rob - Trying to consider the best way to express the example for QI-Core (for next ballot)</p>",
        "id": 167863469,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1560268621
    }
]