[
    {
        "content": "<p>Good morning, I have a query in relation to lab ordering. If a GP creates a lab order, generating an OML_O21 message type, can the receiving hospital use that OML to amend or cancel the order? Or should the ORL^O22 schema be used in this scenario? Thanks in advance for your assistance.</p>",
        "id": 179815685,
        "sender_full_name": "Karen Wynne",
        "timestamp": 1572858247
    },
    {
        "content": "<p>This chat forum is related to HL7's FHIR standard. As such HL7 v2 questions should be posted on <a href=\"http://chat.hl7.org\" target=\"_blank\" title=\"http://chat.hl7.org\">chat.hl7.org</a>. <br>\nThat having been said: if the GP sends an OML O21, then a lab will respond with an ORLO22 application acknowledgement. That ORL may already contain (confirm) tests that were not actually ordered, e.g. if a lab system decides that ordering X doesn't make sense if one also doesn't have the result for test Y. Should the lab wish to modify the order subsequent to the sending of the ORL O22 ack, then it can do so by sending a OML O21 to the GP system.</p>",
        "id": 179819184,
        "sender_full_name": "René Spronk",
        "timestamp": 1572861433
    },
    {
        "content": "<p>Apologies Rene, my mistake. Thanks for the feedback, much appreciated.</p>",
        "id": 179819951,
        "sender_full_name": "Karen Wynne",
        "timestamp": 1572862028
    },
    {
        "content": "<p>Rene, can I clarify one other thing. If the hospital want to cancel a particular test within the order should they use the OML O21 or ORL O22 message? Thanks again.</p>",
        "id": 179820167,
        "sender_full_name": "Karen Wynne",
        "timestamp": 1572862221
    },
    {
        "content": "<p>OML O21. Remember that v2 uses (message,ack message) pairs. ORL is always an ack message, not a message which initiates an exchange.</p>",
        "id": 179820714,
        "sender_full_name": "René Spronk",
        "timestamp": 1572862702
    }
]