[
    {
        "content": "<p>We are working with a partner laboratory to retrieve results from their FHIR endpoint. In theory, it should work fine. However, we're running into a lot of issues.</p>\n<p>I'm not sure if the problem is the way FHIR is designed to work, the way they have implemented it or the way we are trying to work with it. </p>\n<p>Traditionally, one places an order and the resulting system sends you a result. If the result is corrected, they send you a corrected result. </p>\n<p>The way this system seems to work is I have to poll periodically to retrieve a list of orders during a specific date range, then I have to determine which of those have been resulted, then I have to determine which of those I already have results for. Then I have to determine which are corrected, not performed, etc. Then I have to poll again, to find anything that has been corrected that wasn't in my original date range and handle those.</p>\n<p>It feels like the process is overly complicated for both parties.  Any thoughts/comments?</p>",
        "id": 153971966,
        "sender_full_name": "Joe Etten",
        "timestamp": 1530047575
    },
    {
        "content": "<p>So the system doesn't allow querying Observations directly?  And it's not setting the Observation status to \"corrected\" if it is in fact corrected?</p>",
        "id": 153971967,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530047665
    },
    {
        "content": "<p>I can query the observation directly, if I knew their order ID. But since the orders are submitted via paper (I know), we don't have them. Even if I did have them, I'd have to poll to check to see if they had been resulted. </p>\n<p>I take issue with the whole polling thing. In the traditional HL7 methodology, the filer system tells me when the results are ready. But now the onus is on the placer system to be like the kid in the back seat saying \"is it done yet?\" every 15 minutes or so. It seems like a waste of resources on both sides. CPU, bandwidth, etc. </p>\n<p>Unfortunately, there is no observation status of corrected. Only completed and a new date.</p>",
        "id": 153971973,
        "sender_full_name": "Joe Etten",
        "timestamp": 1530048103
    },
    {
        "content": "<p>I see corrected in the status list: <a href=\"http://build.fhir.org/valueset-observation-status.html\" target=\"_blank\" title=\"http://build.fhir.org/valueset-observation-status.html\">http://build.fhir.org/valueset-observation-status.html</a></p>\n<p>There are lots of potential workflows.  The system could use messaging to push the results to you.  You could subscribe to results based on your order id, patients you track, etc. and receive a notification when there's something new to Query.  You could have a shared Task resource that the lab would update when there were new results or amended results.</p>",
        "id": 153971974,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530048432
    },
    {
        "content": "<p>Apparently that status isn't exposed for us.  They only expose draft, active, suspended, cancelled, completed, enteredInError and unknown.</p>",
        "id": 153971976,
        "sender_full_name": "Joe Etten",
        "timestamp": 1530049049
    },
    {
        "content": "<p>those are not observation status codes?</p>",
        "id": 153972002,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530072575
    },
    {
        "content": "<p>it sounds like they have not exposed any synchronization features - there are a several different approaches to this in the API - history, subscription, push - but if they have not implemented them, you'll have to poll.</p>",
        "id": 153972003,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530072633
    },
    {
        "content": "<p>Those sound like order statuses, not Observation statuses</p>",
        "id": 153972024,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530076583
    }
]