[
    {
        "content": "<p>Hello, need help on modeling Quest lab compendium. Quest laboratory has orderable panel and tests, each panel has single or many associated tests. Also both panels and tests specify some specimen condition/temperature/handling requirement and requisition management specification, which in turn will affect how orders are split up before be placed in lab. We taken some desitions on modeling compendium based on Composition+CatalogEntry+ActivityDefinition+ObservationDefinition.  </p>\n<ul>\n<li>Composition.section.single().entry ---[0..*]---&gt; Reference(CatalogEntry)</li>\n</ul>\n<p>Single section for all orderable items, each entry is a CatalogEntry, referencing either an ObservationDefinition(for test) of ActivityDefinition(for panel)</p>\n<ul>\n<li>CatalogEntry.referencedItem ---[0..1]---&gt; Reference(ActivityDefinition | ObservationDefinition)</li>\n</ul>\n<p>ReferencedItem should be either ActivityDefinition for panels, or ObservationDefinition for tests. Also additional CatalogEntry should exists for each non orderable test. That is, tests referenced from panels and which can not be requested as standalone, only in addition to other tests/observations. </p>\n<ul>\n<li>ActivityDefinition.observationResultRequirement ---[0..*]---&gt; Reference(ObservationDefinition)</li>\n</ul>\n<p>Each ActivityDefinition(panel) will reference related tests. Non standalone/orderable tests, should be modeled as orphan CatalogEntries referencing ObservationDefinition where the observation definition is an observationResultRequirement of any of the ActivityDefinitions.</p>\n<hr>\n<p>We are considering include SpecimenDefinition for storing specimen handling/temperature information. ActivityDefinition support SpecimenDefinition via its <code>specimenRequirement</code> property. The issue is we are modiling only panels as ActivityDefinitions, but Quest also describes orderable/standalone tests with specimen handling/temperature/requirements which also need to be stored in any place. So we thought modeling everyting orderable, either panel or test, as an ActivityDefinition, and for standalone tests, only one ObservationDefinition will be associated with ActivityDefinition. We also need advise on finding an accurrate place for storing requisition special handling, like PAP flag specified by quest, which indicates whether the requisition should be split between AP and Clinical. Is this model compliant with the idea behing ActivityDefinition/ObservationDefinition/SpecimenDefinition and Composition/CatalogEntry design? Do you recommend to modify our actual model in any way?</p>",
        "id": 189526818,
        "sender_full_name": "Guillermo Rdguez Glez",
        "timestamp": 1583177301
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span>  <span class=\"user-mention\" data-user-id=\"191408\">@Lorraine Constable</span>  ??</p>",
        "id": 189538729,
        "sender_full_name": "Eric Haas",
        "timestamp": 1583184371
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197051\">@Guillermo Rdguez Glez</span>  This is exactly what we're preparing to ballot in the Order Catalog project.  I can't tell for sure from the description above if you've already looked at the <a href=\"https://build.fhir.org/ig/HL7/fhir-order-catalog\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/fhir-order-catalog\">IG</a>, but I expect that it should be able to meet most of the needs.  It will be great to have your input (particularly if you have some needs that aren't yet being addressed).</p>",
        "id": 189561497,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1583208166
    },
    {
        "content": "<p>The order-catalog FHIR IG is approaching completeness on the <a href=\"https://build.fhir.org/ig/HL7/fhir-order-catalog/labservices.html\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/fhir-order-catalog/labservices.html\">laboratory service compendium part</a>. As <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>  says, we'll ballot this part as a STU ballot.<br>\n<span class=\"user-mention\" data-user-id=\"197051\">@Guillermo Rdguez Glez</span>  you are most welcome to check it out and contribute. The choice of resources has evolved after a long discussion with the FHIR Management Group, and CatalogEntry is no longer used.  A lab service is represented externally as a PlanDefinition, and internally as one or more ActivityDefinition + a number of ObservationDefinition, SpecimenDefinition, and optionnaly ChargeItemDefinition.<br>\nOrder catalog calls are every Friday, noon EST, except for the coming Friday, which will be skipped. The project has a dedicated listserv: <a href=\"mailto:ordercatalog@lists.hl7.org\" title=\"mailto:ordercatalog@lists.hl7.org\">ordercatalog@lists.hl7.org</a>. Not sure whether you are talking of the same Quest, but there are contributors from Quest to this IG, as you'll see.<br>\nLooking forward to your input on this project.</p>",
        "id": 189567400,
        "sender_full_name": "François Macary",
        "timestamp": 1583217542
    },
    {
        "content": "<p>Thank you very much <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> &amp; <span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> , I will study <a href=\"https://build.fhir.org/ig/HL7/fhir-order-catalog/labservices.html\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/fhir-order-catalog/labservices.html\">laboratory service compendium part</a> to adjust my design and let you know if  I still don't find a place to store all required information. Thanks for providing the link.</p>",
        "id": 189598247,
        "sender_full_name": "Guillermo Rdguez Glez",
        "timestamp": 1583246467
    },
    {
        "content": "<p>Great! <span class=\"user-mention\" data-user-id=\"197051\">@Guillermo Rdguez Glez</span>  Please also check the set of examples.</p>",
        "id": 189626117,
        "sender_full_name": "François Macary",
        "timestamp": 1583264119
    }
]