[
    {
        "content": "<p>I have a couple of question regarding lab results.  <br>\nIn HL7v2 a labresult  consists of a ORC segment stating the ordering number the ordering provider etc. <br>\nand then a bunch of OBX segments each containing a code (e.g. Hemoglobine) and a Value (8.1 mmol/L) <br>\nthis can be over 32 OBX'en</p>\n<p>If I want to use FHIR resource(s) to resemble this. <br>\nI think one have to use a DiagnosticReport resource a DiagnosticOrder resource (referenced in DiagnosticReport) and 32 Observation resources (also referenced by DiagnosticReport).  Am I correct?</p>\n<p>But because of the 32 references, my client software, should do 32 requests to retrieve the observations. With performance in mind this is not desireable is it? <br>\nAre there any other \"ways\" to implement this?</p>",
        "id": 153866302,
        "sender_full_name": "Stefan Scholte",
        "timestamp": 1484055481
    },
    {
        "content": "<p>You might look at _include on the search page - you could retrieve the DiagnosticReport and _include the results in a single response.  (Just be aware that paging is based on the number of reports returned, not the total number of records.)</p>",
        "id": 153866316,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484067556
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  but what should the server return if I use the _include search parameter (maybe a dumb question but I'm just starting implementing FHIR)</p>",
        "id": 153866366,
        "sender_full_name": "Stefan Scholte",
        "timestamp": 1484132958
    },
    {
        "content": "<p>With an _include, each page of results will also include the resources pointed to by the search set by the search criteria specified in the _include.  So if you ask for \"[base]/DiagnosticReport?.....&amp;_include=result\", you'll get entries for the first page of DiagnosticReports plus entries for all of the Observations pointed to by those DiagnosticReports.  (If multiple DiagnosticReports on the page point to the same Observation, it'll only be included in the search set once.   The entries corresponding to DiagnosticReport will have an entry.mode of \"result\" and the entries corresponding to Observation will have an entry.mode of \"include\".</p>",
        "id": 153866372,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484149612
    },
    {
        "content": "<p>But should I use a Bundle or a Composition? </p>",
        "id": 153866456,
        "sender_full_name": "Stefan Scholte",
        "timestamp": 1484228260
    },
    {
        "content": "<p>Well, search results are always in a Bundle and documents are always in a Bundle.  The real question is whether you want to put together a pre-defined package of everything which can then be shipped around, or you want people to query the piece or collection of pieces that are relevant to them based on relationships.  There's also the question of whether you'll have a RESTful interface - you can pass documents around without one, but you obviously can't do REST without one.</p>",
        "id": 153866459,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484231903
    },
    {
        "content": "<p>Thank you Lloyd for your answers, Perhaps I'm too much \"burdened by HL7V2 way of thinking\" </p>",
        "id": 153866468,
        "sender_full_name": "Stefan Scholte",
        "timestamp": 1484236552
    }
]