[
    {
        "content": "<p>Do any systems out there support tracking languages spoke at a location?  Something akin to the signs you see in windows or advertisements (at least in the US) that say \"Se habla español\".  FHIR already supports the concept of a schedulable interpreter service via the communication property on HealthCareService.  However the \"Se habla español\" case seems more like you are marketing to the demographic that speaks that language.  Asking for a friend (<a href=\"http://jira.hl7.org/browse/FHIR-25302\">FHIR#25302</a>).</p>",
        "id": 203316807,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1594239144
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?  Seems reasonable to have a standard extension, though whether it should be Location or HealthcareService (or both), I'm not so clear on.</p>",
        "id": 203330822,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594246757
    },
    {
        "content": "<p>Yes, we have the property on HealthcareService already, this was the first request on Location - and was looking for support in the community to determine if it should be an extension and stay that way, or move to core for it.</p>",
        "id": 203330964,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1594246859
    },
    {
        "content": "<p>Is this an indication that a Location resource is being used instead of an Organization or a HealthService? When I see a window sign \"Se habla español\" at a store, I don't assume that everyone in the apartments above it also speaks Spanish - which is what having this on the Location resource will actually indicate.</p>",
        "id": 203393246,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1594305379
    },
    {
        "content": "<p>I don't think it indicates that any more than having hours of operation on the Location indicates that everyone who works there is always present during those hours.</p>",
        "id": 203399832,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594308222
    },
    {
        "content": "<p>It would simply indicate that services are available using that language (and are available during those hours)</p>",
        "id": 203399954,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1594308253
    }
]