[
    {
        "content": "<p>Per spec (3rd bullet point under \"GROUP BY\"):</p>\n<ul>\n<li>\"For codes with translations (multiple codings), the code translations are assumed to be equal and the grouping by code SHALL follow the transitive property of equality.\"<br>\nIt seems this allows any observation resource(s) to define equality relationship between codings for the purpose of lastn? For example, an observation record from Hospital A has coding [C1, C2], another record from Dr. B's office has coding [C1, C3], and the spec seems to suggest, for the purpose of lastn operation, C1==C2==C3? I must be missing something otherwise the slope is simply too slippery?</li>\n</ul>",
        "id": 177065206,
        "sender_full_name": "Xiaocheng Luan",
        "timestamp": 1569943039
    },
    {
        "content": "<p>nope you are not missing anything and it is slippery.  how else would you do it?</p>",
        "id": 177065661,
        "sender_full_name": "Eric Haas",
        "timestamp": 1569943322
    },
    {
        "content": "<p>I would think allowing an observation to appear under multiple coding groups may not be as bad as it sounds, at least everything is still \"consistent\" with the data, and much can still be done by the client afterwards. The biggest problem with the current spec is that one coding error, or loose coding, or even perfectly correct coding with different levels of angularities could easily throw the whole thing off in unexpected ways. The assumption of equality between codings within a code is already shaky; the transitivity just amplifies it and I don't see a boundary. On top of that, it's challenging to implement, too, it's a dynamic equivalence system.</p>",
        "id": 177084729,
        "sender_full_name": "Xiaocheng Luan",
        "timestamp": 1569955133
    },
    {
        "content": "<p>yes all that. But as Eric says, what else can be done?</p>",
        "id": 177096768,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1569962909
    },
    {
        "content": "<p>Is there anything that has to be done? As an \"outsider\" (of healthcare), I think simply grouping by unique coding (system-code pair) might work, though not ideal? Yes, then an observation with multiple coding may fall under more than one groups (duplicates), but I think it's more of an annoyance than an error.</p>",
        "id": 177165621,
        "sender_full_name": "Xiaocheng Luan",
        "timestamp": 1570032899
    }
]