[
    {
        "content": "<p>Under lenient handling, the \"Client requests that the server ignore any unknown or unsupported parameter\". What if the unsupported parameter is not a top-level parameter, but instead inside a chain or _has?</p>\n<p>Suppose a server is doing lenient handling for a search <code>Encounter?subject:Group.foo=bar</code></p>\n<p>Should we:</p>\n<ol>\n<li>Reject the search with an error. Lenient handling was intended for top level query parameters only.</li>\n<li>Ignore the entire parameter \"subject:<a href=\"http://Group.foo\">Group.foo</a>\", return a self link that does not include this parameter at all.</li>\n<li>Ignore only \"foo\", perform the inner search without it (which would return all Groups, I suppose). Does the type modifier still limit the results to only Encounter where subject is a Group? What would the self link look like?</li>\n</ol>",
        "id": 268734008,
        "sender_full_name": "Paul Church",
        "timestamp": 1642702285
    },
    {
        "content": "<p>We do (1)</p>",
        "id": 268739426,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1642704486
    },
    {
        "content": "<p>Returning the data not properly filtered by chain and has isn't super useful as there's nothing the server can do with it.  On the other hand, at least returning a result with the search parameters you <em>do</em> understand provides a computable way for the client to understand the issue and decide what to do about it.  On the other hand, if you just fail, the client has no clue what happened and the user is stuck.  So my leaning is that #2 is best.  I wouldn't recommend #3.</p>",
        "id": 268760878,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642714212
    },
    {
        "content": "<p>Of course, if you don't trust the client to check the self link, then #1 is reasonable.</p>",
        "id": 268760908,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1642714231
    }
]