[
    {
        "content": "<p>We have several use cases for linking Encounters. </p>\n<p>I know in the UK various consultant episodes are part of a hospital provider spell (for an IP). This would be possible to support by using the partOf element.</p>\n<p>We have basically the same requirements in Sweden where a new encounter starts (for an IP) when there is transfer of responsibility of patient care (eg from Medicial to Surgical speciality). We could use a corresponding spell to keep track of the individual encounters for that as well. </p>\n<p>Those are both IP episodes. Now we have two use cases that are not supported by partOf.</p>\n<ol>\n<li>Ambulance encounter with a handover to an A&amp;E encounter </li>\n</ol>\n<p>These are two separate encounters with different organizational responsibility. We do not want a gap between them in time, and the A&amp;E encounters can be created in a Planned state for the A&amp;E to prepare, eg order tests, before the patient comes in. </p>\n<ol start=\"2\">\n<li>A&amp;E encounter with a subsequent admission (ie start of an IP encounter).</li>\n</ol>\n<p>The requirements are basically the same as for the ambulance to A&amp;E scenario. There is ideally no time gap, and the ward can start work before the encounter starts. </p>\n<p>There is the standard extension mentioned, but that is not sufficient as I see it.<br>\n<a href=\"https://www.hl7.org/fhir/extension-encounter-associatedencounter.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/extension-encounter-associatedencounter.html\">https://www.hl7.org/fhir/extension-encounter-associatedencounter.html</a></p>\n<p>How would we use the extension for 1 and 2 above, and especially the A&amp;E encounter where you want two references?</p>\n<p>Suggestion 1<br>\nWe should add two elements to the core Encounter resource; priorEncounter and subsequentEncounter (or similar naming). The intended use is to capture sequences of related encounters where there is not necessarily a parent episode that keeps them together. </p>\n<p>Suggestion 2<br>\nAdd an additional element (extensible coding?) to the standard extension mentioned above to give the referenced encounter context. The A&amp;E encounter above has two references, you would want to know why they are linked. Each reference type may come with additional business rules etc. </p>\n<p>Suggestion 2 would solve our requirements, but I think both suggestions are probably good. 1 would make it clearer, and is also an option to use instead of/or in addition to partOf.</p>\n<p>Thoughts?</p>",
        "id": 179566478,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1572549353
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 179567324,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572549943
    },
    {
        "content": "<p>There is an ongoing discussion on patient movement, which may be a way to provide the linking you require</p>",
        "id": 179579821,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1572558440
    },
    {
        "content": "<p>In the UK (hospitals) we've had a bit of confusion on how to link these together. Is this the same as what you are saying:<br>\nHospital Spell = EpisodeOfCare<br>\nConsultant Episode = Encounter? (linked to EpisodeOfCare)<br>\nADT's + care encounters = Encounter linked to Consultant Encounter</p>",
        "id": 179605590,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1572593697
    },
    {
        "content": "<p>We keep discussing this (<a href=\"https://wiki.hl7.org/Requirements_for_an_Universal_Encounter_model\" target=\"_blank\" title=\"https://wiki.hl7.org/Requirements_for_an_Universal_Encounter_model\">https://wiki.hl7.org/Requirements_for_an_Universal_Encounter_model</a>). EposodeOfCare vand Encounter with partOf takes care of most of the encounter hierarchies that we've discussing in the past. Martin's use case call for linking with 'sibling' encounters. prior and subsequent encounter references probably make sense, although they fail the 80% criteria and will probably have to de defined as extensions.</p>",
        "id": 179629054,
        "sender_full_name": "René Spronk",
        "timestamp": 1572617511
    },
    {
        "content": "<blockquote>\n<p>In the UK (hospitals) we've had a bit of confusion on how to link these together. Is this the same as what you are saying:<br>\nHospital Spell = EpisodeOfCare<br>\nConsultant Episode = Encounter? (linked to EpisodeOfCare)<br>\nADT's + care encounters = Encounter linked to Consultant Encounter</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191687\">@Kevin Mayfield</span> <br>\nI would absolutely see the Consultant Episode as an Encounter. But I would also see the Hospital Provider Spell as an Encounter, as the partOf references another Encounter. </p>\n<p>The EpisodeOfCare should be something that is on a higher level than an individual encounter, and can span over individual encounters. There can also be gaps between encounters in an episode of care. I think this description explains it in a good way (from EpisodeOfCare):</p>\n<p>EpisodeOfCare: Case, Program, Problem, Episode<br>\nEncounter: Visit, Contact </p>\n<p>The HPS I guess is rather often mapped 1:1 to a Consultant Episode as often transfer of specialty/consultant isnt required. </p>\n<p>I'm not sure what you mean with \"ADT's and care encounters\"? I would see it as:<br>\n- Patient is admitted--&gt;Hospital Provider Spell starts AND first Consultant Episode starts=Encounter A + Encounter B (partOf A)<br>\n- Transfer of Consultant responsibility--&gt;HPS unchanged, previous CE ends, a new CE starts=Encounter A+Encounter B (partOf A)+Encounter C (partOf A) .<br>\n-Patient is discharged--&gt;HPS ends, last CE ends =Encounter A+Encounter B (partOf A)+Encounter C (partOf A)</p>",
        "id": 180220056,
        "sender_full_name": "Martin Grundberg",
        "timestamp": 1573211218
    },
    {
        "content": "<p>Are you seeing episode as being across providers ? So the episode is from a patient perspective, whereas I may have leaned towards organisation viewpoint (episode starts when patient is admitted to hospital and ends when finally discharged)</p>",
        "id": 180220759,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1573211982
    },
    {
        "content": "<p>Yes, the episode is intended to be at an Organizational level.<br>\nAnd admission encounter when admitted, then partof encounters as the patient moves around the hospital.<br>\nIf was related to an ongoing condition, then might be associated back to an EpisodeOfCare for tracking.</p>",
        "id": 180380561,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1573418882
    }
]