[
    {
        "content": "<p>Hi,I am creating a binary resource from a Lab/Radiology report coming from a hospital but how that will be referenced in Observation or Diagnostic report resource,i dont see any reference for binary resource in it.</p>",
        "id": 153884601,
        "sender_full_name": "Ashish Anand",
        "timestamp": 1492065025
    },
    {
        "content": "<p>You should submit a change request asking for that to be added to Observation.related.target and possibly also DiagnosticReport.result.  You do have the ability to send a Binary as the result of an Observation using valueAttachment.</p>",
        "id": 153884664,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492092477
    },
    {
        "content": "<p>Also DiagnosticReport has .imagestudy and .image so you should look at those first before submitting a change request.  \"You do have the ability to send a Binary as the result of an Observation using valueAttachment.\"  Will be the response so will need to provide a pretty good use case reason why some other way is better or why can't use valueAttachment.  if you submit a tracker.</p>",
        "id": 153884690,
        "sender_full_name": "Eric Haas",
        "timestamp": 1492096424
    },
    {
        "content": "<p>Thank you</p>",
        "id": 153884725,
        "sender_full_name": "Ashish Anand",
        "timestamp": 1492112890
    },
    {
        "content": "<p>My use-case for adding it to \"related\" is I can easily see on Observation being based on another that happens to have no metadata - it's just a PDF.</p>",
        "id": 153884734,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492118887
    },
    {
        "content": "<p>There is DiagnosticReport.presentedForm for that. and valueAttachment still works or Media.  It doesn't seem like a step toward interoperablity to create more ways to do this.</p>",
        "id": 153884738,
        "sender_full_name": "Eric Haas",
        "timestamp": 1492124921
    },
    {
        "content": "<p>Lloyd, isn't your use case handled by Provenance? This observation is derived/extracted from that one (or from that binary document)? <br>\nEric, we can reference an Observation from a DiagnosticReport (\"the report calls out certain observations\"), but not the other way (\"these observations came from this printed report\"). <br>\nWithout more clarity on the use case, I'd lean towards Provenance as the answer.</p>",
        "id": 153884741,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1492129434
    },
    {
        "content": "<p>By those grounds, we don't need \"derivedFrom\" on Observation at all.</p>",
        "id": 153884742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492129665
    },
    {
        "content": "<p>(It can handle relationships to any resource)</p>",
        "id": 153884743,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492129677
    },
    {
        "content": "<p>I think Provenance is for secondary traceability, not primary business use.</p>",
        "id": 153884744,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492129700
    },
    {
        "content": "<p>secondary vs primary is not a good explination. We have recognized, shown in the W5 report, that there are times when elements of Provenance are brought into our other resources, because that element is critical to the functioning of that resource. This enables these other resources to function even when Provenance is not enabled/used/required. I would not call this primary vs secondary, as from a \"provenance\" perspective the Provenance record is always primary. That is to say when an organization wants Provenance, they will demand use of Provenance and they will get uniform \"provenance\". The deviations from relying on Provenance is recognition that not all organisations need or want Provenance; they might be tracking provenance another way...</p>",
        "id": 153884778,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492173247
    },
    {
        "content": "<p>Note, as the co-chair of security who own Provenance.... We would of course, love to have Provenance be necessary everywhere, thus removing all W5 from resources... but this would not be keeping with the FHIR principles... So judicious duplication where critical is the compromise. </p>",
        "id": 153884780,
        "sender_full_name": "John Moehrke",
        "timestamp": 1492178062
    },
    {
        "content": "<p>My vote is  for  a)Provenance  or b) related Observation with valueAttachment.  or  c) extension.   .related is intended to group observations and not a general catchall for other related resources.   Looking back I think allowing QR as resources may be a mistake since Provenance might be a better  fit for that too.</p>",
        "id": 153884846,
        "sender_full_name": "Eric Haas",
        "timestamp": 1492290797
    }
]