[
    {
        "content": "<p>hello there, I have a couple of questions for you guys. I am fairly new to fhir and wanted to see if you could help me with some questions:</p>\n<p>Does the practitionerRole fhir object dictate the rights and roles a particular user have? if so, how how does it? does a practitioner have multiple practitioner role records in the same organization? or does he have multiple practitioner roles scattered throughout multiple organizations.</p>\n<p>I am very confused as to what to tie a policy to. Policy as in a set of actions a user can do on a system. because i see practitioner roles in the fhir spec and it seems like policies should be tied to that.</p>\n<p>and more importantly, what dictates where the practitioner works? the practitioner role right?</p>",
        "id": 154018567,
        "sender_full_name": "santiago gil",
        "timestamp": 1542222946
    },
    {
        "content": "<p>PractitionerRole is not the same as \"user\".  A user might be a PractitionerRole, Patient or RelatedPerson.  FHIR doesn't currently have any resources to support user management (e.g. user, privilege, privilege group, etc.)</p>",
        "id": 154018578,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542224159
    },
    {
        "content": "<p>so if i wanted to link a practitioner to a user management system, it would be best to store the connection in the user management system?</p>",
        "id": 154018579,
        "sender_full_name": "santiago gil",
        "timestamp": 1542224306
    },
    {
        "content": "<p>Yes.  Though you could use an extension on the relevant resources if you needed to do it the other way.</p>",
        "id": 154018580,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542224355
    },
    {
        "content": "<p>There's a RESTful user management standard we usually recommend but its name escapes me at the moment.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 154018581,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542224389
    },
    {
        "content": "<p>oh man that would be awesome.</p>",
        "id": 154018582,
        "sender_full_name": "santiago gil",
        "timestamp": 1542224640
    },
    {
        "content": "<p>Practitioner.identifier can hold the user id... why is that not the solution?</p>",
        "id": 154018596,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542227725
    },
    {
        "content": "<p>It's harder to manage that from an access control perspective  Easier to control it if it's a separate extension.</p>",
        "id": 154018597,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542228124
    },
    {
        "content": "<p>I don't agree. The .identifier element is very logical to hold the userID.  I could certainly understand the logic that says that the IDM is the more authorative source of mapping from user to other identifiers. But that is a policy answer. not an ease of implementation.</p>",
        "id": 154018598,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542228264
    },
    {
        "content": "<p>The RESTful standard for User Management is System for Cross-domain Identity Management (SCIM) -- <a href=\"https://tools.ietf.org/html/rfc7642\" target=\"_blank\" title=\"https://tools.ietf.org/html/rfc7642\">https://tools.ietf.org/html/rfc7642</a></p>",
        "id": 154018604,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542228706
    },
    {
        "content": "<p>right?</p>",
        "id": 154018605,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542228711
    },
    {
        "content": "<p>Yes, that's what I was thinking of.  Thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 154018609,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542228939
    },
    {
        "content": "<p>so, we likely should add some mention of this on the security pages...</p>",
        "id": 154018610,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542228965
    },
    {
        "content": "<p>in my implementation of SCIM. I store the reference to the practitioner as an extension in the SCIM user object, because my analysis is that there might be multiple user accounts for a single practitioner, but I cannot see why there would be multiple practitioners for a single user account</p>",
        "id": 154018662,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1542248930
    },
    {
        "content": "<p>I second Lloyd. It also fits nicely with the way you do SSO with both Epic and Cerner in example. Their own recommendation when using external identity management system is to provision them and then store their username into your identity store. Epic doesn’t have SCIM but Cerner does</p>",
        "id": 154018712,
        "sender_full_name": "Veliyan Georgiev",
        "timestamp": 1542269320
    },
    {
        "content": "<p>Can one of you submit a CR to add a FAQ to the security-privacy module page? Help me craft the language that you would be looking for, and minimal text that would send you in the right direction..  I think the text should discuss this directionality point of identifier cross-referencing. As well as recommend SCIM as an potential solution for user account management.  The identifier topic is useful regardless of if you use SCIM or use a stack specific IDM.</p>",
        "id": 154018876,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542297954
    }
]