[
    {
        "content": "<p>Who owns the workflow for FHIR Jira tickets?  I've noticed you can't link tickets after a ticket has been resolved (the \"Link\" option is no longer available under \"More\").  Who can fix that?</p>",
        "id": 254603114,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632430295
    },
    {
        "content": "<p>Paging <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> =).  But if you're interested in non-authoritative, vague memories...</p>\n<p>I believe the rationale is that once a ticket is resolved, there's little chance of anyone seeing updates, so they are generally locked to prevent any changes that could effect their intent/resolution/interpretation/etc.</p>\n<p>For links such as marking duplicates, it's dangerous to try since the ticket may be trying to address old tickets that were applied insufficiently or incorrectly, marked as applied but not, etc.</p>",
        "id": 254607006,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632431836
    },
    {
        "content": "<p>I mean the workflow now is to re-open the ticket, link trackers, then re-resolve the ticket.</p>",
        "id": 254607851,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632432217
    },
    {
        "content": "<p>For historical reference, having linked trackers is very useful.  Can we pretty please update the workflow to allow linking?</p>",
        "id": 254608023,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632432295
    },
    {
        "content": "<p>Can you explain more about what your objectives are with the linking?  (Also, things like this are best asked in <a class=\"stream\" data-stream-id=\"184932\" href=\"/#narrow/stream/184932-JIRA.2FConfluence\">#JIRA/Confluence</a>)</p>",
        "id": 254622348,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632440307
    },
    {
        "content": "<p>PA has a bunch of trackers about RelatedPerson relationship and role.  We addressed those trackers over several meetings, and ended up with resolutions that \"conflicted\" (the intent of the resolution was consistent, but the specific wording we drafted was slightly different).    E.g. <a href=\"http://jira.hl7.org/browse/FHIR-19411\">FHIR#19411</a> and <a href=\"http://jira.hl7.org/browse/FHIR-26994\">FHIR#26994</a>.  Having these linked would be nice when we go to apply them so the editor can easily see that these are related.</p>",
        "id": 254708041,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632491877
    },
    {
        "content": "<p>This is the recent example that spurred this request, but there have been past examples as well.</p>",
        "id": 254708144,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632491906
    },
    {
        "content": "<p>Also - feel free to move this over to <a class=\"stream\" data-stream-id=\"184932\" href=\"/#narrow/stream/184932-JIRA.2FConfluence\">#JIRA/Confluence</a>  if you like.</p>",
        "id": 254708256,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632491960
    },
    {
        "content": "<p>Ok.  Trusted users can add comments, so what I've done in those situations is just comment and specify a hyperlink in the comment.  I can update the \"change groupings\" function to also allow changing linked issues I suppose.  But not sure what to name that combined ability.  I'll put it on my list of potential enhancements.</p>",
        "id": 254720841,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632496677
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - is the feature to be able to link resolved tickets still on your todo list?   I'd still find that very useful.  PA has several \"master\" trackers and I like being able to link all the \"child\" trackers so we have one place to look for all the related changes.  When both the master and children are already resolved, that isn't possible.  I've been trying not to use my \"reopen\" powers to add links, but doing a re-open, link, then re-resolve with same vote and a backdate is increasingly tempting when it isn't possible to do a link...</p>",
        "id": 271883830,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1644870516
    },
    {
        "content": "<p>Yes, that's still on the list.  It's tricky though as we <em>don't</em> want things like 'duplicate', or vote links to be allowed to issues that are already resolved.</p>",
        "id": 271892239,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644874577
    },
    {
        "content": "<p>Here is another example of two trackers that would be useful to link after voting:  <a href=\"http://jira.hl7.org/browse/FHIR-36074\">FHIR-36074</a> and <a href=\"http://jira.hl7.org/browse/FHIR-34261\">FHIR-34261</a>.</p>",
        "id": 273876799,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1646255090
    },
    {
        "content": "<p>Another example of two tickets that would be nice to link:  <a href=\"http://jira.hl7.org/browse/FHIR-36655\">FHIR-36655</a> and <a href=\"http://jira.hl7.org/browse/FHIR-36657\">FHIR-36657</a>.</p>",
        "id": 277752720,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1649087872
    }
]