[
    {
        "content": "<p>Hopefully a very quick question. How do you link an allergy to the encounter that asserted the allergy? I can see that \"similar\" resources such as Observation, Condition, Immunization etc. all have an Encounter reference, but not AllergyIntolerance.</p>",
        "id": 153928875,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1516030982
    },
    {
        "content": "<p>So far we haven't seen that's a requirement for most systems - i.e. it doesn't meet the 80% rule of \"most systems capture this\".  If you think that assessment is in error, you can certainly raise a change request.  Alternatively you could raise a change request asking for a standard extension.</p>",
        "id": 153928880,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516031681
    },
    {
        "content": "<p>Likewise AdverseEvent does not have a context reference. I ran into this recently when trying to link therapy related toxicity that is 'unnacceptable to patient' in chemotherapy to it's occurrence, ie which line of therapy did it happen during. I have created a condition profile with a category of 'therapy related toxicity' and a context reference.</p>",
        "id": 153928893,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1516035219
    },
    {
        "content": "<p>AdverseEvent is an event resource from a FHIR workflow perspective but has not yet been mapped to it and I think  the lack of a context  sounds like an critically important omission to this draft resource -  make a change request to add it.</p>",
        "id": 153928900,
        "sender_full_name": "Eric Haas",
        "timestamp": 1516039006
    },
    {
        "content": "<p>Agree.  Linking AdverseEvent to an encounter definitely sounds like part of the 80%.</p>",
        "id": 153928906,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516041442
    },
    {
        "content": "<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14458\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14458\">#14458</a></p>",
        "id": 153929092,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1516121331
    },
    {
        "content": "<p>Thanks</p>",
        "id": 153929115,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516132394
    },
    {
        "content": "<p>Clinically linking Allergy to the encounter would be a requirement, since the details of the reaction are in the encounter.  And an allergy reaction is different from an AdverseEvent only in that the allergy reaction is not an AdverseEvent the first time because no one knew the patient had an allergy.</p>",
        "id": 153929345,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1516221395
    },
    {
        "content": "<p>Reactions would certainly be tied to an encounter.  But the assertion of an allergy may well happen at a different time than the recording of the reactions.  Reactions would typically be captured as Observations or possibly Conditions.  Is it common for systems to tie an allergy itself to an encounter?  (It's not something I've seen.)</p>",
        "id": 153929388,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1516253095
    },
    {
        "content": "<p>In NZ, the GP2GP Data Model allows just about all clinical entries (including allergies) to be related to a primary care encounter. If treating a patient for the first time, a GP will commonly ask if that patient has any allergies and record them (or absence thereof) with the underlying PMS creating the links. Of course, these are patient assertions, but I'd say they account for a significant % of allergies &amp; intolerances recorded in EHRs.</p>",
        "id": 153929395,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1516255907
    },
    {
        "content": "<p>Yes, our EHR can associate an encounter with an allergy (and I have seen it done with other EHRs, too, who send us allergy data to aggregate in our population health platform).</p>",
        "id": 153929517,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1516309943
    },
    {
        "content": "<p>I think it's slippery associating an allergy risk to an encounter. What does it mean:<br>\n- the allergy was asserted during an encounter?<br>\n- the allergy was asserted because of an encounter?<br>\n- the allergy was the cause of an encounter?<br>\n- the allergy was informed of during an encounter?<br>\n- the allergy was caused by an encounter?</p>",
        "id": 153929584,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516357189
    },
    {
        "content": "<p>In our EHR, the allergy is documented during that encounter.</p>",
        "id": 153929632,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1516377549
    },
    {
        "content": "<p>If EHRs made a clear distinction between Adverse Reactions and Allergies (risk of AR in the future if exposed to xx substance) the answers to Grahame's question would be clearer. Patients assert that they have allergies during encounters; presenting complaints are more likely to be ARs (might be the result of a known risk); an AR might happen during an encounter and might be directly or indirectly caused by one (e.g. prescribed medication).  Unfortunately, even though FHIR contains some degree of separation, it is only possible to attach Adverse Reactions to an AllergyIntolerance resource, hence the need to link AllergyIntolerance resources to an Encounter to cover all of these use cases.</p>",
        "id": 153929728,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1516393634
    },
    {
        "content": "<p>Peter - I assumed that the distinction was clear, and was only asking about the 'risk of  x' case. Permutating with event vs condition only makes thing worse</p>",
        "id": 153929765,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516425887
    },
    {
        "content": "<p>The 'risk of x' is a clinical judgement by the provider.  If the risk is a potential allergic reaction and the provider is a downstream provider contemplating administering a medication on the patient's allergy list then x can only reasonably be estimated with knowledge of the original assertion of the allergy.  That would seem to be by referencing the encounter where the allergy was asserted.  The alternative of asking the patient for details that they may not recall or may never have known is far less satisfactory in most cases.  Of course, over 80% of systems do allow you to do that.</p>",
        "id": 153929882,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1516575575
    },
    {
        "content": "<p>I have a related use case that I'm not sure how to classify in FHIR. Can anyone suggest an approach?</p>\n<p>\"If the patient is unable to tolerate Dabrafenib + trametinib,  single agent dabrafenib or vemurafenib are options\". <br>\nDabrafenib+Trametinib are not a combination drug AFAIK, so to hold both in a single code, one would need to be created. </p>\n<p>So the patient is given a combination drug and is unable to tolerate the combination, but one of the single agents is acceptable. Here the patient could end up with a Condition or an Observation of a symptom. May have an AllergyIntolerance asserted, and this may also be considered an AdverseEvent.</p>\n<p>The condition has no link to the agents that caused it, but could be inferred because it is linked to a follow up encounter for that regimen or line of therapy. <br>\nThe AllergyIntolerance has no link to the point in the workflow where it was asserted (so I don't know which line of therapy this occured during). Also, I'm unsure if AllergyIntolerance can hold agent combinations in the code. It also does not have a link to a Condition or Observation that caused the assertion, but can code the causal substance.</p>\n<p>Would this qualify as an AdverseEvent? An expected toxicity, intolerable to the patient. No medical errors were made, but I think it still qualifies. This resource also suffers from the 'can I put a combination of agents in the suspectEntity'. AdverseEvent can also reference the condition, if this is an AdverseEvent, and will hopefully have a context reference. I use the context to determine the line of therapy these events occurred at. (in a decision support system)</p>\n<p>I guess I'm not suggesting any particular changes, but hoping someone has suggestions on the proper way to handle the above clinical statement in FHIR (taken from a lung cancer guideline). Thanks</p>",
        "id": 153930335,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1516724817
    },
    {
        "content": "<p>This is fairly complicated, but I'll take a stab at part of it.  I think what you are describing would be what could be thought of as a \"conditional intolerance\" - which is something that I don't believe we've addressed.  The idea is that there is an intolerance to dabrafenib <strong>if</strong> the patient is concurrently taking trametinib (and vice versa).  I don't think it would be a good idea to try represent this as an intolerance to the agents as a combination, because that is not how they are supplied, ordered or administered.   Representing the \"conditional intolerance\" would then be something that I think you would do in the extension space (at least at present), as the AllergyIntolerance resource doesn't have a mechanism for representing a precondition for the specified allergy or intolerance.</p>",
        "id": 153930353,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1516726873
    },
    {
        "content": "<p>One option would be to create two instances of <code>AllergyIntolerance</code>, one for each of the substances, and add notes to both that this problem only occurs in combination with the other substance.<br>\nSo you would create </p>\n<div class=\"codehilite\"><pre><span></span>AllergyIntolerance\n.code = Dabrafenib\n.note = &quot;Problem when used in combination with trametinib. No problems when used alone.&quot;\n</pre></div>\n\n\n<p>etc.</p>",
        "id": 153930654,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1516856186
    },
    {
        "content": "<p>Yes, that's a somewhat simpler and \"lighter\" approach to representing the \"conditional intolerance\".  Plus, of course, it's available right now without requiring an extension.  The downside, though, would potentially be that it wouldn't behave correctly with allergy/intolerance decision support applications, as false alerts would be expected to be generated for dabrafenib and trametinib alone as well as in combination.</p>",
        "id": 153930696,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1516890446
    },
    {
        "content": "<p>FYI - Yesterday, Patient Care approved both <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14566\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14566\">GF#14566</a> and <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14458\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14458\">GF#14458</a> to support referencing the Encounter from both AllergyIntolerance and AdverseEvent.</p>",
        "id": 153930817,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1516973812
    },
    {
        "content": "<p>Agree with support for the initial light approach that requires a human to read the information, and with moving forward with an extension that somehow encodes that it is a concurrent administration of multiple drugs that results in the intolerance. I suspect this is common enough in oncology - it would be great to get real examples. <span class=\"user-mention\" data-user-id=\"196572\">@Travis Stenerson</span> is this a real example?</p>",
        "id": 153930823,
        "sender_full_name": "Robert McClure",
        "timestamp": 1516981268
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <br>\nThis example is directly from the NCCN Non-small cell lung cancer guideline specifically for the BRAF V600E mutation positive disease.</p>",
        "id": 153930894,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1516996681
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> <br>\nIn AllergyIntolerance consider moving <code>encounter</code> from between <code>patient</code> and <code>onset</code> to before <code>recorder</code> or after <code>asserter</code>, as they are more relevant to <code>encounter</code>.</p>",
        "id": 153932529,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1517186536
    },
    {
        "content": "<p>The reason for the current sequence is to align with w5 patterns of:  patient (who.focus), encounter (context), onset (when.init)</p>",
        "id": 153932775,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1517230467
    },
    {
        "content": "<p>Thanks Michelle.</p>",
        "id": 153933125,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1517265681
    },
    {
        "content": "<p>If anyone is interested, the link for w5 is <a href=\"http://build.fhir.org/w5\" target=\"_blank\" title=\"http://build.fhir.org/w5\">http://build.fhir.org/w5</a></p>",
        "id": 153933127,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1517265723
    }
]