[
    {
        "content": "<p>Hi, all</p>\n<p>The scenario is If I choose a Nuclear Medicine Device in web input,  we expect system response which device related examination.<br>\nFor example, If I choose Gamma Camera, the system could list Sialoscintigraphy,  Thyroid Scan ...</p>\n<p>So is there any Resource could express the relationship between the device(Gamma Camera) and the examination(Sialoscintigraphy) ? How to use? </p>\n<p>The similar scenario, If I choose Sialoscintigraphy the system should list related medication, Tc-99m TcO4.<br>\nIs there any Resource could express the relationship, too?</p>\n<p>Thank you.</p>",
        "id": 154020017,
        "sender_full_name": "Clark",
        "timestamp": 1542787450
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> Is this something ActivityDefinition or PlanDefinition can support?</p>",
        "id": 154020271,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542823597
    },
    {
        "content": "<p>Combined with some value sets, I think yes. The ActivityDefinition would provide a way to describe the types of procedures, and the PlanDefinition would give you a way to define the applicability condition (i.e. a specific device).</p>",
        "id": 154020347,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1542842996
    },
    {
        "content": "<p>I don't think this is PlanDefinition or ActivityDefinition</p>",
        "id": 154022348,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543740639
    },
    {
        "content": "<p>Well, the first bit at least. This seems  \"what types of procedures can this device do\" and then \"what kind of products do we need for this procedure\"</p>",
        "id": 154022349,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543740797
    },
    {
        "content": "<p>Well, the first could be covered with PlanDefinition if you start with the procedure and list the devices that support it (_has?).</p>",
        "id": 154022351,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543742277
    },
    {
        "content": "<p>So while PlanDefinition can cover this specific case, I would think we should have  a way to link products to the things they can do or they need.</p>",
        "id": 154022352,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1543742352
    }
]