[
    {
        "content": "<p>A question from a FHIR Newbie<br>\nI’m looking at a use case, where I have to keep track of the patient’s main physician throughout his treatment within a hospital group. I intent to use EpisodeOfCare and the careManager element for this purpose with managingOrganisation being the individual hospitals or lower organisation units.<br>\nDSTU2 says, that each organization will have their own EpisodeOfCare which tracks their responsibility with the patient. That is fine, but as I see it, it also means that there will be a series of episode of care instances, which makes up the full “treatment episode” for a specific condition.<br>\nNow, if I consider a complex patient who receives treatment for different conditions in parallel, how can I figure out which episode of care instances belongs to which “treatment episode”?<br>\nI guest a unique condition for each “treatment episode” is one option. But are you really expected to have that?<br>\nCurrently, I consider extending EpisodeOfCare with a previousReference element, so that I can represent the sequence making op a “treatment episode”. Does that sound as a good solution?<br>\nI also consider extending EpiodeOfCare with a partOf reference (like Encounter), so that I can have different a different type of EpisodeOfCare representing the “treatment episode”.<br>\nRegards,<br>\nChristian Jeppsen</p>",
        "id": 153857776,
        "sender_full_name": "Christian Jeppesen",
        "timestamp": 1479484214
    },
    {
        "content": "<p>Do you have a single \"Patient\" instance shared among the hospital group?  If so, you don't need to have an EpisodeOfCare to represent their overall care by the hospitals - you can simply track their primary physician on the Patient instance directly and leave EpisodeOfCare instances to track care associated with particular conditions.</p>",
        "id": 153857779,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479492046
    },
    {
        "content": "<p>Yes, you just keep using the same episode of care, so no need to link to another one.</p>",
        "id": 153858583,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1480242620
    }
]