[
    {
        "content": "<p>HI! Is there some way to reference from practitioner to organization or vice versa? Only relation between practitioner and organization I found is: practitioner.qualification.issuer element but this does not look like a link I need... Descriptions says: \"Organization that regulates and issues the qualification\". I need link between practitioner and organization because there can be several different organizations and/or practitioners related to one study.</p>",
        "id": 161325475,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1553156350
    },
    {
        "content": "<p>You probably want PractitionerRole: <a href=\"http://hl7.org/fhir/practitionerrole.html\" target=\"_blank\" title=\"http://hl7.org/fhir/practitionerrole.html\">http://hl7.org/fhir/practitionerrole.html</a> . It is a separate resource so it allows m-to-n relations between docs &amp; orgs, and it also allows you to specify in which capacity the practitioner is linked to the organization in question.</p>",
        "id": 161339938,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1553171095
    },
    {
        "content": "<p>I did check practitionerRole earlier and I was considering that I might need to add that to our implementation.  With practitionerRole I'm facing the same problem. If there is multiple organizations or multiple practitioners involved in one study. There is practitioner Σ 0..1 Reference(Practitioner) and organization   Σ 0..1 Reference(Organization).</p>",
        "id": 161340530,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1553171632
    },
    {
        "content": "<p>Right, to link multiple practitioners to a single org you would need one PractitionerRole resource per Practitioner (and similar if you were linking the same doc to multiple orgs). But maybe I am not understanding the use case quite right, is the underlying goal that you want to link a bunch of docs and/or orgs to another resource that represents the study (ResearchStudy resource)?</p>",
        "id": 161346406,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1553176235
    },
    {
        "content": "<p>Ok thanks I think I got it. I'm still figuring this out a little bit. I would not like to add another resource if it's not necessary. I actually have a provenance resource which I use to present activity made by practitioner (UPDATE/CREATE). Could this actually be the way to tie organization and practitioner together? At the moment I'm referencing from provenance.agent.who to practitioner. I don't know why I didn't get this idea sooner. I could reference to both: practitioner and organization from provenance and that would tie them together? Would this kind of solution be reasonable?</p>",
        "id": 161428791,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1553242845
    },
    {
        "content": "<p>Just noticed that provenance.agent.who is 1...1, so does not work because I can't add both practitioner and organization to that. If there is no another way I guess I have to add practitionerRole. to my implementation.</p>",
        "id": 161429695,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1553243847
    },
    {
        "content": "<p>Now I had another idea. What if I put link in provenance.agent.who to practitioner and provenance.agent.onBehalfOf to organization? That way I would not have to add practitionerRole at all and organization and practitioner would be tied together. Can someone confirm does this sound like a reasonable way to use these resources I have in use?</p>",
        "id": 161429869,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1553244064
    },
    {
        "content": "<p>Hm , not sure if this is the right way to go, but I don't know enough about Provenance to really judge it - <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> is this maybe your turf? (or your ping forwarding turf <span aria-label=\"smile\" class=\"emoji emoji-263a\" role=\"img\" title=\"smile\">:smile:</span>)</p>",
        "id": 161440131,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1553254750
    },
    {
        "content": "<p>Thanks for the help so far! I hope it's the right way. At least it seems like a right way. provenance.agent.who presents \"Who participated\" and agent.onBehalfOf presents \"Who the agent is representing\".</p>",
        "id": 161442360,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1553256930
    },
    {
        "content": "<p>Provenance is not the solution. Provenance is for recording the provenance of the target.<br>\nPractitionerRole is the intended linkage between a Practitioner and one-or-more Organizations. Why is that not useful?</p>",
        "id": 161445040,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553259478
    },
    {
        "content": "<p>I see you mentioned involvement in a study. Did you look at CareTeam?</p>",
        "id": 161445104,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553259507
    },
    {
        "content": "<p>It would be easier to help if you could describe the scenario. Simply identifying the technical need to link Practitioner and Organization does not give us much to go on to help you pick the 'best' solution. There is also Group, List.</p>",
        "id": 161445239,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553259624
    },
    {
        "content": "<p>If you need a Practitioner and also need the Organization and or the role, PractitionerRole is the only 'correct' solution.</p>",
        "id": 161452911,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553265385
    },
    {
        "content": "<p>Sounds like I have no other choice than add practitionerRole. Clad that I asked so the implementation will be correct. Thanks a lot for the help :)</p>",
        "id": 161617873,
        "sender_full_name": "Lauri Karppinen",
        "timestamp": 1553494997
    },
    {
        "content": "<p>That's what the community is here for :)  Thanks for asking - because not everyone does...</p>",
        "id": 161644591,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553521823
    }
]