[
    {
        "content": "<p>Hi all,<br>\n  We have a use case to retrieve a list of discharge summary documents from a clinical repository. The documents will be pre-assembled in CDA format (likely level 1 only) before being converted to FHIR. While reading the documents page, it's not clear to me  if documents must be represented using Bundle. So my question is \"is it FHIR conformant to use a list of Composition resource for a list of documents\"? If so, is there any implication to support submitting documents to the repository in this manner?  Thank you!</p>",
        "id": 154019852,
        "sender_full_name": "frank cao",
        "timestamp": 1542739514
    },
    {
        "content": "<p>A FHIR document must be a Bundle whose first entry is a Composition.  However, you might find it useful to have your list be a collection of DocumentReference instances that provide metadata and point to the documents rather than the documents themselves</p>",
        "id": 154019853,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542740438
    },
    {
        "content": "<p>Thank you Lloyd. If I want to query for a list of documents of a certain type, can I use search on Composition and return a bundle of Bundles? In the bundle, each entry may be either a document bundle or a documentReference.</p>",
        "id": 154020244,
        "sender_full_name": "frank cao",
        "timestamp": 1542820550
    },
    {
        "content": "<p>The more general solution is to use DocumentReference. More  general in that it can support ANY kind of document format, including CDA and FHIR document. Once you have everything in FHIR Document form, there is still an opportunity to use DocumentReference as the single method of getting the metadata alone, and also to get link to a seralized instance of the Composition. I think this does require that anyone creating a Composition,  to determine when they are done assembling the first version, seralize it into a Bundle (to make it a formal document), and referencing that with a DocumentReference. Note the DocumentReference can also have a direct pointer to the Composition in addition to the attachment of the seralized bundle.  There is not an obvious place in DocuentReference for this direct pointer to Composition, I guess this should be clarified. Else it would today be able to be in DocumentReference.context.related</p>",
        "id": 154020247,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542821102
    },
    {
        "content": "<p>all good things to discover during this STU phase...</p>",
        "id": 154020248,
        "sender_full_name": "John Moehrke",
        "timestamp": 1542821153
    },
    {
        "content": "<p>Depends on if you use Bundle or DocumentReference:<br>\nGET [base]/bundle?composition.type=xxxx, or<br>\nGET [base]/documentReference.type=xxx</p>",
        "id": 154020263,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1542822788
    }
]