[
    {
        "content": "<p>Hi All,<br>\nHow to link up list resource to Organization? Can anyone suggest me?</p>",
        "id": 180105954,
        "sender_full_name": "rekha",
        "timestamp": 1573107909
    },
    {
        "content": "<p>What is your objective for the link?  What kind of List?  Organization is the maintainer?  The author?  A member of the List?</p>",
        "id": 180143562,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573140910
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> In my usecase ,kind of List is Patient List and Organization is the maintainer.</p>",
        "id": 180202663,
        "sender_full_name": "rekha",
        "timestamp": 1573188678
    },
    {
        "content": "<p>Looks like List.source should be extended to support Organization.  You should submit a change request.  In the meantime, you'll need to use an extension</p>",
        "id": 180204742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573192089
    },
    {
        "content": "<p>Okay, Thankyou <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>.But if we create an extension in List Resource we wont be able to perform operation for getting List resources associated with selected Organization resource. So,can we create an extension to Organization resource in alternate?? Is it preferable?</p>",
        "id": 180205567,
        "sender_full_name": "rekha",
        "timestamp": 1573193421
    },
    {
        "content": "<p>You'd have to define a custom search parameter that would let you search Lists by Organization.  You could define an extension on Organization, but the pointer wouldn't really be the right way.  Needing to update the Organization every time a new List gets created the Organization is responsible for doesn't seem terribly appealing.  And it would be inconsistent with how Lists that are the responsibility of Practitioners, Devices and others are handled.</p>",
        "id": 180205806,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573193862
    },
    {
        "content": "<p>Okay,Thankyou <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 180207634,
        "sender_full_name": "rekha",
        "timestamp": 1573196983
    }
]