[
    {
        "content": "<p>Hello, everyone. The task is to keep a list of addresses served by a doctor. What is the best resource to use for this?</p>",
        "id": 251223650,
        "sender_full_name": "Nata Samarina",
        "timestamp": 1630327589
    },
    {
        "content": "<p>PractitionerRole comes to my mind <a href=\"http://hl7.org/fhir/practitionerrole.html\">http://hl7.org/fhir/practitionerrole.html</a>. so to get all the addresses you would pull all that doctors PractitionerRole resources</p>",
        "id": 251223820,
        "sender_full_name": "John Moehrke",
        "timestamp": 1630327714
    },
    {
        "content": "<p>Can you expand on what \"addresses served by a doctor\" means <span class=\"user-mention\" data-user-id=\"243524\">@Nata Samarina</span>?</p>",
        "id": 251251939,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630339391
    },
    {
        "content": "<p>As noted by John, yes this would be the locations referenced by the PractitionerRole<br>\n(which also indicate what they do at each of the locations - as may be different)</p>",
        "id": 251316942,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1630371431
    },
    {
        "content": "<p>Addresses served by a doctor are those that are assigned to a doctor (detailing to the street). For example, a doctor serves the streets \"White\", \"Green\". This means that patients from \"White\" and \"Green\" streets should come to see this doctor, they should not come to another doctor of the same specialization. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 251339859,
        "sender_full_name": "Nata Samarina",
        "timestamp": 1630392582
    },
    {
        "content": "<p>So \"geographic boundary served by the Practitioner\".  This sounds like extension space.  Typically this would probably be a reference to a Location that describes the geographic boundary with coordinates.  However, you could also have a list of partial addresses with just postal codes or street names.</p>",
        "id": 251386302,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630417184
    }
]