[
    {
        "content": "<p>Hi, is there somewhere on <a href=\"http://build.fhir.org\" target=\"_blank\" title=\"http://build.fhir.org\">build.fhir.org</a> that has a running list of breaking changes?</p>",
        "id": 153939518,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1519254891
    },
    {
        "content": "<p>Nope.  We compile that list during the QA period prior to formal balloting and publication.  It's too much work to maintain otherwise (with changes being made, tweaked, reversed, etc.).  If you want to get a sense of changes, you can look at gForge and filter to the non-compatible applied changes.</p>",
        "id": 153939522,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519256040
    },
    {
        "content": "<p>Yah.. figured gForge was the goto place. Thought I'd ask, though.</p>",
        "id": 153939528,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1519256793
    },
    {
        "content": "<p>If someone wants to go through gForge and compile the list when we go to ballot, I'm quite sure Grahame wouldn't fight them for the privilege... :)  Turning tracker items into summary form that conveys the important gist without overwhelming with detail isn't easy.</p>",
        "id": 153939537,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519261473
    },
    {
        "content": "<p>something I did a few years back in my toolset: <br>\nFor requirements / Changes that were \"critical\"/\"customer facing\",  the field \"Release note summary\" had to be filled in. This was then poured onto the Release Notes.</p>",
        "id": 153939584,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519277702
    },
    {
        "content": "<p>Perhaps would be possible/interesting to enforce this in our change tracker toolset? <br>\nI worked with Requirements, not Change requests, but the idea should apply in the same way.</p>",
        "id": 153939585,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1519277748
    },
    {
        "content": "<p>An enhancement to consider for JIRA once we're there perhaps :)</p>",
        "id": 153939587,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519278697
    },
    {
        "content": "<p>it get's overwhelming very quickly. It's not good giving you a change list that's 500-800 items long. No one can find anything. That's why we've focused more recently on giving good diff views. <span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span> have you found them? there's 2: R3/R2 difference (which I'll update during QA period) and page difference</p>",
        "id": 153939600,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519280278
    },
    {
        "content": "<p>I'm not sure where the R3/R2 differences are... I found the page differences.<br>\nI'm more-so looking for a list of changes that I should be aware of if I'm trying to target the current build. Hard for me to know what I need to change in a system without searching through all gForge tickets.</p>",
        "id": 153939690,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1519310874
    },
    {
        "content": "<p>We don't (and can't) reasonably maintain that list for the current build.  (And it could change 30 seconds after you looked at it anyhow.)</p>",
        "id": 153939720,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519316212
    },
    {
        "content": "<p>It might be worth asking the Toolsmiths - particularly those who produce the reference libraries. From a developer's perspective, the IDE lists everything I need to change when I migrate to a new version of the C# Reference Library.</p>",
        "id": 153939807,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1519328741
    },
    {
        "content": "<p>That's not the complete list in the dotnet ib, but it is the ones that I've personally had to deal with...</p>",
        "id": 153942136,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1520199272
    }
]