[
    {
        "content": "<p>I have a collection of FHIR PlanDefinitions. Now I am going to develop a customized operation which returns related PlanDefinitions for a given one. The purpose is that when client select a PlanDefinition, the server will provide, \"you may also want to check these related plans\". Such relationships are pre-calculated using PlanDefinition's characterization, such as purpose, target, etc. When I return the result of related PlanDefinitions, should the result be a List or a Bundle?</p>",
        "id": 244345102,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1624999495
    },
    {
        "content": "<p>My leaning would be a searchset bundle.  You could even define the operation as a _query.  That's more or less what it is.</p>",
        "id": 244349665,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625001710
    },
    {
        "content": "<p>That would also give you paging control.</p>",
        "id": 244349682,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625001723
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Interesting idea about using _query. I checked FHIR spec but there is not much content about _query search. Assume I create a OperationDefinition \"foo\" with type _query. Since it is defined as a operation but used as search parameter, should I indicate that in CapabilityStatement's searchParam section or operation section? <br>\nAnd how do I specify which \"regular\" search parameters can be appended to _query=foo? For example, _count is allowed but no others.</p>",
        "id": 244430332,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1625062789
    },
    {
        "content": "<p>I think we have a tracker item about that.  I vaguely recall that whatever search parameters you support at the 'base' or for the resource you invoke the operation from, it's expected you'd also support for the operation.  Would that work for you?</p>",
        "id": 244433036,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625063807
    }
]