[
    {
        "content": "<p>Hi all, new to this site (hope I am using it correctly - my apologies if I'm not) I previously posted this in social, but this may be a better place for it.</p>\n<p>I was wondering if there is a list of devices that are currently operating under FHIR standards? I.E. glucose monitor, blood pressure monitor, any kind of patient monitoring device really. </p>\n<p>Thanks!</p>",
        "id": 184760207,
        "sender_full_name": "Mason Paschall",
        "timestamp": 1578079428
    },
    {
        "content": "<p>There is no such list that I'm aware of.  And I'm not even sure how such a list could be maintained on an international basis.</p>",
        "id": 184761091,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578080114
    },
    {
        "content": "<p>I'm more interested in U.S. devices if that would make it more likely for a list to be out there. I really just want to see which monitoring devices out there are actively using FHIR</p>",
        "id": 184761929,
        "sender_full_name": "Mason Paschall",
        "timestamp": 1578080775
    },
    {
        "content": "<p>I doubt there are any</p>",
        "id": 184762433,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1578081161
    },
    {
        "content": "<p>I've worked in this space quite a bit, and haven't encountered a single device that would natively support FHIR.<br>\nHowever, many of this kind of devices nowadays have companion apps, and I'm hearing some of the apps are getting FHIR support some time in the future. Same for cloud services offered by device manufacturers (which expose the data from the device uploaded by the companion app).</p>\n<p>Today, the most common scenario is that you have third party apps and services that communicate with the device directly (through USB, Zigbee, or Bluetooth, for instance) or with a cloud service of the device vendor, and then convert that data to FHIR. I've personally been involved in a few projects of this kind. I also know of other projects I haven't been involved in. Also, the <a class=\"stream\" data-stream-id=\"179222\" href=\"/#narrow/stream/179222-finnish-PHR\">#finnish PHR</a> platform is all about having data from these personal monitoring devices available for citizens and healthcare practitioners through apps, in FHIR format.</p>",
        "id": 184794349,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1578125834
    }
]