[
    {
        "content": "<p>I'm working on building a lightweight terminology server. When trying to implement the FHIR ValueSet, I noticed that there is need to localise the concept descriptions. For example, the current FHIR ValueSet UnitsOfTime ( <a href=\"http://hl7-fhir.github.io/valueset-units-of-time.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/valueset-units-of-time.html\">http://hl7-fhir.github.io/valueset-units-of-time.html</a>) uses \"s\" to display second. What happens to the users who need to display \"second\" inside of \"s\" on their user interface?  Does that means local terminology server need to have a different ValueSet or use different descriptions to replace the HL7 standard? Also, does FHIR Restful API support localisation in the ValueSet $expend operation?</p>",
        "id": 153840857,
        "sender_full_name": "Jeffrey Chen",
        "timestamp": 1469419121
    },
    {
        "content": "<p>generally, have a look at ExpansionProfile. And see how the value set is extended for Chinese. That should point you in the general direction to go....</p>",
        "id": 153840864,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469420663
    },
    {
        "content": "<p>as in, that particular value set is extended for Chinese</p>",
        "id": 153840865,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469420682
    },
    {
        "content": "<p>Thanks Grahame. Having a look at the ValueSet expansion profile, \"profile\" looks good but there is no agreed format or functionality for the target has been defined.<br>\nThis happens a lot when local implementation uses SNOMED CT language refset. Displaying \"haemochromatosis\" instead of \"hemochrombtosis\" may be considered as disaster to some clinicians.</p>",
        "id": 153840869,
        "sender_full_name": "Jeffrey Chen",
        "timestamp": 1469421329
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192022\">@Jeffrey Chen</span>  That's why there is a language reference set in SNOMED CT. The local version of SCT should accommodate the local language description.</p>",
        "id": 153841572,
        "sender_full_name": "Michael Osborne",
        "timestamp": 1469738595
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192047\">@Michael Osborne</span> , SNOMED CT does support dialect through language refset. The qeustion is how FHIR terminology service knows which dialect is asking for? Or, should one terminology service only support one dialect during implementation?</p>",
        "id": 153841584,
        "sender_full_name": "Jeffrey Chen",
        "timestamp": 1469744544
    },
    {
        "content": "<p>the terminology server can support multiple dialects. The client can ask for a particular language in the expansion profile or as a parameter to the $expand operation. I don't know what you mean when you say 'there is no agreed format or functionality for the target'</p>",
        "id": 153841614,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469768873
    },
    {
        "content": "<p>I thought the syntax for query the terminology server to get a value set using Austrlian language refest is <code>[base]/ValueSet/administrative-gender/$expand?profile=http://snomed.info/sct/32570271000036106</code>. The parameter <code>profile</code> has no agreed format or functionality for the target which is stated at <a href=\"https://hl7-fhir.github.io/valueset-operations.html#expand\" target=\"_blank\" title=\"https://hl7-fhir.github.io/valueset-operations.html#expand\">https://hl7-fhir.github.io/valueset-operations.html#expand</a>. Maybe it should be <code>[base]/ValueSet/administrative-gender/$expand?displayLanguage=en-AU</code> but what happen to a state level dialect?</p>",
        "id": 153841628,
        "sender_full_name": "Jeffrey Chen",
        "timestamp": 1469778102
    }
]