[
    {
        "content": "<p>Hi all. I'd like to better understand how to differentiate between organizations and locations. Is a city hospital (location) part of a state department of health (organization) but that is part of a state jurisdiction (state)? The confusion arises because of this note in <a href=\"https://www.hl7.org/fhir/location.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/location.html\">https://www.hl7.org/fhir/location.html</a>: \"Organization is intended to represent the more conceptual hierarchies, such as a ward\" then goes on to describe how jurisdictions are actually locations.</p>\n<p>Here's the quote for context:<br>\n&lt;&gt;<br>\nLocations and Organizations are very closely related resources and can often be mixed/matched/confused.<br>\nThe Location is intended to describe the more physical structures managed/operated by an organization, whereas the Organization is intended to represent the more conceptual hierarchies, such as a ward.<br>\n...<br>\nAnother use of location could be for describing a Jurisdiction. This jurisdiction may be considered a classified boundary which could be a combination of a physical boundary, and some other discriminator(s):<br>\nNation - Country wide community or Federal Government (Ministry of Health)<br>\n&lt;/&gt;</p>",
        "id": 153948765,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1522259988
    },
    {
        "content": "<p>The issue here is that there is no real fixed definition between the 2. Some systems have very blurry edges between the 2 concepts, and as a result, so does the definition.</p>",
        "id": 153948824,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1522270730
    },
    {
        "content": "<p>If I needed to ask you to go to Emergency, is that an Organization, and Location or Both?<br>\n(and how do systems represent that?)</p>",
        "id": 153948825,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1522270816
    },
    {
        "content": "<p>In FHIR terms, hospitals are usually probably both an organization (group of people with responsibility) and a physical location.   The state's oversight of the hospital organization - and the hospital physical site is driven by the physical site falling within the physical boundary of the state's jurisdiction.</p>",
        "id": 153948851,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1522274733
    },
    {
        "content": "<p>Thanks both, these two explanations make a great deal of sense.</p>",
        "id": 153948936,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1522296223
    },
    {
        "content": "<p>The New Zealand Health Provider Index makes these distinctions...<br>\nPractitioners - individuals who provide healthcare services<br>\nFacilities - the physical location where healthcare services are provided<br>\nOrganisations - the organisation (possibly better described as legal or contracting entity) that provides healthcare services at a facility<br>\nAs Brian says, there are often overlaps between these entities. For example, some GPs are effectively one-person organisations. Looking at some of the use cases above, I would classify a hospital ward or ED as a location/facility and the hospital as a whole would be the organisation.  Telehealth also raises some interesting questions in this respect.</p>",
        "id": 153948949,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1522304240
    },
    {
        "content": "<p>That’s very interesting. My actual use case is in lower and middle income countries where health IT often sees facilities as separate representation to admin hierarchy like districts they report to. So overlap seems common in a FHIR approach and your distinction helps with understanding</p>",
        "id": 153948951,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1522306708
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194192\">@Richard Stanley</span> Also investigate the \"HealthcareService\" resource, I rely heavily on it for scenarios like yours.</p>",
        "id": 153951831,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1523455022
    }
]