[
    {
        "content": "<p>Hello All,<br>\ncan you help us to understand FHIR modeling to represent Patient &amp; its department association ? Also association between Practitioner &amp; department ? <br>\nhere department i mean  is  a specialized care unit within a Hospital.</p>\n<p>Thanks in advance!</p>\n<p>Regards</p>",
        "id": 165301151,
        "sender_full_name": "Kapil",
        "timestamp": 1557450820
    },
    {
        "content": "<p>1. Organization can be 'nested' down to the level of department through the 'partOf' element.<br>\n2. Patient refers to the custodion of its record through the 'managingOrganization' element, that refers to an Organization.<br>\n3. Where a Patient is actually treated is recorded in an Encounter, that refers to both the Patient (subject element) and the Organization (possibly multiple) via the location element.<br>\n3. Practitioner is connected to an Organization through a third resource: PractitionerRole.<br>\nYou may find the <a href=\"http://clinfhir.com\" target=\"_blank\" title=\"http://clinfhir.com\">ClinFhir</a> Scenario builder useful to gain insight in how resources can be connected.</p>",
        "id": 165303567,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1557454677
    },
    {
        "content": "<p>Thanks  <span class=\"user-mention\" data-user-id=\"191757\">@Christiaan Knaap</span> <br>\nso just to confirm understanding..in order to model the 'Patients association (enrolling) with multiple departments within Hospital'  shall we represent it by separate Encounter instances where Encounter.Location represents department ? <br>\nRegards,</p>",
        "id": 166296192,
        "sender_full_name": "Kapil",
        "timestamp": 1558549946
    },
    {
        "content": "<p>Correct</p>",
        "id": 166346353,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1558604731
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"218784\">@vkapil</span>  Encounter.location would represent the physical location of the department (building, room, ....), which is detailed in the referenced Location resource.<br>\nA department in terms of an organizational unit would be referenced via Encounter.serviceProvider (reference to an Organization).</p>\n<p>Like: the urology department may be located partially in floor 5 south and partially in floor 8 north. In this case \"urology department\" is an Organization while \"floor 5 south\" and \"floor 8 north\" are two different Locations</p>",
        "id": 166353091,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1558612208
    }
]