[
    {
        "content": "<p>I could not find easy way of writing both room &amp; bed number in Location resource. We can use \"physicalType\" which can define if it is room or bed but it's cardinality is 0...1 means in one single resource, we can have either bed or room as physicalType. And there are no concrete elements for holding up room or bed number values. Though we can use name element to write room or bed number but still this element can hold any data or any granularity, for example- It can have building name, room name and bed number, all of them. </p>\n<p>V2 used to define all these location elements (bed, room, building, floor etc.) in one single data type (PL). It was easy to use. </p>\n<p>Either we have to use extension to define both room and bed number. or <br>\nmay be can use one Location Resource with physicalType as bed and another Location resource with room, first one (bed one) would be partOf another one (room one). But second option is adding up complexity to manage small piece of data.</p>\n<p>Is there something I am missing to understand? What could be the right way to map room and bed number in Location resource?</p>\n<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span>  any thoughts on above issue, thanks.</p>",
        "id": 154009392,
        "sender_full_name": "Aditya Joshi",
        "timestamp": 1539695469
    },
    {
        "content": "<p>You can Location.partOf to link bed location to room location</p>",
        "id": 154009460,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1539709334
    },
    {
        "content": "<p>As yunwei points out, you can use the part of structure to get to the room details, then its parent to get the ward and so on (depending on your location heirachy)<br>\nThere is an example diagram of this in the spec.<br>\nWe have been discussing how we might update the encounter to make this easier to use at the Baltimore WGM.</p>",
        "id": 154009563,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1539725963
    },
    {
        "content": "<p>Updates will be applied as R4 closes.</p>",
        "id": 154009564,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1539725974
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>  &amp; <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> <br>\nYes, that is one of the option I have mentioned in my earlier post. but this is much more complex implementation (just if we compare to V2 PL data type). bed, floor, room, building, point of care like ward- I believe these are some common data elements for any location, specifically when define Patient location in Hospital. </p>\n<p>Yes, some easier way would be great thought. Hope to see that change in R4 <span class=\"emoji emoji-1f44d\" title=\"thumbs up\">:thumbs_up:</span>  :simple_smile:</p>",
        "id": 154009756,
        "sender_full_name": "Aditya Joshi",
        "timestamp": 1539774615
    }
]