[
    {
        "content": "<p>So, this past week I ran into a wtf? moment while trying to to use the Location resource to geocode the hospitals associate with Medicare Health Service Areas (HSA) and display them on a Google Map.  So, like....  why isn't Location structured as a geojson resource???  This is such an obvious data structure, with widespread support and implementation via the GIS community and geodatabases.  Did HL7 simply not want the overhead of supporting Point datatypes?  Are people actually using the XML version of Location in a substantial capacity so they didn't think about geojson?  I don't understand how this resource got to be the way it currently is.</p>",
        "id": 153894224,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1497623821
    },
    {
        "content": "<p>I don't know anything about geojson, but please look at <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10234\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=10234\">GF#10234</a> and <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13391\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13391\">GF#13391</a>, and add your comments there if appropriate. There have been other calls for richer geospatial information in Location.</p>",
        "id": 153894239,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1497631310
    },
    {
        "content": "<p>Ah!  Thank you.  These links are exactly what I was hoping to find.  I'll draft some thoughts and post them to gForge. </p>",
        "id": 153894249,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1497635039
    },
    {
        "content": "<p>Some musings...  the more I look into this though, for Location to align with GIS systems is going to require a fairly big ask of FHIR whether it wants to support Point, Line, Polygon, and other geospatial primitives.  Location is very similar to what GIS considers a Feature.  What's really interesting about geojson though is that it basically defines a Map resource (basically a List of Features), and supports a feature field which is perfect for storing FHIR resources.  That part of my project worked <em>great</em>, and we can lay FHIR resources directly into our geojson and do really great maps with them.  But <code>Location.position</code>is fairly nonstandard, and can't be used for a geospatial 2sphere index or $near operators or anything.  We can do some boxing/unboxing and use a different storage format than the wire protocol.  Not the end of the world.  But it would be a heck of a lot cleaner if we had a Point primitive.  </p>\n<p>How much of an ask would it be to define a Map resource and a set of geospatial primitives like Point, Line, Polygon, etc?  Is that like, asking to move mountains?  Or would it just be a routine ask as part of the maturation process and aligning/harmonizing with GIS systems?  </p>",
        "id": 153894250,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1497635913
    },
    {
        "content": "<p>I had not heard of geojson before now. We looked at kml and a few others originally. </p>",
        "id": 153894264,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497649734
    },
    {
        "content": "<p>Why would we define a map resource if geojson does it? </p>",
        "id": 153894265,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1497649750
    },
    {
        "content": "<p>The location could be a point, or a region. Currently only covers the point option, and the trackers have been suggesting ways to define the region part.</p>",
        "id": 153895999,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1499146442
    },
    {
        "content": "<p>Thanks for the additional feedback <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span>. Note that there's also the extension on address for storing the patient's address which I've been using to plot patients for community routing</p>",
        "id": 153896000,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1499146497
    },
    {
        "content": "<p>I think defining a Map resource would be perfunctory, and a way for FHIR to simply bless the format that's been developed by the GIS folks for web interoperability.  They've done a lot of work already with the geojson format, and it's right there for FHIR to use and adopt.  </p>\n<p>There's a little bit of harmonizing left to do though.... the GIS folks use a 'Type' field instead of 'resourceType', for instance.  And defining a FHIR Map resource might put some grist in the mill so we can talk to them about supporting synonyms.</p>\n<p>Regarding kml and geojson.... they're both pretty standard, with geojson being more lightweight. <br>\n However, they both have the problem of topology slivers (i.e. multiple polygons being lined up close to each other, but not contiguously, which introduces slivers).  There's also a .topojson format that supports reduced line contiguous shapes, and uses the same Feature resource that .geojson does.  And if we take a look at database popularity, it's pretty clear that there are many more JSON database than XML database... and fewer KML databases.  It just seems there's fairly good support for geojson from Mongo, CouchDB, Postgresql, etc.  But KML support gets pretty esoteric.  </p>",
        "id": 153896111,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1499282204
    }
]