[
    {
        "content": "<p>The IHE mCSD (mobile Care Services Discovery) profile references a number of underlying FHIR resources: Location, Organization, Practitioner, PractitionerRole and HealthcareService. mCSD’s development within IHE has been supported by the US PEPFAR programme – a $7B/year programme supporting HIV prevention, care, and treatment in 58 low and middle income countries. mCSD is a FHIR-based profile intended to be functionally equivalent to the existing IHE CSD profile. The profile’s use cases rely on a defined relationship between facilities, the services provided at these facilities, the care providers who deliver these services, and the organizational relationships under which these activities are conducted.</p>\n<p>This last point is important. A facility may be “governed” under multiple organizational hierarchies. It is located, for example, within a Ministry of Health hierarchy regarding management and reporting. There may also be a separate hierarchy for donor-reporting… and another one, again, describing the vaccine supply chain… and so on. The 0..* cardinality is supported in the CSD profile’s XML-based schema, but this cardinality is not natively supported between the Location and Organization FHIR resources.</p>\n<p>We have important use cases (in, at a minimum, 58 countries!) that rely on this 0..* cardinality. We would like to formally propose that the cardinality of managingOrganization in the Location resource be changed from 0..1 to 0..*.</p>",
        "id": 153988553,
        "sender_full_name": "Luke Duncan",
        "timestamp": 1534537937
    },
    {
        "content": "<p>Feel free to submit a change proposal (use the \"propose a change\" link at the bottom of any page of the FHIR spec.)  That said, it's not clear that these are all equivalent types of \"management\".  I think you might want distinct relationships for different types of organizational relationships - or at least to qualify them somehow.</p>",
        "id": 153988560,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534539028
    },
    {
        "content": "<p>Lloyd, you make a good point about the quite different organization hierarchies. In the mCSD specification, the Organization.type is profiled as a mandatory element and it is anticipated that this would be leveraged to indicate what kind of org hierarchy is being referenced.</p>",
        "id": 153988950,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1534616635
    },
    {
        "content": "<p>The type of an organization and the organization's relationship to a location are different things...</p>",
        "id": 153988976,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534624600
    },
    {
        "content": "<p>Lloyd -- please can you give an example of how these things might be different? </p>\n<p>My sense is that a location's relationship with a supply chain org hierarchy (indicated by a <strong>supply chain</strong> organization type) would indicate the location's commodity-replenishment relationship. A relationship with a healthcare delivery network's administrative org hierarchy (indicated by a <strong>healthcare administration</strong> organization type) would indicate location's administrative/reporting relationship. </p>\n<p>I appreciate that these are <em>implied</em> relationships -- but it seems a useful simplification to be able to say that an org hierarchy's type indicates its purpose and the location-to-org-hierarchy relationship indicates the <strong>relationship for that purpose</strong>. I'm sorry if I'm missing something obvious, and live in fear that <strong>I'm</strong> the one who is simple, here!</p>",
        "id": 153989800,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1534859698
    },
    {
        "content": "<p>A government agency might be a regulator and might also serve as a distributor and might also be the organization that is the \"report to\" for certain types of activities.  The organization is the legal entity and the Organization.code describes the type of legal entity and their primary purpose.  It doesn't define all of the functions they perform or for whom.  If you take the design approach of Organization.type defines function, then you'll end up with multiple copies of the same organization - one per function.  I don't think that's the intended use of the resource.  <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> ?</p>",
        "id": 153990455,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535040723
    },
    {
        "content": "<p>As my entry into the slowest-response-to-a-comment contest, I'd like to re-activate this conversation from almost 2 years ago. <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span> <br>\n<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> -- could we not expect that a government agency (which would have a top-level org ID) would or could have different sub-directorates that are focused on different aspects of its operations? The sub-directorate focused on supply chain could have one org hierarchy defined by where its distribution centres are located... and another one focused on public health reporting could have its org hierarchy defined by where its regional public health offices are located... and so on. Separately, a donor who is funding a set of facilities in a country would want to be able to establish the reporting hierarchy for these facilities. </p>\n<p>A single location would want to be able to indicate that it is a member of each of these different org hierarchies. I'm hoping that a change in the cardinality between Location and org hierarchy could allow this to be natively supported. <span class=\"user-mention\" data-user-id=\"193299\">@Luke Duncan</span> <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span></p>",
        "id": 192833323,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585932801
    },
    {
        "content": "<p>Sure, an organization could have sub-divisions/departments/whatever (sub-organizations) that have defined areas of responsibilities.  That's every distinct function mandates a distinct organization.  The linkage between location and organization is \"what is the body that has official responsibility for this physical place\".  If there are multiple departments that are involved in that physical place, then the overall responsibility would rest with the parent organization.  (Also look at HealthCareService - it may correspond to what you're looking for.)</p>",
        "id": 192835719,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585933787
    },
    {
        "content": "<p>So... I'm getting a sense that this is the wrong tree to be barking up. I guess I'll just put it this way. There doesn't seem to be any element in the <strong>Location</strong> data model that works well at answering the question: what are the multiple org hierarchies that this location is a member of? Since every care delivery site <strong>is</strong> a member of multiple org hierarchies, I wonder if it might be a worthwhile candidate for a new element? <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 192837507,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585934632
    },
    {
        "content": "<p>Potentially.  We'd need to understand what the objective of the link would be.  Perhaps a concrete example?</p>",
        "id": 192837712,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585934726
    },
    {
        "content": "<p>An MOH facility provides services and reports indicators on a monthly basis thru an MOH reporting hierarchy. The same facility also provides donor-funded services and reports indicators on a monthly basis thru a separate donor reporting hierarchy. The vaccines store in the facility is replenished on a weekly basis from its \"designated\" distribution centre -- which is part of a supply chain org hierarchy. The guideline for antenatal care visits at the facility is triggered by the fact that the facility is in a region designated by the public health authority as being \"high anemia prevalence\"... and the public health department maintains a number of such org hierarchies for a number of disease or condition prevalences. </p>\n<p>Ideally -- it will be easy to find out, for this facility, the list of org hierarchies that it is a member of. Some of these will be used to inform the monthly reporting... some will be used to inform supply chain activities... and some will be used to inform guideline-adherent care practices. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 192838731,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585935170
    },
    {
        "content": "<p>I don't necessarily see those as functions of the 'physical place' (the building, the floor, the room - which is what Location represents).  Rather it seems like relationships between organizations - which is covered by the OrganizationAffiliation resource.</p>",
        "id": 192847101,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585939085
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span></p>",
        "id": 192847112,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585939092
    },
    {
        "content": "<p>Lloyd, they are very much attributes related to the facility... to the place.</p>",
        "id": 192847543,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585939307
    },
    {
        "content": "<p>There's typically an Organization that is 1..1 with the place.  You don't deliver vaccines to a building, you deliver them to the organization that's running that location.  Physical places <em>never</em> create reports - people do.</p>",
        "id": 192847923,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585939489
    },
    {
        "content": "<p>If you're talking about active participation or responsibility, you're always talking about Organization, not Location</p>",
        "id": 192847980,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585939520
    },
    {
        "content": "<p>So... if the MOH is operating 1000 facilities... are you thinking there's a different organization ID for each of them... because there's a different supply chain relationship for each of them, for sure. Sorry if I'm missing some nuance here, Lloyd... but when you say there's a 1..1 relationship between a location and an organization... do you think it can only mean w.r.t. \"payroll\"? A location will be part of lots of org hierarchies... and examples of these are already enumerated.</p>",
        "id": 192848530,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585939786
    },
    {
        "content": "<p>Yes.  Each facility would have an organization that represents the group of people (and authority to make decisions) that is associated with that site.  You would also have sub-organizations for each department.  The 'location' is just the physical space where the organization has authority.</p>",
        "id": 192852014,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585941521
    },
    {
        "content": "<p>(Think of location like building/floor/room/bed - they are places only)</p>",
        "id": 192852079,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585941562
    },
    {
        "content": "<p>I'm struggling, Lloyd. I can't tell whether you don't understand me... or whether you don't think these are valid use cases... or whether you think these use cases are already well-addressed... or what. There is obviously a recognition that there needs to be a relationship between locations and org hierarchies... there is an element in the Location resource to establish one of those. My point is that there are multiple org hierarchies... and you don't seem to disagree with that. I guess what I can't seem to get my head around is that you are advocating for one (and only one) of the multiple org hierarchies to be represented in the relationship. As far as I can tell, it is the org hierarchy relationship related to \"payroll\" that seems to be the one most focused on. Why is that? And what is the danger that you foresee in moving to a 0..* relationship?</p>",
        "id": 192854236,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585942709
    },
    {
        "content": "<p>I think the use-cases are well handled - and they're handled on the organization side, not the location side.  The link on location is \"what's the organization that is responsible for this physical site\".  For something like a hospital or clinic, that will typically be a 1..1 organization.  I.e. it would never be the MOH for the hospital, it would always be a hospital-specific organization.  The hierarchical links you're interested in would be handled by organization affiliations.</p>",
        "id": 192854735,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585942976
    },
    {
        "content": "<p>I'm thinking of facilities in rural Tanzania, too... not just hospitals in downtown Toronto. Are you sure you understand my use cases?</p>",
        "id": 192854953,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585943110
    },
    {
        "content": "<p>Don't care about the where.  A facility in rural Tanzania would still have an 'organization' that represents the group of people there who can make decisions and take responsibility.  The Location represents the physical building - even if it just happens to be a temporary tent.</p>",
        "id": 192855200,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585943257
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span> I haven't followed all this discussion but it seems to me that HealthcareService is at least part of your answer. It's common for a single location to provide multiple services that have different managing Orgs</p>",
        "id": 192855513,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585943406
    },
    {
        "content": "<p>I think part of the confusion might be that when organizations talk about locations, e.g. a car dealership has three locations in an area, they are talking about business units. It seems to me that if you replace the word \"location\" with a \"sub-org\", and also disregard the current very limited apparent scope of the OrganizationAffilitaion resource, you can successfully express what you need.</p>",
        "id": 192855523,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1585943410
    },
    {
        "content": "<p>Yes, our \"Location\" resource is should be renamed to \"PhysicalSpace\" because the word confuses people.</p>",
        "id": 192855617,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1585943466
    },
    {
        "content": "<p>So... a physical space operates under the auspices of a managing organization and, on a monthly basis it sends monthly reports based on its position in the managing organization's org hierarchy. Some of its services are funded by a donor. On a monthly basis it reports to that donor... based on a different org hierarchy. The vaccines that are delivered to <strong>this </strong>physical space come from its designated replenishment centre... which is part of a supply chain org hierarchy. And <strong>this</strong> particular physical space is in an area that is part of a public health org hierarchy related to anemia prevalence, and so antenatal care services provided in <strong>this </strong>physical space take that into account when providing guideline-adherent care.</p>\n<p><strong>This</strong> physical space has these org hierarchy relationships. A <strong>different</strong> physical space... also operating under the same managing organization... has a <strong>different</strong> set of org hierarchy relationships. I'm looking for a parsimonious way to reflect these relationships... and it seems that a 0..* cardinality in the location to org hierarchy relationship would do that.</p>",
        "id": 192856966,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585944152
    },
    {
        "content": "<p>no, i'd go the other way and link from the organization(s) to this location.  Then you can just search for organizations that point to this location.  I never felt that managingOrganization should be on the Location resource because it confuses the relationship to me.</p>",
        "id": 192857186,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1585944271
    },
    {
        "content": "<p>I think you'd also want to indicate what type of relationship, not just a 0..* relationship.</p>",
        "id": 192857189,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585944274
    },
    {
        "content": "<p>This example, btw, is not from Toronto. This is a common situation in rural Tanzania... and it informed the work done on the IHE Care Services Discover (CSD) specification. CSD models the relationship between places, organizational hierarchies, health workers, and health services. IHE developed mCSD to try to model this same set of relationships in FHIR... and we were able to come pretty close.</p>",
        "id": 192857193,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585944277
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179166-implementers/topic/Location.2EmanagingOrganization.20cardinality/near/192857189\" title=\"#narrow/stream/179166-implementers/topic/Location.2EmanagingOrganization.20cardinality/near/192857189\">said</a>:</p>\n<blockquote>\n<p>I think you'd also want to indicate what type of relationship, not just a 0..* relationship.</p>\n</blockquote>\n<p>Which is easily handled by the OrganizationAffiliation resource</p>",
        "id": 192857328,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1585944339
    },
    {
        "content": "<p>So... and sorry if I'm being stoopid... how would I get a list of all the org hierarchies that a location is part of? If I start at Organization... exactly which search parameter would I use? How would I \"walk the tree\" (since these are org hierarchies, after all)?</p>",
        "id": 192858032,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585944729
    },
    {
        "content": "<p>Well, you are going to use a combination of HealthcareService and OrganizationAffiliation resources to present the hierarchy and the delivery of service, so depending on what question you are specifically asking, you would use Organization?_has:OrganizationAffiliation:primary-organization:location=[reference] or Organization?_has:HealthcareService:organization:location=[reference]</p>",
        "id": 192859418,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1585945548
    },
    {
        "content": "<p>those are obviously just examples.  It really depends on exactly how you model the hierarchy using OrgAffiliation and the delivery of services using HealthcareService.</p>",
        "id": 192859587,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1585945639
    },
    {
        "content": "<p>Thanks, Jean. I'm going to have to learn more about how this resource is expected to work. It seems (on original gut instinct reaction) that OrganizationAffiliation, if used in this way, will be a permutation of org, location, and service. And for any org reference... there may be a need to \"walk the tree\" to navigate the partOf relationships up or down (depending on the use case). </p>\n<p>I'll spend some time with it... and will try not to be too much a sissy about how daunting it looks...</p>",
        "id": 192860070,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585945909
    },
    {
        "content": "<p>your problem sounds daunting</p>",
        "id": 192860855,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585946318
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179166-implementers/topic/Location.2EmanagingOrganization.20cardinality/near/192857186\" title=\"#narrow/stream/179166-implementers/topic/Location.2EmanagingOrganization.20cardinality/near/192857186\">said</a>:</p>\n<blockquote>\n<p>no, i'd go the other way and link from the organization(s) to this location.  Then you can just search for organizations that point to this location.  I never felt that managingOrganization should be on the Location resource because it confuses the relationship to me.</p>\n</blockquote>\n<p>I'm not so sure. Certainly, the provider directory services available here in NZ (both FHIR and non-FHIR) are modeled on the healthcare services available at a facility (location) that is managed by an organisation. This is published each month by our Ministry of Health and the format of the extract renders well to the current FHIR Model whereby Organization resources are referenced by the HealthcareService and  Location resources.</p>\n<p>Organization details are a secondary concern for most consumers and providers, here. They're mainly of interest for contractual and funding purposes and what you're proposing looks more akin to typical business CRM-type model which, I guess, might suit some countries.</p>",
        "id": 192861245,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1585946538
    },
    {
        "content": "<p>Sure, but HealthcareService has a link to the Location and the Organization involved with that service.</p>",
        "id": 192861374,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1585946613
    },
    {
        "content": "<p>Yes, if HealthcareService is used then I would place the reference to Organization there, rather than the Location Resource. However, I still wouldn't place a Reference to Location in Organization as that would create circular references.</p>",
        "id": 192862623,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1585947292
    },
    {
        "content": "<p>There are also org hierarchy relationships that don't map directly (or even well) to healthcare services. The supply chain org hierarchy... or the indicator reporting org hierarchy... or the clinical decision support org hierarchy (e.g. the location being in a \"high anemia prevalence\" area that impacts ANC guidelines). For all of these... it is useful to be able to start at the Location and say: \"what org hierarchies apply here?\".</p>",
        "id": 192868538,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585950933
    },
    {
        "content": "<p>Right - but you're not actually starting at the 'building made of wood &amp; concrete', you're starting at the group of people who do stuff/manage stuff at that building.  So you're starting with Organization, not Location.</p>",
        "id": 192877898,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585958362
    },
    {
        "content": "<p>I want to learn! <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> Let's start at the Organization. Lloyd... the organization is the Tanzanian Ministry of Health. How do I get from there to the donor reporting hierarchy for monthly PEPFAR-funded HIV care metrics being reported from <strong>\"this\"</strong> facility (MOH-assigned facility ID=12345)?</p>",
        "id": 192880833,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585961852
    },
    {
        "content": "<p>There will be <em>lots</em> of organizations.  The organization tied to the location is almost certainly not going to be the Tanzanian Ministry of Health.  Rather it'll be an organization that is <em>specific</em> to that clinic/hospital (whether it's registered as a legal entity or not is irrelevant).  That organization will have a chain of responsibility that leads to the Tanzanian Ministry of Health (whether it's a direct link or through intermediaries depends on how the ministry divides responsibilities).  The organization that is 1..1 with the hospital may have further have additional sub-organizations representing departments if responsibility is divided that way.  The reporting hierarchy would be handled using OrganizationAffiliation.  Location wouldn't likely even come into play.  Imagine that you have a location that's half hospital/half school.  In FHIR that's <em>one</em> Location - there's one physical structure.  We tend to care about physical structures when we're doing geo-location stuff, but mostly we tend to just care about organizations.</p>",
        "id": 192885255,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585967788
    },
    {
        "content": "<p>Lloyd... I wasn't talking hypothetically. I was speaking in the first person about places I've been. The facility <strong>is</strong> operated under the auspices of the Tanzanian MOH. The PEPFAR reporting org hierarchy depends on the physical place where this facility is located... its long and lat. Using the IHE CSD spec we can model the facility's MOH org hierarchy and its PEPFAR org hierarchy. I need to be able to do the same using FHIR. If the cardinality of the org hierarchy relationship is altered from 0..1 to 0..* then this is easily done. </p>\n<p>I don't understand the issue, here. If we're going to support <em>one</em> of the org hierarchy relationships on the Location resource... why not support <em>all</em> of them?</p>",
        "id": 192887201,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1585971206
    },
    {
        "content": "<p>I understand that it's operated under the auspices of the Tanzanian MOH.  What I'm saying is that when representing that state in FHIR, you generally would NOT have the Location pointing to the MOH organization.  The Location would point to a location-specific Organization.  The location-specific Organization would have a 'partOf' relationship to the MOH</p>",
        "id": 192887683,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585972084
    },
    {
        "content": "<p>The hierarchies would all be to the location-specific Organization, NOT to the physical building.</p>",
        "id": 192887689,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585972116
    }
]