[
    {
        "content": "<p>Hello everyone,</p>\n<p>I was looking for a way to do GET or CREATE operation with FHIR. I was thinking of getting Ids of resources that I created in a batch of conditional creates. I wanted to use Location header (property in <code>entry.response</code>), but it seems this is only returned if resource has been created. If there was an existing resource, only 200 OK is returned (as specified in the spec). So, I was wondering, is there any reason <code>Location</code>, <code>ETag</code>, <code>LastModified</code> are not returned in the case resource already exists? </p>\n<p>And also, it would make sense if Conditional Create would interact with Prefer header (<a href=\"https://www.hl7.org/fhir/http.html#ops\">https://www.hl7.org/fhir/http.html#ops</a>) even if resource was not created. My thinking is, server had to perform the search to resolve the condition already, so there is little overhead in returning the headers/resource back to the client. </p>\n<p>What are your thoughts on extending the spec in this way? Instead of the current: \"One Match: The server ignores the post and returns 200 OK\", do something among the lines of: \"One Match: The server returns the result of the search on the condition\"?</p>",
        "id": 235819677,
        "sender_full_name": "Valentinas Janeiko",
        "timestamp": 1619174484
    },
    {
        "content": "<p>If I read the specs right all that stuff is now normative and cannot be changed any more</p>",
        "id": 235834652,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1619182373
    },
    {
        "content": "<p>Conditional create isn't normative.  So we could indeed set an expectation for the Location header to come back with the 200 ok response.  Can you submit a change request <span class=\"user-mention\" data-user-id=\"365853\">@Valentinas Janeiko</span>?  We could probably get this done in R5 - and you could pre-adopt it in R4.</p>",
        "id": 235841214,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619185011
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  How do I submit the change request? Is it just a PR in some repo?</p>",
        "id": 235847300,
        "sender_full_name": "Valentinas Janeiko",
        "timestamp": 1619187316
    },
    {
        "content": "<p>At the bottom of every page in the spec there's a \"propose a change\" link.  You'll have to register (free) and there's a manual process where someone checks to make sure you look like a real human being.  After that, submit proposed changes to your heart's content.  You <em>could</em> accompany your change request with a PR, but this sort of thing would probably involve some debate around language, so a PR probably wouldn't be super helpful.  (And we don't expect most commenters to have any clue how to do a PR or interpret our source.)</p>",
        "id": 235848276,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619187690
    },
    {
        "content": "<p>I've submitted a change request: <a href=\"https://jira.hl7.org/browse/FHIR-31965\">https://jira.hl7.org/browse/FHIR-31965</a></p>",
        "id": 235895571,
        "sender_full_name": "Valentinas Janeiko",
        "timestamp": 1619205949
    },
    {
        "content": "<p>We already return Location in the Google implementation. It seemed useful.</p>",
        "id": 236185213,
        "sender_full_name": "Paul Church",
        "timestamp": 1619448018
    },
    {
        "content": "<p>This is a good suggestion, since the work is already done to do the lookup</p>",
        "id": 236209225,
        "sender_full_name": "Brendan Kowitz",
        "timestamp": 1619456780
    }
]