[
    {
        "content": "<p>If I were to request retrieval of all medication administration events occurring in the operating room (as compared to another location in the hospital), would I model it as MedicationAdministration.supportingInformation (and reference Encounter.location referencing Location.type?  I do understand that EHRs may have difficulty finding specificity of the specific encounter.location and that medications administered in the operating room will likely not be present in the medication administration record in the EHR - most likely in the anesthesia record. I am seeking to understand the proper modeling and any comments about feasibility are very welcome.  Thank you</p>",
        "id": 276633900,
        "sender_full_name": "Floyd Eisenberg",
        "timestamp": 1648221406
    },
    {
        "content": "<p>Question: Why specifically the administrations?</p>",
        "id": 276656449,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1648230884
    },
    {
        "content": "<p>It's an issue I'm looking at as well. Trying to isolate pre-, intra- and post-procedure medication administrations.  Using location might help with that</p>",
        "id": 276661017,
        "sender_full_name": "David Pyke",
        "timestamp": 1648233163
    },
    {
        "content": "<p>Ditto, we have remote monitoring use cases where the medication administration can actually be a geo location. E.G. An asthmatic uses their SABA medications during an asthma attack at home. We went down the path of a custom extension here but am interested to see if a more native fhir solution could work.</p>",
        "id": 276672603,
        "sender_full_name": "Mike Lohmeier",
        "timestamp": 1648238969
    },
    {
        "content": "<p>Right, but why do you want to track administrations? The answer to that may influence the solution. Is it for tracking stock / consumption?</p>",
        "id": 276725430,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1648300228
    },
    {
        "content": "<p>supportingInformation is definitely <em>not</em> the correct place.  supportingInformation is for things like weight, height, blood pressure, or other information that helps to justify the dose administered or the trigger that caused the medication to be administered.  If you want to capture the location, for now, that'd be a custom extension.  That said, it seems like the sort of thing that <em>should</em> be a standard element, or at least a standard extension.  Suggest submitting a change request.</p>",
        "id": 276764455,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648355407
    },
    {
        "content": "<p>MedicationAdministration.context -&gt; Encounter.location</p>",
        "id": 276814108,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1648424541
    },
    {
        "content": "<p>Encounter.location is a 0..*, so you'd have to cross-reference the time of the administration with the time of the location.</p>",
        "id": 276827712,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1648443978
    },
    {
        "content": "<p>And are meds always administered in the context of an Encounter?   For example, if you get a vaccine at a 'chain drugstore' I suspect there isn't an Encounter associated with that?   (or is this use case only about inpatient med admins?)</p>",
        "id": 277014400,
        "sender_full_name": "John Silva",
        "timestamp": 1648564692
    },
    {
        "content": "<p>There might not be an encounter resource stored in the pharmacy \"EMR\" system about your encounter with the pharmacist (provider) but it wouldn't surprise me to learn that there is.</p>",
        "id": 277014762,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1648564820
    }
]