[
    {
        "content": "<p>The MedicationKnowledge resource does not contain an identifier element. Rather it uses code - a CodeableConcept to any number of Medication systems (rxnorm, ndc, etc.) We want to use a logical reference to MedicationKnowledge. Can this use the MedicationKnowledge.code or must it use an Identifier element?  Thanks.</p>",
        "id": 243421387,
        "sender_full_name": "Kate Dech",
        "timestamp": 1624299140
    },
    {
        "content": "<p>identifier is added in R5 <a href=\"http://build.fhir.org/medicationknowledge\">http://build.fhir.org/medicationknowledge</a></p>",
        "id": 243421659,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1624299264
    },
    {
        "content": "<p>Thank you. I'm not sure if there are other resources like this that don't have identifier but have code instead. In such cases is using a logical reference to the code element not allowed? Must reference.identifier link to the identifier element of the target resource and if there isn't one the reference can't be used?</p>",
        "id": 243423721,
        "sender_full_name": "Kate Dech",
        "timestamp": 1624300226
    },
    {
        "content": "<p>I think the answer is found here: <a href=\"http://hl7.org/fhir/codesystem.html#implicit\">http://hl7.org/fhir/codesystem.html#implicit</a></p>\n<p>but that's not directly related to the question. But every medication knowledge resource is like a medication resource</p>",
        "id": 243431452,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624303927
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"217850\">@Kate Dech</span> (copying <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>) can I ask what the use case for a logical reference is here? Normally a logical reference is used for FHIR to reference a non-FHIR entity - something that has an identifier, but not a FHIR id. The MedicationKnowledge instance you are referring to has to be FHIR, so it must have an id (unless it's not REST, or not accessible for some reason), so why is it necessary to use a logical reference?</p>",
        "id": 243455584,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1624317674
    },
    {
        "content": "<p>I had what I think sounds like the same need. In my case it was to keep the create/update automation unified (everything else you can detect if it's already present by querying for an identifier). I worked around it by querying for all MedicationKnowledge resources and building an in memory cache using my own composite \"key\" (as code does not uniquely identify one).</p>",
        "id": 243553103,
        "sender_full_name": "Merlyn Albery-Speyer",
        "timestamp": 1624383944
    },
    {
        "content": "<p>Logical references are also for FHIR entities. If you know the ID but you don't have the resource accessible, I think it's expectable to use a Logical Ref.<br>\nFor this case, I do not see the difference between code and identifier for a medknowledge. Is there one?</p>",
        "id": 243575599,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624394228
    },
    {
        "content": "<p>But if the resource is not accessible, how does the identifier help you?</p>",
        "id": 243578705,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1624395892
    },
    {
        "content": "<p>Re code vs identifier - the knowledge is about a medication. The code matches the medication that the knowledge is about. It could be thought of as \"subject code\".</p>\n<p>The indentifier is an identifier of the knowledge itself, of the data. But how often that has any meaning I don't know. This information set, as a whole entity, may have no life outside  of FHIR, so it may only have a id. That is not to say that it isn't important information.</p>",
        "id": 243580437,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1624396794
    },
    {
        "content": "<p>My reply was to the statement that logical references being for non-fhir entities. You can have logical references to fhir entities.</p>",
        "id": 243593676,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624406722
    },
    {
        "content": "<p>Thanks for the clarification Jose. My question is why is it ever necessary or desirable to have a logical reference to an accessible FHIR REST entity? I'm sure it is legal I just haven't understood the need. If it's accessible by FHIR then a normal reference seems better. (If we have 2 ways to reference then we need to be able to say why and have some best practice.) If it's in FHIR but never accessible by FHIR REST then I guess there may be some non-FHIR based access possible using identifier - but I wouldn't call that FHIR REST.</p>",
        "id": 243624444,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1624439068
    },
    {
        "content": "<p>you can profile them out</p>",
        "id": 243656018,
        "sender_full_name": "Eric Haas",
        "timestamp": 1624456968
    },
    {
        "content": "<p>Our patients are referenced by a logical reference by their national ID number. They may exist as FHIR resources inside our server, but we don't access them use the resource IDs.</p>",
        "id": 243666027,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624461033
    },
    {
        "content": "<p>thanks Jose, that is interesting. What is the rationale for that please? Is it that they may sometimes <em>not</em> exist as accessible FHIR resources? Or is it that actual FHIR ids are not seen as permanent enough? What entity is it that has this FHIR logical reference to them, if I may ask?</p>",
        "id": 243668060,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1624461762
    },
    {
        "content": "<p>Apologies for the delay. In our case it was a matter of not having the resource available (yet) as an endpoint by id. But there is still value in communicating that there is a relationship to this other entity (and we know there is; even if we haven't built the mechanism to get there directly).</p>",
        "id": 243668799,
        "sender_full_name": "Kate Dech",
        "timestamp": 1624462053
    },
    {
        "content": "<p>hi Kate yes that makes perfect sense. If there is no RESTful resource to link to then you need something else. You could use the identifier (presumably one that has no real world significance?). Can I ask what type of entity it is that is wanting to link to the MedicationKnowledge? Do both ends of the \"link\" know the code of the medication in question?</p>",
        "id": 243669601,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1624462384
    },
    {
        "content": "<p>Yes, in some cases, they don't exist. We create an allergy for a patient, but in some cases the patient does not yet exist when the first allergy is created.<br>\nSometimes the patient exists, but in another server. <br>\nSometimes there will be several resources in several servers about the same patient. If we have 2 hospitals, each of these hospitals will have one resource representing the patient.<br>\nOr by policy we just don't want to use the internal server IDs (because of some reason that I don't recall)</p>",
        "id": 243671150,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1624463040
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 267086839,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641489105
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 267086937,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641489142
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 267087074,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641489219
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 267087820,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1641489574
    }
]