[
    {
        "content": "<p>When an element in a needs multiple terminology bindings then we sort of agreed that we needed to create slices (on coding), because actual multiple bindings were out of the question.</p>\n<p>But when the StrucDef is a logical model, there is an invariant in the way: sdf-1: Element paths must be unique unless the structure is a constraint (expression : derivation = 'constraint' or snapshot.element.select(path).isDistinct())</p>\n<p>Is this limitation by design or by accident? Or should I just add derivation = 'constraint' to my logical model even though I don't have a base, since my model *is* the base?</p>",
        "id": 153884888,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1492412706
    },
    {
        "content": "<p>In general you'd say that the snapshot paths shall always be unique, except when slicing. In which case invariant sdf1 needs reformulation to reflect that.</p>",
        "id": 153884889,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1492413124
    },
    {
        "content": "<p>Added <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13207\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13207\">GF#13207</a></p>",
        "id": 153884891,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1492417453
    },
    {
        "content": "<p>I don't knowabout this with logical models. I'd have expected that you'd have different elements, not slicing in the base model</p>",
        "id": 153884894,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1492419285
    },
    {
        "content": "<p>I'm auto converting from an ART-DECOR model that supports multiple bindings. I cannot just add elements, nor can I just create the ValueSet that rules them all in the conversion process. So I either need multiple bindings, or slicing. Not having both means that auto conversion is impossible.</p>",
        "id": 153884915,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1492443648
    },
    {
        "content": "<p>Adding elements is changing the ART-DECOR model that remains the normative model. Creating a runtime ValueSet that doesn't exist in ART-DECOR gives maintenance headaches</p>",
        "id": 153884917,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1492443732
    },
    {
        "content": "<p>Adding it to the project is again a change to the underlying project I cannot do just because I'm converting to FHIR.</p>",
        "id": 153884918,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1492443783
    },
    {
        "content": "<p>ok, I understand the situation. Will have to think about it some more</p>",
        "id": 153884923,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1492455843
    }
]