[
    {
        "content": "<p>Hi all, what can I do if I can not find LOINC codes for any finding while creating a profile (for example, there is no LOINC code for right ventricular hypertrophy)?  Thank you</p>",
        "id": 153899835,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1501561468
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193568\">@Pranitha Sruthi</span> are you able to use SNOMED CT if so, the what about SCTID: 89792004 \"Right ventricular hypertrophy (disorder)\"?</p>",
        "id": 153899838,
        "sender_full_name": "David McKillop",
        "timestamp": 1501562392
    },
    {
        "content": "<p>Yes, for corrected QT interval LOINC code is available but there is no SNOMED CT code.  What shall I do?</p>",
        "id": 153899839,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1501562736
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193568\">@Pranitha Sruthi</span> I'm a bit confused with your last reply regarding \"corrected QT interval\".  In LOINC \"QT interval\" has the property time which doesn't really fit with SCTID: 89792004 \"Right ventricular hypertrophy (disorder)\" or it may in your context, but I don't  understand enough what you are doing to be of much assistance.</p>",
        "id": 153899840,
        "sender_full_name": "David McKillop",
        "timestamp": 1501563475
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192323\">@David McKillop</span>  Actually, I'm working on creating profile for ECG and found LOINC codes only for few findings. SNOMED CT codes are available for all the findings except for corrected  QT interval. I don't understand what to do. Shall I mix both the codes in the profile i.e., LOINC code for corrected QT interval (QTc interval) and SNOMED CT codes for the rest?</p>",
        "id": 153899842,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1501563864
    },
    {
        "content": "<p>It's perfectly fine to draw codes from multiple code systems if that's what you need for your use-case.  (Though if you think the concepts you need are appropriate to all be in one of the code systems, you can also use the change request process for a given code system to get those concepts added so that eventually you might be able to draw everything from a single code system.  It's pretty rare for that process to be fast enough to meet the needs of many projects though.)</p>",
        "id": 153899843,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1501564118
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  Okay thank you</p>",
        "id": 153899845,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1501564264
    }
]