[
    {
        "content": "<p>Hi all, I have to create profile for the panel cardiac biomarker including the panel components (Troponin, Myoglobin, Creatine kinase and Creatine kinase.MB). I found the LOINC codes for the mentioned components but couldn't find for the panel cardiac biomarker. How can I create profile? Kindly suggest me. Thank you</p>",
        "id": 153896721,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1499858628
    },
    {
        "content": "<p>Are you asking for a  new  LOINC?  Try <a href=\"https://loinc.org/\" target=\"_blank\" title=\"https://loinc.org/\">here</a>.    to see how to do it check <a href=\"http://build.fhir.org/profiling.html\" target=\"_blank\" title=\"http://build.fhir.org/profiling.html\">this out</a>.  For a tool check out <a href=\"https://fhir.furore.com/forge/\" target=\"_blank\" title=\"https://fhir.furore.com/forge/\">Forge</a>.</p>",
        "id": 153896733,
        "sender_full_name": "Eric Haas",
        "timestamp": 1499872803
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  I had already searched for the LOINC code on the official LOINC website but in vain. I did not find the LOINC code for cardiac biomarker. I am also done with creating profiles for the panel components namely Troponin, Myoglobin, Creatine kinase and Creatine kinase.MB using observation resource. If I get the LOINC code for the panel named cardiac biomarker, I can complete creating profile. Please help me find the LOINC code for the cardiac biomarker panel.</p>",
        "id": 153896803,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1499922002
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193568\">@Pranitha Sruthi</span> what about \"56846-9 : Cardiac biomarkers (set)\"?</p>",
        "id": 153896804,
        "sender_full_name": "David McKillop",
        "timestamp": 1499929463
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192323\">@David McKillop</span>  It does not have components namely Troponin, Myoglobin, Creatine kinase and Creatine kinase.MB. Can I still use that LOINC code to create profile for the panel cardiac biomarker?</p>",
        "id": 153896805,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1499929652
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193568\">@Pranitha Sruthi</span>   \"56846-9 : Cardiac biomarkers (set)\" is a heading/question and it may not have components listed as different facilities will have different components and to create a different code for each combination would be messy.  You might find another code with components, but it wasn't on the first page that I looked at - I didn't look at the other 7 pages.</p>",
        "id": 153896806,
        "sender_full_name": "David McKillop",
        "timestamp": 1499930148
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192323\">@David McKillop</span>  But when I searched for \"Cardiac Biomarkers\" on the LOINC site, only one result is getting displayed i.e., the one which you have mentioned. Could you please tell me what are the other '7 pages'?</p>",
        "id": 153896807,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1499930451
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193568\">@Pranitha Sruthi</span>  Type in \"Cardiac\" into the search and you'll get 1,511 hits and scroll through them - you might find one that suits your use case better, but \"56846-9 : Cardiac biomarkers (set)\" seems like a reasonable fit.</p>",
        "id": 153896808,
        "sender_full_name": "David McKillop",
        "timestamp": 1499930683
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192323\">@David McKillop</span> Thanks for your response.  Ok then can I use that LOINC code to create a profile ( using the resource DiagnosticReport) for cardiac biomarkers and attach the component profiles (Observation resource) to the result? Or shall I search for anyother case which has the required components?  What if I did not find the exact match?</p>",
        "id": 153896809,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1499931170
    }
]