[
    {
        "content": "<p>Hi all, I had searched for the LOINC codes for different types of rhythm (sinus, A Fib, A Flutter, VT/V Fib and Wandering Pacemaker) ,blocks(Sinus Brady, Mobitz I, Mobitz II and Complete) and the affected areas (Anterior, Anterio septia, Lateral, Inferior and Posterior)captured in ECG but could not find them on the official LOINC site. Kindly suggest me a solution. Thank you</p>",
        "id": 153897438,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1500555287
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> - is anyone from LOINC here?</p>",
        "id": 153897611,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1500633732
    },
    {
        "content": "<p>Those do not sound like LOINC observations, they look like clinical conditions that are \"the answer\" to an observaction of the cardiac rhythm. Also, a specific cardiac location associated with the rhythm would either be a more complexly defined/stated rhythm, or a complex object/observation. </p>\n<p>I just looked for a simple \"Cardiac Rhythm\" observation in LOINC and sometimes I'm floored by what seems to be a gap that should never still exists - Yep, there does not appear to be such an observation. <span class=\"user-mention\" data-user-id=\"191978\">@Daniel Vreeman</span> Can you help here with this? I see 67519-9  Cardiac rhythm NEMSIS, which is very much what you want, and based on some prior discussions about the ability to use a single code from a set of LOINC concepts associated with a particular instrument - you could use that. Problem is the answer set is NORMATIVE so you are supposed to only use those answers and nothing else (for interop consistency.) </p>\n<p>I'd rather see a general LOINC observation of 'Cardiac Rhythm' with an example set of SNOMED CT answers. BTW, I really don't know what 8884-9   Heart rate rhythm is supposed to be and would not recommen using it unless Dan clarifies.</p>",
        "id": 153897788,
        "sender_full_name": "Robert McClure",
        "timestamp": 1500825021
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  Ok thank you.</p>",
        "id": 153897897,
        "sender_full_name": "Pranitha Sruthi",
        "timestamp": 1500889842
    }
]