[
    {
        "content": "<p>I am trying to specify a set of FHIR concepts to be used for interacting between decision support applications and Practice Management Systems in NZ. Most PMS's make the distinction between long term and short term when storing conditions and medication orders. This is a simple distinction that most clinical users find useful, but I am having difficulty expressing it using FHIR concepts. The best I can come up with is STU3 which allows condition categories of <strong>problem-list-item</strong> and <strong>encounter-diagnosis</strong> which I take to mean long term and short term respectively. This applies directly to conditions, but can only be applied to medication orders as part of the reason element. Has anyone else had the same issue and does my solution (condition.category and medicationOrder.reason.condition.category) look like the best way to represent the concepts of long term and short term?</p>",
        "id": 153869196,
        "sender_full_name": "Chris Hilder",
        "timestamp": 1485400126
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"192080\">@John Hatem</span> ?  (I know we have the same distinction in some Canadian systems.)</p>",
        "id": 153869201,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1485404813
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193335\">@Chris Hilder</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> If it's any help, the meaning of Long Term Indicator (boolean) in the Prescription/Medication Item properties of the NZ ePrescription Service and GP2GP Data Models is bound to SCT concept <code>416239002|Chronic long term disease management required|</code> which is from the Clinical Finding hierarchy. However,  my feeling is that it should really be an attribute of an indication, rather than the medication, so condition.category looks like the best choice to me - but much may depend on whether there is any significance in the absence of this category (i.e. could that create an assumption of 'short term' or would that have to be expressly stated as a condition category as well?).</p>",
        "id": 153869205,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1485410589
    },
    {
        "content": "<p>There isn't currently a way to include this information in the MedicationRequest resource.  I know that this exists in some Canadian sytems that support electronic prescribing.  Some vendors make assumptions based on the medication and the indications it is approved for, but others ask the prescriber to record their intent for the medication at the time of prescribing.  I would suggest that you add a tracker item with your use case.</p>",
        "id": 153869222,
        "sender_full_name": "Melva Peters",
        "timestamp": 1485433426
    },
    {
        "content": "<p>On the Condition side, there are some nuances to be aware of if using Condition.category.  The problem-list-item is typically used for those chronic \"long term\" conditions (e.g. diabetes), but technically, it can also be any other condition \"that has risen to a level of concern\".  Stated another way, a \"short term condition\" of UTI may \"rise to a level of concern\" and be added to a surgeon's problem list when that patient is scheduled for an upcoming surgery.  That said, Condition.category has an example binding, so you are free to use another axis of categorization if the current value set doesn't convey the same semantics you were expecting.</p>",
        "id": 153869289,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1485460520
    },
    {
        "content": "<p>Thanks for your replies. I had a feeling that problem-list-item didn't match the semantics of long-term and this seems to have been confirmed. When you say that another axis of categorisation could be used, does this mean that the SCT concept Chronic long term disease management required could be used as a Condition.category? Furthermore, could it be used as a MedicationOrder.reason?</p>",
        "id": 153869302,
        "sender_full_name": "Chris Hilder",
        "timestamp": 1485470914
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193335\">@Chris Hilder</span>. Just discussed this with some of the NZePS team and, within that use case, the long term indicator denotes regular, repeating medication - which is not quite the same as medication relating to a long term condition (e.g. it might be preventative). Therefore, you may need to create an extension on the MedicationRequest resource for this.</p>",
        "id": 153869314,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1485478904
    }
]