[
    {
        "content": "<p>In San Diego, we'll be trailing a connectathon stream around patient managed sharing of information. One of the key aspects of this connectathon stream is that the patient organises for 2 EHRs to communicate about them, without the patient being in the loop. See <a href=\"http://wiki.hl7.org/index.php?title=201709_Consumer_Centered_Data_Exchange\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201709_Consumer_Centered_Data_Exchange\">http://wiki.hl7.org/index.php?title=201709_Consumer_Centered_Data_Exchange</a> for details.</p>",
        "id": 153896434,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499633413
    },
    {
        "content": "<p>One of the steps in this connectathon stream is that the patient authorizes two EHRs to communicate with each other, and then the EHRs have to decide that they trust each other.  (this is different to where the patient simply directs the EHR to share data with any application, and the EHR need not decide for itself whether it trusts the application, since the patient does. That's a useful scenario, but this scenario is different, because the EHRs can recognise and trust each other as authoritative)</p>",
        "id": 153896435,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499633560
    },
    {
        "content": "<p>We are working with Aaron Seib from Nate Trust on the trust verification step, and he's looking for someone to volunteer to implement a web service for the connectathon that fronts for the verification step</p>",
        "id": 153896436,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499633632
    },
    {
        "content": "<p>as the volunteer, you'd probably already be planning to attend the connectathon, and you'd be interested in a patient centered healthcare system, and you'd be able to work with Aaron to prototype a simple but useful service for the connectathon.</p>",
        "id": 153896437,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499633704
    },
    {
        "content": "<p>if you're interested in this role, PM me directly, or email me, and I'll hook you up with Aaron.</p>",
        "id": 153896438,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499633722
    },
    {
        "content": "<p>btw, I think this is not a single only volunteer position</p>",
        "id": 153896439,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1499633741
    }
]