[
    {
        "content": "<p>Looking for someone that knows if it is possible to use Auth0’s OAUTH implementation, to store a piece of data, like a PatientID, within the OAuth response/Callback.</p>\n<p>We have a system where we have WEBAPP_A, WEBAPP_B, and AUTH0 as the IdP.</p>\n<p>We need:</p>\n<ul>\n<li>a user in WEBAPP_A to authenticate to WEBAPP_B via OAUTH (Done)</li>\n<li>\n<p>upon successful authentication, WEBAPP_A sends a PatientID to WEBAPP_B within the Auth0 OAUTH response</p>\n</li>\n<li>\n<p>WEBAPP_B will, upon receiving a PatientID, request additional information from WEBAPP_A</p>\n</li>\n<li>WEBAPP_A will then receive a query string that leads to WEBAPP_B’s application via a new browser tab.</li>\n</ul>\n<p>We need to figure out how WEBAPP_A sends metadata (PatientID) along with the request for authentication.</p>\n<p>I am hoping I explained the issue accurately but understand that I am not a developer.</p>\n<p>Auth0 Enterprise Support is not an option for us so we are looking for a consultant.</p>\n<p>-Ajay</p>",
        "id": 218896736,
        "sender_full_name": "Ajay Prashar",
        "timestamp": 1607119289
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span></p>",
        "id": 218913563,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607135653
    },
    {
        "content": "<p>SMART on FHIR defines a few sequences that may be useful. It sounds like you are most interested in creating a patient context outside of an existing session (app_a has to deliver a token to app_b, that grants access to a single patient). Until the big guy gets here, I suggest checking out the launch/patient scope in the SMART on FHIR specification (<a href=\"http://www.hl7.org/fhir/smart-app-launch/scopes-and-launch-context/\">http://www.hl7.org/fhir/smart-app-launch/scopes-and-launch-context/</a>). When the launch/patient scope is fulfilled by a SMART Authorization Server the token payload will include a property called \"patient\", which will hold the value of the FHIR patient id.</p>",
        "id": 218961934,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1607216248
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"198698\">@Ajay Prashar</span>  I did this using Okta, but it's very similar in Auth0 too. I am assuming WEBAPP_B (_B) is OIDC using Auth0 IdP. </p>\n<p>1) You don't send any metadata from WEBAPP_A (_A) </p>\n<p>2) You provide an option to login using _B in _A. The user when they use it is taken to the login page of _B and enters their credentials in _B</p>\n<p>3) _B authenticates the user attaches all the authorization scopes, if you are using SMART on FHIR then they are like patient/Patient.read and so on.. and send the accessToken to redirectURL of _A</p>\n<p>4) _A then uses it to grants access to FHIR resources on their side</p>\n<p>5) If for some reason _B is not attaching the custom scopes, then _A should handle the authorization</p>",
        "id": 218965074,
        "sender_full_name": "Venu Gopal",
        "timestamp": 1607222295
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"251824\">@Venu Gopal</span> <span class=\"user-mention\" data-user-id=\"246928\">@josh lamb</span>  A big \"Thank you\" to you both as I appreciate your guidance in this area. My hope is that the devs on my side will, not only understand your guidance, but put into action in the form of a technology solution that impacts lives. We will be reviewing your comments in a meeting today.</p>\n<p>-Ajay</p>",
        "id": 219093244,
        "sender_full_name": "Ajay Prashar",
        "timestamp": 1607354709
    }
]