[
    {
        "content": "<p>Since the Thread about modelling HumanName.family got pretty long, I'd like to branch out to ask a question that came up during the discussion.</p>\n<p>If a family is being split up into repetitions of the family element, <br>\ne.g. \"Graf von Dracula\" were to be represented as </p>\n<div class=\"codehilite\"><pre><span class=\"nt\">&lt;name&gt;</span>\n  <span class=\"nt\">&lt;family</span> <span class=\"na\">value=</span><span class=\"s\">&quot;Graf&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;family</span> <span class=\"na\">value=</span><span class=\"s\">&quot;von&quot;</span><span class=\"nt\">/&gt;</span>\n  <span class=\"nt\">&lt;family</span> <span class=\"na\">value=</span><span class=\"s\">&quot;Dracula&quot;</span><span class=\"nt\">/&gt;</span>\n<span class=\"nt\">&lt;/name&gt;</span>\n</pre></div>\n\n\n<p>is it safe to assume the sequence of the element reflects the correct sequence to display/reconstruct the name? <br>\nis it safe to assume that the correct sequence will be maintained when flipping from XML to JSON and back?<br>\nis it safe to assume that all systems/tools/parsers will read the elements in the same order?</p>",
        "id": 153855575,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478292008
    },
    {
        "content": "<p>what we say is:</p>",
        "id": 153855576,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478292179
    },
    {
        "content": "<p>When an element is allowed to repeat, the elements are ordered, and implementations must preserve order (note: the meaning of the order may not be known)</p>",
        "id": 153855577,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478292306
    },
    {
        "content": "<p>there's a task in the system to clarify this to the effect that applications are not required to preserve the order, but that the order is potentially meaningful and changing the order may represent changing the meaning, and applications are responsible for that</p>",
        "id": 153855579,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478293299
    },
    {
        "content": "<p>Ok, thanks!</p>",
        "id": 153855580,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1478293466
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> wrote: </p>\n<blockquote>\n<p>what we say is:<br>\nWhen an element is allowed to repeat, the elements are ordered, and implementations must preserve order (note: the meaning of the order may not be known)</p>\n</blockquote>\n<p>In general that is right. However, when a resource contains a sliced list of Observations (say a DiagnosticReport contains a list of 1..10 test results with some LOINC code as discriminator), it may be unrealistic to expect a system which stores the Observations in an (existing) relational dbms to be able to retain order on reserialization. Same for order in batteries or panels of tests. Making this a MUST could mean that existing systems which cannot retain order can't be FHIR compliant w/o db redesign.</p>",
        "id": 153855613,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1478351791
    },
    {
        "content": "<p>We're not forcing systems to retain order.  We're saying they're responsible for the consequences if they don't.  So if you receive a diagnostic report that claims conformance to a profile that requires ordered slicing and you throw a way the order of the referenced observations, then when you subsequently expose the report, you're going to need to also throw away the declaration of the profile (or you're going to be exposing a non-conformant instance, which means your system is non-conformant).</p>",
        "id": 153855645,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478444488
    },
    {
        "content": "<p>Sounds good.  Practical and flexible enough. </p>",
        "id": 153855651,
        "sender_full_name": "Marc de Graauw",
        "timestamp": 1478451326
    },
    {
        "content": "<p>Hmmm. <br>\nCase 1) A client system creates a resource which contains some order-sensitive elements, and saves it to a server, later retrieves it, and operates on the order-sensititve content. The client has no way of knowing whether the server reordered the elements. <br>\nCase 2) A server recieves a resource tagged with a profile, and stores it. The server saves the resource without further processing, and thus leaves the unknown profile tag on it. When it returns the resource to a client, the order of the elements has changed. The server wasn't aware that the profile required maintaining order.<br>\nThe first case just seems dangerous. The second case changes my understanding of profiles. I had thought that a server could accept profile-tagged resources even if it didn't know the profile -- they were be a statement by a client that the content of the resource met certain requirements (and could be found by other clients that way), not that they would impose restrictions on the server.</p>",
        "id": 153855808,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1478556403
    },
    {
        "content": "<p>Elliot - in a perfect world, we would be able to make stringent requirements that made all behavior predictable. but doing so would exclude all existing EHR systems, which have real world constraints to deal with. From where we are, it would be a big mistake to change that. but it would certainly be good to document some of the limitations you're identified more clearly - can you create a task?</p>",
        "id": 153855810,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478557953
    },
    {
        "content": "<p>The first situation I accept, and agree that documenting it better should be sufficient. <br>\nThe second seems troublesome. It implies that a server cannot safely accept a resource unless it knows the profile it has been tagged with. This defeats a certain amount of the usefulness of profiles for client-to-client communication.</p>",
        "id": 153855817,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1478558358
    },
    {
        "content": "<p>it implies that there might be trouble if (a) the server doesn't know the profile and (b) the profile implicitly assigns meaning to the order (bad) and (c) the clients don't know about it. </p>",
        "id": 153855821,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478558979
    },
    {
        "content": "<p>Is there a need to be able to declare support for ordering in the conformance? Or an equivalent of \"mustUnderstand\" for profiles? (Don't accept this resource unless you can support the obligations of the profile.)</p>",
        "id": 153855824,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1478559155
    },
    {
        "content": "<p>there's Resource.implicitRules. You're straying into that space</p>",
        "id": 153855825,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478559186
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12331\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12331\">GF#12331</a> added.</p>",
        "id": 153855826,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1478559214
    },
    {
        "content": "<p>thx</p>",
        "id": 153855828,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478559600
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> If you're going to change an instance in any way (including throwing away order), you ought to throw away all profile declarations you don't recognize.  (Just as when you change an element containing an unrecognized extension, you ought to throw away the extension.  And if you edit a resource, you should re-generate the narrative.)  You should only retain unknown elements in an instance if you're relatively certain you haven't made any changes that could invalidate them.</p>",
        "id": 153855856,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478574208
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> that rule seems just as dangerous as one that keeps extensions and profiles that you don't understand.  Should this be a runtime policy, not a core-standard policy?</p>",
        "id": 153855979,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478616296
    },
    {
        "content": "<p>How is it dangerous?  Removing profiles is always safe (if sometimes inconvenient) because profiles can't add any meaning to an instance - you can always test the data against a profile and re-assert it later.  And extensions are always ignorable - systems can't have any expectation a receiver will retain any extension (or even any core element).</p>",
        "id": 153855980,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478616664
    },
    {
        "content": "<p>So you re only applying that rule when receiving data and storing it locally? I would agree in a case where data is being transfered from one custodian to another custodian that this rule might not be dangerous. It certainly will mess with the 'integrity' of the data (so medically it might not meet records retention integrity).       I thought you were expressing a use-case where a client retrieving current resource, changes that resource, and updating the server with the new data.</p>",
        "id": 153855982,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478616881
    },
    {
        "content": "<p>It's not about storing.  If I query an instance and then update an instance, the same principles apply.  I'm responsible for the truth of the new version.  So if there's content in the instance I don't understand that may have been rendered untrue by my update, I can't assert that it's true when I submit the update.  (The server is, however, free to choose to not remove data I've removed in my instance and/or to re-assert profiles or assert new profiles that I haven't declared in my submission.)</p>",
        "id": 153855983,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478617064
    },
    {
        "content": "<p>so is it a requirement that the are removed? What if I am a simple phone-number updating UI? I am only responsible for phone number within Patient. I am not aware of anything else and am happy to leave everything else alone?   Again, I ask that this is not a core-requirement to remove extensions and profiles that I don't understand, but a recommendation with clear pro/con discussion.</p>",
        "id": 153855989,
        "sender_full_name": "John Moehrke",
        "timestamp": 1478620601
    },
    {
        "content": "<p>We haven't documented as a requirement, though I can't think of a reason why it wouldn't make sense to enforce it as a requirement</p>",
        "id": 153856001,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478626686
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> \"change an instance in any way (including throwing away order)\": but I'm going to argue that this isn't a change. I would have thought a \"change\" means a change to an element value (or add or remove an element). Does modifying whitespace outside of a value also constitute a change?</p>",
        "id": 153856026,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1478629910
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> Order is always significant - changing it is a change.  There's a proposal to differentiate which elements order is significant for.  If we accept that, then most orders will drop to non-significant, but dropping a \"significant\" order would still have to be treated as a change - it changes the meaning of the instance.</p>",
        "id": 153856045,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478635892
    },
    {
        "content": "<p>OK then, I think the summary is: Order is significant, but systems aren't required to preserve order. If a system can't guarantee it preserves order, it has to treat the resource as changed. If a system changes a resource, it has to throw out profiles which it doesn't know are still valid.<br>\nRegardless of a profile tag, if a remote system has given content to my system, it is implicitly asserting that the order can be treated as meaningful, and \"assumes liability\" for the order of the content (whether it has preserved the order or not).</p>",
        "id": 153856050,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1478637473
    },
    {
        "content": "<p>\"If a system changes a resource, it has to throw out profiles which it doesn't know are still valid\" - I'm not sure about \"has to\" in that sentence. Should... is advised to... probably a good idea... but has to has no grace, and we don't know what all the ramifications are...</p>",
        "id": 153856059,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478639729
    },
    {
        "content": "<p>I'd say \"if it doesn't, it's at risk of producing non-conformant instances\".  Sometimes that's a risk a system is willing to live with.  (And the corollary is just because you see an instance declaring conformance with a profile, that doesn't mean you should trust the declaration without verifying)</p>",
        "id": 153856106,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478643899
    },
    {
        "content": "<p>As I'm reading through this thread, I can't help but wonder how many implementers -- other than a handful of veteran FHIR list server and FHIR chat denizens -- will ever be able to build correctly behaving FHIR clients and servers. </p>\n<p>Who is going to know (or even think that they need to know) stuff like: \"If I query an instance and then update an instance, the same principles apply. I'm responsible for the truth of the new version. So if there's content in the instance I don't understand that may have been rendered untrue by my update, I can't assert that it's true when I submit the update. (The server is, however, free to choose to not remove data I've removed in my instance and/or to re-assert profiles or assert new profiles that I haven't declared in my submission.)\"</p>\n<p>I'm not trying to be negative or a downer -- it's just a realistic concern based on experience with countless HL7 bespoke interfaces over the past 20 years.</p>",
        "id": 153856265,
        "sender_full_name": "Thomas Lukasik",
        "timestamp": 1478743340
    },
    {
        "content": "<p>that's why I pushed back against mandating behavior here. </p>",
        "id": 153856269,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478749919
    },
    {
        "content": "<p>but I think you're being overly negative - you can be sure that most programmers who do interop have run into order/sort issues, and have had it's importance hammered into them in the most painful of ways</p>",
        "id": 153856270,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478749951
    },
    {
        "content": "<p>Another issue around sequencing is that a system which does not maintain order, (a) must use a different version number for each retrieval of the resource, and (b) cannot provide history, since there is no way to guarantee that (a) two retrievals, even if the content is otherwise unchanged, will have the same order of contents, and (b) you won't be able to guarantee the order of previously returned content is the same.</p>",
        "id": 153856360,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1478798104
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>\"..but I think you're being overly negative\"</p>\n</blockquote>\n</blockquote>\n<p>And I might accuse you of being overly optimistic, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ;-) </p>\n<p>This sort/order related conversation is just one of countless similar threads that raise the same concerns when I review them.  But using just this one case as an example, without access to this kind of guidance, is the average developer expected to intuitively implement the <em>correct</em> behavior that <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  described? Or are they more likely to just do whatever makes sense to them -- which may be based on good practice, but colored by their individual experience and/or site specific thinking? </p>\n<p>Of course, if we tried to retro-fit all of this vital implementation information into the core FHIR standard specification it would not only camouflage the critical specification details, it would also expand that documentation a point where it would become unusable. </p>\n<p>The only remedy I can think of for this would be to parse out and capture the conclusions, lessons and guidance that gets buried within all of these deep chat and list server conversations, and compile them into a comprehensive and highly indexed \"living\" adjunct resource that responsible developers can reference quickly and easily.</p>\n<p>And yeah.. that <em>would</em> be a huge and perpetual task, but IMHO, if we don't want to see FHIR implementations devolve into an HL7 v2 situation, where \"if you've interacted with one FHIR server you've interacted with one FHIR server\", then I think we'll need to do something to prevent that from happening other than simply expecting developers to do the right thing because they can or should be able to.</p>\n<p>That's not negative at all.. it's just being realistic.</p>\n<p>TJL</p>",
        "id": 153856363,
        "sender_full_name": "Thomas Lukasik",
        "timestamp": 1478803096
    },
    {
        "content": "<p>Elliot: you've jumped from 'can't maintain a particular order' to 'can't maintain any order'</p>",
        "id": 153856368,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478804736
    },
    {
        "content": "<p>that's quite a big jump indeed.</p>",
        "id": 153856369,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478804757
    },
    {
        "content": "<p>Tom, well, as I said, I agreed that it is too much, but it's an issue that does come up. and you're right about the problem. FHIR is a *interoperability* solution, and such, will always be imperfect. We do what we can</p>",
        "id": 153856370,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478804862
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Ok, I'll give you that it is a jump, but I'd say it is a subtle one, and a distinction likely to be lost on many developers (including myself until you pointed it out). Isn't it better to provide guidance or normative language to avoid cases like that?</p>",
        "id": 153856378,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1478806364
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> .. we probably need to take this sub-conversation to a different thread, or offline, but I just wanted to say one thing more.</p>\n<p>RE \"FHIR is a <em>interoperability</em> solution, and such, will always be imperfect.\" &lt;= Of course you and I and 100's of other folks that are in the trenches know this well. But unfortunately the hype surrounding FHIR has set the expectations of Healthcare IT executives (and even IT folks who are yet to engage with FHIR) in a way that never happened with v2.x  -- so that reality is going to be more highly visible and have a much greater impact that it did the last go-around. </p>\n<p>Can we avoid that completely? Probably not. But I believe that we can reduce or minimize the problem by taking a few steps to free the knowledge and information that emerges 24/7 from these ongoing conversations and package it in a way that developers (a/k/a implementers) who are new to FHIR have a fighting chance of not making terrible mistakes simply because they haven't been privy to the chatter over the past 4 or 5 years. There's a ton of seminal information hidden within that chatter that should be digested and made available to developers, which IMHO could greatly improve consistency and compatibility between FHIR implementations.</p>",
        "id": 153856380,
        "sender_full_name": "Thomas Lukasik",
        "timestamp": 1478807941
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192005\">@Thomas Lukasik</span> There's nothing stopping anyone from taking on such a task if they want to (other than how daunting it is), but it's beyond the bandwidth of those who are currenly eyebrow deep in developing the spec.</p>",
        "id": 153856384,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478808789
    },
    {
        "content": "<p>I agree with all of that, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>.. but I think that it could make a significant and positive difference in the quality and acceptance of the resulting resource if the undertaking were somehow recognized, sanctioned, reviewed and/or otherwise under the purview of the HL7 FHIR community. That's the only reason that I've burdened this discussion with my thoughts. I was hoping for others to chime in with theirs -- as you have.. thanks!</p>",
        "id": 153856388,
        "sender_full_name": "Thomas Lukasik",
        "timestamp": 1478809150
    },
    {
        "content": "<p>Well, I'd say the order of operations is: 1. someone starts throwing something together; 2. the community looks at it and says 'this looks good, we bless the effort; 3. The content hits a point where a review is appropriate/warranted; 4. We try to figure out how we're going to maintain the thing now that it exists . . .</p>",
        "id": 153856391,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1478809514
    },
    {
        "content": "<p>I'd certainly love to see this happen, and have even tried to raise money in the past for someone to have exactly this role. But money is hard to come by, and getting harder</p>",
        "id": 153856431,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1478815361
    }
]