[
    {
        "content": "<p>How would I find mammogram patients using FHIR, sorry I'm rather new to everything</p>",
        "id": 245351691,
        "sender_full_name": "Matthew Oliveira",
        "timestamp": 1625768561
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"424658\">@John Doe</span> One of the quirks to learn with Zulip is to change the topic name when you post if you want to talk about something different.  (This was originally listed under \"Repeat prescription request\" but I moved it to a new topic name.</p>\n<p>Can you explain your question more?  Do you want a list of patients who are due for mammograms?  Who are scheduled for mammograms?  Who have recently had mammograms?</p>",
        "id": 245355594,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625770411
    },
    {
        "content": "<p>Sorry about that, my apologies. Thank you for correcting my error. So I've been playing around with the FHIR servers using insomnia. I have been using the Hapi FHIR server R4 connecting with Observation and Patient data. Understanding how to add, edit, and search for specific data. Currently my team is looking into breast radiology primarily mammograms (patients who are due, patients who are scheduled, patients who have had one recently - all of it). Whenever attempting to connect to the ( <a href=\"http://hl7.org/fhir/us/breast-radiology/\">http://hl7.org/fhir/us/breast-radiology/</a> ) I get stuck on this page</p>\n<p><a href=\"/user_uploads/10155/ANx5ym06_-5Oe83bWYlwMNYg/Screen-Shot-2021-07-08-at-3.58.12-PM.png\">Screen-Shot-2021-07-08-at-3.58.12-PM.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/ANx5ym06_-5Oe83bWYlwMNYg/Screen-Shot-2021-07-08-at-3.58.12-PM.png\" title=\"Screen-Shot-2021-07-08-at-3.58.12-PM.png\"><img src=\"/user_uploads/10155/ANx5ym06_-5Oe83bWYlwMNYg/Screen-Shot-2021-07-08-at-3.58.12-PM.png\"></a></div><p>Any guidance on how to reach the data for mammograms would be extremely helpful</p>",
        "id": 245363791,
        "sender_full_name": "Matthew Oliveira",
        "timestamp": 1625774365
    },
    {
        "content": "<p>The FHIR IG for Breast Cancer Radiology is here: <a href=\"http://build.fhir.org/ig/HL7/fhir-breast-radiology-ig/\">http://build.fhir.org/ig/HL7/fhir-breast-radiology-ig/</a>  That will give you the profiles you need to search for.  This assumes that the server you're querying supports that FHIR IG.  If not, you might be needing far more specific queries based on Observation and Diagnostic Report</p>",
        "id": 245367911,
        "sender_full_name": "David Pyke",
        "timestamp": 1625776216
    },
    {
        "content": "<p>I'm worried that there might be confusion here between an implementation guide (the Breast Cancer Radiology IG, which provides guidance to vendors making products) and an actual clinical FHIR server with patient information in it.</p>\n<p>That said, as David pointed out, Oberservation is used for specific measurements and \"findings\", DiagnosticReport captures the radiologist's report (although more complex reports may use Composition as well, depending on which release of FHIR you're targeting), Procedure captures the order details, and ImagingStudy lists the images captured. Patient is self-explanitory, Practitioner (or PractitionerRole) documents the radiologist, technician, and others. Your environment may capture a copy of a paper requisition in DocumentReference. Other resources may be involved as well.</p>",
        "id": 245377801,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1625781673
    },
    {
        "content": "<p>What would be the best suggestion for pulling mammogram data from FHIR? I am looking for o <br>\n-a list of patients who are due for mammograms<br>\n-scheduled for mammograms <br>\n-recently had mammograms?</p>\n<p>Any help accessing this data would be greatly appreciated, so far havent had any luck :/</p>",
        "id": 245745180,
        "sender_full_name": "Matthew Oliveira",
        "timestamp": 1626122397
    },
    {
        "content": "<p>Recently had is simplest - you can look for Observations and DiagnosticReports that have a code indicating they're a mammogram and grab the Patient off those.  (You'd filter by date and by status.)</p>\n<p>For scheduled, you'd look at ServiceRequests where the code indicated mammogram (CPT or SNOMED), also filtering by date and status and then grab the patient.</p>\n<p>Due for is harder - you'd need to look at patient demographics (age, gender) and perhaps look for observations indicating clinical gender, procedures indicating past mastectomies, etc.  You might also want to look at FamilyMemberHistory and Observation for risk factors for breast cancer, including genetic characteristics.  You'd also need to look to see when the last record of mammogram and use whatever protocol your jurisdiction uses to take all of those factors into account to determine when they are 'due' for their next one.  No matter what you do, the list will be imperfect - you'll miss some folks and will have other folks in the list who aren't appropriate.</p>",
        "id": 245751588,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626124787
    },
    {
        "content": "<p>Is there anyway of switching to the 0.3.0 version of FHIR?</p>",
        "id": 245875123,
        "sender_full_name": "Matthew Oliveira",
        "timestamp": 1626204506
    },
    {
        "content": "<p>I think you may have confused version numbering.  Where did you get that version from?</p>",
        "id": 245875395,
        "sender_full_name": "David Pyke",
        "timestamp": 1626204614
    },
    {
        "content": "<p>I was looking in the fhir-breast-radiology-ig on GH, within the fsh-generated/resource</p>",
        "id": 245875537,
        "sender_full_name": "Matthew Oliveira",
        "timestamp": 1626204692
    },
    {
        "content": "<p>Not too sure if I am able to send links on here but: <a href=\"https://github.com/HL7/fhir-breast-radiology-ig/tree/master/fsh-generated/resources\">https://github.com/HL7/fhir-breast-radiology-ig/tree/master/fsh-generated/resources</a> here it is for easier access</p>",
        "id": 245875601,
        "sender_full_name": "Matthew Oliveira",
        "timestamp": 1626204724
    },
    {
        "content": "<p>Okay, that's the version of the FHIR IG and it's artifacts, not the FHIR version. It uses FHIR R4.</p>",
        "id": 245875653,
        "sender_full_name": "David Pyke",
        "timestamp": 1626204747
    },
    {
        "content": "<p>Which is FHIR version 4.0.1</p>",
        "id": 245875700,
        "sender_full_name": "David Pyke",
        "timestamp": 1626204778
    },
    {
        "content": "<p>Thank you for clearing that up, much appreciated</p>",
        "id": 245875748,
        "sender_full_name": "Matthew Oliveira",
        "timestamp": 1626204811
    }
]