[
    {
        "content": "<p>I'm transforming an ORU_R01 message to a Bundle with a MessageHeader and a DiagnosticReport in it. The following two pages list mappings for the ORC and OBR segments:</p>\n<p><a href=\"https://build.fhir.org/ig/HL7/v2-to-fhir/ConceptMap-segment-orc-to-diagnosticreport.html\">https://build.fhir.org/ig/HL7/v2-to-fhir/ConceptMap-segment-orc-to-diagnosticreport.html</a><br>\n<a href=\"http://hl7.org/fhir/uv/v2mappings/2020Sep/ConceptMap-segment-obr-to-diagnosticreport.html\">http://hl7.org/fhir/uv/v2mappings/2020Sep/ConceptMap-segment-obr-to-diagnosticreport.html</a></p>\n<p>The first one tells to map ORC.9 to DiagnosticReport.effectiveDateTime and the second one says to map OBR.7 to DiagnosticReport.effectiveDateTime. Unfortunately I have a message where both fields are set, with different values (ORC.9 contains a slightly later time than OBR.7). Is there any concensus on which of these two one should prioritize over the other?</p>",
        "id": 258049934,
        "sender_full_name": "Eli-Jean Leyssens",
        "timestamp": 1634571945
    },
    {
        "content": "<p>OBR-7 seems more appropriate as the clinically relevant date/time. I'll bring this up with the v2-to-FHIR group on the Thursday call.</p>",
        "id": 258262831,
        "sender_full_name": "Craig Newman",
        "timestamp": 1634673904
    },
    {
        "content": "<p>The project team agrees that ORC-9 isn't really appropriate for .effectiveDateTime, so we've updated the current version of the mappings.</p>",
        "id": 259416449,
        "sender_full_name": "Craig Newman",
        "timestamp": 1635439130
    },
    {
        "content": "<p>If the message doesn't have  OBR-7 populated, I don't think it we even be appropriate to value .effectiveDateTime with the OCR-9 value as that is the time of the event (presumably the result release date/time) and not the physiologically relevant date/time. </p>\n<p>Other possible fields would be SPM-17 (Specimen Collection date/time) if the message uses SPMs. A specimen collection data/time is usually considered the relevant timepoint for a lab test. OBX-14 is the other place worth looking. This might get complicated if there are multiple OBXs and they have different OBX-14 values (it's either a multiple specimen test or some of the OBXs are echoed Ask at Order Entry questions or something else).<br>\nIn general, it seems like if a results message doesn't have OBR-7 valued, you should be asking the sender why that is. It's usually pretty important to the result.<br>\n<span class=\"user-mention\" data-user-id=\"191689\">@Hans Buitendijk</span> - anything to add?</p>",
        "id": 259417184,
        "sender_full_name": "Craig Newman",
        "timestamp": 1635439418
    }
]