[
    {
        "content": "<p>This question is not strictly about FHIR, but about RxNorm which is a widely used medication coding standard in the US, so I thought this community may be familiar with my problem. Basically, I'd like to find the most convenient/easy way to map RxNorm codes by its category of use (e.g. obtaining all the RxNorm codes for hypertensive drugs, or all the RxNorm codes for insulin drugs, etc).</p>\n<p>I just started to tackle this problem. I'm thinking I could use ATC codes (e.g. all C02 and C03 for hypertensive drugs), but I'm not sure how to then map these to RxNorm to obtain all relevant RxNorm codes...  Any suggestions?</p>",
        "id": 174099355,
        "sender_full_name": "Beltran Figueroa",
        "timestamp": 1566766003
    },
    {
        "content": "<p>Ok, so I think I figured this one out. RxNorm provides two useful APIs RxNorm and RxClass. The latter can be queried to look for medication groups by disease area and tons of other classifications. You then have to use the response to query the RxNorm API to obtain the actual RxNorm code for the drug pack.</p>",
        "id": 174101030,
        "sender_full_name": "Beltran Figueroa",
        "timestamp": 1566769122
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"191402\">@Scott Robertson</span></p>",
        "id": 174110095,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566786363
    },
    {
        "content": "<p>I've often pre-generated these kinds of maps directly from the RxNorm database representation (e.g., load into SQLite, traverse relationships from ndfrt, generate a static output file). The API is nice but you don't necessarily want a run time dependency ot in any real app.</p>",
        "id": 174139306,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1566824926
    },
    {
        "content": "<p>a very late addition to this thread:  I was looking further into RxNorm today and found that there is both a class browser <a href=\"https://mor.nlm.nih.gov/RxClass/\" target=\"_blank\" title=\"https://mor.nlm.nih.gov/RxClass/\">RxClass</a> and a <a href=\"https://rxnav.nlm.nih.gov/RxClassAPIREST.html\" target=\"_blank\" title=\"https://rxnav.nlm.nih.gov/RxClassAPIREST.html\">RxClass RESTful API</a></p>",
        "id": 182696178,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1575575191
    }
]