[
    {
        "content": "<p>Hi, I want to map Bed Status in FHIR resource. I am getting V2, A20 (Bed Status Update) message. NPU-2 will have bed status which can be (as per User defined table-0116) - closed, housekeeping, occupied, Unoccupied, Contaminated and isolated (their equivalent codes would come in NPU-2). Now where to map these codes or bed status information. My best guess is Location resources. I can map NPU-1 (Bed Location) data in Location resource elements. What about NPU-2, again best looking element is Location.status. But status has only three values and valueset is Required, so that means I cannot create my own codes for Location.status. I am trying to map NPU-2 values to Location.status but not getting convinced, as there doesn't seem one to one mapping. Mapping housekeeping or Contaminated seems difficult. One can simply map them to suspended but that will not let receiving system to know actual thing. Another approach I see is using extension in Location resource? Please advise.</p>",
        "id": 153849511,
        "sender_full_name": "Aditya Joshi",
        "timestamp": 1474285314
    },
    {
        "content": "<p>This is good feedback, could you please add a traker item into gForge (there is a link to do this at the bottom of each page the spec) and the Patient Administration workgroup will get back to you.</p>",
        "id": 153849513,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1474285818
    },
    {
        "content": "<p>Hi  Brian, done, I have raised request in gForge. thanks. </p>",
        "id": 153849568,
        "sender_full_name": "Aditya Joshi",
        "timestamp": 1474291529
    },
    {
        "content": "<p>A propos \"bed\"<br>\nI was wondering: Does the code \"bd\" for Location.physicalType mean the location is a \"bed\" or a \"bedplace\"? <br>\nThe description \"A space that is allocated for sleeping/laying on.\" is unclear IMO.</p>\n<p>Does \"bed\" move around or is it partOf a \"room\"?</p>",
        "id": 153849640,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1474307531
    },
    {
        "content": "<p>I guess \"bd\" is for bed only. and bed is part of room, non moving. In order to represent bed, room, building etc. one has to create multiple Location resources and use partOf references. bed part of room part of building. </p>",
        "id": 153849814,
        "sender_full_name": "Aditya Joshi",
        "timestamp": 1474366745
    },
    {
        "content": "<p>So it's a bedplace. Not the thing with wheels and a matress.</p>",
        "id": 153849837,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1474375734
    },
    {
        "content": "<p>Not sure if we need to segregate both- bed and bedplace. In my experience, wards have multiple beds (thing with wheels and a mattress, wheels not sure but certainly a mattress so that patient can sleep or lay down on that.) Bed also have bed number which is the identification of that bed and very important to know as services have to be delivered at that location.</p>",
        "id": 153849840,
        "sender_full_name": "Aditya Joshi",
        "timestamp": 1474376581
    },
    {
        "content": "<p>Looking at the status, we definitely need to make clear what we mean: The bed can still be \"contaminated\" waiting somewhere to be decontaminated while the bedplace has already been equipped with a fresh bed and has been promoted to \"unoccupied\". <br>\nThe bedplace has a partOf relationship with a room, whereas a bed's location may be expressed through geo coordinates provided by a tracking system. I'm not saying that there's a use case for the latter, I'm just saying that the description of the code \"bd\" should be more concise.<br>\nBTW, the Version 2 name of PV.#1.3 is also labeled as \"bed\" whereas the german translation says \"Bedplace\":<br>\n<a href=\"/user_uploads/10155/-NklV16cJz6bBmuZhKGBjqli/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/-NklV16cJz6bBmuZhKGBjqli/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\"><img src=\"/user_uploads/10155/-NklV16cJz6bBmuZhKGBjqli/pasted_image.png\"></a></div>",
        "id": 153849862,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1474379338
    },
    {
        "content": "<p>By that definition, the bed itself sounds like a Device.  The bed place is the Location.  The bed would have a model number, manufacturer, even a serial number.</p>",
        "id": 153850059,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474420346
    },
    {
        "content": "<p>so that means location status is representing bed place status not the status of actual bed (a physical entity). when status=active, it means bed place location is active, can we also deduce the fact that actual physical bed would be there and active or available? Or later fact is not clear with location status value? </p>",
        "id": 153850142,
        "sender_full_name": "Aditya Joshi",
        "timestamp": 1474458294
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Good Point . Should I enter a GF to change the wording from \"bed\" to \"bedplace\" to make this clearer? Or am I the only one who's confused here?</p>",
        "id": 153850163,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1474464067
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> Change requests are always welcome and I think it's a good thing to clarify</p>",
        "id": 153850166,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474465617
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12135\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12135\">GF#12135</a> (Assuming \"Change requests are alwas welcome\" wasn't meant to be ironic :D )</p>",
        "id": 153850171,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1474466809
    },
    {
        "content": "<p>Nope.  Always welcome</p>",
        "id": 153850175,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474467250
    },
    {
        "content": "<p>I also prefer \"bed place\" to \"bed\"</p>",
        "id": 153850301,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1474499559
    },
    {
        "content": "<p>Agree, \"bedplace\" is much more clear.</p>",
        "id": 153850317,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1474510134
    },
    {
        "content": "<p>I think that \"bed space\" might be a little better.</p>",
        "id": 153850321,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1474517702
    },
    {
        "content": "<p>This is also an example binding valueset, so would be up to what is mapped from the EHR that you are connecting to, and how they model the location/organization heirachies.<br>\nThat is more likely going to be the source of what is likely to be practical here.<br>\nAnd will be very different depending on the context of use. A field hospital in a rural/crisis area would be very different to a ward inside a hospital and to a residential aged care facility.</p>",
        "id": 153850620,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1474659974
    }
]