[
    {
        "content": "<p>If I'm mapping the HL7 V2 Timing/Repeat pattern of 'C' (Continuous) into a MedicationRequest resource, what would I use (which properties in Dosage or Timing data elements) to represent the concept of 'Continuous?   (I noticed there is a Timing.code property which appears to have a small subset of the HL7V2 Repeat Pattern values like BID/TID/QD/etc. but it doesn't have 'C' for continuous; should I just copy the 'C' to this Timing.code property?)</p>",
        "id": 154017852,
        "sender_full_name": "John Silva",
        "timestamp": 1542064263
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> <span class=\"user-mention\" data-user-id=\"192080\">@John Hatem</span> ?</p>",
        "id": 154017853,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542064392
    },
    {
        "content": "<p>In MedicationRequest, there is an attribute called \"courseOfTherapyType\" with an exemplar value set  that includes continuous, acute and seasonal.  It isn't part of dosage or timing, it is part of the MedicationRequest.</p>",
        "id": 154017874,
        "sender_full_name": "Melva Peters",
        "timestamp": 1542079775
    },
    {
        "content": "<p>Thanks, that's 'not obvious'.  I also can't find this property; is this 'brand new' for R4?   This is another example of the complications of trying to provide a useful mapping between the existing \"V2 world\" and the FHIR world --- it seems like many things are either not considered or not obvious.  (I can't believe that the use case for Continuous meds, i.e. infusions, are not part of the 80% rule.)</p>",
        "id": 154017976,
        "sender_full_name": "John Silva",
        "timestamp": 1542115229
    },
    {
        "content": "<p>I'm not sure that \"continuous\" in courseOfTherapyType means the same thing that John is looking for.  You could have a patient who's on antirejection drugs with a course of \"continuous\" - meaning they will be taking them on an ongoing basis, likely forever.  However, they may still only pop a couple of pills a day.  That's a different thing from an IV med that's administered for a particular period of time (generally on an accute basis) but where the drug flows continuously.</p>",
        "id": 154018001,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542117257
    },
    {
        "content": "<p>My leaning is that that second type of \"continuous\" is implicit whenever a \"rate\" element is specified - and that you should never have a continuous drug that doesn't have a rate.  However, it would be good to have that made explicit...</p>",
        "id": 154018002,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542117303
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  - Yes, I'm interested in the second type of continuous, the one used ALL the time in V2 TQ datatype or TQ1 segment with the value specified in HL7 Table 0335  ( <a href=\"http://hl7-definition.caristix.com:9010/HL7%20v2.5.1/Default.aspx?version=HL7%20v2.5.1&amp;table=0335\" target=\"_blank\" title=\"http://hl7-definition.caristix.com:9010/HL7%20v2.5.1/Default.aspx?version=HL7%20v2.5.1&amp;table=0335\">http://hl7-definition.caristix.com:9010/HL7%20v2.5.1/Default.aspx?version=HL7%20v2.5.1&amp;table=0335</a>)<br>\nI can't understand how this most important element of inpatient medication orders (*) isn't modeled in FHIR MedReq -- unless I'm missing something obvious?   Also, inferring continuous from rate is somewhat obscure or a 'round-about' way of determining a MedReq is for a continuous or IV drug.   (Also,  in HL7 V2 there can be multiple RXC segments for the base (e.g. D5W or Normal Saline) and others for the additives (the actual drug), which may not have a rate specified (just an dose -- the rate is calculated)).</p>\n<p>(*) was/is the FHIR MedReq modeling mostly concerned with outpatient prescriptions not inpatient Med Orders?</p>",
        "id": 154018012,
        "sender_full_name": "John Silva",
        "timestamp": 1542118828
    },
    {
        "content": "<p>The RXC components would be handled as Medication ingredients.  The presumption is that each thing that has an independent rate is a distinct order.</p>",
        "id": 154018018,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542119390
    },
    {
        "content": "<p>Is there a situation where in v2 you'd have a continuous med order that didn't have a rate?</p>",
        "id": 154018019,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542119422
    },
    {
        "content": "<p>OK, but if I'm using medicationCodeableConcept instead of medicationReference then this (med ingredients) doesn't seem possible.  I suppose I could use a contained Medication resource.    Also, in V2 when you have an order (RDE) message with RXC components they are all part of the 'one mixture' that is administered as part of one 'infusion'  (i.e. all the RXC-Additives are delivered via the same needle and the same bag/line).    This is also true for feeding regimens where you have some base and a bunch of nutrition additives.  (I'm not a clinician obviously, but I've worked with enough of them to have a cursory idea of the different types of 'infusion meds' and 'nutritions' used for inpatient care.)</p>",
        "id": 154018029,
        "sender_full_name": "John Silva",
        "timestamp": 1542120865
    },
    {
        "content": "<p>If you're using RXC in v2, you pretty much have to use medicationReference in FHIR.  That's the only way you can describe mixtures or compounds.  MedicationCodeableConcept only works if the entire description of what you want to be administered is conveyable in a single code (or a single text string)</p>",
        "id": 154018034,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542122219
    },
    {
        "content": "<p>... RXC ... use medicationReference ... another reason WHY Medication needs to have identifier (not just code); I guess this did make it into R4; just need to figure out what to do in the meantime (STU3).</p>\n<p>However, I'm still not clear how to represent the Repeat Pattern of 'C' (continuous) in MedRequest.</p>",
        "id": 154018035,
        "sender_full_name": "John Silva",
        "timestamp": 1542122347
    },
    {
        "content": "<p>Don't understand the relationship between those two things...</p>",
        "id": 154018037,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542122404
    },
    {
        "content": "<p>Medications for 'mixes' of components are usually unique to a specific MedRequest/patient; these aren't necessarily 'stock pharmacy items'</p>\n<p>The HL7 V2 spec really gives the reason:</p>\n<p>\"If the drug or treatment ordered with the RXO segment is a compound drug OR an IV solution, AND there<br>\nis not a coded value for OBR-4-universal service ID, which specifies the components (base and all<br>\nadditives), then the components (the base and additives) are specified by two or more RXC segments.\"</p>",
        "id": 154018038,
        "sender_full_name": "John Silva",
        "timestamp": 1542122484
    },
    {
        "content": "<p>Sure - but that doesn't mean they have to have an identifier.  If it's not a \"standard\" compound you can point to, you'd typically just have a \"contained\" Medication instance inside the MedicationRequest.   The reference would point to the contained resource.  No need for a unique id.</p>",
        "id": 154018040,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542123223
    },
    {
        "content": "<p>Yes, I mentioned in an earlier response that one option was to use a contained resource but if I don't use a contained resource I really need an identifier (not a code) for the separate Medication resource.</p>",
        "id": 154018104,
        "sender_full_name": "John Silva",
        "timestamp": 1542134264
    },
    {
        "content": "<p>All you need is an id, not an identifier.  I.e. The instance needs a RESTful URL.  It does not need a business identifier.</p>",
        "id": 154018219,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542145734
    },
    {
        "content": "<p><em>All</em> resources have an 'id' element that uniquely identifies them on the server they're hosted on.  \"identifier\" is only needed when you want to capture a business identifier that remains consistent regardless of where the resource is posted.</p>",
        "id": 154018220,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542145787
    },
    {
        "content": "<blockquote>\n<p>Yes, I mentioned in an earlier response that one option was to use a contained resource but if I don't use a contained resource I really need an identifier (not a code) for the separate Medication resource.</p>\n</blockquote>\n<p>This doesn't follow.  You don't have a business identifier for this medication - you have a FHIR resource that has been assigned an arbitrary id and you are going to reference it via that FHIR id.</p>",
        "id": 154018242,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1542149706
    },
    {
        "content": "<blockquote>\n<p>Thanks, that's 'not obvious'.  I also can't find this property; is this 'brand new' for R4?   This is another example of the complications of trying to provide a useful mapping between the existing \"V2 world\" and the FHIR world --- it seems like many things are either not considered or not obvious.  (I can't believe that the use case for Continuous meds, i.e. infusions, are not part of the 80% rule.)</p>\n</blockquote>\n<p>John - are you able to come and join the Pharmacy WG calls?  You obviously have a number of requirements and we would really like to discuss these with you as opposed to finding them piecemeal via Zulip chats.  They are every Monday at 4pm eastern.</p>",
        "id": 154018243,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1542149818
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>  - because of the way we use a broker to create bundles from V2 messages, it doesn't query to get the internal ids from the FHIR server, it uses business Ids (generated from some field/fields in the V2 message) to interact with the FHIR server.    The V2 message, e.g. RDE has an identifier (e.g. in RXO-1 or RXE-2) that we use as the business identifier of for the specific \"instance\" of the ordered medication (i.e. NOT the type or class of drug, but the specific instance for the specific patient; obviously very important for 'custom mixture infusions')</p>\n<p>I should try to join the Pharmacy WG calls; I guess I could try to put on my calendar and make an effort to attend.  (I'm not a clinician but a s/w engineer so my perspective is/may be different and some of my questions may be naive from a clinicians point-of-view.)</p>\n<p>So, doesn't anyone have a suggestion on what to use to encode the V2 tbl 0335 concept of a Continuous frequency in MedicationRequest?   (It seems like this should be part of the Timing  data type since I can imagine it being used for other use cases besides only medication orders.)</p>",
        "id": 154018426,
        "sender_full_name": "John Silva",
        "timestamp": 1542205427
    }
]