[
    {
        "content": "<p>I would like to map adjudicated medical claims received from different carriers (healthplans) into FHIR model. Few quick questions as below and would like to get answer from the community.</p>\n<p>•   What is the right target FHIR resource(s) to map above data set? I would like most of the fields captured so that I do not have to remap again and again. Also, I would like to capture all claim line level detail to capture line level procedures and amount related information.</p>\n<p>•   They should be mapped under one resource (Claims) or breakdown in multiple resources like patient, providers, conditions, etc.?</p>\n<p>Any insights/suggestions would be appreciated. Thanks in advance for your help.</p>",
        "id": 170924815,
        "sender_full_name": "Basistha Gotra",
        "timestamp": 1563219797
    },
    {
        "content": "<p>An adjudicated claim would be ClaimResponse.  However, to fully map, you'll probably need a bunch of resources (including Claim, MedicationRequest, MedicationDispense, Practitioner, Organization, Medication and maybe a few others.</p>",
        "id": 170928173,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563222059
    },
    {
        "content": "<blockquote>\n<p>An adjudicated claim would be ClaimResponse.  However, to fully map, you'll probably need a bunch of resources (including Claim, MedicationRequest, MedicationDispense, Practitioner, Organization, Medication and maybe a few others.</p>\n</blockquote>\n<p>Thank you <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  for a quick response. Is there any documentation where I can go and review and I will have reference before I start mapping? I have handful of source data sets and they should be mapped in a FHIR model that can accommodate all needed elements.</p>",
        "id": 170931255,
        "sender_full_name": "Basistha Gotra",
        "timestamp": 1563224424
    },
    {
        "content": "<p>Other than the specification and the financial module, not any that I'm aware of.  X12 will be publishing a mapping to FHIR in the near-term (next few months) if that helps.</p>",
        "id": 170932321,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1563225221
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , what do you think of mapping adjudicated claims to ExplanationOfBenefit  resource, which has both claim and adjudication details in place ? I am also wondering if you know about any EOB resource use cases?</p>",
        "id": 171176973,
        "sender_full_name": "Varvara",
        "timestamp": 1563461049
    },
    {
        "content": "<p>@varvara the EOB is currently being used by CMS in the US for BlueButton and there are a variety of ways that it is being used. The EOB is most commonly used for reporting to patients but can also be used additional reporting.</p>",
        "id": 171177844,
        "sender_full_name": "Andy Stechishin",
        "timestamp": 1563461598
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span> and <span class=\"user-mention\" data-user-id=\"194124\">@Varvara</span> - our need is to map paid claims data for analytical and operational use. By saying that adjudicated paid claims from plans should be combined with EHR data from providers. That way analysts can use the full data sets that includes (member's eligibilities information, benefit information, med, Rx and other claims along with EHR) plus reporting to patients/providers depending on different use cases.</p>",
        "id": 171184340,
        "sender_full_name": "Basistha Gotra",
        "timestamp": 1563465599
    }
]