[
    {
        "content": "<p>we have under intent code in medication request a value of 'reported', which cannot be mapped to any FHIR value set code. this will end up in an error and resource will not be outputted. what is the expectation for this kind of problem? clients have many codes that are used for years and FHIR do not recognize all of them.</p>",
        "id": 257581636,
        "sender_full_name": "Lital Inghel",
        "timestamp": 1634235790
    },
    {
        "content": "<p>What is the meaning of having a value like <code>reported</code> in <code>MerdicationRequest.intent</code>?</p>",
        "id": 257582318,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1634236062
    },
    {
        "content": "<p>that wouldn't map to the medicationRequest.intent but would map to MedicationRequest.reported boolean</p>",
        "id": 257583735,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1634236614
    },
    {
        "content": "<p>actually it doesn't matter what it means, it is just one example out of many. client has codes that cannot be mapped to any FHIR code and this is an issue where there is a required field (1..) with a required value set. wasn't it raised before as an issue by EHRs?</p>",
        "id": 257589363,
        "sender_full_name": "Lital Inghel",
        "timestamp": 1634238879
    },
    {
        "content": "<p>It does matter what it means.  MedicationRequest.intent has a specific purpose - and you can only map things to it that represent actual \"intents\".  'reported' is not a level of 'intent'.  It's orthogonal to intent.  You could have reported plans, reported orders, reported proposals, etc.</p>",
        "id": 257590154,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634239184
    },
    {
        "content": "<p>The required binding signifies that HL7 believes that all possible values for concepts that really correspond to MedicationRequest.intent can be mapped to one of the values in the value set.  Obviously, it's possible we got that wrong for certain required value sets.  (In fact, I know we have.), but feedback needs to first be based on an accurate mapping.  We use required bindings where understanding the element is critical to understanding the resource or where we're convinced that international-scale mapping is both possible and worth the cost.</p>",
        "id": 257590521,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634239304
    },
    {
        "content": "<p>Just because somebody stored the value \"reported\" in a field in a database called \"intent\" doesn't mean that it has the same definition of the FHIR resource attribute named intent. Perhaps that value shouldn't have been stored in that column but was done so because it was easier than making a \"reported\" t/f column in the database. In which case you know to flip resource.reported = true, but now you are in a bind what is the actual intent? You'll have to research and know your definitions. Perhaps in your database the 'reported' value means \"reported=true, intent=order\" perhaps it's something else. </p>\n<p>Perhaps if the use case is research you skip that instance. But for treatment, you bite the bullet and provide the data you know even though it doesn't meet conformance. Because due to history, you didn't keep two different attributes intent and reported like you should going forward. In every conformance test I've been through, it has always been can you be conformant going forward. Nobody has ever been expected to meet conformance with the entire historical record.</p>",
        "id": 257593371,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1634240497
    }
]