[
    {
        "content": "<p>Hi,</p>\n<p>Can anyone point me to the right field to use in R4 for isBrand field in R3?<br>\nIt looks like isBrand field from R3 medication is deleted in R4 medication.</p>\n<p>Thanks<br>\nRavi</p>",
        "id": 180786425,
        "sender_full_name": "ravindra kondiparthi",
        "timestamp": 1573773175
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span></p>",
        "id": 180786830,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573773591
    },
    {
        "content": "<p>You'd have to use an extension if you needed that field or use MedicationKnowledge.  Within the actual scope of Medication - used to identify a product that has been ordered/dispensed/administered - we had no use case for the isBrand and isOverTheCounter flags.</p>",
        "id": 180791444,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1573777947
    },
    {
        "content": "<p>I'm happy we don't have \"isBrand\" and \"isOTC\" as flags, but should we have a \"medicationConceptType\" - to show whether this is a Generic, a substance, a product, a PHP, a package...?</p>",
        "id": 180837040,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1573828436
    },
    {
        "content": "<p>Whether clinician orders brand or generic is of interest to payers.  They are also interested  in how pharmacy filled as brand or generic.  At some point I would expect this will be a required or desired feature.  Clinicians might order generic but think by brand name.   Trying to consider end user use case.</p>",
        "id": 180845426,
        "sender_full_name": "Peter Muir",
        "timestamp": 1573833484
    },
    {
        "content": "<p>concept \"isBrand\" is not interoperable. It means different things in different places. hence my point</p>",
        "id": 180846233,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1573834020
    },
    {
        "content": "<p>yes, it may be relevant, as a characteristic of a drug, but not as a boolean. In practice we have more than one option, so IMO that is a code.</p>",
        "id": 180846362,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1573834091
    },
    {
        "content": "<p>Doesn't the medication.code tell you whether it is a brand or generic?  It did in all of the drug code systems that the committee looked at.  So it was just a redundant piece of data.</p>",
        "id": 180851622,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1573837764
    },
    {
        "content": "<p>More specifically, when systems care about whether something is a generic or brand, they typically care based on their own definition rather than the declaration from some other source.</p>",
        "id": 180853206,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573838861
    },
    {
        "content": "<p>On MedicationKnowledge there is a productType attribute “   <br>\nCategory of the medication or product (e.g. branded product, therapeutic moeity, generic product, innovator product, etc.).”</p>",
        "id": 180855549,
        "sender_full_name": "Melva Peters",
        "timestamp": 1573840555
    },
    {
        "content": "<p>In US, if chart information is being pulled from EHR with FHIR used for  chart data transmission to payer, there may be interest in EHR's generic/brand flag being transmitted for local/regional requirements without going to MedicationKnowledge.  Generic prescription ratio has been used by payers as a provider performance measure.  They may compare to pharmacy fill ratio.  Use case?   Not quite redundant.  Just trying to cover use cases.</p>",
        "id": 180858346,
        "sender_full_name": "Peter Muir",
        "timestamp": 1573842413
    },
    {
        "content": "<blockquote>\n<p>there may be interest in EHR's generic/brand flag being transmitted for local/regional requirements without going to MedicationKnowledge.</p>\n</blockquote>\n<p>I would not challenge the need. You _could_ still do it with a contained medKnowledge. Just don't make it a flag, but a code.</p>",
        "id": 180864688,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1573846714
    },
    {
        "content": "<blockquote>\n<p>More specifically, when systems care about whether something is a generic or brand, they typically care based on their own definition rather than the declaration from some other source.</p>\n</blockquote>\n<p>That's definitely not true in NZ or Australia - where the respective national medicines terminologies make a clear distinction between generic and brand medications, and there is an increasing body of regulations and instructions with regard to which of these categories should be prescribed in explicit use cases. For example...<br>\n<a href=\"https://aushealthit.blogspot.com/2019/11/what-are-regulations-for-new-electronic.html\" target=\"_blank\" title=\"https://aushealthit.blogspot.com/2019/11/what-are-regulations-for-new-electronic.html\">https://aushealthit.blogspot.com/2019/11/what-are-regulations-for-new-electronic.html</a></p>",
        "id": 180870919,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1573851334
    }
]