[
    {
        "content": "<p>Dear all,<br>\nI want to use FHIR to map the Diet prescribed/consumed by a specific patient. In my use case the Diet is a set of meal types (breakfast, lunch, dinner) and each meal type consists of a set of foods and beverages. I show you a possible an example in the following image. <br>\n<a href=\"/user_uploads/10155/8YqrKGD6SDUf8-BYzOobV6uW/Cattura.PNG\" target=\"_blank\" title=\"Cattura.PNG\">Cattura.PNG</a> <br>\nDiet has three meal types: breakfast, lunch and dinner. The breakfast consists of 200 milk, 2 units of cookies and a 1 cup of coffe. Lunch consists of 80 g of pasta, 30 ml of wine, 300 g of beef steak and 1 apple. Dinner consists of 400 g of fish, 150 g od salad and 100 g of potatoes. <br>\nMy idea is to map this information using the resource CarePlan. In details I have 4 CarePlan resources: one for the diet, one for the breakfast, one for lunch and one for dinner. Since breakfast, lunch and dinner are component of diet the attribute “partOf” of the CarePlan representing the Diet contains three references:<br>\n-   one reference for the CarePlan modelling breakfast<br>\n-   one reference forthe CarePlan modelling lunch and <br>\n-   one reference for the CarePlan modelling dinner.<br>\nEach CarePlan resource representing the meal type (breakfast, lunch and dinner) has a set of activities, one for each food or beverage. Consider, for example, the meal type “lunch” present in the figure (it consists of pasta, wine, beef steak and apple). There will be four CarePlan.activities and for each one of them there will be one CaraPlan.activites.detail. Each food/beverage present in lunch is mapped in this way:<br>\n-   Pasta, 80 g: CarePlan.Activity.Detail.code=”pasta” (modelled as CodeableConcept), CarePlan.Activity.Detail.quantity.unit=”grams”, CarePlan.Activity.Detail.quantity.value=80.<br>\n-    Wine, 30 ml: CarePlan.Activity.Detail.code=”wine” (modelled as CodeableConcept), CarePlan.Activity.Detail.quantity.unit=”millilitres”, CarePlan.Activity.Detail.quantity.value = 30.<br>\n-   Beef staek, 300g: CarePlan.Activity.Detail.code=”beef steak” (modelled as CodeableConcept), CarePlan.Activity.Detail.quantity.unit=” grams”, CarePlan.Activity.Detail.quantity.value = 300.<br>\n-   Apple, 1 unit: CarePlan.Activity.Detail.code=”apple” (modelled as CodeableConcept), CarePlan.Activity.Detail.quantity.unit=”unit”, CarePlan.Activity.Detail.quantity.value=1.</p>\n<p>Breakfast and dinner (with their foods and beverages) are mapped on CarePlan in similar way of lunch.<br>\nIn my use case of the Diet I need also to monitoring the activity to consume the foods/beverages (i.e. if the actions have been performed on no). My idea is to map this information using the Task resource, representing the intake activity of the single food/beverage, and create a reference in CarePlan.Activity.reference.<br>\nMy questions are:<br>\n1)  Is CarePlan the right resource to map Diet? I know that Fhir provides the NutritionOder Resource but I was not able to use it to map the Diet of my use case. <br>\n2)  What is the difference between NutritionOrder and CaraPlan to map a Diet? When must I use the first and when the second?  <br>\n3)  Is my proposed mapping correct? if it is necessary, Can you suggest me any changes?<br>\n4)  In my scenario the subject of the Diet can be both a patient that receive care (or other health-related service) and an individual without any problems that not receive any care or health-related service. In this case can I still use the CarePlan resource to map my diet? Must the subject of the CarePlan resource be only a patient that receive care or other health-related service?<br>\n5)  Is the activity of consuming the food/beverage a Task Fhir Resource referenced in the CarePlan.Activity that represent the single food/beverage?<br>\nIf the mapping on Fhir of my use case is wrong, can you provided a possible solution?<br>\nThank you for your reply.</p>\n<p>Bests regards,<br>\nDomenico<br>\nR&amp;D lab<br>\nEngineenering Ingegneria Informatica S.p.A.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/8YqrKGD6SDUf8-BYzOobV6uW/Cattura.PNG\" target=\"_blank\" title=\"Cattura.PNG\"><img src=\"/user_uploads/10155/8YqrKGD6SDUf8-BYzOobV6uW/Cattura.PNG\"></a></div>",
        "id": 153887108,
        "sender_full_name": "Domenico",
        "timestamp": 1493912179
    },
    {
        "content": "<p>Hi Domenico, I am pinging <span class=\"user-mention\" data-user-id=\"193259\">@Margaret Dittloff</span>  to help with this question.   I worked with her and the academy of Nutrition and Dietetics  to create this NutritionOrder resource based on the Domain model that they were instrumental in creating.   Am interested to hear why the NutritionOrder resource is not meeting your needs.</p>",
        "id": 153887112,
        "sender_full_name": "Eric Haas",
        "timestamp": 1493912769
    },
    {
        "content": "<p>Hi Domenico, This is a good use case. What you are capturing is not \"diet\" as it is defined in NutritionOrder and even v2/v3 messages as a nutrition therapy type of procedure (low carbohydrate diet) but the food intake data or observations.  Food frequency, 24-hour recall or food records like your example (whether record/submitted by the pt or clinician) do need to be mapped.  I'm not sure that the CarePlan activity as you have suggested.  But we know we need this!  We had been exploring similarities with our needs to state what the patient is doing/following by looking at how MedicationStatement has been modeled.    I will add this to our next Nutrition on FHIR project call (bi-weekly Tuesdays at 6 PM  ET).  Can you join that next call on 5/16? <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> can you also join that one?</p>",
        "id": 153887118,
        "sender_full_name": "Margaret Dittloff",
        "timestamp": 1493914553
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193259\">@Margaret Dittloff</span> and <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> thanks for your replies. I am glad to attend the conf call, if you agree including some colleague of mine. I am actually in Italy with CEST timezone. Do you confirm you are in Eastern Time? it should be Wednesday 17 of May,  12 AM CEST, right? We can keep in touch in private for contact details to join to the conf call, if you like. <br>\n<span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  a partial answer to your question is that I am not able to model with NutritionOrder \"a breakfast with 200 ml of milk and one cookie\", \"at least two liters of water daily\" and other similar things. </p>",
        "id": 153887120,
        "sender_full_name": "Domenico",
        "timestamp": 1493916708
    },
    {
        "content": "<p>Hi Margaret, I'm a colleague of Domenico working on this topic in the context of European and National research projects. I understand and agree that the definitions of our \"diet\" and the NutritionOrder resource doesn't match very well. At a first glance, we investigated a possible use of NutritionOrder, then we moved to other Fhir resources. Our use case is a bit more complex of what described by Domenico. We have both the concepts of diet planned by someone (the clinician or the person by himself) and food intake by a subject. At the moment, we considered the CarePlan the most suited resource for the planned diet, because the diet in our use case could be considered a nutrition \"plan\". Looking at the definition of that resource (e.g. the description of the attribute product[x] in CarePlan.Activity.Detail) seems to confirm it, but as you also suggested we are not sure about this choice.  Are you considering to extend the NutritionOrder resource or introduce new resources for this purposes? Concerning the food intake it could be an Observation or Procedure, but we also identified the Task resource suited for this purpose. I look forward to continue this discussion, maybe during the conf call or in further messages.</p>",
        "id": 153887257,
        "sender_full_name": "Antonio De Nigro",
        "timestamp": 1493970470
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193259\">@Margaret Dittloff</span> What's the current status with the Nutrition on FHIR project? I found a page (<a href=\"http://wiki.hl7.org/index.php?title=Nutrition_Management\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Nutrition_Management\">http://wiki.hl7.org/index.php?title=Nutrition_Management</a>) with notes from past telcos, but wasn't able to figure out current activities. I'd be interested in participating on the diabetes use case, especially tracking (estimated) carbohydrate intakes per meal. Data sources in my use case would be both nutrition logging apps and bolus (insulin dose) calculators.</p>",
        "id": 153923888,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1512820667
    },
    {
        "content": "<p>Just had a call with the nutrition folks who are looking at how to represent nutrition intake.  We talked about profiling Observation vs new resource.  I haven't seen all the requirements but will start with a profiles obs and see where that takes them.  bottom line a work in progress.  The general idea is mocked up here  ( <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span>'s  amazing ClinFHIR tool)  : <a href=\"http://clinfhir.com/logicalModeller.html#9gms0\" target=\"_blank\" title=\"http://clinfhir.com/logicalModeller.html#9gms0\">http://clinfhir.com/logicalModeller.html#9gms0</a></p>",
        "id": 153923893,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512836223
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/qCsnDgI-MiIiGEkMoU3IEBAp/Screen-Shot-2017-12-09-at-8.19.46-AM.png\" target=\"_blank\" title=\"Screen-Shot-2017-12-09-at-8.19.46-AM.png\">Screen-Shot-2017-12-09-at-8.19.46-AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/qCsnDgI-MiIiGEkMoU3IEBAp/Screen-Shot-2017-12-09-at-8.19.46-AM.png\" target=\"_blank\" title=\"Screen-Shot-2017-12-09-at-8.19.46-AM.png\"><img src=\"/user_uploads/10155/qCsnDgI-MiIiGEkMoU3IEBAp/Screen-Shot-2017-12-09-at-8.19.46-AM.png\"></a></div>",
        "id": 153923895,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512836432
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> looking at the fields, this really is an administration.</p>",
        "id": 153923896,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1512836750
    },
    {
        "content": "<p>for short-term and requirements validation, i think we can look at a profile, but i recommend that we follow up to see what is the best fit.</p>",
        "id": 153923897,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1512836954
    },
    {
        "content": "<p>(btw, thanks for following up)</p>",
        "id": 153923898,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1512836964
    },
    {
        "content": "<p>I agree  if it were its own resource, if a profille then would be a profile Observation.</p>",
        "id": 153923899,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512836971
    },
    {
        "content": "<p>my argument is that if an implementer has to register giving a food supplement, then their doubt should be between nutritionAdministration and medicationAdministration - which would be very similar in terms of data and metadata.<br>\nthe doubt should not be between a medicatonAdministration and an obervation.</p>",
        "id": 153923900,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1512837116
    },
    {
        "content": "<p>i just wanted to raise this, and do my best that observation does not become the swiss army knife for saying \"here's some information\", and that we avoid the pain with the many OBXs out there that are all HL7 compatible but not interoperable.</p>",
        "id": 153923901,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1512837208
    },
    {
        "content": "<p>crossed that Rubicon a while back I'm afraid</p>",
        "id": 153923902,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512837245
    },
    {
        "content": "<p>Composition is getting there too</p>",
        "id": 153923903,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512837271
    },
    {
        "content": "<p>ok. i think that this is a good topic for the WGM - the pattern \"ordering xxxx, delivering xxxx, informing about intake of xxxx\", possibly \"defining xxxx\" and see where this should apply - so that we don't have to repeat the effort for every new resource like glasses, prosthesis, blood, nutrition, organs...</p>",
        "id": 153923904,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1512837442
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span>  Thanks for pointng out our missing minutes.  I have updated the Nutrition Mgmt wiki page and also added slide presentions on the nutrition intake use cases we are trying to resolve.  Last week the nutrition group presented our requirements and existing gap analysis  to PatientCare (see PC FHIR call minutes from Dec 7th).  I was traveling and unable to join that call but it sounds like the recommendation is to try to create an intake profile on Observation.  One outstanding quesiton with that is how to handle the use case where dietitiant wants to send a recommended \"menu or meal plan\" - specific set of foods and amounts to be eaten (so a planned or future state).  For your use case for related to insulin dose  do you need to represent the event itself separetly like MedicationAdministration / MedicationStatement works?  We are scheduled to have a Nutrition subgroup call this Tuesday Dec 12  at 6 PM ET - Can you join that call to tell us more about your requirements?</p>",
        "id": 153924127,
        "sender_full_name": "Margaret Dittloff",
        "timestamp": 1512944639
    },
    {
        "content": "<p>planned or proposed diets are on the request side ...so NutritionOrder.  we have status for planned and proposed although in the request pattern is an <code>intent</code> element that captures it.  We still have not a chance to work on harmonized NO with the request pattern.</p>",
        "id": 153924134,
        "sender_full_name": "Eric Haas",
        "timestamp": 1512946902
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193259\">@Margaret Dittloff</span> 6 PM ET is 1 AM my time, so at least a bit inconvenient. :)</p>",
        "id": 153924188,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1512974048
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> Yes,  I figured as much.</p>",
        "id": 153924226,
        "sender_full_name": "Margaret Dittloff",
        "timestamp": 1512992419
    },
    {
        "content": "<p>Our current plan for the bolus calculator use case is to store the (estimate based) carbohydrate intake as the NutritionIntake profiled observation, and the resulting insulin dose as a MedicationAdministration entry. The MedicationAdministration could include other information from the bolus calculator, and perhaps have a reference to the NutritionIntake observation. Meal logging apps would just store the NutritionIntake observation.</p>",
        "id": 153924309,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1513019693
    },
    {
        "content": "<p>We're about to start defining and profiling both nutrition intake and diet recommendations in Finland soon. At least three different apps will be exchanging this information, on top of the <a class=\"stream\" data-stream-id=\"179222\" href=\"/#narrow/stream/179222-finnish-PHR\">#finnish PHR</a> platform. <span class=\"user-mention\" data-user-id=\"193259\">@Margaret Dittloff</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> can you please let me know whether you know how things have progressed since we last discussed this?</p>",
        "id": 153985891,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1534190443
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> That is great to hear.  AFAIK not much has changed. Our nutrition  workgroup has not met since last Fall when folks were directed toward Observation resource . so no work on an intake profile has really taken off.   NutritionOrder still needs worflow harmonization, correct <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> ?  The CrowdHealth project in Italy is also using a mapping from their model to FHIR Observation for nutrition  intake.  <span class=\"user-mention\" data-user-id=\"194459\">@Francesco T</span>  recently sent me those models.  Perhaps we should reconvene our group to meet before WGM?</p>",
        "id": 153985911,
        "sender_full_name": "Margaret Dittloff",
        "timestamp": 1534192505
    }
]