[
    {
        "content": "<p>I'm sure this is a topic that will have been covered before, In fact I know it came up in a discussion about the well-known URL for UCUM (<a href=\"http://www.unitsofmeasure.org\">www.unitsofmeasure.org</a>) which no longer points at a real site (it redirects), but the search function in Zulip has defeated me and I can't find that thread any more.</p>\n<p>Currently most of our UK published examples for FHIR <code>codeableconcept</code>items, where they refer to SNOMED codes, are using the generic <code>coding.system</code>  value of \"<a href=\"http://snomed.info/sct\">http://snomed.info/sct</a>\". That value basically just indicates \"this code is SNOMED\". SNOMED allows for a tree-structured hierarchy of code sets (Modules) to be defined. Sending the URL of the common root of SNOMED won't help you find the specific coded concept being sent if (as is very likely) that concept is defined out in one of the dependent modules (sub branches) such as a local country extension.</p>\n<p>The obvious thing to do would be to put a local extension module URL in <code>coding.system</code>, in our case that would be <code>http://snomed.info/sct/83821000000107</code> however that address while resolvable (kind of) just ignores the numeric part of the path and redirects the user to the  home page of <a href=\"http://snomed.org\">snomed.org</a>. It doesn't direct the user towards our UK terminology server where they might be able to get some useful info on the code.</p>\n<p>I can understand we don't want to keep changing the documented identifying URLs of codesystems used in FHIR every time someone moves  a domain name or spins up a new terminology server in the real world.</p>\n<p>This seems to imply there needs to be a mapping service, a sort of \"dynamic DNS for codesystems\" that would resolve a unique codesystem ID into the best available resource or service for that codesystem.</p>\n<p>Has this been discussed, and if so  where there any conclusions?</p>",
        "id": 245967223,
        "sender_full_name": "Colin E.",
        "timestamp": 1626272788
    },
    {
        "content": "<p>I'm not sure how that would work. For example if I'm in the uk and I see <a href=\"http://snomed.info/sct\">http://snomed.info/sct</a></p>\n<p>One user is going to want to go to <a href=\"https://termbrowser.nhs.uk/\">https://termbrowser.nhs.uk/</a><br>\nanother <a href=\"https://snomedbrowser.com/\">https://snomedbrowser.com/</a><br>\nOthers Shrimp or snapper<br>\nor one of the terminology servers<br>\nI would go here in postman <a href=\"https://ontology.nhs.uk/authoring/fhir\">https://ontology.nhs.uk/authoring/fhir</a></p>",
        "id": 245969409,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1626273785
    },
    {
        "content": "<p>SNOMED is complicated <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>.  SNOMED is a single code system that is managed as a set of independent editionswhere there's no single publication of the complete set of codes across all editions.  However, it still a <em>single</em> code system - every code is unique and has a single meaning, even though there isn't a single place to look them all up.  (With a bit of work and some knowledge of the code system, you can look at the code and figure out where to look up the meaning.)  Because it's a single code system, there's a single Coding.system uri.  This URI must be used for all SNOMED codes - using anything else is non-conformant.  If you want to convey what edition of SNOMED a code comes from, you can use Coding.version - recognizing that lots of systems will ignore/throw this away.  Details are covered here: <a href=\"http://build.fhir.org/snomedct.html\">http://build.fhir.org/snomedct.html</a></p>",
        "id": 245978396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626277535
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>Details are covered here: <a href=\"http://build.fhir.org/snomedct.html\">http://build.fhir.org/snomedct.html</a></p>\n</blockquote>\n</blockquote>\n<p>That was the starting point for me when I looked into this. The chain of references goes something like-</p>\n<p><a href=\"http://build.fhir.org/snomedct.html\">http://build.fhir.org/snomedct.html</a>            -refers to-             SNOMED CT URI Specification [http://snomed.org/uristandard]<br>\n<a href=\"http://snomed.org/uristandard\">http://snomed.org/uristandard</a>                      -refers to-            2.1 URIs for Editions and Versions [https://confluence.ihtsdotools.org/display/DOCURI/2.1+URIs+for+Editions+and+Versions]<br>\n<a href=\"https://confluence.ihtsdotools.org/display/DOCURI/2.1+URIs+for+Editions+and+Versions\">https://confluence.ihtsdotools.org/display/DOCURI/2.1+URIs+for+Editions+and+Versions</a> - refers to- 4.4.2 Edition URI Examples [https://confluence.ihtsdotools.org/display/DOCEXTPG/4.4.2+Edition+URI+Examples]</p>\n<p>which as it happens includes <a href=\"http://snomed.info/sct/999000041000000102\">http://snomed.info/sct/999000041000000102</a> as the \"most dependent module\" (thus appropriate search starting point for UK codes) of the UK edition.</p>",
        "id": 247235993,
        "sender_full_name": "Colin E.",
        "timestamp": 1627321235
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191687\">@Kevin Mayfield</span> makes a good point. Perhaps the ideal \"landing page\" for a resolvable URL is either a human-readable table of appropriate resources, by type, which for the UK would includes the services Kevin mentions, or with the appropriate \"Accept\" header or query option, returns a machine-readable resource list.</p>",
        "id": 247236474,
        "sender_full_name": "Colin E.",
        "timestamp": 1627321471
    }
]