[
    {
        "content": "<p>I'm working in Salesforce Health Cloud (Salesforce is a voting member of HL7). Currently, the data model they are conformed to is HL7 v2.3. I'm attempting to map a Questionnaire form to the data model which mirrors v2.3.  The problem I'm having is I have a question such as this: </p>\n<p>\"Have you had any change or new problems with your head, neck, ears, nose, mouth, or throat? If so, explain.\"</p>\n<p>According to the customer this maps to the following SNOMED codes:<br>\nDisorder of head: 118934005<br>\nDisorder of neck: 118939000<br>\nEar, nose, and throat disorder: 232208008<br>\nDisorder of mouth: 118938008<br>\nHas explanation: 417151001</p>\n<p>It seems to me we would label  a positive response as a \"Condition\", but generally raw data in v3.0 is captured in QuestionnaireResponse. However, I don't have that object in Salesforce Health Cloud. In theory I <em>could</em> create my own object and mirror the fields of QuestionnaireResponse. The question I have is: how would this be handled in v2.3? The architect (who is now off the project) said to use Observation for all capture. However, according to spec, Observation captures specific \"point-in-time\" or lab data. So, it seems wrong to capture all values in \"Observation\". As some noted in other threads, Gravity auto-generates a \"Condition\" as \"unconfirmed\" based off of  QuestionnaireResponse. I think that's the right approach. Am I correct?</p>",
        "id": 253041001,
        "sender_full_name": "Edwin Schaeffer",
        "timestamp": 1631512158
    },
    {
        "content": "<p>What you seem to be capturing is 'symptom' data, which is in fact appropriate to capture using Observation.  Symptoms are point-in-time reported information, while Condition is more about diagnoses and health states that are tracked and evolve over time.</p>",
        "id": 253122600,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631551805
    },
    {
        "content": "<p>Interesting. By the literature it seemed Observation was used for lab, vital data, or measurements taken by a device. The questions are asked via Electronic Health Forms. You think it's Observations across the board? I have other questions ranging in changes in prescribed medications or psychological diagnosis.</p>",
        "id": 253217629,
        "sender_full_name": "Edwin Schaeffer",
        "timestamp": 1631609374
    },
    {
        "content": "<p>In some contexts, one can argue that \"everything is an Observation\".  When data is managed in a question &amp; answer format, it may be that Observation is the best way to represent it - even something like \"patient birth data\".  However, for much healthcare data there are better places for it once you have a certain level of detail.  So \"is the patient on an ACE inhibitor?\" might be an Observation.  On the other hand, a record that the patient is on a particular ACE inhibitor and it was started 2.5 years ago would ideally be captured as a MedicationStatement.</p>\n<p>In short - it can get messy :)</p>",
        "id": 253360162,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631679538
    }
]