[
    {
        "content": "<p>I've been looking at the description of the FHIR Mapping tool. It's mostly making sense to me, though its selection approach is driven by explicit context iterations.  Personally I prefer the recursion/predicate/modes model used in XSLT, but this can be made to work. (And yes, as someone who as worked on an XSLT implementation, I know I'm biased.)</p>\n<p>The tutorial is, obviously, incomplete at this time -- but I have a few questions about the last section that has been written (#13), where it's mapping from a set of values, to a set of references to values stored separately.</p>\n<p>src.f1 as s_f1 -&gt; create(\"TRight2\") as rr, tgt.ptr = reference(rr) then {<br>\n  s_f1 -&gt; rr.f2 = srcff;<br>\n};</p>\n<p>First,  the mapping statement is copying s_f1 to rr.f2, but there's no f2 in the target illustration. I presume that's a typo and they meant to say rr.f1 (or TRight2 was supposed to have an f2 child rather than the f1 shown).</p>\n<p>Second, the description says \"This mapping statement makes use a special known value \"null\" for the target context to indicate that the created element/object of type \"TRight2\" doesn't get added to any existing target context.\"  I don't see null in the sample statement.  Is that implicit in the create(), or did something get left out?</p>\n<p>Third, there's no explanation of the \" = srcff\" clause.  Was that supposed to be \"= s_f1\", or is there something else going on here?</p>",
        "id": 186890868,
        "sender_full_name": "Joe Kesselman",
        "timestamp": 1580308828
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 186901464,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1580314952
    },
    {
        "content": "<p>My interpretation would be that \"target context\" refers to StructureMap.group.rule.target.context. The context is in many cases the variable / type name to which the rule applies. For example, given \"src.f1 as s_f1 -&gt; tgt.example = create('TRight') as rr\" the context for the create function would be \"tgt\". However, I don't see it documented anywhere that in this case the context should be \"null\". When converting the mapping language to StructureMap you can leave it out as the element is optional.</p>",
        "id": 186958118,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1580365279
    },
    {
        "content": "<p>The last part should be \"s_f1 -&gt; rr.f1 = s_f1;\". The simple form (\"s_f1 -&gt; rr.f1;\") can't be used as \"s_f1\" might be repeating.</p>",
        "id": 186958234,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1580365532
    },
    {
        "content": "<p>And all parameter passed as a string in the the tutorial should be using single instead of double quotes.</p>",
        "id": 186958677,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1580366335
    }
]