[
    {
        "content": "<p>Good day!<br>\nI would like to create a database with mapping SNOMED to ICD-10. For some concepts there are additional age conditions. For example, <code>Bacterial sepsis (10001005)</code> with the additional condition <code>Age of onset of clinical detection (445518008) &lt;29.0 days</code>. There can be many such additional conditions for age (<code>&lt;1.0 years</code>,<code>&gt; = 1.0 years</code>, <code>&lt;2.0 years</code>,<code>&gt; = 2.0</code>, <code>&lt;5.0 years</code>,<code>&gt; = 5.0 years</code>, etc. .).<br>\nDo you have any ideas how to work with conditions by age, how to store data in a database by conditions by age?</p>",
        "id": 246427012,
        "sender_full_name": "Eugenii",
        "timestamp": 1626682115
    },
    {
        "content": "<p>Are you storing actual patient data and are trying to categorize it?  In general, you can't store temporal categorizations because they're continuously changing.  Something that was &lt;29.0 days last week might be &gt;29.0 days this week.  So typically you just store the data with the date and use your query process to categorize at time of query execution.</p>",
        "id": 246450979,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626699589
    },
    {
        "content": "<p>Not certainly in that way. I want to tie time frames to mapping.<br>\nFor example, there is <code>Corneal degeneration</code> with SNOMED code 111521006.<br>\nIf the patient is &gt;65 years old, the concept is mapped to H18.419 in ICD-10. In other cases to code H18.40 in ICD-10. <br>\nThus, it is necessary to somehow store data at time intervals.<br>\n I can create my own code system with concepts for time periods. How good is this solution?</p>",
        "id": 246548770,
        "sender_full_name": "Eugenii",
        "timestamp": 1626761818
    },
    {
        "content": "<p>Yeah, not great. There is work afoot in vocab to modify ConceptMap and $translate to allow dependsOn and product elements that are non-code typed. That would help</p>",
        "id": 246548971,
        "sender_full_name": "Jim Steel",
        "timestamp": 1626762008
    },
    {
        "content": "<p>Thanks for the answer!<br>\nDo you have any results? I would like more specifics.</p>",
        "id": 246577101,
        "sender_full_name": "Eugenii",
        "timestamp": 1626784069
    },
    {
        "content": "<p>Actually, you wouldn't want \"if the patient is &gt;65 years old\" at the time of mapping, you'd want \"if the patient <em>was</em> &gt; 65 years old\" at the time the SNOMED code was asserted (which could have been 10 years ago)</p>",
        "id": 246605699,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626794362
    },
    {
        "content": "<p>So the mapping would have to be tied to a mathematical expression between 2 dates and shouldn't be dependent on when the mapping was run.</p>",
        "id": 246605770,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626794398
    },
    {
        "content": "<p>Are there other considerations in your snomed =&gt; icd 10? For instance, do you have to know location in order to do a translation. Take 254837009 (breast cancer) does that become C50.012, C50.812 or C50.912  OR if the patient is male, perhaps C50.021. </p>\n<p>What it sounds like you are trying to do is convert a snomed ct based conditions list (patient chart) to an ICD10 based conditions list (patient chart). Without all of the details of the patient and probably a set of rules that are individualized to each snomed ct code, you aren't going to automate this process. </p>\n<p>If code = 254837009 AND gender = male AND laterality = right AND location = central Then ICD C50.121<br>\nIf code = 111521006 AND Age at diagnosis &gt; 65y Then H18.419<br>\nIf code = 111521006 AND Age at diagnosis &lt;=65y Then H18.40<br>\nThe list goes on.... </p>\n<p>Did you ask yourself why there wasn't already a Snomed ct =&gt; icd10 dictionary. This is why, it's not a dictionary it's a formula, likely a different formula for every single value.</p>",
        "id": 246626205,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1626803553
    },
    {
        "content": "<p>There may be a simple conversion dictionary but it probably excludes all the extra stuff that icd10 brings along.<br>\nFor instance:<br>\nIf code = 254837009 Then ICD 10 Breast Cancer (Unspecified laterality, Unspecified location, Unspecified Gender). Unfortunately there doesn't appear to be such a code. (unless you want to code it as \"History\")</p>",
        "id": 246627395,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1626804124
    },
    {
        "content": "<p>The SNOMED CT to ICD-10  Map developed by SNOMED International,  is a complex, unidirectional map. Many of the challenges involved can be seen in this excellent <a href=\"https://www.healthterminologies.gov.au/library/DH_3288_2020__TerminologyAndClassificationPresentation_v2.1.pdf\">presentation</a> from the Australian Digital Health Agency.</p>",
        "id": 246659329,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1626820554
    },
    {
        "content": "<p>Moreover if you are working with data that uses ICD10 codes without applying these rules, then they have a different meaning/interpretation and technically should not be consider ICD10 any more (not that this has ever stopped people from doing so <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span> )</p>",
        "id": 246701166,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1626862812
    },
    {
        "content": "<p>In the presentation that <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> links to, one of the \"map\" tools specifically calls out that the output of the map is only to be used for research and never for anything patient facing. I suppose that is an indication of how reliable the map is.</p>",
        "id": 246710783,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1626869959
    }
]