[
    {
        "content": "<p>I'm writing implementation guide stuff currently. My only interface is markdown enabled. Every once in a while need more than Markdown will let me (background-color, color, margin, padding, ...) but nothing in the @style or @class ever renders properly. Anyone know how build richer stuff without breaking markdown?</p>\n<p>Example:</p>\n<div class=\"codehilite\"><pre>&lt;span style=&quot;background-color: #ddddd&quot;&gt;\n- Boilerplate line 1 &lt;br/&gt;- Boilerplate line 2\n&lt;/span&gt;\n</pre></div>",
        "id": 153858156,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479834691
    },
    {
        "content": "<p>I don't know that you can; I think you need to make out of band agreements around stylesheets for post-markdown content</p>",
        "id": 153858180,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479878919
    },
    {
        "content": "<p>The wonderful thing about markdown is that the creator refused to standardise it. The official variant for us is this one: <a href=\"https://daringfireball.net/projects/markdown/syntax\" target=\"_blank\" title=\"https://daringfireball.net/projects/markdown/syntax\">https://daringfireball.net/projects/markdown/syntax</a></p>",
        "id": 153858181,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479878955
    },
    {
        "content": "<p>but your interface could be using anything</p>",
        "id": 153858182,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479878969
    },
    {
        "content": "<p>Most implementations use the GitHub variant.<br>\n<span class=\"user-mention\" data-user-id=\"191375\">@Alexander Henket</span>, if you're using the eXist MarkDown module, that's what it uses.  Both the Daring Fireball and GitHub variants allow for inclusion of pure HTML, though, so you should be able to do this.</p>",
        "id": 153858349,
        "sender_full_name": "Stephen Royce",
        "timestamp": 1479944507
    },
    {
        "content": "<p>I've just learned that the flavor is CommonMark (<a href=\"http://commonmark.org\" target=\"_blank\" title=\"http://commonmark.org\">http://commonmark.org</a>). CommonMark takes care of exactly the ambiguity that Grahame mentions and in doing so is unambiguously limited in its capabilities. So I'll be talking to my 'hoster' to see what can be done.</p>",
        "id": 153858355,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479972036
    },
    {
        "content": "<p>Just curious, why not use html then? Isn't the simplicity of markdown defeated when you start complicating it?</p>",
        "id": 153858358,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1479972832
    },
    {
        "content": "<p>Like Einstein said: As simple as possible but not any simpler. Without styling things are too simple/limited.</p>",
        "id": 153858359,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479972990
    },
    {
        "content": "<p>O and *down was not my choice... I would have loved to work with a proper XHTML editor, site content manager, something that does broken link checking, takes care of a central place for storing headers/footers and what not</p>",
        "id": 153858360,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479973047
    },
    {
        "content": "<p>Markdown would have allowed for most of that stuff, not sure about CMS compatibility, but CommonDown is too restrictive.</p>",
        "id": 153858361,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479973191
    },
    {
        "content": "<p>you can do linking checking with markdown, along with a proper editor, but the key advantage of markdown - that doesn't allow pure html , that is - is that you can confidently secure the content, where as with markup, security is always a contest </p>",
        "id": 153858362,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479973240
    },
    {
        "content": "<p>we're watching commonmark. it's the most likely thing to be a standard. but the community has to converge to it. And <span class=\"user-mention\" data-user-id=\"191366\">@Stephen Royce</span> github is used be some implementations, but not most. </p>",
        "id": 153858363,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479973294
    },
    {
        "content": "<p>That security argument is mostly relevant for my hoster, not for me. I only know I lack what I need.</p>",
        "id": 153858364,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479973308
    },
    {
        "content": "<p>CommonMark has this notion on its front page that with some help they will be getting to 1.0 final early 2016. I guess they got delayed</p>",
        "id": 153858365,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479973374
    },
    {
        "content": "<p>security is very important, but so is robustness to capabilities. By limiting to markdown we can require everyone supports all of markdown; go the other way and you can never be sure what is supported.  </p>",
        "id": 153858396,
        "sender_full_name": "John Moehrke",
        "timestamp": 1479996894
    },
    {
        "content": "<p>What specifically is so critical that you want to break out of the markdown limits? Background color doesn't seem compelling, or it hasn't been described in a compelling way.</p>",
        "id": 153858397,
        "sender_full_name": "John Moehrke",
        "timestamp": 1479996940
    },
    {
        "content": "<p>Why is every specification out there nicely styled and layed out, while I'm stuck with black and white basic notepad stuff? I don't get why wanting style is something to discuss. Sorry to be blunt about it.</p>",
        "id": 153858398,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1479997416
    },
    {
        "content": "<p>Yeah I understand your desire, but markdown gets converted to html, which you can style then?</p>",
        "id": 153858450,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1480024243
    },
    {
        "content": "<p>For that you need hooks like classes. Also not having access to div/span in my source makes it really difficult to style later. I've already talked to the hoster and my wishes are on the (long) todo list... :-) Eventually life will get better.</p>",
        "id": 153858469,
        "sender_full_name": "Alexander Henket",
        "timestamp": 1480067379
    }
]