[
    {
        "content": "<p>Hi - I was hoping someone could advise whether we need to use the masked extension, to denote (every) missing required element of a resource, that has been redacted when we also specify the redacted security tag (privacy restricted resource being returned).</p>\n<p>We are presuming it is to make the resource machine readable, but had it questioned as the extension is repeated many times.</p>",
        "id": 153842898,
        "sender_full_name": "Duncan Miller",
        "timestamp": 1470598681
    },
    {
        "content": "<p>the circumstances in which it is appropriate to mark an element as removed for security reasons are very narrow . Most security asd removal requires you not to mark that the information has been removed. </p>",
        "id": 153842902,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470604359
    },
    {
        "content": "<p>as far as FHIR is concerned, you don't need to us the mased extension at all. It's your local requirements that drive whether you should use it or not</p>",
        "id": 153842903,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470604392
    },
    {
        "content": "<p>Typically that extension is used when there's a need to explicitly declare to the recipient that information has been removed because there's an ability for them to go through a process to get access and they need to know that the information has been suppressed in order to go through the process.  But it's a tricky thing because sharing that data exists may be sufficient to infer at least some information.</p>",
        "id": 153842910,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1470607702
    },
    {
        "content": "<p>Thanks for both of your quick replies!!!</p>",
        "id": 153842931,
        "sender_full_name": "Duncan Miller",
        "timestamp": 1470617813
    },
    {
        "content": "<p>I have not seen this \"masked extension\" where is it? This extension was not added with the cooperation of or awareness of CBCC or Security WG. I am worried that it needs to be properly cast with explanation of the potential privacy breach it would present.</p>",
        "id": 153842997,
        "sender_full_name": "John Moehrke",
        "timestamp": 1470667337
    },
    {
        "content": "<p>I am assuming that this was a reference to the ISO 21090 nullFlavor extension, with value = MSK</p>",
        "id": 153843080,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470693703
    },
    {
        "content": "<p>The v3 code certainly has those caveats as part of the definition.</p>",
        "id": 153843087,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1470695727
    },
    {
        "content": "<p>so this is a pattern for using nullFlavors in FHIR to expose on an element by element basis that the reason it is null is because it has been masked? Can nullFlavors be used like that on ALL element types in FHIR?</p>",
        "id": 153843210,
        "sender_full_name": "John Moehrke",
        "timestamp": 1470753037
    },
    {
        "content": "<p>The only concept that has been discussed is to apply a security-tag to a RESOURCE that has been modified due to Privacy or Security reasons. This is applied at the Resource level, not at each element. To apply at the element level might be useful; but we need to warn our implememntors that doing so at the element level is more 'risk' than doing it at the resource level; yet doing it anywhere does have risk and should only be used when the risk of exposing that data has been masked is acceptable given the security/privacy context of the transaction. It is possible this is the same at the element level. I mostly want to get details written for our readership.</p>",
        "id": 153843212,
        "sender_full_name": "John Moehrke",
        "timestamp": 1470753286
    },
    {
        "content": "<p>presumably you think that the definition of the MSK code is inadequate?</p>",
        "id": 153843259,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470785077
    },
    {
        "content": "<p>The definition of MSK is likely good. What I think is not obvious is that the use of the code presents a Privacy Risk that might not be obvious. Thus I don't know if updating the definition of MSK is the best approach, but putting the 'privacy consideration' into the vocabulary might be the only way . </p>",
        "id": 153843376,
        "sender_full_name": "John Moehrke",
        "timestamp": 1470838520
    },
    {
        "content": "<p>\"Note: using this null flavor does provide information that may be a breach of confidentiality, even though no detail data is provided\" - seems clear to me</p>",
        "id": 153843416,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470860171
    },
    {
        "content": "<p>I don't see that text on <a href=\"http://hl7-fhir.github.io/extension-iso21090-nullflavor.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/extension-iso21090-nullflavor.html\">http://hl7-fhir.github.io/extension-iso21090-nullflavor.html</a>. I agree that it would be sufficient and clear.</p>",
        "id": 153843567,
        "sender_full_name": "John Moehrke",
        "timestamp": 1470923351
    },
    {
        "content": "<p>it's here: <a href=\"http://hl7-fhir.github.io/v3/NullFlavor/vs.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/v3/NullFlavor/vs.html\">http://hl7-fhir.github.io/v3/NullFlavor/vs.html</a> where the meaning of MSK is defiend</p>",
        "id": 153843699,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470957304
    },
    {
        "content": "<p>thanks</p>",
        "id": 153843739,
        "sender_full_name": "John Moehrke",
        "timestamp": 1471013886
    }
]