[
    {
        "content": "<p>Hi all, is there a min and max for field length predefined in HAPI already? Or how would we do this?</p>",
        "id": 166101037,
        "sender_full_name": "Jan-Marc Verlinden",
        "timestamp": 1558371478
    },
    {
        "content": "<p>MaxLength is defined as a standard element in StructureDefinition.  minLength is an extension.  <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> ?</p>",
        "id": 166102292,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558372327
    },
    {
        "content": "<p>We use STU3 and we cannot find any StructureDefinition with the field MaxLength inside. Right now we can insert max 1MB, so that means about 100.000 characters or so. Maybe you could help us out here?<br>\nQuestion 2: Where would we find a list of field validation for clinical or demographic data, would you have any idea? I was thinking of Snomed or Loinc, but don't know anymore.. :-). I found the OWASP cheatsheet that helps a lot already, but of course not for any clinical data. <a href=\"https://github.com/OWASP/CheatSheetSeries\" target=\"_blank\" title=\"https://github.com/OWASP/CheatSheetSeries\">https://github.com/OWASP/CheatSheetSeries</a></p>",
        "id": 166103798,
        "sender_full_name": "Jan-Marc Verlinden",
        "timestamp": 1558373566
    },
    {
        "content": "<p>FHIR doesn't define max lengths for anything other than String - which I don't think we surface using that extension.  maxLength would only appear in profiles.</p>",
        "id": 166109687,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558378443
    },
    {
        "content": "<p>Can you explain what you mean by \"field validation\"?</p>",
        "id": 166109718,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558378467
    },
    {
        "content": "<p>HAPI doesn't enforce any maximum field lengths by default.</p>\n<p>One thing that often trips people up though is that many containers (e.g. Tomcat/Jetty) and HTTP proxies (e.g. Nginx/Apache) enforce a maximum body size on HTTP post. If you want to deal with large resources you may need to increase this via configuration on the server itself.</p>",
        "id": 166179950,
        "sender_full_name": "James Agnew",
        "timestamp": 1558450504
    },
    {
        "content": "<p>Yes is (or would be..) defined in the (Dutch) profiles. For some of the clinical profiles this is the case, but not for any demographic data (as far as I can tell..). So this means that HAPI doesn't matter that PatientName has a max of 1MB of characters (maybe 100.000)? Or you just leave it up to the implementer. Or how did other implementers solve this?</p>",
        "id": 166194140,
        "sender_full_name": "Jan-Marc Verlinden",
        "timestamp": 1558460195
    }
]