[
    {
        "content": "<p>Is there a place on the HL7 website (that I am missing) that has MD5 checksums of the specification downloads (<a href=\"http://build.fhir.org/downloads.html\" target=\"_blank\" title=\"http://build.fhir.org/downloads.html\">http://build.fhir.org/downloads.html</a>)?</p>",
        "id": 183565563,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1576513829
    },
    {
        "content": "<p>Nope.  At the moment, we don't do that.  Is there a reason you think it's needed?</p>",
        "id": 183567793,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576515111
    },
    {
        "content": "<p>It would be convenient to validate what version of, say <code>fhir.schema.json.zip</code> was used, as there is no explicit version in the artifact itself.</p>\n<p>It is also common to have a checksum to make sure what you download is expected by comparing a published checksum to one you compute after download (<a href=\"http://hl7.org\" target=\"_blank\" title=\"http://hl7.org\">hl7.org</a> is not https, so there is a risk of man-in-the-middle)</p>",
        "id": 183578838,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1576522671
    },
    {
        "content": "<p>Our downloads aren't executable, so the risk isn't high.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, thoughts?</p>",
        "id": 183595628,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576533594
    },
    {
        "content": "<p>if you think there's a risk of mitm, you should switch to secure. If you worry about MITM, providing a non-secure checksum is hardly going to make any difference</p>",
        "id": 183596058,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576533875
    },
    {
        "content": "<p>True, I actually didn't know https was an option (got too used to secure auto-redirect on many sites). But a checksum would be nice to verify what I downloaded before, since the filenames (of the ZIP files) seem the same across FHIR versions on that page.</p>",
        "id": 183624900,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1576568560
    },
    {
        "content": "<p>Rather than storing the MD5 for each of the files, you'd be better off storing the version number.  If that changes, you know the site has shifted to the next version.</p>",
        "id": 183652647,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1576592851
    },
    {
        "content": "<p>I'll think about a checksum. A bigger problem is corrupt downloads, but I suppose the same people who can't figure their way through that won't be helped by checksums</p>",
        "id": 183680205,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576609787
    },
    {
        "content": "<blockquote>\n<p>But a checksum would be nice to verify what I downloaded before</p>\n</blockquote>\n<p>We were actually thinking the same thing in regard to the \"current\" version for IGs.  If there hasn't been a new build since the version that is in the fhir cache, we don't want to download again.  Right now, it seems there isn't a great way to make that determination.</p>",
        "id": 183681185,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1576610456
    },
    {
        "content": "<p>do people actually work like that? what would the workflow look like?</p>",
        "id": 183681379,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576610570
    },
    {
        "content": "<p>Another way though would be a mechanism / place in the fhir cache to store the ETag corresponding to each cached artifact.  That would probably be the more appropriate approach.</p>",
        "id": 183681531,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1576610652
    },
    {
        "content": "<p>that seems like solving a different problem for me. But it can't be a problem that arises anymore. Currency is not an issue for published packages, and current version currency is assessed using inside knowledge of the build system</p>",
        "id": 183682227,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576611019
    },
    {
        "content": "<p>We calculate the MD5 of the package.tgz - if it is different from previous seen package.tgz's, then we publish a new npm/maven artifact containing the IG - but our setup does not rely on HL7 Jenkins job</p>",
        "id": 183742639,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576669365
    },
    {
        "content": "<p>and this is only to handle the latest versions for bleeding edge development of the IG ... the other IG versions are tagged and are not needed to continuously evaluate the MD5</p>",
        "id": 183742682,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1576669429
    },
    {
        "content": "<p>current, the time in the package should match the time in <a href=\"https://build.fhir.org/ig/qas.json\" target=\"_blank\" title=\"https://build.fhir.org/ig/qas.json\">https://build.fhir.org/ig/qas.json</a></p>",
        "id": 183744171,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1576670968
    }
]