[
    {
        "content": "<p>The <a href=\"http://hl7.org/fhir/STU3/valueset-medication-request-status.html\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/valueset-medication-request-status.html\">MedicationRequestStatus</a> value set contains the following definitions for active and completed:</p>\n<blockquote>\n<p>active: The prescription is 'actionable', but not all actions that are implied by it have occurred yet.<br>\ncompleted: All actions that are implied by the prescription have occurred.</p>\n</blockquote>\n<p>Unfortunately, \"all actions that are implied by the prescription\" is not defined very well.  Without knowing which actions are considered to be \"implied\", I don't know if a prescription is \"completed\":</p>\n<ul>\n<li>when it is called into the pharmacy</li>\n<li>when it is dispensed</li>\n<li>when the patient is no longer taking it (or at least not supposed to be taking it)</li>\n<li>or some other event</li>\n</ul>\n<p>Is this clearly spelled out somewhere that I'm missing?  Or is this common knowledge that perhaps I just do not know?</p>",
        "id": 153891143,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1495637264
    },
    {
        "content": "<p>My understanding is when the patient is believed to no longer be taking it.  <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> </p>",
        "id": 153891162,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495638763
    },
    {
        "content": "<p>As a consumer of the data, I would like to be able to determine that \"completed\" means the patient is no longer taking the medication.  On the implementer side, however, it seems like it would be tough to correctly keep this status up to date -- particularly in an outpatient setting for a short-term (e.g., not recurring) prescription.</p>",
        "id": 153891167,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1495639798
    },
    {
        "content": "<p>I agree that we interpret 'completed' status to mean the patient is no longer taking it (e.g. an order that has reached its defined stop date and time or whose associated tasks are completed)</p>",
        "id": 153891281,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1495719058
    },
    {
        "content": "<p>It's probably worth having a notes section that talks about how the state of requests is managed in a community setting where there may not be a closed loop that lets you know when the patient has stopped administering - or even whether the patient has bothered to start . . .</p>",
        "id": 153891290,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495723759
    },
    {
        "content": "<p>Agree that the notes section needs to be updated - I will add a tracker item. </p>",
        "id": 153891295,
        "sender_full_name": "Melva Peters",
        "timestamp": 1495727945
    }
]