[
    {
        "content": "<p>I am a little confused on the intended use of the period option in effective[x]. The statement is \"The time or time-period the observed value is asserted as being true\".  If I have a situation where the measurement was taken over a certain period (such as an average heart rate; say a 60 second average) would the period be the proper way to report it OR do I give the time stamp of the measurement and indicate by some other means (such as an Observation.component) that it was computed  over 60 seconds?</p>",
        "id": 153885256,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1492692246
    },
    {
        "content": "<p>Period would be the correct way.  If you just wanted to capture a duration, I'd use an extension rather than a component</p>",
        "id": 153885275,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492699858
    },
    {
        "content": "<p>Agree with Lloyd on using period.  if you want to do duration.   Extensions makes sense.  Can you submit a tracker for consideration as a FHR core extension?   We talked about adding a Timing data type to the resource to ber able to represent more complex patterns of observations but Timing is problematic since its designed for recording future events and not event that occurred in the past.   We may need to  knock on MNMs door and ask about whether we can get a twin datatype for past events.</p>",
        "id": 153885298,
        "sender_full_name": "Eric Haas",
        "timestamp": 1492710901
    },
    {
        "content": "<p>Components work as well.</p>",
        "id": 153885299,
        "sender_full_name": "Eric Haas",
        "timestamp": 1492710919
    },
    {
        "content": "<p>see <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12896\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12896\">GF#12896</a>  re the whole timing in Observation thing</p>",
        "id": 153885300,
        "sender_full_name": "Eric Haas",
        "timestamp": 1492711038
    },
    {
        "content": "<p>Lloyd,<br>\nIn the PHD case a component would have the advantage that all could understand it based upon the component.code element without requiring special coding efforts to handle the extension. PHDs have an attribute specifically meaning 'duration' and as long as one understood the 11073-10101 code, there would be no question about what the component means and how it affects the 'primary' observation.</p>",
        "id": 153885313,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1492713564
    },
    {
        "content": "<p>Contained observation vs. extension is 6 of one, half a dozen of the other.  They're both name-value pairs.  Systems are going to have to be able to handle both styles - extensions are going to be quite prevalent.  So the decision of one approach vs. the other should be driven by whether you're truly talking about a separate \"observed thing\" or you're talking about a characteristic of the Observation.  \"How long did the observation take\" is definitely a characteristic of the observing, not a thing observed.</p>",
        "id": 153885326,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1492718028
    }
]