[
    {
        "content": "<p>Measure and MeasureReport :  looking for someone who can share how they implemented these two resources.  We have questions on how to use them.  We have CMS metrics, Fresenius specific metrics, and even patient specific metrics.  <br>\nWe also have question on similiar items, such as KPIs.  We are looking for implementation techniques for Patient level alerts, such as BP ranges and Lab Results.  Our business wants the Practitioner to write an order that captures what Observation limits (BP, Pulse, HgB...) should be for each patient, then we want to start Tasks based on Observation ranges.. Any help would be appreciated...</p>",
        "id": 153919798,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1510766692
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 153919835,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510775655
    },
    {
        "content": "<p>For the past several connectathons, we've been running quality measures using the Measure and MeasureReport resources with various participants and using this stack: <a href=\"https://github.com/DBCG/cqf-ruler\" target=\"_blank\" title=\"https://github.com/DBCG/cqf-ruler\">https://github.com/DBCG/cqf-ruler</a></p>",
        "id": 153919840,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510778287
    },
    {
        "content": "<p>It's a HAPI-FHIR derivative with plugins for evaluating CQL against FHIR and FHIR-based terminology servers.</p>",
        "id": 153919841,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510778313
    },
    {
        "content": "<p>It's the reference implementation for the Clinical Decision Support track here at DevDays as well.</p>",
        "id": 153919842,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510778339
    },
    {
        "content": "<p>We're refactoring things right now to try to get the dependencies declared so it's easier to plug in to an existing HAPI-FHIR server.</p>",
        "id": 153919843,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510778366
    },
    {
        "content": "<p>It also supports running Clinical Reasoning resources for a decision support service via CDS Hooks.</p>",
        "id": 153919844,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510778432
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> and <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>   We'll give it a shot.  We are working with <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> as well, and hope we can get some direction from his also, as we are using the HAPI FHIR JPA server</p>",
        "id": 153920224,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1510930624
    }
]