[
    {
        "content": "<p>In the <a href=\"https://www.hl7.org/fhir/measure.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/measure.html\">Measure</a> resource, one can specify criteria via the <a href=\"https://www.hl7.org/fhir/metadatatypes.html#Expression\" target=\"_blank\" title=\"https://www.hl7.org/fhir/metadatatypes.html#Expression\">Expression</a> type. In that Expression type one can use <code>text/cql</code> as language and there is an expression data element.</p>\n<p>In all examples I saw, for CQL, the expression data element always used expression names to reference named expressions from the <a href=\"https://www.hl7.org/fhir/library.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/library.html\">Library</a> resource referenced by the Measure.</p>\n<p>I like to use Measure together with $evaluate-measure to evaluate ad-hoc queries. So I would like to put real expressions like <code>AgeInYearsAt(@2013-01-01) &gt;= 16 and AgeInYearsAt(@2013-01-01) &lt; 24</code> in the expression data element. Otherwise I would have to create a separate Library for each ad-hoc query. I would still use a basic Library with some common functions and expression definitions, but I like to be able to evaluate expressions on top of that basic library.</p>\n<p>Currently I work on my own implementation. So I can implement support for real expressions. But I wonder whether other implementations would also support real expressions or only references to named expressions.</p>",
        "id": 168681225,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1561123789
    },
    {
        "content": "<p>We had restricted this in STU3 on the grounds that implementations wouldn't have to deal with in-line expressions, they could always just expect that the criteria was a reference to a named expression in the library for the measure. But in R4, we're actively seeking feedback on this. For our implementation, it is still easier to be able to assume the criteria is a reference to an expression in the library, but we are still in the process of updating to R4, so we might change that as we upgrade, especially if it facilitates more ad-hoc measure usage like you are describing.</p>",
        "id": 168696916,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1561135650
    }
]