[
    {
        "content": "<p>Hi folks, I'm looking at the ONC (c)(4) criteria for creating filtered QRDA-III XML files based on a defined set of filters (TIN, NPI, patient age, sex, conditions, etc.). I see the <code>MeasureReport</code> resource (<a href=\"https://www.hl7.org/fhir/measurereport.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/measurereport.html\">https://www.hl7.org/fhir/measurereport.html</a>) where <code>type</code> is <code>summary</code> which is analogous to a QRDA-III. However, I don't see any search or other parameters there or in (<a href=\"https://www.hl7.org/fhir/measure-operations.html#evaluate-measure\" target=\"_blank\" title=\"https://www.hl7.org/fhir/measure-operations.html#evaluate-measure\">https://www.hl7.org/fhir/measure-operations.html#evaluate-measure</a>) that would allow for filtering by these attributes. There also doesn't seem to be a way to run <code>$evaluate-measure</code>on a <code>List</code> or <code>Group</code> of <code>Patient</code>s to generate a <code>summary</code> type <code>MeasureReport</code>, it looks like it only supports filtering on one patient at a time. Is there another way to support this requirement that I might be missing? (CC <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> )</p>",
        "id": 153979368,
        "sender_full_name": "Kevin Weaver",
        "timestamp": 1532953546
    },
    {
        "content": "<p>$evaluate-measure supports population level evaluation, either as a summary, or as a ‘subject-list’. In either case the supplemental data and stratifiers are provided in the same way. The use case to search for a measure report based on those criteria those is new. Who are the actors in that case?</p>",
        "id": 153979517,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1532976212
    },
    {
        "content": "<p>Hey Bryn, I'm mainly getting the use case from 2015 Edition CQM criteria (c)(4), see <a href=\"https://www.healthit.gov/sites/default/files/2015Ed_CCG_c4-CQM-filter.pdf\" target=\"_blank\" title=\"https://www.healthit.gov/sites/default/files/2015Ed_CCG_c4-CQM-filter.pdf\">https://www.healthit.gov/sites/default/files/2015Ed_CCG_c4-CQM-filter.pdf</a>. The requirement is to \"filter clinical quality measure (CQM) results at the patient and aggregate levels by each one and any combination of the data listed in (iii).\" which are:</p>\n<p>(A)Taxpayer Identification Number.<br>\n(B) National Provider Identifier.<br>\n(C) Provider type in accordance with, at a minimum, the standard specified in § 170.207(r)(1).<br>\n(D)Practice site address.<br>\n(E) Patient insurance in accordance with the standard specified in § 170.207(s)(1).<br>\n(F) Patient age.<br>\n(G)Patient sex in accordance with the version of the standard specified in § 170.207(n)(1).<br>\n(H)Patient race and ethnicity in accordance with, at a minimum, the version of the standard specified in § 170.207(f)(2).<br>\n(I) Patient problem list data in accordance with, at a minimum, the version of the standard specified in § 170.207(a)(4).</p>\n<p>Attempting to translate this to FHIR, I don't see a way to generate a <code>MeasureReport</code> based on any arbitrary combination of the above filters, but I may be missing something.</p>",
        "id": 153979537,
        "sender_full_name": "Kevin Weaver",
        "timestamp": 1532977606
    },
    {
        "content": "<p>The idea would be to take the filtered <code>summary</code> type <code>MeasureReport</code> and translate it into a QRDA III XML file per the requirement.</p>",
        "id": 153979538,
        "sender_full_name": "Kevin Weaver",
        "timestamp": 1532977813
    },
    {
        "content": "<p>The practitioner parameter of the $evaluate-measure operation lets you run the report for a specific practitioner, and we use the <a href=\"http://build.fhir.org/ig/cqframework/qi-core/StructureDefinition-qicore-practitioner.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/cqframework/qi-core/StructureDefinition-qicore-practitioner.html\">QI Core Practitioner</a> profile to specify NPI and/or TIN as well as the specialty for a given practitioner.</p>",
        "id": 153979654,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1533040391
    },
    {
        "content": "<p>For the patient-specific data elements listed there (sex, race, ethnicity, payer), those are included as supplemental data elements in the measure definitions and then included in the summary and/or individual reports.</p>",
        "id": 153979655,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1533040488
    }
]