[
    {
        "content": "<p>A few years ago we had some short discussion about a patient's medication overview, and how to group the different medications. At the time the answer was CarePlan.  But I'm looking at CarePlan, and I want to clarify some details</p>",
        "id": 231454614,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616498794
    },
    {
        "content": "<p>a Medication(Usage) can be in status \"intended\" - where does that go? CarePlan.activity.plannedActivity or CarePlan.activity.performedActivity? <br>\nIf it is in plannedActivity, when it evolves to status not-done, does the same resource go to CarePlan.performedActivity?</p>",
        "id": 231455735,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616499431
    },
    {
        "content": "<p>I understand the method is not to have a central object group the things involved, but rather to have all the things involved pointing at the  same central object.  Hence why many resources have a .basedOn element.</p>",
        "id": 231461809,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616502860
    },
    {
        "content": "<p>Simple scenario: The patient has 2 medications for treatment of a given condition (gastritis): PPI and NSAID. <br>\nSo we have a protocol (planDefinition) that says \"PPI for 3 days, then NSAID\". Then this plandefinition gets instanciated for that treatment. <br>\nThen:</p>\n<ol>\n<li>They plan to take them both (2 MedRequests + ???)</li>\n<li>Then they go to the pharmacy and start taking he PPI (2 Dispenses + ??? ).</li>\n<li>3 days later they can start taking the NSAID. But they decide not to ( ???).</li>\n<li>Then they go to the GP and say that they didn't take the PPI (???)<br>\nI need a treatment identifier for each line, that allows me to track the Medication as it goes from Planned to Dispensed, to taken).</li>\n</ol>",
        "id": 231467250,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616505173
    },
    {
        "content": "<p>MedicationUsage is <em>supposed</em> to be an event, so it should always be under performed.  If you want to talk about what's planned, that should be MedicationRequest</p>",
        "id": 231468795,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616505774
    },
    {
        "content": "<p>Right. A medication starts as a medrequest, then becomes a medUsage. Where do I put the common identifier for the treatment?</p>",
        "id": 231532628,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616528937
    },
    {
        "content": "<p>In the carePlan itself, right?</p>",
        "id": 231532827,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616529024
    },
    {
        "content": "<p>so for my scenario, I have 1 careplan for PPI and another carePlan for NSAID</p>",
        "id": 231532876,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616529044
    },
    {
        "content": "<p>what I still need is a place (a single place) to put the MedicationUsage to represent the summary of the medication - start/end, dosage, drug..</p>",
        "id": 231548415,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616535672
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span> you also have the notion of \"medication treatment\" but I think you use a medstatement directly to represent the treatment, right? I'm inclined to follow that approach as well</p>",
        "id": 231551617,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616537243
    },
    {
        "content": "<p><a href=\"http://CarePlan.activity.id\">CarePlan.activity.id</a> I guess?</p>",
        "id": 231555091,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616539172
    },
    {
        "content": "<p>I can just use the <a href=\"http://careplan.id\">careplan.id</a>, because I need a careplan for each medication line.</p>",
        "id": 231590784,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616568953
    },
    {
        "content": "<p>The challenge I have is where to put that medication line's dosage, start/end, type...</p>",
        "id": 231590897,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616569082
    },
    {
        "content": "<p>I could use those as discrete elements in the activitydetail, but I only have it for plannedActivity, which means that after the activity is actually ongoing, i'd have to abandon that?</p>",
        "id": 231590969,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616569171
    },
    {
        "content": "<p>and I would like to use a dosage datatype instead of the different elements of dailyamount and quantity.</p>",
        "id": 231591104,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616569246
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> <span class=\"user-mention\" data-user-id=\"191990\">@Emma Jones</span> shouldn't CarePlan use Dosage datatype?</p>",
        "id": 231591221,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616569350
    },
    {
        "content": "<p>yes, there was discussion if to use MedicationRequest or MedicationStatement and we settled on MedicationStatement (which will be renamed in R4B to MedicationUsage)</p>",
        "id": 231591265,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1616569399
    },
    {
        "content": "<p>Ideally, i'd just use a MedicationStatement in the activity detail under a careplan, and in that Statement I keep the product, the dosage etc.</p>",
        "id": 231591464,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616569562
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span></p>",
        "id": 231591478,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616569572
    },
    {
        "content": "<p>I think the semantics of MedicationStatement become a bit more flexible here: it means an event \"someone has declared that this patient should be or has been taking this drug in this regimen\".</p>",
        "id": 231591672,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616569712
    },
    {
        "content": "<p>MedicationStatement is a reflection of the patient's declaration of \"what's happening\".  It's not a reflection of what <em>should</em> happen.  Sometimes the \"what's happening\" is a future-oriented statement.  E.g. \"I'm going to start taking my meds next week when I'm back from my trip\".  But it's still a reflection of patient action.  Sometimes it's inferred.  E.g. \"We know patient was prescribed or dispensed X, so we'll assume in our summary that they're on it\".  But it's always documentation about \"what is\".  If you want to talk express \"what should be\", you need to use MedicationRequest.  That's the resource that reflects what's prescribed or what the care coordinator intends to happen.</p>",
        "id": 231627797,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616590467
    },
    {
        "content": "<p>So, from a CarePlan perspective, you'd have MedicationRequest that would document what dose they're supposed to be taking and MedicationStatement reflecting what dose they <em>are</em> taking (or, sometimes, expect to be taking).</p>",
        "id": 231627923,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616590524
    },
    {
        "content": "<p>What I am looking is a single placeholder for that, without having to switch between resources.</p>",
        "id": 231662626,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616602569
    },
    {
        "content": "<p>(I can do this slightly abusing the resources, or making an extension, but I think it's better to discuss here to see if there is a better way). <br>\n<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Knowin that difference between the resources, I am basically looking at a way to define a medication treatment that may or not have started</p>",
        "id": 231662921,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616602679
    },
    {
        "content": "<p>You wouldn't have a single resource for anything else - \"I plan to do these lab tests\" vs. \"I have done these lab tests\" would be distinct resources.  So would \"I plan to make a referral\" vs. \"Here's the result of the referral\".  Why should medications be different?</p>",
        "id": 231668391,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616604623
    },
    {
        "content": "<p>You're free to just use CarePlan.activity, but it won't give you much detail.  If you need dosage details about both what was (or will be) ordered and what's actually being taken, you're going to need distinct resources.</p>",
        "id": 231668545,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616604685
    },
    {
        "content": "<p>there is a notion (which is what I'm trying to exchange) which is: <br>\n\"from this moment on, this person is on this treatment\" or \"this person was on this treatment\".<br>\nIn some cases, the treatment is defined (à la CarePlan), and then prescriptions are issued to support that - for example psychiatric treatments, or other long-term medication usage.</p>",
        "id": 231672282,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616605860
    },
    {
        "content": "<p>in some other cases we are just catching up with existing treatments.</p>",
        "id": 231672336,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616605886
    },
    {
        "content": "<p>And a treatment has a dosage, a product, a duration...</p>",
        "id": 231672385,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616605910
    },
    {
        "content": "<p>That sounds like MedicationRequest to me - it's describing what's supposed to be happening.</p>",
        "id": 231672845,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616606100
    },
    {
        "content": "<p>correct, except for those where we are just catching up and say \"you have been taking this drug without prescription? Good, we will add you to your treatment plan, and from now on we will issue prescriptions\"</p>",
        "id": 231674835,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616606850
    },
    {
        "content": "<p>MedicationRequest doesn't have to be about prescriptions - anything that's proposed or planned can be a MedicationRequest - even if it hasn't been (and might never be) prescribed.</p>",
        "id": 231676858,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616607489
    },
    {
        "content": "<p>Yes, my point is that the last example I gave does not start with a prescription. it starts with a statement.</p>",
        "id": 231679292,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616608290
    },
    {
        "content": "<p>Above those 2 cases (planned medication vs catching up) I want a \"treatment\"</p>",
        "id": 231679459,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616608346
    },
    {
        "content": "<p>I'll finish my logical model and bring it up</p>",
        "id": 231679517,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616608366
    },
    {
        "content": "<p>If you're using CarePlan, then you're talking about \"intended treatment\" (as well as tracking the 'actual').  You might <em>start</em> with \"what's happening now\", but as soon as you stick it into CarePlan, it's about \"what do you intend to happen\"</p>",
        "id": 231679975,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616608543
    },
    {
        "content": "<p>CarePlan can also be used for stuff that happened already, right?</p>",
        "id": 231680606,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616608780
    },
    {
        "content": "<p>Only as tracked against the 'plan'.  There's no ability to talk about activities except in the context of CarePlan.activity - which is about a 'planned' activity.  Within that, you can link to \"what's planned\" or \"what's happened\" or both.</p>",
        "id": 231684715,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616610326
    },
    {
        "content": "<p>That would shatter my hopes of using careplan to track medication treatment..</p>",
        "id": 231685248,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616610501
    },
    {
        "content": "<p>Not really understanding why?</p>",
        "id": 231685742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616610707
    },
    {
        "content": "<p>Pharmacy is working on some med list guidelines.</p>",
        "id": 231718064,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1616624041
    },
    {
        "content": "<p>I read them. These are discussions from IHE and Belgium, who have requirements that are similar to the Swiss implementation</p>",
        "id": 231721801,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616626149
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20overview/near/231685742\">said</a>:</p>\n<blockquote>\n<p>Not really understanding why?</p>\n</blockquote>\n<p>if the careplan can only represent things that were planned, this prevents me from using  carePlan to represent the medication that started a few weeks ago but now is properly prescribed etc.</p>",
        "id": 231722316,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616626473
    },
    {
        "content": "<p>right?</p>",
        "id": 231722323,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616626479
    },
    {
        "content": "<p>You can put stuff into the plan today that's been happening for a while.  What you can't do is put stuff in the plan that isn't planned \"as of now\"</p>",
        "id": 231732108,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616633171
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  You can state an intention with a Request, or a description with a Statement. I'm not sure I understand what requirement is being supported by plugging them together in a CarePlan (rather than with basedOn). </p>\n<p>(In the DAM we are trying to address people reviewing the planned activities and negotiating and signing off, but that's not in 4.)</p>\n<p>Are you suggesting that the CarePlan is the way you'd associate a Request &amp; Statement for which the Statement precedes the Request?</p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , where do we get the idea you can't retrospectively put in activities that were planned previously? This wouldn't be a case for Linkage, would it?</p>\n<p>Perhaps we could bring this up on the careplan call.</p>",
        "id": 232027969,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1616790847
    },
    {
        "content": "<p>I'm saying you <em>can</em> put in activities, even if they weren't planned previously (they just happened to get executed).  But from the point you put them in the CarePlan, they're planned from that point forward.  You can't have a CarePlan that lists something that isn't (as of now) 'planned'.  Though you could have a plan that says \"we plan for them to stop taking this\" with a current activity that shows them taking it and perhaps an extension that indicates that the patient has communicated they have no intention of ever stopping.</p>",
        "id": 232029799,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616791848
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191985\">Jay Lyle</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20overview/near/232027969\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span>  You can state an intention with a Request, or a description with a Statement. I'm not sure I understand what requirement is being supported by plugging them together in a CarePlan (rather than with basedOn). <br>\nAre you suggesting that the CarePlan is the way you'd associate a Request &amp; Statement for which the Statement precedes the Request?</p>\n</blockquote>\n<p>Yes, and a Dispense when the Dispense precedes the Request</p>",
        "id": 232155424,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616924359
    },
    {
        "content": "<p>I need to send the overview of a patient's medication in a summary form.</p>",
        "id": 232193953,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616966323
    },
    {
        "content": "<p>and i'd like to have a \"treatment\" represented in a consistent way, whether it is resulting from a prior plan, or just a statement of prior usage</p>",
        "id": 232194104,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616966474
    },
    {
        "content": "<p>e.g. patient says they are on PPIs for 2 months now, that creates a \"treatment\" entry. Physician enters it into their system.</p>",
        "id": 232194189,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616966586
    },
    {
        "content": "<p>then a physician sees that and decides to prescribe a change to the treatment.</p>",
        "id": 232194212,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616966618
    },
    {
        "content": "<p>the first part I have a MedUsage for \"PPI 20mg 2x a day before meals when needed\" Then I have a MedRequest for \"PPI 40 mg 2x day\", intent=plan</p>",
        "id": 232194317,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616966722
    },
    {
        "content": "<p>but I want a consistent way to show to another GP that \"this treatment was 20 mg 2x/day, now the same treatment has evolved to 40 mg 2x/day\"</p>",
        "id": 232194391,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1616966778
    },
    {
        "content": "<p>Does chaining MedicationRequests with priorPrescription work? Create one MedicationRequest for the 20mg and a second for the 40mg pointing back to the 20mg one. Each change of dose for the treatment is a new node in the chain.</p>",
        "id": 232228591,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1617003001
    },
    {
        "content": "<p>I don't see this as a chain - doing this as a chain gets really confusing in terms of managing status when we add dispenses and verbal changes to the mix.</p>",
        "id": 232231082,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617004724
    },
    {
        "content": "<p>IMO the solution is close to what you suggest, but the \"plan\" has to be an \"umbrella\" artifact.</p>",
        "id": 232231151,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617004776
    },
    {
        "content": "<p>I could add a MedRequest as a placeholder for all medication (even those as reported via a MedStatement), but that also has the same semantic inconsistency, right? that is no longer planned, we are just writing down what the patient had</p>",
        "id": 232231892,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617005164
    },
    {
        "content": "<p>i.e. if I were to do a MedRequest/Plan as that placeholder/overview, I'd think it makes more sense to use a MedStatement for that purpose.</p>",
        "id": 232231952,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617005214
    },
    {
        "content": "<p>priorPrescription is used when you're doing renewals.  It says the new one replaces the old one - it wouldn't drive chaining.  If you want a set of orders with timing constraints between them, you need to look at RequestGroup</p>",
        "id": 232275762,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617027683
    },
    {
        "content": "<p>I'm not focusing on the chaining of requests. I just want one vehicle for \"Medication Treatment\", that contains how the medication was (planned to be) taken.</p>",
        "id": 232292261,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617033743
    },
    {
        "content": "<p>a single \"umbrella\" description of medication.</p>",
        "id": 232292309,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617033765
    },
    {
        "content": "<p>I understand this not to be standard, so I don't mind extending. But I don't want to make assumptions that break the intended purpose of the resources.</p>",
        "id": 232292407,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617033800
    },
    {
        "content": "<p>MedicationRequest allows you to express \"planned to be\".  MedicationStatement allows you to express what's actually happening.</p>",
        "id": 232293279,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617034151
    },
    {
        "content": "<p>The difference between what was planned and what the individual is currently taking is an important patient safety issue.  When there is a medication change and a new medication is substituted or a dose is changed (ie the plan is changed), the MedicationRequest does not get cancelled or updated.  This is particularly true when the patient is in their usual environment: at home.</p>",
        "id": 232294863,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1617034865
    },
    {
        "content": "<p>I want to exchange a medication overview. In our current standard and in another implementation, that is one object. It is \"basedOn\" the prescriptions, the statements, the dispenses. But it is not a plan (unless we extend the meaning of the word \"plan\")</p>",
        "id": 232297262,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617035961
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191487\">Russell Leftwich</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20overview/near/232294863\">said</a>:</p>\n<blockquote>\n<p>The difference between what was planned and what the individual is currently taking is an important patient safety issue.  When there is a medication change and a new medication is substituted or a dose is changed (ie the plan is changed), the MedicationRequest does not get cancelled or updated.  This is particularly true when the patient is in their usual environment: at home.</p>\n</blockquote>\n<p>Yes, that is one example of what I want to achieve. <br>\nA patient is reported to be taking a PPI, 20 mg bid. This is a Statement. After seeing the physician, the physician says \"I didn't know that, but keep taking it, but now take 2 capsules = 40 mg\" - This is now a Plan. <br>\nWhat I'm after is - what is the artifact that changes? where is the common \"thing\" that started as a Statement and now is continued with a proper Plan? That is what I am calling a Treatment. Perhaps this \"treatment\" is just an ID, no more details.</p>",
        "id": 232299250,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617036792
    },
    {
        "content": "<p>There's no mechanism in FHIR that lets you convey both \"what is planned\" and \"what is happening\" with a single FHIR resource (for medications or for anything else).</p>",
        "id": 232303429,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617038437
    },
    {
        "content": "<p>actually, it's more \"what is planned for this treatment\" and \"what is happening for this treatment\" - and I'm just looking for the treatment itself. Perhaps I only have the treatment id (activityId)</p>",
        "id": 232303700,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617038547
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> see somewhat related discussion in #Medication/Status values in MedStat...</p>",
        "id": 232315159,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1617043120
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193991\">@Christof Gessner</span>  It's only partially related. <br>\nWhat I am looking for is a way to express \"this is the medication that a patient is/will be/has been taken in April\", regardless of whether we are in March, April, or in May. And something that can keep its role of \"umbrella\" summary, regardless of whether there has been a prescription and dispense meanwhile.<br>\nThe concept is somwhat similar to the IHE PCC concept 1.3.6.1.4.1.19376.1.5.3.1.3.19, - which I actually always found intrinsically ambiguous, so maybe I should just resist temptation.</p>",
        "id": 232387611,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617091064
    },
    {
        "content": "<p>Medication reconciliation is not a problem new to FHIR.  The \"what is happening\" is a reconciled medication list.  It is both what is happening and the plan until someone changes it.  It is a List of simultaneous MedicationStatements.  Representing it separately as activities seems redundant.</p>",
        "id": 232411403,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1617104706
    },
    {
        "content": "<p>could be a reconciled list, but also a list as input for reconciliation. Besides that, <span class=\"user-mention\" data-user-id=\"191487\">@Russell Leftwich</span> it is what we have in IHE PCC, and according to me, it maps to MedicationStatements; but I am not sure I have the correct understanding.</p>",
        "id": 232442843,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617117225
    },
    {
        "content": "<p>MedicationUsage has as scope:</p>\n<ul>\n<li>the recording of an intake medication list upon admission to hospital</li>\n<li>the summarization of a patient's \"active medications\" in a patient profile</li>\n</ul>",
        "id": 232442926,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617117247
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 232850858,
        "sender_full_name": "Stephen Chu",
        "timestamp": 1617329108
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20overview/near/232442843\">said</a>:</p>\n<blockquote>\n<p>could be a reconciled list, but also a list as input for reconciliation. Besides that, <span class=\"user-mention silent\" data-user-id=\"191487\">Russell Leftwich</span> it is what we have in IHE PCC, and according to me, it maps to MedicationStatements; but I am not sure I have the correct understanding.</p>\n</blockquote>\n<p>Stephen Chu1:05 PM<br>\n@Jose Costa Teixeira the medication review and reconciliation process happens when the patient is admitted to the hospital, before the patient is discharged, and also periodically within the community/primary care settings (for patients with chronic conditions). The inputs to the process includes: any known medication lists (which may have been previously reconciled or unreconciled). The output will be a single reconciled medication list.</p>",
        "id": 232851093,
        "sender_full_name": "Stephen Chu",
        "timestamp": 1617329319
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20overview/near/232442926\">said</a>:</p>\n<blockquote>\n<p>MedicationUsage has as scope:</p>\n<ul>\n<li>the recording of an intake medication list upon admission to hospital</li>\n<li>the summarization of a patient's \"active medications\" in a patient profile</li>\n</ul>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>   As for the scope of the MedicationUsage: Bullet point 1 - need to include \"at discharge from the hospital\". Bullet point 2 - the concept of \"active medication\" is problematic. This concept can lead to exclusion of discontinued medication where the washout period of a medication (e.g. many psychotropic medications) is still in effect. So it will be useful (and clinically safer) to replace it with \"relevant medication\" in a patient's profile</p>",
        "id": 232851213,
        "sender_full_name": "Stephen Chu",
        "timestamp": 1617329457
    },
    {
        "content": "<p>Yes, and that is exactly the discussion I am trying to avoid. I want one vehicle for medication summary, whether it is active, recent, relevant,...</p>",
        "id": 232873696,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617351458
    },
    {
        "content": "<p>So my doubt point is:<br>\nThe MedUsage resource says that it can be used as a line in a patient's medication summary. But I understand that \"summary\" may include things that are past, ongoing or planned.</p>",
        "id": 232897419,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617369432
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> : I'm working with Regimen and I think the Regimen can be presented by PlanDefinition resource, is that true ?</p>",
        "id": 233157601,
        "sender_full_name": "Jame Dang",
        "timestamp": 1617618894
    },
    {
        "content": "<p>PlanDefinition can represent treatment protocols that are not for any specific patient.</p>",
        "id": 233157764,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617619081
    },
    {
        "content": "<p>In the medication overview, I am interested in the patient's plans.</p>",
        "id": 233157824,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617619118
    },
    {
        "content": "<p>Yes. So I think the PlanDefinition is most suitable for the Regimen because that is general guide for treatment, not using for specific patient</p>",
        "id": 233157865,
        "sender_full_name": "Jame Dang",
        "timestamp": 1617619201
    },
    {
        "content": "<p>For example : we can have the regimen using for treatment of  Chronic decease like diabetes</p>",
        "id": 233157994,
        "sender_full_name": "Jame Dang",
        "timestamp": 1617619318
    },
    {
        "content": "<p>The careplan is used for each patient, I think that</p>",
        "id": 233158055,
        "sender_full_name": "Jame Dang",
        "timestamp": 1617619352
    },
    {
        "content": "<p>I'm sorry maybe I'm in wrong topic? Is there any topic about the PlanDefinition?</p>",
        "id": 233158092,
        "sender_full_name": "Jame Dang",
        "timestamp": 1617619417
    },
    {
        "content": "<p>Now there is :) (a topic for that)</p>",
        "id": 233160331,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617621281
    },
    {
        "content": "<p>What I am looking for is a way to say \"this treatment line is for amlodipine every day\" (independently that is starting with a plan, a prescription, or a statement by the patient - we never know what comes first)</p>",
        "id": 233160476,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617621398
    },
    {
        "content": "<p>If you want to convey both \"what's happening\" as well as \"what's supposed to be happening\", you need two resources.  That's true for medications, observations, procedures, and anything else in FHIR.</p>",
        "id": 233192564,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617638600
    },
    {
        "content": "<p>so, in the medicationusage scope <a href=\"http://build.fhir.org/medicationusage.html#scope\">http://build.fhir.org/medicationusage.html#scope</a> , <br>\nthe sentence \"the summarization of a patient's \"active medications\" in a patient profile\" should be clarified to express it is only past medications?</p>",
        "id": 233227240,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617655829
    },
    {
        "content": "<p>or that this includes past and ongoing, but never future?</p>",
        "id": 233227309,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617655871
    },
    {
        "content": "<p>and from the moment that something goes from \"planned\" to \"ongoing\", the user interface needs to look at the other esource?</p>",
        "id": 233227505,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617655978
    },
    {
        "content": "<p>(I think I could handle that, but it does deviate from my understanding of the Swiss implementation which is our reference, and it is in production, I believe)</p>",
        "id": 233227591,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617656034
    },
    {
        "content": "<p>(note that this discsusion is to see if there is a common base to do these things. I expect this to be an IHE profile. At this moment I imagine at least 2 ways to address the issue, so I want to be sure there's some alignment before I take either)</p>",
        "id": 233227801,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617656138
    },
    {
        "content": "<p>There is a Vulcan connectathon track looking at Real World Data and they have chosen to look at concurrent medication as a key problem to resolve.  This means taking medication data from the EHR (potentially several different EHRs) and reconciling it all together into a single  source of \"truth\".  In practice the \"truth\" will be a reflection of a judgement call performed by a process of some sort - this might be purely algorithmic, or it may be a human mediated interpretation.   Either way the input to this process is a mess of Medication Requests, Dispenses, Administrations and Statements - the output should be a set of Medication Statements since they are effectively assertions about what the process believes the patient has received. </p>\n<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  this isn't exactly the same as the problem you are looking at, but it has some obvious parallels.</p>",
        "id": 233302961,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1617708729
    },
    {
        "content": "<p>Right. This thread is about the output being a set of Medication Statements - is that also true when the patient says \"i'm planned to do this, maybe someday i'll do it\" or when the physician says \"this patient is /may be advised to start that medication before they turn 12\" ?</p>",
        "id": 233311565,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617713156
    },
    {
        "content": "<p>In both those cases there is some suggestion that a medication may be taken.  If that medication is Aspirin or Chloramphenecol Eye Drops a clinician would probably ignore it, but if it were Methotrexate they would be very interested because it has lifetime effects.  It is the interpretation that matters and the interpretation could be expressed as a medication statement.  Who makes the statement is important.  I think this is the same for your attempt to thread together a series of medication related resources in a care plan,</p>",
        "id": 233326767,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1617718890
    },
    {
        "content": "<p>This should be agnostic of clinical interpretations. My understanding of the discussion in this thread is that the use of medStatement is not consensual</p>",
        "id": 233401534,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617748613
    },
    {
        "content": "<p>I.e. we'd only use the statement for past meds</p>",
        "id": 233401576,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617748644
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20overview/near/233401534\">said</a>:</p>\n<blockquote>\n<p>This should be agnostic of clinical interpretations. My understanding of the discussion in this thread is that the use of medStatement is not consensual</p>\n</blockquote>\n<p>I'd look at this another way. We should be examining as many of the use cases for Medication Statements as possible, not taking a 'one size fits all' approach.</p>",
        "id": 233404779,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1617750464
    },
    {
        "content": "<p>Maybe off-topic, but from the work on vaccination I learned about ImmunizationEvaluation and ImmunizationRecommendation resources: Looking retrospectively on a set of \"Administrations\", then suggesting a next \"Request\". Maybe something to apply to Medications (towards re-adjustment of a \"plan\"?)</p>",
        "id": 233405722,
        "sender_full_name": "Christof Gessner",
        "timestamp": 1617751034
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191364\">Peter Jordan</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20overview/near/233404779\">said</a>:</p>\n<blockquote>\n<p>I'd look at this another way. We should be examining as many of the use cases for Medication Statements as possible, not taking a 'one size fits all' approach.</p>\n</blockquote>\n<p>I don't understand. I'm starting with the assumption that there are many - too many - \"use cases\" for medication list. <br>\nSo I think we need to remove the \"what the physician wants to see\" and \"what the physician wants to include\" because those are not things we can standardize in a given system, let alone in an international standard</p>",
        "id": 233437450,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617776542
    },
    {
        "content": "<p>so it's not a \"one shoe size fits all\" but more \"shoe factory, because people have different feet size and preferences and environments and habits and....\"</p>",
        "id": 233437633,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617776669
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"193991\">Christof Gessner</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20overview/near/233405722\">said</a>:</p>\n<blockquote>\n<p>Maybe off-topic, but from the work on vaccination I learned about ImmunizationEvaluation and ImmunizationRecommendation resources: Looking retrospectively on a set of \"Administrations\", then suggesting a next \"Request\". Maybe something to apply to Medications (towards re-adjustment of a \"plan\"?)</p>\n</blockquote>\n<p>Yes. The one point that I'm looking for here is the use of a MedicationStatement as a common summary of this: when we increase the dose of a treatment (the notion of \"treatment\" does not exist in FHIR), where do you capture this in a summary form? I'd prefer the answer to be \"in a MedStatement\", rather than \"it depends on whether the medication  is still planned or presumed ongoing/past\"</p>",
        "id": 233437905,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617776886
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> The Pharmacy Work Group has a project under way to develop guidance for Medication Lists - we don't believe there is a single approach to creating a medication list.  You have to consider the context of use and it might involve multiple resources and not just a single resource.</p>",
        "id": 233491218,
        "sender_full_name": "Melva Peters",
        "timestamp": 1617803654
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> I want to use the resources as they are in the guidance so far. The sentence \"the summarization of a patient's \"active medications\" that is in the medicationUsage scope - is that sentence correct? Does it apply to a specific definition of active? Does it overlap with other resources?</p>",
        "id": 233511699,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617809660
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>  - yes, there are many contexts of use, from both provider and consumer perspectives.  Some require transactional views, others summaries and current state views. <br>\n<span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  IMO, excluding specific requirements because they cannot be standardized is the wrong approach. The solution has to be sufficiently flexible to cater for what a clinician 'wants to see' or 'wants to include',  in ALL countries, otherwise it will not be fit for purpose.</p>",
        "id": 233557483,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1617828008
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> that is not the way I mean it.</p>",
        "id": 233557594,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617828064
    },
    {
        "content": "<p>What I mean is: here's a power plug. it doesn't matter - if you are using it for a toaster or a heater or a fan. There have been too many discussions about whether it is better to plug a fan or a toaster. What I say is that such a discussions is only useful to determine the boundaries.</p>",
        "id": 233557972,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617828234
    },
    {
        "content": "<p>And 10 years ago we started a discussion that designing a power plug just for lamps or fans is silly</p>",
        "id": 233558156,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617828302
    },
    {
        "content": "<p>I had a smaller question and it still remains open. (I'm used to this discussion spreading quickly so I need to keep focus)</p>",
        "id": 233558395,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617828386
    },
    {
        "content": "<p>For reference, I am trying to do something along the lines of IHE's PML profile but better</p>",
        "id": 233558473,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617828425
    },
    {
        "content": "<p>When talking about 'active' medications, there are two different meanings for active - what is the patient <em>supposed</em> to be on (represented with MedicationRequest) and what is the patient actually <em>taking</em> (represented using MedicationStatement/MedicationUsage).  If you've got a well-defined definition of what you want for 'active', then you can get away with one resource or the other.  If you need both perspectives, you'll have to use both resources.</p>",
        "id": 233591408,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617847693
    },
    {
        "content": "<p>Agreed <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> . In practice, particularly for community provider systems, it's far easier to determine the status of a request than the usage. In many cases, a MedicationStatement.status will be Unknown (\"The state of the medication use is not currently known.\") as, without direct evidence or consumer input, it's not safe to assume that any given medication is being taken or taken in accordance with instructions.</p>",
        "id": 233596855,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1617852993
    },
    {
        "content": "<p>There are more definitions for active. <br>\nAs there are more definitions of \"a medication\" - is Paracetamol tablets and Paracetamol effervescent tablets one medication...? That variance is why I need to have a \"treatment summary\".</p>",
        "id": 233607305,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617863145
    },
    {
        "content": "<p>If patient is prescribed Paracetamol 1g tabs  but changes to 1 g effervescent tabs (or other change), it may be considered still as the same treatment. To transmit that treatment, it doesn't matter whether the patient has started taking the meds or not.</p>",
        "id": 233607473,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617863298
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> the purpose is not trying to standardize what is not possible to standardize, because indeed this needs to be valid for all countries for all use cases. This is why I leave the \"definition of what is active\" to the side - there will never be a cosnensus there. What we have to do is a mechanism that allows us to support those variants.</p>",
        "id": 233607648,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617863471
    },
    {
        "content": "<p>I think i will just follow the swiss who have thought this well and implemented this, and use MedStatement for the interpreted summary of a mediction treatment (planned, planned and presumed started, or just started). The actual truth will be in the medication details (prescription, plan, dispense, admins etc)</p>",
        "id": 233607766,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1617863587
    },
    {
        "content": "<p>Take a look at the planned changes to MedicationUsage - concepts like \"stopped\", \"on hold\", etc. have all been dropped from MedicationUsage.  It essentially just captures \"taking\" and \"not-taking\" (with some qualifiers for whether or not they're taking as directed or not).  If you choose the MedicationStatement path, be sure that you're comfortable with that as an eventual direction.</p>",
        "id": 233666592,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617893732
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20overview/near/233666592\">said</a>:</p>\n<blockquote>\n<p>If you choose the MedicationStatement path, be sure that you're comfortable with that as an eventual direction.</p>\n</blockquote>\n<p>Hmm. For those of us implementing IPS, that is the only path and if the ONC/GDHP target of 20 national implementations of IPS by the end of 2022 is met...</p>",
        "id": 233740655,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1617920983
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191759\">Melva Peters</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20overview/near/233491218\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191364\">Peter Jordan</span> The Pharmacy Work Group has a project under way to develop guidance for Medication Lists - we don't believe there is a single approach to creating a medication list.  You have to consider the context of use and it might involve multiple resources and not just a single resource.</p>\n</blockquote>\n<p>We're looking for guidance on medication lists. Our use case is the list of medications a patient is taking on admission to a hospital and on discharge. Currently we're using the List resource with code <code>medications</code> from <a href=\"http://terminology.hl7.org/CodeSystem/list-example-use-codes\">http://terminology.hl7.org/CodeSystem/list-example-use-codes</a> but the 'on admission' and 'on discharge' qualifiers are missing. Has anyone done something similar?</p>",
        "id": 261147970,
        "sender_full_name": "Julian Sass",
        "timestamp": 1636644770
    },
    {
        "content": "<p>I'm not sure about List. The list of medications retains authorship, consistency, context - so better a Composition</p>",
        "id": 261172761,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1636657425
    },
    {
        "content": "<p>We're half way to document a rather comprehensive Medication Record - it's rather big because, well, this problem is never simple.</p>",
        "id": 261172920,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1636657529
    },
    {
        "content": "<p>But if you can scope it down and you're just after the Composition/List of MedStatements in admission and discharge, you can make your own codes.  I don't think the code medications is supposed to be precise enough.</p>",
        "id": 261173574,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1636657931
    },
    {
        "content": "<p>there might be variations on the definition of \"meds patient is taking on admission\" , in which case your code will be only your code.</p>",
        "id": 261173843,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1636658069
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20overview/near/261172761\">said</a>:</p>\n<blockquote>\n<p>I'm not sure about List. The list of medications retains authorship, consistency, context - so better a Composition</p>\n</blockquote>\n<p>That's right. But you could organize medications in a List and have that List inside a Composition.</p>\n<blockquote>\n<p>But if you can scope it down and you're just after the Composition/List of MedStatements in admission and discharge, you can make your own codes. I don't think the code medications is supposed to be precise enough.</p>\n</blockquote>\n<p>Yes, will probably do this to add that extra bit of information.</p>",
        "id": 261228462,
        "sender_full_name": "Julian Sass",
        "timestamp": 1636708986
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I don't understand that statement.  A list of meds on admission is definitely intended to be handled by List with no need for Composition at all.  Lists also have authorship and consistency and context.  Composition seems way too heavy to use in this circumstance.</p>",
        "id": 261462079,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1636957912
    }
]