[
    {
        "content": "<p>I don't see any references to the RxNORM medication coding system in the FHIR docs (so far). I see a lot of SNOMED-CT  which costs licensing fees. Being completely new to medications and looking for a reasonable solution for remote patient monitoring medication devices I am trying to find a good way to code medication types. RxNORM appears to cover the bases (not really sure) and also appears free (also not really sure). Would be very happy for anyone with expertise in this area to chime in!!</p>",
        "id": 154007295,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1539166851
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192228\">@Brian Reinhold</span> The FHIR specifications are intended to be universally applicable and many jurisdictions have their own local terminology requirements so it will often appear that the FHIR specifications are loose, many optional or infinite cardinalities, and not being specific with respect to terminology or using your terminology.<br>\nProfiles of FHIR resources are created to tighten the cardinalities, add extensions to accommodate for additional information requirements and specific terminology bindings are provided.<br>\nMembers of the Pharmacy Work Group can assist you with general and specific questions regarding their resources and you may wish to join their conference calls, see <a href=\"http://hl7.org/events\" target=\"_blank\" title=\"http://hl7.org/events\">hl7.org/events</a>, to participate in that community.</p>",
        "id": 154007296,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1539167281
    },
    {
        "content": "<p>I actually wanted to post a message to the pharmacy workgroup but clicking on the link just spun forever and I got impatient and posted the question here. I guess what I am looking for is a coding system that is fairly complete and simple. The RxNORM appears to be digits and not strings which is efficient for limited resource binary transmissions by Personal Health Devices.</p>",
        "id": 154007299,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1539167741
    },
    {
        "content": "<p>I suggest you try reaching out to the co-chairs directly, you can find them under resources/work groups on the hl7 site, or attend a call to pose your questions as I expect they will need some back and forth to better understand your specific use case. For example, are you looking to exchange only the active ingredient (Ibuprofen) or a code for a packaged/manufactured product (Tylenol 200 mg gel caps ) or a code for the class of product (NSAID) or the action (analgesic)?</p>",
        "id": 154007302,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1539168127
    },
    {
        "content": "<p>there's plenty of RxNorm examples in the medications</p>",
        "id": 154007307,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1539170904
    },
    {
        "content": "<p>Pharmacy includes RxNorm in the examples as well as other codes like SNOMED CT and Health Canada DIN.  SNOMED CT is exemplar as it is expected that our material is universal and therefore isn't bound to a realm specific codesystem like RxNorm.</p>",
        "id": 154007357,
        "sender_full_name": "Melva Peters",
        "timestamp": 1539177117
    },
    {
        "content": "<p>Some examples using RxNorm:<br>\n(US Core) <a href=\"https://simplifier.net/us-core/substance-rxnorm\" target=\"_blank\" title=\"https://simplifier.net/us-core/substance-rxnorm\">https://simplifier.net/us-core/substance-rxnorm</a><br>\n(NCCN) <a href=\"https://simplifier.net/nccnchemotherapyorde/rxnorm-ingredients\" target=\"_blank\" title=\"https://simplifier.net/nccnchemotherapyorde/rxnorm-ingredients\">https://simplifier.net/nccnchemotherapyorde/rxnorm-ingredients</a></p>",
        "id": 154007374,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1539180320
    }
]