[
    {
        "content": "<p>The MedicinalProdcuts-range of resources is developed primarlily for regulatory purposes based on IDMP. We have a project that should expose a drug dictionary (the official national one) from the regulatory authorities to the sector, and we have had a discussion on what series of resources that would be the best for interfacing with the sector. The proposal from the project is to use MedicinalProducts as they want to expose much more information than what is described in Medication, but are described as in the MedicinalProducts-resources. To profile/ make necessary extensions on Medication will also be a challenge with regards to the project's timeline. The short-term delivery is also towards a use-case for keeping a full copy of the drug catalog in clinical systems like EHR or charting.   Any opinions on this? Can we anyway link these by using same IDs or something? Can we end up having clinical systems needing to implement support for both Medication and MedincinalProduct resources?</p>",
        "id": 202961284,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594021616
    },
    {
        "content": "<p>Did you look at MedicationKnowledge?</p>",
        "id": 202964491,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594024148
    },
    {
        "content": "<p>That is the one I would use now. Medication would require a ton of extensions, MedicinalProduct stuff only supports IDMP concepts (which is good for regulatory submission, but for clinical purposes, reality is that you mostly need to define non-idmp concepts)</p>",
        "id": 202964606,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594024249
    },
    {
        "content": "<p>Thanks for the tip, will look into that one. Ref paralelll discussion on slicing of Medication.code thread, we are also trying to bring IDMP with us into clinical use in order to secure as easy as possible exchange between regulatory and clinical sector. Our suggestion for now is for example to slice Medication.code according to the IDMP-levels.  What are the main obstacles as you see it for using idmp for clinincal?</p>",
        "id": 202965339,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594024852
    },
    {
        "content": "<p>hmm, the other discussion is for patient summary, which I think is not as demanding in terms of identification.. for prescribing and especially for catalogs, I expect you'd need more attributes (not just a hierarchy of codes)</p>",
        "id": 202965975,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594025399
    },
    {
        "content": "<p>what I would expect to have is a graph of connected MedicationKnowledge resources.</p>",
        "id": 202966179,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594025523
    },
    {
        "content": "<p>i.e. a set of medication definitional resources, for each concept/\"level\": <br>\nfor example one resource instance for these:</p>\n<ul>\n<li>paracetamol</li>\n<li>paracetamol 500 mg</li>\n<li>paracetamol 500 mg box of 20 tablets</li>\n<li>paracetamol DAFALGAN 500 mg tablets</li>\n<li>paracetamol DAFALGAN 500 mg box of 20 tablets</li>\n</ul>",
        "id": 202966362,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594025669
    },
    {
        "content": "<p>this is supported by MedKnowledge</p>",
        "id": 202966376,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594025682
    },
    {
        "content": "<p>the thing that is needed IMO is the graphing - the link between these entries. <br>\nMedicationKnowledge offers a \"relatedMedicationKnowledge\" but that does not allow to explicit the attributes of the relation<br>\nIn a catalog, we would have CatalogEntry to do that purpose<br>\n<a href=\"http://build.fhir.org/ig/HL7/fhir-order-catalog/branches/master/drugs.html\">http://build.fhir.org/ig/HL7/fhir-order-catalog/branches/master/drugs.html</a></p>",
        "id": 202966595,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594025861
    },
    {
        "content": "<p>but CatalogEntry is not really popular (may be yanked)</p>",
        "id": 202966664,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594025918
    },
    {
        "content": "<p>Just for the fun of it, not that you asked:</p>",
        "id": 202967212,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594026386
    },
    {
        "content": "<p>In prescription this gets a bit more interesting, where you have to specify identifiers AND additional attributes to identify a medicinal product (in the example above, one jurisdiction may not have a code for \"paracetamol 500 mg box of 20 tablets\" but you don't want to put a PhPID because you are saying \"give any box size\"</p>",
        "id": 202967416,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594026549
    },
    {
        "content": "<p>(sorry for that last part, got carried away... <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span> )</p>",
        "id": 202969720,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594028398
    },
    {
        "content": "<p>Thanks Jose, this is good info that I will pass on to the project. You also adress a topic that we are working on with regards to how differ between all the different contexts of FHIR-resources, and how to best secure interoperability at the national level between these use-cases. As you mention, there will be different requirements for patient summary, prescription, publishing of drug catalogue - but it is still an advantage that the same information in different context are not expressed in wildly different manners.  We are working on establishing a framework that will adress the need for such coordination.</p>",
        "id": 202977534,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594034973
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> hi the use case you describe is exactly what the Medication Definition resources (MedicinalProduct*, in R4) are for.</p>",
        "id": 202980668,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594037577
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> I thought those were very much IDMP-bound, perhaps I missed it</p>",
        "id": 202980938,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594037776
    },
    {
        "content": "<p>for example MedicinalProductDefinition does resemble IDMP's MP quite a lot</p>",
        "id": 202981095,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594037918
    },
    {
        "content": "<p>The scope is in no way limited to IDMP.</p>",
        "id": 202981260,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594038050
    },
    {
        "content": "<p>Back in the time, I was really hoping we'd have a definitional resource that would support the different levels of IDMP other concepts of medicinal product, but I failed to pass that message, so I kept assuming that these are really IDMP and therefore I don't worry with the overlap between these and MedicationKnowledge</p>",
        "id": 202981265,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594038054
    },
    {
        "content": "<p>I'm not an expert in this area, but AFAIK the whole idea behind the European <a href=\"https://unicom-project.eu/\">https://unicom-project.eu/</a> initiative is to allow for re-use of any national / EU regulatory information in a clinical setting, exactly as Oyvind pointed out.</p>",
        "id": 202981297,
        "sender_full_name": "René Spronk",
        "timestamp": 1594038095
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> yes, that is where I come from. Unicom is (among other things  a successor to the openMedicine project - which was the reason why in 2016 we started discussing medicinal product definition resources.</p>",
        "id": 202981481,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594038225
    },
    {
        "content": "<p>Yes. Any time you need full definitions of a medication, which goes beyond the very small amount that is typically needed for day to day prescribing, then you can use the Medication Definition resources (in R5 called MedicinalProductDefinition, and others). The use case can be drug catalogue/formulary, or regulatory, or anything where detailed drug information is needed.</p>",
        "id": 202981595,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594038303
    },
    {
        "content": "<p>where does that leave MedKnowledge?</p>",
        "id": 202981619,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594038320
    },
    {
        "content": "<p>MedicationKnowledge is for more general information about the use of a drug. Pricing etc, that is not (so) definitional.</p>",
        "id": 202981666,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594038351
    },
    {
        "content": "<p>ah that discussion... I still find that very unclear</p>",
        "id": 202981733,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594038377
    },
    {
        "content": "<p>well you can keep asking for clarification :-)</p>",
        "id": 202981793,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594038436
    },
    {
        "content": "<p>I guess that either the clarification will get better, or the resource will be dropped.</p>",
        "id": 202981923,
        "sender_full_name": "René Spronk",
        "timestamp": 1594038502
    },
    {
        "content": "<p>just to scope UNICOM - it has 2 groups of interoperabilty needs (in what concerns me)</p>\n<ol>\n<li>transactional data in clinical documents (summaries, prescription,..)</li>\n<li>Master Product Data - formulary - in that, my requirements would be: <br>\n2.1 - product characteristics (identifiers, attributes)<br>\n2.2 - relations (Dafalgan 500 is a brand name for Paracetamol 500 mg)</li>\n</ol>",
        "id": 202981994,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594038567
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> I have been in contact with the SAFEST guys about using the medication definition resources and those requirements are shaping the change requests etc for them. So those use cases will be in scope for sure.</p>",
        "id": 202982012,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594038581
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  prescriptions normally can just use Medication, because you mostly only need a drug code, sometimes a little more. MPD data is the Medication Definition resources. They support all those types of characteristics and relations (virtual to actual, moiety to product, investigational to authorised etc).</p>",
        "id": 202982471,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594038852
    },
    {
        "content": "<p>i did suggest one example that includes all of these types and medknowledge. that would help me to understand. <br>\nAbout what we need in a prescription, yes, that was documented in openMedicine.</p>",
        "id": 202982796,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594039131
    },
    {
        "content": "<p>Do you mean you want an example instance?</p>",
        "id": 202982851,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594039178
    },
    {
        "content": "<p>yes, one or several of each, connected in a nice use case</p>",
        "id": 202982894,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594039198
    },
    {
        "content": "<p>(would be quite neat)</p>",
        "id": 202982965,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594039213
    },
    {
        "content": "<p>The use cases are somewhat separate, and the links would normally be by the drug code. I have detailed medication definition examples, but they  don't have (or need) Medication resources. So the examples may not illustrate what you are looking to understand. You can watch my DevDays  2019 presentation on it perhaps.</p>",
        "id": 202983144,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594039339
    },
    {
        "content": "<p>and we have to make it clear that the solution works across the spectrum regulator - MPD producer - clinical systems - PH monitoring. <br>\nThat I haven't obviously seen. <br>\nWhat I have seen since proposing the notion of fhir resources for formularies is either \"that's a regulatory thing\" or \"that is a EHR thing\". (maybe I will bring up some ideas to work on data governance for master product data)</p>",
        "id": 202983148,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594039341
    },
    {
        "content": "<p>yes, i mean one or several examples connected by a story line.</p>",
        "id": 202983184,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594039385
    },
    {
        "content": "<p>we have the resources, and now it is our job to make it clear what you can do with them</p>",
        "id": 202983205,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594039406
    },
    {
        "content": "<p>Since you are here though, the easiest thing is just to learn it from here. It can be explained in words :-) Examples take a little longer, but if you have the idea, then you can help spread the word.</p>",
        "id": 202983336,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594039489
    },
    {
        "content": "<p>I suppose the bottom line is not the use case but the level of detail. If you need the detail you need the Medication Definition, whatever the use case.</p>",
        "id": 202983492,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594039577
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20vs.20MedicinalProduct/near/202983492\">said</a>:</p>\n<blockquote>\n<p>If you need the detail you need the Medication Definition, whatever the use case.</p>\n</blockquote>\n<p>I think MedKnowledge does cover this by having a \"drugCharacteristic\" - so I can put anything there</p>",
        "id": 202983954,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594039849
    },
    {
        "content": "<p>For explaining (I think it's Design Validation really) I mean one example where we force ourselves to instanciate the resources, and see whether which resources make more or less sense, and which of them support edge cases or add complication.</p>",
        "id": 202984153,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1594039973
    },
    {
        "content": "<p>I have such examples, mapping a full national drug catalogue to FHIR. I will have to see if the project wants to make them public. But it did validate the design and resulted in some of the more recent Jiras, affecting both the Medication Definition resources and MedicationKnowledge.</p>",
        "id": 202985491,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1594040689
    }
]