[
    {
        "content": "<p>Hi. From another implementer I have a question and wanted to revisit this: in some cases, it is not that clear when to use medicationStatement or medicationAdministration. Think a patient reporting a single medication event of taking medication. To me this is clear (administration), but perhaps others  disagree. Also, there is a matter of how to report a statement of dispense, or statement of prescription. as \"I was prescribed some medication some years ago but never took it\". There is no prescription, so I am just stating a medicationRequest.</p>",
        "id": 153891525,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1496082299
    },
    {
        "content": "<p>Should we a) clarify documentation, and b) handle the \"statement of prescription\"? Personally, I would handle it very easily with an extension, but the fact that there are different interpretations on something very common may deserve some attention for documentation.</p>",
        "id": 153891526,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1496082393
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> </p>",
        "id": 153891530,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496084709
    },
    {
        "content": "<p>If the patient is reporting the administration at the time of the administration, then I think it is clear that the MedicationAdministration should be used.  The MedicationStatement is intended to be used to report the use of medication (or non use) at some point in the future.  For example, during medication reconciliation or history taking, a patient could tell you he is taking an OTC or a prescription drug.  These would be recorded as MedicationStatements.  You can record it as non-use.  I was prescribed this drug, but never took it or I've never taken or I was taking, but not taking now.  The examples in the MedicationStatement try to cover off the scenarios for MedicationStatement.  I haven't heard the use case for a statement about a MedicationDispense.  I would assume if there was a dispense then there is a request - so it would be a statement about the request more than the dispense.  I don't believe an extension is needed.  The MedicationStatement already covers off the statement that they have never taken - it could be I was prescribed x drug and may take in the future or I was prescribed, took it in the past but not taking it now or I never took.  <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I would suggest you add a tracker item if you believe additional documentation is needed.</p>",
        "id": 153891532,
        "sender_full_name": "Melva Peters",
        "timestamp": 1496086658
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> . some interpretation: \"The MedicationStatement is intended to be used to report the use of medication (or non use) at some point in the future. \" - i actually think the foremost case of medicationStatement will be the use in the past (\"i took this medication for 2 years, then it harmed my liver and I stopped\")</p>",
        "id": 153891534,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1496086862
    },
    {
        "content": "<p>the case of dispense is a bit more complex: I can should have said that I want to report \" i was prescribed this medication AND it was dispensed to me but i did not take it\". This is somewhat different from simply saying \"i did not take this medication\", in that i am also stating that some physician said I was supposed to take it. Just saying I did not take a medication is not common unless I am asked for each specific medication.</p>",
        "id": 153891535,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1496086971
    },
    {
        "content": "<p>Agree <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> , sorry I should have said the primary use case is to record the use (or non-use) of medication.  It may be in the past, current or in the future or even never taken.  I think the primary use case for this resource is as part of pulling together a list of the patient's medications as part of history taking or reconciliation.</p>",
        "id": 153891536,
        "sender_full_name": "Melva Peters",
        "timestamp": 1496087010
    },
    {
        "content": "<p>i will see how the statement supports this you said: I was prescribed x drug and may take in the future or I was prescribed, took it in the past but not taking it now or I never took</p>",
        "id": 153891537,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1496087028
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> You can reference a MedicationDispense using the partOf attribute.  Maybe that covers off the use case for \"and it was dispensed.</p>",
        "id": 153891538,
        "sender_full_name": "Melva Peters",
        "timestamp": 1496087104
    },
    {
        "content": "<p>fyi, the request from the implementer was \"why do we need administration and statement and not converge?\" - i explained, but if there is some doubt from a vendor,  i wanted to bring this information into the discussion</p>",
        "id": 153891539,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1496087107
    },
    {
        "content": "<p>hmm.. i would not see PartOf as supporting that. Maybe i'm wrong but if I have a hospitalization (encounter1) and while in there i explain this case (statement1, pointing to an old, verbally stated dispense1), it seems that the partOf would be the encounter.</p>",
        "id": 153891540,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1496087264
    },
    {
        "content": "<p>a lot of vendors have implemented MedStatement but not MedAdmin or Med Dispense so the implmenter is not alone in their perspective.</p>",
        "id": 153891657,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496164283
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I'm guessing that's not because the others aren't useful, they weren't required for CCDS and were lower priority (at least for us) for most app develeopers trying to integrate with us</p>",
        "id": 153891661,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1496166354
    },
    {
        "content": "<p>We (Cerner) are implmenenting Dispense and Admin, it's just lower priority based on demand, as an example. We also implemented Order, which has some of the largest overlap with Statement</p>",
        "id": 153891662,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1496166406
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> I agree, the medication statement was not intended originally to be used to record content as Jose suggests.  It was to record statements of medication use as part of history taking.  We should not be suggesting to any implementer that Medication Statement be used instead of the other resources where those other resources are the most appropriate (ie to record the actual medication request, dispense or administration).</p>",
        "id": 153891690,
        "sender_full_name": "Melva Peters",
        "timestamp": 1496172356
    }
]