[
    {
        "content": "<p>In native English speakers-language, is there an agreed / preferred vocabulary? My understanding is smth like Medicine is the product as it exists in the wild (read:pre-market, regulatory, supply - anything not in the scope of a treatment), while medication is the treatment or the drug used in that treatment for a patient. I can't express it better but basically FDA/EMA talk about medicines, while patients have medicationRequests. before any potential impact analysis, i ask: Is this something commonly used? Or is it one of the subtleties of latin languages?</p>",
        "id": 153912137,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507061777
    },
    {
        "content": "<p>Generally I think of <em>medication</em> as the action of giving <em>medicine</em> (drug). But <em>medicine</em> can mean <em>drug</em> or <em>what doctors do</em>. So some people use <em>medication</em> for <em>drug</em>, so as to save <em>medicine</em> for <em>what doctors do</em>.<br>\nI'm not a clinician.</p>",
        "id": 153912206,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1507084555
    },
    {
        "content": "<p>the European regulator is called \"Medicines\" agency and I wondered if this is getting a common distinction</p>",
        "id": 153912243,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507117928
    },
    {
        "content": "<p>As a pharmacist, I use \"Medication\" and not \"medicine\".  Medication can refer to both a branded product or a generic product and can refer to it in generic terms or as part of a specific treatment for a patient.  In my experience in Canada, I don't hear medicine used in clinical terms - more from lay people when they take in general  terms about \"taking their medicine\".</p>",
        "id": 153912653,
        "sender_full_name": "Melva Peters",
        "timestamp": 1507219079
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> . That was my impression until I caught up with some discussions with the EMA and how this vocabulary clarification is becoming present in discussions</p>",
        "id": 153912678,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1507230850
    }
]