[
    {
        "content": "<p>Hi All, While trying to model for Medication resource. We are looking for appropriate place to put Drug Classification.<br>\nAs there is no category/class kid of property on Medication, has some one come up with some extension for same.</p>",
        "id": 208675717,
        "sender_full_name": "Shubham Sharma",
        "timestamp": 1598960897
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span></p>",
        "id": 208706338,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598974986
    },
    {
        "content": "<p>There is an attribute on MedicationKnowledge and not on Medication.  Can you please explain your use case?  We kept medication pretty simple for the purposes of prescribing, dispensing, administering of medications.</p>",
        "id": 208706606,
        "sender_full_name": "Melva Peters",
        "timestamp": 1598975100
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> , Use case is mapping prescription / current medications using MedicationRequest / MedicationStatement resource. There we need give some  classification/categorization of medication like it is analgesic  or it is an chemotherapy agent or it is controlled drug some  thing like those to give a general intimation on  a medicine.</p>",
        "id": 208834488,
        "sender_full_name": "Shubham Sharma",
        "timestamp": 1599057833
    },
    {
        "content": "<p>There is a category attribute on MedicationRequest, MedicationUsage, MedicationDispense and MedicationAdministration that can be used to categorize the type of each of the resource instances.  I'm not sure if you currently have this information on your prescriptions and other records or not.</p>",
        "id": 208835151,
        "sender_full_name": "Melva Peters",
        "timestamp": 1599058080
    },
    {
        "content": "<p>But there can only be one category and that is used to specified inpatient|outpatient as per specification.</p>",
        "id": 208859330,
        "sender_full_name": "Shubham Sharma",
        "timestamp": 1599067784
    },
    {
        "content": "<p>In R4 MedicationRequest.category was changed to 0..*.  -- I think I had asked for this change a year or so ago and it got in! :-)</p>",
        "id": 208862617,
        "sender_full_name": "John Silva",
        "timestamp": 1599069323
    },
    {
        "content": "<p>Yes, in R4 it was changed to 0..*. The Category is intended to provide a way to provide the type of medication request or usage.  We provide an exemplar value set but it is exemplar only.  The description for the attribute in R4 says: \"Indicates the type of medication request (for example, where the medication is expected to be consumed or administered (i.e. inpatient or outpatient)).\"  This is an example only.  In the Current Build, the description has been updated to: \"Indicates the grouping or category of medication request (for example, drug classification like ATC, where meds would be administered, legal category of the medication.).\"</p>",
        "id": 208867190,
        "sender_full_name": "Melva Peters",
        "timestamp": 1599071438
    },
    {
        "content": "<p>Category of medication is not the same as category of the request / usage / administration</p>",
        "id": 208882930,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599078532
    },
    {
        "content": "<p>One may imply the other (i.e. narcotic product may imply a certain category of request). But I don't think medicationrequest.category should be the place to put classificiations like ATC or similar</p>",
        "id": 208883181,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599078646
    },
    {
        "content": "<p>We've had implementers ask for this and that's why it was changed to support multiple categories and classification is one kind.</p>",
        "id": 208885425,
        "sender_full_name": "Melva Peters",
        "timestamp": 1599079630
    },
    {
        "content": "<p>Although I personally agree with you Jose, we had multiple implementers ask for this (like Shubham does in this thread), so we bowed to the implementer community and allowed them to send it in the category.</p>",
        "id": 208885718,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1599079798
    },
    {
        "content": "<p>you mean medication category goes into request category?</p>",
        "id": 208895757,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599085254
    },
    {
        "content": "<p>if you need to add a category for the requested medication, that would be a \"medicationCategory\" attribute. We should not endorse misusing fields.</p>",
        "id": 208895921,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599085353
    },
    {
        "content": "<p>I just re-read Melva's description and I do think the clarification makes the boundary very fuzzy. It should be clear - i.e. ATC code is not a medication request category. It is a medication category.</p>",
        "id": 208897185,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1599086160
    },
    {
        "content": "<p>I don't think it's a mis-use.  The reality is that if a prescription prescribes a regulated medication, then it becomes a 'regulated' prescription, so reflecting that in MedicationRequest.category isn't an invalid use.  In some cases, the prescription might be for a complex compound, where one of the ingredients is restricted.  You don't want receivers to have to dig through the whole recipe to determine whether there are special rules around how the prescription gets handled.</p>",
        "id": 208898836,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599087331
    },
    {
        "content": "<p>Only thing i see is since attribute is more of a Medication, either we may need to replicate it on other Resources like MedicationStatement, MedicationAdministration, MedicationDispense (i  mean allowing multiple categories in these resources,, which requires change in FHIR) &lt;OR&gt; making MedicationReqeust reference available always, which seems to bit tricky specially if information is exchanged between two systems.</p>",
        "id": 208919001,
        "sender_full_name": "Shubham Sharma",
        "timestamp": 1599106407
    }
]