[
    {
        "content": "<p>We are currently discussing the right usage of M.Request vs M.Statement. The usecase is the \"german federal medication plan\". In this document all medications which are prescribed by different physicians as well as the patients self-medication shall be captured. Some of the german HL7 community have choosen a list of medicationStatements whilst other prefer MedicationRequest.</p>",
        "id": 153901480,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1502357412
    },
    {
        "content": "<p>as both ressources have the possibility to enter a Dosage and Timing technically both can be uses. Reading the scopes leads to different estimates of the readers. <br>\nArguments:<br>\n- Statement: captures all medication a patient is taking currently, prescribed or non-prescribed<br>\n- Request: suitable for prescribed medications, also self-prescribed (recorder = patient), the plan includes the dosage and timing of the medications, and is therefore a request.</p>",
        "id": 153901482,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1502357674
    },
    {
        "content": "<p>here is the paper form of this document: <a href=\"https://www.akdae.de/Arzneimitteltherapie/AVP/Artikel/201503/116-ABB-2.png\" target=\"_blank\" title=\"https://www.akdae.de/Arzneimitteltherapie/AVP/Artikel/201503/116-ABB-2.png\">https://www.akdae.de/Arzneimitteltherapie/AVP/Artikel/201503/116-ABB-2.png</a></p>\n<div class=\"message_inline_image\"><a href=\"https://www.akdae.de/Arzneimitteltherapie/AVP/Artikel/201503/116-ABB-2.png\" target=\"_blank\" title=\"https://www.akdae.de/Arzneimitteltherapie/AVP/Artikel/201503/116-ABB-2.png\"><img src=\"https://www.akdae.de/Arzneimitteltherapie/AVP/Artikel/201503/116-ABB-2.png\"></a></div>",
        "id": 153901483,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1502357710
    },
    {
        "content": "<p>Hi Patrick. The intended usage is different for Request and Statement, although there is space for interpretations to differ. And there is lots of legacy.</p>",
        "id": 153901491,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502358130
    },
    {
        "content": "<p>From the resource description alone, both are not clearly distinct, as far as we understand.<br>\nWhat we need to achieve is a consistent set of data, typically compiled by one practitioner, containing<br>\n- the medication (regular, when needed) that practitioner has prescriped<br>\n- the medication (regular, when needed) other practitioners have prescriped<br>\n- the medication (regular, when needed) the patient takes without a practitioner's prescription</p>",
        "id": 153901494,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502358603
    },
    {
        "content": "<p>Shortly:  In my opinion, your opening sentence points to the  answer:<br>\n\"In this document all medications which are prescribed by different physicians as well as the patients self-medication shall be captured. \"<br>\nSo it is not about choosing a resource, but there will be a dcoument that contains things that are prescribed (prescriptions) and summaries that are stated by the patient (Statement)</p>",
        "id": 153901495,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502358652
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> they are quite distinct in that one is a clinical request, the other is a summary (think of it as an \"observation\")</p>",
        "id": 153901496,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502358706
    },
    {
        "content": "<p>The consistent set of data doesn not need to be one or the other resource.</p>",
        "id": 153901497,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502358735
    },
    {
        "content": "<p>Yes, we put that together in a composition.</p>",
        "id": 153901498,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502358842
    },
    {
        "content": "<p>So you suggest that anything coming from a practitioner would be MedicationRequest, anything coming from the patient be a MedicationStatement?</p>",
        "id": 153901499,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502358868
    },
    {
        "content": "<p>depends.<br>\nyou can do things like \"a statement that is derifedFrom a prescription\".<br>\nSo if the physician is just doing the compilation, yes, statement seems better (i have limited insight into what you are looking for so this is just a first opinion)</p>",
        "id": 153901500,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502358986
    },
    {
        "content": "<p>BUT if the physician is saying that he is now prescribing this medication, even if it is to add to the summary, then it is a request.</p>",
        "id": 153901502,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502359033
    },
    {
        "content": "<p>basically (i can send you the early draft paper IHE is working on), the idea is that the list contains anything:<br>\n- summary of prescribed treatments<br>\n- active prescriptions<br>\n-...</p>",
        "id": 153901504,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502359154
    },
    {
        "content": "<p>the problem ist, that the \"Medicationplan\" is used for two purposes: on the one hand it should give the patient a compiled information which medication he should use when on the other hand it shoud provide pharmacies and practioners to identify possible negative interactions</p>",
        "id": 153901506,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502359176
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> the IHE draft would surely be of interest, in terms of keeping both efforts consistent.</p>",
        "id": 153901509,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502359318
    },
    {
        "content": "<p>just saw that taken in MedicationStatement has the Cardinality of 1..1 <br>\nIf a Statement represents a drug which a patient is taking at the moment, or defined daterange, taken doesn't seem to make much sense?</p>",
        "id": 153901515,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1502359570
    },
    {
        "content": "<p>one thing that is important: A request is just a request, a \"rezept\". it is not a treatment. So you cannot say \"this prescription is ongoing\", but \"this treatment is ongoing\". A treatment can start with a request (or without). If this doesn't make sense, then whatever comes next is hard</p>",
        "id": 153901517,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502359628
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191546\">@Peter Scholz</span> -that is indeed a challenge, and one thing we realized from the beginning: any medication list will likely have multiple uses, so we should not try to go to \"the list that meets our use case closest\"</p>",
        "id": 153901520,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502359704
    },
    {
        "content": "<p>ah, or taken stands for the patient saying \"i definitely don't take drug X\" ?</p>",
        "id": 153901522,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1502359727
    },
    {
        "content": "<p>taken is a code</p>",
        "id": 153901523,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502359742
    },
    {
        "content": "<p>y   Yes Positive assertion that patient has taken medication<br>\nn   No  Negative assertion that patient has not taken medication<br>\nunk Unknown Unknown assertion if patient has taken medication<br>\nna  Not Applicable  Patient reporting does not apply</p>",
        "id": 153901524,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502359777
    },
    {
        "content": "<p>it stands for patient saying indeed \"i don't take Drug X \"  &lt;-- of course, that statement may be true or not, but that is what the patient says</p>",
        "id": 153901526,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502359830
    },
    {
        "content": "<p>i'm aware of the code, but \"A MedicationStatement may indicate that the patient may be taking the medication now, or has taken the medication in the past or will be taking the medication in the future.\" kind of collides with taken as 1..1, especially the \"in the future\" part</p>",
        "id": 153901527,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1502359851
    },
    {
        "content": "<p>Patient reporting does not apply ???</p>",
        "id": 153901529,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502360028
    },
    {
        "content": "<p>\"na Not Applicable Patient reporting does not apply\" is one of the codes. i guess it could mean that thestatement is captured in a way that does not require any patient assertion. The codes that usually matter are \"yes, taken\" and \"no, not taken\"</p>",
        "id": 153901536,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502360390
    },
    {
        "content": "<p>i can go to my physician and say \"i plan to take these vitamins after my vacation\". or \"as of next week I will not take my antibiotics because I have a party and i intend to drink\"</p>",
        "id": 153901537,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502360587
    },
    {
        "content": "<p>(sorry for the silly examples)</p>",
        "id": 153901538,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502360612
    },
    {
        "content": "<p>for the IHE draft, we will publish asap. we started this discussion in 2011 but due to lack of resources/time, we spent almost no time writing, but we did follow lots of similar dsicussions</p>",
        "id": 153901539,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502360774
    },
    {
        "content": "<p>btw, who are the owners of this medikationsplan? I have a couple questions also around security and others.</p>",
        "id": 153901540,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502360891
    },
    {
        "content": "<p>the owner of the plan is the patient, currently only the paper version exists but the plan itself is coded in a ultra short fhir format as a 2d barcode on the paper plan. In the future this plan should also be available electronically on the famous german electronic health card.<br>\nAdding entries is allowed by physicians and pharmacists, not the patient itself. It contains all prescribed medications as well as the self medication of the patient</p>",
        "id": 153901541,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1502361243
    },
    {
        "content": "<p>ah, i meant security as confidentiality, as in \"is there any sensitive information in the barcode, that if i am at a lunch table and someone takes a picture, they get access to my history?\"</p>",
        "id": 153901542,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502361315
    },
    {
        "content": "<p>in the barcode alle entries visible on the paper plan are encoded. There is not more \"hidden\" information in the 2D Barcode</p>",
        "id": 153901543,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1502361447
    },
    {
        "content": "<p>ok that was a curiosity, since I was looking at encryption on barcodes and I thought that someone had it.</p>",
        "id": 153901544,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502361486
    },
    {
        "content": "<p>Right, I guess that's left to the responsibility of whoever has a paper printout of the medication plan.</p>",
        "id": 153901545,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502361510
    },
    {
        "content": "<p>It would make no sense to encrypt the bar code when all it's information is right below in plain text ;)</p>",
        "id": 153901546,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502361587
    },
    {
        "content": "<p>it would make little sense. just because people know how to conceal text if they want to hide some parts of it, but they don't know how to conceal a barcode.</p>",
        "id": 153901547,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502361648
    },
    {
        "content": "<p>but that is a detail, sorry for diverging.</p>",
        "id": 153901548,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502361659
    },
    {
        "content": "<p>You are right, but I think that would be more of an issue for a prescription (as in \"I get my Viagra somewhere nobody knows me, but the blood pressure medication at the local pharmacy\")</p>",
        "id": 153901549,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502361989
    },
    {
        "content": "<p>MedicationRequest is used for ordered, planned and proposed medications.  I would expect that MedicationRequest instances with an \"intent\" of \"order\" would always be authored by Practitioners.  You wouldn't have Patient-authored orders.  However, you might have patient-authored proposals or plans.  If you want to capture statements about what medications a patient claims to be on or that some reporter believes them to be on, MedicationStatement would be the correct choice.</p>",
        "id": 153901625,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502378389
    },
    {
        "content": "<p>understood and agreed but what if you want to present a medication plan which should serve two objectives:</p>\n<p>1st give the patient a kind of handout which medication to use (like what you see on the pic attached by Patrick above)<br>\n2nd give the pharmacist and practitioner a compiled list of all medications the patient uses (prescribed by practitioners and self medication )</p>\n<p>that's what the german medication plan does.</p>\n<p>to me that looked like a bundle of MedicationRequests with an \"intent\" of \"plan\"</p>",
        "id": 153901646,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502381493
    },
    {
        "content": "<p>I would separate the purpose from the content:</p>",
        "id": 153901647,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502381585
    },
    {
        "content": "<p>the medication that the patient has to  use is a request. the one that the physician wants to see is a statement.</p>",
        "id": 153901648,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502381638
    },
    {
        "content": "<p>with that in mind, are you not merging the content with the presentation?</p>",
        "id": 153901652,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502381658
    },
    {
        "content": "<p>i mean, the physician application will take whatever information is there (summary and requests), and render it as a summary. The patient will take only the part that is for him to administer (the requests)</p>",
        "id": 153901655,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502381713
    },
    {
        "content": "<p>the information  transport should not depend on what you are going to do with it.</p>",
        "id": 153901656,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502381753
    },
    {
        "content": "<blockquote>\n<p>the medication that the patient has to  use is a request. the one that the physician wants to see is a statement.</p>\n</blockquote>\n<p>nice try, but the medication plan is both in one by law :(</p>",
        "id": 153901663,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502382092
    },
    {
        "content": "<p>I dont understand that comment. the technical mechanism should be clear. if the law forces some assumptions, those are on the outer layer.</p>",
        "id": 153901665,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502382150
    },
    {
        "content": "<p>i.e. if a law says \"when a prescription is complete\" - it is up to implementers to realize that what the law would say, if they were ridiculously picky, is \"when the treatment initiated by the prescription is complete\".</p>",
        "id": 153901667,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502382224
    },
    {
        "content": "<p>this is just an example.  The argument \"assumptions are already in the law\" are not something worth discussing.</p>",
        "id": 153901668,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502382255
    },
    {
        "content": "<p>law is different everywhere and we don't want to harmonize the law, but to support the variety of laws.</p>",
        "id": 153901669,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502382291
    },
    {
        "content": "<p>Hmm bit difficult to explain:<br>\nThe law is, we have to compile a medication plan, which has to serve both purposes explained above.<br>\nIn a profile we now try to define a bundle resource which implements that kind of plan, and came across the tricky question which resource would fit best representing a single line in that plan ( MedicationRequest with \"intent\" of \"plan\" or better use a MedicationStatement)</p>",
        "id": 153901670,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502382415
    },
    {
        "content": "<p>so, to avoid any assumptions on my own statement ( :) ) i should say: <br>\n- the entries for the medication for which there is a request for the patient to take, are modeled as a medicationRequest. <br>\n- The entries for which the treatment is done, and/or are just a synthetic view (for the past, present or future) are modeled as a medicationStatement.<br>\n-Nothing prevents you from converting a request to a statement if you want to create a summary.<br>\nThe user interface would know how to handle this.</p>",
        "id": 153901671,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502382424
    },
    {
        "content": "<p>I thnk the trick is \"in a single line\" - you are possibly looking for a line in the paper or in the presentation layer. I am looking at fhir resources which are in the background.</p>",
        "id": 153901672,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502382559
    },
    {
        "content": "<p>ok, <br>\nit's not the question if treatment is done, </p>\n<p>Story line is<br>\nPatient insists that the practitioner compiles a medication plan,<br>\nthis plan consist on<br>\na) medication this practioner has prescribed<br>\nb) medication other practitioners have prescribed (and told the practitioner about it, or the patient informs his practitioner)<br>\nc) medication the patient just takes on a regular basis (non prescribed drugs e.g one Aspirin  per day)</p>\n<p>and for sure, it is no problem to translate, we just want to profile a certain approach as a suggestion that apps in Germany should use to send such a plan</p>",
        "id": 153901673,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502382760
    },
    {
        "content": "<p>pls pm me if you want to take a look at the early draft of the short paper on this matter. we are just starting  but this is the point we want to make - the separation, for medication lists, between:<br>\n- frontend and backend<br>\n- data stored vs uses of that list...</p>",
        "id": 153901674,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502382772
    },
    {
        "content": "<p>I hope that cleared up a bit of our intent</p>",
        "id": 153901675,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502382787
    },
    {
        "content": "<p>a use case always helops :) thanks for the story line. here goes (first impression)</p>",
        "id": 153901676,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502382853
    },
    {
        "content": "<p>here's a possible bundle for that:<br>\na) medicationRequest A, + medicationStatement A, which is derived from medicationRequest A<br>\nb) you can have a medicationStatementB, possibly derived from a medicationRequest B which sits somewhere else<br>\nc) medicationStatement C</p>",
        "id": 153901677,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502383029
    },
    {
        "content": "<p>of course the doubt remains on a)</p>",
        "id": 153901678,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502383058
    },
    {
        "content": "<p>but that is the key: this has two purposes: <br>\n1. tell the patient he is expected to take his medication (or even make a reminder on his smartphone) <br>\n2. fill in a summary.<br>\nI don't see a big issue in representing this as a medicationStatement that contains a request (thus differentiating it from case b)</p>",
        "id": 153901679,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502383241
    },
    {
        "content": "<p>did I get you right:<br>\nthat would be a bundle  containing<br>\nmedicationStatementA (with basedOn = reference to medicationRequestA)<br>\nmedicationStatementB (with basedOn = reference to medicationRequestB)<br>\nmedicationStatementC</p>\n<p>if yes: what is the  reasonable value for MedicationStatement.taken ?</p>",
        "id": 153901682,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502384095
    },
    {
        "content": "<p>my first approach would have been using three MedicationRequests<br>\ncase a) I think there is no doubt that this resource exist in the  database of practitioner A<br>\ncase b) in an ideal networked world, there would have been a transmission of the MedicationRequest from practitioner B to A (leading to a resource in practitioner A's database)<br>\ncase c) if the patient tells practitioner A he is about to take e.g. Vit-D 1000iE every morning we could see that as a prescription where the patient is the author which could be modeled as a MedicationRequest with MedicationRequest.requestor.agent=reference to patient.</p>",
        "id": 153901685,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502384423
    },
    {
        "content": "<p>Is the 'medication plan' the same as the definitive list of medications that a patient is (or should be) taking? If so, I've always modelled it as a List resource with MedicationStatements. When an 'order to supply' is made, that is represented by a specific MedicationRequest...</p>",
        "id": 153901755,
        "sender_full_name": "David Hay",
        "timestamp": 1502393398
    },
    {
        "content": "<p>Yes it is the such a kind of a list (see story line above)<br>\nstill leaves me with the question, what would be the correct value of taken ?</p>",
        "id": 153901757,
        "sender_full_name": "Peter Scholz",
        "timestamp": 1502393641
    },
    {
        "content": "<p>that is a good point, the value of \"taken\".<br>\nI would say na, since this is not about what the patient reported.</p>",
        "id": 153901782,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502396603
    },
    {
        "content": "<p>(my own interpretation, not necessarily authoritative)<br>\nMedicationStatement.taken is based upon what you know at the time the MedicationStatement instance is created.  If you are deriving MedicationStatement from a MedicationRequest, with no additional information (e.g., no info from the patient), then you really don't know if it has (or will) be taken.  So, MedicationStatement.taken=\"unk\" (or \"na\" it taken is not pertinent).</p>",
        "id": 153901797,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1502398816
    },
    {
        "content": "<p>If the intent is that you're creating a Medication \"plan\" that incorporates meds that the patient has reported to be taking, additional meds that have been ordered by other clinicians and meds that the prescribing doctor is ordering, then I'd say CarePlan with a bunch of referenced MedicationRequest instances all of intent\"plan\".  However, the legal order would be distinct instances of MedicationRequest with intent \"order\"</p>",
        "id": 153901818,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502401302
    },
    {
        "content": "<p>in existing implementation prototypes, I have seen 2 approaches here: <br>\n- the list can include statements and requests - and even administrations for high profile single use things <br>\n- the list is all statements, with references to source requests, dispenses, and administrations</p>",
        "id": 153901824,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502403870
    },
    {
        "content": "<p>which is better depends on where curation work belongs in the process (if present at all)</p>",
        "id": 153901825,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502403886
    }
]