[
    {
        "content": "<p>MedicationStatement seems to be just for medications and other drugs. Should it include supplements?</p>\n<p>There seems to be no way to record a statement about the use of a non-medication. Is there a need for a DeviceStatement ? See also <a href=\"https://chat.fhir.org/#narrow/stream/implementers/subject/MedicationOrder.20scope\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/subject/MedicationOrder.20scope\">https://chat.fhir.org/#narrow/stream/implementers/subject/MedicationOrder.20scope</a></p>",
        "id": 153850067,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1474428956
    },
    {
        "content": "<p>yes DeviceStatement</p>",
        "id": 153850074,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474453080
    },
    {
        "content": "<p>Ah DeviceUseStatement for appliances and devices. </p>\n<p>And for supplements? Widen the scope of MedicationStatement?</p>",
        "id": 153850078,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1474453702
    },
    {
        "content": "<p>What is  the use case for DeviceStatement.   We have been scratching our heads over when that would be used.  If Grandma gets a new walker or artificial hip - would my system record that?  would it be an observation or special thing which parallels medicationStatement ?.  We have not moved forward on it  ( it is officially pending approval by FMG)  until we can figure out what it is good for...</p>",
        "id": 153850720,
        "sender_full_name": "Eric Haas",
        "timestamp": 1474853389
    },
    {
        "content": "<p>Re supplements  - I would think medstatement covers that as well as weed and aspirin</p>",
        "id": 153850721,
        "sender_full_name": "Eric Haas",
        "timestamp": 1474853424
    },
    {
        "content": "<p>I can only guess as to possible uses for DeviceStatement. I like the approach of leaving it as it us until a plausible use is found for it.</p>",
        "id": 153850722,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1474853994
    },
    {
        "content": "<p>DeviceUseStatement was created by the CDS work group because they have a need to capture metrics about whether recomendations about the use of a device have been followed.  The problem is that there isn't necessarily a standard way such information is recorded - if it's recorded at all.  So the resource didn't necessarily originate based on what systems typically do.</p>",
        "id": 153850736,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474861293
    }
]