[
    {
        "content": "<p>Hi,<br>\nI am migrating a Messaging implementation of MedicationOrder exchange from a DSTU2 context to STU3.</p>\n<p>I need to exchange a medication request cancellation (status = cancelled) and inform an HIS about the reason , the date and who cancelled the request.</p>\n<p>I thought I would just use the MedicationRequest.eventHistory and put that information on a Provenance resource but it seems that the eventHistory \"SHALL NOT include the Provenance associated with this current version of the resource\".</p>\n<p>Since we are implementing  pure message exchange, we do not have a way to query provenance records as the standard seems to sugest. </p>\n<p>I dont see how I can fully represent a cancelled MedicationRequest on a single exchange...</p>\n<p>How would you guys do this?</p>",
        "id": 153880983,
        "sender_full_name": "Hugo Soares",
        "timestamp": 1491402090
    },
    {
        "content": "<p>You can still send the Provenance for this version in your message, but the \"current\" Provenance would point to the current MedicationRequest rather than the other way around</p>",
        "id": 153880986,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491402895
    },
    {
        "content": "<p>wouldn't that go against wait is in here ?<br>\n<a href=\"https://www.hl7.org/fhir/STU3/medicationrequest-definitions.html#MedicationRequest.eventHistory\" target=\"_blank\" title=\"https://www.hl7.org/fhir/STU3/medicationrequest-definitions.html#MedicationRequest.eventHistory\">https://www.hl7.org/fhir/STU3/medicationrequest-definitions.html#MedicationRequest.eventHistory</a></p>",
        "id": 153880987,
        "sender_full_name": "Hugo Soares",
        "timestamp": 1491403080
    },
    {
        "content": "<p>Are you recomending me to use a standalone Provenance resource and link it to my MedicationRequest via Provenance.target ?</p>",
        "id": 153880988,
        "sender_full_name": "Hugo Soares",
        "timestamp": 1491403332
    },
    {
        "content": "<p>My understanding is that you should have multiple Provenance instance. One targets to current version, others target to previous versions. And you only need to include Provenance for previous versions in eventHistory.</p>",
        "id": 153880989,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1491404855
    },
    {
        "content": "<p>The way Provenance works is that each Provenance points to the version of a resource whose creation is described by the Provenance.  EventHistory points to \"past\" Provenances that are relevant in understanding the history of the resource.  The EventHistory can't include the \"current\" Provenance because the version of the resource needs to be created before the Provenance can be created that points to it.</p>",
        "id": 153880990,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491404899
    },
    {
        "content": "<p>Got it. Thank you for your inputs</p>",
        "id": 153880993,
        "sender_full_name": "Hugo Soares",
        "timestamp": 1491405856
    },
    {
        "content": "<p>np</p>",
        "id": 153880994,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1491406064
    }
]