[
    {
        "content": "<p>We have a scenario where a medication that is prescribed to a patient could be stopped because:<br>\n    1) The patient has an allergic reason to it<br>\n    2) The patient improved before the medication was finished<br>\nWould it be possible to represent this information under MedicationStatement.reasonNotTaken given that in both the scenarios mentioned above the patient could have actually been taking the medication?</p>",
        "id": 153879792,
        "sender_full_name": "Pramod Dematagoda",
        "timestamp": 1490573793
    },
    {
        "content": "<p>reasonNotTaken is not the same as reasonStopped.  For now, that would be an extension, though you could try making the case for it to be added to core.  In either case, submitting a change request would be a good idea.</p>",
        "id": 153879808,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490590978
    },
    {
        "content": "<p>that's not obvious to me. \"I don't take this medication because it gives me hives\" - hard to imagine that as anything by a 'reasonNotTaken'. <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"191402\">@Scott Robertson</span> <span class=\"user-mention\" data-user-id=\"192080\">@John Hatem</span> may have opinions</p>",
        "id": 153879810,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1490591697
    },
    {
        "content": "<p>Ideally we would use the reasonNotTaken field, but the only concern with doing this is that the FHIR spec seems to imply that setting MedicationStatement.notTaken to true (DSTU2), which must be done in order to use reasonNotTaken, means that the patient had never taken the medication in the past which is not necessarily the case.</p>",
        "id": 153879989,
        "sender_full_name": "Pramod Dematagoda",
        "timestamp": 1490656949
    },
    {
        "content": "<p>MedicationStatement.status is used and has a <code>stopped</code> status.   notTaken is different - you didn't take the meds at all.  It would be reasonable to supply a reason why the meds were stopped  ( e.g., got better )  in the <code>note</code> element or make or an extension.</p>",
        "id": 153879997,
        "sender_full_name": "Eric Haas",
        "timestamp": 1490662208
    },
    {
        "content": "<p>I agree that MedicationStatement,reasonNotTaken shouldn't be used.  It has an invariant that says it is only applicable when MedicationStatement.taken=no -- meaning the med was not taken.  <br>\nIn DSTU2, we (Cerner) had implemented a stopped reason using the MedicationOrder.reasonEnded (with MedicationStatement referencing the MedicationOrder).  <br>\nHowever, in STU3, the MedicationRequest.reasonEnded was replaced by the \"eventHistory\" structure, which was originally going to be a backbone element with status, action, date/time, practitioner, and reason, but then \"eventHistory\" morphed into the reference to Provenance.  Personally, I would have preferred it to be inline in the resource instead of relying on Provenance.</p>",
        "id": 153880105,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1490721096
    }
]