[
    {
        "content": "<p>hi all, hope you're all excited to learn a bit more about medical device connectivity at the FHIR DevDays. I'll be leading the PersonalConnectedHealthAlliance/Continua track to discuss medical device data and data standards such as IEEE and Bluetooth.</p>",
        "id": 153856232,
        "sender_full_name": "Melanie Yeung",
        "timestamp": 1478717077
    },
    {
        "content": "<p>Medical devices are instrumental to everyday management of patients inside and outside the hospitals. Devices range from activity monitors, glucose meters, blood pressure monitors, and weight scales as well as why this data is so important to both the patient user as well as healthcare providers. Hope you are able to come learn more about the tech, the underlying data standards, it's clinical use cases and how we're going to be able to map it to FHIR</p>",
        "id": 153856233,
        "sender_full_name": "Melanie Yeung",
        "timestamp": 1478717298
    },
    {
        "content": "<p>How do we add a unit code to the SimpleQuantity? for Periodic measurements</p>",
        "id": 153857268,
        "sender_full_name": "Melanie Yeung",
        "timestamp": 1479305237
    },
    {
        "content": "<p>Not sure what you mean.  Just use SimpleQuantity.code or .unit</p>",
        "id": 153857271,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1479305548
    },
    {
        "content": "<p>how do we see that in <a href=\"http://www.hl7.org/fhir/datatypes.html#SimpleQuantity\" target=\"_blank\" title=\"http://www.hl7.org/fhir/datatypes.html#SimpleQuantity\">http://www.hl7.org/fhir/datatypes.html#SimpleQuantity</a></p>",
        "id": 153857274,
        "sender_full_name": "Melanie Yeung",
        "timestamp": 1479305991
    },
    {
        "content": "<p>unless you go into the JSON / XML examples <a href=\"http://www.hl7.org/fhir/simplequantity.profile.json.html\" target=\"_blank\" title=\"http://www.hl7.org/fhir/simplequantity.profile.json.html\">http://www.hl7.org/fhir/simplequantity.profile.json.html</a></p>",
        "id": 153857275,
        "sender_full_name": "Melanie Yeung",
        "timestamp": 1479306015
    },
    {
        "content": "<p>Hello FHIR community! Personal Connected Health Alliance / Continua is back for another showing at the FHIR Dev Days this coming November. There are many different medical devices that can be extremely useful to patient management.  Glucose meters for diabetes patients, blood pressure to track hypertension, weight scales and activity monitors for health and wellness just to name a few. We're interested to know if anyone out there is playing with device data - what type of data are you trying to use? how are you using it? how can we help? #devdays2017 </p>",
        "id": 153896219,
        "sender_full_name": "Melanie Yeung",
        "timestamp": 1499357094
    },
    {
        "content": "<p>Melanie, PCHAlliance|Continua have several recently certified devices that could be used and Dev Days. Additionally, there are more planned devices in the certification pipeline that we can reach-out to ahead of Dev days. We would also be interested in helping any organizations interested in developing devices and apps ahead of Dev days (whic could also be used during Dev days).</p>",
        "id": 153896292,
        "sender_full_name": "Michael J. Kirwan",
        "timestamp": 1499395938
    },
    {
        "content": "<p>hey all, is anyone working on device data these days? what kind of data are you using? how are you using it? what are some of the issues that you are experiencing?</p>",
        "id": 153900356,
        "sender_full_name": "Melanie Yeung",
        "timestamp": 1501771605
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193206\">@Jayashree Surnar</span> are you currently working on integrating device data?</p>",
        "id": 153900366,
        "sender_full_name": "Melanie Yeung",
        "timestamp": 1501772520
    },
    {
        "content": "<p>We (Sensotrend) are using all sorts of data from medical devices as well as from wellness trackers, in our apps for people with type 1 diabetes. We know of Continua specs for glucose meters, for instance. Having standards is good, would be even better to see wide-spread adoption. Insulin pumps tend to be even more difficult and diverse, although there are only a handful of manufacturers on the market.</p>",
        "id": 153900367,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1501772529
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span>  We at PCHA (Remote Patient Monitoring) are defining standards for the upload of medical device data from personal health devices using FHIR. Will you be participating in the FHir Dev days? We are interested in consumers of this data. We would love to have your applications to be able to consume the data.</p>",
        "id": 153900373,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1501772793
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192917\">@Mikael Rinnetmäki</span> we are also working on diabetes apps. Insulin pump devices are definitely more complicated and have a lot of important data that would be interesting to capture. In addition, CGMs!</p>",
        "id": 153900378,
        "sender_full_name": "Melanie Yeung",
        "timestamp": 1501772983
    },
    {
        "content": "<p>have you already used any of the FHIR resources for the diabetes data?</p>",
        "id": 153900379,
        "sender_full_name": "Melanie Yeung",
        "timestamp": 1501772998
    },
    {
        "content": "<p>also, is your app collecting the data directly from the device?</p>",
        "id": 153900388,
        "sender_full_name": "Melanie Yeung",
        "timestamp": 1501773802
    },
    {
        "content": "<blockquote>\n<p>We (Sensotrend) are using all sorts of data from medical devices as well as from wellness trackers, in our apps for people with type 1 diabetes. We know of Continua specs for glucose meters, for instance. Having standards is good, would be even better to see wide-spread adoption. Insulin pumps tend to be even more difficult and diverse, although there are only a handful of manufacturers on the market.</p>\n</blockquote>\n<p>Are you consuming data from a back end / server or data coming directly from devices over Bluetooth or other transport?</p>",
        "id": 153900389,
        "sender_full_name": "Erik Moll",
        "timestamp": 1501773818
    },
    {
        "content": "<p>We have uploader apps that integrate with devices (both their cloud services and hardware, including bluetooth and usb), and also apps that visualize and help make sense of that data.</p>",
        "id": 153900394,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1501775102
    },
    {
        "content": "<p>Not sure yet whether we can make it to DevDays. Nov 14th is the World Diabetes Day, and fully packed with activities...</p>",
        "id": 153900395,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1501775262
    },
    {
        "content": "<p>We've mapped some of the data to FHIR resources, and are planning to do more of that quite soon (there's a new national PHR opening in Finland, based on FHIR). We're integrated with Epic and Cerner already, but currently mainly for the Smart on Fhir part (launching the app), not writing data to their EHR's. We do read HbA1c lab results etc. from the EHR though.</p>",
        "id": 153900396,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1501775479
    },
    {
        "content": "<p>Blood glucose observations seem trivial, but for instance for CGM we haven't found a LOINC code. A SNOMED code does exist, though. I've been following the discussion on food intake (we get the estimated carbs from bolus calculators), but there does not seem to be a FHIR resource for that yet.</p>",
        "id": 153900397,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1501775661
    },
    {
        "content": "<p>Insulin doses seem to be catered for in MedicationAdministration.</p>",
        "id": 153900398,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1501775714
    },
    {
        "content": "<p>We're excited to announce the theme for our track this year's hackathon in Nov. This track will explore device data generated from Continua compliant devices, consumed by FHIR information systems and then used by applications and clinical decision support systems in the context of hospital to home scenarios. Participants will work with device data through a pregnancy disorder use case and learn about Continua interoperability framework for bringing data from medical devices to services and systems used by patients and caregivers in a meaningful way.</p>",
        "id": 153904300,
        "sender_full_name": "Melanie Yeung",
        "timestamp": 1504271334
    },
    {
        "content": "<p>References:<br>\n<a href=\"http://www.pchalliance.org/continua-design-guidelines\" target=\"_blank\" title=\"http://www.pchalliance.org/continua-design-guidelines\">http://www.pchalliance.org/continua-design-guidelines</a><br>\n<a href=\"http://www.itu.int/itu-t/recommendations/index.aspx?ser=H\" target=\"_blank\" title=\"http://www.itu.int/itu-t/recommendations/index.aspx?ser=H\">http://www.itu.int/itu-t/recommendations/index.aspx?ser=H</a><br>\nH.810: Interoperability design guidelines for personal health systems<br>\nH.811: Interoperability design guidelines for personal health systems: Personal health devices interface<br>\nH.812: Interoperability design guidelines for personal health systems: Services interface: Common certified capability class<br>\nH.812.1: Interoperability design guidelines for personal health systems: Services interface: Observation upload certified capability class<br>\nH.812.2: Interoperability design guidelines for personal health systems: Services interface: Questionnaires<br>\nH.812.3: Interoperability design guidelines for personal health systems: Services interface: Capability exchange certified capability class<br>\nH.812.4: Interoperability design guidelines for personal health systems: Services interface: Authenticated persistent session capability<br>\nH.813: Interoperability design guidelines for personal health systems: Healthcare information system (HIS) interface<br>\n<a href=\"https://www.bluetooth.com/specifications/gatt\" target=\"_blank\" title=\"https://www.bluetooth.com/specifications/gatt\">https://www.bluetooth.com/specifications/gatt</a><br>\n<a href=\"http://standards.ieee.org/findstds/standard/11073-10101a-2015.html\" target=\"_blank\" title=\"http://standards.ieee.org/findstds/standard/11073-10101a-2015.html\">http://standards.ieee.org/findstds/standard/11073-10101a-2015.html</a><br>\n<a href=\"https://rtmms.nist.gov/rtmms/index.htm#!rosetta\" target=\"_blank\" title=\"https://rtmms.nist.gov/rtmms/index.htm#!rosetta\">https://rtmms.nist.gov/rtmms/index.htm#!rosetta</a></p>",
        "id": 153919712,
        "sender_full_name": "Melanie Yeung",
        "timestamp": 1510751406
    }
]