[
    {
        "content": "<p>My country is implementing a national service for issuing a medical certificate (such as a certificate for employment, sick leave, driving license, etc.)—the development team plan to use FHIR document for this.</p>\n<p>My question is:<br>\nIf the patient's health status is entirely normal, can we use the Condition resource for this? Or should we use other resources like ClinicalImpression?</p>\n<p>And about the terminology;<br>\nIn ICD-10, there is a code like Z00.0 General medical examination or Z02.4 Examination for driving license, but I can't find codes for the same purpose on SNOMED CT. Or just a code that say the patient is healthy. Are there SNOMED CT codes for these situations?</p>",
        "id": 258236370,
        "sender_full_name": "Rath Panyowat",
        "timestamp": 1634663977
    },
    {
        "content": "<p>It's not <em>wrong</em> to have a Condition that says \"normal health\", though it's not something that's typically done.  <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> - thoughts on the SNOMED codes question?</p>",
        "id": 258251288,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634669219
    },
    {
        "content": "<p>Condition is specifically named \"Condition\" and not \"problem\" because it's scope does include documented positive things about health, such as 'pregnant', or 'healthy'</p>",
        "id": 258253546,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634670099
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"301593\">@Rath Panyowat</span>  Yes, agree that Condition can be used for this.  The documentation states:</p>\n<blockquote>\n<p>The condition resource may be used to record a certain health state of a patient which does not normally present a negative outcome, e.g. pregnancy. The condition resource may be used to record a condition following a procedure, such as the condition of Amputee-BKA following an amputation procedure.</p>\n</blockquote>\n<p>Though the Condition documentation doesn't address the \"healthy\" or \"well\" states explicitly, they are included by implication in the statement above.  And SNOMED CT does have a code for <code>102499006 |Fit and well (finding)|</code>, as well as multiple subtype codes including those for \"Well adult\", \"Well child\", etc.</p>",
        "id": 258259639,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1634672624
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> Thank you very much everyone <span aria-label=\"pray\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"pray\">:pray:</span></p>",
        "id": 258301532,
        "sender_full_name": "Rath Panyowat",
        "timestamp": 1634695482
    }
]