[
    {
        "content": "<p>Splitting off from the <a href=\"#narrow/stream/179166-implementers/topic/COVID.20Immunization\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/COVID.20Immunization</a> thread so that one doesn't get hijacked by this tangent. <br>\nIt sounds like the Medication resource can be used both as a definition of a medication as well as a description of an instance of a medication. Is that right?</p>",
        "id": 213279897,
        "sender_full_name": "Craig Newman",
        "timestamp": 1602678073
    },
    {
        "content": "<p>yes that is true</p>",
        "id": 213284077,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602680395
    },
    {
        "content": "<p>i would say partly true.  The scope of the Medication resource is to identify the medication that is being used in the referring resource.  This can be done by specifying a code and lot number and identifier (if you just wanted to send the code, you'd probably just send the code as most references are CodeableReference(Medication).  If you are defining a compound, you can also specify a set of ingredients and a recipe for making that compound.</p>\n<p>The intent is <em>NOT</em> that you can say \"this medication with this code has these ingredients\".</p>",
        "id": 213304481,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602688513
    },
    {
        "content": "<p>When looking at an instance of a Medication resource is it possible to tell the difference between a definition of a medication and an instance of a medication? Or should you be telling by context (eg. a Medication referenced in a MedicationRequest is probably a definition because a provider probably isn't ordering a specific instance of the medication)? Does it really matter?</p>",
        "id": 213318460,
        "sender_full_name": "Craig Newman",
        "timestamp": 1602693850
    },
    {
        "content": "<p>i just feel that the distinction between \"definition\" and \"instance\" is a non-starter when it comes to the Medication resource.  even historically it has always been problematic.  I think that the only time that the Medication resource is explicitly referring to a specific instance of a medication is when the Medication.identifier is specified, i.e. a serial number is given.  Every other time, even when the resource contains a recipe and a list of ingredients, it is not referring to an instance.</p>",
        "id": 213318907,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602694048
    },
    {
        "content": "<p>It can be  type of medication or an actual medication though</p>",
        "id": 213319253,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602694206
    },
    {
        "content": "<p>but the definition is always elsewhere, in the code and the thing that the code represents. Is that it?</p>",
        "id": 213319450,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602694300
    },
    {
        "content": "<p>no, it is always an actual medication.  When a prescriber says \"100mg of amoxicillin\" he is prescribing an actual medication.  He just doesn't care which specific brand of amoxicillin is dispensed.</p>",
        "id": 213319571,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602694340
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20Resource.20Scope/near/213319450\">said</a>:</p>\n<blockquote>\n<p>but the definition is always elsewhere, in the code and the thing that the code represents. Is that it?</p>\n</blockquote>\n<p>I'd agree to that.</p>",
        "id": 213319599,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602694354
    },
    {
        "content": "<p>is it more like virtual vs actual?</p>",
        "id": 213319701,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602694405
    },
    {
        "content": "<p>which is like abstract vs concrete maybe</p>",
        "id": 213319866,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602694475
    },
    {
        "content": "<p>or maybe it can be thought of as a less specified medication vs a more specified one</p>",
        "id": 213320100,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602694594
    },
    {
        "content": "<p>but it does also go from being a type (amoxicillin, or a branded version) to an instance - an actual <br>\npack with a lot number</p>",
        "id": 213320224,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602694663
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191651\">Rik Smithies</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20Resource.20Scope/near/213320224\">said</a>:</p>\n<blockquote>\n<p>but it does also go from being a type (amoxicillon, or a branded version) to an instance - an actual pack with a lot number</p>\n</blockquote>\n<p>actual pack with lot number still isn't an instance.  it's just more specified.  the only time it is an instance would be if Medication.identifier is specified.</p>",
        "id": 213320328,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602694700
    },
    {
        "content": "<p>and Pharmacy WG didn't want to add that but caved in due to the requirement for injectables.</p>",
        "id": 213320369,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602694724
    },
    {
        "content": "<p>i do like the \"less specified vs more specified\" idea</p>",
        "id": 213320434,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602694759
    },
    {
        "content": "<p>I agree with the suggestion/question earlier by Craig that it doesn't really matter if it's an instance or not.<br>\nIf its dispensed or administered, you know that there was one selected you could touch. Before that (requested) there isn't one specific one you can touch. But systems aren't going to be acting on some rather artificial \"it's now an instance\" flag. The context is clear from the use of the Medication resource.</p>",
        "id": 213321730,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602695276
    },
    {
        "content": "<p>The reality is that there's a continuum.  If you indicate that you dispense a medication with a particular lot number, that's not really an 'instance', in that you're not identifying the specific pill, but you're certainly conveying a degree of 'instancy' information.  (You could also have 10 different dispenses that all refer to the same Medication resource instance declaring that same lot number - and that wouldn't mean you dispensed the same pill 10 times, merely that they are all the same 'kind' of medication from the same lot.)</p>",
        "id": 213351074,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602709876
    },
    {
        "content": "<p>I've asked some of these questions before and specifically filed a GForge ticket in the past asking for there to be a Medication.idenfitfier (*) so that the \"instance\" can be differentiated from the \"class\" (or abstract type).    If you have a medication quality control system you'd need to at least track the lot in case there are problems with a particular lot though that is still not an 'instance'.   However, it is possible that a specific solution for a specific patient gets a bar code label and unique identifier that is 'one of a kind'.   Imagine if there was a problem with a specific solution that got 'contaminated' or was mixed incorrectly, it seems like the pharmacy control systems (and people) would want to track that specific instance of the drug given to a specific patient.   Also, when the clinician actually does the administration (RAS in V2, MedAdmin in FHIR) then at that point a unique instance of a drug is actually given.    I suppose with one pill from one lot (or bottle of pills) it might not make much of a difference but for other use cases it would.</p>\n<p>I also think of the 5-Rights Med Admin with barcodes so that the clinician (and system) knows and documents that the exact, specific instance of a med is given the Right Drug, to the Right Patient at the Right Time, with the Right Dose, with the Right route.</p>\n<p>(*) I was amazed back in STU3 that it seemed like the Medication resource was the only one that didn't have an identifier property (other than maybe some of the non-patient infrastructure/foundational type resources)</p>",
        "id": 213354451,
        "sender_full_name": "John Silva",
        "timestamp": 1602711960
    },
    {
        "content": "<p>Is lot number always meant to be an identifier of multiple items of which this is one? If it was unique to this item - possible for a dispensed pack presumably - would it go in batch.lotNumber or identifier?</p>",
        "id": 213361132,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602716582
    },
    {
        "content": "<p>i wouldn't say that it is <em>always</em>.  But normally a lot identifies a specific batch of product that was produced, so normally it is an identifier of multiple items.</p>",
        "id": 213361402,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602716771
    },
    {
        "content": "<p>if I have a unique number on a pack, which people think of as a batch number, is it clear if it goes in identifier or lotNumber?</p>",
        "id": 213361771,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602717080
    },
    {
        "content": "<p>batch number would be an alias for lot number</p>",
        "id": 213361785,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602717102
    },
    {
        "content": "<p>unless it uniquely identifies the medication, it's not an identifier</p>",
        "id": 213361794,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602717116
    },
    {
        "content": "<p>Does where you put it depend on if there are other things with the same number?</p>",
        "id": 213362044,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602717336
    },
    {
        "content": "<p>A dispensed medication might be a mixed collection of a physical/concrete package, container and pills/doses...</p>",
        "id": 213366416,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602720921
    },
    {
        "content": "<p>What if a medication with a specified batch/lot number has to be recalled for an adverse event?</p>",
        "id": 213367641,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1602722079
    },
    {
        "content": "<p>AdverseEvent resource can reference the Medication</p>",
        "id": 213399100,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602753814
    },
    {
        "content": "<p>OK, but the adverse event could happen much later and then how would a system track down to the specific instances of medication administrations that were associated with this Adverse event?   Yes, sometimes it could be a 'bad batch/lot' but other times a specific 'mixed solution' (a true one-of).</p>\n<p>For other use cases I've seen is that when interfacing to existing MAR/CPOE systems that still (only) support HL7 V2 there needs to be a way to match the RAS (RXA) identifier of the \"instance\" of the drug with what is used as an identifier in the MedicationAdministration resource for that traceability back to the originating system.</p>",
        "id": 213417740,
        "sender_full_name": "John Silva",
        "timestamp": 1602765557
    },
    {
        "content": "<p>FHIR can record the medication that was administered. If a \"mixed solution\" has a useful identifier, it can be recorded using FHIR, and potentially referenced later. If not, it can't. But FHIR cannot fix limitations in real world processes. If you don't know what administration it was, then FHIR can't really help you.</p>",
        "id": 213420827,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602766965
    },
    {
        "content": "<p>I was talking about the situation where you do have a unique ID, e.g. a barcode in that is used in the 5-rights workflow (and usually communicated via HL7V2 RDE and RAS messages).  Before the Medication.identifier property was added in R4 (I believe) there wasn't a way to have this traceability.</p>",
        "id": 213451962,
        "sender_full_name": "John Silva",
        "timestamp": 1602779579
    },
    {
        "content": "<p>yes - does that raise some issues, or do you have what you need (in R4+)?</p>",
        "id": 213453106,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602780105
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span>  - I don't have a problem with something I'm working on now.  I'm just pointing out that there are real-world use case that require unique Medication identifier to properly implement certain medication workflows.   The 5-rights is just one example, there are probably others that are related to quality assurance and other drug-tracking applications, e.g. clinical trials, that probably need unique identifiers.</p>",
        "id": 213453731,
        "sender_full_name": "John Silva",
        "timestamp": 1602780360
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20Resource.20Scope/near/213361794\">said</a>:</p>\n<blockquote>\n<p>unless it uniquely identifies the medication, it's not an identifier</p>\n</blockquote>\n<p>I'm assuming you mean the \"instance of the medication\" given that Medication (the resource) can be anywhere on the continuum. I don't see this spelled out in the resource definition (only the comment of \"The serial number could be included as an identifier.\"). Would you like a Jira ticket to clarify the use of .identifier, restricting it to ids for medication instances?</p>",
        "id": 213473078,
        "sender_full_name": "Craig Newman",
        "timestamp": 1602788735
    },
    {
        "content": "<p>A Medication resource can also convey \"we've given to this patient  a special mix wich includes:</p>\n<ul>\n<li>5 g of product X with lot Y and serial Y</li>\n<li>10 ml of product A with lot B<br>\n\"</li>\n</ul>",
        "id": 213480517,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602792345
    },
    {
        "content": "<p>even if the special mix does not have a unique ID</p>",
        "id": 213480545,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602792359
    },
    {
        "content": "<p>The introduction of a serial number was a long discussion (meaning it was not seen as common practice), and personally I'm still not convinced \"identifier\" is the best place we could have found for it. <br>\nIdentifier could be a batch identifier, or a serial number... which makes it a continuum - but not a good one (and not what implementations are/were doing AFAIK)</p>",
        "id": 213480875,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602792554
    },
    {
        "content": "<p>Looking at the OP: <span class=\"user-mention\" data-user-id=\"192758\">@Craig Newman</span> I think your sentence may be better if instead of <br>\n\"as a <strong>definition of a medication </strong>as well as a description of an instance\"<br>\nyou have <br>\n\"as a <strong>kind of a medication</strong> as well as a description of an instance of a medication\"<br>\n(and would be even better if you replace \"description\" by \"specification\".</p>",
        "id": 213481599,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602792983
    },
    {
        "content": "<p>Reading the above, I don't see anything in the OP related to Virtual vs actual, abstract vs concrete, type vs actual. <br>\nAll those are just concepts related to the \"precision\" of the definition of a medication - but they are all still definitional.</p>",
        "id": 213481614,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602793006
    },
    {
        "content": "<p>All identifiers are identifiers. We can't add one for each type across a continuum. No one would know which to use. It is already a problem with two of them. We want one type (identifier), which has a type, so you can say what it is if you need to.</p>",
        "id": 213482349,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602793407
    },
    {
        "content": "<p>I don't know what you mean with that. The way I see it, you must be able to add an identifier, at any point of the continuum.</p>",
        "id": 213483742,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602794088
    },
    {
        "content": "<p>what you cannot standardize is the splitting lines across the continuum.</p>",
        "id": 213483934,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602794166
    },
    {
        "content": "<p>Yes I agree. So we use identifier for everything, because there is no separation between types that we can agree on in advance. The different identifiers have systems to tell them apart. If users also need to have different types differentiated they can use different identifier.types.</p>",
        "id": 213484954,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602794643
    },
    {
        "content": "<p>now I see what you meant. Well the way that systems are working, Serial Number and Lot Number are clear concepts with specific meaning</p>",
        "id": 213488460,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602796306
    },
    {
        "content": "<p>and they are both Production Identifiers (out of a production process)</p>",
        "id": 213488667,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602796402
    },
    {
        "content": "<p>To clarify and repeat my earlier statement, Medication.identifier should be used for a string that uniquely identifies a specific medication.  For most cases, Serial Number does uniquely identify a specific medication.  But Lot Number is an identifier of a batch of product and not of a specific medication.  That is why you shouldn't put Lot Number in the Medication.identifier.</p>",
        "id": 213491118,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602797811
    },
    {
        "content": "<p>And that is why it shouldn't come to anyone's surprise why the Pharmacy WG did not have a Medication identifier.  MOST systems that we were referencing don't refer to a specific instance of a Medication.</p>",
        "id": 213491209,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602797865
    },
    {
        "content": "<p>I admit I have always struggled with the interpretation of the rule that \"most systems\". That always ends up as 'most systems I've know' or 'most systems I care about'</p>",
        "id": 213493206,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602799014
    },
    {
        "content": "<p>for Pharmacy WG, it has always been, of the systems that all of the people in the WG know about and/or use</p>",
        "id": 213493270,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602799062
    },
    {
        "content": "<p>that is all any WG can do.  thus the onus is on others who come to the table to present their use cases and show that they have production systems that require whatever it is they are asking.</p>",
        "id": 213493366,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602799108
    },
    {
        "content": "<p>To me what matters is - 'when this element is exchanged, should it be a standard element so that everyone is expected to use it the same way'</p>",
        "id": 213493387,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602799135
    },
    {
        "content": "<p>except that's not the FHIR mantra</p>",
        "id": 213493419,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602799161
    },
    {
        "content": "<p>that way leads to V3 models with everything and the kitchen sink</p>",
        "id": 213493434,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602799182
    },
    {
        "content": "<p>That is an opinion, I presume. In most systems I've seen ( ;) )  it avoids ambiguity and scope creeps</p>",
        "id": 213493603,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602799306
    },
    {
        "content": "<p>We have a release coming for resources that are not implemented by most / any systems. And we have to adapt our rules for that. A mantra is not a dogma, so we have to start somewhere even if we are not sure (this is where I praise. Rik for the initiative - even if I disagree with some of the options, steps were made into the unknown, and that is good)</p>",
        "id": 213493920,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602799520
    },
    {
        "content": "<p>no, it's not an opinion.  Take a look at Pharmacy's V3 models.  They modelled every element that could be exchanged so that there was a standard way.  That led to models that did not actually reflect what was being exchanged since no one had the use of every requirement and use case.    FHIR intentionally went the opposite way.  Here is the line from the spec:  \"FHIR resources aim to define the information contents and structure for the core information set that is shared by most implementations. There is a built-in extension mechanism to cover the remaining content as needed.\"  So you might have a \"standard element\" that isn't shared by most implementations and thus isn't in FHIR.  Medication.identifier was one of those.  We agreed that a Medication serial number existed but the implementations that Pharmacy WG knew of and had participation from did not record nor exchange it.  So it wasn't originally in scope.  When the list of implementations grew, the need to exchange a serial number came forward and thus got included.</p>",
        "id": 213493948,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602799550
    },
    {
        "content": "<p>Ok so if it's not an opinion I'm not supposed to debate or challenge</p>",
        "id": 213494048,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602799603
    },
    {
        "content": "<p>i didn't say that either.  i'm simply showing you what the specification says.  if you want to debate or challenge that, go ahead.</p>",
        "id": 213494123,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602799672
    },
    {
        "content": "<p>Anyway, the serial number was not accepted when implementations grew or new implementations came up with the need.</p>",
        "id": 213494275,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602799791
    },
    {
        "content": "<p>Umm, yes it was.  When John Silva came forward with the requirement, we discussed it and added the Medication.identifier as the proper place for that.</p>",
        "id": 213494411,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602799875
    },
    {
        "content": "<p>That's how it seemed. I look at this discussion and things seem quite fragile, which contrasts with some of the strong assertions I sense.</p>",
        "id": 213494416,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602799883
    },
    {
        "content": "<p>Until he came forward with a concrete requirement, it wasn't a need for the resource.</p>",
        "id": 213494438,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602799909
    },
    {
        "content": "<p>There was a long discussion before that. IHE had to make an extension because the same request was rejected</p>",
        "id": 213494559,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602799997
    },
    {
        "content": "<p>Anyway, that is not the issue, it's just that we take modeling-based decisions, and we take empirical decisions. Some of those are a hit, some are a miss. I would like to see a serial number on anything that is a product, but it's not something I cannot get around.</p>",
        "id": 213495039,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602800305
    },
    {
        "content": "<p>The original question triggered some discussion but my idea is:<br>\nThe medication resource allows us to specify (not define) a specific instance or a kind of a medicine - whether there is a continuum or definition vs not... that doesn't matter I think.</p>",
        "id": 213495173,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602800404
    },
    {
        "content": "<p>In September 2017, you raised this issue.  We suggested that it be an extension for STU3 until more systems came forward with the requirement.  You raised the exact same issue in January 2018 and we decided to change it at that time.  In September 2018, we realized that a serial number could be considered an identifier and moved it.  That's how things should get added to the spec.</p>",
        "id": 213495190,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602800419
    },
    {
        "content": "<p>to specify a medication, you need a code, or sometimes you need more than that.</p>",
        "id": 213495195,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602800422
    },
    {
        "content": "<p>At the moment it's hard to know from the text that .identifier is for the (relatively rare) case of a <em>unique</em> number (serial number is mentioned, but only as a possibility), and .lotNumber is for the non-unique cases. But that is clear now, and the text could easily be improved.</p>\n<p>I can also see an issue where you may not know (yet, or ever) if a number is a unique identifier or not. I assume the rationale was that {anyresource}.identifier is meant to be unique. Is that a rule? If so then it has to be the way it is. If that is not true then all unique or non-unique identifiers could have been modelled in one attribute, which is simpler in some ways.</p>",
        "id": 213498148,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602802609
    },
    {
        "content": "<p>Just an aside -- this discussion seems to have corollaries to the UDI identifier in Observations:  <a href=\"http://hl7.org/fhir/R4/device.html#udi\">http://hl7.org/fhir/R4/device.html#udi</a></p>\n<p>\"The UDI may identify an instance of a device uniquely (when the PI includes a serial number), or it may just identify the type of the device.\"</p>\n<p>It's interesting that this use case was driven by a governmental requirement and also, that FHIR added a unique property to Observation for this rather than \"overloading\" the identifier property.</p>\n<p>As in the case of medications though, this need for device-level (or 'instance level') traceability comes from the safety/quality control requirements around the medical practice, in this case device use, in the case of medications, medication use (or abuse).</p>",
        "id": 213574345,
        "sender_full_name": "John Silva",
        "timestamp": 1602861552
    },
    {
        "content": "<p>I don't know if this is helpful... but it might be. In the supply chain world, there isn't a distinction between LOT NUMBER and SERIAL NUMBER. They are the same concept. A SERIAL NUMBER is just a LOT with one (and only one) member. I also note that we run the risk of conflating \"active ingredient\" with \"product\" (or so it seems from the thread). A clinical order for acetaminophen doesn't care what brand. But when this order is fulfilled (dispensed, or dispenses <strong>and</strong> administered), we need to track the exact product (what GTIN... which can also include the LOT# for lot-controlled products). This also can connect back to data elements maintained by our insurance colleagues... since there may well be a defined formulary for the various acetaminophen products that are included in the portfolio of insured/covered products.</p>",
        "id": 213582099,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1602865367
    },
    {
        "content": "<p>When a serial exists, it can coexist with a LotNr.</p>",
        "id": 213583709,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602866158
    },
    {
        "content": "<p>the rest I agree with you <span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span></p>",
        "id": 213583794,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602866183
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  -- I am sorry to be drawing a blank... when can a serial exist that co-exists with a LOT#?</p>",
        "id": 213584027,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1602866317
    },
    {
        "content": "<p>The lot # is the id of the case, the serial # is the id of a specific item in the case.  When you're talking about an item from the case, you might well convey both ids.</p>",
        "id": 213585311,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602867076
    },
    {
        "content": "<p>I agree with Derek that these numbers might overlap. You can have a unique \"lot number\" I assume (at least in common language of the domain). And then that would not go in lotNumber but in identifier. <br>\nThe tricky issue is that given a number written on something (or a legacy record of a number), it may be hard to know if it is/was unique (like a serial number) or not (like a lot number). So you can't know where to put it.  \"Uniqueness\" doesn't seem to me to be a good filtering criteria.<br>\nIs there a general FHIR requirement that resource.identifier uniquely identifies that thing?</p>",
        "id": 213587966,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602868349
    },
    {
        "content": "<p>It's <em>supposed</em> to uniquely identify a thing, but as with any real world identifier, messiness exists.  If you know it <em>doesn't</em> uniquely identify the thing, it would be wrong to put it in .identifier.</p>",
        "id": 213593671,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602871115
    },
    {
        "content": "<div class=\"message_inline_image\"><a href=\"https://www.mediclabel.nl/wp-content/uploads/2019/01/Voorbeeld-label-Mediclabel.png\"><img src=\"https://www.mediclabel.nl/wp-content/uploads/2019/01/Voorbeeld-label-Mediclabel.png\"></a></div>",
        "id": 213597243,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602872885
    },
    {
        "content": "<p>These concepts are defined, we don't need to know if it is unique or not. A serial number is a serial number</p>",
        "id": 213597392,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602872966
    },
    {
        "content": "<p>The concept of uniqueness will fail. Sometimes there are batches of 1. Sometimes you want to see if there are duplicate serial numbers</p>",
        "id": 213597572,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602873046
    },
    {
        "content": "<p>So if we say that unique ones go here and non-unique ones go there, then we have a problem. On the other hand if identifier can only take unique numbers, then we can't put them all in there (and just use .type to tell them apart). <br>\nBoth possible ways to do it are messy.</p>",
        "id": 213605737,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602877560
    },
    {
        "content": "<p>If you've got an identifier for a specific medication instance (vial, tablet, baggy), that goes in .identifier.  Anything else goes in lot</p>",
        "id": 213605888,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602877663
    },
    {
        "content": "<p>what if you don't know if it is unique to that instance</p>",
        "id": 213605990,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602877721
    },
    {
        "content": "<p>If I have 100 medications in some legacy data, all with identifying numbers, what do I do?</p>",
        "id": 213606060,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602877770
    },
    {
        "content": "<p>If you have no clue what the values mean, stick them in an extension because they're only going to be safe for use by someone who understands their context</p>",
        "id": 213606209,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602877866
    },
    {
        "content": "<p>So that is junk data then. <br>\nBut even for new data, sometimes a user may not know which field to put it in. Next to the data entry fields, when they type in the number on the pack, it will need to say: use this one if the number on the pack is unique, this one if not unique. <br>\nIf it seems common to not know whether what is on the box is unique or not - as Derek says - it doesn't seem good to not have a clear place to put it.<br>\nIt seems more unsafe to relegate a useful identifier to an extension, because you don't know if it is unique or not.</p>",
        "id": 213606685,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602878143
    },
    {
        "content": "<p>The terminology doesn't seem to help because a lot number can be unique, or not.</p>",
        "id": 213606925,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602878263
    },
    {
        "content": "<p>Sure.  If something is a lot number, stick it in lot.  If it's a lot of one, so be it.  You only stick something in 'identifier' if it's truly known to be unique.  And most user interfaces will call it something like \"serial number\" which should hopefully avoid confusion.  (And in fact, most systems won't capture it at all because there aren't a lot of places that deal with dose-specific serial numbers.</p>",
        "id": 213607537,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602878576
    },
    {
        "content": "<p>unlike what Derek said, there does appear to be a natural distinction between a product's lot number and a product's serial number.  FDA, EMA, and Health Canada both make a distinction.  Here, as an example, is the FDA's discussion of a product identifier: Includes the product’s lot number, expiration date, national drug code (or NDC), and a serial number.<br>\nI think that a more interesting conversation revolves around GTINs.  From my reading of the GTIN Allocation Rules document, it seems that you can assign a GTIN to a single unpacked pill, but that the pill wouldn't be marked with the GTIN via barcode.  The bottle that all of those pills comes in would be assigned a different GTIN.  What I couldn't clarify (and would love if someone else could) is if the GTIN assigned to the single unpacked pill was just an identifier of <em>any</em> single unpacked pill or whether it was a GTIN assigned to that specific single unpacked pill.  I would be surprised if a separate GTIN was assigned to every single pill but I don't know enough about the size of the GTIN space.  I did find reference to a sGTIN (a GTIN plus a serial number) but I couldn't find that in the specification.<br>\nIn any case, where do we think the GTIN should go?  Is it a Medication.identifier?  Is it actually just the Medication.code?  I've actually seen guidance from supply chain providers that basically equates the NDC with a GTIN.  If that is true, then my answer would be that the Medication.code is the place for the GTIN.</p>",
        "id": 213608828,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602879260
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20Resource.20Scope/near/213608828\">said</a>:</p>\n<blockquote>\n<p>In any case, where do we think the GTIN should go?  Is it a Medication.identifier?  Is it actually just the Medication.code?  I've actually seen guidance from supply chain providers that basically equates the NDC with a GTIN.  If that is true, then my answer would be that the Medication.code is the place for the GTIN.</p>\n</blockquote>\n<p>Unless GTIN is underpinned by a medications terminology, Medication.identifier looks a better fit to me.</p>",
        "id": 213610902,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1602880528
    },
    {
        "content": "<p>(not wishing to skip over GTIN discussion)<br>\nRegarding lot vs serial,  these things are differentiated, and may be clearly defined, but I get the feeling that in practice you may not know which of the clear definitions you have in front of you. Official guidance doesn't always reflect what goes on in the ground, which is what we need to support.<br>\nTBH I can't see a strong reason to split up the identifiers based on uniqueness.<br>\nPutting them all in identifier seems reasonable, then only one place to worry about.<br>\nBut it seems it's just me who doesn't know what is unique and what is not :-)<br>\nSo I think the main thing would be to better document this \"uniqueness\" requirement, which seems fundamental, because I totally missed that when I came to use this recently. I will raise a Jira.</p>",
        "id": 213611056,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602880620
    },
    {
        "content": "<p>@rik the uniqueness of identifier isn't specific to Medication, so hopefully your Jira ticket isn't medication-specific.</p>",
        "id": 213611120,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602880675
    },
    {
        "content": "<p>It would be about any resource that has two types of identifier and where it's not already documented which is which :-) I've only see that in Medication... (though I do worry about UDI occasionally, but that's not my field).</p>",
        "id": 213611327,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602880787
    },
    {
        "content": "<p>if there was a place everyone would read that said don't use this unless it is unique, we could put it there. But it's better not buried in the datatypes spec.</p>",
        "id": 213611452,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602880844
    },
    {
        "content": "<p>There is a very mature nomenclature in the supply chain domain related to part numbering, lot control, etc. The tracking of materials -- including lot controlled and serial number controlled items -- is not a requirement unique to healthcare. If we develop a nomenclature for <strong>our</strong> materials (like medications, for example) that is <em>not</em> compatible with the nomenclature used by GS1, we'll just be creating problems for ourselves... and perhaps (potentially) problems for patients and providers, too. This feels to me like an area where the physical-world use case needs to drive what our informatics model should do... especially including how we decide to use our resource identifier.</p>",
        "id": 213612478,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1602881381
    },
    {
        "content": "<p>In supply chain management and industrial engineering, a part number (also called a stock keeping unit, or SKU) will need to be different each unique combination of form, fit or function. If the form, fit or function changes... then a new part number is created. Lot numbers (or serial numbers... for lots of 1) are for traceability. They do not impact the form, fit or function. An item's serial number is not used as a replacement for its part number.</p>",
        "id": 213613249,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1602881806
    },
    {
        "content": "<p>It's interesting reading all of this discussion.   One thing that strikes me (probably from the V2 world) is the difference between an \"unencoded order\" where the clinician just says, \"give the patient some amount of X\", where X is the generic or even product drug name.   That is fine for unencoded orders (OMP or RXO segments in V2) but when the Pharmacy gets that order they create an \"encoded order\", which is typically more precise, that is, they specify the specific brand in stock, the particular package (drug form), and so forth (because of knowledge of what's in the Pharmacy and maybe also the patient's condition and side-effects/adverse reactions, etc.), that would end up in RGV (Give) messages in V2.   Then, when the specific instance of a drug is actually given, no matter whether or not it has a unique identifier on it, it is surely a unique instance of the drug being given (RAS in RXA/RXC in V2).    Of course V2 is more 'transactional' (in a sense) than FHIR which seems to only contain the 'current state' of something in the resource, in this case the Medication with respect to the encapsulating order (MedRequest) or administration (MedAdmin) and that seems to be part of the problem for this difference in how the Medication.identifier might be used over these different steps in the med workflow.</p>\n<p>[I suppose at the 'unencoded order' stage it might be Medication.code only, but surely at the 'administration' stage it is unique and seems to need Medication.identifier.]</p>",
        "id": 213613266,
        "sender_full_name": "John Silva",
        "timestamp": 1602881816
    },
    {
        "content": "<p>If you know an identifier for the medication you can record it. If you don't, but want to record \"the unique instance of the drug <em>being given</em>\" (my emphasis on the act of \"being given\", not the instance) then the associated activity resource, in the later stages of workflow, is unique and identifiable. MedicationDispense for \"given to the patient\" (as in \"handed to\"), or MedicationAdministration for the sense of \"given to to take\". Does that cover what you are thinking of John?</p>",
        "id": 213614165,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602882326
    },
    {
        "content": "<p>Also particular to supply chain --  I may have multiple SKUs that all contain the same thing. Drug X could be packaged in bottles of 50, 100 and 500. These are all the same drug and manufactured at the same time with the same LOT# and expiry date. As <span class=\"user-mention\" data-user-id=\"298707\">@John Silva</span>  has noted, a medication order for X could be equally fulfilled by dispensing any of these 3 SKUs... but at the time of dispense, it will be necessary to say which one. And so, at the time of dispense (or administration), the SKU and the LOT# will need to be recorded. It is likely an attribute of the SKU that its classification or its product family will be denoted as X. This is a challenge. The what it \"is\" from an active-ingredient standpoint is not identical to what it \"is\" from a stock management standpoint. Typically, the GS1 GDSN (Global Data Synchronization Network) database maps GTINs (SKUs) to ATC codes (active ingredients). That's how it is in Canada and in the US, too, I believe.</p>",
        "id": 213614266,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1602882383
    },
    {
        "content": "<p>Info re: GS1's use in healthcare (sadly without a meds example... but still illustrative): <a href=\"https://gs1ca.org/gs1ca-components/documents/healthcare-hscn/webinars/GS1-Standards-Class_Nomen-Intro-Webinar_Nov-2019_v1.3_Final.pdf\">https://gs1ca.org/gs1ca-components/documents/healthcare-hscn/webinars/GS1-Standards-Class_Nomen-Intro-Webinar_Nov-2019_v1.3_Final.pdf</a></p>",
        "id": 213615145,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1602882910
    },
    {
        "content": "<p>IHE is working on a product model for this last bit <span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span> , based on what is currently working on supply chain</p>",
        "id": 213638969,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602918053
    },
    {
        "content": "<p>the GDSN is about product master data, so yes, it defines the product and its characteristics like ATC and active ingredients.</p>",
        "id": 213638983,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602918098
    },
    {
        "content": "<p>I do not understand the reasoning about the uniqueness vs non-uniqueness. A serial number has a meaning. It's meant to be unique and used and exchanged as such. A lot number is a different attribute with typically a different granularity. This is how all systems operate, do we want to consider deviating from that?</p>",
        "id": 213639038,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602918193
    },
    {
        "content": "<p>This is perhaps why something was telling me that using an \"identifier\" for serial number is not a good idea. It is a projection onto a model, without a need for that. It requires us to consider whether something is unique or not.</p>",
        "id": 213639094,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602918333
    },
    {
        "content": "<p>I cannot think that someone would do the same thing for similar problems.</p>",
        "id": 213639136,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602918370
    },
    {
        "content": "<p>serial number, lot number, expiry date,  etc are all well-established production attributes (GS1 calls them production identifiers). <br>\nIs it my turn to say that we should look at what systems do, instead of making our model? If so, we'd have to have a very good model.</p>",
        "id": 213639197,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602918565
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span> I think what you point at in terms of separation corresponds to the model we captured , where we  have a trade item (the GTIN thing) and a product (which is a functional description, in whatever abstraction level)</p>",
        "id": 213639372,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602918870
    },
    {
        "content": "<p>Use case(just to make Craig hapy <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>  ): </p>\n<ol>\n<li>A covid vaccine is scanned upon arrival to the pharmacy. The system captures a serial number<em>(, and knows it is unique because it is a serial number)</em>.</li>\n<li>In another part of the country, another covid vaccine is scanned, with a same serial number. This other system captures a serial number<em>(, and also knows it is unique because it is a serial number)</em>.</li>\n</ol>",
        "id": 213639490,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602919162
    },
    {
        "content": "<p>The part in italic is not relevant IMO. Systems don't capture a serial number because / depending on its uniqueness. They capture a serial number.</p>",
        "id": 213639498,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602919202
    },
    {
        "content": "<p>just remembered another thing: The GTIN number (which is a product code) uniquely identifies a (kind of) trade item, one with unique characteristics. So it's a business identifier, but doesn't go into .identifier? I don't think that is a consequence that goes well with implementations</p>",
        "id": 213642218,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602924923
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span>  - yes, MedDispense is 'equivalent' to the V2 RGV (Give) message and MedAdmin to the V2 RAS (Administration) message.  However, in the V2 workflow there are separate places in the message (segments) to capture the 'originally ordered' drug (e.g. ORC or RXO, and the specific drug \"to be given\" (RXG, with optional RXG.25 barcode id) and then the actual instance given (RXA and/or RXCs for bases and additives).   The question I have with the FHIR 'current state model' is that as the medication workflow transitions from one state to another, does the same Medication resource get used (i.e. instance stored in FHIR server) or is there a unique instance stored with (typically more) precise identification as it steps through the Med workflow?</p>\n<p>BTW, I didn't state this explicitly but I'm referring to an inpatient Med workflow.</p>",
        "id": 213653373,
        "sender_full_name": "John Silva",
        "timestamp": 1602943340
    },
    {
        "content": "<p>MedDispense is the same as RGV AND RDS if it is about \"here's the medication\"</p>",
        "id": 213655379,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602946158
    },
    {
        "content": "<p>technically, I think Dispense is best suited to replace RDS</p>",
        "id": 213655391,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602946186
    },
    {
        "content": "<p>if RGV means \"give this one now and this one later\", then it's a MedRequest with intent=instance-order</p>",
        "id": 213655451,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602946249
    },
    {
        "content": "<p>To your question John, yes you can have a different FHIR Medication for the one prescribed to the one dispensed.</p>",
        "id": 213656045,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1602947202
    },
    {
        "content": "<blockquote>\n<p>The GTIN number (which is a product code) uniquely identifies a (kind of) trade item, one with unique characteristics.</p>\n</blockquote>\n<p>You can say that an NDC code uniquely identifies a trade item and we put it in Medication.code.  If you are going to make the argument that you did, then I will gladly point people to put the GTIN in the Medication.code.</p>",
        "id": 213656752,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1602948344
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20Resource.20Scope/near/213639490\">said</a>:</p>\n<blockquote>\n<p>Use case(just to make Craig hapy <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>  ): </p>\n<ol>\n<li>A covid vaccine is scanned upon arrival to the pharmacy. The system captures a serial number<em>(, and knows it is unique because it is a serial number)</em>.</li>\n<li>In another part of the country, another covid vaccine is scanned, with a same serial number. This other system captures a serial number<em>(, and also knows it is unique because it is a serial number)</em>.</li>\n</ol>\n</blockquote>\n<p>Jose -- your example should not happen... and if it did happen, it should throw a supply chain (GS1) exception. By definition -- no two items should have the same serial number. This is why, in my view, we're getting a bit arm-wavy when we talk about serial numbers on pharmaceutical items. To assign an individual serial # to every vial of vaccine coming off a production line just doesn't happen (in my experience, at least, when I was a supply chain advisor to Pharmacia and Upjohn). Pharmaceutical products are made in batch lot runs and it is essential to track the batch lot in case a recall is necessary. But there could be millions of doses produced out of the same batch lot production run. </p>\n<p>I'm starting to see the wisdom, however, of tracking serial numbers and lot numbers as separate elements in our FHIR resources. In many ERP products, there is only one data field (true for ObviousMRP and for JDE, for example) and the definition of a serial number is that it is a lot with only one member in it. But by tracking separate elements, we can tell that a serial number should be globally unique for the same GTIN and (as mentioned above) throw an exception if we ever find that this isn't the case.</p>",
        "id": 213670258,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1602967942
    },
    {
        "content": "<p>RE: re-using the same resource for two different purposes... I must admit my radar is going off, a bit. When the resource is fulfilling a master data management (MDM) purpose, then it is denoting a \"thing\" and we will be well-served to have the identifier somewhat following the \"part number rule\" -- if the form, fit or function changes, then we need a new identifier. But where the resource is associated with an event or transaction (e.g. MedicationDispense, or MedicationAdministration) then it makes more sense for the identifier to denote a unique transaction # or some similar event tracking ID. I'm sorry if I'm the only one who isn't following the plot... but it seems to me very unhelpful to conflate these two fundamentally different concepts.</p>",
        "id": 213670539,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1602968441
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span> thanks for catching this. The case is indeed for a falsified medicine check. It will likely happen, I'm afraid. We may or not be ready to tackle it.</p>",
        "id": 213676932,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602978562
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> yes, the GTIN is to me a product code. Even if it identifies uniquely a single concept. I'm arguing that \"uniqueness\" is not a good criterium.</p>",
        "id": 213676994,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602978628
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span> serialization is full of challenges - printing unique barcodes at the speed that machines produce the products is not easy. But it's a directive that we are aiming at. And some products need this</p>",
        "id": 213677027,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602978715
    },
    {
        "content": "<p>btw, other products do this serialization check - I can recall for example software license numbers, and guitar strings - he user is asked for a unique code. If the same serial number is seen twice, then something strange happened and triggers investigation.</p>",
        "id": 213677137,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602978848
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span> I may have missed your point on re-using the resource for master data and transactional aspects. <br>\nI think those are different concepts and indeed different resources (eventually also different resource types) would be best. <br>\nBut these resources  should remain somewhat aligned.<br>\nOne example: I have a use case where we need to say, in a prescription transaction, \"this is the product we should give; and btw, this is the product's relevant definition\".</p>",
        "id": 213677438,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602979286
    },
    {
        "content": "<p>(I just realized I summoned Derek 3 times, real fast)</p>",
        "id": 213677516,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602979357
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  I think it is interesting to note that a <strong>MedicationRequest</strong> for acetaminophen is not an order for a product (GTIN level)... it is an order for an active ingredient (ATC level). A <strong>MedicationDispense</strong>, however, will need to identify that it was Tylenol, and record the batch lot. It isn't clear to me what is expected of the <strong>Medication </strong>resource referenced by these two? It doesn't seem like it can be expected to be the <em>same</em> resource... can it? (and this is what I meant by MDM vs transactional resources)</p>",
        "id": 213679689,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1602982638
    },
    {
        "content": "<p>ATC is not a substance code, is a classification (it is not univocal). I'm aware that a request for acetaminophen is not a request for a specific GTIN. But you can have a medicationrequest for a specific GTIN. We are exploring this in depth for a few years (hence my reservations about some aspects of the current approach, but that is not the point here).</p>",
        "id": 213680312,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602983573
    },
    {
        "content": "<p>About the resources - I don't think the current Medication resource is incorrect here. It allows us to specify whatever attributes are needed to convey what is meant - with or without a brand name, or  with or without a lot number, depending on what you want to order or to register as dispensed. I actually favour a tighter integration between the master data and transactional resources - not because they are not separate concepts (they are and I try to underline that every chance I get) but because when specifying a product you need to use more than just a code.</p>",
        "id": 213680506,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602983866
    },
    {
        "content": "<p>The medication resource here is not how data should be persisted (really)  but a reasonable exchange form for \"specifying a product\"</p>",
        "id": 213680559,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1602983937
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> . I apologize for being slow to understand. As an example... would we expect to have a separate Medication resource for Acetaminophen... and another one for Tylenol regular strength (50 tab package), and another one for Tylenol regular strength (100 tab package), and one for Paracetamol extra strength (50 tabs) and Paracetamol extra strength (100 tabs), etc.? And if yes... which one would we expect to be identified in the MedicationRequest? (or do we believe it doesn't actually matter... cuz they're all, functionally, the same \"thing\"?)</p>",
        "id": 213687261,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1602994803
    },
    {
        "content": "<p>Derek, from what Jean was saying you would not necessarily have Medication resources sitting around for all those types waiting to be used in requests or dispenses. It didn't sound like Medication is intended for that sort of definition, and to be re-used over and over. You would at least have to clone them into an 'instance' Medication for each use. I think the idea is that you make one new for each event, and the definition is really only in the code (backed by NDC, SNOMED etc, possibly GTN, or even ATC). <br>\nMedication definitions can also be done in MedicinalProductDefintion, which could be pointed by the Medication (in lieu of a code), but that relationship doesn't exist at the moment (we have asked for it, but it was not allowed).<br>\nAlso to your point about ATC, drugs are not always prescribed by substance/active moiety. That is routine in hospitals, but in primary care (General Practice, family doctor) it is more common to prescribe at generic (or 'virtual') product level, with an actual product in mind but just not a specific manufacturer. Virtual product, actual product and substance based requests are all required, and all covered, I believe. This is the continuum of \"specificity\" that has been mentioned earlier in the thread.<br>\nI don't think that \"ATC is not a code\". If that degree of specificity is good enough for the context of the request, I see no reason why you can't request that and have a qualified dispenser turn that into an appropriate actual product. It's common to have lists of moieties to pick from (e.g. UK VTM, virtual therapeutic moiety, which is similar in concept to ATC, just more integrated with the product list).</p>",
        "id": 213700096,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603016740
    },
    {
        "content": "<p>ATC is not a product code. It is a classification code. epSOS tried to use ATC as a code for prescribing but the result was clear</p>",
        "id": 213701688,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603019384
    },
    {
        "content": "<p>VTM identifies one moiety so it is a product code. I believe the starting point for openMedicine was that some products have 0 ATC categories, some products have more than one ATC category.</p>",
        "id": 213701766,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603019508
    },
    {
        "content": "<p>ATC is not a GOOD terminology/classification because a...</p>",
        "id": 213701814,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1603019549
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span> in the case you mention, you'd have one resource instance for each of the concepts you describe</p>",
        "id": 213701825,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603019581
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> As you said</p>",
        "id": 213701829,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1603019587
    },
    {
        "content": "<p>In other words, Its codes are lack  of uniqueness.</p>",
        "id": 213701880,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1603019691
    },
    {
        "content": "<p>~ a VTM identifies one moiety so it is a product code.<br>\nThat's not correct, by what I consider the normal definition of a product.<br>\nMany products can share the same moiety (and so VTM, at least in the systems that I'm aware of), including many virtual products - for instance solid and liquid forms. <br>\nA VTM is a moeity/substance code, not a product code.<br>\nThe fact that a moiety can be in more than one part of ATC, doesn't mean than an ATC code (which is made more specific by moeities being non-unique, not less) cannot express the desired concept of the request. But we have already established that there are better moiety level code systems for prescribing.</p>",
        "id": 213703100,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603021909
    },
    {
        "content": "<p>A product is not a trade item, perhaps that is what is what makes you disagree.? But in any case conflating vtm - a concept identifier - with ATC is not correct</p>",
        "id": 213703500,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603022636
    },
    {
        "content": "<p>I'm just saying that there are multiple products for paracetamol VTM.</p>",
        "id": 213703606,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603022796
    },
    {
        "content": "<p>I agree with that</p>",
        "id": 213703670,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603022932
    },
    {
        "content": "<p>There are also many concepts of product. For me VTM is another - but I can correct that statement if it helps. A VTM is a concept and has an identifier (or code, as you want). And ATC is a classification. We don't order by ATC</p>",
        "id": 213703775,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603023124
    },
    {
        "content": "<p>A VTM is not another concept of a product by any useful definition of a product in this space. <br>\nWe should not equate products and moieties/substances.</p>",
        "id": 213704296,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603024101
    },
    {
        "content": "<p>\"by any useful definition of a product\" is a strong statement. I think you mean by your definition of a product - which is not agreeable to me. Anyway I corrected my statement to reduce the gap from my side.</p>",
        "id": 213706179,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603027303
    },
    {
        "content": "<p>We can discuss if any other abstraction is a \"product\". We can discuss all that but I think it's rather useless</p>",
        "id": 213706246,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603027411
    },
    {
        "content": "<p>Thanks, all. The idea that the <strong>Medication</strong> resource wasn't an MDM resource hadn't occurred to me; that represents a bit of an \"a-ha\" moment for me, <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> . <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>  So... the <strong>Medication</strong> resource can be used as a \"scratch\" resource, and articulated at whatever degree of specificity is required <em>at the time it is being used</em>... but you wouldn't necessarily have a requirement that there was referential integrity back to a cardinal set of pre-defined <strong>Medication</strong> resources. Do I understand this correctly??</p>",
        "id": 213723773,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603052469
    },
    {
        "content": "<p>I did ask for Medication to contain a link to MedicationKnowledge for that referential integrity - like we have for Device to DeviceDefinition.</p>",
        "id": 213723959,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603052702
    },
    {
        "content": "<p>(MedicationKnowledge is the \"MedicationDefinition\" resource I'd use for MDM - see the <a class=\"stream\" data-stream-id=\"179221\" href=\"/#narrow/stream/179221-catalogs\">#catalogs</a> stream)</p>",
        "id": 213724067,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603052821
    },
    {
        "content": "<p>and btw, I believe that is the trigger of this discussion - my opinion is that in a vaccine you should not only have the code, but a possible relation to the Master Data</p>",
        "id": 213724151,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603052896
    },
    {
        "content": "<p>There is no need for a Medication resource to exist in abstract, that is then referenced later on when activity happens. The integrity is to the definition of the medication, which is the code. The medication definition concepts are in the terminology. <br>\nIf a resource is needed for a definition, then that would be to a MedicinalProductDefinition. MedicationKnowledge is not intended for that I believe, but for extra information <em>about</em> the medication. e.g. for decision support.</p>",
        "id": 213724153,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603052896
    },
    {
        "content": "<p>(There's obviously a disagreement here between me and Rik on the resources to use, and the reference between resources. Nothing that can't be resolved with some dialog)</p>",
        "id": 213724398,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603053167
    },
    {
        "content": "<p>the diagram on this page <a href=\"https://wiki.hl7.org/File:Resources_sketch.png\">https://wiki.hl7.org/File:Resources_sketch.png</a> shows the relation between the medication and the definition and the knowledge  that is part of the original resources definitions <a href=\"https://wiki.hl7.org/MedicinalProductDefinition_FHIR_Resource_Proposal\">https://wiki.hl7.org/MedicinalProductDefinition_FHIR_Resource_Proposal</a></p>\n<div class=\"message_inline_image\"><a href=\"https://wiki.hl7.org/File:Resources_sketch.png\"><img src=\"https://wiki.hl7.org/File:Resources_sketch.png\"></a></div>",
        "id": 213724424,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603053221
    },
    {
        "content": "<p>So... <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> , that's one of the main things I'm concerned about. If there is not an accepted and consistently-used level of specificity in the MedicationRequest... how do we do CDS on it... such as drug-drug interactions, etc.? I'm working on a number of Computable Care Guidelines projects... and we need this to be nailed down or it won't work...</p>",
        "id": 213724475,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603053244
    },
    {
        "content": "<p>I can understand the concern Derek, but what is not accepted or not consistently used?</p>",
        "id": 213724497,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603053296
    },
    {
        "content": "<p>It is normal that there is different specificity as you go from request to dispense to administration. And also possibly a switch from moiety/substance to product.</p>",
        "id": 213724567,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603053369
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span>  A PlanDefinition resource related to guideline-based medication recommendations (and the workflow associated with these) will need a degree of consistent specificity so that the plandefinition.action.condition statement can be correctly evaluated. Including to just be able to tell whether a prescription already exists (and so another need not be created). Stuff like that...</p>",
        "id": 213724667,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603053506
    },
    {
        "content": "<p>if it is different every time... it will be nigh impossible to define \"condition\" statements that will correctly evaluate to TRUE when they should evaluate to TRUE... and that can have some pretty dire patient safety implications... <span aria-label=\"rolling eyes\" class=\"emoji emoji-1f644\" role=\"img\" title=\"rolling eyes\">:rolling_eyes:</span></p>",
        "id": 213724755,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603053632
    },
    {
        "content": "<p>(and I know it is different all the time, in practice, today... but the whole role of the computable care guidelines is to try to reduce medical errors and coalesce clinical behaviours around systematic guideline-adherent care... so this use case isn't intended, necessarily, to accommodate a status quo that is demonstrably not patient-safe... it is intended to change it) <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 213724858,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603053810
    },
    {
        "content": "<p>ok well that is wider than this prescribing pattern we are discussing. <br>\nYou would need to look for a MedicationRequest for a Medication that included the medicine you were interested in. (or a dispense or administration possibly). The complication is that you may need to transform from product to moiety. <br>\nThat is just a general problem with guidelines however, not a consequence of this FHIR representation. The GP system I did in 1995 had this same issue with our decision support guidelines. <br>\nYou need a terminology that allows you to ask for \"paracetamol\" and find all the products (branded and unbranded), all the packs, forms etc and any substance based scripts (we didn't have that last issue in primary care however). This problem will be familiar to anyone making guidelines I think.</p>",
        "id": 213724987,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603053994
    },
    {
        "content": "<p>we're working with WHO and trying to develop <strong>computable </strong>care guidelines (CCGs) that can be leveraged to operationalize WHO's care guidelines for ANC or HIV and so on. as you would imagine... there are no \"brands\" referred to in WHO's guidelines. (hence my reference to ATC codes... since that seems to be about the level of the recommendations... i.e. for active ingredients). i've also been taking a cue from what's defined in the IPS regarding their profile of <strong>Medication (IPS)</strong> (which mandates either ATC or SNOMED in  medication.code).</p>",
        "id": 213725257,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603054393
    },
    {
        "content": "<p>Bottom line is that this variation of specificity exists in the real world of prescribing. FHIR allows you to capture it fully. Guidelines need to work with the real world. FHIR enables that.</p>",
        "id": 213725277,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603054436
    },
    {
        "content": "<p>If your guidelines don't know about brands, but your prescriptions do (most won't in fact, but a few may), then you would need a way to map brands to generics. That is common in drug terminologies. <br>\nAlso if your guidelines know about substances (in ATC) but your prescriptions don't (as in primary care) or do (secondary care) but its not coded in ATC, then you need maps there too. You need product to moiety/substance maps, and ATC to whatever substance codes are used maps. Again, medications terminology commonly does both of those. You can also represent that in MedicinalProductDefinitions if you want.</p>",
        "id": 213725635,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603054907
    },
    {
        "content": "<p>Medication is going to be used in a few ways:</p>\n<ul>\n<li>most commonly as a 'contained' resource where a MedicationRequest, MedicationDispense, etc. needs to convey details about a particular medication beyond just the code (ingredients, lot number, whatever)</li>\n<li>as a resource serving as some sort of 'formulary' entry representing medications available for ordering, dispensing, administering.  Typically these won't have lot number/expiry date/identifier information on them, though they could.  The registry indicates what's (typically?) allowed to be ordered/dispensed/administered.</li>\n<li>as a resource serving in some sort of inventory management system, typically only referenced by MedicationDispense and MedicationAdministration that refers to what's actually on hand and available.  The dispensing system might also 'generate' identified Medication instances when it spits out unit-dose containers for transport to the ward, and eventually to the patient room</li>\n</ul>",
        "id": 213730164,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603061299
    },
    {
        "content": "<p>For the first two uses, you'll have hundreds or thousands of MedicationRequest/Dispense/Administration instances (for a wide variety of patients) all referring to the same Medication instances.  For the last, you'll have fewer, though if the instance is only specific to the level of 'lot', you could still have many resources referring to the same instance (because the instance doesn't represent a single pill, it instead represents \"a pill from one of the bottles that arrived in shipment A\").</p>",
        "id": 213730247,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603061451
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span>  I'm not sure I understand your concern about CDS on MedicationRequest.  Alert checking is done today whether the drug is prescribed at the level of Amoxicillin or Amoxicillin 250mg or Amoxicillin 250mg capsule or Teva-Amoxil 250mg Capsule.  The Drug Knowledge Base vendors such as First DataBank or Multum have relationships back and forth between different levels of the drug hiearchy.</p>",
        "id": 213730783,
        "sender_full_name": "Melva Peters",
        "timestamp": 1603062262
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>  -- the concern related to CDS is related to expressing computable care guideline (CCG) \"condition\" statements (plandefinition.action.condition) that should fire TRUE when, for example:<br>\n  **pregnant mum's BP is above a threshold level X<br>\n  AND<br>\n  BP med is not already prescribed<br>\n**<br>\nIf there isn't a clear way to tell what the <strong>medication </strong>resource for this BP med is, then there isn't a clear way to tell whether a medicationrequest for this med already exists. Also -- I appreciate that there may be vendor products that figure all of this out -- but if I can't make it work <strong>without</strong> these products, then I will need to know to mandate them for the MOHs in low  and middle income countries (LMIC) where I'm providing advisory services. I was looking for a way to do this in a FHIR-based HIE... and trying to sort out what data needed to be where in order to operationalize CCGs. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 213731196,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603063037
    },
    {
        "content": "<p>Decision support will almost always drive off the Medication.code, not the Medication instance.  There'll be <em>lots</em> of Medication instances that share the same code (or express the medication concept at different levels of granularity).</p>",
        "id": 213731247,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603063135
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192166\">Jean Duteau</span> <a href=\"#narrow/stream/179166-implementers/topic/Medication.20Resource.20Scope/near/213656752\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>The GTIN number (which is a product code) uniquely identifies a (kind of) trade item, one with unique characteristics.</p>\n</blockquote>\n<p>You can say that an NDC code uniquely identifies a trade item and we put it in Medication.code.  If you are going to make the argument that you did, then I will gladly point people to put the GTIN in the Medication.code.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  -- I agree with you... but if we put GTINs (or their equivalent) in medication.code, then we will not be able to succeed re: CDS, I don't think. There's been a lot of discussion on what should go there, over the arc of this thread...</p>",
        "id": 213732180,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603064944
    },
    {
        "content": "<p>Lloyd, why would your first bullet mean \"you'll have hundreds or thousands ... all referring to the same Medication instances\". <br>\nIf contained, they cannot be the <em>same</em> medication instance? Would all your thousands be for your second bullet?<br>\nAlso, Jean seemed to be saying that Medication was not expected to be a purely definitional thing (a list of medications to be referred to), and the definitional aspect was only a \"less-to-more specified\" thing. That sounded like the formulary use was not in scope (despite what I had thought before). <br>\nPerhaps that was only referring to definitions within the \"instance\" use (request, to dispense) and not the \"pure definition\" use (formulary).</p>",
        "id": 213732227,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603065004
    },
    {
        "content": "<p>Derek, why would having a GTIN in the code would be limiting for CDS? As long as you can know things about the GTIN and its relation to other products, substances etc, you can reason about what things people are taking. It makes no difference what sort of code it is.</p>",
        "id": 213732287,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603065126
    },
    {
        "content": "<p>Rik, if a terminology service was there that could somehow map the GTIN to the code used to express the business rule, then I guess it would work. Is that what you're thinking?</p>",
        "id": 213732443,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603065374
    },
    {
        "content": "<p>Yes. That is exactly what drug terminology does.</p>",
        "id": 213732459,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603065430
    },
    {
        "content": "<p>The GDSN in Canada, as I understand it, maps GTINs to ATC codes. So each CDS rule would go thru the drug terminology mapper to see if the rule should fire TRUE or not. Like that?</p>",
        "id": 213732483,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603065484
    },
    {
        "content": "<p>You can go from general to specific, product to substance etc. It does depend how good the maps are. But the main ones in use very much do do that sort of thing. <br>\nWhat is in place for GTINs now I have no idea. But if they are to be useful at all they will need that. So, yes to your last question, like that.</p>",
        "id": 213732523,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603065575
    },
    {
        "content": "<p>If we were designing for a \"green field\" -- are there simplifications that could be reasonably made? In many LMIC environments, our opportunity is to help formalize \"best care practices\" through the application of the digital health solutions (similar to how ERP systems became instruments of business process re-engineering back in the 1980s, for those that might recall those days). Any thoughts??</p>",
        "id": 213732722,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603065850
    },
    {
        "content": "<p>I have the voice of one of my Engineering profs ringing in my ears: \"the art of design is to cast the problem in such a way that it lends itself to being solved\". <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 213732736,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603065897
    },
    {
        "content": "<p>Green field of electronic prescribing? Green field of prescribing in general? Everyone prescribes the same way? Or green field of guidelines? Several of those ships already sailed :-)</p>",
        "id": 213732818,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1603066022
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> Right.  I mis-spoke in referring to thousands pointing to contained Medications - only the containing resource would point to it.  </p>\n<p><span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span> The terminology service and/or the CDS engine would need to be able to perform subsumption testing on the basis of the GTIN.  But if GTINs are being captured, then I'm pretty sure someone somewhere has a mapping between those and the knowledge-base codes more typically used for drug-drug, drug-allergy and other CDS functions.</p>",
        "id": 213733329,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603066973
    },
    {
        "content": "<p>The WHO's ANC guidelines recommendation C.5 states:<br>\n–– If a pregnant woman has not previously been vaccinated, or if her immunization status is unknown,<br>\nshe should receive two doses of a tetanus toxoid-containing vaccine (TT-CV) one month apart with<br>\nthe second dose given at least two weeks before delivery. Two doses protect against tetanus infection<br>\nfor 1–3 years in most people. A third dose is recommended six months after the second dose, which<br>\nshould extend protection to at least five years.<br>\n–– Two further doses for women who are first vaccinated against tetanus during pregnancy should be<br>\ngiven after the third dose, in the two subsequent years or during two subsequent pregnancies.<br>\n–– If a woman has had 1–4 doses of a TT-CV in the past, she should receive one dose of a TT-CV during<br>\neach subsequent pregnancy to a total of five doses (five doses protects throughout the childbearing<br>\nyears).<br>\nIt would be useful to be able to have a <strong>medication order</strong> for this recommendation be completely consistent across <strong>all</strong> practitioners. And it would be equally useful if a woman's IPS <strong>medication statement</strong> were consistently expressed, too... so that the guideline could be readily evaluated and operationalized regarding subsequent administrations. That's the kind of thing I'm trying to accomplish. I think in some of these environments the re-engineering opportunity is there to improve the consistency (and quality) of how care is delivered. And if yes... how might we want to model the use of the medication, medicationrequest, medicationdispense and medicationadministration resources (and of course, the medication statement that is returned in the IPS).</p>",
        "id": 213733343,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603067025
    },
    {
        "content": "<p>In LMICs, my guess is there often wouldn't be a formulary function of what's allowed to be prescribed/available to be dispensed.  So in most cases, you'd probably be working with contained drugs.  As for what codes get captured, that tends to be national.  If there is no national terminology, then you'd probably be looking at using something like SNOMED (provided the country qualifies for a free license) and would need to look for mappings to the GTINs on the prescribing/administering side.</p>",
        "id": 213733410,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603067155
    },
    {
        "content": "<p>The IPS medication profile (<a href=\"http://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-Medication-uv-ips.html\">http://build.fhir.org/ig/HL7/fhir-ips/StructureDefinition-Medication-uv-ips.html</a>) indicates ATC or SNOMED code is to be denoted in the medication.code element. That's why it has been these trees that I've been barking up.</p>",
        "id": 213733412,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603067158
    },
    {
        "content": "<p>In LMICs it is common to leverage the WHO's guide to essential medicines: <a href=\"https://apps.who.int/iris/bitstream/handle/10665/325771/WHO-MVP-EMP-IAU-2019.06-eng.pdf?ua=1\">https://apps.who.int/iris/bitstream/handle/10665/325771/WHO-MVP-EMP-IAU-2019.06-eng.pdf?ua=1</a></p>",
        "id": 213733454,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603067198
    },
    {
        "content": "<p>The WHO list is, I think, the \"formulary\"...</p>",
        "id": 213733511,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603067302
    },
    {
        "content": "<p>We need to be clear that the IPS medication profile does not <strong>mandate</strong> the use of ATC or SNOMED CT for medication coding.  It does <strong>highlight</strong> the visibility of those two particular code systems, as they have potentially wide (although not universal in the case of SNOMED CT) availability and applicability.  This is done be by representing them as separate slices.  Each <strong>slice</strong> has a required binding to its particular code system (maybe that's where the confusion arises?), but the slicing itself is open - so IPS doesn't have any mandate for this and allows for <strong>any</strong> medication terminology to be used.  We would have liked to be able to be more prescriptive and push (or nudge) toward a recommendation for something that could approach global usability, but we didn't come up with a suitable way to do that at the present time.  We did consider at some length specifying IDMP (at various levels) here, but ultimately we backed away from that as the needed content for it to be useful at a prescribable or describable level doesn't yet exist.</p>",
        "id": 213734962,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1603069798
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> I've read, with interest, the epSOS D1.1 openMedicine report on gaps identified by ePrescribing pilot countries. It seems that there are challenges that remain... but also that there are approaches that look pretty promising. Is there a path that, in your view, LMICs could take to leverage SNOMED GPS and/or ATC to good effect to get basic ePrescribing working with the WHO's essential medicines as the national formulary?</p>",
        "id": 213737774,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603074303
    },
    {
        "content": "<p>That's a very good question, <span class=\"user-mention\" data-user-id=\"193307\">@Derek Ritz</span>.  Unfortunately, I don't think that the GPS will be of any help with this.  We didn't include medications in our submission for the IPS free set (one of the contributing sets for the GPS), and I don't think that anyone else has, either, so I don't believe that there is any medication content at all in the current GPS.  The problem with that idea is that there isn't really a way that know of to come up with a useful subset of the \"most common\" medications, or something like that.  To make it useful, especially for e-prescribing, you pretty much would need to have a code available for whatever medication any patient could be taking - and that's completely out of the scope of the current GPS idea.  That will only begin to have a chance to work if at some point SNOMED Int. decides to make <strong>all</strong> SNOMED CT descriptions available for free use - but even then if the relationships aren't free then that will seriously hamper the use for CDS that was being discussed earlier.  Looking otherwise at ATC, I don't know how far we might be able to get with that.  It's been pointed out in this discussion that ATC is a classification.  In my mind that doesn't necessarily mean in any way that it isn't potentially useful, including for the IPS.  But I suspect that its granularity isn't sufficient for e-prescribing, unfortunately - though I wouldn't entirely rule that out.  Since it can at least generally provide the generic drug names that are needed, maybe with sufficient additional support for the other prescription elements there could be a way to make that work?  I don't know.  So I still don't know what the answer is for this, but I'm very interested in continuing to help all of us work to figure out some solutions.</p>",
        "id": 213738826,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1603075937
    },
    {
        "content": "<p>Thanks, Rob. I'm happy to say that, on a cursory inspection, it does look like there is pretty good coverage of the WHO's list of essential medicines in the ATC. That's a start... and a good start, IMHO. Getting the basics up and running would make a huge and positive impact... and would usefully support the CCG (CDS) work. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 213739367,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603076777
    },
    {
        "content": "<p>And thanks for the catch... I read right past the fact that the SNOMED meds IPS code set (<a href=\"http://build.fhir.org/ig/HL7/fhir-ips/ValueSet-medication-snomed-uv-ips.html\">http://build.fhir.org/ig/HL7/fhir-ips/ValueSet-medication-snomed-uv-ips.html</a>) is licensed. Of course... it's a free license in LMICs... but it's still a license requirement that many get uncomfortable with since there will be steep fees once they \"graduate\" from LMIC status.</p>",
        "id": 213739472,
        "sender_full_name": "Derek Ritz",
        "timestamp": 1603076944
    },
    {
        "content": "<p>about codes vs categories:<br>\nsnomed|774587000  means Product containing only amoxicillin and clavulanic acid (medicinal product)<br>\nbut in atc <br>\natc|J01CR01 is ampicillin and beta-lactamase inhibitor</p>",
        "id": 213748278,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603090206
    },
    {
        "content": "<p>I think snomed wins here</p>",
        "id": 213748292,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603090223
    },
    {
        "content": "<p>This doesn't mean that you can't use ATC, but then you're stating that those above are equivalent?</p>",
        "id": 213749725,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1603091583
    }
]