[
    {
        "content": "<p>Hi, can you please make some recommendation how MedicationRequest resource can be used to represent both dosage and dispense information, assuming that the requirement is that the dispense information is potentially split into number of different size vials. <br>\nWe are currently thinking to use dosageInstruction field for dosage (prescribed dosage), which works good.<br>\nFor dispense information we were planning to use dispenseRequest field on MedicationRequest, but it's a 0..1 element and there is no good placeholder for vial size (there is only quantity which could indicate number of vials), so now I'm thinking I should be using MedicationDispense, which would be related to MedicationRequest via authorizingPrescription field.</p>\n<p>Is there a better way to do that?</p>\n<p>In MedicationDispense to represent number of different size vials which are used to fulfill the prescription I would need to have multiple MedicationDispense records - each for one vial size, vial size would be defined in dosageInstruction on MedicationDispense and number of those vials would be represented in quantity field. Is there a good way to relate those MedicationDispense records to each other (as they are part of single prescription)? Or would referring to single MedicationRequest suffice?</p>\n<p>Please let me know your thoughts.</p>\n<p>The example prescription which I would like to represent is in the attached image. <a href=\"/user_uploads/10155/U2TfxY-opSBMP15wuSe29JeB/image-9.png\">image-9.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/U2TfxY-opSBMP15wuSe29JeB/image-9.png\" title=\"image-9.png\"><img src=\"/user_uploads/10155/U2TfxY-opSBMP15wuSe29JeB/image-9.png\"></a></div>",
        "id": 253340543,
        "sender_full_name": "Krzysztof Wilczek",
        "timestamp": 1631662707
    },
    {
        "content": "<p>The medicationdispense resource can reference the medicationrequest through the authorizingPrescription field. As for the actual dispense, I'd reference a medication resource with the attributes. In this case, if it's two medications (or one medication with multiple dosages), I think it would make sense to have two medicationdispenses, each with their own medication (describing the vials)</p>",
        "id": 253340935,
        "sender_full_name": "Alex",
        "timestamp": 1631662987
    },
    {
        "content": "<p>I assume that the \"dispense in 2 vials\" is information to the dispenser on the original order?  If so, it needs to be in the MedicationRequest.  You can use the dosage to represent the dose and include dispense information in the MedicationRequest.dispenseRequest.  You will likely have to use the \"dispenserInstruction\" for that which is a note and give the quantity in the dispenseRequest.  You can't use MedicationDispense as that is what was dispensed and not what is ordered.</p>",
        "id": 253349030,
        "sender_full_name": "Melva Peters",
        "timestamp": 1631669108
    },
    {
        "content": "<p>thanks Melva, the problem is that MedicationRequest.dispenseRequest cardinality is 0..1 so I don't know how to describe to the dispenser that I need for example 2 vials 200mg and 2 vials 500mg</p>",
        "id": 253361200,
        "sender_full_name": "Krzysztof Wilczek",
        "timestamp": 1631680614
    },
    {
        "content": "<p>What do you put in medication[x]? <br>\nAre you prescribing by vial or by amount? </p>\n<p>If you prescribe by vial and have two vial sizes, you will need two instances of MedicationDispense. Unless you have a code for \"1 vial of 200ml together with 1 vial of 500ml\".</p>",
        "id": 253363018,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1631682402
    },
    {
        "content": "<p>If the code you have is for the drug with no information about vials, you could rely on the dispenser making a good choice based on the dosage information and a knowledge of the available vial sizes.</p>\n<p>Or you could use note.</p>",
        "id": 253363021,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1631682408
    },
    {
        "content": "<p>you should not use Dispense to represent \"what shall be dispensed\". the FHIR resource for \"dispense request\" or \"dispense instructions\" is the medicationrequest. I think the dispenserequest could be split from the medicationrequest, but if not, a cardinality change 0..* could be justified in this case.</p>",
        "id": 253371503,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631689545
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 253419157,
        "sender_full_name": "Melva Peters",
        "timestamp": 1631714612
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I could indeed change the cardinality in my custom profile, but I still don't know how to represent vial size in MedicationRequest.dispenseRequest - I only have quantity field there which would represent number of vials, but how to describe if it's 200mg or 500mg ?</p>",
        "id": 253479164,
        "sender_full_name": "Krzysztof Wilczek",
        "timestamp": 1631736461
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> , we have not used MedicationDispense till date - I think I would refer the specific medication in the medication[x] field, but per current requirements I need to pass the specific dispense instructions, not leave it to the dispenser - so I need to be able to pass what was captured in the sample form which I gave screenshot of - Quantity: 1 of 1200mg vial and Quantity 5 of 840mg vial</p>",
        "id": 253479608,
        "sender_full_name": "Krzysztof Wilczek",
        "timestamp": 1631736618
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"315833\">Krzysztof Wilczek</span> <a href=\"#narrow/stream/179166-implementers/topic/MedicationRequest.20dosage.20and.20dispense/near/253479164\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> I could indeed change the cardinality in my custom profile</p>\n</blockquote>\n<p>Actually you can't, because the base profile is 0..1. The idea to change to 0..* is for the Pharmacy WG - I think you could submit a Jira change request</p>",
        "id": 253479981,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631736762
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"315833\">Krzysztof Wilczek</span> <a href=\"#narrow/stream/179166-implementers/topic/MedicationRequest.20dosage.20and.20dispense/near/253479164\">said</a>:</p>\n<blockquote>\n<p>I still don't know how to represent vial size in MedicationRequest.dispenseRequest - I only have quantity field there which would represent number of vials, but how to describe if it's 200mg or 500mg ?</p>\n</blockquote>\n<p>I think you need to consider these as 2 different drugs. This is a prescription for 2 different products - one with 200, another with 500 mg</p>",
        "id": 253480128,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631736826
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"315833\">@Krzysztof Wilczek</span> <br>\nWhen I said </p>\n<blockquote>\n<p>If you prescribe by vial and have two vial sizes, you will need two instances of MedicationDispense. Unless you have a code for \"1 vial of 200ml together with 1 vial of 500ml\".</p>\n</blockquote>\n<p>I should have said <strong>MedicationRequest</strong> instead of <del>MedicationDispense</del>.</p>",
        "id": 253507034,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1631750345
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> it would be 2 MedicationRequests if you need to prescribe 2 different vial sizes, but in my experience prescriptions are not written at that level of specificity.  The prescriber includes the dose and then leaves it up to the pharmacist to determine how best to provide that.  If it is needed, I would suggest using the DispenserInstructions attribute in MedicationRequest.DispenseRequest</p>",
        "id": 253513222,
        "sender_full_name": "Melva Peters",
        "timestamp": 1631754816
    },
    {
        "content": "<p>I presume this would be a prescription after some \"encoding\" - indeed the prescriber will not usually enter that level of detail (sometimes they may) but there would be a different step to determine which products in detail would be adequate to fulfil the prescription. In most cases, though, this is not done explicitly.</p>",
        "id": 253599084,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631805615
    },
    {
        "content": "<p>One of the questions is whether you can suspend or cancel the prescription for one vial without making the same state change to both.  If the answer is 'no', then you'd have to wrap the MedicationRequests in RequestGroup.</p>",
        "id": 253621213,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631814332
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191759\">Melva Peters</span> <a href=\"#narrow/stream/179166-implementers/topic/MedicationRequest.20dosage.20and.20dispense/near/253513222\">said</a>:</p>\n<blockquote>\n<p>I agree with <span class=\"user-mention silent\" data-user-id=\"191682\">Richard Townley-O'Neill</span> it would be 2 MedicationRequests if you need to prescribe 2 different vial sizes, but in my experience prescriptions are not written at that level of specificity.  The prescriber includes the dose and then leaves it up to the pharmacist to determine how best to provide that.  If it is needed, I would suggest using the DispenserInstructions attribute in MedicationRequest.DispenseRequest</p>\n</blockquote>\n<p>we are working on the current version of FHIR 4.0.1, so there is no DispenserInstruction attribute available for us, we are capturing both dosage and dispense details on our enrollment form so requester is actually required to provide us the level of specificity up to a number of specific vials.</p>",
        "id": 253627646,
        "sender_full_name": "Krzysztof Wilczek",
        "timestamp": 1631816778
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"315833\">@Krzysztof Wilczek</span> I suggest that you add an extension for it using the same pattern as in the Current Build.</p>",
        "id": 253627767,
        "sender_full_name": "Melva Peters",
        "timestamp": 1631816824
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"315833\">@Krzysztof Wilczek</span> In my experience prescribers typically don't have any idea what size the vials come in.</p>",
        "id": 253627887,
        "sender_full_name": "Melva Peters",
        "timestamp": 1631816881
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , yes, if we'll go with multiple MedicationRequest approach then we would need to use Request group, but maybe I'll consider the DispenserInstruction field as an extension instead, or think about other extensions to cover my scenario. Introducing multiple MedicationRequests for different vial sizes, but for the same actual prescription (attribute dosageInstruction) will be confusing, and also in dispenseRequest attribute right now I don't have any place to store the actual vial size, only the quantity</p>",
        "id": 253628298,
        "sender_full_name": "Krzysztof Wilczek",
        "timestamp": 1631817030
    },
    {
        "content": "<p>The Netherlands have chosen for a model to separate therapeutic information from logistic information, having separate profiles / resource instances for what we call 'medication agreement' (prescriber therapeutic information in FHIR Resource MedicationRequest), 'dispense request' (prescriber logistic information in MedicationRequest), 'administration agreement' (pharmacist therapeutic information from FHIR resource MedicationDispense), 'medication dispense' (pharmacist logistic information from FHIR resource MedicationDispense). <br>\nSeparating therapeutic and logistic information has many advantages and makes it so much easier to track relevant changes in the medication treatment (which should be free of logistic information / not be clogged by the much more dynamic logistic information).</p>",
        "id": 253736543,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1631883022
    },
    {
        "content": "<p>The above discussion shows the utility of that approach: I think if \"DispenseRequest\" is covered by MedicationRequest, this should be profiled as such - we may not need a new resource for DispenseRequest, but the MedicationRequest should be in a form that can be profiled for that</p>",
        "id": 253737049,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631883269
    },
    {
        "content": "<p>Hi All, I have another question related to MedicationRequest.Dosage resource - can someone share with me some example or reference where dosageInstruction.doseAndRate would contain more than one element in the array? I'm wondering why cardinality of doseAndRate is 0..* instead of 0..1 - all the examples from here <a href=\"https://www.hl7.org/fhir/medicationrequest-examples.html\">https://www.hl7.org/fhir/medicationrequest-examples.html</a> seem to have only single element in doseAndRate array.</p>\n<p>Multiple dosages are possible by using sequence counter in Dosage, but the individual Dosages seem to always have only one doseAndRate.</p>\n<p>Am I missing something?</p>",
        "id": 263226608,
        "sender_full_name": "Krzysztof Wilczek",
        "timestamp": 1638316794
    },
    {
        "content": "<p>We had a request to allow for different types of dose and rate.  If you look at the type binding you can see that calculated and ordered where two types of dose and rate that we were asked to support.</p>",
        "id": 263234762,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1638323234
    }
]