[
    {
        "content": "<p>Hi<br>\nAfter some advice of how people have modelled status changes on infusion items ? (if anyone has?)<br>\nAn infusion item is a one where each dose (typically an injectable liquid) is administered to a patient over an extended period of time.  Only when the infusion is ended is the event considered to be finished.  This is unlike other common administrations, such as for oral tablets where the event is considered as and finished (and started as a single action) immediately as the dose is swallowed.  Generally infusions can be distinctly recorded as begun and then completed as two separate actions with separate timestamps.  In addition there are various other actions that are supported, such as change of infusion rate, pause infusion, resume infusion,  complete infusion.</p>\n<p>We would like to record these changes and are thinking about using the PartOf element to capture this</p>\n<p>id                                   PartOf                 Status                                        effectiveDateTime <br>\n600000054903                                        stopped         (Stop)                 2021-09-30 14:13</p>\n<p>INF-600000010428    600000054903    in progress (Began) 30/09/2021 14:13    <br>\nINF-600000010429    600000054903    in progress (Change Flow)   30/09/2021 14:24    <br>\nINF-600000010431    600000054903    On Hold (Pause)                30/09/2021 14:41 </p>\n<p>Has anyone else had to model something similar/used part Of within Med Admin ?</p>",
        "id": 256047277,
        "sender_full_name": "Leonie Bedford",
        "timestamp": 1633349319
    },
    {
        "content": "<p>Normally each adjustment is treated as a distinct MedicationAdministration.  I.e. There'd be one 'administration' from start to rate change, one from rate change to on-hold, and one from off-hold to completion.  If you wanted to group them, I guess you could - with no details about rate.</p>",
        "id": 256067060,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633357400
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"401745\">@Leonie Bedford</span> yes, IHE MMA has done that analysis some time ago</p>",
        "id": 256087460,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1633364730
    },
    {
        "content": "<p><a href=\"https://www.ihe.net/uploadedFiles/Documents/Pharmacy/IHE_Pharm_Suppl_MMA.pdf#page=20\">https://www.ihe.net/uploadedFiles/Documents/Pharmacy/IHE_Pharm_Suppl_MMA.pdf#page=20</a></p>",
        "id": 256087759,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1633364816
    },
    {
        "content": "<p>starting from point-in time administrations, to more interesting change of flow rate, change in saline bags, etc.</p>",
        "id": 256087878,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1633364852
    },
    {
        "content": "<p>The approach taken is like <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> suggests - you can send the detailed administration intervals as well as a overall administration.  The details contain lot numbers, detailed rates, etc. The overall administration (of which the others are a partOf) contains a summary (total amount administered, start time, end time)</p>",
        "id": 256088312,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1633364981
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"401745\">@Leonie Bedford</span> IHE is going to republish this as a proper FHIR IG, and I would be happy to hear feedback</p>",
        "id": 256109473,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1633372496
    }
]