[
    {
        "content": "<p>IHE is starting to work on a Medication Record profile - basically promote exchange of raw data, not a purpose-specific summary of a patient's medication.<br>\nI have one pending doubt (for now): To me, the \"raw\" ingredients are: </p>\n<ul>\n<li>prescribed meds</li>\n<li>actually dispensed meds</li>\n<li>administered/taken meds</li>\n<li>post-admin (reactions to meds) <br>\n(* possibly more stuff)</li>\n</ul>",
        "id": 184644888,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577964924
    },
    {
        "content": "<p>Now I'm learning to fit MedicationUsage in there.</p>",
        "id": 184644896,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577964936
    },
    {
        "content": "<p>MedicationUsage is not a raw ingredient of the medication process, it is more on the metadata level - \"someone says the patient is taking /has taken /did not take this drug\" - this is a summary of a supposed administration.  I can also make a statement of dispenses, or a statement of a prescription...</p>",
        "id": 184644907,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577964951
    },
    {
        "content": "<p>Can I ask for input and thoughts on this?</p>",
        "id": 184644909,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577964955
    },
    {
        "content": "<p>What about the purpose for that particular medication? Is that considered \"medication usage\"? If a patient has multiple chronic illnesses, it is nice to know which ones are to address their heart disease, kidney disease, diabetes,sleeping problems, etc. This would be helpful to the patient and care givers. I realize that we can't get the data if it is not first captured by the source. I don't recall that being captured in an EHR but it would be nice to have that in the future.</p>",
        "id": 184663799,
        "sender_full_name": "Debi Willis",
        "timestamp": 1577982731
    },
    {
        "content": "<p>Yes, good point. I think we will start on \"treatment\" level (one level higher than medication), and treatment will have all of those above and the purpose . Purpose of treatment is usually embedded under the prescription, but it should be a higher level.<br>\nFor example if someone takes a drug for one purpose and then takes another drug for another purpose, these are two treatments, each having prescriptions, dispenses etc.</p>",
        "id": 184666941,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577985231
    },
    {
        "content": "<p>I totally agree with <span class=\"user-mention\" data-user-id=\"225094\">@Debi Willis</span> on this.  (Well, I agree with her on pretty much everything.)  As just one example, the \"indication\" for the med (reason for prescribing) is essential in the first clinical encounter with a new provider, e.g. an emergency room. </p>\n<hr>\n<p>A guiding principle throughout FHIR should be that we have no IDEA what people on the patient side of the transaction will experience, need, and want to express in the record. (<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I've been meaning to say that out loud to you for years but I'm not sure I ever did.)  </p>\n<p>Plus, as open-minded and wonderful as we patient voices think we are :-), it's guaranteed that other people don't think like us, in ways we can't even anticipate. We should leave the door WIDE open for people to record whatever meta-info they find relevant.</p>\n<p>Example: when managing a difficult case, which might be starting to destabilize, it's normal (with or without HCP participation) to pause a med, modify the dosage, etc; and, just as with the original indication, we need a way to note the reason for the change.  </p>\n<p><strong>App developers take note:</strong> make it easy for a stressed family to record such things!  If it's ANY burden to do so, it will fall off the list and not get done!</p>\n<p>[This is sharp-edged and real for me because there is a live episode of this sort happening in my extended family right now, through the holidays. People's lives have been rearranged to deal with it.]</p>",
        "id": 184667672,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1577985815
    },
    {
        "content": "<blockquote>\n<p>We have no IDEA what people on the patient side of the transaction will experience, need, and want to express in the record</p>\n</blockquote>\n<p>Thanks, that is it.</p>",
        "id": 184668330,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577986315
    },
    {
        "content": "<p>When we started this \"crazy\" idea some years ago, it really felt like swimming upstream. People were asking \"what do you want to do with the medication information\" and when I said \"We don't have to know\" the natural reaction was \"ok then we have to find out that first\"... years lost in debates.</p>",
        "id": 184668446,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577986400
    },
    {
        "content": "<p>For example I debated that YES we must keep track of administrations if that is convenient, because that may not be in the radar for an ER doctor, but that may be very useful to deal with effectiveness of antibiotics (if you skip a few doses for example).</p>",
        "id": 184668460,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577986412
    },
    {
        "content": "<p>Jose, are you saying that right now we can get all the medications that were prescribed for a particular treatment? Where would we find that in the FHIR data? Or are you saying \"Let's brainstorm about what a patient might want\"?</p>",
        "id": 184668545,
        "sender_full_name": "Debi Willis",
        "timestamp": 1577986471
    },
    {
        "content": "<p>we should be able to get all the medications prescribed/dispensed/taken (like otcs) for a particular treatment. Today in FHIR you can get those for prescriptions.</p>",
        "id": 184668608,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577986541
    },
    {
        "content": "<p>but we do have some work to do.. treatments can be with several drugs, and MedicationRequest only deals with one drug at a time.</p>",
        "id": 184668685,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577986595
    },
    {
        "content": "<p>At this moment I am trying to see how the information model will look like so that we can capture all that information.</p>",
        "id": 184668761,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577986658
    },
    {
        "content": "<p>That is good to know. I would love to know more about where that information can be found currently and also happy to help with your needs. This is one of the reasons the Patient Empowerment Workgroup was formed... to help answer these types of questions. </p>\n<p>How would you like to start? Do you want to put together the information you currently have plus the questions you need answered...and then join a call with the  PE workgroup to get help moving this forward?</p>",
        "id": 184669059,
        "sender_full_name": "Debi Willis",
        "timestamp": 1577986910
    },
    {
        "content": "<p>I think since this is started in IHE (which makes it easier for me, because the work item is approved), I can start drafting the model and before IHE publisher we can look at it together. I'd be grateful for the PE review and input.</p>",
        "id": 184669972,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577987614
    },
    {
        "content": "<p>First step seems to be making an information / logical model. Then I can share that and we work together.</p>",
        "id": 184670044,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577987650
    },
    {
        "content": "<p>If i had my wishes answered, i would also love to get a description of the medication along with the drug name (blue oval with \"B\" imprint) or a link to a pill identifier.  People often mix up their meds and take too much or too little of a drug because they don't know what the pill looks like...then end up in the emergency room.</p>",
        "id": 184670064,
        "sender_full_name": "Debi Willis",
        "timestamp": 1577987672
    },
    {
        "content": "<p>that wish is granted intrinsically in FHIR.</p>",
        "id": 184670111,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577987697
    },
    {
        "content": "<p>:)</p>",
        "id": 184670147,
        "sender_full_name": "Debi Willis",
        "timestamp": 1577987729
    },
    {
        "content": "<p>Medication can link to medicationKnowledge. I don't think that whole thing is solid, but we can use this work item to help validate the FHIR design,</p>",
        "id": 184670156,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577987740
    },
    {
        "content": "<p>Yes! We are here to help when you are ready.</p>",
        "id": 184670248,
        "sender_full_name": "Debi Willis",
        "timestamp": 1577987783
    },
    {
        "content": "<p>so, it works, but I do not know if it works well, but we can check together by bringing that use case to the medicationrecord (\"in ER, patient is confused, says they take the pink tablets every morning\")</p>",
        "id": 184670297,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577987827
    },
    {
        "content": "<blockquote>\n<p>Can I ask for input and thoughts on this?</p>\n</blockquote>\n<p>Why limit to prescribed meds?  Over-the-counters can have life-saving applications for some people and should <em>not</em> be discounted.  Consider asthma medications, for example.  Some people might be well controlled with Zyrtec, but in dire straights without their once-a-day pill.  </p>\n<p>At-home pharmacy kits and medicine cabinet inventory are obvious use-case for MedicationUsage records.  As are EMT kits and crash carts.  </p>\n<p>Also, where do we add medications that aren't the focus of the pharmaceutical industry?  What about herbals like valarian root or echinacea?  Pharmaceutical companies can't patent them, so they don't get put on the RxNorm list, but some health systems (such as the UK) literally have societies such as the The Worshipful Society of Apothecaries, who developed out of the Grocer's guild, and would count such herbals as grocery-medications.  </p>\n<p>Which brings us to a bunch of dietary intake and grocery shopping use-cases.  We see this more often with Social Determinants of Health projects right now and the FHIR NutrtionOrder resource, which primarily was designed with in-house hospital food service departments in mind.  But, again, in the patient context, has lots of applications with things like smart homes and smart appliances (i.e. feed your refridgerator or smart pantry with NutritionOrders and MedicationUsage records, to make sure you're stocked up on protein powder, valarian root, oranges, and HTP-5, or whatever).</p>",
        "id": 184672889,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1577990056
    },
    {
        "content": "<p>Put another way, the way the Medication resources are currently set up assume controlled substances by default, and are very profit/liability oriented and geared towards supporting pharmaceutical industry business models.  Patient centric approaches would include over-the-counter medications, groceries, nutraceutical, herbal supplements, etc.</p>",
        "id": 184673700,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1577990647
    },
    {
        "content": "<p>on Prescribed meds - Correct. Wou should have been there when we started - this was one of the debates that to me seemed an artificial scope boundary.<br>\nThe fact that we capture the prescriptions does not in any way limit the scope of a record to prescribed (or prescription-requiring) drugs.</p>",
        "id": 184675736,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577992193
    },
    {
        "content": "<p>I agree with everything <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> says.  At the same time, I fear an unmanageable explosion of scope, since when we zoom out to include SDOH, it's hard to maintain focus on the medication issues, right?</p>\n<p>I suspect that (aside from the money people who want to get their hands on our spending behaviors), our clinical reason for this in FHIR (the \"patient need use-case\"?) is to ensure that any provider or caregiver has the relevant status of <em>medicines and supplements</em>, sufficient to know what to keep an eye on, what to monitor, and what to review if new trouble arises.</p>\n<p>That sentence seems to cover the needs of the patient-side people &amp; the clinicians on the case.  It also makes clear that we (the patient empowerment group) do NOT want the data limited to what someone SOLD us, because history is full of stories where the prescribed meds were not sufficient to get the job done.  And our sole goal is to get the job done (take care of the sick person), not to document the commerce.</p>\n<p>What do y'all think about that?</p>",
        "id": 184682701,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1577998251
    },
    {
        "content": "<p>Re the importance of this: in the current episode in my extended family with a 90yo who fell 2 weeks ago (spent 2 nights in hospital), family has been very concerned about pt's extreme drowsiness since the hospitalization, not least because of risk of another fall.  (Nobody including the pt wants the pt to become unable to live independently!)</p>\n<p>After 10 days of worrying, TODAY they discovered at PCP visit that TWO newly prescribed meds have drowsiness / tiredness as a top side effect. Two meds prescribed by different docs. </p>\n<p>These are conscientious docs, but amid all the other stresses of transporting pt to/from various visits, the family (who are savvy and \"should know better\") didn't think to ask.  (There are ~6 concerning symptoms to be managed, and this is just one.)</p>\n<p>Lesson 1: <strong>Hooray</strong> for the PCP, who attentively reviewed everything. </p>\n<p>Lesson 2: For healthcare to achieve its potential, it's <strong>essential</strong> that we do what we can to enable patient/family participation in care management. A key way to do that is by making info available. <strong>It's foolish &amp; dangerous to put all the burden on the clinicians!</strong> Let patients help!</p>\n<p>Lesson 3: <strong>Put no limits on how much RAW DATA is made available</strong> to people and apps. As Tim Berners-Lee said in his 2009 TED (upthread here), if we want to get maximum value out of the data, don't just read someone else's interpreted subset!  </p>\n<p>Let brilliant / clever app developers figure out useful things to do with data. Don't decide in advance \"Nobody will probably ever need this.\"</p>",
        "id": 184692701,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1578007302
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  I like your list of raw info and agree that MedicationStatement/Usage is a statement. <br>\nOn the purpose of using a medication, MedicationRequest and MedicationUsage both have reason, which can be one or more Conditions.</p>",
        "id": 184700921,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1578018153
    },
    {
        "content": "<p>Indeed, Condition would be the starting point in FHIR, and of any problem oriented medical record. Patients will want to define / update their own active problem list, or at least jointly manage it with healthcare providers. Some emdications may be associated with 1 or more conditions, whereas other may not be linked to any condition at all, (e.g. over the counter drugs) but may be recorded to allow for the detection of contra indications. <br>\nA Dutch hospital I know of retrieve data about prescriptions / administrations from their own EHR, and from other provider organisations via the Dutch national infrastructure, create a Questionnaire for the patient to check which ones are still active and whether there any any others (a standard process prior to an inpatient admit). The Questionnaire Response is translated into MedicationUse. They don't have a link with conditions right now.</p>",
        "id": 184725740,
        "sender_full_name": "René Spronk",
        "timestamp": 1578049765
    },
    {
        "content": "<p>I think you might have MedicationRequest to cover both prescriptions but also \"planned meds\" - which could be used to capture a higher level therapeutic plan.  (You might also have CarePlan brought in for that too.)  In principle you could also have Observations that show levels of a medication in a patient - either as evidence for MedicationUsage instances or as stand-alone records.</p>",
        "id": 184751880,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578072957
    },
    {
        "content": "<p>In Atlanta I thought we settled for the \"treatment identifier\" to be a CarePlan.</p>",
        "id": 184753058,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578073829
    },
    {
        "content": "<p>MedRequest is only for one drug, so we need a higher level. I think CarePlan works well there</p>",
        "id": 184753088,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578073866
    },
    {
        "content": "<p>You might well have a mix of both.  MedRequest would cover the treatment plan for a single drug (including dose info).  CarePlan would organize those to an overall plan reflecting all drugs.</p>",
        "id": 184755165,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578075615
    },
    {
        "content": "<p>OK I will make a Logical Model.</p>",
        "id": 184761362,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578080328
    },
    {
        "content": "<p>(Making Logical Model is a New Year resolution, to start with good habits)</p>",
        "id": 184761428,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578080396
    },
    {
        "content": "<p>I will use a \"treatment\" which is for a purpose (which can have an explicit condition or not)</p>",
        "id": 184761521,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578080431
    },
    {
        "content": "<p>for that treatment we can have past, ongoing or planned meds (requests, dispenses, admins)</p>",
        "id": 184761543,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578080459
    },
    {
        "content": "<p>then I think we will have a separate block which is \"summarized information\" which corresponds to a MedUsage</p>",
        "id": 184761578,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578080499
    },
    {
        "content": "<p>I'll have to draft something, but I think this has legs</p>",
        "id": 184761587,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578080513
    },
    {
        "content": "<blockquote>\n<p>A guiding principle throughout FHIR should be that we have no IDEA what people on the patient side of the transaction will experience, need, and want to express in the record.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"197491\">@Dave deBronkart</span> it's a it hard to make a standard when you don't know what people want to say. I think you mean that we don't know what of the things people need to say in healthcare won't be needed by the patient</p>",
        "id": 184847471,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1578228241
    },
    {
        "content": "<p>I've been more thinking that \"At time of capture, we have no idea what uses will this data have, so we must capture it for what it means whwn it happens, not condition it for one of several possible uses\"</p>",
        "id": 184847636,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578228453
    },
    {
        "content": "<p>Data capture, validation, retention and sharing all have costs.  And data can be captured with variable precision.  What gets stored is always going to be driven by expected downstream usecases.  (And will be principally influenced by usecases that deliver direct or indirect value to whoever is doing the capturing.)</p>",
        "id": 184854154,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578240425
    },
    {
        "content": "<p>Yes, costs and risks. GDPR is not very friendly to \"let's store everything just because\". The thing is to capture the data without distorting it to a specific purpose.</p>",
        "id": 184855830,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578243282
    },
    {
        "content": "<p>in this example, capture prescriptions as prescriptions, not as lines in a summary \"presumed taken\".</p>",
        "id": 184855845,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578243324
    },
    {
        "content": "<p>too often we distort /truncate the raw data. I remember someone telling me that administrations were never useful because the physician does not look at it. That is part of the problem. If the patient can capture administrations, these should not be ignored. They can be used for adherence monitoring and treatment efficiency.</p>",
        "id": 184855933,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578243473
    },
    {
        "content": "<p>It is not just GDPR that regulations against collecting data with no purpose. This is fundamental in privacy regulations globally. Even in the USA. <br>\nNote that the patient themselves can collect all the data about themselves with no obvious or intended need or use. It is OTHERS that privacy regulations, and privacy principles, are against collecting data that is not needed for their specific purpose and authorization.</p>",
        "id": 184862626,
        "sender_full_name": "John Moehrke",
        "timestamp": 1578254811
    },
    {
        "content": "<blockquote>\n<p>I think you mean that we don't know what of the things people need to say in healthcare won't be needed by the patient</p>\n</blockquote>\n<p>Thank you for poking at that incomplete thought of mine.  What I should have said is more like this:</p>\n<blockquote>\n<p>A guiding principle throughout FHIR should be that we have no IDEA what people on the patient side of the transaction will experience, need, and want to express in the record<strong>, so we should never unnecessarily constrain what we make possible based on what we <em>think</em> they'll need.</strong></p>\n</blockquote>\n<p>Does that make more sense?</p>",
        "id": 184908821,
        "sender_full_name": "Dave deBronkart",
        "timestamp": 1578320012
    },
    {
        "content": "<blockquote>\n<p>Why limit to prescribed meds?  Over-the-counters can have life-saving applications for some people and should <em>not</em> be discounted.  Consider asthma medications, for example.  Some people might be well controlled with Zyrtec, but in dire straights without their once-a-day pill.  </p>\n<p>At-home pharmacy kits and medicine cabinet inventory are obvious use-case for MedicationUsage records.  As are EMT kits and crash carts.  </p>\n<p>Also, where do we add medications that aren't the focus of the pharmaceutical industry?  What about herbals like valarian root or echinacea?  Pharmaceutical companies can't patent them, so they don't get put on the RxNorm list, but some health systems (such as the UK) literally have societies such as the The Worshipful Society of Apothecaries, who developed out of the Grocer's guild, and would count such herbals as grocery-medications.  </p>\n<p>Which brings us to a bunch of dietary intake and grocery shopping use-cases.  We see this more often with Social Determinants of Health projects right now and the FHIR NutrtionOrder resource, which primarily was designed with in-house hospital food service departments in mind.  But, again, in the patient context, has lots of applications with things like smart homes and smart appliances (i.e. feed your refridgerator or smart pantry with NutritionOrders and MedicationUsage records, to make sure you're stocked up on protein powder, valarian root, oranges, and HTP-5, or whatever).</p>\n</blockquote>\n<p>There is nothing inherent in the Medication resources that restricts their use to pharmaceuticals.  In Canada, we use the Medication resources for Natural Products as well as Drug Products.  In all cases, the MedicationRequest and the MedicationUsage have a reason which can be used for deriving what products were used for what information.</p>\n<p>It has been my experience that clinicians are loathe to indicate the reason.  I have never really found out why but it seems that liability is one of the bigger reasons why they don't do this.  I suspect that this would be even more so for off-label uses of medications.  But that reason would be the place for indicating the purpose of the medication.</p>",
        "id": 185056027,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1578432023
    }
]