[
    {
        "content": "<p>Why doesn't the Medication resource have an identifier?<br>\nI can see many use cases, where a Medication might be referenced by it's common identifier (RxNorm in the US, PZN in Germany...) but since it doesn't have an identifier, it can't be referenced in this fashion...<br>\nIs there a reason behind this? I was under the impression that <strong>all</strong> DomainResourcen should have an identifier.</p>",
        "id": 153901129,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502283133
    },
    {
        "content": "<p>There is  medication.code</p>",
        "id": 153901130,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502283228
    },
    {
        "content": "<p>There is also a discussion to do changes to the medication the identifier(s) will likely be addressed (GTIN, PCID, PZN, UCD...) but unless it's for defining \"catalogs/formularies\", the medication.code is the one to be used.</p>",
        "id": 153901131,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502283346
    },
    {
        "content": "<p>In my usecase it's for defining catalogs :) I'd believe most Medication products make for pretty static Medication resources, so most of ther times, there's no point in maintaining them redundantly in every system and communicating the identifiers will in most cases be 'nuf said.</p>",
        "id": 153901143,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502286224
    },
    {
        "content": "<p>Isn't code sufficient? Or you think it is misplaced?</p>",
        "id": 153901144,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502286271
    },
    {
        "content": "<p>that is actually the idea behind the use of code: in clinical uses, you consider the code as static, and that is it.</p>",
        "id": 153901146,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502286391
    },
    {
        "content": "<p>AFAIK, there are two types of identifiers: the ones we see in many resources, which are mentioned as \"additional identifiers\" or \"business identifiers\"</p>",
        "id": 153901148,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502286439
    },
    {
        "content": "<p>and there is also the resource identifier itself (part of the metadata, it is there for all resources)</p>",
        "id": 153901149,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502286463
    },
    {
        "content": "<p>one example of a resource that has external identifier - perhaps this is what you are looking for - <br>\n{<br>\n  \"resourceType\": \"Device\",<br>\n  \"id\": \"f001\",<br>\n  \"identifier\": [<br>\n    {<br>\n      \"system\": \"http:/goodhealthhospital/identifier/devices\",<br>\n      \"value\": \"12345\"<br>\n    }<br>\n  ],...</p>",
        "id": 153901151,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502286605
    },
    {
        "content": "<p>I think this is about the business identifiers - \"id\" is out of scope here.</p>",
        "id": 153901152,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502286624
    },
    {
        "content": "<p>medication does not have the identifier, but has the medication.code.</p>",
        "id": 153901153,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502286629
    },
    {
        "content": "<p>I agree, <span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> , just want to expose the several ids. I am looking at catalogs and I think medication.code is the relevant attribute - but perhaps I am wrong</p>",
        "id": 153901154,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502286707
    },
    {
        "content": "<p>Basically, RXNorm, PZN etc. are Identifier systems. Every new product gets an identifier. So using code would be technically possible, but then the code system would have to be permanently updated.</p>",
        "id": 153901155,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502286714
    },
    {
        "content": "<p>If we would agree using code, it would also be required to maintain these identifying systems as code system (and value set)...</p>",
        "id": 153901156,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502286893
    },
    {
        "content": "<p>ok, this is where I am lost (my ignorance) - i believe all these code systems have a formal update process, or they can be assumed to have one.</p>",
        "id": 153901157,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502287036
    },
    {
        "content": "<p>and in some cases you can use the internal code sets</p>",
        "id": 153901158,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502287091
    },
    {
        "content": "<p>Not for a more or less public list of medications, obviously ;)</p>",
        "id": 153901159,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502287133
    },
    {
        "content": "<p>indeed. I guess I'm asking whether we would put PZN as an identifier, and InternalCode as a code.</p>",
        "id": 153901160,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502287259
    },
    {
        "content": "<p>i would hope not. I lack the semantics knowledge, but to me each of these values is a code (which we can use an identifier). So, technically, I see this as \"every new product gets a code, which is then possibly used as an identifier\". But again, my ignorance in these matters (codes/identifiers) is vast.</p>",
        "id": 153901162,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502287334
    },
    {
        "content": "<p>I am thinking that things that are \"more or less static\" are actually dinamic - slowly changing, but changing.</p>",
        "id": 153901163,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502287461
    },
    {
        "content": "<p>basically, for a code you need a well defined list of valid codes, while for an identifier, you only need a name space (aka NamingSystem), even if someone somewhere for sure maintains a a list of every identfying value that's ever been released.</p>",
        "id": 153901164,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502287526
    },
    {
        "content": "<p>if i read correctly, is this similar to \"if I use a code, then I have to make sure about that the code set i am using is well governed so that my code has the characteristics to uniquely identify what I mean, while for identifiers, i assume that this is done by definition, and i just have to say the value of the identifier, and the uniqueness/unambiguity is guaranteed\"?</p>",
        "id": 153901165,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502287740
    },
    {
        "content": "<p>is my rephrasing approximately correct?</p>",
        "id": 153901166,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502287755
    },
    {
        "content": "<p>in any case, is there any inconvenience to use a code instead of an identifier, in this case?</p>",
        "id": 153901167,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502287796
    },
    {
        "content": "<p>Right, that's the difference from an implementer's point of view. Terminologists of course would add a lot of other differences.</p>",
        "id": 153901168,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502288919
    },
    {
        "content": "<p>The inconvenience is that someone has to maintain the code system (including the CodeSystem resource) when using code ;)</p>",
        "id": 153901169,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502288979
    },
    {
        "content": "<p>enter Catalogs, where we want to exchange information like \"here are the products allowed for prescription in this hospital/department, for 2017\"</p>",
        "id": 153901170,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502289044
    },
    {
        "content": "<p>my assumption is that there is always this governance mechanism, even if we do not care for it.<br>\nAnd going to the point of Simone, if we have to use sometimes a code, sometimes an identifier, I would just stick to code.</p>",
        "id": 153901171,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502289105
    },
    {
        "content": "<p>That's probably the way to go, though you lose validation on the way.</p>",
        "id": 153901228,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1502291675
    },
    {
        "content": "<p>The thing is that with STU3, the logical references have been introduced to allow for the exchange of Artefacts that are known to both the sending and the receiving system by the same business identifier without having to explicitly bundle them into the document/message/whatever.<br>\n<a href=\"http://build.fhir.org/references.html#logical\" target=\"_blank\" title=\"http://build.fhir.org/references.html#logical\">http://build.fhir.org/references.html#logical</a></p>\n<p>This also comes in handy, if a system only knows a resource by it's identifier but has no additional information and doesn't want to create a resource instance just to hold the identifier.</p>\n<p>What I was missing before is that this kind of exchange is also possible for Medications by using the code element in the MedicationStatement instead of the reference. It just tripped me, that in this case, the mechanism is different even though the use case seemed consistent with what the logical reference is supposed to do.<br>\nBut as said, logical references don't work for Medication, as they rely on the identifier attribute. </p>\n<p>I'm not really sure right now if that is an issue or not. Is FHIR consistent with offering code as an alternative to reference, whenever a Resource points at a medication? I didn't check...</p>",
        "id": 153901321,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502297337
    },
    {
        "content": "<p>Oh. Here's one:<br>\n<a href=\"http://build.fhir.org/adverseevent.html\" target=\"_blank\" title=\"http://build.fhir.org/adverseevent.html\">http://build.fhir.org/adverseevent.html</a><br>\nIn this case, you couldn't just use the code of a Medication instead of a reference, and with logical reference out of the picture, you'd have to create an instance of Medication, even if all the information you know is just the code.</p>",
        "id": 153901322,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502297551
    },
    {
        "content": "<p>don't follow the logical reference bit, but indeed your point seems correct. you'd have to create an instance of medication.</p>",
        "id": 153901323,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502297792
    },
    {
        "content": "<p>now, questions: 1. Is that bad? you could create a contained resource (I don't mean this as a workaround, but as a design approach: you create a \"product\" and you say \"this is the thing that I am referring to, it is a medication, but I just know the code\".</p>",
        "id": 153901324,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502297855
    },
    {
        "content": "<p>There are 3 more:<br>\n<a href=\"http://build.fhir.org/catalogentry.html\" target=\"_blank\" title=\"http://build.fhir.org/catalogentry.html\">http://build.fhir.org/catalogentry.html</a><br>\n<a href=\"http://build.fhir.org/flag.html\" target=\"_blank\" title=\"http://build.fhir.org/flag.html\">http://build.fhir.org/flag.html</a><br>\n<a href=\"http://build.fhir.org/group.html\" target=\"_blank\" title=\"http://build.fhir.org/group.html\">http://build.fhir.org/group.html</a><br>\nbut I don't think there's a use case for logical references there, all te others resources referencing Medication use medication[x] with CodableConcept or Reference as type</p>",
        "id": 153901325,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502297872
    },
    {
        "content": "<p>2. If the medication gets redesigned to support that it can be as simple as containing only the code, wouldn't that help?</p>",
        "id": 153901326,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502297927
    },
    {
        "content": "<p>1. jep. bad. You can't search on contained resources, but you can search on reference.identifier. Medication Codes are definitely something you may want to be able to search on.</p>",
        "id": 153901327,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502297954
    },
    {
        "content": "<p>as for the catalogEntry, that is under construction. Which reminds me, catalog call starts now :)</p>",
        "id": 153901328,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502297954
    },
    {
        "content": "<p>Ah, ok. Then it may make sense to add an identifier. Is that your suggestion? an identifier that can simply duplicate /replace the medication.code?</p>",
        "id": 153901329,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502298043
    },
    {
        "content": "<p>As I said, I don't think a CatalogeEntry has a strong use case for logical references, I mean - what's the point of cataloguing Codes ...? You'd be basically making a CodeSystem. Oh wait, there's a resource for that :D</p>",
        "id": 153901330,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502298061
    },
    {
        "content": "<p>No, Actually right now I rather tend to making sure that wherever it makes sense, references to medication should allow either reference or CodableConcept.</p>",
        "id": 153901331,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502298124
    },
    {
        "content": "<p>CatalogEntry is a bit more fun than that. Listing products and their characteristics and relations</p>",
        "id": 153901332,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502298296
    },
    {
        "content": "<p>i assume you are referring to valueset, i will try to see if there is any overlap.</p>",
        "id": 153901333,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502298373
    },
    {
        "content": "<p>Maybe change AdverseEvent.suspectEntity.instance to AdverseEvent.suspectEntity.instance[x] with choice of CodableConcept or reference like here with item[x]: AdverseEvent.suspectEntity.instance  ...?</p>\n<p>Or just wait and see if anyone implementing AdverseEvent ever complains... :D</p>",
        "id": 153901334,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502298381
    },
    {
        "content": "<p>What I menat to say was that if all you know about the catalogue item is the code, your catalogue will be exactly the same amount of fun as a CodeSystem or ValueSet. So you are right: If the scope of the Catalogue is to list products <strong>and their characteristics</strong> then a logical reference to an item is pointless, hence no need to change anything.</p>",
        "id": 153901336,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502300008
    },
    {
        "content": "<p>indeed, if we have a catalog of a list of medications for which we only know the code, that is pretty useless waste of bandwidth. I will keep in mind to send you a first draft example of a catalog, when we have it</p>",
        "id": 153901339,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502300448
    },
    {
        "content": "<p>Hold on. Quoting Scope and Usage of Medication: \"The medication resource can be used to describe a compounded (aka extemporaneous or magistral) product that is manufactured by the pharmacy at the time of dispensing. In this case there will be multiple ingredients which are typically base chemicals (for example, hydrocortisone powder) and there may be other ingredients that are manufactured products (for example, Glaxal Base).\"</p>\n<p>In that case, the Medication wouldn't have a code, right? So how do you re-identify such a Medicaton instance across systems, if you don't have an identifier?</p>",
        "id": 153901343,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502300640
    },
    {
        "content": "<p>Yes, but i hope i mentioned before, there is some restructuring on Medication, to address exactly such examples.<br>\nmedicationResource can be an identifier (in the sense \"a data structure that identifies something) OR there may be a need to be a more descriptive set of data.</p>",
        "id": 153901344,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502300727
    },
    {
        "content": "<p>ok thanks, I was just worried that I accidentialy talked anyone out of the idea that adding an identifier was a good idea :D</p>",
        "id": 153901346,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502300983
    },
    {
        "content": "<p>I think one question will be if it is clear or it it can cause confusion - some  implementers using medication.code, others using identifier.</p>",
        "id": 153901349,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502301491
    },
    {
        "content": "<p>Most places where Medication is referenced, there should be a choice of CodeableConceot|Reference(Medication).  Identifiers are generally not used to define \"kinds\" of things.  If we were to have identifier on Medication, that would mean there was a barcode on each pill that was unique to that pill.  (And we may in the future actually get there - but for now that would definitely be extension territory.)</p>",
        "id": 153901365,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502311222
    },
    {
        "content": "<p>The closest we get is lot numbers.</p>",
        "id": 153901366,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502311232
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\n\"The medication resource can be used to describe a compounded (aka extemporaneous or magistral) product that is manufactured by the pharmacy at the time of dispensing\"<br>\nThey're not a \"kind\" , and they don't have codes.</p>",
        "id": 153901754,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1502393394
    },
    {
        "content": "<p>even in the case you describe, the Medication resource is describing the product prepared as a recipe, not the specific entity created at that moment.  If you included specific information about each dose entity (each tab, cap, suppository, ... not even sure the equivalent for a liquid) then you would have an entity and could use an identifier</p>",
        "id": 153901783,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1502396759
    },
    {
        "content": "<p>From what I am reading, I think the identifier would be on the \"instance\" while the codes are on the \"kind\", correct?</p>",
        "id": 153901784,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502396841
    },
    {
        "content": "<p>I still have to write down some ideas for the \"kind\" vs \"instance\" part, but an identifier on the instance could help also in the old discussions about RFIDs, barcode HRF vs Carrier...</p>",
        "id": 153901786,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502396908
    },
    {
        "content": "<p>I agree that the Medication resource does not follow the norm in terms of id.  I understand that Pharmacy took this situation to FMG, that id didn't really fit in Medication, and received an waiver.  I'm looking for that discussion.</p>\n<p>(This is not easy to search for.  I'll continue to look as I have time)</p>",
        "id": 153901787,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1502396948
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> yes, identifier is on an instance; code is on a concept.</p>",
        "id": 153901790,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1502397094
    },
    {
        "content": "<p>thanks Scott.</p>",
        "id": 153901791,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502397119
    },
    {
        "content": "<p>An RFID embedded in a tablet would be an identifier on that instance (tablet) - assuming each RFID is unique.  But an RFID/barcode on a bottle/box/container is more problematic:  is it identifying the bottle/box/container (instance), or is it describing the content (concept/kind).  In pharmacy, the descriptor used (NDC, RxNorm, IDMP terms, etc) describe the <em>concept</em> of the medicinal product.  (Well, NDC actually refers to a specific bottle size for the medicinal product, but is normally used to refer to the medication (except for billing purposes))</p>",
        "id": 153901793,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1502397469
    },
    {
        "content": "<p>Logisitic operations would be interested in tracking the packages, bundles, pallets, etc.  Medication resource is not intended for that purpose</p>",
        "id": 153901794,
        "sender_full_name": "Scott Robertson",
        "timestamp": 1502397569
    },
    {
        "content": "<p>i understand that identifier may not uniquely identify one instance. for example if we only have lot numbers, then that is the granularity we have, and one identifier can correspond to 1000s of instances. I think that is ok. Not perfect, but ok.</p>",
        "id": 153901795,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1502397831
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> It's still not typically an \"identified\" instance - where one jar of the compounded product has a distinct identifier from another jar (where that identifier is distinct from the identifier of the dispensing event itself).  Medication.identifer would only make sense if it was unique to an individual jar/bottle/pill/etc.  I'm fine with defining an extension for those edge cases where this occurs (vials of certain medications might indeed have unique identifiers per vial), but I don't think it's part of core for the pharmacy space.</p>",
        "id": 153901816,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1502401011
    },
    {
        "content": "<p>it's possible to assign an identifier in a Medication Formulary. However I think there's an underlying confusion here</p>",
        "id": 153901826,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502404329
    },
    {
        "content": "<p>early ISO work around terminologies described 3 things:<br>\n- identifiers<br>\n- codes<br>\n- appelations</p>",
        "id": 153901828,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502404451
    },
    {
        "content": "<p>codes are used to distinguish things by the properties</p>",
        "id": 153901829,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502404466
    },
    {
        "content": "<p>identifiers are used to label instances of things that are only differentiated by the identifier assigned/affixed to them - in other words, they are not intrinsically differentiated by any property they have</p>",
        "id": 153901830,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502404515
    },
    {
        "content": "<p>appelations are codes for which there is (and can be) only one instance of the thing</p>",
        "id": 153901831,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502404544
    },
    {
        "content": "<p>a classic example of an appelation is a code for a country</p>",
        "id": 153901832,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502404560
    },
    {
        "content": "<p>We typically treat appelations as codes, but they can also be treated as identifiers.</p>",
        "id": 153901833,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502404584
    },
    {
        "content": "<p>some medication codes are actually appelations .. but I haven't seen anything that shouldn't be treated as code myself</p>",
        "id": 153901834,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1502404618
    },
    {
        "content": "<p>I see that Medication.identifier is included again in R4. Is this meant for medications that are mixed specifically for a patient for example by a hospital pharmacy? If so, does that mean that you must include either M.identifier or M.code to identify the medication?</p>",
        "id": 154015926,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1541516759
    },
    {
        "content": "<p>Could be for patient-specific traceable administration doses.  Could also be where the manufacturer puts serial numbers on individual doses (which apparently is happening in a few places now)</p>",
        "id": 154015936,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541518452
    },
    {
        "content": "<p>Lloyd is correct, this identifier is for identifiers like serial numbers rather than codes (like NDC or RxNorm).    The Medication.identifier was included in the latest build due to use cases that were presented.  Codes such as NDC or RxNorm or an organizational codes go in Medication.code.</p>",
        "id": 154016012,
        "sender_full_name": "Melva Peters",
        "timestamp": 1541539525
    },
    {
        "content": "<p>Great, thanks!</p>",
        "id": 154016160,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1541589356
    }
]