[
    {
        "content": "<p>Hi there, <br>\nWe are currently working on the mapping from HL7 v2 medications to FHIR resources and we just realized that v2 allows multiple RXR segments, meaning multiple different routes (Oral, IV...), while the FHIR resource allows only one route that is a CodeableConcept, allowing therefore different codings for the same concept. <br>\nWhat should we do to expose all routes available in HL7 v2?  </p>\n<p>Cheers,<br>\nFede</p>",
        "id": 153832460,
        "sender_full_name": "Federica Lanzo",
        "timestamp": 1465766956
    },
    {
        "content": "<p>I dont have an answer but worth noting this only really applies to medication orders not administration (ie any single dose can only be given one route, even tho the order maybe <code>PO/IV</code>)</p>",
        "id": 153832462,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1465772172
    },
    {
        "content": "<p>You are right with administration, but both orders (RDE and OMP message types) and dispense (RDS message type) medications allow repetition of the RXR. </p>",
        "id": 153832464,
        "sender_full_name": "Federica Lanzo",
        "timestamp": 1465774264
    },
    {
        "content": "<p>It is possible for a medication ordering provider to specify multiple routes for the same medication (and dosage) in order to give the medication administrator the ability to make a decision based on the patient's actual condition.  <br>\nWhen the actual administration happens, the nursing staff/administrator have made the route decision and at this point of time, the route is just one (the chosen one).</p>",
        "id": 153832481,
        "sender_full_name": "Shanta Sankaran",
        "timestamp": 1465783145
    },
    {
        "content": "<p>I expect the work group feels this should be handled by an extension.  However, feel free to raise a change request to get clarity or to get such an extension defined</p>",
        "id": 153832490,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1465785985
    },
    {
        "content": "<p>it sounds like this is a regression on a core, everyday requirement...</p>",
        "id": 153832491,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1465786084
    },
    {
        "content": "<p>Submit a change request and argue your case for it being in the 80% then :)</p>",
        "id": 153832492,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1465787602
    },
    {
        "content": "<p>Although MedicationOrder.dosageInstruction.route is 0..1, MedicationOrder.dosageInstruction is 0..*</p>\n<p>Why wouldn't multiple dosageInstructions, each with its own distinct route, work for this use case?</p>",
        "id": 153832523,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1465821442
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  what does having multiple dosageInstructions mean?  Based on the description I assumed it was for cases where the dosage changes over time (an implicit \"followed by\" relation).  I'd be nervous about it sometimes meaning that and sometimes meaning it is a different option for administration.</p>",
        "id": 153832531,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1465841764
    },
    {
        "content": "<p>Yes, there is that option, but it does not correspond exactly to what HL7 v2 allows you do achieve. In fact for the same dosage indication you could provide multiple routes. <br>\nOur temporary solution makes use of the multiplicity of dosageInstruction where all the fields are populated in the same way with the exception of  the route. This does not seem to match what a v2 message was trying to communicate, though.</p>",
        "id": 153832567,
        "sender_full_name": "Federica Lanzo",
        "timestamp": 1465853236
    },
    {
        "content": "<p>This was discussed during the Pharmacy work group conference call today:  <a href=\"http://wiki.hl7.org/index.php?title=2016-06-13_Rx_Conf_Call\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=2016-06-13_Rx_Conf_Call\">http://wiki.hl7.org/index.php?title=2016-06-13_Rx_Conf_Call</a></p>\n<p>An action item was noted to clarify the guidance around what multiple dosageInstructions mean.  Specifically, clarify when there are multiples, is it an \"and\" where the med is given via one route followed by another route;  is it an \"or\" listing alternative dosage instructions;  could it be either one (depending on whether the timing dates are sequential or identical) etc.  More discussion to follow to land the clarifications needed.</p>\n<p>The other comment was wanting a better understanding of the use case (i.e. saying v2 can do it was not a compelling reason for FHIR to do the same).</p>",
        "id": 153832576,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1465858352
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>  2 common drugs (paracetamol/acetaminophen and tramadol) are frequently charted as PO/IV - they have a high oral bioavailability so the dose is the same - and in both cases there is a strong case for wanting to track the total dose administered in a 24 period </p>",
        "id": 153832652,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1465865978
    },
    {
        "content": "<p>(I typically write O/IV on a med chart ~ 6 times every day)</p>",
        "id": 153832653,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1465866031
    },
    {
        "content": "<p>(just as way of background on the use case)</p>",
        "id": 153832654,
        "sender_full_name": "Erich Schulz",
        "timestamp": 1465866158
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"192001\">@Erich Schulz</span> , I will pass along your use case example to the Pharmacy co-chairs for the continuation of this discussion, next Monday June 20.</p>",
        "id": 153832755,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1465907221
    },
    {
        "content": "<p>The next meeting is Jun 20th.</p>",
        "id": 153833005,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1465998416
    },
    {
        "content": "<p>Are there any updates from the Pharmacy co-chairs regarding the use of multiple Medication Routes? Thanks! </p>",
        "id": 153843904,
        "sender_full_name": "Shanta Sankaran",
        "timestamp": 1471251585
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191904\">@Shanta Sankaran</span> Pharmacy WG discussed this and decided that further discussion is needed - we will be discussing further on calls leading up to the WGM and then likely at the WGM.</p>",
        "id": 153843933,
        "sender_full_name": "Melva Peters",
        "timestamp": 1471275952
    }
]