[
    {
        "content": "<p>We are looking to support a (simple) use case where a patient sends a picture to a healthcare provider. Imaging an image of a wound or some dermatological condition. We think of using the Media resource for this purpose. <br>\nThe use case should be implementable within XDS networks as well. We are exploring which metadata should be included and the possible workflows we should support/cover.</p>\n<p>Does anyone have experience with such a use case? Or experience with the Media resource and/or XDS networks. I would like to learn from your experiences :)</p>",
        "id": 154020908,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1543255821
    },
    {
        "content": "<p>if you want compatibility with XDS, then use DocumentReference. This is just as legitimate of a resource to use for your use-case, and is more broadly applicable.</p>",
        "id": 154020910,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543256649
    },
    {
        "content": "<p>DocumentReference was born out of compatibility with XDS, and there is an Implementation Guide from IHE on the topic -- Mobile access to Health Documents (MHD) -- <a href=\"https://wiki.ihe.net/index.php/Mobile_access_to_Health_Documents_(MHD)\" target=\"_blank\" title=\"https://wiki.ihe.net/index.php/Mobile_access_to_Health_Documents_(MHD)\">https://wiki.ihe.net/index.php/Mobile_access_to_Health_Documents_(MHD)</a></p>",
        "id": 154020911,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543256954
    },
    {
        "content": "<p>patient is certainly within scope as a creator of documents. a picture of a wound is certainly a good use-case for patient generated documents. See scope on DocumentReference</p>",
        "id": 154020912,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543257034
    },
    {
        "content": "<p>Except for the XDS integration, Media is appropriate. This was certainly a use case I had in mind while we worked on Media. </p>\n<p>Note that I haven’t heard much feedback on Media, so your experience would be good to hear. There is an ongoing discussion about the boundaries between Observation and Media, and Media/Binary/DocumentReference, so it is possible one of those may be going away, and the boundaries may shift.</p>",
        "id": 154020918,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1543264306
    },
    {
        "content": "<p>Thnx <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  and <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> ,<br>\nWe have IHE MHD in scope because we use it for another use case. Will be a good discussion to see if we will create two specifications, one based on DocumentReference for XDS networks and one based on Media for peer to peer or if we will go only for the DocumentReference. Will try to keep you updated on our progress. </p>\n<p>Other implementer experiences or advice are still more than welcome :)</p>",
        "id": 154021018,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1543315192
    },
    {
        "content": "<p>I would have thought Media or Observation would be the obvious choice. A wound photograph would certainly feel like an observation to me.</p>",
        "id": 154022453,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1543834413
    },
    {
        "content": "<p>This reminds me of a discussion at the September 2018 WGM which <span class=\"user-mention\" data-user-id=\"191936\">@Michael Donnelly</span> told me about. I think that's what <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> is refering to too.  What I remember from that discussion is whether it would be wise to expose the data on multiple endpoints concurrently - so a client would always find it, regardless of whether you represented it using Media or DocumentReference.  Maybe Michael knows more about where that discussion ended up? Or what direction Epic took?</p>",
        "id": 154022779,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1543935264
    },
    {
        "content": "<p>that discussion is where the clinical notes discussion ended up. In that case it was DocumentReference and DiagnosticReport both pointing at the same Binary.  Yes it is possible for Media to also point at the same binary. This seems more like an identification of a problem, than a solution. Why do we have so many ways to do the same thing?</p>",
        "id": 154022790,
        "sender_full_name": "John Moehrke",
        "timestamp": 1543938779
    },
    {
        "content": "<p>Media is essentially == observation + valueAttachment  although DocumentReference could also work too.</p>",
        "id": 154022970,
        "sender_full_name": "Eric Haas",
        "timestamp": 1543963146
    },
    {
        "content": "<p>Media feels most suitable for transferring images. It is a nice specific resource and allows for medically related elements. Also, a strong point is the connection with DiagnosticReport. Only thing annoying is that in STU3 it is not possible to reference a Patient as an operator (fixed in R4).</p>\n<p>DR feels less fitting, however, I believe this is the way to be compatible with XDS. As mentioned, we use IHE MHD for transferring PDFA documents. Therefore we would like to reuse these IHE MHD profiles as well if we would go in this direction.</p>",
        "id": 154023126,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1544024083
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , to be compatable with XDS we should look at the comprehensive metadata profiles, right?</p>\n<p>Looking at the provide document transaction bundle profile, I noticed that:<br>\n1.  A patient cannot be an author,<br>\n2.  .type is not really suitable. Perhaps this codes fits: “72170-4 Photographic image Unspecified body region Document”. However, it has a preferred binding strength so we can do something ourselves if needed. <br>\n3.  .class codes are not suitable. Also mostly HCP centered, --&gt; but also example binding strength<br>\n4.  .content.attachment.language is mandatory, but for images, this is a bit nonsense<br>\n5.  content.format is mandatory  this will be a fixed value for images, stating mimetime sufficient right?<br>\n6.  The whole  .context backbone does not really map for our patient-centred use case. The mandatory items are for healthcare providers.<br>\n7.  Provide Document bundle profile has a wrong(?) .meta profile constraint, namely <a href=\"http://ihe.net/fhir/tag/iti-65\" target=\"_blank\" title=\"http://ihe.net/fhir/tag/iti-65\">http://ihe.net/fhir/tag/iti-65</a>. It does not match the canonical url of the profile. Or is this intended?</p>",
        "id": 154023127,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1544024177
    },
    {
        "content": "<p>I identify three possible strategies for our use case:</p>\n<p>1.  Let everything be XDS compatible and write down specification to transfer images with DocumentReference resources – based on or hopefully close to IHE MHD<br>\n2.  Use the Media resource and let XDS actors convert the Media resource to a desired format. Provide a mapping, or let our Media resource be XDS compatible. <br>\n3.  Use both ways. Media for non-XDS actors, and DocumentReference for XDS actors</p>",
        "id": 154023138,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1544024423
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/Qep_Ns5lwNN88unTRJ-rizXH/2018-12-05-16_16_22-Mapping-IHE-MHD-DR-Media.xlsx-Excel.png\" target=\"_blank\" title=\"2018-12-05-16_16_22-Mapping-IHE-MHD-DR-Media.xlsx-Excel.png\">2018-12-05-16_16_22-Mapping-IHE-MHD-DR-Media.xlsx-Excel.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Qep_Ns5lwNN88unTRJ-rizXH/2018-12-05-16_16_22-Mapping-IHE-MHD-DR-Media.xlsx-Excel.png\" target=\"_blank\" title=\"2018-12-05-16_16_22-Mapping-IHE-MHD-DR-Media.xlsx-Excel.png\"><img src=\"/user_uploads/10155/Qep_Ns5lwNN88unTRJ-rizXH/2018-12-05-16_16_22-Mapping-IHE-MHD-DR-Media.xlsx-Excel.png\"></a></div><p>Regarding strategie 2: I made a mapping of the mandatory DocumentReference elements to the Media resource</p>",
        "id": 154023140,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1544024525
    },
    {
        "content": "<p>What do people think of the idea to use the media resource in our use case, and to make it XDS compatible? So a XDS actor can convert it to a DR if needed or straightaway to a XDS entry. <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> ?</p>",
        "id": 154023141,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1544024720
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span>  I would be very interested to hear what about Media is attractive to you. I ask because I am trying to drive for the two to be combined into one as there is so little difference. Thus the difference seems to be emotional rather than technical. So I am interested in why... Seems some of your comments are on MHD, not the FHIR specification, specifically not current specification.</p>",
        "id": 154023234,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544036831
    },
    {
        "content": "<p>XDS has never forbidden a patient to be an author. FHIR DocumentReference has always allowed patient to be an author. So I am not sure where you see a foridance of the patient to be an author. If there is one, then it is likely a mistake that needs to be corrected.</p>",
        "id": 154023236,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544036961
    },
    {
        "content": "<p>as to type and class (now category), these are valuesets. Valuesets evolve as new use-cases are brought forward. I very much like to bring new use-cases forward.</p>",
        "id": 154023237,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544037093
    },
    {
        "content": "<p>I don't know of any requirement for language to be specified... if you see one, please point it out so that it can be corrected.</p>",
        "id": 154023238,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544037120
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  Perhaps I just gave too much disperse information. My comments are indeed on IHE MHD (more specific, on the profile <a href=\"http://ihe.net/fhir/StructureDefinition/IHE.MHD.Provide.Comprehensive.DocumentReference\" target=\"_blank\" title=\"http://ihe.net/fhir/StructureDefinition/IHE.MHD.Provide.Comprehensive.DocumentReference\">http://ihe.net/fhir/StructureDefinition/IHE.MHD.Provide.Comprehensive.DocumentReference</a>). Because we already use MHD, we would like to reuse or stay close to it, if we move forward with the DocumentReference approach.</p>\n<p>I am no XDS expert. Currently, I believe that the “Comprehensive MHD profile” (a.k.a. XDS on FHIR) states the minimum requirements for indexing something in typical XDS network. Is this assumption correct?</p>",
        "id": 154023430,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1544094028
    },
    {
        "content": "<p>My mapping is based on these mandatory elements to see how far the Media resource is from being used in indexing by an XDS network.</p>",
        "id": 154023431,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1544094044
    },
    {
        "content": "<p>Regarding the potential use of Media, this may partly be an emotional choice. It 'feels' more applicable for images than a DocumentReference. But in addition, I see value in the following additional fields compared to DR for our use case: view, reasonCode, bodySite, device, to a lesser extend the height and width elements. And the connection from a DiagnosticReport to Media.</p>",
        "id": 154023433,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1544094341
    },
    {
        "content": "<p>thanks. this is the kind of specifics that are helpful. All of these can be addressed now that they are identified. Feelings are hard to address.</p>",
        "id": 154023471,
        "sender_full_name": "John Moehrke",
        "timestamp": 1544103291
    }
]