[
    {
        "content": "<p>In both Medication and Medication Knowledge resources, I still see manufacturer. I thought there was an agreement to change that...?</p>",
        "id": 208323258,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598607905
    },
    {
        "content": "<p>we have a ticket to change it but the Pharmacy WG is still driving consensus on what it will be named as it appears to be sometimes a manufacturer in some jurisdictions and sometimes not.</p>",
        "id": 208366249,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598632754
    },
    {
        "content": "<p>ok</p>",
        "id": 208369111,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598634069
    },
    {
        "content": "<p>I don't think i ever saw manufacturer in any jurisdiction (but may be that manufacturer is a common abuse of language)</p>",
        "id": 208369203,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598634105
    },
    {
        "content": "<p>New Zealand is the one jurisdiction that has voiced opposition to the change</p>",
        "id": 208378930,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598639313
    },
    {
        "content": "<p>They seem to call it \"sponsor\" though</p>",
        "id": 208389988,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598645544
    },
    {
        "content": "<p>no, from his comment: \"The sponsor is merely a promoter and does not have  responsibility for the the product in all cases.  The registration applies to the manufacturer which is the company whose name is on the packaging and is responsible for the quality and manufacture of the product.\"  As I said, we are still driving consensus but we have bigger issues to deal with at this time.</p>",
        "id": 208390452,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598645846
    },
    {
        "content": "<p>What's the JIRA Ticket Number for this issue?</p>",
        "id": 208391804,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1598646640
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-27030\">J#27030</a></p>",
        "id": 208396595,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598649851
    },
    {
        "content": "<p>It would be useful to get some Australian input into this issue... <span class=\"user-mention\" data-user-id=\"191337\">@Dion McMurtrie</span>  &amp; <span class=\"user-mention\" data-user-id=\"200807\">@Matt Cordell</span> . </p>\n<p>Those transitioning from V3 &amp; CDA will note that the Manufactured Product Class has a property called manufacturerOrganization, so I find it hard to believe that the manufacturer of a medication is an unusual concept or a linguistic challenge. Looking at some high profile legal actions involving medications - e.g. Thalidomide and OxyContin - the Manufacturer is cited. Therefore, rather than renaming  and re-purposing an element in a widely-implemented R4 resource (albeit one at FMM level 3), it might be prudent to add an element for Market Authority Holder if that is required for North America and Europe.</p>",
        "id": 208467730,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1598761253
    },
    {
        "content": "<p>Based on the comments in the ticket, should the SPL approach be given consideration?</p>",
        "id": 208468100,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1598762083
    },
    {
        "content": "<p>if we were going to do that, we would probably keep the name and just provide more explanation in the definition and notes.</p>",
        "id": 208471118,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598768567
    },
    {
        "content": "<p>as the JIRA ticket describes, in many cases, the organization responsible for the medication is the manufacturer, but very often it is a representative of the manufacturer and not actual the organization that physically produces the medication.  Given the wide differences across all the jurisdictions, I for one am leaning to keeping the name of manufacturer with the update definitions just because it is what people naturally think of.  But we need to keep having this conversation to see if there isn't a more useful name for the data element.</p>",
        "id": 208471172,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598768691
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> that perhaps we should split it. I think that everywhere in the clinical realm (which is where Medication fits) we just need a Marketing Authorisation Holder / Sponsor / Labeler / Representative... The manufacturer indeed can be relevant for legal tracing the representative/labeler but that would be in the regulatory realm (ping <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> )<br>\nWhile we are discussing, I believe the for clinical world this element name has the only name it shouldn't have. <br>\nIf I want to use the name of the brand/representative/sponsor (which is most common), I will use manufacturer. And then if I want to say incidently the actual manufacturer name, I use an extension, and say \"no, THIS is the manufacturer\"?</p>",
        "id": 208498156,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598812296
    },
    {
        "content": "<p>Whatever name it has may not work for everyone. Seems best just to pick one, probably \"manufacturer\" - though it may well be a common misuse - and document it (as Melva suggests).  </p>\n<p>\"Supplier\" is another option, a bit more neutral perhaps.</p>\n<p>I wouldn't think that having both a true manufacturer and an MAH is necessary, in the 80%, for this resource.</p>\n<p>It's more distinct in the medication definition resources, where you can use RegulatedAuthorization to say all about the authorization and who the MAH is and (elsewhere) list all the different manufacturers there may be (different items, different steps).</p>",
        "id": 208501946,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1598818037
    },
    {
        "content": "<p>Agree we don't need both in the clinical realm - in this realm, what matters is the ponsor, MAH, etc - NOT the manufacturer</p>",
        "id": 208502779,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598819243
    },
    {
        "content": "<p>please let me know I am incorrect. But if we agree that no name is perfect but manufacturer is bad for everyone, leaving it there is too salomonic, i guess</p>",
        "id": 208502837,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598819305
    },
    {
        "content": "<p>as I have said, manufacturer is <em>NOT</em> bad for everyone and in fact appears to be more commonly used than other names.</p>",
        "id": 208502923,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598819421
    },
    {
        "content": "<p>even if the field were named something else, it would many times be where the manufacturer was being sent.</p>",
        "id": 208503162,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598819770
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192685\">Vassil Peytchev</span> <a href=\"#narrow/stream/179166-implementers/topic/medication.20manufacturer/near/208468100\">said</a>:</p>\n<blockquote>\n<p>Based on the comments in the ticket, should the SPL approach be given consideration?</p>\n</blockquote>\n<p>Sorry Vassil, I missed your comment.  In SPL, the organization that is normally sent is the labeler but they can also send the registrant, so we could possibly choose one of those two terms.  The \"registrant\" is sometimes the manufacturer, sometimes the marketing holder, and sometimes the sponsor, so it might be the leading candidate since it is somewhat abstract.</p>",
        "id": 208503319,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598819979
    },
    {
        "content": "<p>As i also mentioned, it seems that when people say manufacturer, it's not really the manufacturer itself, is it?</p>",
        "id": 208503321,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598819982
    },
    {
        "content": "<p>I would agree with registrant (because it is not manufacturer which is really specific and may not be correct)</p>",
        "id": 208503380,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598820038
    },
    {
        "content": "<p>(or labeler)</p>",
        "id": 208503384,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598820063
    },
    {
        "content": "<p>when Pharmacy WG did our research, it was actually the manufacturer.  It appeared that a large percentage of drugs registered in Health Canada and in the US had the actual manufacturer as the organization that was listed as responsible for the drug (I don't have the stats in front of me, but I remember it being 80+%).  The next largest percentage was an closely-related agent for the manufacturer.  In many cases, the agent had a similar name to the manufacturer, i.e. it was the Canadian or American subsidiary of a company.  So even though the agent wasn't actually manufacturing the drug, they were closely related to the organization that was.  And then we saw organizations that were sponsors but had no obvious ties to the manufacturer.  I suspect that some percentage of these were agents as well, but it wasn't evident.</p>\n<p>Peter Sergent has said that in NZ this is not the case.  Although the sponsor is the organization requesting a medication be registered for use in NZ, it is the manufacturer whose name in on the packaging and who is responsible for feedback of the product.  This appears to be different than the list of organizations I provided above which were US/Canada.</p>",
        "id": 208503543,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598820299
    },
    {
        "content": "<p>I just brought this up because thought this was agreed, now I see maybe it isn't. This is difficult. <br>\nI can only suggest: In many places in Europe, what matters is the MAH which may or not be the manufacturer. So there is a more comprehensive term to support all the cases, we can use that (or sponsor, labeler, or responsible, or representative, or registrant, or marketer....).</p>",
        "id": 208503757,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598820606
    },
    {
        "content": "<p>I thought we had agreed that we shouldn't have an element called \"manufacturer\" and then say \"note that this may not be the actual manufacturer\", I just find that slightly inadequate. But this is a small fish and I agree, other things are in more need of attention.</p>",
        "id": 208503763,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1598820652
    },
    {
        "content": "<p>right, see the ticket for the discussion (to which I will add some of this).  We had pushback on the use of the term \"marketing authorization holder\" since that is not actually as widespread a term as we thought it was.  As I said at the beginning of this topic, the WG is currently  soliciting what name should be used across all jurisdictions.</p>",
        "id": 208503826,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1598820768
    },
    {
        "content": "<p>According to the organisation that regulates medications in Australia (the Therapeutic Goods Administration), \"sponsor\" includes manufacturers. See <a href=\"https://www.tga.gov.au/role-sponsor\">https://www.tga.gov.au/role-sponsor</a>.<br>\nAustralian coding systems for medications <a href=\"http://build.fhir.org/ig/hl7au/au-fhir-base/ValueSet-amt-mp-codes.html\">AMT</a> and <a href=\"http://build.fhir.org/ig/hl7au/au-fhir-base/ValueSet-pbs-item.html\">PBS</a> record the sponsor and not the manufacturer.</p>",
        "id": 208508571,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1598828916
    },
    {
        "content": "<p>In prescribing and dispensing it is the TGA sponsor that is shared, not the manufacturer.</p>",
        "id": 208508577,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1598828956
    },
    {
        "content": "<p>Yes in the Australian regulatory context there is a recorded \"sponsor\" who get a licence from our regulator. <a href=\"https://www.tga.gov.au/role-sponsor\">https://www.tga.gov.au/role-sponsor</a></p>\n<blockquote>\n<p>A sponsor is a person or company who does one or more of the following<br>\n - exports therapeutic goods from Australia<br>\n - imports therapeutic goods into Australia<br>\n - manufactures therapeutic goods for supply in Australia or elsewhere<br>\n - arranges for another party to import, export or manufacture therapeutic goods.</p>\n</blockquote>",
        "id": 208510702,
        "sender_full_name": "Dion McMurtrie",
        "timestamp": 1598832578
    }
]