[
    {
        "content": "<p>I'm trying to model a list of medications, and want to flag some as being \"not to be discontinued\". As the leading statement implies, I'm thinking of using \"List\" with items of \"MedicationStatements\", and those that are \"not to be discontinued\" have a SupportingInformation pointing to a Flag to say \"Do not discontinue\". Does this sound like a correct FHIR solution?</p>",
        "id": 153865701,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1483624978
    },
    {
        "content": "<p>Is the \"do not discontinue\" something that should be a characteristic of the MedicationStatement (however the statement is retrieved) or only from the context of this specific List?  In either case, I would probably lean towards an extension rather than MedicationStatement.supportingInformation.</p>",
        "id": 153865727,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1483645147
    },
    {
        "content": "<p>Can you describe the use case a little more?  I would have thought that if a provider is reviewing a list of medications in the context of medication reconciliation, if they decide the patient should continue on that medication, they would just do nothing to that record or they may decide to create a new medicationRequest for that medication.  For medications that need to be discontinued, they would update the status and for medications that were to be changed, they would discontinue the old and create a new medicationRequest.  </p>",
        "id": 153865729,
        "sender_full_name": "Melva Peters",
        "timestamp": 1483645328
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> a use case this coves is when a patient is admitted to hospital, and the hospital reviews the patients current medication. The hospital clinician decides to put the patient on a new medication, and needs to tell the patient's GP (primary care physician) that the new medication should not be discontinued. So the discharge letter/coded statement (MedicationStatement) needs to say that the new medication should not be discontinued. In the UK its GP (primary care physician) that holds the consolidated medication record.</p>",
        "id": 153865879,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1483696307
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> thanks for the response. The question of whether to extend or link in a resource for additional information not covered by the base resource (or covered bt HL7 extensions in the Profiles tab) will undoubtedly come up again as we try and implement the FHIR standard. When you say that you lean toward an extension in the case of \"do not discontinue\" in relation to MedicationStatement, what drives you to that decision? is there any guidance we can follow so that we all arrive at the same conclusion? <br>\nIn the NHS we are trying to arrive at industry agreed resource definitions (that may have extensions from the base resources), and then we'll only extend these again for very good business reasons, as lots of extensions, whilst OK for \"point\" solutions, reduces the opportunity for wider interoperability. If you could provide some guidance (or point me to some guidance) on when extensions are the best way forward, I'd be very grateful.</p>",
        "id": 153865885,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1483699196
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192158\">@Dave Barnet</span> There's no clear way to say \"don't end this statement\" in any resource a statement could possibly point to as supporting information.  As well, the semantics of supportingInformation is \"records that support the assertion that the patient is taking this medication\" - what you're proposing to put there wouldn't meet those semantics.</p>",
        "id": 153865919,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1483730480
    }
]