[
    {
        "content": "<p>Hi, I would like to ask in which resource I can keep a medicаtion prescription in fhir database?</p>",
        "id": 185317301,
        "sender_full_name": "Tihomir Petrov",
        "timestamp": 1578668561
    },
    {
        "content": "<p>A prescription is represented by <a href=\"http://build.fhir.org/medicationrequest.html\" target=\"_blank\" title=\"http://build.fhir.org/medicationrequest.html\">MedicationRequest</a></p>",
        "id": 185318327,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1578669204
    },
    {
        "content": "<p>Yes, I know that the MedicationRequest represents a single medication request, but I want to implement a prescription contained few medication requests in the context of a single Encounter.  Can we use for example Composition in order to group few MedicationRequests in the context of the Encounter? The idea behind that is to have a way to print all the prescriptions related to the Encounter.</p>",
        "id": 185319675,
        "sender_full_name": "Tihomir Petrov",
        "timestamp": 1578670057
    },
    {
        "content": "<p>MedicationRequest resources have a reference to the Encounter. As such that's the default grouping mechanism.</p>",
        "id": 185321147,
        "sender_full_name": "René Spronk",
        "timestamp": 1578671023
    },
    {
        "content": "<p>Depends</p>",
        "id": 185329252,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578675788
    },
    {
        "content": "<p>If a prescription consists of several items, these typically are bound together clinically</p>",
        "id": 185329311,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578675836
    },
    {
        "content": "<p>So there is a single grouping resource that is the \"parent\"</p>",
        "id": 185329374,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578675859
    },
    {
        "content": "<p>CarePlan is what I would use</p>",
        "id": 185329384,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578675876
    },
    {
        "content": "<p>or List?</p>",
        "id": 185329426,
        "sender_full_name": "David Hay",
        "timestamp": 1578675906
    },
    {
        "content": "<p>For just grouping and saying \"these belong together\" I would use a requestgroup</p>",
        "id": 185329490,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578675955
    },
    {
        "content": "<p>List does not convey this is one single clinical order</p>",
        "id": 185329566,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578675995
    },
    {
        "content": "<p>RequestGroup does seem better if it's an actual order...</p>",
        "id": 185329608,
        "sender_full_name": "David Hay",
        "timestamp": 1578676031
    },
    {
        "content": "<p>It is an actual single order that cannot be decomposed technically - its integrity is a clinical element as well</p>",
        "id": 185329738,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578676096
    },
    {
        "content": "<p>For multiple meds ordered at the same time, there's no grouping resource.  They just all share the same groupIdentifier.</p>",
        "id": 185329981,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578676265
    },
    {
        "content": "<p>RequestGroup is only used if the medications can't be manipulated independently.  I.e. you can't suspend one without suspending all - which generally means multiple meds that have tight interdependencies in terms of delivering a single therapy.</p>",
        "id": 185330021,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578676316
    },
    {
        "content": "<p>Ah yes and there is groupidentifier</p>",
        "id": 185330835,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578676928
    },
    {
        "content": "<p>I confess I'm not very comfortable with the range of options and what they depend on.</p>",
        "id": 185331060,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578677152
    },
    {
        "content": "<p>I think at the top level we have CarePlan that can be used for long-term prescriptions like hormonal therapy, psychiatric treatments, etc.</p>",
        "id": 185331173,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578677198
    },
    {
        "content": "<p>then we have grouping - requestGroup and groupIdentifier, which is to group the actionable requests.</p>",
        "id": 185331236,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578677250
    },
    {
        "content": "<p>I might use CarePlan to represent \"intended therapy\" - where a single entry in the CarePlan could cover numerous prescriptions over time</p>",
        "id": 185331328,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578677292
    },
    {
        "content": "<p>Yes</p>",
        "id": 185331344,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578677304
    },
    {
        "content": "<p>long-term therapies are in that group, right?</p>",
        "id": 185331358,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578677323
    },
    {
        "content": "<p>The act of prescribing implies a responsibility that is not operational but clinical - if the physician prescribes 2 drugs together, they may or may not be dispensed separately, but that is something that is a clinical decision.</p>",
        "id": 185331385,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578677349
    },
    {
        "content": "<p>Each MedicationRequest is treated as an independent order.  The decision to fill, suspend, cancel, etc. is independent of any other MedicationRequest - even if authored at the same time on the same 'virtual' piece of paper.  RequestGroup is used in those situations where the decision to act on one request can't be made independently of another request.  If you cancel/suspend one, you need to cancel/suspend all.</p>",
        "id": 185331579,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578677483
    },
    {
        "content": "<p>I was \"trained\" to assume this is the case by default:</p>\n<blockquote>\n<p>RequestGroup is only used if the medications can't be manipulated independently.  I.e. you can't suspend one without suspending all - which generally means multiple meds that have tight interdependencies in terms of delivering a single therapy.</p>\n</blockquote>",
        "id": 185331582,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578677488
    },
    {
        "content": "<p>so far so good. So that leaves the groupIdentifier for which cases ? When they are entered in the saem editing session?</p>",
        "id": 185331702,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578677558
    },
    {
        "content": "<p>Yes.  groupIdentifier is used for the paper equivalent of \"ordered on the same written script\".  Also applies to lab orders marked off on a common requisition form, etc.</p>",
        "id": 185332284,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578677902
    },
    {
        "content": "<p>what is the difference (from a user entry perspective) between <br>\na) ordered on the same script and <br>\nb) can't be made independently...</p>",
        "id": 185333294,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578678538
    },
    {
        "content": "<p>My assumption is that a implies b by default unless otherwise made explicit (how?)</p>",
        "id": 185333334,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578678581
    },
    {
        "content": "<p>(a) definitely doesn't imply (b).  It's very common for clinicians to order multiple drugs on a single piece of paper.  In most jurisdictions, that has no impact on the ability to manipulate the scripts independently downstream.  If someone writes your asthma med renewal on the same piece of paper the prescribe an antibiotic, cancelling the antibiotic wouldn't be expected to cancel the asthma med.</p>",
        "id": 185334589,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578679429
    },
    {
        "content": "<p>yes, but that decision is a clinical act. If someone cancels the antibiotic and not the asthma med, that person is then onwards responsible for the clinical impact of that, right?</p>",
        "id": 185335398,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578679879
    },
    {
        "content": "<p>(I'm agreeing with most of it, I just need some deterministic criteria to provide guidance on this situation)</p>",
        "id": 185335482,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578679927
    },
    {
        "content": "<p>There's clinical responsibility for the impact on the patient regardless of whether things were ordered on the 'same' piece of paper or not.</p>",
        "id": 185336117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578680325
    },
    {
        "content": "<p>In many jurisdictions, the fact that things were ordered on the same piece of paper has no impact.  In some cases, there can be impacts on downstream processing or payment.  But, in FHIR, if you want to declare dependence, then you use RequestGroup.  And in that case, the 'intent' of all of the MedicationRequests (or other Requests) becomes 'option' and you can't change the status of one without changing the status of all.</p>",
        "id": 185336278,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578680434
    },
    {
        "content": "<p>So, the guidance would be<br>\n\"If an order is entered as a whole, use RequestGroup\". If an order is just entered in one session without this having any impact on its integrity, you can use groupIdentifier\"<br>\n?</p>",
        "id": 185336711,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578680744
    },
    {
        "content": "<p>If you have a single order with multiple interdependent components, use RequestGroup.  (It's possible that a RequestGroup might be adjusted over time - not necessarily a requirement that everything be ordered at once).  If you simply want to capture that multiple things were ordered as part of the same ordering 'event', use groupIdentifier.</p>",
        "id": 185336898,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578680856
    },
    {
        "content": "<p>ok. And for orders that are represent a treatment and are not actionable themselves but may trigger the actionable prescriptions, use CarePlan.</p>",
        "id": 185338686,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578682007
    },
    {
        "content": "<p>right ?</p>",
        "id": 185338861,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578682113
    },
    {
        "content": "<p>Not necessarily.  The non-actionable bit is conveyed by 'intent'.  You can have MedicationRequest instances that have an intent of 'planned' (or 'proposed').  CarePlan is primarily relevant when you want to have a big-picture view of a whole bunch of meds (and maybe other things too).  If you need to capture detailed dosage instructions, the CarePlan activities might still need to point to a MedicationRequest with an intent of 'planned' to convey that detail.</p>",
        "id": 185339210,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1578682371
    },
    {
        "content": "<p>True. In my head the notion is that Careplan is a \"Treatment\".</p>",
        "id": 185339557,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578682631
    },
    {
        "content": "<p>The Swiss have this - a big-picture view of what treatments are being planned for the patient. <br>\nFor example if I have one pescription and then change it for the same indication but adjust the dosage, that may be still a same Treatment.</p>",
        "id": 185339762,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578682761
    },
    {
        "content": "<p>I think the exact boundaries will depend on the jurisdiction, and to make these boundaries clear we may have to resort to examples.</p>",
        "id": 185340020,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578682862
    },
    {
        "content": "<p>so, <span class=\"user-mention\" data-user-id=\"245768\">@Tihomir Petrov</span> I think this is the answer I prefer (your mileage may vary):</p>\n<ol>\n<li>\n<p>MedRequests may simply point to the same Encounter, but this does not imply more than the circumstance they were authored. In other words, it does not make those requests a \"prescription\" - it's still a bunch of requests made in the same encounter.</p>\n</li>\n<li>\n<p>If you need to make that set of requests a consistent set:<br>\n2.1 </p>\n</li>\n</ol>\n<blockquote>\n<p>If you have a single order with multiple interdependent components, use RequestGroup. (It's possible that a RequestGroup might be adjusted over time - not necessarily a requirement that everything be ordered at once). </p>\n</blockquote>\n<p>2.2 </p>\n<blockquote>\n<p>If you simply want to capture that multiple things were ordered as part of the same ordering 'event', use groupIdentifier.</p>\n</blockquote>\n<ol start=\"3\">\n<li>If your notion of prescription means \"this person will be on PPIs for the rest of their life\", this will be a CarePlan (you probably don't need this, but it will be very handy when you need to make a medication record :))</li>\n</ol>",
        "id": 185340781,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578683256
    },
    {
        "content": "<p>MedicationRequests that point to the same encounter contain sufficient information in most cases. You may need groupIdentifier if either there is no Encoutner to group the MedicationRequests in a single prescription, or if you have circumstances where grouping all the Encounter's MedicationRequests is not allowed (in the paper world that would correspond to using a  <a href=\"https://www.filerx.com/catalog/ProductCategory.aspx?c=74\" target=\"_blank\" title=\"https://www.filerx.com/catalog/ProductCategory.aspx?c=74\">secure vs non-secure prescription pad</a>)</p>",
        "id": 185345545,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1578686372
    },
    {
        "content": "<p>I think the matter is not if they can be placed in the same context. For context, encounter is ok. <br>\nThe matter is \"are these authored together, and if so, is there a meaning in that togetherness\"</p>",
        "id": 185346828,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1578687198
    }
]