[
    {
        "content": "<p>For a legacy system, I have a feed that has the following medication information:</p>\n<p>Medication Code  (e.g. ABC123)<br>\nMedication Name (e.g. Citalopram)<br>\nDosage (e.h. 1 tablet 3 times a day)<br>\nMedication Quantity (45 tables)</p>\n<p>The challenge I have is (in STU3) where to put the Quantity. If I put this in Medication I have a challenge as this necessitates other mandatory information that I don't have. I note that the medication resource has had a bit of a redesign for R4 which alleviated this issue - but I am using STU3.</p>\n<p>Any advice on how to progress? I seem to have two options:</p>\n<ul>\n<li>Add an extension to Medication for the \"Quantity\" (as per R4)</li>\n<li>Use the medication code in Medication.Content.IntemCodeableConcept</li>\n</ul>\n<p>Has anyone else met this problem?</p>",
        "id": 177086248,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1569956114
    },
    {
        "content": "<p>This seems like it's representing dispense information - what med was given, dosage instructions and quantity supplied.  Is that the use-case?</p>",
        "id": 177086626,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569956359
    },
    {
        "content": "<p>In this case, it's not really a Request/Dispense/Administer workflow - it's just a statement of fact that the patient has certain medications.</p>",
        "id": 177087286,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1569956748
    },
    {
        "content": "<p>So quantity on hand?</p>",
        "id": 177087405,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569956818
    },
    {
        "content": "<p>(as of today)</p>",
        "id": 177087422,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569956830
    },
    {
        "content": "<p>- I'm trying to understand what the 'Medication Quantity' element represents</p>",
        "id": 177087443,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569956845
    },
    {
        "content": "<p>Good question - I assuming the original quantity. Also looking closer it is not in a structured form just a compound string like \"100 tablets\", \"10 capsules\", \"200 ml\" etc</p>",
        "id": 177087929,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1569957146
    },
    {
        "content": "<p>So a \"Quantity\" or \"Ratio\" datatype is going to be challenging...</p>",
        "id": 177088130,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1569957299
    },
    {
        "content": "<p>There's an original text extension you can use for those.  If it's talking about \"original quantity\", then that's either a total authorized quantity (which would be MedicationRequest) or a supplied quantity on a most recent dispense (MedicationDispense).  Presume you'd also need a link to the patient?</p>",
        "id": 177095811,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1569962390
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I see that is an R4 extension, but presumably can be used in STU3. And yes, there is a patient :-)</p>",
        "id": 177099934,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1569965521
    },
    {
        "content": "<p>Medication is not the right resource to represent this information.  Perhaps MedicationStatement or Usage - which represents medications that the patient or someone says they are taking.  You need to use either MedicationRequest, medicationDispense, MedicationAdministration or MedicationStatement/Usage to be able to include the patient that this is tied to.  Medication does not have a reference to a patient and the quantity in the Medication resource is intended to include the quantity per package (in STU3)  (ratio allows you to say 2ml per vial or 100 tablets per box).</p>",
        "id": 177104197,
        "sender_full_name": "Melva Peters",
        "timestamp": 1569969499
    }
]