[
    {
        "content": "<p>Is it appropriate to link to a Media resource as an attachment url? eg from Observation.valueAttachment.url</p>\n<p>To me the spec implies that this is not appropriate. However it feels like a reasonable thing to do if I want to make an image (or other media) available via both the Media and Observation resource without duplicating the media file. </p>",
        "id": 153826705,
        "sender_full_name": "Rowan Foster",
        "timestamp": 1462937661
    },
    {
        "content": "<p>It's a bit... indirect. In your <code>Media</code>, are you including content via base64 in <code>.content.data</code>?</p>",
        "id": 153826706,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1462938278
    },
    {
        "content": "<p>(I say \"indirect\" because it requires two hops to resolve: the first hop resolving to a Media resource with mime-type of application/json+fhir -- erm, and the content type would need to be worked out clearly, or a _format embedded in the link -- and the second hop to get the actual image.)</p>",
        "id": 153826707,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1462938365
    },
    {
        "content": "<p>It would be cleaner for clients if you just referred to the image directly in both cases.</p>",
        "id": 153826708,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1462938396
    },
    {
        "content": "<p>Yeah that is my feeling too. I'm considering the media link due to concerns of security of the image URL. The Media resource already has the meta-data required to determine whether the client is allowed to view the given image ie Media.subject and Media.meta.security</p>",
        "id": 153826709,
        "sender_full_name": "Rowan Foster",
        "timestamp": 1462938635
    },
    {
        "content": "<p>And by having a non-FHIR url it means that for a client to provide an image they will need to use a non-standards (FHIR) method thus annoying for 3rd party client implementations.</p>",
        "id": 153826711,
        "sender_full_name": "Rowan Foster",
        "timestamp": 1462938909
    },
    {
        "content": "<p>I've been looking at the Binary resource as well, but again as that does not deal with security related meta-data there seems to be no standard way to allow a client to upload media but also prevent access by those who should not be able to view it</p>",
        "id": 153826712,
        "sender_full_name": "Rowan Foster",
        "timestamp": 1462939109
    },
    {
        "content": "<p>you can refer to an media resource from a url, sure. But... what media type is the client going to ask for? Do you need to specify that in the url using _format? </p>",
        "id": 153826752,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1462963577
    }
]