[
    {
        "content": "<p>I'm using FHIR V3. The use case I'm trying to model is a medication review. A patient turns up a pharmacy perhaps for a repeat prescription, &amp; the pharmacist offers a medication review (to check that the patient is taking the medication correctly, knows why they are taking the medication etc.). A record of this conversation is then sent to the patient's GP. I'm using MedicationStatement to detail the medication, and for each medication I want to hold any matters of concerns identified (for example \"patient reports using the medicine as prescribed\"; \"patient reports not using the medicine as prescribed\"; \"patient reports side effects\" etc.). The concerns are part of a coded list, so I can't use MedicationStatement.text, as that's a text filed. My feeling is that the concern is an Observation on the medication. If that's right, I need to get from MedicationStatement to Observation. The short description of derivedFrom looks inviting \"Additional supporting information\", but the longer description \"Allows linking the MedicationStatement to the underlying MedicationRequest, or to other information that supports or is used to derive the MedicationStatement\", as well as the element name doesn't sit well. Any ideas?</p>",
        "id": 164174022,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1556201835
    },
    {
        "content": "<p>Observation will point to the MedicationStatement rather than the reverse.  The Observation.focus will be the MedicationStatement.</p>",
        "id": 164175669,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556202878
    },
    {
        "content": "<p>You could then query for Observations that point to the MedicationStatement using _revinclude</p>",
        "id": 164175683,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556202897
    },
    {
        "content": "<p>Is the pharmacist commenting on the MedicationAdministration, in particular <a href=\"https://www.hl7.org/fhir/valueset-reason-medication-not-given-codes.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-reason-medication-not-given-codes.html\">https://www.hl7.org/fhir/valueset-reason-medication-not-given-codes.html</a></p>",
        "id": 164175689,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1556202902
    },
    {
        "content": "<p>No - its a general medication review (aimed at repeat medication) to make sure the patient is taking the meds &amp; taking them at the right time etc.</p>",
        "id": 164178267,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1556204596
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I think that Observation.focus is a R4-ism, so I guess I'd be back porting an extension to STU3?</p>",
        "id": 164178592,
        "sender_full_name": "Dave Barnet",
        "timestamp": 1556204844
    },
    {
        "content": "<p>y</p>",
        "id": 164191496,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556213574
    },
    {
        "content": "<p>What about for recommendations related to medications? For instance, if I want a tell a patient and his/her practitioners that the pharmacist has a list of recommendations, e.g., stop taking this medication, change dose on this medication, and some that are not medication related, e.g., educate a patient about fall risks.  What resources are are used in this case?  Is this a procedure that a patient and a practitioner should do? Is it a list of observations that should happen?</p>",
        "id": 164266617,
        "sender_full_name": "Nathan Hall",
        "timestamp": 1556289020
    },
    {
        "content": "<p>A couple of possibilities.  You could just use the List resource and indicate the actions of add, remove, change for each MedicationRequest item.  Alternatively, you could create a CarePlan that indicates the recommendation.  <span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> - I believe the IHE has an IG for medication reconciliation</p>",
        "id": 164269638,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556290932
    },
    {
        "content": "<p>what about the patient action, for a pharmacist to talk to a patient about fall risks, that sounds like a procedure but procedures are supposed to be items that have alraedy been performed right?</p>",
        "id": 164274581,
        "sender_full_name": "Nathan Hall",
        "timestamp": 1556294541
    },
    {
        "content": "<p>You'd be looking at ServiceRequest, CommunicationRequest and/or CarePlan</p>",
        "id": 164277803,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556297264
    },
    {
        "content": "<p>Could you use a Procedure with a status of \"not-done\" This seems to be the best fit for our use-case as the other items suggested do not fit it very well. The CarePlan would be the parent resource consolidating all the different recommendations</p>",
        "id": 164282437,
        "sender_full_name": "John Josef",
        "timestamp": 1556300774
    },
    {
        "content": "<p>Procedure with a status of notDone reflects that the decision has been made to not do something (generally something that was ordered).  It can't be used to represent something that's <em>desired</em> to be done - that must always be one of the Request pattern resources (i.e. CarePlan, ServiceRequest, CommunicationRequest, etc.)</p>",
        "id": 164284691,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556302204
    }
]