[
    {
        "content": "<p>MedicationOrder - is there an example or way to support Signing of orders</p>\n<p>We have millions of orders in our EHR.  Not all of them are signed, as physicians can call orders in and the nurse enters them in the EHR.  We have a requirement to implement a SMART FHIR app to present physicians with all the orders they need to sign.  Has anyone implemented or thought of implementing Order Signing via FHIR?  Via Order, Workflow, or combo resource and operation.</p>\n<p>Thank you</p>\n<p>Radu</p>",
        "id": 153846278,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1472824253
    },
    {
        "content": "<p>what does 'signing' mean? </p>",
        "id": 153846319,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472848599
    },
    {
        "content": "<p>Good question. Electronic signatures are often 'signed' by private keys (heavy on the implementation). Don't know if that is what is meant.</p>",
        "id": 153846320,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1472848728
    },
    {
        "content": "<p>signing can mean all sorts of things.... </p>",
        "id": 153846328,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472849261
    },
    {
        "content": "<p>The Provenance resource includes support for a signature. That signature could be of various types including Digital Signatures. There are some open issues with this concept, especially given how a Create operation is often done, support for automatic conversion from/to XML and JSON, and some other operational issues that have come up. The community is very focused on getting the FHIR data-model and interaction model done, and things like signatures have not yet been a major focus. So, we have captured the open issues. We need a community that is comfortable with FHIR that needs signatures to help work through these issues.<br>\n<a href=\"http://wiki.hl7.org/index.php?title=FHIR_Digital_Signature_Working_Page\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Digital_Signature_Working_Page\">http://wiki.hl7.org/index.php?title=FHIR_Digital_Signature_Working_Page</a></p>\n<p>Some solutions might be constraints on the variability, and constraints on what gets signed. This is certainly possible today.</p>\n<p>I also have a blog article on this<br>\n<a href=\"https://healthcaresecprivacy.blogspot.com/2014/12/digital-signatures-on-fhir.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2014/12/digital-signatures-on-fhir.html\">https://healthcaresecprivacy.blogspot.com/2014/12/digital-signatures-on-fhir.html</a></p>",
        "id": 153846357,
        "sender_full_name": "John Moehrke",
        "timestamp": 1472916838
    },
    {
        "content": "<p>Signing in our world means the Physician has acknowledged / signed orders he/she is responsible for initiatiating in the EHR, by using his role / credentialing and NPI.  The more complicated part is that in our dialysis clinics, an order can be consumed / carried out / administered before the physician signs it, therefore Order Status (draft, active, ...) is not the best way to represent it.</p>",
        "id": 153846628,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1473211073
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192495\">@Radu Craioveanu</span> I am confused by your statement. There is a concept of approval that is implemented simply as a workflow step. This doesn't require that a formal signature be captured. The order status would be an indicator of the status, it doesn't capture evidence of a signature event. What I am referring to is when there is a need to capture evidence of a signature event (ceremony), the general solution for that is to use Provenance. That Provenance resource would point at your object (e.g. Order),  and would contain a Provenance.signature element. This signature element might be a cryptographic form (which is what the Digital Signature page is about), or might contain some non-cryptographic evidence such as a scanned image of ink on paper.    What you describe seems closer to a workflow step, but I can't tell if more is needed. You also then at the end indicate it is not the status of the order.</p>",
        "id": 153846665,
        "sender_full_name": "John Moehrke",
        "timestamp": 1473250952
    }
]