[
    {
        "content": "<p>The Pharmacy Work Group is currently investigating the requirements for a MedicationKnowledge or \"drug information\" type resource.  A draft resource has been added to the current build.  We are seeking input from implementers on the resource - both what has been proposed in the first draft as well as other requirements.  <a href=\"http://build.fhir.org/medicationknowledge.html\" target=\"_blank\" title=\"http://build.fhir.org/medicationknowledge.html\">http://build.fhir.org/medicationknowledge.html</a></p>",
        "id": 153952573,
        "sender_full_name": "Melva Peters",
        "timestamp": 1523913548
    },
    {
        "content": "<p>How should that input be? Gforge items or on the mailing list?</p>",
        "id": 153952574,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1523913598
    },
    {
        "content": "<p>You can add your comments in to Gforge</p>",
        "id": 153952575,
        "sender_full_name": "Melva Peters",
        "timestamp": 1523914116
    },
    {
        "content": "<p>I checked the resource but I don't understand its scope. Perhaps best to discuss at Cologne what is the problem this is tyring to solve or what are the use cases.</p>",
        "id": 153952883,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1524032694
    },
    {
        "content": "<p>We have a need to consult/exchange and cross-check product definition information; FHIR is the perfect way to do that, but i don't see what requirements are met with this resource.</p>",
        "id": 153952884,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1524032754
    },
    {
        "content": "<p>I'm wondering if management of drug formularies is in scope of this resource, e.g. a List or Catalog of MedicationKnowledge resources.</p>",
        "id": 153952950,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1524063753
    },
    {
        "content": "<p>that is the need i was pointing to, but this resource seems only partially targeted at the use cases I have there.</p>",
        "id": 153952951,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1524063890
    },
    {
        "content": "<p>formularies can cover officinal preparations, but this one doesn't seem to go there. formularies also explain cost breakdowns,  the use of \"code\" seems closer to what you'd say in a prescription than what you'd use in a formulary...</p>",
        "id": 153952953,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1524064122
    },
    {
        "content": "<p>so i think I have a different use case in mind, given the gaps.</p>",
        "id": 153952954,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1524064166
    },
    {
        "content": "<p>my use case is :<br>\nI need to query medicine definitions - in a ad-hoc query or i get them as a catalog, from a vendor.  The definitions (the type and value of the attributes) can be locally defined or regulated, and i need te enrich that definition and serve it forward. I need to relate drugs to other drugs (and also to conditions and to \"contexts\"). \"medicine\" can be a regulated drug, a local formula my hospital defined last year, or something i just made up.</p>",
        "id": 153952957,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1524064428
    },
    {
        "content": "<p>sorry for the informal use case description :-)</p>",
        "id": 153952958,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1524064447
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191393\">@Igor Sirkovich</span> That is definitely one of the use cases that we are trying to meet.  In addition, we have implementers who are implementing drug terminologies that are providing requirements.</p>",
        "id": 153952960,
        "sender_full_name": "Melva Peters",
        "timestamp": 1524064798
    },
    {
        "content": "<p>Hi. A couple of questions - not sure they were already considered:</p>\n<ol>\n<li><code>MedicationKnowledge.ingredient.isActive</code> - I understood this was going to change to <code>.role</code>as a CodeableConcept?</li>\n<li>MedicationKnowledge.relatedMedicationKnowledge.type - is this the type of the related medication? Or it is the type of the relation? I'm looking for relations of different types, like \"can be used in\", \"is specialization of\", or \"is usually given with\"</li>\n</ol>",
        "id": 216236858,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1605025980
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> ?</p>",
        "id": 216239229,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1605026978
    },
    {
        "content": "<p>1) We are looking at switching to using the Ingredient resource/type.  Until that resolves, we aren't considering making any changes at this time.<br>\n2) We are working through all of our vocabulary bindings to provide example value sets, but we need to use UTG or get a ruling that we don't have to use UTG, so it is taking awhile.</p>",
        "id": 216239749,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605027175
    },
    {
        "content": "<p>Ok on 1 (not using the resource/type, but understand no decision until then). This is such an old discussion that I was afraid we'd changed and changed back already.</p>",
        "id": 216241270,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1605027834
    },
    {
        "content": "<ol start=\"2\">\n<li>I don't mean the terminology, this is a CodeableConcept and that is fine.<br>\nI meant the description of the field: This being a Key-value pair, I'd expect the relatedMedKnowledge.type to be about the type of relation, but the description says \"The category of the associated MedicationKnowledge reference\".</li>\n</ol>",
        "id": 216241659,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1605027977
    },
    {
        "content": "<p>That is correct.  And when we have the example value set, you'll see what types of values we intended with this.</p>",
        "id": 216241762,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1605028026
    },
    {
        "content": "<p>Then for the type of relationship do I need an extension?</p>",
        "id": 216244867,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1605029421
    },
    {
        "content": "<p>(the category of the type of medication knowledge is actually already in the target medicationknowledge, I don't see what this attribute in the relationship could be. An example would help)</p>",
        "id": 216245102,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1605029526
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> do I expect to need an extension for the type of relation? Better, do you recall one example value (I don't need the value set)</p>",
        "id": 216376516,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1605116659
    }
]