[
    {
        "content": "<p>Is there any provision for media thumbnails? if the media is a video, we''d have a frame from a video. if a still image, we'd have a small jpeg...</p>",
        "id": 153927169,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1514482546
    },
    {
        "content": "<p>Jose, where the image is a DICOM image. First ImagingStudy would be used, not Media. The thumbnails can be gotten with the DICOM web access method. There is strong pushback on duplicating that API since it already exists and is well implemented in the DICOM world. <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span></p>",
        "id": 153927170,
        "sender_full_name": "John Moehrke",
        "timestamp": 1514484181
    },
    {
        "content": "<p>Ok, I can park DICOM for now, my interest is on the thumbnails. <br>\nQuestion is: I have a video or an image and i want a thumbnail with it .  do we rely exclusively on the media's embedded thumbnails? Or is there a way to represent an additional thumbnail?</p>",
        "id": 153927171,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1514484386
    },
    {
        "content": "<p>would have to be an extension right now</p>",
        "id": 153927185,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514496472
    },
    {
        "content": "<p>You could have two Media resources pointing at the full and thumbnail... but you would need to somehow relate them possibly with .partOf.</p>",
        "id": 153927191,
        "sender_full_name": "John Moehrke",
        "timestamp": 1514498308
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> - interesting question. Can you file a tracker? This could be either a standard extension or a new element.</p>",
        "id": 153929733,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1516396362
    },
    {
        "content": "<p>#14532.<br>\nI think having two media resources could be better to allow pre-display of thumbnails.  I don't think .partOf should be relation to use, but rather a new relation (partOf is about the event, not about the content, and is not specific to say which is the thumbnail and which is the real thing. Details to be figured out in discussions.</p>",
        "id": 153930502,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516813526
    },
    {
        "content": "<p>Thanks. My inclination is an extension or new attribute for a thumbnail image, but we can discuss.</p>",
        "id": 153930505,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1516814571
    },
    {
        "content": "<p>yep, one reason to have a separate resource would be to be able to fetch the thumbnails without getting all the actual media.<br>\nIsn't there a feature to get only some parts of the resource? Because that could work too</p>",
        "id": 153930507,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1516814810
    },
    {
        "content": "<p>Yes, there is the ability to only retrieve some elements. (I'd need to double check if you can do that for extensions.) The other thing is I hope that people will use or profiles will require use of content.url rather than content.data.</p>",
        "id": 153930508,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1516815442
    }
]