[
    {
        "content": "<p>We want to maintain a medications 'reconciled' list for a patient which we are currently achieving this by creating a list of MedicationStatement entries. We have alot of data we want to store about the reconciled list that may be quite fluid and there is no neat place for data to reside so we were thinking of extending the list to reference a QuestionnaireResponse resource and define the data we want to store using a Questionnaire definition. The UI could also leverage the SMartQ framework. What are peoples thoughts on this approach? And how would I create an extension to a List resource that references a QuestionnaireResponse?</p>",
        "id": 153874117,
        "sender_full_name": "Paul Barry",
        "timestamp": 1488317972
    },
    {
        "content": "<p>Can you give examples of the kinds of additional data you want to store?</p>",
        "id": 153874119,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488318978
    },
    {
        "content": "<p>Location, reconciliation reason (drop down) , role of clinician, Risk Assessment Options (multi-select check box options), Other identified risks. </p>",
        "id": 153874139,
        "sender_full_name": "Paul Barry",
        "timestamp": 1488326767
    },
    {
        "content": "<p>Those sound like reasonable extensions to the List or the List item.  I wouldn't recommend putting that of information in an embedded Questionnaire.  (Though you could use a Questionnaire to define the set of information to populate in the List and generate List instances from QuestionnaireResponse instances.</p>",
        "id": 153874184,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488339358
    },
    {
        "content": "<p>What would be most adequate - list or collection?</p>",
        "id": 153874218,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488363282
    },
    {
        "content": "<p>We want to specify medication orders for a particular time of day, e.g. Take 2 tablets at 08h00 and at 12h00 and at 18h00.<br>\nA great post by Jamie Hignite here <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12352\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12352\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12352</a></p>\n<p>Jamie's suggestion looks great, i.e.:<br>\nThere should be a list of times in the repeat object to allow for this repeated section.  So that it is understood that the repeating times are within the outer repeating period<br>\nMedication order dosageInstruction would look like this:<br>\n\"dosageInstruction\": [{<br>\n              \"text\": \"Take 4 tablets daily for 7 days starting January 16, 2015\",<br>\n              \"timing\": {                           <br>\n                  \"repeat\": {    <br>\n                      \"boundsPeriod\": {<br>\n                        \"start\": \"2015-01-16\",<br>\n                            \"end\": \"2015-01-20\"<br>\n                      }                        <br>\n                    \"timesOfDay\":{   //&lt;-- List of times - here is where the times would be for every period <br>\n                        \"06:00\",<br>\n                        \"17:00\",<br>\n                        \"21:00\"    <br>\n                    }<br>\n                }</p>",
        "id": 153874342,
        "sender_full_name": "jens andreas",
        "timestamp": 1488419505
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> I'm not understanding your question</p>",
        "id": 153874365,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488432095
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> questions is whether the resource to convey a medication list (a list of medication-related resources) would be a list or a composition. list seems limited</p>",
        "id": 153874380,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488446213
    },
    {
        "content": "<p>Medication list would definitely be List.  What are the limitations that are causing issues?</p>",
        "id": 153874443,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488470638
    },
    {
        "content": "<p>From the definitions: <br>\nThe List resource - enumerates a flat collection of resources and provides features for managing the collection. While a particular List instance may represent a \"snapshot\", from a business process perspective, the notion of \"list\" is dynamic – items are added and removed over time. The List resource references other resources. Lists may be curated and have specific business meaning.<br>\nThe Composition resource - defines a set of healthcare-related information that is assembled together into a single logical document that provides a single coherent statement of meaning, establishes its own context and that has clinical attestation with regard to who is making the statement. The Composition resource provides the basic structure of a FHIR document. The full content of the document is expressed using a bundle containing the Composition and its entries.</p>",
        "id": 153875209,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488885685
    },
    {
        "content": "<p>If I read this, I think that if you want to have somethign that can be authored as a clinically valuable document, you'd use the composition.</p>",
        "id": 153875210,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488885743
    },
    {
        "content": "<p>Perhaps relevant: IMO, if you want to exchange medication data, you would use a list (or even bundle?) but for a compiled, authored list, we would have a composition.</p>",
        "id": 153875211,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488885805
    },
    {
        "content": "<p>I have been pushing for awareness that \"medication records\" are not a simple document, but the outcome of several \"ingredients\" that go through a process -reconciliation, aggregation... and if you want to operate, you'd best exchange the ingredients, and not the summary</p>",
        "id": 153875212,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1488885926
    },
    {
        "content": "<p>If you want a document - frozen, non-updated point-in-time snapshot, focus on human readability and attested by the author, then a FHIR document (with Composition as your 'header') is the way to go.  But Medication lists are generally dynamic things and when you query them, you want the current view, not some snapshot that was incorporated in a document 5 months ago.  If you have a discharge summary or a referral, those may well be wrapped as documents and will contain frozen snapshots of lists.  But the concept of medication list generally is not document-like.</p>",
        "id": 153875251,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488910872
    },
    {
        "content": "<p>-</p>",
        "id": 153880206,
        "sender_full_name": "Kevin O'Shea",
        "timestamp": 1490756355
    }
]