[
    {
        "content": "<p>The Medication resource doesn't have a reference to a Patient.  With this in mind, how is a FHIR-based system supposed to deal with a MedicationRequest or MedicationAdminstration reference to the Medication when the Medication is updated separately from the MedReq or MedAdmin?    If we assume the Medication resources represents orderable drugs in the Pharmacy (Formulary) and then the hospital pharmacy changes something about the Medication (e.g. a different supplier but same code) what happens to those orders and admins that reference it?  If a drug has already been administered to a particular patient, but the Medication resource is changed, how is that dealt with?   Another 'use case' is that there may be individual tracking numbers for the drug lot (or for controlled substances some other unique id).  Is the expectation that the Medication resource in this case would have a unique code and then it would only be used for one patient's order and administration?   It seems without a Patient reference it is hard to 'back trace' which meds were given to which patients, e.g. if there was a drug lot recall or some newly discovered side effect that needed to be communicated to specific patients.</p>",
        "id": 153971987,
        "sender_full_name": "John Silva",
        "timestamp": 1530057394
    },
    {
        "content": "<p>you would trace that back through the patient connected resources that link to the medication</p>",
        "id": 153972007,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530072846
    },
    {
        "content": "<p>On the MedicationAdministration side (and possibly MedicationDispense), you might be more likely to point to a specific Medication instance that has a particular lot number.  It would have the same code but a different id - one Medication resource for each \"lot\" the system had to deal with.  But you'd still trace to patient through the MedicationAdministration.</p>",
        "id": 153972030,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530077114
    },
    {
        "content": "<p>Yes, I understand that you'd have to 'back trace' the Medication through the resources that reference it; but that's not the real issue I'm trying to raise.   The problem I'm trying to ask about is because the Medication does NOT have a unique \"instance identifier\" (identifier property) but a \"class identifier\", it has a  code property which could be something like an NDC or RxNorm code; this does not uniquely identify the specific drug (lot/instance of the drug) that was given to the patient.    If the pharmacy changes the lot or even vendor (for a generic) for a Medication and updates the resource in the FHIR server, these would (could) be using the same NDC or RxNorm code but the resources that reference it would no longer have traceability to what they gave at the time of order or administration.  (I'm assuming the Medication resource is maintained by the Pharmacy as their 'current formulary' and can be updated separately from the MedReqs and MedAdmins which reference them.)</p>",
        "id": 153972052,
        "sender_full_name": "John Silva",
        "timestamp": 1530095763
    },
    {
        "content": "<p>It sounds to me like there's a chicken and egg problem here - if the institution wants to track these kind of changes, it shouldn't make those kind of changes?</p>",
        "id": 153972200,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530129555
    },
    {
        "content": "<p>The resource will always have a resource id - which should be good enough</p>",
        "id": 153972211,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530130711
    },
    {
        "content": "<p>since the medication resource contains both \"kind\" (catalog-like information) and \"instance\" (lot, serial), then if the hospital has 1000 boxes of a medication each with a serial number, then the hospital my end up with 1001 resources  - one is the medication for the \"formulary\", but each of the physical boxes will have its own resource on the server.</p>",
        "id": 153972258,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530137683
    },
    {
        "content": "<p>the drug codes are not what distinguishes two boxes given to different patients - it is the resourceID (or other attributes)</p>",
        "id": 153972259,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530137720
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  - thanks, this brings up the core of the question/issue I'm trying to raise.  So, each of those 1001 resources would all have the same code, e.g .the NDC code for that drug (by a specific manufacturer) but each would have a different serial number; this serial number is an example of the 'instance identifier' I'm referring to.   So where would this serial number be in the Medication resource?  I don't see a property in the resource that allows you to have/put this 'instance identifier'?   (most other resources have an identifier property which allows the unique 'business identifier' (what the clinical systems  use to refer to something, not the 'internal id' (resource id) that FHIR uses.)   With your example, unless I'm missing something, there doesn't seem to be a way to query for a specific instance of a drug (by serial number) only maybe by code (drug code, i.e. a 'class identifier') or lot number, but neither of these are unique -- they would return the 1001 Medication resources from the server!   Also, in my other recent thread about Medications and their therapeutic category <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span>  also raises a question about a related problem with the Medication resource 'not being an instance'.     The problem here as it relates to not having a unique \"business identifier\" is that when a drug is ordered for a specific patient at a specific time, the ordering physician is using it at that moment for a specific purpose, therefore, if you will, from a specific therapeutic category.  (Today I'm using drug X as a weight loss drug, tomorrow I'm using the same drug as a anti-depressant).</p>",
        "id": 153972333,
        "sender_full_name": "John Silva",
        "timestamp": 1530177470
    },
    {
        "content": "<p>.id</p>",
        "id": 153972335,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530177523
    },
    {
        "content": "<p>the medication resourcs IS kind and instance at the same time - we my want to review that to align with Device,</p>",
        "id": 153972336,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530177696
    },
    {
        "content": "<p>in my example, all these medication resources would be the same, except the resource .id would be different for each one of them</p>",
        "id": 153972337,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530177770
    },
    {
        "content": "<p>here is a draft analysis of the \"product\" resources and how they convey \"kind\" or \"instance\" data<br>\n<a href=\"/user_uploads/10155/Sw7Pkhc7CHUd7vUiN9makSB0/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Sw7Pkhc7CHUd7vUiN9makSB0/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/Sw7Pkhc7CHUd7vUiN9makSB0/pasted_image.png\"></a></div>",
        "id": 153972338,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530177892
    },
    {
        "content": "<p>Medications (generally) don't have serial numbers.  So all you have is the <a href=\"http://Resource.id\" target=\"_blank\" title=\"http://Resource.id\">Resource.id</a> - but that should be sufficient.</p>",
        "id": 153972339,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530179256
    },
    {
        "content": "<p>What about 'custom-mixed' drugs, i.e. something that the Pharmacy 'mixes up' (not correct Pharmacy term) for a specific patient?   Those would have a unique identifier (and bar code) to ensure the 5-rights!   It seems to me that there needs to be a 'business identifier' for Medications not just relying on the 'resource id'.    Have these types of use cases been discussed in the Pharmacy committee?    (Related:  how would do 5-rights bar-code checking before giving the patient the specific, custom-mixed drug without a 'business identifier' related to the bar code?   The Pharmacy isn't going to create the bar code to be the FHIR resource id.)</p>",
        "id": 153972340,
        "sender_full_name": "John Silva",
        "timestamp": 1530180375
    },
    {
        "content": "<p>yes, they have</p>",
        "id": 153972341,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530180458
    },
    {
        "content": "<p>but if you mix two items to create a new one, you can have another resource id</p>",
        "id": 153972342,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530180486
    },
    {
        "content": "<p>The question is whether you're going to have the same medication \"instance\" on multiple servers and need to be able to trace that it's exactly the same instance.  If we have a use-case for that, then that would justify having Medication.identifier</p>",
        "id": 153972343,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1530180717
    },
    {
        "content": "<p>Even if there aren't multiple FHIR servers involved there seems to be a need to have a \"business identifier\" that is separate from the internal resource id.  The Pharm system knows it's assigned (business) identifiers not the internal FHIR resource id.   (Also, if we're getting this 'business identifier\" from an HL7 V2.x message ...)</p>",
        "id": 153972344,
        "sender_full_name": "John Silva",
        "timestamp": 1530180828
    },
    {
        "content": "<p>If we do need that identifier, we'd  rather use serial number, right? I don't see why having an .identifier</p>",
        "id": 153972345,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530180859
    },
    {
        "content": "<p>so, external systems can refer to serial number if they are existing.</p>",
        "id": 153972346,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530180943
    },
    {
        "content": "<p>inside the server, each resource with a unique serial number will be a different instance, so that the server stores those separately</p>",
        "id": 153972347,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530180978
    },
    {
        "content": "<p>Hello John. Can 'MedicationRequest.subject' not be used to identify the patient for each Medication Request? This can be linked to 'MedicationRequest.identifier' which gives each medication/prescription order a unique ID.</p>\n<p><a href=\"/user_uploads/10155/BzdR0ACHeLPbxd34VI0t69vu/HL7-FHIR-descriptions-for-Medication-Request-HL7V2-mapings.xlsx\" target=\"_blank\" title=\"HL7-FHIR-descriptions-for-Medication-Request-HL7V2-mapings.xlsx\">HL7-FHIR-descriptions-for-Medication-Request-HL7V2-mapings.xlsx</a></p>",
        "id": 153972350,
        "sender_full_name": "Andrew Gledhill",
        "timestamp": 1530184294
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  Is there an existing property for storing the 'serial number' or would you expect to use a repeat of the code?   I didn't see one; I only saw something related to the batch.lotNumber (which is not unique, in your example it refers to 'all tablets' in the same box/lot)</p>\n<p><span class=\"user-mention\" data-user-id=\"195487\">@Andrew Gledhill</span>  - yes, the linkage using the MedicationRequest.subject.reference (and MedAdm subject.reference) can be used to link back to the Medication, but the problem is that the Medication is a 'class of medications' not a specific instance of a Medication given to a specific patient.   For example, at the time of the MedicationRequest (ordering) the doctor requests a specific type of drug, e.g. Acetaminophen, but at the time the pharmacist gets it (in HL7 V2 speak - the difference between the OMP and the RDE message) they choose a specific drug that is stocked in the pharmacy, e.g. Tylenol (by Bayer) with a specific NDC or RxNorm code.    So now we have the situation that the reference to the Med in the MedReq is or can be different from the drug actually in the 'encoded order' and then later on when the Med is actually administered, there might be a specific lotNumber and serialNumber in the case of a 'controlled substance' or specially 'mixed' drug.   How are we supposed to keep track of this?   The ordering system (e.g. CPOE) and the pharmacy system (PIS) and the administration system (EHR ?)  are not going to know about the FHIR internal resource Id (nor should they); they need their own business identifier it seems.</p>",
        "id": 153972358,
        "sender_full_name": "John Silva",
        "timestamp": 1530190577
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span> <a href=\"http://build.fhir.org/medication-definitions.html#Medication.batch.serialNumber\" target=\"_blank\" title=\"http://build.fhir.org/medication-definitions.html#Medication.batch.serialNumber\">http://build.fhir.org/medication-definitions.html#Medication.batch.serialNumber</a></p>",
        "id": 153972359,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530190640
    },
    {
        "content": "<p>Ah, thanks!  I was looking at the STU3 resource, which doesn't have this!</p>",
        "id": 153972360,
        "sender_full_name": "John Silva",
        "timestamp": 1530190728
    },
    {
        "content": "<blockquote>\n<p>the problem is that the Medication is a 'class of medications' not a specific instance of a Medication given to a specific patient.</p>\n</blockquote>\n<p>Medication currently has the double role of referring to Kind and Instance</p>",
        "id": 153972361,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530190731
    },
    {
        "content": "<p>in Device we are actually clearing that up, and it is possible that if that works well, we would check with(in) Pharmacy if Medication should do something similar.</p>",
        "id": 153972362,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530190796
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  -- thanks!  Now I see it in R4 -- this seems like it would address the use cases I mentioned (of course Pharmacy folks have been thinking of this longer than me!)   Yes, the Medication is both a Kind (class) and an Instance!   (In the Formulary it's a Kind/class, once administered to an individual patient it's an instance -- I'm not sure about when it's in the (non-encoded, OMP) order; is that a Kind or an Instance?</p>",
        "id": 153972363,
        "sender_full_name": "John Silva",
        "timestamp": 1530190925
    },
    {
        "content": "<blockquote>\n<p>when the Med is actually administered, there might be a specific lotNumber and serialNumber in the case of a 'controlled substance' or specially 'mixed' drug. How are we supposed to keep track of this? </p>\n</blockquote>\n<p>easy: <br>\nsay you have these resources: <br>\nmedication001: The \"kind\" (no lot number or serial)<br>\nmedication002: instance 1 (same as medication001, but with serial number 00A)<br>\nmedication003: instance 2 (same as medication001, but with serial number 00B)</p>",
        "id": 153972364,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530190959
    },
    {
        "content": "<p>Yep, makes sense -- but what about the unencoded order?  I suppose that uses the Kind (i.e NDC code but does not yet have a unique lotNumber or serialNumber)    It still seems strange though that the ordering system doesn't have a unique business identifier to refer to it.   The problem here is that if the order (OMP and RDE) creates a reference to a Medication Kind but then the administration (RAS) now refers to a different instance of the Medication with the only traceability via the code (e.g. NDC code).</p>",
        "id": 153972365,
        "sender_full_name": "John Silva",
        "timestamp": 1530191050
    },
    {
        "content": "<p>Prescription mentions medication001 (they don't need/care about a specific kind in most cases)<br>\nwhen administering in themorning, the system registers medication002<br>\nwhen administering in the afternoon, the resource used is medication003</p>",
        "id": 153972366,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530191086
    },
    {
        "content": "<p>medication001, medication002 and medication003 are the <a href=\"http://medication.id\" target=\"_blank\" title=\"http://medication.id\">medication.id</a> attributes</p>",
        "id": 153972367,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530191112
    },
    {
        "content": "<p>Yes, but the order and administration systems do not get to assign these <a href=\"http://medication.id\" target=\"_blank\" title=\"http://medication.id\">medication.id</a> properties; those are assigned internally by the FHIR server.  There doesn't seem to be a good way for the ordering and admin systems to be able to refer back to these drugs in a consistent way; that's why it 'feels' like a business identifier is needed.</p>",
        "id": 153972368,
        "sender_full_name": "John Silva",
        "timestamp": 1530191249
    },
    {
        "content": "<p>yep</p>",
        "id": 153972369,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530191261
    },
    {
        "content": "<p>and you are correct, <br>\nif the order (OMP and RDE) creates a reference to a Medication Kind but then the administration (RAS) now refers to a different instance of the Medication with the only traceability via the code (e.g. NDC code).<br>\nThis is a known challenge in Kind/Instance. In Device we are resolving it by stating \"this thing is a device instance, and here is a link to the kind that this thing is an instance of\"</p>",
        "id": 153972371,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530191320
    },
    {
        "content": "<p>So in the Device use case is there a unique \"business identifier\" that can be used to refer to the specific instance of the device, e.g. a module with a unique serial number?</p>",
        "id": 153972372,
        "sender_full_name": "John Silva",
        "timestamp": 1530191439
    },
    {
        "content": "<p>so IMO the link between kind and instance must not be the NDC code</p>",
        "id": 153972373,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1530191448
    },
    {
        "content": "<p>agree, but this still leaves us with the problem of how can we do this (w/o an identifier assigned by the business system)?</p>",
        "id": 153972374,
        "sender_full_name": "John Silva",
        "timestamp": 1530191495
    }
]