[
    {
        "content": "<p>Hello all,<br>\nhope all is well. I have come to know that in USA practitioners can prescribe substances to patient. In this use case, is there any option to reference substance to medication request?<br>\nThanks</p>",
        "id": 238608926,
        "sender_full_name": "Krishna Moorthi",
        "timestamp": 1620905083
    },
    {
        "content": "<p>Can you give an example of your use case ?</p>",
        "id": 238611423,
        "sender_full_name": "David Pyke",
        "timestamp": 1620906936
    },
    {
        "content": "<p>there is no option to reference a substance.  substances can be ingredients in a medication and they may be the only ingredient, but you prescribe medications.  Depending on your medication code system, there will be high-level codes for \"ferrous glucomate\" that are brand-independent.</p>",
        "id": 238639533,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1620920784
    },
    {
        "content": "<p>Agree.  Medications are prescribed.  If there is no code for the medication (as may be the situation for compounded products), then the Medication can be specified as a contained resource that may point to substances as ingredients, but this is not the common scenario.  Most medication terminologies include codes for medications at the level of a 'generic' formulation such as ferrous gluconate rather than at a branded product level.</p>",
        "id": 238651388,
        "sender_full_name": "Melva Peters",
        "timestamp": 1620926150
    },
    {
        "content": "<p>thanks for all your inputs. it helped me to take a decision on this topic.</p>",
        "id": 238654851,
        "sender_full_name": "Krishna Moorthi",
        "timestamp": 1620927795
    },
    {
        "content": "<p>I'm assuming that you are all aware of  <a href=\"https://www.nps.org.au/consumers/active-ingredient-prescribing-all-you-need-to-know\">Active Ingredient Prescribing</a> in Australia?</p>",
        "id": 238680973,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1620939842
    },
    {
        "content": "<p>I knew a little about that.  Canada has had this type of prescribing already.  As an example, many antibiotic prescriptions are for Amoxicillin as opposed to any specific brand such as Amoxil, Trimox, Apo-Amoxicillin, etc.  When they say that Active Ingredient must be indicated and then the brand name, is that what they are referring to?  If I was prescribing Tylenol #3s in AU, would I just prescribe \"acetaminophen and codeine\"?</p>",
        "id": 238685978,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1620942380
    },
    {
        "content": "<p>An example <a href=\"https://bpsoftware.net/active-ingredient-prescribing/\">here</a>. Full details <a href=\"https://www.safetyandquality.gov.au/our-work/medication-safety/active-ingredient-prescribing\">here</a></p>",
        "id": 238689515,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1620944280
    },
    {
        "content": "<p>Thanks Peter, assuming that there are going to be Medication codes for what Australia is calling the Active Ingredient, then the Medication resource will work.  In Canada, we don't call that the \"Active Ingredient\", but we have similar prescribing capability.</p>",
        "id": 238763093,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1620997554
    }
]