[
    {
        "content": "<p>Hello, is this the right forum where someone implementing software based on FHIR can ask questions about how to use the model?</p>",
        "id": 153891363,
        "sender_full_name": "Farrukh Najmi",
        "timestamp": 1495817146
    },
    {
        "content": "<p>I am implementing software that aims to aligns with FHIR. I am looking for the recommended way to do the following:</p>\n<p>1. Configure for a patient the schedule of when to take a medication<br>\n2. Record that a medication failed to be administered at a scheduled time</p>\n<p>For (1) the closest class seems to be MedicationStatement where I can track the Medication and the planned Dosage which includes Timing<br>\nFor (2) I could record a MedicationStatement for each missed medication.</p>\n<p>Does this seem correct? </p>\n<p>BTW, the model is unclear on the relationship between MedicationStatement and MedicationRequest / MedicationAdministration.</p>",
        "id": 153891364,
        "sender_full_name": "Farrukh Najmi",
        "timestamp": 1495817326
    },
    {
        "content": "<p>For #1, MedicationStatement or MedicationRequest are possibilities.  (The latter is appropriate if you're dealing with specific prescriptions/orders, the former if you're dealing with planned/scheduled meds in general, whether ordered or not.)  For #2, I'd go with MedicationAdministration.  MedicationStatement is summary level.  MedicationStatement is a summary resource.  MedicationAdministration deals with individual occurrences.</p>",
        "id": 153891368,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1495817753
    },
    {
        "content": "<p>For (1) I am using MedicationRequest for the order but then the patient can configure the Timing of when they take the med (modulo the order). I need to record the patient-specific medication schedule config somewhere. Based on your suggestion I will use MedicationStatement.</p>\n<p>For (2) I thought MedicationAdministration was to record actual administration. Perhapos I am wrong. It would definitely be simpler to use MedicationAdministration to record missed administrations. Still agree using MedicationAdministration?</p>\n<p>Thanks Lloyd!</p>",
        "id": 153891370,
        "sender_full_name": "Farrukh Najmi",
        "timestamp": 1495817975
    },
    {
        "content": "<p>MedicationAdministration.notGiven supports the ability to convey that the administration is not given (with MedicationAdministration.reasonNotGiven explaining why it wasn't given)</p>",
        "id": 153891372,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1495818194
    },
    {
        "content": "<p>Excellent! I missed that. Thanks Michelle and Lloyd for helping me out.</p>",
        "id": 153891373,
        "sender_full_name": "Farrukh Najmi",
        "timestamp": 1495818281
    },
    {
        "content": "<p>Hello,<br>\nI have a question regarding MedicationRequest.<br>\nI am upgrading my application from FHIR dstu2:1.4 to dstu3:2.4. <br>\nI am updating MedicationOrder resource (<a href=\"https://hl7.org/fhir/DSTU2/medicationorder.html\" target=\"_blank\" title=\"https://hl7.org/fhir/DSTU2/medicationorder.html\">https://hl7.org/fhir/DSTU2/medicationorder.html</a> ) as MedicationRequest resource (<a href=\"https://www.hl7.org/fhir/medicationrequest.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/medicationrequest.html\">https://www.hl7.org/fhir/medicationrequest.html</a> )<br>\nBut I am not sure which element “dateEnded” - when prescription was stopped in MedicationOrder would map to in MedicationRequest.<br>\nThanks in advance!</p>",
        "id": 153891817,
        "sender_full_name": "Anjali Vartak",
        "timestamp": 1496259296
    },
    {
        "content": "<p>In STU3 this is considered to be part of EventHistory which references Provenance.</p>",
        "id": 153891822,
        "sender_full_name": "Melva Peters",
        "timestamp": 1496262172
    },
    {
        "content": "<p>I will just add that you can communicate when the order <em>should</em> end using MedicationRequest.dosageInstruction.timing.boundsPeriod.end<br>\nThe tricky part about using MedicationRequest.eventHistory for when the order <em>actually</em> ended is that the eventHistory says  </p>\n<blockquote>\n<p>This SHALL NOT include the Provenance associated with this current version of the resource. If that provenance is deemed to be a “relevant” change, it will need to be added as part of a later update. Until then, it can be queried directly as the Provenance that points to this version using _revinclude.</p>\n</blockquote>",
        "id": 153891956,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1496332885
    },
    {
        "content": "<p>There is a tracker out there that would solve this issue Michelle raises by allowing the referring object to be contained by the referenced object.   Not sure of its whereabouts or status. </p>",
        "id": 153891983,
        "sender_full_name": "Eric Haas",
        "timestamp": 1496351839
    },
    {
        "content": "<p>Question #1<br>\nWhy is the multiplicity range of <code>Medication.package.batch</code> 0..* and not 0..1? </p>\n<ul>\n<li>Is it to allow an inventory to record in one resource instance that it has several batches of the same medication?</li>\n<li>Is it to allow recording of different lot numbers for the same batch, maybe in different formats?</li>\n<li>Is it a mistake?</li>\n</ul>\n<p>Question #2<br>\nWhy is <code>Medication.package</code> a <code>backboneElement</code>?  As <code>package</code> has multiplicity range 0..1, its contents could be normalised into <code>Medication</code>.</p>\n<ul>\n<li>Is it to make it easy to prohibit package information in profiles?</li>\n</ul>",
        "id": 153892040,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1496383713
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> ?</p>",
        "id": 153892113,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1496415177
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191682\">@Richard Townley-O'Neill</span> The medication.package.batch is 0..* as you can have multiple batches of a medication but it is expected that each batch would have a single lot and expiry date, so they are both 0..1.   I'm not sure about medication.package.  As I look at it now, I wonder if the cardinality is wrong and that it should be 0..*  I think you could have a medication (like Amoxicillin 250mg capsules) that comes in multiple packages.  There are a number  of outstanding changes for medication. I would suggest you add tracker items for the changes/questions you have.  </p>",
        "id": 153892662,
        "sender_full_name": "Melva Peters",
        "timestamp": 1496840837
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> From what you've written and another look at the resource, I take it that the idea is to have one <code>Medication</code> instance for each medication trade product pack (e.g. aspirin 320mg, bayer, bottle of 100). So <code>package</code> is 0..1 and not 0..* . As there may be several batches of interest (say those in current stock) for the one medication trade product pack, <code>batch</code> is 0..* . And the 0..* is to record identifiers for several batches, not to record alternate identifiers for the same batch. So the answer to my question 1 is suggestion 1.</p>",
        "id": 153893223,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1497241690
    },
    {
        "content": "<p>I started this in the Australian thread, but I think that it is of more general interest.<br>\nI want to record barcodes for medications. The primary interest is in the supply chain unique product identifier ( a GTIN, represented as a GS1 linear barcode). As GTINs are assigned for both packages and individual medications, I need to record it at both the Medication and the Medication.package level.<br>\nI'm temped to record GTINs as codes, but maybe they should be recorded analogously to UDIs in <a href=\"http://build.fhir.org/device.html#resource\" target=\"_blank\" title=\"http://build.fhir.org/device.html#resource\">Device</a>.</p>",
        "id": 153894644,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1498010419
    },
    {
        "content": "<p>If GTINs are represented as codes, the product level GTIN can go in <code>Medication.code</code>, and an extension will be needed for the containered product, say <code>Medication.package.code</code>. With <code>Coding.system</code> = <a href=\"http://www.gs1.org/gtin\" target=\"_blank\" title=\"http://www.gs1.org/gtin\">www.gs1.org/gtin</a>.<br>\n.<br>\nIf GTINs are treated the same way as UDIs in Device, the backbone element from device is adapted to GTIN and used twice in the extension as <code>Medication.upi</code> and <code>Medication.package.upi</code>.<br>\n.  <br>\nAny thoughts?</p>",
        "id": 153894645,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1498010430
    }
]