[
    {
        "content": "<p>Hello.<br>\nWhat element can be used to store information about the protocol number of the medical commission (protocol number and date) that allowed the free prescription to be issued in the MedicationRequest resource?<br>\nUnder a free prescription it means that the patient will receive the drug for free.</p>",
        "id": 240324605,
        "sender_full_name": "Nata Samarina",
        "timestamp": 1622035945
    },
    {
        "content": "<p>This sounds like Coverage.  Use the <a href=\"http://MedicationRequest.insurance\">MedicationRequest.insurance</a> element to point to the Coverage resource.  The Coverage resource would indicate the 'program' that's going to pay for this.  If you need a per-prescription authorization, then you'd link to ClaimResponse which is used to cover prior authorizations.</p>",
        "id": 240327998,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622037307
    },
    {
        "content": "<p>Hello<br>\nHow can i create a MedicationRequest that support more than one Medication reference</p>",
        "id": 271955110,
        "sender_full_name": "Tommy Vu",
        "timestamp": 1644921669
    },
    {
        "content": "<p>Could you elaborate as to why you'd need that?</p>",
        "id": 271962482,
        "sender_full_name": "René Spronk",
        "timestamp": 1644925869
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 271971334,
        "sender_full_name": "René Spronk",
        "timestamp": 1644930724
    },
    {
        "content": "<p>i want to create one request with different medication</p>",
        "id": 271977518,
        "sender_full_name": "Tommy Vu",
        "timestamp": 1644933812
    },
    {
        "content": "<p>That would be several MedRequests. One request is one medication (at most a single mix of medication)</p>",
        "id": 271987042,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1644937559
    },
    {
        "content": "<p>Essentially a MedicationRequest is created with a granularity of what can be administered as a single dose.  If you're ordering multiple meds that will be administered as separate doses, that's multiple MedicationRequest instances - though you can give them all a common groupIdentifier to indicate they were ordered as part of the same action.  If you want a group of medications that must be suspended or cancelled as a collective, you can use RequestGroup to wrap them (e.g. a complex chemo regimen where you can't mess with one part without messing with everything).</p>",
        "id": 271990554,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644939030
    },
    {
        "content": "<p>clear, thank a lot</p>",
        "id": 272066108,
        "sender_full_name": "Tommy Vu",
        "timestamp": 1644978042
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> and colleagues, I am unclear of difference between MedicationRequest and MedicationOrder. Also, unclear what role create a MedicationRequest vs MedicationOrder. Thanks for your help.</p>",
        "id": 273852390,
        "sender_full_name": "Farrukh Najmi",
        "timestamp": 1646244840
    },
    {
        "content": "<p>They are the same thing. MedicationOrder is in FHIR DSTU2 and then it got renamed to MedicationRequest in newer versions (STU3, R4 and R5 in the future etc)</p>",
        "id": 273853297,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1646245217
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> ! So is there any scenario where a Patient would create a MedicationRequest / MedicationOrder? It seems not and they should only be created by a Practitioner. Am I right?</p>",
        "id": 273853738,
        "sender_full_name": "Farrukh Najmi",
        "timestamp": 1646245421
    },
    {
        "content": "<p>They can be created by patient to report self-prescribed meds: <a href=\"https://www.hl7.org/fhir/us/core/MedicationRequest-self-tylenol.html\">https://www.hl7.org/fhir/us/core/MedicationRequest-self-tylenol.html</a> (at least if you use the US Core implementation guide)</p>",
        "id": 273854584,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1646245786
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193915\">@Farrukh Najmi</span> !!   Yes, MedicationOrder is the 'previous version' (if you will) of MedicationRequest but they are not \"the same\".  In other words, there are many different properties in MedicationRequest that didn't exist or have been renamed between MedOrder (DSTU2) and MedicationRequest (R4).    To see these changes you can use these FHIR spec pages (version diffs) described in FHIRpath, but this has to be done in \"2 passes\" --- diff between STU3 and DSTU2 and then diff between R4 and STU3:</p>\n<p><a href=\"https://hl7.org/fhir/stu3/medicationrequest-version-maps.html\">https://hl7.org/fhir/stu3/medicationrequest-version-maps.html</a> -- STU3 to DSTU2 diffs<br>\n<a href=\"https://hl7.org/fhir/r4/medicationrequest-version-maps.html\">https://hl7.org/fhir/r4/medicationrequest-version-maps.html</a> -- R4 to STU3 diffs</p>\n<p>A couple of examples of differences:</p>\n<p>DSTU2 MedicationOrder.patient is the reference to the patient that this order is for,<br>\nR4 Medication.subject is the reference to the patient as above, so this essentially a property name change</p>",
        "id": 273861182,
        "sender_full_name": "John Silva",
        "timestamp": 1646248294
    },
    {
        "content": "<p>A patient can create a MedicationRequest with an intent of proposal.  A patient would never create a request that would be acted on by a pharmacy.  It would be a proposal to a prescriber or in the case of US Core, it is a self reported medication.</p>",
        "id": 273890478,
        "sender_full_name": "Melva Peters",
        "timestamp": 1646261579
    }
]