[
    {
        "content": "<p>We have a scenario where a patient is prescribed a medication to be taken \"three times daily\", but we've already got dosage instructions in our MedicationStatement resource broken down in to three separate timings.</p>\n<p>Where would we put the original definition of \"three times daily\" in the resource?</p>",
        "id": 153870924,
        "sender_full_name": "Pramod Dematagoda",
        "timestamp": 1486675410
    },
    {
        "content": "<p>.dosage.timing</p>",
        "id": 153870925,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486676815
    },
    {
        "content": "<p>So as a fourth timing element in addition to the other three?</p>",
        "id": 153870930,
        "sender_full_name": "Pramod Dematagoda",
        "timestamp": 1486678377
    },
    {
        "content": "<p>what are the other timings?</p>",
        "id": 153870932,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486678651
    },
    {
        "content": "<p>The other timings would be \"1 tablet at breakfast\", \"1 tablet at lunch\" and \"1 tablet at dinner\".</p>",
        "id": 153870934,
        "sender_full_name": "Pramod Dematagoda",
        "timestamp": 1486679559
    },
    {
        "content": "<p>In my experience you would typically say \"Take one tablet three times daily\" - which as <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> indicated would go in timing.  And then in the \"additionalInstructions\" you would say \"in the morning\", \"at lunch\" and \"at dinner\".  </p>",
        "id": 153870940,
        "sender_full_name": "Melva Peters",
        "timestamp": 1486683968
    },
    {
        "content": "<p>You can use Timing.repeat.when to indicate \"at meals\" </p>",
        "id": 153870982,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1486739754
    },
    {
        "content": "<p>I may not grasp the use case. But sounds to me like 'prescription' and 'medication statement' are two separate resources containing information about potentially the same drug intake. <br>\nThe medication statement contains the patient view: apparently the patient recorded that the drug is taken at breakfast/lunch/diner, for which timing.repeat.when seems to fit well indeed<br>\nThe prescription (MedicationRequest in STU3) contains the doctor's intentions, which in this case can simply say 3 times a day.</p>",
        "id": 153870987,
        "sender_full_name": "Arianne van de Wetering",
        "timestamp": 1486742014
    },
    {
        "content": "<p>MedicationStatement is intended as a high-level summary that would span multiple prescriptions.  Essentially it's saying \"patient is on med X\".  Typically it'll be less formally coded</p>",
        "id": 153871034,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486759897
    },
    {
        "content": "<p>To clarify the use case we have, when a clinician enters a medication that a patient is currently taking (either patient reported or something that the clinician is prescribing), they are able to specify a frequency for the medication (i.e twice daily, three times daily). But in addition to the overall frequency of the medication, they are able to define the times of the day when that medication is intended to be taken.</p>\n<p>For example a medication that is supposed to be taken \"twice daily\", the clinician has the option to specify \"1 tablet at breakfast\" and \"1 tablet at bedtime\".<br>\nWe want to represent this medication as a MedicationStatement, to that end what we do right now is represent the \"1 tablet at breakfast\" and \"1 tablet at bedtime\" as two entries in MedicationStatement.dosage.timing (there's appropriate when codes for that), but the dilemma we're facing is in representing the overall \"twice daily\" bit that the clinician has explicitly entered.<br>\nWe could represent the overall frequency as a third entry in MedicationStatement.dosage.timing, but would a consumer of that resource be able to make sense of this, where there is both an \"overall\" and \"broken down\" version of timings?</p>\n<p>Another thing is that we're representing this information using FHIR DSTU2.</p>",
        "id": 153871148,
        "sender_full_name": "Pramod Dematagoda",
        "timestamp": 1486936503
    }
]