[
    {
        "content": "<p>Quick question about medication status:</p>\n<p><a href=\"http://hl7-fhir.github.io/medicationstatement.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/medicationstatement.html\">http://hl7-fhir.github.io/medicationstatement.html</a></p>\n<p>Is there a reason why \"on hold\" is not present? Speaking to several clinicians they state that on hold is a valid status (i.e. stop this med temporarily until tomorrow's surgery is completed). </p>",
        "id": 153823435,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461775063
    },
    {
        "content": "<p>Hi Rick, I think this is bevause MedicationStatement is not a workflow-type of resource like MedicationOrder or MedicationAdministration (which both have on-hold). The Statement is a statement by for example the Patient that he has been/is using medication. So \"on-hold\" is pretty meaningless for such a statement. Or as the spec says: </p>\n<blockquote>\n<p>There is no required date/time when the medication was administered, in fact we only know that a source has reported the patient is taking this medication, where details such as time, quantity, or rate or even medication product may be incomplete or missing or less precise.</p>\n</blockquote>",
        "id": 153823437,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1461776610
    },
    {
        "content": "<p>But if you look at MedicationStatement as representative of a documented med list, on hold is a valid current status. </p>",
        "id": 153823438,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461776672
    },
    {
        "content": "<p>A patient could certainly state \"I was on this med, but my doctor said to stop it until X date because of Y\". </p>",
        "id": 153823439,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461776745
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> . Seems like a perfectly valid example of statement.</p>",
        "id": 153823440,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1461776958
    },
    {
        "content": "<p>Pharmacy WG has been reviewing the statuses of all resources - I would suggest you add a tracker item.  There is a way to say that the medication statement is active but that the patient did not take - the exemplar value set is weak at the moment but could be strengthened to add codes such as \"admitted to hospital\" or \"surgery\".</p>",
        "id": 153823441,
        "sender_full_name": "Melva Peters",
        "timestamp": 1461777290
    },
    {
        "content": "<p>I'll add the tracker</p>",
        "id": 153823443,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461777819
    },
    {
        "content": "<p>Sad that the current binding of MedicationStatement.status is required :(. </p>",
        "id": 153823444,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461777849
    },
    {
        "content": "<p><a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9901\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9901\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=9901</a></p>",
        "id": 153823449,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461778987
    },
    {
        "content": "<p>Added</p>",
        "id": 153823450,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461778990
    },
    {
        "content": "<p>You could model it as status of \"active\" with an extension conveying the \"suspended\" nuance if you wished.</p>",
        "id": 153823451,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461779005
    },
    {
        "content": "<p>I agree that's the work around for now, but long term the clinicians I have spoken to say that on-hold is pretty common, and an extension approach seems insufficient. </p>",
        "id": 153823454,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461779067
    },
    {
        "content": "<p>I think it's a granularity question.  How time-specific is a medication statement expected to be?</p>",
        "id": 153823455,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461779138
    },
    {
        "content": "<p>Will be an interesting discussion within the Pharmacy WG.</p>",
        "id": 153823456,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461779148
    },
    {
        "content": "<p>Agreed. Maybe a topic for the clinical connectathon to discuss as well. </p>",
        "id": 153823457,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461779183
    },
    {
        "content": "<p>Note: in C-CDA this is represented as \"suspended\". </p>",
        "id": 153823458,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461779286
    },
    {
        "content": "<p>So maybe that's the better term vs. \"on-hold\". </p>",
        "id": 153823459,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461779390
    },
    {
        "content": "<blockquote>\n<p>Will be an interesting discussion within the Pharmacy WG.</p>\n</blockquote>\n<p>Yes. it  be interesting to see whether if you need to communicate that you have suspended taking medication at some time for some reason, you'd also have a use to record when you continued. And what happens if you stop/continue multiple times. </p>",
        "id": 153823460,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1461779619
    },
    {
        "content": "<p>I'm thinking about this from a document perspective (as usual). If I need to create a document bundle that accurately represent the patient's med list today, and the patient currently has a medication that is on hold, how to I encode it? </p>",
        "id": 153823484,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461783414
    },
    {
        "content": "<p>If I had on hold or suspended as a code in MedicationStatement.status, I would just replace that MedicationStatement when the status changed. </p>",
        "id": 153823485,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461783464
    },
    {
        "content": "<p>(i.e. a PUT on the resource, versioning it). </p>",
        "id": 153823486,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1461783500
    },
    {
        "content": "<p>Well, one possibility is to mix statements and orders - because \"on hold\" generally relates to orders.  Though I suppose there may be circumstances where it's driven by patient choice.</p>",
        "id": 153823538,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461818473
    },
    {
        "content": "<p>you could have a medication statement indicating that you usually take aspirin - but it is on hold for an operative procedure...</p>",
        "id": 153823539,
        "sender_full_name": "David Hay",
        "timestamp": 1461818592
    },
    {
        "content": "<p>That probably would have been ordered though.</p>",
        "id": 153823540,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1461818689
    },
    {
        "content": "<p>but if the statement was part of the patients 'usual meds', you need to do something with it...</p>",
        "id": 153823541,
        "sender_full_name": "David Hay",
        "timestamp": 1461818783
    },
    {
        "content": "<p>this seems extra hard to me - if a medication order can be suspended, how can a statement about what medications a patient is on not include 'I'm on a medication that is suspended'</p>",
        "id": 153823550,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1461824141
    },
    {
        "content": "<p>'cause I usually take aspirin, but my surgeon told me to stop for the week before my operation...  I'll take it again once my operation is done.</p>",
        "id": 153823585,
        "sender_full_name": "David Hay",
        "timestamp": 1461828877
    },
    {
        "content": "<p>I'm still puzzled why we bake these kind of things into a code within the resource.  If we get the list wrong, there are local variances or systems choose to use terminology for this - it just adds complications.</p>",
        "id": 153823591,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1461844760
    },
    {
        "content": "<p>We struggle with MedicationStatement frequently because it can be a mix of derived information (from the MedicationOrder itself) and explicit patient compliance statements (e.g. whether the patient is taking the ordered/OTC med or not).</p>\n<p>We based our current mappings on the January WGM meeting discussion with Pharmacy WG where the following table was defined as part of a discussion around <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8010\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8010\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8010</a></p>\n<p>MedicationStatement.status + MedicationStatement.wasNotTaken = meaning<br>\nActive + T = Not currently taking <br>\nCompleted + T = Not taken in the past<br>\nIntended + T = No intention of taking<br>\nActive + F = Taking, but not as prescribed<br>\nActive + F = Taking<br>\nIntended + F = Will be taking (not started)<br>\nCompleted + F = Taken in past<br>\nIn Error + N/A = In Error</p>\n<p>As such, for any MedicationStatement derived from an on-hold MedicationOrder, our current logic looks like:</p>\n<ul>\n<li>Active + wasNotTaken = T (if we believe the patient previously took the med before being suspended)</li>\n<li>Intended + wasNotTaken = F (if we believe the patient didn't previously take the med before being suspended)</li>\n</ul>",
        "id": 153823812,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1461946190
    },
    {
        "content": "<p>I'm troubled by the value \"entered-in-error\" in MedicationStatement.status.<br>\nThe definition of status implies that this is the status of use of the medicine, not the status of the MedicationStatement record. <br>\n\"A code representing the patient or other source's judgment about the state of the medication used that this statement is about. Generally this will be active or completed.\"<br>\nHowever the binding suggests this is about the record : A coded concept indicating the current status of a MedicationStatement.\"<br>\nAnd the values are about the use of the medicine, except for one (entered-in-error), which is about the record. </p>\n<p>I think that there are two concepts here that should not be blended. The data element should be renamed from \"status\" to \"useStatus\", the value \"entered-in-error\" should be removed and, if required, a new data element should be added to capture \"entered-in-error\". It might be boolean or a coded.</p>",
        "id": 153847312,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1473904782
    },
    {
        "content": "<p>or, more simply, the definition could be amended a little. Is there any point in having both a status and 'entered-in-error'?</p>",
        "id": 153847335,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473932635
    },
    {
        "content": "<p>There are two concepts here. One is the status of the use of the medication and the other is the status of the statement. Putting both two concepts into the one data element is always a bad idea. <br>\nHow will \"entered-in-error\" be used? <br>\nOne case is is to update a resource instance to say that it is a mistake. <br>\nAnother case is to include in a list of records that were entered, some sort of history. <br>\nOn the current design this will overwrite the original status of active/intended/completed etc. If it is worth keeping the original record at all it might be worth keeping knowledge of the original status. That suggests that an extra data element is required, if it is worth saying \"entered-in-error\" at all.</p>",
        "id": 153847430,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1473987768
    },
    {
        "content": "<p>is it worth keeping? why? I didn't see any actual reason in what you wrote. </p>",
        "id": 153847510,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474067036
    },
    {
        "content": "<p>I suggest that a tracker item be added and assigned to Pharmacy so that a discussion can be held.</p>",
        "id": 153847806,
        "sender_full_name": "Melva Peters",
        "timestamp": 1474129575
    },
    {
        "content": "<p>Now in tracker at <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12011\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12011\">http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=12011</a> </p>",
        "id": 153849498,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1474266483
    }
]