[
    {
        "content": "<p>In the FHIR resource for MedicationRequest we believe that the Request could be based on a MedicationStatement. In the FHIR specification the situation is reversed. You could base av MedicationStatement on a MedicationRequest but not the other way around (which makes perfect sense if you want to document what has actually happened).</p>\n<p>In our use case in Norway we believe the natural way to use these resources is that a Statement exists first \"[patient] will be taking the medication in the future\". And if a MedicationRequest is needed to order the medication from a pharmacy, reimbursement e.g. a MedicationRequest could be created based on the intention documented in the MedicationStatment. </p>\n<p>Part of the use-case in Norway is to establish a sentral repository of MedicationStatements, documenting all the medications the patient is currently using, whether they are requested or not. All relevant healthcare personnell should have acces to the list and could edit it to remove medications not relevant any more, add new medications or record medications the patient is (or should be) using.</p>\n<p>You could of course argue that a intention or medication plan should be expressed as a CarePlan Resource instead, the CarePlan does not really support an elaborate recording of Medications, and only makes it possible to record MedicationRequests in any detail as detailed dosage information is missing from that Resource.</p>\n<p>The documentation of the MedicationStatement resource expresses the possibility of using that resource to document the intention of a patient taking the medicine in the future. The documentation goes on only to elaborate how the Resource is to be used for documentation purposes of passed events, that is a bit confusing. </p>\n<p>We would like some advice on how to go on covering our use-cases. We could for example propose changes to the MedicationStatement and MedicationRequest resources (include reference to the MedStatement from MedRequest, and some documentation changes to the MedicationStatment resource, to elaborate how the resource could be used to express an active medication list).</p>",
        "id": 154008493,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1539343058
    },
    {
        "content": "<p>Proposals and plans for a patient to be on a medication are still expressed using MedicationRequest.  MedicationStatement isn't a reflection of what \"should be\" or \"what's desired\".  It's a summary of \"what is\" or \"what has been\".</p>",
        "id": 154008530,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539353494
    },
    {
        "content": "<p>Future statements in MedicationStatement are based on what's already ordered or stated intention of the patient, not clinician planning/intention.  We should probably clarify that in the description.  <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> ?</p>",
        "id": 154008531,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539353637
    },
    {
        "content": "<p>We have a tracker item to update the scope and description of MedicationStatement.  I can include medications that are planned to be taken - like a patient saying I'm not taking this now, but I will be taking it in allergy season</p>",
        "id": 154008533,
        "sender_full_name": "Melva Peters",
        "timestamp": 1539353697
    },
    {
        "content": "<p>But it isn't intended for planning...it is statements about the medication the patient is taken, has taken or will be taking in the future (there would already be a medicationRequest if it needed one).</p>",
        "id": 154008534,
        "sender_full_name": "Melva Peters",
        "timestamp": 1539353764
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span> I think Switzerland has followed a similar approach to what you are stating. I don't know if those documents are public. <br>\nBasically they needed something that represents a medication treatment, regardless of what is the trigger behind that treatment - a prescription, or a dispense, or an intake/administration..<br>\nWithin that context, I subscribe to the message from Lloyd and Melva:  the implementation of a planned medication would be with a medication Request.<br>\nThere is no clear guidance on whether/how a \"medication treatment\" is expressed in FHIR  and I am not sure there should be one. AFAIK, it is not the purpose of Statement to cover that.</p>",
        "id": 154008800,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1539465701
    },
    {
        "content": "<p>Thank you for your feedback. I will bring it back to the team do discuss how we want to move forward with this case. I do understand that the intention of MedicationStatement is not a medication plan as such. But I still don't feel that MedicationRequest is the best way to represent such a plan in regards to the way this resource is documented today. I will pitch CarePlan back to the team and see how they respond, I don't think they will like it much :-) </p>\n<p>The concept the team want to express is what medication the patient is (or should be) taking. In my mind this is the \"what is\" case <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nSome of this information might not have a medication request to represent it, at least the way things work, planned medication could however be expressed with a MedicationRequest with intent set to plan instead of order.</p>\n<p>The MedicationStatement documentation is somewhat misleading I think. <br>\nDo you have the tracker-id for updating the doc <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> ?<br>\nAre there any work going on with this tracker #19365] Summary: Work on defintion for Active Medication List?</p>",
        "id": 154008914,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1539510692
    },
    {
        "content": "<p>In Switzerland and then IHE we had the challenge to cover the patient-centered (not workflow-centered) medication list. We needed to express the several \"medication treatments\" the patient had throughout their life, regardless if it starts with a request (patient is prescribed some medication), or if the plan is triggering the prescriptions (e.g. chronic medication treatment plan from which physicians derive prescriptions).</p>",
        "id": 154008955,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1539543947
    },
    {
        "content": "<p>which i believe is your use case. IHE implementation (CDA-based) is active in Switzerland, later IHE will be mvong that to FHIR.</p>",
        "id": 154008956,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1539544183
    },
    {
        "content": "<p>between carePlan and medicationRequest with intent=plan, i would go for medicationRequest</p>",
        "id": 154008957,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1539544241
    },
    {
        "content": "<p>sorry for joining late on this topic, we used MedicationStatement to model an entry in a medication plan in the project emediplan plan (see <a href=\"http://chmed16af.emediplan.ch/\" target=\"_blank\" title=\"http://chmed16af.emediplan.ch/\">http://chmed16af.emediplan.ch/</a>). We thought \"A MedicationStatement may indicate that the patient may be taking the medication now, or has taken the medication in the past or will be taking the medication in the future.\" fits that purpose. We based our choice also on german project \"Medikationsplanplus\" which uses also a profile on MedicationStatement (<a href=\"https://simplifier.net/medikationsplanplus/medicationstatement-1\" target=\"_blank\" title=\"https://simplifier.net/medikationsplanplus/medicationstatement-1\">https://simplifier.net/medikationsplanplus/medicationstatement-1</a>) <span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> or <span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span>  might have additional information about it.</p>",
        "id": 154009047,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1539592565
    },
    {
        "content": "<p>Right. In \"Medikationsplan Plus\" MedicationStatement is used as Lloyd described above.<br>\nWe had some discussions regarding the Medication* resources, but in the end it's quite clear that MedicationRequest/-Dispense/-Administration are the workflow oriented resources, while MedicationStatement ist just that: a statement about a patient having taken / currently taking / taking under certain conditions some medication.</p>\n<p>I think for workflow orientation, a CarePlan or a MedicationRquest with intent=plan would be appropriate here.</p>",
        "id": 154009056,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1539596630
    },
    {
        "content": "<p>just to be sure of interpretations: <br>\nIMO physician saying \"the patient should be in this medication, and someone will make the needed prescriptions etc\" is not a MedicationStatement.</p>",
        "id": 154009371,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1539671257
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191436\">@Stefan Lang</span> <br>\n\"MedicationStatement ist just that: a statement about a patient having taken / currently taking / taking under certain conditions some medication.\"<br>\nSo why could the MedicationReqest not be based on a MedicationStatement, if we want to express that a request is actually based on a statement that the medication should be taken by a patient under certain conditions?</p>",
        "id": 154009375,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1539672976
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191478\">@Oliver Egger</span> <br>\nThank you for the information about the swiss project. Seems very similar to the way we look at medication plan in the norwegian project. That is probably why we both ended up using the MedicationStatment resource. In our plan we don't want to record only requests that are part of the clinical workflow but also medications that the patient is taking  without a formal MedicationRequest from som practitioner. The medicationRequest resource clearly don't fit the bill as it is clearly not intended for medications that is not requested by a practitioner. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span></p>",
        "id": 154009377,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1539673989
    },
    {
        "content": "<blockquote>\n<p>just to be sure of interpretations: <br>\nIMO physician saying \"the patient should be in this medication, and someone will make the needed prescriptions etc\" is not a MedicationStatement.</p>\n</blockquote>\n<p>Well, it is a statement about the use of some medication. I still feels that the name and definition of this resource is highly misleading. It might be that the interpretation of it (or intent) are to restricting. We currently have several use-cases where the request can't be used for medication entries in a medication plan.</p>\n<p><span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> do you have the ticket number for the new wording for the medicaitonstatment resource?</p>",
        "id": 154009378,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1539674553
    },
    {
        "content": "<p>I understand that the MedStatement is broad enough in its title that it can lead to these discussions. Can you give an example of a use case where a request can't be used for medication entries in a plan? Note that a request is not necessarily a \"prescription\" (whatever \"prescription\" means). A request can be a plan, a proposal, a suggestion, a prescription, a validated order...</p>",
        "id": 154009383,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1539677221
    },
    {
        "content": "<p>I do understand that the MedicationRequest can have intent plan and proposal. However the definition of MedicationRequest resource is not as broad, and don't mention the use of MedicaitonRequest as a planning tool at all. The description elaborates on the use of this resource as an actual order. <br>\nThe description of a Request type resource has a much broader definition of what a request can be used for, and do include the planning purposes, this description is however not mirrored in the MedicationRequest description. This fact leads the reader to believe that the MedicaitonRequest is only used for prescription like workflows and that the resource is not suited for use-cases concerning Patient medication plans or active medication linsts that should also contain elements descriping medications taken by the subject without an actual request.</p>\n<p>I can not even se how it is possible to make an instance of the MedicationRequest represent a medicine the subject is currently using without an actual order. So for the patient medication list of medication the subject is currently using it still does not fit the bill.</p>",
        "id": 154009388,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1539684961
    },
    {
        "content": "<p>MedicationStatement doesn't say \"should be\".   MedicationStatement doesn't imply appropriateness - it implies patient current practice.  If you want to describe \"should be\" that's either a plan or recommendation - both of which are conveyed by CarePlan and MedicationRequest.</p>",
        "id": 154009403,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539699065
    },
    {
        "content": "<p>Can you raise a change request for us to better explain the differences between MedicationRequest and MedicationStatement?  And provide some planning/proposal examples of the former?</p>",
        "id": 154009404,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539699126
    },
    {
        "content": "<p>Asserting that a medication should be taken would be a MedicationRequest with intent=plan (or proposal.<br>\nThe MedicationRequest with intent=order can be basedOn that one.</p>\n<p>basing a MRequest on a MStatement would express something like \"the patient should take that medication because he always did\".</p>",
        "id": 154009496,
        "sender_full_name": "Stefan Lang",
        "timestamp": 1539715325
    },
    {
        "content": "<blockquote>\n<p>Asserting that a medication should be taken would be a MedicationRequest with intent=plan (or proposal.<br>\nThe MedicationRequest with intent=order can be basedOn that one.</p>\n<p>basing a MRequest on a MStatement would express something like \"the patient should take that medication because he always did\".</p>\n</blockquote>\n<p>What I want to express in that use-case is not that there is a plan or proposal to order(or use) the medicine but the fact that the patient actually uses the medication with or without any active or future order. I can not se that MRequest actually supports that use-case.</p>\n<p>A request does not express a plan to dispense or administer a medication only the intent of ordering that medication. It should of course include instructions for administering the medication and thereby expresses the intention that the subject should in fact consume the medication, but the focus is on the Request, or plan to request part i believe. This makes it hard to convey the fact that the patient uses medictaions with no orders connected to it.</p>\n<p>I think if you base a MRequest on a MRStatement that would express that the patient is currently using some medication (or have been using it in the past) and now we want to order some more of that medication. That would be a perfectly valid use-case in my opinion. Bear in mind that not all medication use is based on an actual previous request.</p>",
        "id": 154009729,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1539764877
    },
    {
        "content": "<blockquote>\n<p>MedicationStatement doesn't say \"should be\".   MedicationStatement doesn't imply appropriateness - it implies patient current practice.  If you want to describe \"should be\" that's either a plan or recommendation - both of which are conveyed by CarePlan and MedicationRequest.</p>\n</blockquote>\n<p>Yes I do agree on the planning part, it was my bad to go into the planning discussion. Even if the Patient medication list (thats what they call it in Norway) could be used as a planning tool, it should express what the patient is using at the moment.</p>\n<blockquote>\n<p>Can you raise a change request for us to better explain the differences between MedicationRequest and MedicationStatement?  And provide some planning/proposal examples of the former?</p>\n</blockquote>\n<p>Yes, I will try to do so as soon as possible. I guess this goes into GForge then.</p>",
        "id": 154009731,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1539765090
    },
    {
        "content": "<p>MedicationStatement does reflect what's actively used.  However, it's uncommon to prescribe on the basis of \"the patient uses this\".  Prescriptions are based on a clinical judgement that a patient <em>should</em> use something.  While the ideal is that the patient only uses what they should use, the reality is that patients sometimes use things they shouldn't (or at least for which there is no clinical justification) and sometimes don't use things they should.</p>",
        "id": 154009806,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1539787397
    }
]