[
    {
        "content": "<p>In the MedAdmin resource there doesn't seem to be an obvious way to determine the units of measure for the dose delivered, only a SimpleQuantity.  Is the expectation that the consumer of this message needs to have a reference to the MedicationRequest to figure this out?   Also, how would strength of a drug be represented; this also doesn't seem to be there in MedAdmin.     In HL7 V2 the RXA segment (part of RAS message) had a way to represent all of these things, e.g. RXA-7 for Admin Units, RXA-13 Admin Strength, etc.</p>",
        "id": 161955082,
        "sender_full_name": "John Silva",
        "timestamp": 1553781828
    },
    {
        "content": "<p>SimpleQuantity includes units...</p>",
        "id": 161957866,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553783517
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  -- OK, I now see that SimpleQuantity (<a href=\"http://hl7.org/fhir/STU3/datatypes.html#SimpleQuantity\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/datatypes.html#SimpleQuantity\">http://hl7.org/fhir/STU3/datatypes.html#SimpleQuantity</a>) is 'derived from' Quantity (with some kind of constraints).   The reason I couldn't figure this out is because on the FHIR webpage, it has the constraint but doesn't have a hyperlink to the Quantity resource; that's what led me 'astray'.   </p>\n<p>OK, so this would answer the question about Units of Measure but does it answer the question about how to represent the drug's strength?  Not sure the strength is only from the order because the nurse can be adjusting the strength during the order 'lifecycle' (think of an infusion pump)</p>",
        "id": 161960940,
        "sender_full_name": "John Silva",
        "timestamp": 1553785382
    },
    {
        "content": "<p>Strength is a characteristic of the Medication.  You need to look at the ingredients.  If a medication has multiple active ingredients, it will have a distinct \"strength\" for each.</p>",
        "id": 161961253,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553785562
    },
    {
        "content": "<p>strength is fixed for a medication. The nurse may change the concentration.</p>",
        "id": 161985985,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553802207
    },
    {
        "content": "<p>for infusions, what the nurse is giving is not \"hyoscine butylbromide 20 mg /ml\" but \"1 ampoule of hyoscine butylbromide 20 mg / ml diluted in saline\"</p>",
        "id": 161986504,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553802621
    },
    {
        "content": "<p>this solution is actually the product you put in MedicationAdministration.medication.</p>",
        "id": 161986538,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553802654
    },
    {
        "content": "<p>and that medication has those 2 ingredients.</p>",
        "id": 161986599,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553802719
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  - that makes sense, I didn't think the strength could change once the drug, e.g. in an infusion bag, is mixed.  (not sure about what can be changed in the example of an infusion pump but for sure, there are piggy-back drugs given on infusion lines though I suspect those would be reported as a separate admin from the 'main solution' being delivered.)    So, would a client of the Med Admin need to reference the Medication resource (and ingredients property) to determine how much of the drug was actually given in the specified time period, e.g. 1 hour?  In other words, if the MedAdmin for an infused drug documents the X ml (of a particular concentration) the client would need to go to the Med info to figure out how to multiply the concentration by the rate to determine actual amount of drug given?</p>",
        "id": 162031913,
        "sender_full_name": "John Silva",
        "timestamp": 1553853418
    },
    {
        "content": "<p>To do calculations, you'll need to look up either the Medication or the MedicationKnowledge based on the code for the product(s) administered and look at the ingredients (and maybe look up the ingredients and see their ingredients if the referenced product is itself a compound).</p>",
        "id": 162052219,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553870867
    },
    {
        "content": "<p>Hmm, but that doesn't explain how to deal with an infusion that changes concentration.  The Medication or the MedKnowledge (from the Formulary) wouldn't change but for an individually charted volume, how would the client know the concentration used?  (this info was in V2 RAS in RXA and RXC segments -- just trying to find out how this is represented in FHIR, if it is?)</p>",
        "id": 162053702,
        "sender_full_name": "John Silva",
        "timestamp": 1553871735
    },
    {
        "content": "<p>If you're changing concentration (i.e. injecting more of the active ingredient into the bag), then you're stopping one administratration (of a custom compound with a particular set of ingredients) and starting a new one (of a custom compound  created by mixing a certain quantity of the original compound with an additional quantity of the active ingredient).</p>",
        "id": 162054068,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553872007
    },
    {
        "content": "<p>as Lloyd says. <br>\nthe administration points to a medication, but that medication is an ad-hoc product, it does not exist in the list of products.</p>",
        "id": 162075046,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553886128
    },
    {
        "content": "<p>Dobutamine 5 mg/ml (50 mg in 10 ml) diluted to a solution volume of 500 ml of NaCl</p>",
        "id": 162075063,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553886145
    },
    {
        "content": "<p>this is your medication.</p>",
        "id": 162075073,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553886158
    },
    {
        "content": "<p>In many cases, it is not really important to catch all the different events in the administration. It is only necessary to report the total volume administered and the time. For this, we simply state that during 48 minutes, we injected 500 ml of the solvent and 10 ml of the solute</p>",
        "id": 162075100,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553886187
    },
    {
        "content": "<p>in other cases you need to provide the details.<br>\nchanging concentration changes your \"mix\", so your main medication changes, even if it is a (different) composition of the other 2 medications.</p>",
        "id": 162075237,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553886326
    },
    {
        "content": "<p>anything that you need to capture as a change, you have a new medication.</p>",
        "id": 162075336,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553886380
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  --OK, so you're saying that every change in concentration is a new 'instance' of a medication?   I wonder what the IHE Infusion pump folks would  say about that?   It makes infusion pump changes very complicated to handle.   In my opinion you're not really changing the drug, you're only changing the concentration and therefore the amount of the drug (not the fluid) given over a period of time.  For example, if you needed to know or limit the amount of drug given, not just the volume (think of morphine).    It seems like this is much simpler to do in the HL7 V2 world where the strength and such is part of the administration  (RXA/RXC), no need to go look at some other thing (order or formulary) to figure out the amount of drug given.</p>",
        "id": 162085624,
        "sender_full_name": "John Silva",
        "timestamp": 1553895291
    },
    {
        "content": "<p>For infusions, the medication resource is the placeholder for the mixture. What happens if you change to a new batch of product during infusion, and you want to track it? What if you want to determine the injection flow through time, instead of \"just give me the total administered\"? I had these questions when handling contrast infusion.<br>\nIn my view, concentration is not an attribute of the administration, but of the medication, so FHIR actually works out better than V2 for simple cases and for more elaborate cases.</p>",
        "id": 162114855,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553940705
    },
    {
        "content": "<p>it is not that for every change in the product mix, you have a new medication product in the catalog (that would be bad). <br>\nIt is just that for every change, you report the product mix in the medication resource.</p>",
        "id": 162114910,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553940777
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194183\">@John Silva</span>  note that the above is what IHE Pharmacy has looked at. It was briefly discussed with HL7 Pharmacy but the IHE profile still needs updating.<br>\nAlso note that you can always have one administration for the entire treatment (IIRC we called it simplified report). You can chose - more or less information, and the approach is compatible so that you don't have to redesign when you want to change from one to the other.</p>",
        "id": 162115177,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553941245
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  - OK, that seems to make sense.   So, if I can draw an analogy to V2 -- it seems like the MedAdmin resource is like the RXA segment and the Medication.ingredients are like the set of RXC components in the infusion use model.    If this analogy makes sense, would the non-medicinal ingredients in the solution, e.g. normal saline, be in the Medication.ingredients array or not?</p>",
        "id": 162115307,
        "sender_full_name": "John Silva",
        "timestamp": 1553941514
    },
    {
        "content": "<p>Saline likely would as it's a key component in the \"custom compound\".  For manufactured drugs, you might only see active ingredients and (possibly) excipients that could be potential allergens or are otherwise deemed relevant for exposure -generally without quantities.</p>",
        "id": 162126060,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553960633
    },
    {
        "content": "<p>OK, it would be interesting to see how this would work with Infusion Pumps.   Would this mean that every adjustment to the Infusion pump would require a new Medication resource to be generated?    Seems pretty complicated.   (Wonder if the IHE Infusion Pump profile has looked at mapping to FHIR yet?)</p>",
        "id": 162128531,
        "sender_full_name": "John Silva",
        "timestamp": 1553964183
    },
    {
        "content": "<p>An infusion pump lets you change the rate.  Each change of the rate would be a distinct MedicationAdministration</p>",
        "id": 162130048,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553966043
    },
    {
        "content": "<p>MedAdmin is the RXA and the MSH and the NTE and a bit or ORC..., but yes, that is kind of the best analogy.<br>\nIngredient is indeed conveying pretty much the same concept as RXC. <br>\nWhether the saline would be in the ingredients - yes, if you need that information. If you just want a simple report of \"some drug diluted at 5% v/v\" then you may not even put the solvent there. <br>\nThe approach is always the same, you just put more data as you need it and can convey it.</p>",
        "id": 162134384,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553972110
    },
    {
        "content": "<p>your data needs can range from this<br>\n<a href=\"/user_uploads/10155/bRt4N4bf4QM3yIMaBik78K8k/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/bRt4N4bf4QM3yIMaBik78K8k/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/bRt4N4bf4QM3yIMaBik78K8k/pasted_image.png\"></a></div>",
        "id": 162134452,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553972251
    },
    {
        "content": "<p>to this<br>\n<a href=\"/user_uploads/10155/efwcBx0laqzcyVAGgTO4ZVWv/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/efwcBx0laqzcyVAGgTO4ZVWv/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/efwcBx0laqzcyVAGgTO4ZVWv/pasted_image.png\"></a></div>",
        "id": 162134456,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553972281
    },
    {
        "content": "<p>if you want to capture changes in the composition (adding a new product to a mix) - a new administration with a new medication<br>\nif you want to capture changes in the flow rate - a new medication</p>",
        "id": 162134518,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553972349
    },
    {
        "content": "<p>I believe that for machines this is easier and better to generate than for people. And infusion pumps are very smart today, they will do what we tell them to do, I hope.</p>",
        "id": 162134588,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553972443
    },
    {
        "content": "<p>and that is what I expect as the final outcome - from a pump or human entry: not only all those pump events, but how much medication is being pushed through to the patient.</p>",
        "id": 162134657,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1553972526
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span>  -- thanks!   That second graph looks like what 'come out of an Infusion pump' (from a data perspective).   I guess I don't think of these kind of changes from the infusion pump as 'changes in Medication' only the delivery mechanism (timing, rate, concentration), but OK.   If this is how the IHE will profile these kinds of infusions in FHIR, that's good, as long as there's a way for both the 'simple reporting' to the more 'complicated reporting' needed by some IT systems (e.g. MAR, CPOE, EHR, etc.)</p>",
        "id": 162175494,
        "sender_full_name": "John Silva",
        "timestamp": 1554040061
    },
    {
        "content": "<p>from the IHE Pharmacy side there was considerable effort to get to the edges of the problem to see that the model does not break, and yes, to make sure the same system can support both (or that you can capture the complex reporting and then provide a summary without changing your architecture or driving your developers insane)</p>",
        "id": 162176345,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554041329
    },
    {
        "content": "<p>i think there should be a DICOM supplement for administration of contrast and hopefully the approach is the same.</p>",
        "id": 162176363,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554041375
    },
    {
        "content": "<p>supplement 164. I remember the discussions and all was aligned but I haven't checked if the approach is still the same. Hope so.</p>",
        "id": 162176461,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1554041509
    },
    {
        "content": "<p>Just found this thread as i was searching guidance on \"infusions\".<br>\nDid i understood it correctly that i can't express: 2g ingredient X in 500mg Nacl solvent as: 2g x per 500 ml (ignoring the NaCl).<br>\nIf i want to create a compound medication, also containing NaCl as ingredient, i would create a medication instance with 2 ingredients:</p>\n<ul>\n<li>X: 2g/500ml</li>\n<li>NaCl: 4,5g/500ml</li>\n</ul>\n<p>This means that implementations have to do calculations. Or is there a way to express this without calculating?</p>",
        "id": 253605704,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1631808228
    },
    {
        "content": "<p>You shouldn't need to define the 4.5</p>",
        "id": 253616437,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631812393
    },
    {
        "content": "<p>In fact I think you shouldn't because you are not diluting in water but in NaCl 0,9%</p>",
        "id": 253616507,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631812435
    },
    {
        "content": "<p>I'd use</p>\n<ul>\n<li>X: 2 g (or 2g / 500 ml)</li>\n<li>Y: 500 ml</li>\n</ul>",
        "id": 253616804,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631812554
    },
    {
        "content": "<p>Where Y is not the code for the substance NaCl but the code for the product NaCl 0,9%</p>",
        "id": 253616914,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1631812593
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191832\">Jose Costa Teixeira</span> <a href=\"#narrow/stream/179166-implementers/topic/MedicationAdministration.20questions.3F/near/253616437\">said</a>:</p>\n<blockquote>\n<p>You shouldn't need to define the 4.5</p>\n</blockquote>\n<p>It is the amount of NaCl in H20 in the dilution. I can see the benefit of using product codes, but this is in a research context where every ingredient should be coded.</p>",
        "id": 253702745,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1631864229
    },
    {
        "content": "<p>So it is easier if i directly code a solution mixture.</p>",
        "id": 253702813,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1631864280
    },
    {
        "content": "<p>Ok, my understanding is that Y is a single traded product, right? Something you are not mixing yourself. If so, in the infusion you have 500 mg of Y. Then the definition of Y is 9 g/l.</p>",
        "id": 253944744,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1632057390
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> there are examples in the MedicationRequest resource that might help with your question.</p>",
        "id": 254044400,
        "sender_full_name": "Melva Peters",
        "timestamp": 1632142498
    },
    {
        "content": "<p>Thanks Melva. I studied all the examples, which helped me a lot.</p>",
        "id": 254044514,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1632142554
    },
    {
        "content": "<p>For compound medications which are simple: active ingredient in a solution Joses proposal was very good. <br>\nWe are now capturing the solvent with denominator 1 and nominator for the amount of solvent. Code = Saline Infusion or Aqua.</p>",
        "id": 254044770,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1632142666
    }
]